{"interestingcomments": [{"autor": "YZHSQA", "date": "2020-02-05 16:01:04", "content": "Fisheye lens for Canon Mirrorless Cameras? /!/ I have a canon M50; I am trying to get a fisheye photo (showing the full circle without crop).\n\nA. Is there a lens currently in the market can do it\nB. If not, I have a Canon 7D, is there a lens that can do it?\nC. If not, if I buy the mirrorless canon R, is there a lens that can do it?\n\nBasically, I have a Godox AD600, and I need to create a 360 HDRI image for 3D rendering. Ricoh Theta and Go Pro 360 do not trigger the flash. Any one has thoughts?", "link": "https://www.reddit.com/r/photography/comments/ezbnk5/fisheye_lens_for_canon_mirrorless_cameras/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "fisheye lens for canon mirrorless cameras? /!/ i have a canon m50; i am trying to get a fisheye photo (showing the full circle without crop).\n\na. is there a lens currently in the market can do it\nb. if not, i have a canon 7d, is there a lens that can do it?\nc. if not, if -----> i !!!  buy the mirrorless canon r, is there a lens that can do it?\n\nbasically, -----> i !!!  have a godox ad600, and -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a 360 hdri image for 3d rendering. ricoh theta and go pro 360 do not trigger the flash. any one has thoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 59381, "year": "2020"}, {"autor": "derivedpierrelouis", "date": "2020-02-05 08:19:26", "content": "Lighting Previs Software /!/ Starting last month, I decided to create a software named \"Studio\" using the unity engine to make previsualizations of lighting setups that I was learning on youtube, I can't afford nor do I have the resources to go and practice these setups in real life, so I decided to create it in a virtual one.\n\nIt is completely free, just download it from my website, open the zip file and drag and drop it where you want the files to go. It's on both Windows and Mac.\n\nI'll be releasing an upcoming update soon, to adjust the height of the lights and some other stuff. But in the meantime, if you found any bugs/glitches just post it under this post.\n\nCriticism and Suggestions are appreciated. LINK BELOW\n\n[http://www.derivedpierrelouis.com/2020/01/studio.html](http://www.derivedpierrelouis.com/2020/01/studio.html)\n\n&amp;#x200B;\n\n*Processing img sk2oxnv9e2f41...*", "link": "https://www.reddit.com/r/photography/comments/ez6cei/lighting_previs_software/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "lighting previs software /!/ starting last month, -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  a software named \"studio\" using the unity engine -----> to !!!  make previsualizations of lighting setups that -----> i !!!  was learning on youtube, -----> i !!!  can't afford nor do -----> i !!!  have the resources -----> to !!!  go and practice these setups in real life, so -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  it in a virtual one.\n\nit is completely free, just download it from my website, open the zip file and drag and drop it where you want the files to go. it's on both windows and mac.\n\ni'll be releasing an upcoming update soon, to adjust the height of the lights and some other stuff. but in the meantime, if you found any bugs/glitches just post it under this post.\n\ncriticism and suggestions are appreciated. link below\n\n[http://www.derivedpierrelouis.com/2020/01/studio.html](http://www.derivedpierrelouis.com/2020/01/studio.html)\n\n&amp;#x200b;\n\n*processing img sk2oxnv9e2f41...*", "sortedWord": "None", "Identifyer": null, "identifyer": 59407, "year": "2020"}, {"autor": "sourovdebmishu", "date": "2020-05-25 11:50:42", "content": "Anyone here who strictly use Silkypix professionally? I am looking for tutorials but they are mostly in Japanese. (My opinions and questions in the description) /!/ I have tried capture pro, Dxo photolab, on1 photo raw for one month each for 3 months. \nWith each software, I have retouched about 2000 raw images from Fuji xt20, dng from my smartphone and raw files from Panasonic DMZ Bridge. I have created Color and BW images, panorama of available, and HDR.p \nOn1 raw had hopes. But it's so slow to load images. Dxo photolab was not bad. Specially it had awesome user interface and noise reduction in phenomenal. But doesn't support Fuji or Pentax (not that I have).\nCapture was was in another league. The speed is unbeaten. Excellent for  productivity. \nI almost baught it. \nThen I have heard of Silkypix which I had installed but never used it. \nSo, just before I was about to take my wallet out for Capture One I gave silkypix a go. \nSo, I have edited about another 2000 images with files from Fuji RAF, Panasonic raw and dng from my smartphone.\nOne word. Color. It doesn't possess the speed of capture one or dxo. Local adjustment was not bad. \nBut, to recover highlights, NR it is as good as others if not better. Sharpness is not bad either. On top, \nSilkypix could produce literally exact same colors as jpegs with better details. And just because of that, I am sold. Plus it has different stacking options. The sliders are not to aggressive. I find it enough to professional work. If I really need to push the boundaries and need some more specific work then I use Affinity Photo.\nTheir manual is very well explained. Everything is pretty straightforward. Less is more\n So, I like it. \n I repeat, Capture is in another league when it comes to speed and retouching options. Even the free version is pretty awesome. But silkypix developer is fantastic for it's color rendition. It made me feel same way I felt with Fuji ergonomics and canon colors. It supports every camera brands and lens. They even make softwares for nikon, Fuji, Olympic and Panasonic and more. They work directly with the camera manufacturers.\nOnly one problem though, there aren't many tutorials available just in case if I find something specific. \nIs there anyone else out there who are also using Silkypix+Affinity Photo (Photoshop) combo? What is your workflow? Is there any in depth tutorials on the internet? \nWhat is your thoughts in general on this software if you ever have used it?", "link": "https://www.reddit.com/r/photography/comments/gq9ng6/anyone_here_who_strictly_use_silkypix/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "anyone here who strictly use silkypix professionally? i am looking for tutorials but they are mostly in japanese. (my opinions and questions in the description) /!/ i have tried capture pro, dxo photolab, on1 photo raw for one month each for 3 months. \nwith each software, i have retouched about 2000 raw images from fuji xt20, dng from my smartphone and raw files from panasonic dmz bridge. -----> i !!!  -----> have !!!  -----> created !!!  color and bw images, panorama of available, and hdr.p \non1 raw had hopes. but it's so slow to load images. dxo photolab was not bad. specially it had awesome user interface and noise reduction in phenomenal. but doesn't support fuji or pentax (not that i have).\ncapture was was in another league. the speed is unbeaten. excellent for  productivity. \ni almost baught it. \nthen i have heard of silkypix which i had installed but never used it. \nso, just before i was about to take my wallet out for capture one i gave silkypix a go. \nso, i have edited about another 2000 images with files from fuji raf, panasonic raw and dng from my smartphone.\none word. color. it doesn't possess the speed of capture one or dxo. local adjustment was not bad. \nbut, to recover highlights, nr it is as good as others if not better. sharpness is not bad either. on top, \nsilkypix could produce literally exact same colors as jpegs with better details. and just because of that, i am sold. plus it has different stacking options. the sliders are not to aggressive. i find it enough to professional work. if i really need to push the boundaries and need some more specific work then i use affinity photo.\ntheir manual is very well explained. everything is pretty straightforward. less is more\n so, i like it. \n i repeat, capture is in another league when it comes to speed and retouching options. even the free version is pretty awesome. but silkypix developer is fantastic for it's color rendition. it made me feel same way i felt with fuji ergonomics and canon colors. it supports every camera brands and lens. they even make softwares for nikon, fuji, olympic and panasonic and more. they work directly with the camera manufacturers.\nonly one problem though, there aren't many tutorials available just in case if i find something specific. \nis there anyone else out there who are also using silkypix+affinity photo (photoshop) combo? what is your workflow? is there any in depth tutorials on the internet? \nwhat is your thoughts in general on this software if you ever have used it?", "sortedWord": "None", "Identifyer": null, "identifyer": 59421, "year": "2020"}, {"autor": "themultibeastservice", "date": "2020-09-11 16:35:19", "content": "I will create 3d animated gif with my exclusive styles /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/iqtzw6/i_will_create_3d_animated_gif_with_my_exclusive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> will !!!  -----> create !!!  3d animated gif with my exclusive styles /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 59726, "year": "2020"}, {"autor": "Boomer84", "date": "2020-09-11 08:37:52", "content": "film Camera modification /!/  I  realise this is probably not the right sub but I've gotten so much  inspiration from here and people are always so helpful so I figure it's  worth a try.\n\nMy dad passed away  recently and he was an avid photographer. I'd like to modify one of his  old film cameras so the view finder has a screen in it and clicking the  \"shoot\" button displays a photo and rotates through photos as you click  it.\n\nThis is obviously an entirely  bespoke request and will likely be pricey, I could create the digital  side of it. Screen, processor etc but honestly I think it'd be better to have a company do the whole thing\n\nDo  you guys know if there is a service anywhere that might be able to do  this? Or any ideas where I could look? I'd like to give it to my brother  for his 40th.", "link": "https://www.reddit.com/r/photography/comments/iqmqoh/film_camera_modification/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "film camera modification /!/  i  realise this is probably not the right sub but i've gotten so much  inspiration from here and people are always so helpful so i figure it's  worth a try.\n\nmy dad passed away  recently and he was an avid photographer. i'd like to modify one of his  old film cameras so the view finder has a screen in it and clicking the  \"shoot\" button displays a photo and rotates through photos as you click  it.\n\nthis is obviously an entirely  bespoke request and will likely be pricey, -----> i !!!  -----> could !!!  -----> create !!!  the digital  side of it. screen, processor etc but honestly i think it'd be better to have a company do the whole thing\n\ndo  you guys know if there is a service anywhere that might be able to do  this? or any ideas where i could look? i'd like to give it to my brother  for his 40th.", "sortedWord": "None", "Identifyer": null, "identifyer": 59745, "year": "2020"}, {"autor": "bumbim22", "date": "2020-12-29 22:28:19", "content": "Are the Cheap Cloth Backdrops any Good for Video? /!/ Need a large backdrop to cover a wall for video, If I didn't had some nice paneling on the wall I would just paint the wall and be done with it.\n\nNeed something to hang so I can create a seamless neutral grey background.\n\nI have some vinyl/pvc backdrop which are good however it's a bit too small for what I need for this.\n\nI'm looking at these cloth backdrops,however often I see the result just look awful when someone are using them- as they are all crumpled up/bent/creased.Example:\n\n[https://images-na.ssl-images-amazon.com/images/I/71PzkGyObuL.\\_AC\\_SL1500\\_.jpg](https://images-na.ssl-images-amazon.com/images/I/71PzkGyObuL._AC_SL1500_.jpg)\n\nThey seem dirt cheap and can be had in huge sizes, however am I correct that they will most probably look awful? Anyone have had any experience with these? I can see You can get a huge one that can cover a wall for only like $10 :D\n\nWhat's up with them in real life? Any better alternative? Are the large Paper backdrops the way to go?", "link": "https://www.reddit.com/r/photography/comments/kmok7b/are_the_cheap_cloth_backdrops_any_good_for_video/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "are the cheap cloth backdrops any good for video? /!/ need a large backdrop to cover a wall for video, if i didn't had some nice paneling on the wall i would just paint the wall and be done with it.\n\nneed something to hang so -----> i !!!  -----> can !!!  -----> create !!!  a seamless neutral grey background.\n\ni have some vinyl/pvc backdrop which are good however it's a bit too small for what i need for this.\n\ni'm looking at these cloth backdrops,however often i see the result just look awful when someone are using them- as they are all crumpled up/bent/creased.example:\n\n[https://images-na.ssl-images-amazon.com/images/i/71pzkgyobul.\\_ac\\_sl1500\\_.jpg](https://images-na.ssl-images-amazon.com/images/i/71pzkgyobul._ac_sl1500_.jpg)\n\nthey seem dirt cheap and can be had in huge sizes, however am i correct that they will most probably look awful? anyone have had any experience with these? i can see you can get a huge one that can cover a wall for only like $10 :d\n\nwhat's up with them in real life? any better alternative? are the large paper backdrops the way to go?", "sortedWord": "None", "Identifyer": null, "identifyer": 59916, "year": "2020"}, {"autor": "HippoPOOPOO", "date": "2020-12-29 12:56:38", "content": "Here's a meme i created (GUYS IT'S ONLY A JOKE I'M USING A MIRORRLESS MYSELF", "link": "https://www.reddit.com/r/photography/comments/kmdwtx/heres_a_meme_i_created_guys_its_only_a_joke_im/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "here's a meme -----> i !!!  -----> created !!!  (guys it's only a joke -----> i !!! 'm using a mirorrless myself", "sortedWord": "None", "Identifyer": null, "identifyer": 59962, "year": "2020"}, {"autor": "500kavu", "date": "2020-11-23 09:51:22", "content": "Creating a gallery page on SmugMug /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/jzeu42/creating_a_gallery_page_on_smugmug/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a gallery page on smugmug /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60026, "year": "2020"}, {"autor": "StonedRiverBridge", "date": "2020-03-31 07:50:59", "content": "Creating a 360 photo out of normal photographs /!/ I dont know if this is the right place to ask. \n\nI have a bunch of group photos. They have completely different background and no pictures are the same. I wanted to create a 360 degree photo out of it. I used the PTGui software, but I am no good at it. Online, i couldnt find tutorials that i needed. So can someone tell me how can i convert a bunch of normal photos to a 360 collage?", "link": "https://www.reddit.com/r/photography/comments/fs8tpe/creating_a_360_photo_out_of_normal_photographs/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a 360 photo out of normal photographs /!/ i dont know if this is the right place to ask. \n\ni have a bunch of group photos. they have completely different background and no pictures are the same. i wanted to create a 360 degree photo out of it. i used the ptgui software, but i am no good at it. online, i couldnt find tutorials that i needed. so can someone tell me how can i convert a bunch of normal photos to a 360 collage?", "sortedWord": "None", "Identifyer": null, "identifyer": 60318, "year": "2020"}, {"autor": "FlarpleWolf", "date": "2020-04-17 09:56:07", "content": "[HELP] Anyone know how to turn off Infinite Colour asking if I want a new layer every time I create? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g2z0uc/help_anyone_know_how_to_turn_off_infinite_colour/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "[help] anyone know how to turn off infinite colour asking if -----> i !!!  want a new layer every time -----> i !!!  -----> create !!! ? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60497, "year": "2020"}, {"autor": "brettkoz", "date": "2020-02-04 21:01:19", "content": "New Photography Business Web Application /!/ Hi, my name is Brett Kozma, a web developer from Hesperia, Michigan. I recently created a software suite that is a photography business management application in the guise of a website. You can create client accounts and upload images for them to download (they can download dynamically created zip files containing only the images they want), you can control the content and design of every page, add and edit portfolios, send invoices and get paid through a Stripe payment gateway. Pretty much everything you'd need to manage a photography business on the web. Plus, I'm the developer and I would host the site, so any questions or concerns or requests for future version functionality would go right to me. You can check out the demo of the site at [www.photography.bkbeesites.com](https://www.photography.bkbeesites.com) or check out my wife's website, she is a wedding photographer using this software, her site is available at [www.katiekozma.com](https://www.katiekozma.com). So, please hit me up if you're interested, I'd love to give you log in credentials to the demo page so you can view the backend as well. Thanks for tolerating my one time marketing post.", "link": "https://www.reddit.com/r/photography/comments/eywzyl/new_photography_business_web_application/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "new photography business web application /!/ hi, my name is brett kozma, a web developer from hesperia, michigan. -----> i !!!  -----> recently !!!  -----> created !!!  a software suite that is a photography business management application in the guise of a website. you can create client accounts and upload images for them to download (they can download dynamically created zip files containing only the images they want), you can control the content and design of every page, add and edit portfolios, send invoices and get paid through a stripe payment gateway. pretty much everything you'd need to manage a photography business on the web. plus, i'm the developer and i would host the site, so any questions or concerns or requests for future version functionality would go right to me. you can check out the demo of the site at [www.photography.bkbeesites.com](https://www.photography.bkbeesites.com) or check out my wife's website, she is a wedding photographer using this software, her site is available at [www.katiekozma.com](https://www.katiekozma.com). so, please hit me up if you're interested, i'd love to give you log in credentials to the demo page so you can view the backend as well. thanks for tolerating my one time marketing post.", "sortedWord": "None", "Identifyer": null, "identifyer": 60645, "year": "2020"}, {"autor": "lewis56500", "date": "2020-09-09 18:08:17", "content": "[QUESTION] Group photos in the pandemic /!/ Hello, strange request here.\n\nI’ve to organise a large group photo for a university hall of residence this year, and I was wondering if anyone knows of any techniques that I can use to create/collate a group photo without gathering 200 people together?\n\nI know this is a bit broad but I would like to go in with more information before I ask a professional photographer.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/ipl8y0/question_group_photos_in_the_pandemic/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can use to create", "selectorShort": "create", "MarkedSent": "[question] group photos in the pandemic /!/ hello, strange request here.\n\n-----> i !!! ’ve -----> to !!!  organise a large group photo for a university hall of residence this year, and -----> i !!!  was wondering if anyone knows of any techniques that -----> i !!!  -----> can !!!  -----> use !!!  -----> to !!!  -----> create !!! /collate a group photo without gathering 200 people together?\n\ni know this is a bit broad but i would like to go in with more information before i ask a professional photographer.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 61386, "year": "2020"}, {"autor": "sonliet", "date": "2020-09-09 15:32:36", "content": "Creating a pricing calculator? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ipi53i/creating_a_pricing_calculator/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a pricing calculator? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 61400, "year": "2020"}, {"autor": "Acrivisum", "date": "2020-11-04 18:13:20", "content": "Haven’t been happy with my pictures lately. /!/ I have seasonal depression, and winter is hard to photograph in Iowa. Lately I’ve seen other people’s great work and it’s been demotivating to me. I used to really like the content I created, I have clients that buy from me, I have people that book me. But I’m no longer happy with what I produce. \n\nDoes anybody have any tips on how to overcome this, is this normal, or is this just a part of my seasonal depression and it will pass with time?", "link": "https://www.reddit.com/r/photography/comments/jo1q4q/havent_been_happy_with_my_pictures_lately/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "haven’t been happy with my pictures lately. /!/ i have seasonal depression, and winter is hard to photograph in iowa. lately i’ve seen other people’s great work and it’s been demotivating to me. -----> i !!!  used to really like the content -----> i !!!  -----> created !!! , -----> i !!!  have clients that buy from me, -----> i !!!  have people that book me. but i’m no longer happy with what i produce. \n\ndoes anybody have any tips on how to overcome this, is this normal, or is this just a part of my seasonal depression and it will pass with time?", "sortedWord": "None", "Identifyer": null, "identifyer": 61919, "year": "2020"}, {"autor": "dmassie", "date": "2020-02-14 03:48:46", "content": "Facebook Cover Photo /!/ Hello, I have my own jewelry shop and I am creating a Facebook page for it. Is there any way possible that someone can take a picture of jewelry on a table with plain boxes surrounding it? The idea is to put my logo on the plain boxes if possible in photoshop or whatever you may use. Like I said, I'm not sure if this is possible to do but let me know!", "link": "https://www.reddit.com/r/photography/comments/f3me3q/facebook_cover_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "facebook cover photo /!/ hello, -----> i !!!  have my own jewelry shop and -----> i !!!  -----> am !!!  -----> creating !!!  a facebook page for it. is there any way possible that someone can take a picture of jewelry on a table with plain boxes surrounding it? the idea is to put my logo on the plain boxes if possible in photoshop or whatever you may use. like i said, i'm not sure if this is possible to do but let me know!", "sortedWord": "None", "Identifyer": null, "identifyer": 62141, "year": "2020"}, {"autor": "DarrenMillerDM", "date": "2020-03-21 05:00:25", "content": "I Created a Photography Podcast 1st Ep. Street Photography /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/fm9qff/i_created_a_photography_podcast_1st_ep_street/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a photography podcast 1st ep. street photography /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 62588, "year": "2020"}, {"autor": "[deleted]", "date": "2020-04-16 12:57:06", "content": "snapped these clouds; immediately thought of the creation of adam, and bOoM i created my vision :)) /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/g2eeak/snapped_these_clouds_immediately_thought_of_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "snapped these clouds; immediately thought of the creation of adam, and boom -----> i !!!  -----> created !!!  my vision :)) /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 62886, "year": "2020"}, {"autor": "MakeMuricaOkayAgain", "date": "2020-04-27 06:18:18", "content": "Photo editing discord /!/ Was wondering if any one was interested in joining a discord where we share RAWs and upload each other’s photos for fun. It’s a great exercise for all esp during the quarantine. \n\nHere’s a quick link of a server I created. \n[discord link](https://discord.gg/ZymYEM)\n\nOpen to suggestions and advice as well as mods. \n\n\nThanks guys :)", "link": "https://www.reddit.com/r/photography/comments/g8v2rq/photo_editing_discord/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "photo editing discord /!/ was wondering if any one was interested in joining a discord where we share raws and upload each other’s photos for fun. it’s a great exercise for all esp during the quarantine. \n\nhere’s a quick link of a server -----> i !!!  -----> created !!! . \n[discord link](https://discord.gg/zymyem)\n\nopen to suggestions and advice as well as mods. \n\n\nthanks guys :)", "sortedWord": "None", "Identifyer": null, "identifyer": 63336, "year": "2020"}, {"autor": "noukje91", "date": "2020-05-22 20:50:51", "content": "Amateur here; what do I do with the photo's I really like? /!/ Hi! \nSo, I am an amateur. Have not done shoots, gigs, etc.  Also not very interested in doing that because I fear losing the love for doing it due to the pressure of 'performing'. \nI just happen to have inherited the love for photography from my father and love it aa a hobby.\nThing is: I am noticing a huge progression in my photography and I feel like I want to do something with the pictures I really like. I just don't know what.\nNormally I post an album on facebook for friends and family, but I would like to create a seperate place for my pictures without looking to 'advertise' myself.\nI could print and frame some ofcourse but I dont feel like turning my house into a gallery.\n\nI think I should opt for a place on the internet, does making a website as an amateur make any sense?\nDo any of you have experience with certain simple website builders? If so, which ones do you recommend and why?", "link": "https://www.reddit.com/r/photography/comments/gork0b/amateur_here_what_do_i_do_with_the_photos_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "amateur here; what do i do with the photo's i really like? /!/ hi! \nso, i am an amateur. have not done shoots, gigs, etc.  also not very interested in doing that because i fear losing the love for doing it due to the pressure of 'performing'. \ni just happen to have inherited the love for photography from my father and love it aa a hobby.\nthing is: i am noticing a huge progression in my photography and i feel like i want to do something with the pictures i really like. i just don't know what.\nnormally -----> i !!!  post an album on facebook for friends and family, but -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  a seperate place for my pictures without looking -----> to !!!  'advertise' myself.\ni could print and frame some ofcourse but i dont feel like turning my house into a gallery.\n\ni think i should opt for a place on the internet, does making a website as an amateur make any sense?\ndo any of you have experience with certain simple website builders? if so, which ones do you recommend and why?", "sortedWord": "None", "Identifyer": null, "identifyer": 63679, "year": "2020"}, {"autor": "NutellaOreoReeses", "date": "2020-06-28 04:08:30", "content": "I have a lot of diversification in my photography. Should I create separate websites for each genre? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/hh80li/i_have_a_lot_of_diversification_in_my_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "i have a lot of diversification in my photography. should -----> i !!!  -----> create !!!  separate websites for each genre? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 64042, "year": "2020"}, {"autor": "securitywyrm", "date": "2020-09-01 06:03:23", "content": "Question about creating a unique photography rig /!/ Greetings! I'm looking to get back into photography as a hobby, particularly at comic and anime conventions. What I want to create is a system where I can take some pictures of a person, push a button, and print out a label with a URL of where that batch of photos will be uploaded.\n\nI know how to do this in Microsoft Access with visual basic, but that's not exactly a 'stable platform.' I'm hoping that there's some image management programs out there with powerful enough macros and features to do the following sequence\n\n1. I take a bunch of photos\n2. I push 'the button,' probably a usb number pad.\n3. The system takes all pictures taken since the last time 'the button' was pushed and puts them into a new sequential folder, like 234654.\n4. The label printer prints a tag of \"Your (count of files) pictures will be available (tomorrow's date) at website/FolderNumber.\"\n5. When I get home, I FTP upload all the folders to the site. \n\nThis would allow me to freely roam a convention, taking pictures and handing people a card with where they can get them the next day, ensuring no interruption in the fun. I'm not looking to do \"high art professional\" photography; it just has to be better than a selfie thanks to a good camera and properly bounced/softened flash.\n\nAny suggestions on where I should start looking? My total budget is $2000.", "link": "https://www.reddit.com/r/photography/comments/ikeyi3/question_about_creating_a_unique_photography_rig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "question about creating a unique photography rig /!/ greetings! i'm looking to get back into photography as a hobby, particularly at comic and anime conventions. what -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  is a system where -----> i !!!  can take some pictures of a person, push a button, and print out a label with a url of where that batch of photos will be uploaded.\n\ni know how to do this in microsoft access with visual basic, but that's not exactly a 'stable platform.' i'm hoping that there's some image management programs out there with powerful enough macros and features to do the following sequence\n\n1. i take a bunch of photos\n2. i push 'the button,' probably a usb number pad.\n3. the system takes all pictures taken since the last time 'the button' was pushed and puts them into a new sequential folder, like 234654.\n4. the label printer prints a tag of \"your (count of files) pictures will be available (tomorrow's date) at website/foldernumber.\"\n5. when i get home, i ftp upload all the folders to the site. \n\nthis would allow me to freely roam a convention, taking pictures and handing people a card with where they can get them the next day, ensuring no interruption in the fun. i'm not looking to do \"high art professional\" photography; it just has to be better than a selfie thanks to a good camera and properly bounced/softened flash.\n\nany suggestions on where i should start looking? my total budget is $2000.", "sortedWord": "None", "Identifyer": null, "identifyer": 64514, "year": "2020"}, {"autor": "adavid02", "date": "2020-08-31 15:51:17", "content": "When do you call yourself a “photographer”? /!/ Taking pictures doesn’t make you a “photographer” anymore than speaking two languages makes you an interpreter or kids science experiment makes you a scientist. IMO you shouldn’t call yourself a “photographer” unless you can claim it as income on your taxes.\nMost of these “momtographers” are “making” pictures (in post) more than they’re actually taking them. Creating an Instagram page for their “photography”  isn’t anymore legitimate than their essential oil business...", "link": "https://www.reddit.com/r/photography/comments/ik0hs9/when_do_you_call_yourself_a_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "when do you call yourself a “photographer”? /!/ taking pictures doesn’t make you a “photographer” anymore than speaking two languages makes you an interpreter or kids science experiment makes you a scientist. imo you shouldn’t call yourself a “photographer” unless you can claim it as income on your taxes.\nmost of these “momtographers” are “making” pictures (in post) more than they’re actually taking them. -----> creating !!!  an instagram page for their “photography”  isn’t anymore legitimate than their essential oil business...", "sortedWord": "None", "Identifyer": null, "identifyer": 64572, "year": "2020"}, {"autor": "gracehisbiscus", "date": "2020-09-18 21:52:01", "content": "Helping partner gain confidence as a beginner? /!/ Hi all. My partner is a really good photographer, and he’s starting to pursue more professional ventures. His work is beautiful but I think he’s a little hesitant to share publicly because they’re all amateur subjects. Right now he has a private Instagram where he posts his pics. I’ve been feeling pretty depressed lately, and even felt a little jealousy at the opportunities he was getting. I know this is misplaced, mostly because I feel left out. I’d like to create a beginner portfolio for him on squarespace (or another recommended site.) Is this too personal? Is this something I should leave up to him? I want to get him to see his work is amazing and that he should be confident in his abilities and not hide them. I also love working on projects like this and know it will help my mood, too. Any recommendations for first time portfolios? And beginner photographers, how did you gain confidence in your work? I’ve also gotten him photography books and a “my first camera” workbook in the past year.", "link": "https://www.reddit.com/r/photography/comments/ivfftk/helping_partner_gain_confidence_as_a_beginner/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’d like to create", "selectorShort": "create", "MarkedSent": "helping partner gain confidence as a beginner? /!/ hi all. my partner is a really good photographer, and he’s starting to pursue more professional ventures. his work is beautiful but i think he’s a little hesitant to share publicly because they’re all amateur subjects. right now he has a private instagram where he posts his pics. i’ve been feeling pretty depressed lately, and even felt a little jealousy at the opportunities he was getting. i know this is misplaced, mostly because i feel left out. -----> i !!! -----> ’d !!!  -----> like !!!  -----> to !!!  -----> create !!!  a beginner portfolio for him on squarespace (or another recommended site.) is this too personal? is this something i should leave up to him? i want to get him to see his work is amazing and that he should be confident in his abilities and not hide them. i also love working on projects like this and know it will help my mood, too. any recommendations for first time portfolios? and beginner photographers, how did you gain confidence in your work? i’ve also gotten him photography books and a “my first camera” workbook in the past year.", "sortedWord": "None", "Identifyer": null, "identifyer": 64767, "year": "2020"}, {"autor": "brainbarian", "date": "2020-08-03 08:25:56", "content": "need help with lighting setup, white background for product photography in smallish room /!/ Hi All,\n\nLooking to get a better in-camera result for my product photography, goal -  so there is no editing (i.e. adding/removing parts of the image, no masking), just changing of values  (sharpening, colour correction, white balance etc) etc. As I take 4-5 shots of each product - hand held different angles), and there are 100+ products, I don't want to edit each one. Just apply the 'style' (I use darktable) and apply small tweaks. It doesn't have to be perfectly white, but I'm looking for consistency.\n\n**Is it possible to get a white background behind an object in a room that's under 4.3m/14ft long?  Can you propose a light setup to achieve this with my constraints?**\n\nMost of the tutorials I see around achieving a white background with a largish object  (mine are  up to 1m x 1m / 40inches) require a lot of room between the backdrop and the object - I don't have that space!\n\nThe closest setup I can get is just a single big strobe (400w elinchrome d-lite) with  60inch umbrella, raised 8-9ft almost overhead. this allows the light to fill the object and the surrounding white (vinyl) backdrop. However, there is still a subtle but noticeable drop in er...whiteness on the backdrop. here's what it looks like, pretty close, but the top is a bit darker, and any boosting of the exposure/white point impacts the object.\n\nsetup:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/c6weumykwqe51.png?width=1920&amp;format=png&amp;auto=webp&amp;s=fc277c5a6ea775091998f1d40bedddf908596aac\n\nresult (notice the greyness in the upper portion of the photo - that's what I'd like to get rid of with a better lighting setup):\n\nhttps://preview.redd.it/spbvryctvqe51.png?width=1200&amp;format=png&amp;auto=webp&amp;s=32a466b9212e4bef0e19d818002353b2f0754a97\n\nI tried a more complex setup , but I just created more problems, see the difference in the white:\n\nsetup:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gxe2s7e8xqe51.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4a50c84432b9b0e9a6de72e3eeae0290c1c50d7b\n\nresult:\n\nhttps://preview.redd.it/6akbwfopuqe51.png?width=1200&amp;format=png&amp;auto=webp&amp;s=1656f254376fe72da8b0685c020c9e5883054482\n\nGear I have:\n\nprefer to shoot with 50mm lens on 1.6 APS-C = 80mm focal length so need 2-3 m between camera and object. \n\n2 x elinchrome 400w d-lites on a big boom stand w/remote triggers etc.\n\n3 x glanz 160w strobes\n\n1 1.5m / 60 inch umbrella with white diffuser (pictured below)\n\n1 x  2m / 6 x 1.5m  5ft reflector (and a smaller reflector ) both are the neewer 5-in-1 design.\n\na bunch of stands, some vertical bars\n\n2 big bits of white sheet for diffusing but no softboxes  :(\n\n2 x smaller umbrellas (44cm/33 inch) \n\nthe reflector - behind the backdrop, it's big! and I've found this angle is better for a single light setup.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xovc17eixqe51.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=32349720b52afb5707d09ddbd2e222dedd86f6b9\n\nHere's the big umbrella with strobe which is the only light I'm using for the first pic, it's a beast!:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/u3gdc7y0zqe51.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=db1467d8c38d635cce6435838b420637c60a1bb4", "link": "https://www.reddit.com/r/photography/comments/i2tcf8/need_help_with_lighting_setup_white_background/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just created", "selectorShort": "create", "MarkedSent": "need help with lighting setup, white background for product photography in smallish room /!/ hi all,\n\nlooking to get a better in-camera result for my product photography, goal -  so there is no editing (i.e. adding/removing parts of the image, no masking), just changing of values  (sharpening, colour correction, white balance etc) etc. as i take 4-5 shots of each product - hand held different angles), and there are 100+ products, i don't want to edit each one. just apply the 'style' (i use darktable) and apply small tweaks. it doesn't have to be perfectly white, but i'm looking for consistency.\n\n**is it possible to get a white background behind an object in a room that's under 4.3m/14ft long?  can you propose a light setup to achieve this with my constraints?**\n\nmost of the tutorials i see around achieving a white background with a largish object  (mine are  up to 1m x 1m / 40inches) require a lot of room between the backdrop and the object - i don't have that space!\n\nthe closest setup i can get is just a single big strobe (400w elinchrome d-lite) with  60inch umbrella, raised 8-9ft almost overhead. this allows the light to fill the object and the surrounding white (vinyl) backdrop. however, there is still a subtle but noticeable drop in er...whiteness on the backdrop. here's what it looks like, pretty close, but the top is a bit darker, and any boosting of the exposure/white point impacts the object.\n\nsetup:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/c6weumykwqe51.png?width=1920&amp;format=png&amp;auto=webp&amp;s=fc277c5a6ea775091998f1d40bedddf908596aac\n\nresult (notice the greyness in the upper portion of the photo - that's what -----> i !!! 'd like to get rid of with a better lighting setup):\n\nhttps://preview.redd.it/spbvryctvqe51.png?width=1200&amp;format=png&amp;auto=webp&amp;s=32a466b9212e4bef0e19d818002353b2f0754a97\n\n-----> i !!!  tried a more complex setup , but -----> i !!!  -----> just !!!  -----> created !!!  more problems, see the difference in the white:\n\nsetup:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/gxe2s7e8xqe51.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4a50c84432b9b0e9a6de72e3eeae0290c1c50d7b\n\nresult:\n\nhttps://preview.redd.it/6akbwfopuqe51.png?width=1200&amp;format=png&amp;auto=webp&amp;s=1656f254376fe72da8b0685c020c9e5883054482\n\ngear -----> i !!!  have:\n\nprefer to shoot with 50mm lens on 1.6 aps-c = 80mm focal length so need 2-3 m between camera and object. \n\n2 x elinchrome 400w d-lites on a big boom stand w/remote triggers etc.\n\n3 x glanz 160w strobes\n\n1 1.5m / 60 inch umbrella with white diffuser (pictured below)\n\n1 x  2m / 6 x 1.5m  5ft reflector (and a smaller reflector ) both are the neewer 5-in-1 design.\n\na bunch of stands, some vertical bars\n\n2 big bits of white sheet for diffusing but no softboxes  :(\n\n2 x smaller umbrellas (44cm/33 inch) \n\nthe reflector - behind the backdrop, it's big! and i've found this angle is better for a single light setup.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/xovc17eixqe51.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=32349720b52afb5707d09ddbd2e222dedd86f6b9\n\nhere's the big umbrella with strobe which is the only light i'm using for the first pic, it's a beast!:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/u3gdc7y0zqe51.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=db1467d8c38d635cce6435838b420637c60a1bb4", "sortedWord": "None", "Identifyer": null, "identifyer": 65047, "year": "2020"}, {"autor": "iphotocanvasm", "date": "2020-10-06 05:16:23", "content": "Create Stunning Photo Collages from your iPhone or Mac /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/j5zcyc/create_stunning_photo_collages_from_your_iphone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  stunning photo collages from your iphone or mac /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 65182, "year": "2020"}, {"autor": "fotoloc0", "date": "2020-12-09 21:31:28", "content": "Is vistaprint calendar design interface working for any of you ? /!/ I tried to create some 2021 calendars at the vistaprint website at this link: https://www.vistaprint.com/studio/calendar-design.aspx?template=3176814_CGX&amp;ag=True&amp;xnav=HSG_Design_Image&amp;rd=1\n\nBut their website is so shitty, it does not work if I drag an image on top of the page. I tried various OS/browser combo, still does not work.\n\nI was wondering is anyone here has experienced the same problem.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/ka165b/is_vistaprint_calendar_design_interface_working/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i tried to create", "selectorShort": "create", "MarkedSent": "is vistaprint calendar design interface working for any of you ? /!/ -----> i !!!  -----> tried !!!  -----> to !!!  -----> create !!!  some 2021 calendars at the vistaprint website at this link: https://www.vistaprint.com/studio/calendar-design.aspx?template=3176814_cgx&amp;ag=true&amp;xnav=hsg_design_image&amp;rd=1\n\nbut their website is so shitty, it does not work if -----> i !!!  drag an image on top of the page. i tried various os/browser combo, still does not work.\n\ni was wondering is anyone here has experienced the same problem.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 65466, "year": "2020"}, {"autor": "bignick1190", "date": "2020-11-02 17:54:11", "content": "\"Super-Res\", HDR Question/ Discussion. /!/ Ok so let's say i wanted to use [this \"super-res\" technique](https://petapixel.com/2015/02/21/a-practical-guide-to-creating-superresolution-photos-with-photoshop/) in conjunction with HDR photos, how much of the tonal range is retained when layering said HDR photos.\n\n&amp;#x200B;\n\nSo to give  a bit more detail-\n\nTake 5 bracketed shots at different exposures 10 times (so 50 photos). This gives me a total of 10 final photos to now use the technique above to create a \"super-res\" photo. If i create the \"super-res\" before editing the photo is the tonal range retained from the HDR brakets?\n\n&amp;#x200B;\n\nor, should i edit the photos prior to creating a \"super-res\" photo?", "link": "https://www.reddit.com/r/photography/comments/jmsfi2/superres_hdr_question_discussion/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "\"super-res\", hdr question/ discussion. /!/ ok so let's say i wanted to use [this \"super-res\" technique](https://petapixel.com/2015/02/21/a-practical-guide-to-creating-superresolution-photos-with-photoshop/) in conjunction with hdr photos, how much of the tonal range is retained when layering said hdr photos.\n\n&amp;#x200b;\n\nso to give  a bit more detail-\n\ntake 5 bracketed shots at different exposures 10 times (so 50 photos). this gives me a total of 10 final photos to now use the technique above to create a \"super-res\" photo. if -----> i !!!  -----> create !!!  the \"super-res\" before editing the photo is the tonal range retained from the hdr brakets?\n\n&amp;#x200b;\n\nor, should -----> i !!!  edit the photos prior to creating a \"super-res\" photo?", "sortedWord": "None", "Identifyer": null, "identifyer": 65873, "year": "2020"}, {"autor": "Nater_X", "date": "2020-02-13 08:45:44", "content": "Starting photography business /!/ So I’m working on building my portfolio to start a photography business specializing in engagement and wedding photography. I’m wondering if I should create a separate Instagram from my personal Instagram for all my photo stuff? Or turn my personal page into a business page because all my immediate work will be from the people who currently know me? Thoughts?", "link": "https://www.reddit.com/r/photography/comments/f373zf/starting_photography_business/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": "starting photography business /!/ so i’m working on building my portfolio to start a photography business specializing in engagement and wedding photography. -----> i !!! ’m wondering if -----> i !!!  -----> should !!!  -----> create !!!  a separate instagram from my personal instagram for all my photo stuff? or turn my personal page into a business page because all my immediate work will be from the people who currently know me? thoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 66227, "year": "2020"}, {"autor": "Aureole117", "date": "2020-03-20 16:47:21", "content": "Food Photography Quarantine Challenge /!/ Hey Guys ! \n\nWould you be interested in some sort of food photography challenge? \nThe goal would be to each select a recipe of some kind of food (for example : cookies), and then share a few pictures of it. \n\nFood photography is ideal in these times, since we're all stuck at home. It doesn't require much gear, even a smartphone can do, and we can adapt the recipes to whatever ingredient we have on hand ! It forces us to think about composition, styling, and is actually really fun.\nPlus, you get to eat delicious food (well, if you don't fail ahah), instead of junk food or lazy pastas. \n\nI don't really know how we could set it up but perhaps we could create a discord server, or a reddit thread. We could create an instagram hashtag and post everything under it.\n\nLet me know if you'd be interested !", "link": "https://www.reddit.com/r/photography/comments/fly8nc/food_photography_quarantine_challenge/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we could create", "selectorShort": "create", "MarkedSent": "food photography quarantine challenge /!/ hey guys ! \n\nwould you be interested in some sort of food photography challenge? \nthe goal would be to each select a recipe of some kind of food (for example : cookies), and then share a few pictures of it. \n\nfood photography is ideal in these times, since we're all stuck at home. it doesn't require much gear, even a smartphone can do, and we can adapt the recipes to whatever ingredient we have on hand ! it forces us to think about composition, styling, and is actually really fun.\nplus, you get to eat delicious food (well, if you don't fail ahah), instead of junk food or lazy pastas. \n\ni don't really know how we could set it up but perhaps -----> we !!!  -----> could !!!  -----> create !!!  a discord server, or a reddit thread. we could create an instagram hashtag and post everything under it.\n\nlet me know if you'd be interested !", "sortedWord": "None", "Identifyer": null, "identifyer": 67031, "year": "2020"}, {"autor": "artiliz-twitch", "date": "2020-04-03 22:24:23", "content": "If images posted on social medias like Instagram fall under public domain, where can we advertise our work without losing ownership? /!/ I wanted to create an Instagram account to share and possibly sell some pictures I took, but I found out you can't protect your work once you share it, pretty much on all social media. \n\nIf I put a watermark it will take the quality away from the viewer, not to mention anyone can use Photoshop to get rid of it. \n\nIs there no other way than to upload pictures to shutterstock with no outlet to advertise the work?", "link": "https://www.reddit.com/r/photography/comments/fuhwl1/if_images_posted_on_social_medias_like_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "if images posted on social medias like instagram fall under public domain, where can we advertise our work without losing ownership? /!/ -----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  an instagram account -----> to !!!  share and possibly sell some pictures -----> i !!!  took, but -----> i !!!  found out you can't protect your work once you share it, pretty much on all social media. \n\nif i put a watermark it will take the quality away from the viewer, not to mention anyone can use photoshop to get rid of it. \n\nis there no other way than to upload pictures to shutterstock with no outlet to advertise the work?", "sortedWord": "None", "Identifyer": null, "identifyer": 67321, "year": "2020"}, {"autor": "grey2son", "date": "2020-01-15 04:20:43", "content": "Filing taxes when I am just now creating my business. /!/ I have been doing portrait photography since last January (mainly was a hobby but now I’m focusing on it). I am just starting the steps to make my business (getting my sole proprietorship, possible insurance, sales tax license). Anyway, my question is how do I file taxes on my income from last year when I technically wasn’t a business? Will I have to pay sales tax even though I didn’t charge sales tax or have my photography as more of a business then? Do I file it under a hobby? \n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/eoxbae/filing_taxes_when_i_am_just_now_creating_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am just now creating", "selectorShort": "create", "MarkedSent": "filing taxes when -----> i !!!  -----> am !!!  -----> just !!!  -----> now !!!  -----> creating !!!  my business. /!/ i have been doing portrait photography since last january (mainly was a hobby but now i’m focusing on it). i am just starting the steps to make my business (getting my sole proprietorship, possible insurance, sales tax license). anyway, my question is how do i file taxes on my income from last year when i technically wasn’t a business? will i have to pay sales tax even though i didn’t charge sales tax or have my photography as more of a business then? do i file it under a hobby? \n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 68072, "year": "2020"}, {"autor": "adventuringtheworld", "date": "2020-02-02 13:39:15", "content": "Best photography platform to sell photos? /!/ Hi,\n\nI was after purchasing a subscription plan where I can create a store and sell photos on. This will be like a website link that I share on social media then people click on my link and can purchase my products online. They will then get a digital download after purchasing. Also I need watermarks on all my images. This space(photography selling website niche) needs a clear and strong market leader (for example shopify is the leader in the product and service ecommerce web builder).\n\n&amp;#x200B;\n\nI have tried zenfolio, however their website is REALLY SUPER slow. Also I have looked at smugmug, pixieset, photoshelter and shootproof. I am hesistant and reluctant to spend another $30 and receive a sub-par sh\\*t product.\n\nPlease help -*Which one is best?*", "link": "https://www.reddit.com/r/photography/comments/exoj99/best_photography_platform_to_sell_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "best photography platform to sell photos? /!/ hi,\n\n-----> i !!!  was after purchasing a subscription plan where -----> i !!!  -----> can !!!  -----> create !!!  a store and sell photos on. this will be like a website link that i share on social media then people click on my link and can purchase my products online. they will then get a digital download after purchasing. also i need watermarks on all my images. this space(photography selling website niche) needs a clear and strong market leader (for example shopify is the leader in the product and service ecommerce web builder).\n\n&amp;#x200b;\n\ni have tried zenfolio, however their website is really super slow. also i have looked at smugmug, pixieset, photoshelter and shootproof. i am hesistant and reluctant to spend another $30 and receive a sub-par sh\\*t product.\n\nplease help -*which one is best?*", "sortedWord": "None", "Identifyer": null, "identifyer": 68483, "year": "2020"}, {"autor": "FairCaptain7", "date": "2020-02-02 06:32:39", "content": "How can I repeat same zoom and angle settings for product photos? /!/ I need to create product pictures for pills bottles, droppers, etc. and trying to create a repeatable workflow that would allow me to keep consistent with the shots. I can do that if shooting for a few hours, but it is more challenging when I need to repeats same type of shot a few weeks later.\n\nAny tricks/tips that you could share on how I could position the camera, the zoom setting and the product angle, distance so that I can have the same consistency. I am leaning toward using a stop motion software to capture the images and using onion skin, but wondering if anyone use some other rig or tricks for it?", "link": "https://www.reddit.com/r/photography/comments/exkd1o/how_can_i_repeat_same_zoom_and_angle_settings_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "how can i repeat same zoom and angle settings for product photos? /!/ -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  product pictures for pills bottles, droppers, etc. and trying -----> to !!!  -----> create !!!  a repeatable workflow that would allow me -----> to !!!  keep consistent with the shots. i can do that if shooting for a few hours, but it is more challenging when i need to repeats same type of shot a few weeks later.\n\nany tricks/tips that you could share on how i could position the camera, the zoom setting and the product angle, distance so that i can have the same consistency. i am leaning toward using a stop motion software to capture the images and using onion skin, but wondering if anyone use some other rig or tricks for it?", "sortedWord": "None", "Identifyer": null, "identifyer": 68504, "year": "2020"}, {"autor": "wawa_springwater", "date": "2020-05-04 13:52:47", "content": "Slideshow software that allows multiple images per slide? /!/ I have a project and I need to create a slideshow of 207 images but I'm limited on the total time. I cannot seem to find slideshow software that allows me to have 4 images on screen at once. Can anyone recommend software for this?", "link": "https://www.reddit.com/r/photography/comments/gdbzxv/slideshow_software_that_allows_multiple_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "slideshow software that allows multiple images per slide? /!/ -----> i !!!  have a project and -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a slideshow of 207 images but i'm limited on the total time. i cannot seem to find slideshow software that allows me to have 4 images on screen at once. can anyone recommend software for this?", "sortedWord": "None", "Identifyer": null, "identifyer": 68834, "year": "2020"}, {"autor": "Dirthouse420", "date": "2020-05-18 20:50:39", "content": "Check out my new facebook page for landscape/nature photography @Upon The Way Photography! /!/ I recently created it so it is still in a process of promoting. Go like/follow and share! It would be greatly appreciated!", "link": "https://www.reddit.com/r/photography/comments/gm9x4r/check_out_my_new_facebook_page_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "check out my new facebook page for landscape/nature photography @upon the way photography! /!/ -----> i !!!  -----> recently !!!  -----> created !!!  it so it is still in a process of promoting. go like/follow and share! it would be greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 69120, "year": "2020"}, {"autor": "imanese", "date": "2020-06-23 11:34:34", "content": "photography about corona /!/ hello, for our school arts class i need to create a photography that showcases something about corona / quarantines. any ideas / suggestions? I'm happy with every idea.", "link": "https://www.reddit.com/r/photography/comments/heczgz/photography_about_corona/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "photography about corona /!/ hello, for our school arts class -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a photography that showcases something about corona / quarantines. any ideas / suggestions? i'm happy with every idea.", "sortedWord": "None", "Identifyer": null, "identifyer": 69944, "year": "2020"}, {"autor": "AntigoneWithTheWind", "date": "2020-08-09 10:23:21", "content": "What's the best way to add descriptions to old family photographs? /!/ Hello all!\n\nThe past few days I've been going through some old photographs dating back to the 1900's. My family was able to recall all sorts of stories about the people in the pictures, tell me in what way we're related, when the pictures were taken approximately. Some of the stories were very impressive, and I would hate for them to be lost. I would like to create some sort of archive for later generations and because my memory will definitely fail me, I have decided to sort all of the pictures with a family member and get all information I can get about each picture. Now, some of the pictures already have something written on the back, but I don't know if adding something to such old photos is a good idea, I would like to leave them as they are.   \n\n\nIs there any way to archive them very nicely and have picture and description at one glance? I think that photo albums would take up too much space. Currently they're all in a nice box, all a bit scattered. I was thinking maybe post-it notes on the backs of them, but I feel like they would fall off too quickly.   \n\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/i6h5lk/whats_the_best_way_to_add_descriptions_to_old/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "what's the best way to add descriptions to old family photographs? /!/ hello all!\n\nthe past few days i've been going through some old photographs dating back to the 1900's. my family was able to recall all sorts of stories about the people in the pictures, tell me in what way we're related, when the pictures were taken approximately. some of the stories were very impressive, and i would hate for them to be lost. -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  some sort of archive for later generations and because my memory will definitely fail me, -----> i !!!  have decided -----> to !!!  sort all of the pictures with a family member and get all information -----> i !!!  can get about each picture. now, some of the pictures already have something written on the back, but i don't know if adding something to such old photos is a good idea, i would like to leave them as they are.   \n\n\nis there any way to archive them very nicely and have picture and description at one glance? i think that photo albums would take up too much space. currently they're all in a nice box, all a bit scattered. i was thinking maybe post-it notes on the backs of them, but i feel like they would fall off too quickly.   \n\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 70247, "year": "2020"}, {"autor": "HitoriPanda", "date": "2020-07-03 23:42:23", "content": "Creating a business (legal steps) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/hkthih/creating_a_business_legal_steps/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a business (legal steps) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 70537, "year": "2020"}, {"autor": "MushroomKid", "date": "2020-08-17 12:40:07", "content": "How would i create a softbox for Mi Desk Lamp 1s /!/ I've seen tutorials on how to create a softbox for traditional circle desk lamps, but because the abnormal shape of the Mi Desk lamp i'm not quite sure how i would go about doing so.   \n\nIm not sure if i can post links in this subreddit, therefore just search up the relevant name.  \n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/ibddgc/how_would_i_create_a_softbox_for_mi_desk_lamp_1s/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how would -----> i !!!  -----> create !!!  a softbox for mi desk lamp 1s /!/ i've seen tutorials on how to create a softbox for traditional circle desk lamps, but because the abnormal shape of the mi desk lamp i'm not quite sure how i would go about doing so.   \n\nim not sure if i can post links in this subreddit, therefore just search up the relevant name.  \n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 70664, "year": "2020"}, {"autor": "courtzybear", "date": "2020-08-20 21:30:03", "content": "I’m wanting to create a theme similar to one I’ve seen. Does anyone know the presets or how to edit photos like these...? /!/ The Instagram in question is @nestling_and_nook\n\nI love her feed. She posts photos in a warm tone and everything flows. Can anyone recommend a preset for Lightroom or a video showing how to edit photos similar, if not the same, as her ones. \n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/idjckr/im_wanting_to_create_a_theme_similar_to_one_ive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m wanting to create", "selectorShort": "create", "MarkedSent": "-----> i !!! ’m -----> wanting !!!  -----> to !!!  -----> create !!!  a theme similar -----> to !!!  one -----> i !!! ’ve seen. does anyone know the presets or how to edit photos like these...? /!/ the instagram in question is @nestling_and_nook\n\ni love her feed. she posts photos in a warm tone and everything flows. can anyone recommend a preset for lightroom or a video showing how to edit photos similar, if not the same, as her ones. \n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 70858, "year": "2020"}, {"autor": "bladerunner2054", "date": "2020-09-04 06:24:13", "content": "How to get photos like this? /!/ [https://www.mariasvarbova.com/generation](https://www.mariasvarbova.com/generation)\n\nI keep coming across photos like these, their look is usually very wide dynamic range and everything seems in focus with these really pastely type colors. It seems a lot of the time I find out they're taken on Medium format cameras. But really it can't just be that it's MF. Surely I can create this look or close with a full frame DSLR? What kind of film or post process do you think this is? Or am I missing that this comes down to maybe more of a well lit scene using studio lights?", "link": "https://www.reddit.com/r/photography/comments/imaw70/how_to_get_photos_like_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "how to get photos like this? /!/ [https://www.mariasvarbova.com/generation](https://www.mariasvarbova.com/generation)\n\ni keep coming across photos like these, their look is usually very wide dynamic range and everything seems in focus with these really pastely type colors. it seems a lot of the time i find out they're taken on medium format cameras. but really it can't just be that it's mf. surely -----> i !!!  -----> can !!!  -----> create !!!  this look or close with a full frame dslr? what kind of film or post process do you think this is? or am i missing that this comes down to maybe more of a well lit scene using studio lights?", "sortedWord": "None", "Identifyer": null, "identifyer": 71149, "year": "2020"}, {"autor": "[deleted]", "date": "2020-07-21 19:48:42", "content": "I created this photo using a Nutella jar, water, a phone flashlight and a balloon weight. /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/hvee0o/i_created_this_photo_using_a_nutella_jar_water_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  this photo using a nutella jar, water, a phone flashlight and a balloon weight. /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 71716, "year": "2020"}, {"autor": "AHand", "date": "2020-10-02 03:06:47", "content": "I created an app to make sharing your portfolio simple /!/  Hello! I'm a college student studying computer science. I've been really interested in filmmaking / photography since I was young. Recently I've been getting into app development in my free time.\n\nAlias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nAny feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)", "link": "https://www.reddit.com/r/photography/comments/j3mzfr/i_created_an_app_to_make_sharing_your_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  an app to make sharing your portfolio simple /!/  hello! i'm a college student studying computer science. i've been really interested in filmmaking / photography since i was young. recently i've been getting into app development in my free time.\n\nalias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nany feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)", "sortedWord": "None", "Identifyer": null, "identifyer": 72227, "year": "2020"}, {"autor": "beffini", "date": "2020-09-30 19:21:36", "content": "Does anyone know an app that I can download that will help me create psychedelic effects like this?! account credit to @shawna_shoots on Instagram btw!", "link": "https://www.reddit.com/r/photography/comments/j2ss4f/does_anyone_know_an_app_that_i_can_download_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "does anyone know an app that i can download that will help -----> me !!!  -----> create !!!  psychedelic effects like this?! account credit to @shawna_shoots on instagram btw!", "sortedWord": "None", "Identifyer": null, "identifyer": 72302, "year": "2020"}, {"autor": "umutbebek", "date": "2020-10-09 06:56:27", "content": "\"World of Images\" add-on for docs and slides /!/ We did created an add-on to easily search and add images to the docs and slides. But do you think is it a good idea to integrate it with those documents? Or should we stay only on the website side and maybe giving a simple editing UI there?\n\nDocs: [https://gsuite.google.com/marketplace/app/world\\_of\\_images/65067348354](https://gsuite.google.com/marketplace/app/world_of_images/65067348354)\n\nSlides: [https://gsuite.google.com/marketplace/app/world\\_of\\_images/85776247753](https://gsuite.google.com/marketplace/app/world_of_images/85776247753)", "link": "https://www.reddit.com/r/photography/comments/j7ub1y/world_of_images_addon_for_docs_and_slides/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we did created", "selectorShort": "create", "MarkedSent": "\"world of images\" add-on for docs and slides /!/ -----> we !!!  -----> did !!!  -----> created !!!  an add-on to easily search and add images to the docs and slides. but do you think is it a good idea to integrate it with those documents? or should we stay only on the website side and maybe giving a simple editing ui there?\n\ndocs: [https://gsuite.google.com/marketplace/app/world\\_of\\_images/65067348354](https://gsuite.google.com/marketplace/app/world_of_images/65067348354)\n\nslides: [https://gsuite.google.com/marketplace/app/world\\_of\\_images/85776247753](https://gsuite.google.com/marketplace/app/world_of_images/85776247753)", "sortedWord": "None", "Identifyer": null, "identifyer": 72389, "year": "2020"}, {"autor": "itsvoogle", "date": "2020-11-29 23:23:39", "content": "Creating the Red Eye Effect /!/ So alot of tutorials online explain why and how to remove that traditional red eye effect that flash can make on peoples eye. Does anyone have any tips or techniques on how to recreate it naturally every time?", "link": "https://www.reddit.com/r/photography/comments/k3ju2v/creating_the_red_eye_effect/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  the red eye effect /!/ so alot of tutorials online explain why and how to remove that traditional red eye effect that flash can make on peoples eye. does anyone have any tips or techniques on how to recreate it naturally every time?", "sortedWord": "None", "Identifyer": null, "identifyer": 72709, "year": "2020"}, {"autor": "FuerteBillete", "date": "2020-12-08 22:20:34", "content": "How to prevent someone from suing me over my own images. Please read. /!/ Hello everyone. I have a question that I could not find a proper answer when googling so here it goes. \n\nImagine I upload my images as a video on youtube, on social networks such as instagram, on my own website. I know copyright is mine the moment I created it. But this right needs some proof.\n\nThe question is, what if someone for example take one of my images and register it as theirs on sites such as pixsy or similar sites, and then that site or other sites like that one searches with their bots and tell me Im infringint the copyright?\n\nI hope Im being clear enough. \n\nIs my youtube publication or self site or instagram posts proof enough of my copyright? \n\nI have thousand of pictures due to the nature of my work and I cant register them all as it would not be cost effective. \n\nI just want to know if someone can shed some light on this, how to be protected against someone registering my work as their and then wanting to sue me. Im not asking how to sue anyone myself, only to be protected from this particular situation.\n\nThanks in advance for your time and hope it made sense. Cheers to you all.", "link": "https://www.reddit.com/r/photography/comments/k9ehog/how_to_prevent_someone_from_suing_me_over_my_own/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "how to prevent someone from suing me over my own images. please read. /!/ hello everyone. i have a question that i could not find a proper answer when googling so here it goes. \n\nimagine i upload my images as a video on youtube, on social networks such as instagram, on my own website. -----> i !!!  know copyright is mine the moment -----> i !!!  -----> created !!!  it. but this right needs some proof.\n\nthe question is, what if someone for example take one of my images and register it as theirs on sites such as pixsy or similar sites, and then that site or other sites like that one searches with their bots and tell me im infringint the copyright?\n\ni hope im being clear enough. \n\nis my youtube publication or self site or instagram posts proof enough of my copyright? \n\ni have thousand of pictures due to the nature of my work and i cant register them all as it would not be cost effective. \n\ni just want to know if someone can shed some light on this, how to be protected against someone registering my work as their and then wanting to sue me. im not asking how to sue anyone myself, only to be protected from this particular situation.\n\nthanks in advance for your time and hope it made sense. cheers to you all.", "sortedWord": "None", "Identifyer": null, "identifyer": 72887, "year": "2020"}, {"autor": "DrockinWV", "date": "2020-12-14 13:37:00", "content": "Created a YouTube playlist of getting out and learning photography and walking though my process of getting shots. Check it out and let me know what you all think!", "link": "https://www.reddit.com/r/photography/comments/kcxqwj/created_a_youtube_playlist_of_getting_out_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  a youtube playlist of getting out and learning photography and walking though my process of getting shots. check it out and let me know what you all think!", "sortedWord": "None", "Identifyer": null, "identifyer": 72948, "year": "2020"}, {"autor": "Stavrosvi", "date": "2020-10-20 14:15:29", "content": "Any idea for digital Photo Wall? /!/ Hello everyone,\n\nWhen it comes to organizing my photo projects, I am always printing the photos(mainly 10x15) and then I place them on a big empty white wall where I am trying to create a sequence that makes senses. It helps me to be able to look at every picture at the same time and move/adjust instant, it's just so unique and so much more enjoyable/creative way of working.\n\nSo, since my printer broke and don't want to spent any money on any printshop, I was wondering if any of you know some kind of online website or a software that could represent the way I am working in the digital way -something like a white background where you could place pictures where ever you want to-\n\nI hope I was enough explanatory,\n\nthanks in advance :)", "link": "https://www.reddit.com/r/photography/comments/jeqbq8/any_idea_for_digital_photo_wall/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am trying to create", "selectorShort": "create", "MarkedSent": "any idea for digital photo wall? /!/ hello everyone,\n\nwhen it comes to organizing my photo projects, i am always printing the photos(mainly 10x15) and then -----> i !!!  place them on a big empty white wall where -----> i !!!  -----> am !!!  -----> trying !!!  -----> to !!!  -----> create !!!  a sequence that makes senses. it helps me to be able to look at every picture at the same time and move/adjust instant, it's just so unique and so much more enjoyable/creative way of working.\n\nso, since my printer broke and don't want to spent any money on any printshop, i was wondering if any of you know some kind of online website or a software that could represent the way i am working in the digital way -something like a white background where you could place pictures where ever you want to-\n\ni hope i was enough explanatory,\n\nthanks in advance :)", "sortedWord": "None", "Identifyer": null, "identifyer": 73391, "year": "2020"}, {"autor": "Skyllux", "date": "2020-10-29 15:53:48", "content": "Copyright clarification (Australia laws) /!/ A magazine editor contacted me to recreate one of my recent shoots so she can publish it in her magazine.\n\nShe wants me to use the same settings, probs, outfits etc that I used in my original shoot and she also wants to use the same model (who showed her the photos from our original shoot) \n\nShe will be paying the model and the makeup artist, but I will not be paid. She offered to pay me but I refused as I only do photography for fun but also because I don’t want anyone to have full rights to my images. I am happy to shoot and have her select the photos she wants me to edit and have her publish them but nothing more than that. \n\nShe is treating this as commissioned work, which I don’t think qualifies as commissioned work but more like a collaboration. Specially that she wants me  to copy a concept that I created, styled and shot without her.\n\nSo I am wondering, if I agree to do this, would this be considered as commissioned work where she will get full copyrights to the photos or I would still own the rights to the photos?\n\nI was planning and styling that concept for months, so I don’t want her taking copyright for something I worked so hard for.\n\nI only accepted because me and the model get along well and we always have good photos when we work together. But the editor seems very sneaky and I don’t want to be caught off guard.", "link": "https://www.reddit.com/r/photography/comments/jkclra/copyright_clarification_australia_laws/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "copyright clarification (australia laws) /!/ a magazine editor contacted me to recreate one of my recent shoots so she can publish it in her magazine.\n\nshe wants me to use the same settings, probs, outfits etc that i used in my original shoot and she also wants to use the same model (who showed her the photos from our original shoot) \n\nshe will be paying the model and the makeup artist, but i will not be paid. she offered to pay me but i refused as i only do photography for fun but also because i don’t want anyone to have full rights to my images. i am happy to shoot and have her select the photos she wants me to edit and have her publish them but nothing more than that. \n\nshe is treating this as commissioned work, which i don’t think qualifies as commissioned work but more like a collaboration. specially that she wants me  to copy a concept that -----> i !!!  -----> created !!! , styled and shot without her.\n\nso i am wondering, if i agree to do this, would this be considered as commissioned work where she will get full copyrights to the photos or i would still own the rights to the photos?\n\ni was planning and styling that concept for months, so i don’t want her taking copyright for something i worked so hard for.\n\ni only accepted because me and the model get along well and we always have good photos when we work together. but the editor seems very sneaky and i don’t want to be caught off guard.", "sortedWord": "None", "Identifyer": null, "identifyer": 73421, "year": "2020"}, {"autor": "ThoughtsToMyself", "date": "2020-10-28 06:40:47", "content": "Looking for some photographers who might be interested in letting me use their photos for my instagram poetry page I am starting. /!/ Sorry if this is against the rules, I could not see anything specifically against it.\n\nI write poetry, and I am starting an Instagram page to share it on to hopefully reach a wider audience. If you are interested in sharing your photography with me, I will of course tag whatever you want (your insta, your reddit, your personal website,  name, etc,) in it and credit you. \n\nAnyway, comment here or dm me if you are interested. I will let you know what scene I am looking for, or what emotion I want behind the photo whenever we talk more.\n\nAlso, I am not trying to self promote at all, but if you would like to know what kind of poetry I write to know if you are interested or not, I have a few up on my reddit page right now.\n\nTagged as art, because that is what I am hoping to create.", "link": "https://www.reddit.com/r/photography/comments/jjivy9/looking_for_some_photographers_who_might_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am hoping to create", "selectorShort": "create", "MarkedSent": "looking for some photographers who might be interested in letting me use their photos for my instagram poetry page i am starting. /!/ sorry if this is against the rules, i could not see anything specifically against it.\n\ni write poetry, and i am starting an instagram page to share it on to hopefully reach a wider audience. if you are interested in sharing your photography with me, i will of course tag whatever you want (your insta, your reddit, your personal website,  name, etc,) in it and credit you. \n\nanyway, comment here or dm me if you are interested. i will let you know what scene i am looking for, or what emotion i want behind the photo whenever we talk more.\n\nalso, i am not trying to self promote at all, but if you would like to know what kind of poetry i write to know if you are interested or not, i have a few up on my reddit page right now.\n\ntagged as art, because that is what -----> i !!!  -----> am !!!  -----> hoping !!!  -----> to !!!  -----> create !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 73509, "year": "2020"}, {"autor": "denniskb", "date": "2020-02-12 14:24:19", "content": "Soft proofing for iPhone? /!/ I don't own a fancy photo monitor but with calibration and paper profiles it comes fairly close to the print itself. For most use cases I'm happy with the first print and if I really need to nail the colors I can get there within 2 test prints.\n\nHowever, when I export to sRGB and view on my iPhone the shadow areas are completely crushed and de-saturated. Is there a way, other than trial and error, to \"soft-proof\" my images for the iPhone? Could I perhaps create a profile myself using a color chart? Alternatively, is there a way to use an iPhone as a display and do my proofing directly on that for instant feedback?", "link": "https://www.reddit.com/r/photography/comments/f2rxy8/soft_proofing_for_iphone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i perhaps create", "selectorShort": "create", "MarkedSent": "soft proofing for iphone? /!/ i don't own a fancy photo monitor but with calibration and paper profiles it comes fairly close to the print itself. for most use cases i'm happy with the first print and if i really need to nail the colors i can get there within 2 test prints.\n\nhowever, when i export to srgb and view on my iphone the shadow areas are completely crushed and de-saturated. is there a way, other than trial and error, to \"soft-proof\" my images for the iphone? could -----> i !!!  -----> perhaps !!!  -----> create !!!  a profile myself using a color chart? alternatively, is there a way to use an iphone as a display and do my proofing directly on that for instant feedback?", "sortedWord": "None", "Identifyer": null, "identifyer": 74112, "year": "2020"}, {"autor": "Luna-AP-Photography", "date": "2020-02-11 19:58:11", "content": "I Created A Striking \"Blind to Plastic\" Portrait Series /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/f2dy2v/i_created_a_striking_blind_to_plastic_portrait/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a striking \"blind to plastic\" portrait series /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 74195, "year": "2020"}, {"autor": "clondon", "date": "2020-02-10 18:16:29", "content": "Creating a Portfolio: Advice from Magnum", "link": "https://www.reddit.com/r/photography/comments/f1ub3v/creating_a_portfolio_advice_from_magnum/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a portfolio: advice from magnum", "sortedWord": "None", "Identifyer": null, "identifyer": 74268, "year": "2020"}, {"autor": "closerthanyouthinkk", "date": "2020-02-14 23:57:15", "content": "I want to create fashion photography portfolio using myself as a prop , but idk how to start? /!/ can any expert fashion photographer give input on this? i would like to start maybe with instagram or my own blog capturing picture of myself in different poses and wearing different outfit and then going into post to make it eye capturing with colors and experimenting with different tones etc. how do i go about doing this by myself? \n\n&amp;#x200B;\n\nwhat does a step by step guide to point me to the right direction look like?\n\n&amp;#x200B;\n\nany links to personal or other instagram feeds/bloggers would be wonderful so i can get some ideas. thanks!", "link": "https://www.reddit.com/r/photography/comments/f4170r/i_want_to_create_fashion_photography_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  fashion photography portfolio using myself as a prop , but idk how -----> to !!!  start? /!/ can any expert fashion photographer give input on this? i would like to start maybe with instagram or my own blog capturing picture of myself in different poses and wearing different outfit and then going into post to make it eye capturing with colors and experimenting with different tones etc. how do i go about doing this by myself? \n\n&amp;#x200b;\n\nwhat does a step by step guide to point me to the right direction look like?\n\n&amp;#x200b;\n\nany links to personal or other instagram feeds/bloggers would be wonderful so i can get some ideas. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 74571, "year": "2020"}, {"autor": "PriceisRightx26", "date": "2020-02-16 23:30:20", "content": "Nature Pictures /!/ Hi everyone! I'm working on a personal project (journal-type thing) and I wanted to add some nature photos to just encourage comfort within the bindings. Unfortunately, it seems like a lot of my personal photos have been corrupted, so I'm in search. We (I'm creating the journal for my other half) are hikers, and I wanted to include locations that I have already visited, however I may be open to regions I have yet to venture. \n\nFor anyone that would like to share their work, I'll most definitely watermark your photograph, and give your IG a follow if that's something you're interested in. \n\nSome of the locations I've visited include: Blue Ridge Mountain Range, Glasshouse Mountain Range, Rocky Mountain Range, Yellowstone, Grand Tetons, Badlands, Mesa Verde, Mount Ranier, Killarney National Park, Mill Creek MetroPark, Cuyahoga Valley National Park, Hocking Hills State Park, Olympia National Park... anddddd that's all I can think of off the top of my head.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/f4zaub/nature_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "nature pictures /!/ hi everyone! i'm working on a personal project (journal-type thing) and i wanted to add some nature photos to just encourage comfort within the bindings. unfortunately, it seems like a lot of my personal photos have been corrupted, so i'm in search. we (-----> i !!! 'm -----> creating !!!  the journal for my other half) are hikers, and -----> i !!!  wanted to include locations that -----> i !!!  have already visited, however -----> i !!!  may be open to regions -----> i !!!  have yet to venture. \n\nfor anyone that would like to share their work, i'll most definitely watermark your photograph, and give your ig a follow if that's something you're interested in. \n\nsome of the locations i've visited include: blue ridge mountain range, glasshouse mountain range, rocky mountain range, yellowstone, grand tetons, badlands, mesa verde, mount ranier, killarney national park, mill creek metropark, cuyahoga valley national park, hocking hills state park, olympia national park... anddddd that's all i can think of off the top of my head.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 74638, "year": "2020"}, {"autor": "bandenk", "date": "2020-03-15 23:24:49", "content": "Created new Regional Community /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/fjars9/created_new_regional_community/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  new regional community /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 75603, "year": "2020"}, {"autor": "Hydro_-", "date": "2020-03-26 09:38:49", "content": "Lately, I've been trying to create another style for myself. Since I struggled with adding way too much saturation and clarity, as well as Dehaze. I have tried to follow some tutorials but keeping my freedom. Any criticism, positive or negative is welcome.", "link": "https://www.reddit.com/r/photography/comments/fp8ouu/lately_ive_been_trying_to_create_another_style/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've been trying to create", "selectorShort": "create", "MarkedSent": "lately, -----> i !!! 've -----> been !!!  -----> trying !!!  -----> to !!!  -----> create !!!  another style for myself. since i struggled with adding way too much saturation and clarity, as well as dehaze. i have tried to follow some tutorials but keeping my freedom. any criticism, positive or negative is welcome.", "sortedWord": "None", "Identifyer": null, "identifyer": 76072, "year": "2020"}, {"autor": "agorazzein", "date": "2020-03-27 05:21:18", "content": "Any tips for a creative block? /!/ I've been taking photos since I was 13, and everything was okay. I learned and finally found that I love shooting portraits. The thing started when I was 17. At that moment I consider myself like so good on portraits having just 16/17 years old, but I've always had so much difficulties to develop and idea, or sometimes I can't even create a proyect. I want to do things that I see from other photographers, but I can't develop something from myself, all the ideas that I have, are the same that I saw from other people. It's so difficult to me. \n\nNow I'm 19, almost 20 and i'm returning to photography again. I try to take my camera every single day and shoot whatever I have around, and it's working, but stills being so difficult to me to do a personal proyect without seeing other people's work. I just want to do something that transmits what I have inside of me, and that it's even more difficult.\n\nAnyone can give me some tips for this? I don't even know if this is a creative block after 3 years... \n\nAlso I want to apologize for my English, i'm trying my best. Thank you!", "link": "https://www.reddit.com/r/photography/comments/fprakf/any_tips_for_a_creative_block/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can't even create", "selectorShort": "create", "MarkedSent": "any tips for a creative block? /!/ i've been taking photos since i was 13, and everything was okay. i learned and finally found that i love shooting portraits. the thing started when i was 17. at that moment -----> i !!!  consider myself like so good on portraits having just 16/17 years old, but -----> i !!! 've always had so much difficulties to develop and idea, or sometimes -----> i !!!  -----> ca !!! -----> n't !!!  -----> even !!!  -----> create !!!  a proyect. i want to do things that i see from other photographers, but i can't develop something from myself, all the ideas that i have, are the same that i saw from other people. it's so difficult to me. \n\nnow i'm 19, almost 20 and i'm returning to photography again. i try to take my camera every single day and shoot whatever i have around, and it's working, but stills being so difficult to me to do a personal proyect without seeing other people's work. i just want to do something that transmits what i have inside of me, and that it's even more difficult.\n\nanyone can give me some tips for this? i don't even know if this is a creative block after 3 years... \n\nalso i want to apologize for my english, i'm trying my best. thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 76176, "year": "2020"}, {"autor": "linhrom", "date": "2020-04-01 13:44:19", "content": "[Quarantine Photography] the type of photography you can do at home self quarantine. What is everyone else doing? (photography wise) /!/ having some down time from work for a reason we all know why. I've created an account for watches and everyday carry Photography as a side project.\n\n[https://www.instagram.com/rom.media/](https://www.instagram.com/rom.media/)\n\nI don't have any of the expensive pieces to feature but it's a start. I'm starting from zero so go easy on me T\\_T\n\nhttps://preview.redd.it/hsbidtbdn7q41.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=bb50e14e29f7d8b5f6aed0010d8c579ffb7616ef", "link": "https://www.reddit.com/r/photography/comments/ft01er/quarantine_photography_the_type_of_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "[quarantine photography] the type of photography you can do at home self quarantine. what is everyone else doing? (photography wise) /!/ having some down time from work for a reason we all know why. -----> i !!! 've -----> created !!!  an account for watches and everyday carry photography as a side project.\n\n[https://www.instagram.com/rom.media/](https://www.instagram.com/rom.media/)\n\ni don't have any of the expensive pieces to feature but it's a start. i'm starting from zero so go easy on me t\\_t\n\nhttps://preview.redd.it/hsbidtbdn7q41.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=bb50e14e29f7d8b5f6aed0010d8c579ffb7616ef", "sortedWord": "None", "Identifyer": null, "identifyer": 76193, "year": "2020"}, {"autor": "DonTuxedo", "date": "2020-04-06 17:23:44", "content": "Creating simple but beautiful abstract photos using paper.", "link": "https://www.reddit.com/r/photography/comments/fw2u59/creating_simple_but_beautiful_abstract_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  simple but beautiful abstract photos using paper.", "sortedWord": "None", "Identifyer": null, "identifyer": 76485, "year": "2020"}, {"autor": "jyotinyc", "date": "2020-01-05 18:38:46", "content": "Recommendation for where to print professional-quality photo book? /!/ Hello - I'm not sure if this is allowed as a separate post so please let me know it not.\n\nMy husband and I spent a year traveling and have a lot of great photos from the trip. I want to create a high-quality coffee-table photobook and was wondering if anyone had recommendations of a great vendor to use for it. Quality-wise I'm looking more for something in the realm of professional like Pete Souza's Obama book, instead of a Mixbook, etc. type. It'll be a very low print (might get 3-5 for family and friends) but I'm willing to pay for higher quality. Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/ekgzw0/recommendation_for_where_to_print/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "recommendation for where to print professional-quality photo book? /!/ hello - i'm not sure if this is allowed as a separate post so please let me know it not.\n\nmy husband and i spent a year traveling and have a lot of great photos from the trip. -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a high-quality coffee-table photobook and was wondering if anyone had recommendations of a great vendor -----> to !!!  use for it. quality-wise i'm looking more for something in the realm of professional like pete souza's obama book, instead of a mixbook, etc. type. it'll be a very low print (might get 3-5 for family and friends) but i'm willing to pay for higher quality. thanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 76781, "year": "2020"}, {"autor": "Kydra96", "date": "2020-01-02 15:35:37", "content": "Photography name ideas! /!/  I just created a new Instagram and I'm having trouble coming up with a username and one that is available. I want to incorporate my name into it and keep it  short and sweet if possible.\n\nHow did you come up with yours?", "link": "https://www.reddit.com/r/photography/comments/eizok0/photography_name_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just created", "selectorShort": "create", "MarkedSent": "photography name ideas! /!/  -----> i !!!  -----> just !!!  -----> created !!!  a new instagram and -----> i !!! 'm having trouble coming up with a username and one that is available. i want to incorporate my name into it and keep it  short and sweet if possible.\n\nhow did you come up with yours?", "sortedWord": "None", "Identifyer": null, "identifyer": 77032, "year": "2020"}, {"autor": "SquareCurvesStudio", "date": "2020-01-10 19:45:56", "content": "Did anyone else start blogging on their photography site late into the game? /!/ So I've been doing photography for a while, but just on the side. I've decided to really pursue this more heavily this year, starting with revamping my site and adding a blog section to blog about my photo shoots and travels. However, I've had a lot of great experiences with models/actors and traveling in general, last year and the year before. Should I still create blog posts about those experiences as if it just happened recently? I ask because I don't really have anything going on as of in the near future. It's been a little slow these days, but I do want some content out there. Any thoughts?", "link": "https://www.reddit.com/r/photography/comments/emw38q/did_anyone_else_start_blogging_on_their/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i still create", "selectorShort": "create", "MarkedSent": "did anyone else start blogging on their photography site late into the game? /!/ so i've been doing photography for a while, but just on the side. i've decided to really pursue this more heavily this year, starting with revamping my site and adding a blog section to blog about my photo shoots and travels. however, i've had a lot of great experiences with models/actors and traveling in general, last year and the year before. should -----> i !!!  -----> still !!!  -----> create !!!  blog posts about those experiences as if it just happened recently? i ask because i don't really have anything going on as of in the near future. it's been a little slow these days, but i do want some content out there. any thoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 77315, "year": "2020"}, {"autor": "vicstoc", "date": "2020-01-24 03:24:49", "content": "How do I create this dark background effect look; can’t see his body either just the face and beanie of the dog blended into the black background? Credits: IG murphy.the.dobrermann", "link": "https://www.reddit.com/r/photography/comments/et4j6l/how_do_i_create_this_dark_background_effect_look/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  this dark background effect look; can’t see his body either just the face and beanie of the dog blended into the black background? credits: ig murphy.the.dobrermann", "sortedWord": "None", "Identifyer": null, "identifyer": 77675, "year": "2020"}, {"autor": "rinatkhanov", "date": "2020-01-27 08:43:04", "content": "Create Harry Potter-style photographs that come to life (in mobile augmented reality)", "link": "https://www.reddit.com/r/photography/comments/eulb2d/create_harry_potterstyle_photographs_that_come_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  harry potter-style photographs that come to life (in mobile augmented reality)", "sortedWord": "None", "Identifyer": null, "identifyer": 77849, "year": "2020"}, {"autor": "NotsoExpert1", "date": "2020-02-01 15:31:49", "content": "Where can I buy a 2000-2007 Camera? /!/ I just saw some of my parents' old photos and they look so nostalgic that I realized I want to create memories like that as well. \n\nI want to buy an old camera (not too old), take photos with my friends and make an album. (I don't want to take photos on the phone because in my opinion, physical photos have more sentimental meaning). \n\nIs there any place that I can buy an old camera from? (websites or actual places I haven't thought of)", "link": "https://www.reddit.com/r/photography/comments/ex7ppr/where_can_i_buy_a_20002007_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "where can i buy a 2000-2007 camera? /!/ -----> i !!!  just saw some of my parents' old photos and they look so nostalgic that -----> i !!!  realized -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  memories like that as well. \n\ni want to buy an old camera (not too old), take photos with my friends and make an album. (i don't want to take photos on the phone because in my opinion, physical photos have more sentimental meaning). \n\nis there any place that i can buy an old camera from? (websites or actual places i haven't thought of)", "sortedWord": "None", "Identifyer": null, "identifyer": 78209, "year": "2020"}, {"autor": "SF112", "date": "2020-04-23 21:33:59", "content": "Looking for suggestions for free/low cost website for rebuilding portfolio? I Currently have little income from jobs being canceled but but have lots /!/ Of time so I want to rebuild my portfolio and add new product photography photos onto it. I’m looking to create something that’s clean, easy to navigate and with a professional look. I used squarespace to get my previous work but canceled the service after I didn’t need it about 7 months ago.", "link": "https://www.reddit.com/r/photography/comments/g6vg9l/looking_for_suggestions_for_freelow_cost_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m looking to create", "selectorShort": "create", "MarkedSent": "looking for suggestions for free/low cost website for rebuilding portfolio? i currently have little income from jobs being canceled but but have lots /!/ of time so i want to rebuild my portfolio and add new product photography photos onto it. -----> i !!! ’m -----> looking !!!  -----> to !!!  -----> create !!!  something that’s clean, easy -----> to !!!  navigate and with a professional look. i used squarespace to get my previous work but canceled the service after i didn’t need it about 7 months ago.", "sortedWord": "None", "Identifyer": null, "identifyer": 78283, "year": "2020"}, {"autor": "1SidB1", "date": "2020-04-23 13:48:19", "content": "What software (preferably on iPhone) can I use to create edits like this where the photo of the music blends in the background ?", "link": "https://www.reddit.com/r/photography/comments/g6my05/what_software_preferably_on_iphone_can_i_use_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i use to create", "selectorShort": "create", "MarkedSent": "what software (preferably on iphone) can -----> i !!!  -----> use !!!  -----> to !!!  -----> create !!!  edits like this where the photo of the music blends in the background ?", "sortedWord": "None", "Identifyer": null, "identifyer": 78324, "year": "2020"}, {"autor": "film_guy01", "date": "2020-04-24 17:49:28", "content": "Is there any way to crop without losing quality, but also without raising image size? /!/ So I have 400 jpgs I need to crop. They all need to be cropped exactly the same amount so I've created an action that does exactly what I need. The problem is, the quality of the image is EXTREMELY important. I can't lose any more quality.\n\nIf I take an image that's 42.6 kb and crop and save it with the quality setting at 12, now the file is 349 kb. Since these are all going to be posted on a website, the drastic increase in quality is a big problem.\n\nTheoretically, it seems like I should be able to crop without losing any image quality and the file size should get SMALLER not bigger. Can this be done with photoshop?\n\nOr is there perhaps another software I can batch crop that will just trim off some of the edges without completely reencoding the image?\n\nPlease advise. Thanks!", "link": "https://www.reddit.com/r/photography/comments/g7cz08/is_there_any_way_to_crop_without_losing_quality/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "is there any way to crop without losing quality, but also without raising image size? /!/ so i have 400 jpgs i need to crop. they all need to be cropped exactly the same amount so -----> i !!! 've -----> created !!!  an action that does exactly what -----> i !!!  need. the problem is, the quality of the image is extremely important. i can't lose any more quality.\n\nif i take an image that's 42.6 kb and crop and save it with the quality setting at 12, now the file is 349 kb. since these are all going to be posted on a website, the drastic increase in quality is a big problem.\n\ntheoretically, it seems like i should be able to crop without losing any image quality and the file size should get smaller not bigger. can this be done with photoshop?\n\nor is there perhaps another software i can batch crop that will just trim off some of the edges without completely reencoding the image?\n\nplease advise. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 78431, "year": "2020"}, {"autor": "silent_winter", "date": "2020-04-27 21:02:04", "content": "Dealing with self-doubt /!/ Hey folks, I wanted to start a discussion about a topic I struggle with, and I think I'm probably not alone in this.\n\nThat topic is self-doubt when it comes to your ability and potential as a photographer.\n\nIn many other fields, there is a positive feedback loop that keeps you going. I find that photography is lacking this aspect which for me seems to be critical.\n\nFor example, with conventional jobs, it's straight-forward. Go to school, work hard, and you get rewarded with good grades and a job offer. Then you're further rewarded with a guaranteed salary, praise for your good work, promotions, etc. You have a manager and a team who will support you (ideally). I mean, this all can vary wildly, but in my experience this was mostly the case. It's like playing an MMORPG in real life -- there are straight-forward quests and a clear progression for you to follow.\n\nThen you have less conventional fields. I was a musician for a while, and that was certainly more difficult, but there was so much positive reinforcement. First of all, your bandmates will tell you when your ideas are actually good, and help keep things going when you feel down. Second, when you play a show and people visibly appreciate your music and tell you how great it was, it feels incredible. Third, putting your work out there yields results. Things like reviews, articles, radio airplay, etc just sort of happened naturally. It's a saturated field, for sure, but not as saturated as photography -- I think it takes more work to produce something that people are willing to take a listen to. There's really not \\*that\\* much original, high quality work in my opinion.\n\nThen you have photography. There's no team or band -- you're on your own. So, when you lack confidence in your ability, no one will support you. You put your work out there, but even a 97-98 pulse on 500px will only get you 5 new followers. The same images will do very little on instagram unless they get featured, which might yield 20 followers. (Just my experience, purely anecdotal.) But, even great images easily disappear into the void unnoticed since the field is so saturated, so let's say only one out of every 4 images gets featured somewhere (unlikely). So, you can create 100 professional quality images and end up with 100 \\* 5 = 500 followers on 500px, and 100 / 4 \\* 20 = 500 followers on instagram.\n\nThat's certainly a start, but there are people with images that are unoriginal and bad to mediocre in quality, and 5 figure followings. Their work will rank higher than yours no matter how good your images are. **And maybe that's fine if you can somehow know that your work is good, social media is perhaps a bad metric for quality, but after a while, how do you know? Maybe it's actually bad and you're just just delusional? Maybe you're just not a real artist? Maybe the reason for your lack of following is that you just suck and no one has the heart to tell you?** That's how I feel when I don't have any validation, at least. I'm sure some of you feel the same.\n\nNow, I don't think I have 100 professional level images yet, I have maybe 10. I consider most of my work utter garbage and have a long way to go. But, to even get to this point it took many years. The amount of work needed to crate one high quality image is super high, and even once you're good it takes time. I remember Thomas Heaton mentioning he gets maybe 1 \"keeper\" per month even while doing it full time. So, at the rate I'm going, I just don't see the light at the end of the tunnel here.\n\n(That light being some strong positive response that will encourage you to keep going)\n\nOf course, it's about the journey, and I would find it very hard to not do photography. I really love it. But seeing my work getting nowhere while I had achieved success with much greater ease in other fields is demoralizing and makes me doubt my abilities, which in turn makes me enjoy it less and just wonder if my time is better spent elsewhere.\n\nUltimately I want to add value to the world, not just spend my time doing stuff I enjoy. Otherwise I'd just be playing videogames or hiking all day, but, I find creating something people appreciate to be more fulfilling. A common advice is to take a break from photography and see if inspiration returns. I've done that. The inspiration is there. The self-doubt, however, is stronger.\n\n**How do others deal with it?**\n\nOne idea I've had is forming a \"study group\" with like-minded photographers of a similar level to help each other improve and grow, as Mads Peter Iversen suggested in a recent video. I probably need to make that happen soon. Also, maybe I'm just getting extra sad lately from not being able to get out into the mountains due to the quarantine. This is the longest I haven't hiked in 4 years.\n\nAnyway, thanks for reading! I would love to hear your thoughts if you can relate.", "link": "https://www.reddit.com/r/photography/comments/g99cu3/dealing_with_selfdoubt/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i find creating", "selectorShort": "create", "MarkedSent": "dealing with self-doubt /!/ hey folks, i wanted to start a discussion about a topic i struggle with, and i think i'm probably not alone in this.\n\nthat topic is self-doubt when it comes to your ability and potential as a photographer.\n\nin many other fields, there is a positive feedback loop that keeps you going. i find that photography is lacking this aspect which for me seems to be critical.\n\nfor example, with conventional jobs, it's straight-forward. go to school, work hard, and you get rewarded with good grades and a job offer. then you're further rewarded with a guaranteed salary, praise for your good work, promotions, etc. you have a manager and a team who will support you (ideally). i mean, this all can vary wildly, but in my experience this was mostly the case. it's like playing an mmorpg in real life -- there are straight-forward quests and a clear progression for you to follow.\n\nthen you have less conventional fields. i was a musician for a while, and that was certainly more difficult, but there was so much positive reinforcement. first of all, your bandmates will tell you when your ideas are actually good, and help keep things going when you feel down. second, when you play a show and people visibly appreciate your music and tell you how great it was, it feels incredible. third, putting your work out there yields results. things like reviews, articles, radio airplay, etc just sort of happened naturally. it's a saturated field, for sure, but not as saturated as photography -- i think it takes more work to produce something that people are willing to take a listen to. there's really not \\*that\\* much original, high quality work in my opinion.\n\nthen you have photography. there's no team or band -- you're on your own. so, when you lack confidence in your ability, no one will support you. you put your work out there, but even a 97-98 pulse on 500px will only get you 5 new followers. the same images will do very little on instagram unless they get featured, which might yield 20 followers. (just my experience, purely anecdotal.) but, even great images easily disappear into the void unnoticed since the field is so saturated, so let's say only one out of every 4 images gets featured somewhere (unlikely). so, you can create 100 professional quality images and end up with 100 \\* 5 = 500 followers on 500px, and 100 / 4 \\* 20 = 500 followers on instagram.\n\nthat's certainly a start, but there are people with images that are unoriginal and bad to mediocre in quality, and 5 figure followings. their work will rank higher than yours no matter how good your images are. **and maybe that's fine if you can somehow know that your work is good, social media is perhaps a bad metric for quality, but after a while, how do you know? maybe it's actually bad and you're just just delusional? maybe you're just not a real artist? maybe the reason for your lack of following is that you just suck and no one has the heart to tell you?** that's how i feel when i don't have any validation, at least. i'm sure some of you feel the same.\n\nnow, i don't think i have 100 professional level images yet, i have maybe 10. i consider most of my work utter garbage and have a long way to go. but, to even get to this point it took many years. the amount of work needed to crate one high quality image is super high, and even once you're good it takes time. i remember thomas heaton mentioning he gets maybe 1 \"keeper\" per month even while doing it full time. so, at the rate i'm going, i just don't see the light at the end of the tunnel here.\n\n(that light being some strong positive response that will encourage you to keep going)\n\nof course, it's about the journey, and i would find it very hard to not do photography. i really love it. but seeing my work getting nowhere while i had achieved success with much greater ease in other fields is demoralizing and makes me doubt my abilities, which in turn makes me enjoy it less and just wonder if my time is better spent elsewhere.\n\nultimately i want to add value to the world, not just spend my time doing stuff i enjoy. otherwise -----> i !!! 'd just be playing videogames or hiking all day, but, -----> i !!!  -----> find !!!  -----> creating !!!  something people appreciate to be more fulfilling. a common advice is to take a break from photography and see if inspiration returns. i've done that. the inspiration is there. the self-doubt, however, is stronger.\n\n**how do others deal with it?**\n\none idea i've had is forming a \"study group\" with like-minded photographers of a similar level to help each other improve and grow, as mads peter iversen suggested in a recent video. i probably need to make that happen soon. also, maybe i'm just getting extra sad lately from not being able to get out into the mountains due to the quarantine. this is the longest i haven't hiked in 4 years.\n\nanyway, thanks for reading! i would love to hear your thoughts if you can relate.", "sortedWord": "None", "Identifyer": null, "identifyer": 78737, "year": "2020"}, {"autor": "arshrhere13", "date": "2020-04-29 00:26:49", "content": "Best Custom Photo Book Website? /!/ I'm creating a photo series of all my friends in Quarantine, and I want to make like a physical coffee table book with all of the photos. Do you guys have any recommendations for a website where I can create a custom photo book?\n\nI found [artifactuprising.com](https://artifactuprising.com) and it seems cool so far but if anyone has any other recommendations, I'd love to hear them.", "link": "https://www.reddit.com/r/photography/comments/g9z7pw/best_custom_photo_book_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "best custom photo book website? /!/ -----> i !!! 'm -----> creating !!!  a photo series of all my friends in quarantine, and -----> i !!!  want to make like a physical coffee table book with all of the photos. do you guys have any recommendations for a website where i can create a custom photo book?\n\ni found [artifactuprising.com](https://artifactuprising.com) and it seems cool so far but if anyone has any other recommendations, i'd love to hear them.", "sortedWord": "None", "Identifyer": null, "identifyer": 78827, "year": "2020"}, {"autor": "cinghialino", "date": "2020-05-01 17:19:44", "content": "[help] need to quote for a stock photo. Any Fotoquote users here? /!/ I've been requested to create a license fee for an image for a book, and I need to understand what ballpark I'm in.\n\nI'm wondering if any Fotoquote users or any other photographer more expert than me can help me figure out a quote for this. \n\nHere are the specs.\n\n* Type: book\n* Run: up to 100.000 copies to be printed\n* Territories: All territories (worldwide)\n* Languages: all languages\n* Duration: 5 to 10 years.\n\nthanks\n\np.s. I'm in the USA.", "link": "https://www.reddit.com/r/photography/comments/gbm8tt/help_need_to_quote_for_a_stock_photo_any/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've been requested to create", "selectorShort": "create", "MarkedSent": "[help] need to quote for a stock photo. any fotoquote users here? /!/ -----> i !!! 've -----> been !!!  -----> requested !!!  -----> to !!!  -----> create !!!  a license fee for an image for a book, and -----> i !!!  need -----> to !!!  understand what ballpark -----> i !!! 'm in.\n\ni'm wondering if any fotoquote users or any other photographer more expert than me can help me figure out a quote for this. \n\nhere are the specs.\n\n* type: book\n* run: up to 100.000 copies to be printed\n* territories: all territories (worldwide)\n* languages: all languages\n* duration: 5 to 10 years.\n\nthanks\n\np.s. i'm in the usa.", "sortedWord": "None", "Identifyer": null, "identifyer": 78924, "year": "2020"}, {"autor": "Shreky84", "date": "2020-05-07 19:53:47", "content": "What software/app should I use to create a photo collage/mosaic /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gfdu2k/what_softwareapp_should_i_use_to_create_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i use to create", "selectorShort": "create", "MarkedSent": "what software/app should -----> i !!!  -----> use !!!  -----> to !!!  -----> create !!!  a photo collage/mosaic /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 79094, "year": "2020"}, {"autor": "tonymorph", "date": "2020-05-09 05:51:23", "content": "Disposable nature shots /!/ Hey gang! I just recently created a subreddit dedicated to nature pictures taken with disposable cameras /naturedisposables, as I’ve struggled to find any communities related to the fun that is bringing a disposable with you on a trip or adventure. Feel free to check it out and throw some pictures in there if you have any! Cheers 😁", "link": "https://www.reddit.com/r/photography/comments/gg9ver/disposable_nature_shots/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just recently created", "selectorShort": "create", "MarkedSent": "disposable nature shots /!/ hey gang! -----> i !!!  -----> just !!!  -----> recently !!!  -----> created !!!  a subreddit dedicated to nature pictures taken with disposable cameras /naturedisposables, as -----> i !!! ’ve struggled to find any communities related to the fun that is bringing a disposable with you on a trip or adventure. feel free to check it out and throw some pictures in there if you have any! cheers 😁", "sortedWord": "None", "Identifyer": null, "identifyer": 79168, "year": "2020"}, {"autor": "Hunt695", "date": "2020-05-12 17:17:26", "content": "Professional Nails/Manicure photography gear advice /!/ Hi all, amateur photographer here.\n\nI have a task to do continuous photo shooting of Nails (Gel, permanent polish, manicure etc..). I would like to create a dark ambient with focus on nails, using as little light as possible and black coated backgrounds.   \nCurrently I have old Canon EOS 550d paired with Tokina 100mm, F2.8 Macro and still looking/testing for the best config.  \n\n\nMy budget is limited, but was hoping to buy used Canon EOS 6D, or 6D Mark II and some other lense for it. So questions are, what camera, what lense and what additional gear?  \nI'd really appreiate some guidance on gear and setups if anyone has experience with this.  \nI'm hoping to achieve results similar to the attached image.", "link": "https://www.reddit.com/r/photography/comments/gifkbb/professional_nailsmanicure_photography_gear_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "professional nails/manicure photography gear advice /!/ hi all, amateur photographer here.\n\ni have a task to do continuous photo shooting of nails (gel, permanent polish, manicure etc..). -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  a dark ambient with focus on nails, using as little light as possible and black coated backgrounds.   \ncurrently i have old canon eos 550d paired with tokina 100mm, f2.8 macro and still looking/testing for the best config.  \n\n\nmy budget is limited, but was hoping to buy used canon eos 6d, or 6d mark ii and some other lense for it. so questions are, what camera, what lense and what additional gear?  \ni'd really appreiate some guidance on gear and setups if anyone has experience with this.  \ni'm hoping to achieve results similar to the attached image.", "sortedWord": "None", "Identifyer": null, "identifyer": 79438, "year": "2020"}, {"autor": "malharmpatil", "date": "2020-05-21 11:17:30", "content": "Create your lockdown memories! /!/ Log your moments at home!!", "link": "https://www.reddit.com/r/photography/comments/gnuzw6/create_your_lockdown_memories/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  your lockdown memories! /!/ log your moments at home!!", "sortedWord": "None", "Identifyer": null, "identifyer": 79760, "year": "2020"}, {"autor": "[deleted]", "date": "2020-06-13 20:29:07", "content": "We have created a team that would like to produce photo sessions that will show feminine beauty. Is this photo a good starting point? /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/h8f57w/we_have_created_a_team_that_would_like_to_produce/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we have created", "selectorShort": "create", "MarkedSent": "-----> we !!!  -----> have !!!  -----> created !!!  a team that would like to produce photo sessions that will show feminine beauty. is this photo a good starting point? /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 80723, "year": "2020"}, {"autor": "merwanedr", "date": "2020-06-17 09:29:39", "content": "Popbot - Apply color splash effects using AI. /!/ You can use Popbot to automatically apply color splash effects to photos by selecting a subject. I created it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jFOCU](https://gumroad.com/l/jFOCU)", "link": "https://www.reddit.com/r/photography/comments/hanxt5/popbot_apply_color_splash_effects_using_ai/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "popbot - apply color splash effects using ai. /!/ you can use popbot to automatically apply color splash effects to photos by selecting a subject. -----> i !!!  -----> created !!!  it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jfocu](https://gumroad.com/l/jfocu)", "sortedWord": "None", "Identifyer": null, "identifyer": 80955, "year": "2020"}, {"autor": "speedyjumper", "date": "2020-07-02 14:01:58", "content": "I'm creating a free website builder to host your portfolio [Feedback please] /!/ Hey guys,\n\nI've been working on this as a bit of a side project whilst balancing my time at university.\n\nWas wondering what specific features you look for in a website builder, especially ones centred around photography\n\nNo signup is required to test out the platform.\n\nYou can view it here: [https://webstraw.com](https://webstraw.com)\n\nAny feedback is appreciated! :)", "link": "https://www.reddit.com/r/photography/comments/hjxjyc/im_creating_a_free_website_builder_to_host_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm -----> creating !!!  a free website builder to host your portfolio [feedback please] /!/ hey guys,\n\ni've been working on this as a bit of a side project whilst balancing my time at university.\n\nwas wondering what specific features you look for in a website builder, especially ones centred around photography\n\nno signup is required to test out the platform.\n\nyou can view it here: [https://webstraw.com](https://webstraw.com)\n\nany feedback is appreciated! :)", "sortedWord": "None", "Identifyer": null, "identifyer": 81986, "year": "2020"}, {"autor": "Vajrick_Buddha", "date": "2020-08-15 23:33:10", "content": "How has the phone camera age changed the culture of photography? /!/ Having returned from a family trip, I upload all the tons of photos from my phone on the computer, and start sorting through them on the PC, worried about which is best for the album I might create.\n\nNowadays, our technologies allow us to snap ten pictures of each piece, each object, each person we encounter. The rationale is that the more we snap, the higher the chances of getting a good picture. \n\nBefore, however, we had no such luxuries - no on the spot pic-selection, no wasting film on one single thing, [not to mention no instant editing]. \n\nIn your opinion, how has this deep change in photography impacted the culture, technique and mindset of photographers (namely enthusiasts)?", "link": "https://www.reddit.com/r/photography/comments/iahwti/how_has_the_phone_camera_age_changed_the_culture/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i might create", "selectorShort": "create", "MarkedSent": "how has the phone camera age changed the culture of photography? /!/ having returned from a family trip, -----> i !!!  upload all the tons of photos from my phone on the computer, and start sorting through them on the pc, worried about which is best for the album -----> i !!!  -----> might !!!  -----> create !!! .\n\nnowadays, our technologies allow us to snap ten pictures of each piece, each object, each person we encounter. the rationale is that the more we snap, the higher the chances of getting a good picture. \n\nbefore, however, we had no such luxuries - no on the spot pic-selection, no wasting film on one single thing, [not to mention no instant editing]. \n\nin your opinion, how has this deep change in photography impacted the culture, technique and mindset of photographers (namely enthusiasts)?", "sortedWord": "None", "Identifyer": null, "identifyer": 82123, "year": "2020"}, {"autor": "LightSweep", "date": "2020-07-06 14:17:27", "content": "Recreating Fujifilm's \"Color Chrome\" Effect in Affinity Photo /!/ Hello!\n\nBack in 2017 Fujifilm launched their 1st medium-format mirrorless camera: the Fujifilm GFX50S. It contained all the Fujifilm \"film simulations\" that us Fujifilm camera users have all come to know and love, but it gained an extra effect: the **Color Chrome effect**.\n\nThis effect was inspired by Fujifilm's own FUJICHROME Fortia SP film, which promised even greater contrast and colours in comparison to the world-famous Velvia 50.\n\nQuoting from Fujifilm-X:\n\n&gt;Usually, when photographing colors such as red, orange, or green under high-contrast conditions, it’s easy for an RGB color channel to become overloaded – as if individually too bright. Under these conditions – with contrast and brightness at a maximum – there is no room for a full range of tones and the scene tends to look a bit flat. But with Color Chrome switched on, subtle differences of tone can be detected and enhanced. The result is a punchy, high saturation image that doesn’t lose its impact and depth.\n\nThis Color Chrome effect was later ported to newer Fujifilm-X cameras, such as the Fujifilm X-T3 and the X-T30. Unfortunately, us older Fujifilm-X users (I have a Fujifilm X-T2) may never see this effect on their camera. \n\nSo I've resolved to try and recreate it, which is pretty easy to do in Affinity Photo.\n\n[https://www.iancylkowski.com/blog/2020/7/4/fujifilm-color-chrome-effect-how-to-recreate-in-affinity-photo](https://www.iancylkowski.com/blog/2020/7/4/fujifilm-color-chrome-effect-how-to-recreate-in-affinity-photo)\n\nThe tutorial utilises Affinity Photo's LAB colour mode in the Curves Adjustment tool, which is so, so handy. I've also created two Affinity Photo Macros; both speed up the creation of the LAB Colour Boost layer as well as the creation of a Saturation Mask. I've added them as free downloads in my tutorial.\n\nHere's some before and afters.\n\n[Sample image I worked with, straight out camera using the Provia \\(Standard\\) film emulation.](https://preview.redd.it/krob5ubgw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=fe0ea70687886669d535237642c9d08a2d5bdbd4)\n\n&amp;#x200B;\n\n[After some minor edits I made \\(mostly changing the film emulation from Provia to Velvia\\).](https://preview.redd.it/erqapb9kw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=29db1cdceed08c07fd347dea8b563b8ca29d2f88)\n\n&amp;#x200B;\n\n[Final image with my Color Chrome effect applied.](https://preview.redd.it/ieijb65nw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=881f78a57cad297d7494acf96f5a91a2fe627ca2)\n\nDo let me know if this tutorial is OK to link to here, or not.\n\nI hope this proves useful! Let me know if the effect needs some improvement.", "link": "https://www.reddit.com/r/photography/comments/hm8g2h/recreating_fujifilms_color_chrome_effect_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've also created", "selectorShort": "create", "MarkedSent": "recreating fujifilm's \"color chrome\" effect in affinity photo /!/ hello!\n\nback in 2017 fujifilm launched their 1st medium-format mirrorless camera: the fujifilm gfx50s. it contained all the fujifilm \"film simulations\" that us fujifilm camera users have all come to know and love, but it gained an extra effect: the **color chrome effect**.\n\nthis effect was inspired by fujifilm's own fujichrome fortia sp film, which promised even greater contrast and colours in comparison to the world-famous velvia 50.\n\nquoting from fujifilm-x:\n\n&gt;usually, when photographing colors such as red, orange, or green under high-contrast conditions, it’s easy for an rgb color channel to become overloaded – as if individually too bright. under these conditions – with contrast and brightness at a maximum – there is no room for a full range of tones and the scene tends to look a bit flat. but with color chrome switched on, subtle differences of tone can be detected and enhanced. the result is a punchy, high saturation image that doesn’t lose its impact and depth.\n\nthis color chrome effect was later ported to newer fujifilm-x cameras, such as the fujifilm x-t3 and the x-t30. unfortunately, us older fujifilm-x users (i have a fujifilm x-t2) may never see this effect on their camera. \n\nso i've resolved to try and recreate it, which is pretty easy to do in affinity photo.\n\n[https://www.iancylkowski.com/blog/2020/7/4/fujifilm-color-chrome-effect-how-to-recreate-in-affinity-photo](https://www.iancylkowski.com/blog/2020/7/4/fujifilm-color-chrome-effect-how-to-recreate-in-affinity-photo)\n\nthe tutorial utilises affinity photo's lab colour mode in the curves adjustment tool, which is so, so handy. -----> i !!! 've -----> also !!!  -----> created !!!  two affinity photo macros; both speed up the creation of the lab colour boost layer as well as the creation of a saturation mask. i've added them as free downloads in my tutorial.\n\nhere's some before and afters.\n\n[sample image i worked with, straight out camera using the provia \\(standard\\) film emulation.](https://preview.redd.it/krob5ubgw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=fe0ea70687886669d535237642c9d08a2d5bdbd4)\n\n&amp;#x200b;\n\n[after some minor edits i made \\(mostly changing the film emulation from provia to velvia\\).](https://preview.redd.it/erqapb9kw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=29db1cdceed08c07fd347dea8b563b8ca29d2f88)\n\n&amp;#x200b;\n\n[final image with my color chrome effect applied.](https://preview.redd.it/ieijb65nw8951.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=881f78a57cad297d7494acf96f5a91a2fe627ca2)\n\ndo let me know if this tutorial is ok to link to here, or not.\n\ni hope this proves useful! let me know if the effect needs some improvement.", "sortedWord": "None", "Identifyer": null, "identifyer": 82183, "year": "2020"}, {"autor": "_themostloneliestday", "date": "2020-08-25 11:31:24", "content": "500px pro membership: yay or nay? /!/ Hey y'all!\n\nI recently created an account on 500px, in order to create a portfolio, motivate myself to take more pictures and maybe to sell something, if I ever upload a decent image. I'd consider myself an amateur/experimental photographer, if it makes any difference \n\nI was wondering if the pro membership is worth paying for, or I I should get the awesome membership, or even no membership at all.", "link": "https://www.reddit.com/r/photography/comments/igabqu/500px_pro_membership_yay_or_nay/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "500px pro membership: yay or nay? /!/ hey y'all!\n\n-----> i !!!  -----> recently !!!  -----> created !!!  an account on 500px, in order to create a portfolio, motivate myself to take more pictures and maybe to sell something, if -----> i !!!  ever upload a decent image. i'd consider myself an amateur/experimental photographer, if it makes any difference \n\ni was wondering if the pro membership is worth paying for, or i i should get the awesome membership, or even no membership at all.", "sortedWord": "None", "Identifyer": null, "identifyer": 82422, "year": "2020"}, {"autor": "1mag1nat1on", "date": "2020-08-28 18:24:33", "content": "Photography Legal Advice /!/ Hey all.\n\nSo an organization hired me to take pictures for them. Pictures were taken and I sent them the pictures. I also sent the pictures to an athlete and coach privately so that they could use them for their own social media. I was then sent an email that I could not send the images to them privately for their own use. The organization would rather have them share the social media posts instead of posting the pictures themselves.  \n\n\nI understand that I should have created a contract, but I haven't as this was a bit more casual. I will make sure to do that next time.\n\nI just want to know what you guys would do and if this sounds a little bit weird.\n\n&amp;#x200B;\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/iici5z/photography_legal_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i should have created", "selectorShort": "create", "MarkedSent": "photography legal advice /!/ hey all.\n\nso an organization hired me to take pictures for them. pictures were taken and i sent them the pictures. i also sent the pictures to an athlete and coach privately so that they could use them for their own social media. i was then sent an email that i could not send the images to them privately for their own use. the organization would rather have them share the social media posts instead of posting the pictures themselves.  \n\n\n-----> i !!!  understand that -----> i !!!  -----> should !!!  -----> have !!!  -----> created !!!  a contract, but -----> i !!!  -----> have !!! n't as this was a bit more casual. i will make sure to do that next time.\n\ni just want to know what you guys would do and if this sounds a little bit weird.\n\n&amp;#x200b;\n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 82504, "year": "2020"}, {"autor": "robotoredux696969", "date": "2020-09-03 13:45:10", "content": "Nikon Z6 Timelapse: What is the relationship between interval and shutter speed? /!/ I recently created a time lapse using time lapse mode on the Nikon Z6. I used the following settings for shooting. \n\nLink to Video: [https://youtu.be/5QeNqAH6gR0](https://youtu.be/5QeNqAH6gR0)\n\nIf you look at the clouds around the halfway mark you will notice significant stuttering. I have some confusion about the relationship between interval time and shutter speed time. I set them to both be 2 seconds but I also set interval priority to \"OFF\".  Should the interval be longer than the shutter speed even though interval priority is off? For example: if I had a shutter speed of 2 seconds and interval of 3 seconds, then wouldn't the time lapse lose fluidity due to the missing one second of exposure (i,e, 3-2 seconds = 1 second lost exposure). Any advice on how to avoid dropping frames would be appreciated.\n\nThese are the settings I used:\n\nShutter Speed - 2'' \n\nInterval - 2'' \n\nInterval Priority - Off \n\nISO - 100 \n\nAperture - f22", "link": "https://www.reddit.com/r/photography/comments/iltnw8/nikon_z6_timelapse_what_is_the_relationship/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "nikon z6 timelapse: what is the relationship between interval and shutter speed? /!/ -----> i !!!  -----> recently !!!  -----> created !!!  a time lapse using time lapse mode on the nikon z6. i used the following settings for shooting. \n\nlink to video: [https://youtu.be/5qenqah6gr0](https://youtu.be/5qenqah6gr0)\n\nif you look at the clouds around the halfway mark you will notice significant stuttering. i have some confusion about the relationship between interval time and shutter speed time. i set them to both be 2 seconds but i also set interval priority to \"off\".  should the interval be longer than the shutter speed even though interval priority is off? for example: if i had a shutter speed of 2 seconds and interval of 3 seconds, then wouldn't the time lapse lose fluidity due to the missing one second of exposure (i,e, 3-2 seconds = 1 second lost exposure). any advice on how to avoid dropping frames would be appreciated.\n\nthese are the settings i used:\n\nshutter speed - 2'' \n\ninterval - 2'' \n\ninterval priority - off \n\niso - 100 \n\naperture - f22", "sortedWord": "None", "Identifyer": null, "identifyer": 82671, "year": "2020"}, {"autor": "SnooAdvice910", "date": "2020-09-03 00:29:41", "content": "I just created an account for my photos! It’s an account based on polaroids! I’m a newbie at this and it’s just a hobby but I thought everyone could enjoy it! I don’t take any money but I would like to gain some followers!", "link": "https://www.reddit.com/r/photography/comments/ilj5q6/i_just_created_an_account_for_my_photos_its_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> just !!!  -----> created !!!  an account for my photos! it’s an account based on polaroids! i’m a newbie at this and it’s just a hobby but i thought everyone could enjoy it! i don’t take any money but i would like to gain some followers!", "sortedWord": "None", "Identifyer": null, "identifyer": 82705, "year": "2020"}, {"autor": "abstractdrawing", "date": "2020-09-16 12:36:01", "content": "Creating prints of photos: Sites vs Local labs /!/ So I'm getting to a spot where I am feeling more comfortable with my photography and editing capabilities. I want to create some prints, but don't exactly know where to start. I've had a few friends mention they go to local places (which I'd like, but I have no idea what photos I want as prints), and others who mention sites like Darkroom and Pixieset (which seems like it may be a good start for me to help decide what people are leaning towards and liking, but I don't know what the quality would be like in the photos). \n\nWas wondering what experienced photographers thoughts were on these, or if they had other suggestions they prefer.", "link": "https://www.reddit.com/r/photography/comments/itul4k/creating_prints_of_photos_sites_vs_local_labs/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  prints of photos: sites vs local labs /!/ so i'm getting to a spot where i am feeling more comfortable with my photography and editing capabilities. i want to create some prints, but don't exactly know where to start. i've had a few friends mention they go to local places (which i'd like, but i have no idea what photos i want as prints), and others who mention sites like darkroom and pixieset (which seems like it may be a good start for me to help decide what people are leaning towards and liking, but i don't know what the quality would be like in the photos). \n\nwas wondering what experienced photographers thoughts were on these, or if they had other suggestions they prefer.", "sortedWord": "None", "Identifyer": null, "identifyer": 82772, "year": "2020"}, {"autor": "flymickeyfly", "date": "2020-09-13 16:02:46", "content": "Creating a photo poll for shortlisting portfolio photos /!/ Hello everyone, \n\nI'm revamping my entire portfolio as it hadn't been updated in a couple of years(!). That's OK because I haven't really been seeking to drive traffic to my site in that time. \n\nIn doing so I have selected my top photos and I've a group of friends who will happily look through them and rate them. The question to you all is, what is the best way of doing this? Sites like PollUnit, allow you to upload all your photos but for more than 20 you're paying a subscription. I have a LR subscription and I wondered if there might be a way of doing that with LR (but not cross-posting to that community as this isn't really a LR question). \n\nAny advice is warmly welcomed!", "link": "https://www.reddit.com/r/photography/comments/is0vc5/creating_a_photo_poll_for_shortlisting_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a photo poll for shortlisting portfolio photos /!/ hello everyone, \n\ni'm revamping my entire portfolio as it hadn't been updated in a couple of years(!). that's ok because i haven't really been seeking to drive traffic to my site in that time. \n\nin doing so i have selected my top photos and i've a group of friends who will happily look through them and rate them. the question to you all is, what is the best way of doing this? sites like pollunit, allow you to upload all your photos but for more than 20 you're paying a subscription. i have a lr subscription and i wondered if there might be a way of doing that with lr (but not cross-posting to that community as this isn't really a lr question). \n\nany advice is warmly welcomed!", "sortedWord": "None", "Identifyer": null, "identifyer": 82975, "year": "2020"}, {"autor": "TheBabaYagaMan", "date": "2020-09-23 20:48:51", "content": "Creating a section of my e-commerce website to sell photography, any help? /!/ I've ran a fairly successful e-commerce site for around a year now, we have mostly focused on audio but the goal is to be a place for all creatives to find resources and also make an income and not just musicians. I'm currently in the process of building out the photography section and was looking for some advice.\n\nI know this is a slight issue, i know basically nothing about photography, thankfully my girlfriend does but she lacks knowledge of the business side of stuff. So my goal here is to have a place to sell photos for people to use either personally or commercially, they will gain a licence similar to how purchasing audio works. It seems fairly straightforward, am i missing anything? I'll of course look more into how other similar platforms work before hand but just asking for your advice for now.\n\nAnother thing, is there anything you would want from a platform like mine? Say you are looking to sell you images, what do you want from me? how can a platform like mine aid and help you?\n\nLastly, im looking for partners on this, people who will be able to put their content on the site but also people who will be able to give me their feedback on how to make this section great for not only the customers but the creators who are selling on the site. If you are interested please get in touch.", "link": "https://www.reddit.com/r/photography/comments/iyisep/creating_a_section_of_my_ecommerce_website_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a section of my e-commerce website to sell photography, any help? /!/ i've ran a fairly successful e-commerce site for around a year now, we have mostly focused on audio but the goal is to be a place for all creatives to find resources and also make an income and not just musicians. i'm currently in the process of building out the photography section and was looking for some advice.\n\ni know this is a slight issue, i know basically nothing about photography, thankfully my girlfriend does but she lacks knowledge of the business side of stuff. so my goal here is to have a place to sell photos for people to use either personally or commercially, they will gain a licence similar to how purchasing audio works. it seems fairly straightforward, am i missing anything? i'll of course look more into how other similar platforms work before hand but just asking for your advice for now.\n\nanother thing, is there anything you would want from a platform like mine? say you are looking to sell you images, what do you want from me? how can a platform like mine aid and help you?\n\nlastly, im looking for partners on this, people who will be able to put their content on the site but also people who will be able to give me their feedback on how to make this section great for not only the customers but the creators who are selling on the site. if you are interested please get in touch.", "sortedWord": "None", "Identifyer": null, "identifyer": 83080, "year": "2020"}, {"autor": "hellbike", "date": "2020-07-22 14:07:41", "content": "I created a photography project about the conflict between the LGBT community and the polish government (and it goes Viral in my country)", "link": "https://www.reddit.com/r/photography/comments/hvuedu/i_created_a_photography_project_about_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a photography project about the conflict between the lgbt community and the polish government (and it goes viral in my country)", "sortedWord": "None", "Identifyer": null, "identifyer": 83492, "year": "2020"}, {"autor": "Substantial_Ad8238", "date": "2020-10-03 04:55:35", "content": "Disappointed in my first portrait shoot. /!/ First time working with a flash and a strobe and posing. Up to now only shot landscape, and photojournalism. Posing was alright, I did okay for my first shot with a guy who is pretty awkward. However, lighting the sun was set and the clouds were pretty dense an rainy so I had to work with mostly all artificial light. The problem was the fill, I didn't realize it on my small LCD, but in some shots it was too strong and casted shadows / I didn't bounce well enough.\n\nLighting was most forgiving when I had enough of it around 3:30-5:30pm. Once it started going down I actually did worse in golden hour. I think I didn't create good enough fills with my flash because it didn't bounce properly off the wall.\n\nI also fumbled with the gear a few times, because I had only tried it out once the day before learning it all. For the most part it wasn't too bad though since I prepared in advanced. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/mfcjes119tq51.jpg?width=1957&amp;format=pjpg&amp;auto=webp&amp;s=7a4c064f882d3f912324b126641bfee5e234be51\n\nhttps://preview.redd.it/jutb1p119tq51.jpg?width=1220&amp;format=pjpg&amp;auto=webp&amp;s=275308017b9b4b8f382b825726e062b7e53eb492\n\nhttps://preview.redd.it/fux1ro119tq51.jpg?width=1262&amp;format=pjpg&amp;auto=webp&amp;s=f05b3a7b51bf3044ac120d7125f1f73fc011aaec\n\nhttps://preview.redd.it/hxuwgt119tq51.jpg?width=1907&amp;format=pjpg&amp;auto=webp&amp;s=b6e7ec8cc2a4e82dbb4d6312e150631c098bcce7", "link": "https://www.reddit.com/r/photography/comments/j49yf6/disappointed_in_my_first_portrait_shoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i didn't create", "selectorShort": "create", "MarkedSent": "disappointed in my first portrait shoot. /!/ first time working with a flash and a strobe and posing. up to now only shot landscape, and photojournalism. posing was alright, i did okay for my first shot with a guy who is pretty awkward. however, lighting the sun was set and the clouds were pretty dense an rainy so i had to work with mostly all artificial light. the problem was the fill, i didn't realize it on my small lcd, but in some shots it was too strong and casted shadows / i didn't bounce well enough.\n\nlighting was most forgiving when i had enough of it around 3:30-5:30pm. once it started going down i actually did worse in golden hour. -----> i !!!  think -----> i !!!  -----> did !!! -----> n't !!!  -----> create !!!  good enough fills with my flash because it -----> did !!! -----> n't !!!  bounce properly off the wall.\n\ni also fumbled with the gear a few times, because i had only tried it out once the day before learning it all. for the most part it wasn't too bad though since i prepared in advanced. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/mfcjes119tq51.jpg?width=1957&amp;format=pjpg&amp;auto=webp&amp;s=7a4c064f882d3f912324b126641bfee5e234be51\n\nhttps://preview.redd.it/jutb1p119tq51.jpg?width=1220&amp;format=pjpg&amp;auto=webp&amp;s=275308017b9b4b8f382b825726e062b7e53eb492\n\nhttps://preview.redd.it/fux1ro119tq51.jpg?width=1262&amp;format=pjpg&amp;auto=webp&amp;s=f05b3a7b51bf3044ac120d7125f1f73fc011aaec\n\nhttps://preview.redd.it/hxuwgt119tq51.jpg?width=1907&amp;format=pjpg&amp;auto=webp&amp;s=b6e7ec8cc2a4e82dbb4d6312e150631c098bcce7", "sortedWord": "None", "Identifyer": null, "identifyer": 83999, "year": "2020"}, {"autor": "clockkeep", "date": "2020-11-28 09:32:21", "content": "Black backdrop that won’t pick up lint? /!/ Currently using a Foldio portable studio for photos of various modded Gameboys I create. Depending on the design/colors for each system, I go with different backdrops but the most common is Black. The Foldio system provides a black backdrop, and while its great it’s also made of a felt-ish material and collects lint/dust like that’s it’s full time job. Example seen [here](https://m.media-amazon.com/images/I/81pq9gRxAlL.jpg). Any recommended materials that would provide a similar look/light reflectance without needing to lint roll it every 2 minutes?", "link": "https://www.reddit.com/r/photography/comments/k2kwh1/black_backdrop_that_wont_pick_up_lint/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "black backdrop that won’t pick up lint? /!/ currently using a foldio portable studio for photos of various modded gameboys -----> i !!!  -----> create !!! . depending on the design/colors for each system, i go with different backdrops but the most common is black. the foldio system provides a black backdrop, and while its great it’s also made of a felt-ish material and collects lint/dust like that’s it’s full time job. example seen [here](https://m.media-amazon.com/images/i/81pq9grxall.jpg). any recommended materials that would provide a similar look/light reflectance without needing to lint roll it every 2 minutes?", "sortedWord": "None", "Identifyer": null, "identifyer": 84444, "year": "2020"}, {"autor": "Spardantex", "date": "2020-12-13 15:34:32", "content": "Is there any software that recognizes people in photos and rename them? /!/ Hi people, let me explain better. I am creating my \"time machine\" of the photos that I have accumulated over the years, and I would like to categorize (rename) them by name of people. Is there anything that does the \"dirty\" work for you? That is, rename the photos based on the name of the subject in the photo", "link": "https://www.reddit.com/r/photography/comments/kccjjp/is_there_any_software_that_recognizes_people_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "is there any software that recognizes people in photos and rename them? /!/ hi people, let me explain better. -----> i !!!  -----> am !!!  -----> creating !!!  my \"time machine\" of the photos that -----> i !!!  have accumulated over the years, and -----> i !!!  would like to categorize (rename) them by name of people. is there anything that does the \"dirty\" work for you? that is, rename the photos based on the name of the subject in the photo", "sortedWord": "None", "Identifyer": null, "identifyer": 85155, "year": "2020"}, {"autor": "GimmeDatSideHug", "date": "2020-12-13 08:35:11", "content": "Had an SD card malfunction. /!/ \n\nI used a new card and all the files were corrupted. \n\nI bought a couple of Sandisk Extreme Pro 64GB 170 mb/s cards. They appear to be legit. I used one in my new Sony A7iii. The cards came with an EBS card reader, so I popped it in the card reader and inserted it into my laptop (Win 10). I imported into Lightroom no problem. I then transferred a couple of finished photos onto the card. I put the card reader in my other lap top (win 7). \n\nThen, I created a folder on the card and put the photos in the folder. I transferred the folder to the laptop. But when I clicked on the folder, it didn’t have any photos in it. I checked the folder on the card, and the photos had disappeared. Then, the computer told me I had to format the card before I could use it. I tried it via the card reader on both laptops. Kept telling me I needed to reformat. I put the card straight into the internal reader on one laptop- same message. \n\nDid I do something wrong? Did the card reader corrupt the files or was it the card? I’ve used that brand of card for years and never had any issue. Now, I’m scared and I don’t know what caused the error.", "link": "https://www.reddit.com/r/photography/comments/kc78kq/had_an_sd_card_malfunction/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "had an sd card malfunction. /!/ \n\ni used a new card and all the files were corrupted. \n\ni bought a couple of sandisk extreme pro 64gb 170 mb/s cards. they appear to be legit. i used one in my new sony a7iii. the cards came with an ebs card reader, so i popped it in the card reader and inserted it into my laptop (win 10). i imported into lightroom no problem. i then transferred a couple of finished photos onto the card. i put the card reader in my other lap top (win 7). \n\nthen, -----> i !!!  -----> created !!!  a folder on the card and put the photos in the folder. i transferred the folder to the laptop. but when i clicked on the folder, it didn’t have any photos in it. i checked the folder on the card, and the photos had disappeared. then, the computer told me i had to format the card before i could use it. i tried it via the card reader on both laptops. kept telling me i needed to reformat. i put the card straight into the internal reader on one laptop- same message. \n\ndid i do something wrong? did the card reader corrupt the files or was it the card? i’ve used that brand of card for years and never had any issue. now, i’m scared and i don’t know what caused the error.", "sortedWord": "None", "Identifyer": null, "identifyer": 85181, "year": "2020"}, {"autor": "Mario7887", "date": "2020-12-15 15:21:12", "content": "Need help with keeping products in the same place for every photo, without playing with hue /!/ Hello, i am aiming to create alot of multiple product photography for wallets that has different colors, and i was wondering how can I keep the products in the same place in every picture. Keep in mind the leathers in each product has a different pattern meaning i can't just play with the hue.", "link": "https://www.reddit.com/r/photography/comments/kdnlsw/need_help_with_keeping_products_in_the_same_place/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am aiming to create", "selectorShort": "create", "MarkedSent": "need help with keeping products in the same place for every photo, without playing with hue /!/ hello, -----> i !!!  -----> am !!!  -----> aiming !!!  -----> to !!!  -----> create !!!  alot of multiple product photography for wallets that has different colors, and -----> i !!!  was wondering how can -----> i !!!  keep the products in the same place in every picture. keep in mind the leathers in each product has a different pattern meaning i can't just play with the hue.", "sortedWord": "None", "Identifyer": null, "identifyer": 85266, "year": "2020"}, {"autor": "Mario7887", "date": "2020-12-15 15:18:03", "content": "Hello, i am aiming to create alot of multiple product photography for wallets that has different colors, and i was wondering how can I keep the products in the same place in every picture. Keep in mind the leathers in each product has a different pattern meaning i can't just play with the hue.", "link": "https://www.reddit.com/r/photography/comments/kdnjsx/hello_i_am_aiming_to_create_alot_of_multiple/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am aiming to create", "selectorShort": "create", "MarkedSent": "hello, -----> i !!!  -----> am !!!  -----> aiming !!!  -----> to !!!  -----> create !!!  alot of multiple product photography for wallets that has different colors, and -----> i !!!  was wondering how can -----> i !!!  keep the products in the same place in every picture. keep in mind the leathers in each product has a different pattern meaning i can't just play with the hue.", "sortedWord": "None", "Identifyer": null, "identifyer": 85267, "year": "2020"}, {"autor": "themagicaperture", "date": "2020-12-15 06:07:52", "content": "Creating a formal quote for a client - Need help please! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/kdg6ua/creating_a_formal_quote_for_a_client_need_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a formal quote for a client - need help please! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 85303, "year": "2020"}, {"autor": "csbphoto", "date": "2020-12-24 15:03:20", "content": "Creating and publishing a photo book. A chat with Kyler Zeleny. [1hr long]", "link": "https://www.reddit.com/r/photography/comments/kjgtjs/creating_and_publishing_a_photo_book_a_chat_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  and publishing a photo book. a chat with kyler zeleny. [1hr long]", "sortedWord": "None", "Identifyer": null, "identifyer": 85499, "year": "2020"}, {"autor": "16erglast", "date": "2020-12-21 09:39:46", "content": "Business Name Ideas Needed /!/ I just (days ago) started photography as a hobby. I’ve decided to set up a website as a sharing platform since I’ll be sharing my many photos with so many people (if curious as to why you can see my last post) and don’t want to pay monthly fees for storage. \n\nI am 100% a beginner hobbyist, and do not plan to become professional. However, because the website I’ve created looks so bland without a name of any sort on it, I’m trying to come up with a photography brand/business name that I can use!\n\nI’ll mainly be taking photos of off-road jeeping, motocross races, and off-road dirt bike races (see my last post if you want more info about the photography I’ll be doing). \n\nAny name suggestions? I don’t want to use my own name since I have a professional career and don’t want my photography to come up in a Google search of my name.", "link": "https://www.reddit.com/r/photography/comments/khe56p/business_name_ideas_needed/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’ve created", "selectorShort": "create", "MarkedSent": "business name ideas needed /!/ i just (days ago) started photography as a hobby. i’ve decided to set up a website as a sharing platform since i’ll be sharing my many photos with so many people (if curious as to why you can see my last post) and don’t want to pay monthly fees for storage. \n\ni am 100% a beginner hobbyist, and do not plan to become professional. however, because the website -----> i !!! ’ve -----> created !!!  looks so bland without a name of any sort on it, -----> i !!! ’m trying to come up with a photography brand/business name that -----> i !!!  can use!\n\ni’ll mainly be taking photos of off-road jeeping, motocross races, and off-road dirt bike races (see my last post if you want more info about the photography i’ll be doing). \n\nany name suggestions? i don’t want to use my own name since i have a professional career and don’t want my photography to come up in a google search of my name.", "sortedWord": "None", "Identifyer": null, "identifyer": 85686, "year": "2020"}, {"autor": "Kalpa_chathu", "date": "2020-11-10 16:18:06", "content": "Guys check out how I created this awesome Twirl effect image in photoshop", "link": "https://www.reddit.com/r/photography/comments/jrnuos/guys_check_out_how_i_created_this_awesome_twirl/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "guys check out how -----> i !!!  -----> created !!!  this awesome twirl effect image in photoshop", "sortedWord": "None", "Identifyer": null, "identifyer": 86342, "year": "2020"}, {"autor": "Banaboy", "date": "2020-11-13 12:30:42", "content": "I took some photos yesterday. I’d like some criticism. /!/ I think this is the wrong place to post it, but other photography subs seem inactive. \n\nI took these photos yesterday. \n\nhttps://ibb.co/jTVXgdN \n\nSorry for the awful link but it seems you can no longer upload to imgur via mobile. I’m not creating an account via their app just to upload. \n\nAnyway, if it’s ok, can I get some criticism on how to improve the composition and photos in general?", "link": "https://www.reddit.com/r/photography/comments/jtg59r/i_took_some_photos_yesterday_id_like_some/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m not creating", "selectorShort": "create", "MarkedSent": "i took some photos yesterday. i’d like some criticism. /!/ i think this is the wrong place to post it, but other photography subs seem inactive. \n\ni took these photos yesterday. \n\nhttps://ibb.co/jtvxgdn \n\nsorry for the awful link but it seems you can no longer upload to imgur via mobile. -----> i !!! ’m -----> not !!!  -----> creating !!!  an account via their app just to upload. \n\nanyway, if it’s ok, can i get some criticism on how to improve the composition and photos in general?", "sortedWord": "None", "Identifyer": null, "identifyer": 86496, "year": "2020"}, {"autor": "nadimS", "date": "2020-11-14 15:00:50", "content": "Tips for dealing with really big images? /!/ I'm not sure if this is the sub for this, but I also don't know what other sub would be correct. If anyone knows one please do suggest it! \n\nI'm creating images of fractals using python and Pillow. I'd really like a super detailed image (think like those mandlebrot sets where you can just keep zooming in) however my image is 50GP (gigapixels), and the windows 10 photo viewer cannot cope with this. I get really bad artefacts, and everything is blurry when it should be beautifully sharp. I've tried Adobe Illustrator, and a program called XnView, both of which cited memory errors when I tried to open it. Apparently photoshop would theoretically need about 750gb of ram [according to this link](https://community.adobe.com/t5/photoshop/photoshop-how-much-ram-we-need-for-each-images-resolutions-maximum/td-p/8692626?page=1). Obviously I don't have this, so I was wondering if anyone knows of any programs which use some clever memory tricks to render parts of the image at a time, in order to zoom in a lot? \n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/ju372j/tips_for_dealing_with_really_big_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "tips for dealing with really big images? /!/ i'm not sure if this is the sub for this, but i also don't know what other sub would be correct. if anyone knows one please do suggest it! \n\n-----> i !!! 'm -----> creating !!!  images of fractals using python and pillow. i'd really like a super detailed image (think like those mandlebrot sets where you can just keep zooming in) however my image is 50gp (gigapixels), and the windows 10 photo viewer cannot cope with this. i get really bad artefacts, and everything is blurry when it should be beautifully sharp. i've tried adobe illustrator, and a program called xnview, both of which cited memory errors when i tried to open it. apparently photoshop would theoretically need about 750gb of ram [according to this link](https://community.adobe.com/t5/photoshop/photoshop-how-much-ram-we-need-for-each-images-resolutions-maximum/td-p/8692626?page=1). obviously i don't have this, so i was wondering if anyone knows of any programs which use some clever memory tricks to render parts of the image at a time, in order to zoom in a lot? \n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 86596, "year": "2020"}, {"autor": "Ttamy", "date": "2020-02-10 00:51:27", "content": "Short 7 question survey, on photo series for a school project. /!/ hey all, for school i need to create a target personal for photos series so i thought this would be the perfect placeto ask!! the survey will only take 1-2 minutes and is quick and easy.\n\n[https://www.surveymonkey.com/r/TRLBP2H](https://www.surveymonkey.com/r/TRLBP2H)\n\n\\^here is the link.\n\nthank you all for your participation!! &lt;3", "link": "https://www.reddit.com/r/photography/comments/f1iba8/short_7_question_survey_on_photo_series_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "short 7 question survey, on photo series for a school project. /!/ hey all, for school -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a target personal for photos series so -----> i !!!  thought this would be the perfect placeto ask!! the survey will only take 1-2 minutes and is quick and easy.\n\n[https://www.surveymonkey.com/r/trlbp2h](https://www.surveymonkey.com/r/trlbp2h)\n\n\\^here is the link.\n\nthank you all for your participation!! &lt;3", "sortedWord": "None", "Identifyer": null, "identifyer": 86884, "year": "2020"}, {"autor": "highermindwannabe", "date": "2020-02-14 14:09:50", "content": "Style to choose /!/ Hi guys, I am quite sure most of you can relate to this. I love my gear (Lumix FZ1000 and Huawei p30pro) and photos I took so far, but when I start my editing process I feel lost. I love so many options of filters in apps like Vsco, Colourtone or different filters on lightroom and captureone...What bothers me is, I start using one stlye for example during Winter but I switch to different filters/editing tunning in Spring. I just love so different variations there are to choose from. I found 4-5 photographers who inspire my work, but now that I switched so many times my style of photography my grid on Instagram is not that great in my opinion. How do you swim in this kind of waters? I guess, I would like to create dreamy/time Less looking images with more emphasis on composition and light rather using filters...", "link": "https://www.reddit.com/r/photography/comments/f3sonb/style_to_choose/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "style to choose /!/ hi guys, i am quite sure most of you can relate to this. i love my gear (lumix fz1000 and huawei p30pro) and photos i took so far, but when i start my editing process i feel lost. i love so many options of filters in apps like vsco, colourtone or different filters on lightroom and captureone...what bothers me is, i start using one stlye for example during winter but i switch to different filters/editing tunning in spring. i just love so different variations there are to choose from. i found 4-5 photographers who inspire my work, but now that i switched so many times my style of photography my grid on instagram is not that great in my opinion. how do you swim in this kind of waters? -----> i !!!  guess, -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  dreamy/time less looking images with more emphasis on composition and light rather using filters...", "sortedWord": "None", "Identifyer": null, "identifyer": 86927, "year": "2020"}, {"autor": "RKFHD6", "date": "2020-03-14 15:48:13", "content": "Created this iPhone 8s product blue in blender!!", "link": "https://www.reddit.com/r/photography/comments/fikd0f/created_this_iphone_8s_product_blue_in_blender/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  this iphone 8s product blue in blender!!", "sortedWord": "None", "Identifyer": null, "identifyer": 87155, "year": "2020"}, {"autor": "CMKGFK", "date": "2020-03-26 01:51:25", "content": "How do i create a virtual print shop? read post /!/ So i am looking for a website or some service that could create mock up prints for me kinda like this. [https://imgur.com/gallery/3t2Xz2D](https://imgur.com/gallery/3t2Xz2D) I am really looking for something so I do not have to go and make product photos for all my prints (im just lazy). is there a website that could put my images on a print like thing so i can demo it for a product page?", "link": "https://www.reddit.com/r/photography/comments/fp2zgn/how_do_i_create_a_virtual_print_shop_read_post/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  a virtual print shop? read post /!/ so i am looking for a website or some service that could create mock up prints for me kinda like this. [https://imgur.com/gallery/3t2xz2d](https://imgur.com/gallery/3t2xz2d) i am really looking for something so i do not have to go and make product photos for all my prints (im just lazy). is there a website that could put my images on a print like thing so i can demo it for a product page?", "sortedWord": "None", "Identifyer": null, "identifyer": 87358, "year": "2020"}, {"autor": "strange_orbit", "date": "2020-04-05 18:57:13", "content": "Create a map from my RAW photos? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/fvj3lz/create_a_map_from_my_raw_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  a map from my raw photos? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 87414, "year": "2020"}, {"autor": "camfromthegutter", "date": "2020-01-22 13:22:41", "content": "To my photographers that are active social media users. /!/ I have a personal Instagram page where I post things like food, pictures of my girlfriend, etc., and a professional one where I exclusively post my photography/videography. I have a larger following on my personal page because I’ve had it for a few years now but I recently created a professional account. I am not sure if I should continue starting from the ground up on my photography page or if I should convert my personal page into a professional account, delete anything not photography related for the most part, and scrap the account I just created. Let me know what worked best for you guys!", "link": "https://www.reddit.com/r/photography/comments/esbuzy/to_my_photographers_that_are_active_social_media/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "to my photographers that are active social media users. /!/ i have a personal instagram page where i post things like food, pictures of my girlfriend, etc., and a professional one where i exclusively post my photography/videography. i have a larger following on my personal page because i’ve had it for a few years now but -----> i !!!  -----> recently !!!  -----> created !!!  a professional account. i am not sure if i should continue starting from the ground up on my photography page or if i should convert my personal page into a professional account, delete anything not photography related for the most part, and scrap the account i just created. let me know what worked best for you guys!", "sortedWord": "None", "Identifyer": null, "identifyer": 87965, "year": "2020"}, {"autor": "timc00k2018", "date": "2020-01-20 02:07:21", "content": "What do unprocessed HDR photos look like? /!/ I had two questions I was hoping someone could help me with please:\n\n1.  Does someone have a website that shows unprocessed HDR photos so that I can see what they look like?  I did a Google search and found some, but I'm not sure if the photos have been processed or not.  I'd just like to see what they look like unprocessed\n2. I downloaded Photoshop and used it for the first time today.  A tutorial I came across walked me through creating faux HDR photos from a single jpg.  Here is an example I created [https://ibb.co/Pgjntrc](https://ibb.co/Pgjntrc) .  The original picture had some flaws in it and the final pic has to be cleaned up a bit, but is the picture on the right kind of like what an HDR picture would look like?\n\nThank you", "link": "https://www.reddit.com/r/photography/comments/er6asp/what_do_unprocessed_hdr_photos_look_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "what do unprocessed hdr photos look like? /!/ i had two questions i was hoping someone could help me with please:\n\n1.  does someone have a website that shows unprocessed hdr photos so that i can see what they look like?  i did a google search and found some, but i'm not sure if the photos have been processed or not.  i'd just like to see what they look like unprocessed\n2. i downloaded photoshop and used it for the first time today.  a tutorial i came across walked me through creating faux hdr photos from a single jpg.  here is an example -----> i !!!  -----> created !!!  [https://ibb.co/pgjntrc](https://ibb.co/pgjntrc) .  the original picture had some flaws in it and the final pic has to be cleaned up a bit, but is the picture on the right kind of like what an hdr picture would look like?\n\nthank you", "sortedWord": "None", "Identifyer": null, "identifyer": 88012, "year": "2020"}, {"autor": "fireposting", "date": "2020-04-24 09:55:13", "content": "One of my cats last summer :) Can I add multiple photos or do i have to create a new Post for my second cat?", "link": "https://www.reddit.com/r/photography/comments/g75oid/one_of_my_cats_last_summer_can_i_add_multiple/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have to create", "selectorShort": "create", "MarkedSent": "one of my cats last summer :) can -----> i !!!  add multiple photos or do -----> i !!!  -----> have !!!  -----> to !!!  -----> create !!!  a new post for my second cat?", "sortedWord": "None", "Identifyer": null, "identifyer": 88113, "year": "2020"}, {"autor": "breeellaneeley", "date": "2020-05-01 04:07:20", "content": "The other night I had a nightmare about a lack of social distancing. So I created this image to capture those feelings. I don't want to emphasize the negativity, I just wanted to create a piece that documented the time in an unconventional way. This is a historical moment. Stay safe! Stay sane!", "link": "https://www.reddit.com/r/photography/comments/gbb96j/the_other_night_i_had_a_nightmare_about_a_lack_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "the other night i had a nightmare about a lack of social distancing. so -----> i !!!  -----> created !!!  this image to capture those feelings. i don't want to emphasize the negativity, i just wanted to create a piece that documented the time in an unconventional way. this is a historical moment. stay safe! stay sane!", "sortedWord": "None", "Identifyer": null, "identifyer": 88244, "year": "2020"}, {"autor": "ExpertBlueJay", "date": "2020-05-25 21:59:48", "content": "Question on photoshop technique/overlay /!/ I hope I can ask this here, if not please direct me to the appropriate sub.\n\nI'm looking to create or use an overlay in photoshop that would make a sort of spirit/light trail effect on people. I don't know how to accurately explain what the effect would be called and I don't think I can post a link to a screenshot, but it would be something similar to the spirits/light people in the game Everybody's Gone to the Rapture.\n\nI've seen sparkler overlays and such, so I think I could use those to create more human looking shapes out of just those. But if anyone knows of any other techniques on how to achieve this effect I'd love learn!", "link": "https://www.reddit.com/r/photography/comments/gqk9yw/question_on_photoshop_techniqueoverlay/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm looking to create", "selectorShort": "create", "MarkedSent": "question on photoshop technique/overlay /!/ -----> i !!!  hope -----> i !!!  can ask this here, if not please direct me -----> to !!!  the appropriate sub.\n\n-----> i !!! 'm -----> looking !!!  -----> to !!!  -----> create !!!  or use an overlay in photoshop that would make a sort of spirit/light trail effect on people. i don't know how to accurately explain what the effect would be called and i don't think i can post a link to a screenshot, but it would be something similar to the spirits/light people in the game everybody's gone to the rapture.\n\ni've seen sparkler overlays and such, so i think i could use those to create more human looking shapes out of just those. but if anyone knows of any other techniques on how to achieve this effect i'd love learn!", "sortedWord": "None", "Identifyer": null, "identifyer": 88563, "year": "2020"}, {"autor": "cubedude719", "date": "2020-07-13 23:17:35", "content": "Quick question on changing the size/quality of my photos before I upload online. /!/ Hello!\n\nI'm decided to take this quarantine as an excuse to put a little effort into my photography, and make a (free) website to just get the ball rolling. Later on I'll start paying and maybe add e-commerce.\n\nRegardless, I was wondering about keeping images safe once they're online. I've done some research, but I need some specifics on how to do so. I do understand that if someone wants to steal my image and use it, it's gonna happen.\n\nSay I want to upload a photo in still-good but not print-quality to Reddit or my website. Do I just plug the jpeg into photoshop, save and export as jpeg, and set the quality number to like 8 or 10 instead of 12? Is there an easier way to do this? I'm not paying for PS yet so it's a bit difficult but not impossible. \n\nUnsure on if I'm going to create a watermark yet. \n\nThanks for any help!", "link": "https://www.reddit.com/r/photography/comments/hqq5rx/quick_question_on_changing_the_sizequality_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm going to create", "selectorShort": "create", "MarkedSent": "quick question on changing the size/quality of my photos before i upload online. /!/ hello!\n\ni'm decided to take this quarantine as an excuse to put a little effort into my photography, and make a (free) website to just get the ball rolling. later on i'll start paying and maybe add e-commerce.\n\nregardless, i was wondering about keeping images safe once they're online. i've done some research, but i need some specifics on how to do so. i do understand that if someone wants to steal my image and use it, it's gonna happen.\n\nsay i want to upload a photo in still-good but not print-quality to reddit or my website. do i just plug the jpeg into photoshop, save and export as jpeg, and set the quality number to like 8 or 10 instead of 12? is there an easier way to do this? i'm not paying for ps yet so it's a bit difficult but not impossible. \n\nunsure on if -----> i !!! 'm -----> going !!!  -----> to !!!  -----> create !!!  a watermark yet. \n\nthanks for any help!", "sortedWord": "None", "Identifyer": null, "identifyer": 89038, "year": "2020"}, {"autor": "Piano_Trombone_Guy", "date": "2020-07-09 05:30:06", "content": "Quote I created last year - what do you think? /!/ Last year I came up with this quote as a result of a (rude) someone saying that they were a photographer (people were admiring my photographs - this helps to set the scene), when all they do is take crappy (not trying to be mean, just honest) phone selfie pictures. Here it is below... let me know what you think (and any feedback is welcome too)! \n\n\"Photography is more than just being able to take a photo that looks good; It's about producing a meaningful work of art that has the capability of inspiring others and their imaginations.\" (Jack Stabek, 31/03/2019)", "link": "https://www.reddit.com/r/photography/comments/hnxh26/quote_i_created_last_year_what_do_you_think/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "quote -----> i !!!  -----> created !!!  last year - what do you think? /!/ last year i came up with this quote as a result of a (rude) someone saying that they were a photographer (people were admiring my photographs - this helps to set the scene), when all they do is take crappy (not trying to be mean, just honest) phone selfie pictures. here it is below... let me know what you think (and any feedback is welcome too)! \n\n\"photography is more than just being able to take a photo that looks good; it's about producing a meaningful work of art that has the capability of inspiring others and their imaginations.\" (jack stabek, 31/03/2019)", "sortedWord": "None", "Identifyer": null, "identifyer": 89225, "year": "2020"}, {"autor": "le-bee", "date": "2020-08-18 01:45:35", "content": "Australian Photographers: Photography hosting/printing/storage services? /!/ I am looking for an integrated service where I can create a website and print and also store photos. Where I can direct family (and in future clients) to albums that they can order prints from. Can anyone help me with examples of how they go about such things? Ideally with a printer located in Australia. Thank you!", "link": "https://www.reddit.com/r/photography/comments/ibrsdf/australian_photographers_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "australian photographers: photography hosting/printing/storage services? /!/ -----> i !!!  am looking for an integrated service where -----> i !!!  -----> can !!!  -----> create !!!  a website and print and also store photos. where i can direct family (and in future clients) to albums that they can order prints from. can anyone help me with examples of how they go about such things? ideally with a printer located in australia. thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 89512, "year": "2020"}, {"autor": "erichernandez91", "date": "2020-07-01 19:00:31", "content": "TikTok Green to Purple Filter for Lightroom Mobile and Classic /!/  Hey guys! I've created a filter for Lightroom Mobile and Classic that turns the greens in your images to purple! Check it out! Let me know what you think. [https://www.onepresets.com/collections/lightroom-presets/products/purple-tones-mobile-preset-pack-1-0](https://www.onepresets.com/collections/lightroom-presets/products/purple-tones-mobile-preset-pack-1-0)", "link": "https://www.reddit.com/r/photography/comments/hjgmkj/tiktok_green_to_purple_filter_for_lightroom/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "tiktok green to purple filter for lightroom mobile and classic /!/  hey guys! -----> i !!! 've -----> created !!!  a filter for lightroom mobile and classic that turns the greens in your images to purple! check it out! let me know what you think. [https://www.onepresets.com/collections/lightroom-presets/products/purple-tones-mobile-preset-pack-1-0](https://www.onepresets.com/collections/lightroom-presets/products/purple-tones-mobile-preset-pack-1-0)", "sortedWord": "None", "Identifyer": null, "identifyer": 89656, "year": "2020"}, {"autor": "MoistLoveMuscle", "date": "2020-07-28 00:17:09", "content": "Help! Backdrop Stand/Support Advice /!/ Hello Reddit, \n\nI’m looking to purchase a back drop and I’m struggling with settling on one. Amazon (Canada) has one I’ve been eying and that’s the Emart Triple across Bar valued at $240. I like the idea on being able to place multiple back drops on it but the price of this is steep. Would it be best to just get a normal system? Is it that much more practical to have a multiple bar system? \n\nI’m looking to create an in home studio. I’m also about 6.4ft tall and I’d like to find a system that would cover my height. \n\nAny guidance and direction would be appreciated. \n\nCheers,\n\nMLM", "link": "https://www.reddit.com/r/photography/comments/hz48un/help_backdrop_standsupport_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m looking to create", "selectorShort": "create", "MarkedSent": "help! backdrop stand/support advice /!/ hello reddit, \n\ni’m looking to purchase a back drop and i’m struggling with settling on one. amazon (canada) has one i’ve been eying and that’s the emart triple across bar valued at $240. i like the idea on being able to place multiple back drops on it but the price of this is steep. would it be best to just get a normal system? is it that much more practical to have a multiple bar system? \n\n-----> i !!! ’m -----> looking !!!  -----> to !!!  -----> create !!!  an in home studio. i’m also about 6.4ft tall and i’d like to find a system that would cover my height. \n\nany guidance and direction would be appreciated. \n\ncheers,\n\nmlm", "sortedWord": "None", "Identifyer": null, "identifyer": 90069, "year": "2020"}, {"autor": "Tech_Messages", "date": "2020-07-30 23:01:11", "content": "Best Lightroom Export Settings for Costco Prints? /!/ All the lossless formats (tif, png, cr2) have too large file sizes. (Costco has a max photo size of 50MB/file.)\n\nI can create a 100% quality JPEG with 300px resolution, but the file size drops to 11MB from 120MB. Wondering if anyone has figured out how to get the best picture quality for large prints (16\"x20\") at Costco.", "link": "https://www.reddit.com/r/photography/comments/i0w8pi/best_lightroom_export_settings_for_costco_prints/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "best lightroom export settings for costco prints? /!/ all the lossless formats (tif, png, cr2) have too large file sizes. (costco has a max photo size of 50mb/file.)\n\n-----> i !!!  -----> can !!!  -----> create !!!  a 100% quality jpeg with 300px resolution, but the file size drops to 11mb from 120mb. wondering if anyone has figured out how to get the best picture quality for large prints (16\"x20\") at costco.", "sortedWord": "None", "Identifyer": null, "identifyer": 90094, "year": "2020"}, {"autor": "benitocamelas", "date": "2020-07-30 22:56:05", "content": "Built app to help fellow freelancer photographers keep more of the money they earn! /!/ Hey fellow freelancers! I created an app with the vision of helping you keep more of the money you earn while freelancing.\n\nThe current version of our app\n\n* helps you find deductions to save on taxes\n* calculates exactly how much you should be setting aside for taxes to avoid fines from the IRS\n* let's you easily pay quarterly estimated taxes through the app\n* lets you chat with a real person who can answer your finance questions\n* helps you set and track income goals\n* lets you know how much spending money you have\n* automatically notifies you whenever you get new income\n\nWe thought we’d reach out to the community to see if our app was helpful. We’d love to make this app really useful for people in this community, so any feedback/suggestions you have is welcome! Please check it out and let us know what you think :)\n\n[https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755](https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755)", "link": "https://www.reddit.com/r/photography/comments/i0w5mt/built_app_to_help_fellow_freelancer_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "built app to help fellow freelancer photographers keep more of the money they earn! /!/ hey fellow freelancers! -----> i !!!  -----> created !!!  an app with the vision of helping you keep more of the money you earn while freelancing.\n\nthe current version of our app\n\n* helps you find deductions to save on taxes\n* calculates exactly how much you should be setting aside for taxes to avoid fines from the irs\n* let's you easily pay quarterly estimated taxes through the app\n* lets you chat with a real person who can answer your finance questions\n* helps you set and track income goals\n* lets you know how much spending money you have\n* automatically notifies you whenever you get new income\n\nwe thought we’d reach out to the community to see if our app was helpful. we’d love to make this app really useful for people in this community, so any feedback/suggestions you have is welcome! please check it out and let us know what you think :)\n\n[https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755](https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755)", "sortedWord": "None", "Identifyer": null, "identifyer": 90095, "year": "2020"}, {"autor": "frostsparv", "date": "2020-12-12 18:06:55", "content": "[Help] Thousands of unorganized photos /!/ After a few HDD failures and to be honest, unorganized behaviour without future proofing, I've managed to end up with an external drive with a lot of folders, file types and names (jpg, dng, raw, raf etc.). Sure, I created this and have to unclutter this mess but I wanted to ask if anyone here have any advice or tricks to make this smooth? Is there any software that can scan the drive for all photos, fetch them and copy them to folders based on for example year? \n\nRight now I'm almost at the point of just deleting 15 years of photography.", "link": "https://www.reddit.com/r/photography/comments/kbto0y/help_thousands_of_unorganized_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "[help] thousands of unorganized photos /!/ after a few hdd failures and to be honest, unorganized behaviour without future proofing, i've managed to end up with an external drive with a lot of folders, file types and names (jpg, dng, raw, raf etc.). sure, -----> i !!!  -----> created !!!  this and have to unclutter this mess but i wanted to ask if anyone here have any advice or tricks to make this smooth? is there any software that can scan the drive for all photos, fetch them and copy them to folders based on for example year? \n\nright now i'm almost at the point of just deleting 15 years of photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 90519, "year": "2020"}, {"autor": "TomScottVaughn", "date": "2020-10-26 14:22:35", "content": "Photo book service you'd recommend for serious amateur? /!/ I'd like to create an oversized book of personal work.  Just for myself.  Maybe 2 or 3 copies.  Does anyone use a platform (organizing + printing) they'd recommend?  FYI - I'm done with Adobe so nothing through LR (I used C1 and AP).  Thx!", "link": "https://www.reddit.com/r/photography/comments/jiff9g/photo_book_service_youd_recommend_for_serious/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'd like to create", "selectorShort": "create", "MarkedSent": "photo book service you'd recommend for serious amateur? /!/ -----> i !!! -----> 'd !!!  -----> like !!!  -----> to !!!  -----> create !!!  an oversized book of personal work.  just for myself.  maybe 2 or 3 copies.  does anyone use a platform (organizing + printing) they'd recommend?  fyi - i'm done with adobe so nothing through lr (i used c1 and ap).  thx!", "sortedWord": "None", "Identifyer": null, "identifyer": 90735, "year": "2020"}, {"autor": "michael7ggrey", "date": "2020-10-26 12:23:32", "content": "Learn to Create Photography Business Plan /!/ Starting a photography business always begins with a business plan. This is a necessary step to ensure  the business goes in the right direction and measure its performance. Creating a business plan is a daunting task for any beginner, no matter they field of work. \n\nSo, here are the basics you should know about photography business plans: \n\n**Main Components:**\n\n* Executive summary. This is the part of your plan. Around 50-250 word section about your business goals will be enough. \n* Business description. Here, you express the vision of your business, its structure, outline, etc. Be as specific as possible.\n* Product or service portfolio. Enlist the types of photography you do, provide a pricing model.\n* Target market. Determine you target market early on. It may be tricky, but you can start with researching your local market and its demand. Also, try to envision your ideal customer. \n* Competitive landscape. Look into your competitors and make a comprehensive analysis of the products they offer, their target audience, and how you can stand out.\n* Marketing approach. Detail your marketing strategies. This step will require thorough research. \n* Operations &amp; logistics. Consider the day-to-day logistics and prices you may face. Equipment, studio, shipment, etc. \n* Timeline. It will help you t track your business goals and how successful you are. Even the simplest timeline will keep you more organized and focused. \n\nSources used:\n\nPhotography business plan guide: [https://www.format.com/magazine/resources/photography/photography-business-plan](https://www.format.com/magazine/resources/photography/photography-business-plan) \n\nHow to conduct a competitor analyses: [https://www.mykpono.com/how-to-conduct-competitive-analysis/](https://www.mykpono.com/how-to-conduct-competitive-analysis/) \n\nSmall business marketing: [https://buildfire.com/marketing-strategies-for-small-businesses/](https://buildfire.com/marketing-strategies-for-small-businesses/)", "link": "https://www.reddit.com/r/photography/comments/jidjv1/learn_to_create_photography_business_plan/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "learn to create photography business plan /!/ starting a photography business always begins with a business plan. this is a necessary step to ensure  the business goes in the right direction and measure its performance. -----> creating !!!  a business plan is a daunting task for any beginner, no matter they field of work. \n\nso, here are the basics you should know about photography business plans: \n\n**main components:**\n\n* executive summary. this is the part of your plan. around 50-250 word section about your business goals will be enough. \n* business description. here, you express the vision of your business, its structure, outline, etc. be as specific as possible.\n* product or service portfolio. enlist the types of photography you do, provide a pricing model.\n* target market. determine you target market early on. it may be tricky, but you can start with researching your local market and its demand. also, try to envision your ideal customer. \n* competitive landscape. look into your competitors and make a comprehensive analysis of the products they offer, their target audience, and how you can stand out.\n* marketing approach. detail your marketing strategies. this step will require thorough research. \n* operations &amp; logistics. consider the day-to-day logistics and prices you may face. equipment, studio, shipment, etc. \n* timeline. it will help you t track your business goals and how successful you are. even the simplest timeline will keep you more organized and focused. \n\nsources used:\n\nphotography business plan guide: [https://www.format.com/magazine/resources/photography/photography-business-plan](https://www.format.com/magazine/resources/photography/photography-business-plan) \n\nhow to conduct a competitor analyses: [https://www.mykpono.com/how-to-conduct-competitive-analysis/](https://www.mykpono.com/how-to-conduct-competitive-analysis/) \n\nsmall business marketing: [https://buildfire.com/marketing-strategies-for-small-businesses/](https://buildfire.com/marketing-strategies-for-small-businesses/)", "sortedWord": "None", "Identifyer": null, "identifyer": 90741, "year": "2020"}, {"autor": "Matingas", "date": "2020-10-21 21:42:43", "content": "Printing astrophotography in acrylic through Amazon- Experience / Question /!/ Hi all,\n\nI recently took some astro shots I was proud of and decided to splurge and buy a print of my own picture through Amazon. The result was disappointing... I'm not sure if I should complain to Amazon or accept the fact that my photo wasn't that good to begin with and that's how it looks in print.\n\n[Here is an album](https://imgur.com/a/idJZ1k5) I created for the situation: [[LINK](https://imgur.com/a/idJZ1k5)]\n\nHas anyone experienced printing with Amazon? \n\nIssues or good comments? \n\nShould I have printed on metal? \n\nShould I complain and expect my money back? \n\nThanks", "link": "https://www.reddit.com/r/photography/comments/jfmdhj/printing_astrophotography_in_acrylic_through/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "printing astrophotography in acrylic through amazon- experience / question /!/ hi all,\n\ni recently took some astro shots i was proud of and decided to splurge and buy a print of my own picture through amazon. the result was disappointing... i'm not sure if i should complain to amazon or accept the fact that my photo wasn't that good to begin with and that's how it looks in print.\n\n[here is an album](https://imgur.com/a/idjz1k5) -----> i !!!  -----> created !!!  for the situation: [[link](https://imgur.com/a/idjz1k5)]\n\nhas anyone experienced printing with amazon? \n\nissues or good comments? \n\nshould i have printed on metal? \n\nshould i complain and expect my money back? \n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 90808, "year": "2020"}, {"autor": "Rabus", "date": "2020-10-21 16:33:17", "content": "Photographer software tools? /!/ Hey all!  \nMy fiancee started a photography side gig, planning to move over fully to become a photographer. I'm trying to help her get up to speed on managing social media, financing, planning and advertising, but it's becoming too much  for someone who doesn't work in the field.\n\nSo far i got her:\n\n\\- helped her figure out the best basic lens, choose the system (Canon) and get the first lamp  \n\\- Photoshop / Lightroom and the full adobe suite  \n\\- RAW viewer (to quickly peek into the RAWs)  \n\\- We're also planning to get a studio set up for these damn covid times at our small house out of the big town.\n\nNow, she needs   \n\\-something to manage her social media (so far she's doing that manually),   \n\\- something to better manage her photos (right now she does that by sending me the photo names via messanger lol)  \n\\- some good financing/incoiving  tools (for now she uses a todoist and google calendar to keep up with stuff)  \n\\- other tools that might be super obvious to you, but not so much for me (and her)\n\nI can imagine this request might sound dumb, but i honestly did as much research as I could and helped to an extent I could - so thus why I decided to create this post.", "link": "https://www.reddit.com/r/photography/comments/jfgaqk/photographer_software_tools/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "photographer software tools? /!/ hey all!  \nmy fiancee started a photography side gig, planning to move over fully to become a photographer. i'm trying to help her get up to speed on managing social media, financing, planning and advertising, but it's becoming too much  for someone who doesn't work in the field.\n\nso far i got her:\n\n\\- helped her figure out the best basic lens, choose the system (canon) and get the first lamp  \n\\- photoshop / lightroom and the full adobe suite  \n\\- raw viewer (to quickly peek into the raws)  \n\\- we're also planning to get a studio set up for these damn covid times at our small house out of the big town.\n\nnow, she needs   \n\\-something to manage her social media (so far she's doing that manually),   \n\\- something to better manage her photos (right now she does that by sending me the photo names via messanger lol)  \n\\- some good financing/incoiving  tools (for now she uses a todoist and google calendar to keep up with stuff)  \n\\- other tools that might be super obvious to you, but not so much for me (and her)\n\ni can imagine this request might sound dumb, but -----> i !!!  honestly did as much research as -----> i !!!  could and helped -----> to !!!  an extent -----> i !!!  could - so thus why -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  this post.", "sortedWord": "None", "Identifyer": null, "identifyer": 90832, "year": "2020"}], "name": "createphotography2020"}