{"interestingcomments": [{"autor": "prinsen", "date": "2019-09-13 16:46:00", "content": "IKEA Photographers started an Instagram account. /!/ Hi!   \n\n\nWe just started an Instagram account to share the creativity that takes place behind the interior photos we create for IKEA. Hope it´s interesting for you as a photographer to follow: [https://www.instagram.com/ikea\\_photographers/](https://www.instagram.com/ikea_photographers/)", "link": "https://www.reddit.com/r/photography/comments/d3s04u/ikea_photographers_started_an_instagram_account/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "ikea photographers started an instagram account. /!/ hi!   \n\n\n-----> we !!!  just started an instagram account to share the creativity that takes place behind the interior photos -----> we !!!  -----> create !!!  for ikea. hope it´s interesting for you as a photographer to follow: [https://www.instagram.com/ikea\\_photographers/](https://www.instagram.com/ikea_photographers/)", "sortedWord": "None", "Identifyer": null, "identifyer": 261, "year": "2019"}, {"autor": "tschwani", "date": "2019-09-21 02:08:21", "content": "Help!! How do I create soft, hazy bright photos like this one? I love the brightness but will be shooting entirely indoors with little to no natural light. Should I use strobes or continuous LEDs? Help a newbie out", "link": "https://www.reddit.com/r/photography/comments/d74muo/help_how_do_i_create_soft_hazy_bright_photos_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "help!! how do -----> i !!!  -----> create !!!  soft, hazy bright photos like this one? i love the brightness but will be shooting entirely indoors with little to no natural light. should i use strobes or continuous leds? help a newbie out", "sortedWord": "None", "Identifyer": null, "identifyer": 422, "year": "2019"}, {"autor": "wantedbanter", "date": "2019-10-04 23:22:30", "content": "How do I create images like this?! /!/  [https://www.instagram.com/p/B2UXwSlHPJ7/](https://www.instagram.com/p/B2UXwSlHPJ7/) \n\n [https://www.instagram.com/p/B09WZViBdXy/](https://www.instagram.com/p/B09WZViBdXy/) \n\n&amp;#x200B;\n\nHow do they do it? Do they use a quick shutter speed and rotate or...\n\n&amp;#x200B;\n\nIs there a way to do this with my mobile phone as well.", "link": "https://www.reddit.com/r/photography/comments/ddfbaj/how_do_i_create_images_like_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  images like this?! /!/  [https://www.instagram.com/p/b2uxwslhpj7/](https://www.instagram.com/p/b2uxwslhpj7/) \n\n [https://www.instagram.com/p/b09wzvibdxy/](https://www.instagram.com/p/b09wzvibdxy/) \n\n&amp;#x200b;\n\nhow do they do it? do they use a quick shutter speed and rotate or...\n\n&amp;#x200b;\n\nis there a way to do this with my mobile phone as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 636, "year": "2019"}, {"autor": "steak_tartare", "date": "2019-10-04 04:01:36", "content": "Do you see many travelers migrating from DSLR to cellphones? /!/ I’m creating a travel bags company, and must decide if we make a camera carrying bag. Of course it will always remain a niche, but I wonder if the bulk of tourists is migrating to cellphones now that their cameras are so advanced. Ten years ago tourist were all over the place with Canikons, but what about now (and a couple of years from now), would a camera bag still be relevant outside a small niche?", "link": "https://www.reddit.com/r/photography/comments/dd26p2/do_you_see_many_travelers_migrating_from_dslr_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m creating", "selectorShort": "create", "MarkedSent": "do you see many travelers migrating from dslr to cellphones? /!/ -----> i !!! ’m -----> creating !!!  a travel bags company, and must decide if we make a camera carrying bag. of course it will always remain a niche, but i wonder if the bulk of tourists is migrating to cellphones now that their cameras are so advanced. ten years ago tourist were all over the place with canikons, but what about now (and a couple of years from now), would a camera bag still be relevant outside a small niche?", "sortedWord": "None", "Identifyer": null, "identifyer": 707, "year": "2019"}, {"autor": "doobiewankenoobi", "date": "2019-08-07 14:31:37", "content": "I want to create a 'photography enclosure' for selling eBay items - where to start? /!/ Hi all, title says it all really.\n\nThe items will not be too large - max size will be a computer tower.\n\nWondering what everyone's go to set up is for this kind of use case. I was thinking white paper taped to each side of the hypothetical cube will be sufficient. Should I be doing something different?\n\nWhat kind of lighting, flash do people use? Will my d3300's onboard flash be sufficient?\n\nAny tips are much appreciated!", "link": "https://www.reddit.com/r/photography/comments/cn6j8a/i_want_to_create_a_photography_enclosure_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a 'photography enclosure' for selling ebay items - where -----> to !!!  start? /!/ hi all, title says it all really.\n\nthe items will not be too large - max size will be a computer tower.\n\nwondering what everyone's go to set up is for this kind of use case. i was thinking white paper taped to each side of the hypothetical cube will be sufficient. should i be doing something different?\n\nwhat kind of lighting, flash do people use? will my d3300's onboard flash be sufficient?\n\nany tips are much appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 771, "year": "2019"}, {"autor": "Paul0451", "date": "2019-10-01 21:02:52", "content": "Create/Print COllege /!/ I'm looking for a place to create and print a college. I have about 50 pix and would like to include them (or fewer) in an 18x24 print. It must be located in the USA. It's for an event and would like to include as many pix as possible but I'm willing to work with fewer pix if necessary or with a larger format.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/dbzs78/createprint_college/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!! /print college /!/ i'm looking for a place to create and print a college. i have about 50 pix and would like to include them (or fewer) in an 18x24 print. it must be located in the usa. it's for an event and would like to include as many pix as possible but i'm willing to work with fewer pix if necessary or with a larger format.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 850, "year": "2019"}, {"autor": "toresimonsen", "date": "2019-08-08 16:58:04", "content": "Added my book to the Public Library Collection /!/ Over the last few years, I've taken many photographs of wildlife in central Florida especially near Casselberry at the city parks.  Like many people, I've shared images on social media, but tend to find that the work is either lost or underappreciated.\n\nEventually, I held a few exhibits featuring my photography and some of my other artwork.  As a result of my most recent exhibit, I decided to create a photobook in a conversational style to try to capture the feel of the exhibit in book form.  \n\nAs a book, the extremely local focus and short page count, make it unlikely to yield much interest outside of the area and mass printing costs are prohibitive.  \n\nI decided to get my book added to the collection of my local library.  The process was not without a few bumps.  Libraries do not like larger format books.  However, photography and artwork books, like mine, are often larger format books.  It required effort on my part to ensure the process moved along, however slowly.  I am happy to report that my book is now in the library.\n\nI feel that giving people a way to tangibly interact with the book will solidify appreciation of the work.  I understand social media might theoretically expose the work to greater numbers, but in a way that is less intimate.  \n\nBy distributing my work to the library, the photographs can be enjoyed without paying enormous rents to other people disassociated from the labor of creating the work.  \n\nI can also bypass industry gatekeepers in the publishing world with my words and images.  I doubt there would be much interest in a locally-focused book.    \n\nIf you are looking for a new way to share your work, you may want to explore options to have the work added to your library.\n\nI called the book, \"N8tore Exhibit: A grassroots project\" and was happy to see it on the shelf at the library today.", "link": "https://www.reddit.com/r/photography/comments/cnoj2t/added_my_book_to_the_public_library_collection/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "added my book to the public library collection /!/ over the last few years, i've taken many photographs of wildlife in central florida especially near casselberry at the city parks.  like many people, i've shared images on social media, but tend to find that the work is either lost or underappreciated.\n\neventually, i held a few exhibits featuring my photography and some of my other artwork.  as a result of my most recent exhibit, -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  a photobook in a conversational style -----> to !!!  try -----> to !!!  capture the feel of the exhibit in book form.  \n\nas a book, the extremely local focus and short page count, make it unlikely to yield much interest outside of the area and mass printing costs are prohibitive.  \n\ni decided to get my book added to the collection of my local library.  the process was not without a few bumps.  libraries do not like larger format books.  however, photography and artwork books, like mine, are often larger format books.  it required effort on my part to ensure the process moved along, however slowly.  i am happy to report that my book is now in the library.\n\ni feel that giving people a way to tangibly interact with the book will solidify appreciation of the work.  i understand social media might theoretically expose the work to greater numbers, but in a way that is less intimate.  \n\nby distributing my work to the library, the photographs can be enjoyed without paying enormous rents to other people disassociated from the labor of creating the work.  \n\ni can also bypass industry gatekeepers in the publishing world with my words and images.  i doubt there would be much interest in a locally-focused book.    \n\nif you are looking for a new way to share your work, you may want to explore options to have the work added to your library.\n\ni called the book, \"n8tore exhibit: a grassroots project\" and was happy to see it on the shelf at the library today.", "sortedWord": "None", "Identifyer": null, "identifyer": 1084, "year": "2019"}, {"autor": "vicncak", "date": "2019-09-16 18:33:29", "content": "How do I advertise my photography business? /!/ I'm currently in the process of starting a photography business. I have the basic equipment needed. I'm still creating a wix site, all I really need to do is select photos for my portfolio. The struggle I know I will have though is advertising. My page on Instagram has been dormant for a while so I've lost most of my following. Does anyone who has started a business know how I can advertise?", "link": "https://www.reddit.com/r/photography/comments/d547jn/how_do_i_advertise_my_photography_business/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm still creating", "selectorShort": "create", "MarkedSent": "how do i advertise my photography business? /!/ i'm currently in the process of starting a photography business. i have the basic equipment needed. -----> i !!! 'm -----> still !!!  -----> creating !!!  a wix site, all -----> i !!!  really need to do is select photos for my portfolio. the struggle i know i will have though is advertising. my page on instagram has been dormant for a while so i've lost most of my following. does anyone who has started a business know how i can advertise?", "sortedWord": "None", "Identifyer": null, "identifyer": 1200, "year": "2019"}, {"autor": "VeryBloodyCream", "date": "2019-08-18 20:38:18", "content": "Best options for my upcoming photography website? /!/ A little background: bought a camera year ago and have been posting some photos to my personal Instagram, 120 of them to be excact. I want to stop that and posting them elsewhere, like another account or something but people have been telling me to create a website.\n\nSo should I create another IG account or create a website and if so, what’s the best option?", "link": "https://www.reddit.com/r/photography/comments/cs6qks/best_options_for_my_upcoming_photography_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "best options for my upcoming photography website? /!/ a little background: bought a camera year ago and have been posting some photos to my personal instagram, 120 of them to be excact. i want -----> to !!!  stop that and posting them elsewhere, like another account or something but people have been telling -----> me !!!  -----> to !!!  -----> create !!!  a website.\n\nso should i create another ig account or create a website and if so, what’s the best option?", "sortedWord": "None", "Identifyer": null, "identifyer": 1693, "year": "2019"}, {"autor": "bluejay737", "date": "2019-10-19 20:00:20", "content": "I would like to start my first photography portfolio! /!/ Do you have tips/advice when creating a portfolio? Also, what are some free websites platforms that I can create my first website? \n\nI currently use Flickr, but feel free to share other platforms or mediums!", "link": "https://www.reddit.com/r/photography/comments/dk8uub/i_would_like_to_start_my_first_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "i would like to start my first photography portfolio! /!/ do you have tips/advice when creating a portfolio? also, what are some free websites platforms that -----> i !!!  -----> can !!!  -----> create !!!  my first website? \n\ni currently use flickr, but feel free to share other platforms or mediums!", "sortedWord": "None", "Identifyer": null, "identifyer": 2271, "year": "2019"}, {"autor": "sm_mvp30", "date": "2019-11-06 14:30:06", "content": "Hi all! Does anyone know how do i create this effect?", "link": "https://www.reddit.com/r/photography/comments/dsh26s/hi_all_does_anyone_know_how_do_i_create_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hi all! does anyone know how do -----> i !!!  -----> create !!!  this effect?", "sortedWord": "None", "Identifyer": null, "identifyer": 2664, "year": "2019"}, {"autor": "smudgedbarcode", "date": "2019-11-14 22:08:52", "content": "In Apple Photos, how can you see what album(s) a photo is in? /!/ I'm using Catlina on Mac if it helps but this has been bugging me for a while. I created a smart album to only show photos that haven't been put into an album. But there are some photos I want in two or more albums. \"Get info\" doesn't show what album a photo is in. There's got to be a way to see that, no?", "link": "https://www.reddit.com/r/photography/comments/dwgqui/in_apple_photos_how_can_you_see_what_albums_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "in apple photos, how can you see what album(s) a photo is in? /!/ i'm using catlina on mac if it helps but this has been bugging me for a while. -----> i !!!  -----> created !!!  a smart album to only show photos that haven't been put into an album. but there are some photos i want in two or more albums. \"get info\" doesn't show what album a photo is in. there's got to be a way to see that, no?", "sortedWord": "None", "Identifyer": null, "identifyer": 2846, "year": "2019"}, {"autor": "Space_Jeep", "date": "2019-11-28 19:36:59", "content": "I'm stuck working with a client. /!/ I'm a student and my college has asked me to create some images for them. They basically seem to want stock looking images with their own branding in them. I just don't think I can handle these images as I'll need props, models and locations I don't have access to.\n\nAny thoughts and advice on this?", "link": "https://www.reddit.com/r/photography/comments/e330s7/im_stuck_working_with_a_client/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "i'm stuck working with a client. /!/ i'm a student and my college has asked -----> me !!!  -----> to !!!  -----> create !!!  some images for them. they basically seem to want stock looking images with their own branding in them. i just don't think i can handle these images as i'll need props, models and locations i don't have access to.\n\nany thoughts and advice on this?", "sortedWord": "None", "Identifyer": null, "identifyer": 3393, "year": "2019"}, {"autor": "AmericanPanascope", "date": "2019-12-20 09:07:21", "content": "Velvia users - r/FujiVelvia has been created! /!/ I've just created \"The Fuji Velvia Lightbox\", a new subreddit for all Velvia-related submissions and discussions: r/fujivelvia", "link": "https://www.reddit.com/r/photography/comments/ed7qup/velvia_users_rfujivelvia_has_been_created/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've just created", "selectorShort": "create", "MarkedSent": "velvia users - r/fujivelvia has been created! /!/ -----> i !!! 've -----> just !!!  -----> created !!!  \"the fuji velvia lightbox\", a new subreddit for all velvia-related submissions and discussions: r/fujivelvia", "sortedWord": "None", "Identifyer": null, "identifyer": 3603, "year": "2019"}, {"autor": "RiotCraig", "date": "2019-12-15 16:31:51", "content": "Any #SteelWoolPhotography heads out there? I’m noticing that there is not a lot of material out regarding techniques and/or safety measures to keep us out of trouble/harms way so I felt like I needed to create a thread where we can exchange ideas in regards to shooting steel wool", "link": "https://www.reddit.com/r/photography/comments/eb0yk6/any_steelwoolphotography_heads_out_there_im/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i needed to create", "selectorShort": "create", "MarkedSent": "any #steelwoolphotography heads out there? i’m noticing that there is not a lot of material out regarding techniques and/or safety measures to keep us out of trouble/harms way so -----> i !!!  felt like -----> i !!!  -----> needed !!!  -----> to !!!  -----> create !!!  a thread where we can exchange ideas in regards -----> to !!!  shooting steel wool", "sortedWord": "None", "Identifyer": null, "identifyer": 3750, "year": "2019"}, {"autor": "meinreno", "date": "2019-12-16 18:15:46", "content": "Hi, i created an instagram profile for photos with smartphone", "link": "https://www.reddit.com/r/photography/comments/ebitai/hi_i_created_an_instagram_profile_for_photos_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi, -----> i !!!  -----> created !!!  an instagram profile for photos with smartphone", "sortedWord": "None", "Identifyer": null, "identifyer": 3850, "year": "2019"}, {"autor": "AthenaMoonbeam", "date": "2019-12-02 23:37:29", "content": "Need advice on jewelry photography for that sparkle! /!/ Hi, all! I create and sell a lot of jewelry using diamonds and CZs. The work looks amazing in person, but I can't seem to get good pictures of the jewelry that really allow the diamonds to sparkle. Also, I've only really had good  luck when using soft natural light on a sunny day for photos. Any advice on getting jewelry to sparkle and look good? I like my pictures bright and cheery, mostly with white or soft pastel backgrounds. Thank you in advance!!", "link": "https://www.reddit.com/r/photography/comments/e57qpn/need_advice_on_jewelry_photography_for_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "need advice on jewelry photography for that sparkle! /!/ hi, all! -----> i !!!  -----> create !!!  and sell a lot of jewelry using diamonds and czs. the work looks amazing in person, but i can't seem to get good pictures of the jewelry that really allow the diamonds to sparkle. also, i've only really had good  luck when using soft natural light on a sunny day for photos. any advice on getting jewelry to sparkle and look good? i like my pictures bright and cheery, mostly with white or soft pastel backgrounds. thank you in advance!!", "sortedWord": "None", "Identifyer": null, "identifyer": 4045, "year": "2019"}, {"autor": "jbuyske", "date": "2019-12-07 15:28:38", "content": "Professionals, Is Social Media Necessary? /!/ I’m just getting a business going and have had a few paying clients. I created my first website and have booked a couple family portrait sessions. My question is as stated. Do I need to have a Facebook and Instagram page to reach the widest audience? I don’t have my own personal social media pages (unless you count this, I guess) because I got burnt out on them, and I don’t really want to set another one up. But, I’d be curious to hear opinions on if they are worth it and how you go about managing them. Thanks!", "link": "https://www.reddit.com/r/photography/comments/e7fkmr/professionals_is_social_media_necessary/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "professionals, is social media necessary? /!/ i’m just getting a business going and have had a few paying clients. -----> i !!!  -----> created !!!  my first website and have booked a couple family portrait sessions. my question is as stated. do i need to have a facebook and instagram page to reach the widest audience? i don’t have my own personal social media pages (unless you count this, i guess) because i got burnt out on them, and i don’t really want to set another one up. but, i’d be curious to hear opinions on if they are worth it and how you go about managing them. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 4276, "year": "2019"}, {"autor": "PeanutPay7", "date": "2019-03-14 20:23:20", "content": "Creating a website? /!/ I’m definitely an amateur photographer, but I’m always looking to try new things and grow this hobby into something more career/job oriented. (I’ve only recently discovered this passion in the last 6 months) \nI know how to put a physical portfolio together, but I’m lost when it comes to an online presence. \nWhat’s the best route to take in creating a website for people and potential employers to view my work? \nThanks for your time and help! ", "link": "https://www.reddit.com/r/photography/comments/b159w9/creating_a_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a website? /!/ i’m definitely an amateur photographer, but i’m always looking to try new things and grow this hobby into something more career/job oriented. (i’ve only recently discovered this passion in the last 6 months) \ni know how to put a physical portfolio together, but i’m lost when it comes to an online presence. \nwhat’s the best route to take in creating a website for people and potential employers to view my work? \nthanks for your time and help! ", "sortedWord": "None", "Identifyer": null, "identifyer": 4407, "year": "2019"}, {"autor": "bluedonkey720", "date": "2019-03-08 02:20:46", "content": "photo book suggestions /!/ I am putting together a personal photobook of my professional photographs. It's just for me - I don't really have plans to show it off. This first book is of my earlier work; I plan on doing a second book in the future with my more current photographs.\n\nAny suggestions on favorite companies to  create the photobook? I've checked out Adorama, Mpix, Nations Lab and Shutterfly. \n\nI want a sturdy, beautiful book that lays flat. I will also need to purchase extra pages. I know I can't create the project in 20 pages. Picture quality is very important to me, but obviously if the assembled book is crap, it negates the good looking photos.  I liked MPix, but I found their prices much higher than the others. \n\nWhat are your suggestions?", "link": "https://www.reddit.com/r/photography/comments/aykylr/photo_book_suggestions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can't create", "selectorShort": "create", "MarkedSent": "photo book suggestions /!/ i am putting together a personal photobook of my professional photographs. it's just for me - i don't really have plans to show it off. this first book is of my earlier work; i plan on doing a second book in the future with my more current photographs.\n\nany suggestions on favorite companies to  create the photobook? i've checked out adorama, mpix, nations lab and shutterfly. \n\ni want a sturdy, beautiful book that lays flat. i will also need to purchase extra pages. -----> i !!!  know -----> i !!!  -----> ca !!! -----> n't !!!  -----> create !!!  the project in 20 pages. picture quality is very important to me, but obviously if the assembled book is crap, it negates the good looking photos.  i liked mpix, but i found their prices much higher than the others. \n\nwhat are your suggestions?", "sortedWord": "None", "Identifyer": null, "identifyer": 4860, "year": "2019"}, {"autor": "120r", "date": "2019-04-28 19:45:46", "content": "How would you design a photo curriculum? /!/ If you were to create a course, certificate program, degree in photography with the goal of creating a well rounded photographer (technical and artistic) how would you design the program?\n\nI first picked up a camera with the intent of being a photographer over 15 years ago and I am still learning. Creating a course is just a exercise I though would be a interesting learning tool for my own future development. Some ideas / topics I might cover:\n\n* Exposure\n* The Zone System\n* Using a light meter\n* Flash photography\n* Composition\n* Color used by the masters of fine art paintings\n* Interacting with people\n* Print making\n* Posing\n* Life drawing\n* Digital skills (i.e. Photoshop, different RAW processing, color/camera profiles)\n* Basics in differentiating types of photography (i.e. what makes a headshot different from a portrait)\n* Welding and Wood Work\n\nI am sure the list can go on and on, the order in which I would teach could go on and on.", "link": "https://www.reddit.com/r/photography/comments/bif5u6/how_would_you_design_a_photo_curriculum/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "how would you design a photo curriculum? /!/ if you were to create a course, certificate program, degree in photography with the goal of creating a well rounded photographer (technical and artistic) how would you design the program?\n\ni first picked up a camera with the intent of being a photographer over 15 years ago and i am still learning. -----> creating !!!  a course is just a exercise i though would be a interesting learning tool for my own future development. some ideas / topics i might cover:\n\n* exposure\n* the zone system\n* using a light meter\n* flash photography\n* composition\n* color used by the masters of fine art paintings\n* interacting with people\n* print making\n* posing\n* life drawing\n* digital skills (i.e. photoshop, different raw processing, color/camera profiles)\n* basics in differentiating types of photography (i.e. what makes a headshot different from a portrait)\n* welding and wood work\n\ni am sure the list can go on and on, the order in which i would teach could go on and on.", "sortedWord": "None", "Identifyer": null, "identifyer": 5294, "year": "2019"}, {"autor": "BrockLewis", "date": "2019-05-29 14:45:32", "content": "I have created The Worlds 1st Online Social Media Based Museum on Instagram for Photos, Pictures, Portraits, Virtual Edits/Designs, etc!!!!! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/bufjq7/i_have_created_the_worlds_1st_online_social_media/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> have !!!  -----> created !!!  the worlds 1st online social media based museum on instagram for photos, pictures, portraits, virtual edits/designs, etc!!!!! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 5568, "year": "2019"}, {"autor": "tomasztrz", "date": "2019-06-07 20:56:25", "content": "I would like to invite you to join my free photography newsletter. I’m trying to create something unusual. I interview photographers, both those famous ones as well as members of our community. Would love to have you on board. Already 4700+ people are reading it. The url is: www.imagebreak.com /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/bxzqj8/i_would_like_to_invite_you_to_join_my_free/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to create", "selectorShort": "create", "MarkedSent": "i would like to invite you to join my free photography newsletter. -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> create !!!  something unusual. i interview photographers, both those famous ones as well as members of our community. would love to have you on board. already 4700+ people are reading it. the url is: www.imagebreak.com /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 5765, "year": "2019"}, {"autor": "Kellen_ainley", "date": "2019-06-07 17:45:34", "content": "How did you learn to pose people? /!/ I've been shooting for 6 years, lots and lots of people. To this day, I think my biggest weakness is still posing people! I can create tack-sharp images, in beautiful settings. But my posing has alway struggled. I tend to lean towards \"Natural and not overly pose-y\" type shots, as a way for my brain to \"escape\" my problem. I have a list of things in my head of things NOT to do, which can be guidelines. My struggle comes with the most awkward people.   \n\n\nI'm curious what resources people have used to learn how to be good at posing people. Mostly thinking of solo portraits.", "link": "https://www.reddit.com/r/photography/comments/bxxir4/how_did_you_learn_to_pose_people/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "how did you learn to pose people? /!/ i've been shooting for 6 years, lots and lots of people. to this day, i think my biggest weakness is still posing people! -----> i !!!  -----> can !!!  -----> create !!!  tack-sharp images, in beautiful settings. but my posing has alway struggled. i tend to lean towards \"natural and not overly pose-y\" type shots, as a way for my brain to \"escape\" my problem. i have a list of things in my head of things not to do, which can be guidelines. my struggle comes with the most awkward people.   \n\n\ni'm curious what resources people have used to learn how to be good at posing people. mostly thinking of solo portraits.", "sortedWord": "None", "Identifyer": null, "identifyer": 5776, "year": "2019"}, {"autor": "TommyBurbs", "date": "2019-08-27 17:22:06", "content": "How do i get started of taking portrait of others? /!/ Hey guys , I just started into photography around a week ago. I created a social media page for the purpose of it. I've only been taking landscape photography with my Canon EOS M50 and using the kit lens. Do you have any tips of how i could start taking portrait of people and to build a connection? Btw im in Montreal", "link": "https://www.reddit.com/r/photography/comments/cw7jpb/how_do_i_get_started_of_taking_portrait_of_others/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "how do i get started of taking portrait of others? /!/ hey guys , i just started into photography around a week ago. -----> i !!!  -----> created !!!  a social media page for the purpose of it. i've only been taking landscape photography with my canon eos m50 and using the kit lens. do you have any tips of how i could start taking portrait of people and to build a connection? btw im in montreal", "sortedWord": "None", "Identifyer": null, "identifyer": 7261, "year": "2019"}, {"autor": "TommyBurbs", "date": "2019-08-27 17:09:24", "content": "Good afternoon Redditors /!/ Hey guys , I just started into photography around a week ago. I created a social media page for the purpose of it. I've only been taking landscape photography with my Canon EOS M50 and using the kit lens. Do you have any tips of how i could start taking portrait of people and to build a connection? Btw im in Montreal", "link": "https://www.reddit.com/r/photography/comments/cw7dm4/good_afternoon_redditors/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "good afternoon redditors /!/ hey guys , i just started into photography around a week ago. -----> i !!!  -----> created !!!  a social media page for the purpose of it. i've only been taking landscape photography with my canon eos m50 and using the kit lens. do you have any tips of how i could start taking portrait of people and to build a connection? btw im in montreal", "sortedWord": "None", "Identifyer": null, "identifyer": 7263, "year": "2019"}, {"autor": "isaf1021", "date": "2019-08-24 22:09:16", "content": "photography surveys (please help I am a new photography intern and have no clue what I'm doing) /!/ So I just finished up my first month at my first internship position at a photography startup (woohoo!) It has been super cool, except for the fact that I have no clue what I’m doing — they don’t really teach you all the in’s and out’s of work life when you're in school. Anyways, my boss has just asked for some info on social media and publications from me, and I’m not entirely sure how I am supposed to obtain said data. SO as I have done in the past, I’ve decided to turn to Reddit to find answers. I’ve created these two surveys to help me get some answers. PLEASE feel free to fill them out if you have five minutes, or leave some advice below for a brand new intern (I’m sure others could use it too) Thanks!!\n\n[https://www.surveymonkey.com/r/Q3X3QLZ](https://www.surveymonkey.com/r/Q3X3QLZ)\n\n[https://www.surveymonkey.com/r/W7W8QYJ](https://www.surveymonkey.com/r/W7W8QYJ)", "link": "https://www.reddit.com/r/photography/comments/cuzumk/photography_surveys_please_help_i_am_a_new/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’ve created", "selectorShort": "create", "MarkedSent": "photography surveys (please help i am a new photography intern and have no clue what i'm doing) /!/ so i just finished up my first month at my first internship position at a photography startup (woohoo!) it has been super cool, except for the fact that i have no clue what i’m doing — they don’t really teach you all the in’s and out’s of work life when you're in school. anyways, my boss has just asked for some info on social media and publications from me, and i’m not entirely sure how i am supposed to obtain said data. so as i have done in the past, i’ve decided to turn to reddit to find answers. -----> i !!! ’ve -----> created !!!  these two surveys to help me get some answers. please feel free to fill them out if you have five minutes, or leave some advice below for a brand new intern (i’m sure others could use it too) thanks!!\n\n[https://www.surveymonkey.com/r/q3x3qlz](https://www.surveymonkey.com/r/q3x3qlz)\n\n[https://www.surveymonkey.com/r/w7w8qyj](https://www.surveymonkey.com/r/w7w8qyj)", "sortedWord": "None", "Identifyer": null, "identifyer": 7366, "year": "2019"}, {"autor": "cultur_is", "date": "2019-08-24 17:56:30", "content": "What Would Your Ideal Photo Sharing App Look Like? /!/ This community helped me when I was creating an app for Photographers way back in 2013 and I've been reading threads on Flickr, IG, 500px EyeEm and others this morning - going back to January.\n\nHere's some info on my long dead app, One Degree as background.\n\n[https://kaptur.co/10-questions-for-founder-one-degree/](https://kaptur.co/10-questions-for-founder-one-degree/)\n\n[http://www.rps.org/news/2014/august/one-degree-iphone-app](http://www.rps.org/news/2014/august/one-degree-iphone-app)\n\nWhat are the top \\~10 things that you want from a photo sharing app?\n\nI couple I've seen are, 1) no change to aspect ratio and, 2) chronological photo galleries/streams . . .\n\nI would love to hear from you because, like an idiot, I've got some ideas and I'm looking for a shop to do the development.\n\nPS Yes, I created a new account for this.", "link": "https://www.reddit.com/r/photography/comments/cuwp8j/what_would_your_ideal_photo_sharing_app_look_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "what would your ideal photo sharing app look like? /!/ this community helped me when -----> i !!!  -----> was !!!  -----> creating !!!  an app for photographers way back in 2013 and -----> i !!! 've been reading threads on flickr, ig, 500px eyeem and others this morning - going back to january.\n\nhere's some info on my long dead app, one degree as background.\n\n[https://kaptur.co/10-questions-for-founder-one-degree/](https://kaptur.co/10-questions-for-founder-one-degree/)\n\n[http://www.rps.org/news/2014/august/one-degree-iphone-app](http://www.rps.org/news/2014/august/one-degree-iphone-app)\n\nwhat are the top \\~10 things that you want from a photo sharing app?\n\ni couple i've seen are, 1) no change to aspect ratio and, 2) chronological photo galleries/streams . . .\n\ni would love to hear from you because, like an idiot, i've got some ideas and i'm looking for a shop to do the development.\n\nps yes, i created a new account for this.", "sortedWord": "None", "Identifyer": null, "identifyer": 7388, "year": "2019"}, {"autor": "cepeka", "date": "2019-10-30 10:15:01", "content": "Create Color Checker Profiles by Script /!/ Hi there !\n\nI'm looking for a way to create Color Checker profiles (\\*.dcp) for use in Photoshop, with a script/batch or command-line.\n\nThe Xrite's Camera Calibration tool don't seems to handle any commands, and I can't find anything on this subject?\n\nI've found [ICC Color Camera Calibrator](http://www.dohm.com.au/coca/index.html) and heard that it can be launched in command line, but I can't understand how it's done.\n\nDoes anyone know a way to easily do this ?", "link": "https://www.reddit.com/r/photography/comments/dp4qne/create_color_checker_profiles_by_script/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  color checker profiles by script /!/ hi there !\n\ni'm looking for a way to create color checker profiles (\\*.dcp) for use in photoshop, with a script/batch or command-line.\n\nthe xrite's camera calibration tool don't seems to handle any commands, and i can't find anything on this subject?\n\ni've found [icc color camera calibrator](http://www.dohm.com.au/coca/index.html) and heard that it can be launched in command line, but i can't understand how it's done.\n\ndoes anyone know a way to easily do this ?", "sortedWord": "None", "Identifyer": null, "identifyer": 7675, "year": "2019"}, {"autor": "bertso9", "date": "2019-11-05 07:21:28", "content": "I am starting to edit photos as a hobby. No professional camera so you can see the pixels. Creating different lightroom presets which give unique and darkish vibe. What do you think? I am open to all suggestions as I am new and want to learn anything possible", "link": "https://www.reddit.com/r/photography/comments/drvtw6/i_am_starting_to_edit_photos_as_a_hobby_no/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "i am starting to edit photos as a hobby. no professional camera so you can see the pixels. -----> creating !!!  different lightroom presets which give unique and darkish vibe. what do you think? i am open to all suggestions as i am new and want to learn anything possible", "sortedWord": "None", "Identifyer": null, "identifyer": 7757, "year": "2019"}, {"autor": "MasterCode3", "date": "2019-11-28 03:38:40", "content": "Free Tool to Get Feedback on Your Portfolio Website /!/  Hey guys, I created a free feedback tool for you to get feedback on your portfolio website: [https://app.loopinput.com/register](https://app.loopinput.com/register)\n\nEnjoy!", "link": "https://www.reddit.com/r/photography/comments/e2s52z/free_tool_to_get_feedback_on_your_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "free tool to get feedback on your portfolio website /!/  hey guys, -----> i !!!  -----> created !!!  a free feedback tool for you to get feedback on your portfolio website: [https://app.loopinput.com/register](https://app.loopinput.com/register)\n\nenjoy!", "sortedWord": "None", "Identifyer": null, "identifyer": 7974, "year": "2019"}, {"autor": "luckycharmz336", "date": "2019-11-27 22:22:48", "content": "Visual Story - ULTIMATE LIST of Free Photo Website's for 2020! /!/ This is an impressive compilation of [free stock photography website's for 2020](https://www.dataflurry.com/free-stock-photography-sites-complete-list-2020/)!  We created this in an impressive visual format with easy links to all the best resources!\n\nPlease let me know your thoughts, and contribute any resources you like as well!\n\nI would love to hear everyone's thoughts on this compilation and any way to improve!!!", "link": "https://www.reddit.com/r/photography/comments/e2nxt1/visual_story_ultimate_list_of_free_photo_websites/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we created", "selectorShort": "create", "MarkedSent": "visual story - ultimate list of free photo website's for 2020! /!/ this is an impressive compilation of [free stock photography website's for 2020](https://www.dataflurry.com/free-stock-photography-sites-complete-list-2020/)!  -----> we !!!  -----> created !!!  this in an impressive visual format with easy links to all the best resources!\n\nplease let me know your thoughts, and contribute any resources you like as well!\n\ni would love to hear everyone's thoughts on this compilation and any way to improve!!!", "sortedWord": "None", "Identifyer": null, "identifyer": 7989, "year": "2019"}, {"autor": "XeroFusiion", "date": "2019-11-27 11:31:53", "content": "New Attachable IPhone Lens I picked up, safe to say it helps an absolute beginner like me create some stunning photos", "link": "https://www.reddit.com/r/photography/comments/e2etx7/new_attachable_iphone_lens_i_picked_up_safe_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "new attachable iphone lens i picked up, safe to say it helps an absolute beginner like -----> me !!!  -----> create !!!  some stunning photos", "sortedWord": "None", "Identifyer": null, "identifyer": 8024, "year": "2019"}, {"autor": "FlyingPhotog", "date": "2019-12-20 01:39:45", "content": "The state of Flickr (email from CEO) /!/ Dear Flickr Pros,\nFirst, and above all else: thank you. Thank you for being a part of our community. Thank you for caring about Flickr. Thank you for supporting Flickr. Thank you for being a Flickr Pro.\n\nTwo years ago, Flickr was losing tens of millions of dollars a year. Our company, SmugMug, stepped in to rescue it from being shut down and to save tens of billions of your precious photos from being erased.\n\nWhy? We’ve spent 17 years lovingly building our company into a thriving, family-owned and -operated business that cares deeply about photographers. SmugMug has always been the place for photographers to showcase their photography, and we’ve long admired how Flickr has been the community where they connect with each other. We couldn’t stand by and watch Flickr vanish.\n\nSo we took a big risk, stepped in, and saved Flickr. Together, we created the world’s largest photographer-focused community: a place where photographers can stand out and fit in.\n\nAnd yet, Flickr—the world’s most-beloved, money-losing business—still needs your help.\n\nWe’ve been hard at work improving Flickr. We hired an excellent, large staff of Support Heroes who now deliver support with an average customer satisfaction rating of above 90%. We got rid of Yahoo’s login. We moved the platform and every photo to Amazon Web Services (AWS), the industry leader in cloud computing, and modernized its technology along the way. As a result, pages are already 20% faster and photos load 30% more quickly. Platform outages, including Pandas, are way down. Flickr continues to get faster and more stable, and important new features are being built once again.\n\nOur work is never done, but we’ve made tremendous progress.\n\nFlickr still needs your help. It’s still losing money. You, and hundreds of thousands of loyal Flickr members stepped up and joined Flickr Pro, for which we are eternally grateful. It’s losing a lot less money than it was. But it’s not yet making enough.\n\nWe need more Flickr Pro members if we want to keep the Flickr dream alive, and we need your help to share the story of Flickr.\n\nWe didn’t buy Flickr because we thought it was a cash cow. Unlike platforms like Facebook, we also didn’t buy it to invade your privacy and sell your data. We bought it because we love photographers, we love photography, and we believe Flickr deserves not only to live on but thrive. We think the world agrees; and we think the Flickr community does, too. But we cannot continue to operate it at a loss as we’ve been doing.\n\nFlickr is the world’s largest photographer-focused community. It’s the world’s best way to find great photography and connect with amazing photographers. Flickr hosts some of the world’s most iconic, most priceless photos, freely available to the entire world. This community is home to more than 100 million accounts and tens of billions of photos. It serves billions of photos every single day. It’s huge. It’s a priceless treasure for the whole world. And it costs money to operate. Lots of money.\n\nAs you know, Flickr is the best value in photo sharing anywhere in the world. Flickr Pro members get ad-free browsing for themselves and their visitors, advanced stats, unlimited full-quality storage for all their photos, plus premium features and access to the world’s largest photographer-focused community.\n\nPlease, help us spread the word. Help us make Flickr thrive. Help us ensure Flickr has a bright future. Every Flickr Pro subscription goes directly to keeping Flickr alive and creating great new experiences for photographers like you. We are building lots of great things for the Flickr community, but we need your help. We can do this together.\n\nWe’re launching our end-of-year Pro subscription campaign on Thursday, December 26, but I want to give you a coupon code to share with friends, family, or anyone who shares your love of photography and community so they can enjoy the same 25% discount before the campaign starts.\n\nWe’ve gone to great lengths to optimize Flickr for cost savings wherever possible, but the increasing cost of operating this enormous community and continuing to invest in its future will require a small price increase early in the new year, so this is truly the very best time to help everyone upgrade to a Pro membership.\n\nIf you value Flickr finally being independent, built for photographers and by photographers, we need your help.\n\nWith gratitude,\n\nDon MacAskill\nCo-Founder, CEO &amp; Chief Geek\nSmugMug + Flickr\n\nPlease share coupon code 25in2019 or link below to give the gift of 25% off Flickr Pro now.\n\nhttps://www.flickr.com/account/upgrade/pro?coupon=25in2019", "link": "https://www.reddit.com/r/photography/comments/ed32hx/the_state_of_flickr_email_from_ceo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we created", "selectorShort": "create", "MarkedSent": "the state of flickr (email from ceo) /!/ dear flickr pros,\nfirst, and above all else: thank you. thank you for being a part of our community. thank you for caring about flickr. thank you for supporting flickr. thank you for being a flickr pro.\n\ntwo years ago, flickr was losing tens of millions of dollars a year. our company, smugmug, stepped in to rescue it from being shut down and to save tens of billions of your precious photos from being erased.\n\nwhy? we’ve spent 17 years lovingly building our company into a thriving, family-owned and -operated business that cares deeply about photographers. smugmug has always been the place for photographers to showcase their photography, and we’ve long admired how flickr has been the community where they connect with each other. we couldn’t stand by and watch flickr vanish.\n\nso we took a big risk, stepped in, and saved flickr. together, -----> we !!!  -----> created !!!  the world’s largest photographer-focused community: a place where photographers can stand out and fit in.\n\nand yet, flickr—the world’s most-beloved, money-losing business—still needs your help.\n\nwe’ve been hard at work improving flickr. we hired an excellent, large staff of support heroes who now deliver support with an average customer satisfaction rating of above 90%. we got rid of yahoo’s login. we moved the platform and every photo to amazon web services (aws), the industry leader in cloud computing, and modernized its technology along the way. as a result, pages are already 20% faster and photos load 30% more quickly. platform outages, including pandas, are way down. flickr continues to get faster and more stable, and important new features are being built once again.\n\nour work is never done, but we’ve made tremendous progress.\n\nflickr still needs your help. it’s still losing money. you, and hundreds of thousands of loyal flickr members stepped up and joined flickr pro, for which we are eternally grateful. it’s losing a lot less money than it was. but it’s not yet making enough.\n\nwe need more flickr pro members if we want to keep the flickr dream alive, and we need your help to share the story of flickr.\n\nwe didn’t buy flickr because we thought it was a cash cow. unlike platforms like facebook, we also didn’t buy it to invade your privacy and sell your data. we bought it because we love photographers, we love photography, and we believe flickr deserves not only to live on but thrive. we think the world agrees; and we think the flickr community does, too. but we cannot continue to operate it at a loss as we’ve been doing.\n\nflickr is the world’s largest photographer-focused community. it’s the world’s best way to find great photography and connect with amazing photographers. flickr hosts some of the world’s most iconic, most priceless photos, freely available to the entire world. this community is home to more than 100 million accounts and tens of billions of photos. it serves billions of photos every single day. it’s huge. it’s a priceless treasure for the whole world. and it costs money to operate. lots of money.\n\nas you know, flickr is the best value in photo sharing anywhere in the world. flickr pro members get ad-free browsing for themselves and their visitors, advanced stats, unlimited full-quality storage for all their photos, plus premium features and access to the world’s largest photographer-focused community.\n\nplease, help us spread the word. help us make flickr thrive. help us ensure flickr has a bright future. every flickr pro subscription goes directly to keeping flickr alive and creating great new experiences for photographers like you. we are building lots of great things for the flickr community, but we need your help. we can do this together.\n\nwe’re launching our end-of-year pro subscription campaign on thursday, december 26, but i want to give you a coupon code to share with friends, family, or anyone who shares your love of photography and community so they can enjoy the same 25% discount before the campaign starts.\n\nwe’ve gone to great lengths to optimize flickr for cost savings wherever possible, but the increasing cost of operating this enormous community and continuing to invest in its future will require a small price increase early in the new year, so this is truly the very best time to help everyone upgrade to a pro membership.\n\nif you value flickr finally being independent, built for photographers and by photographers, we need your help.\n\nwith gratitude,\n\ndon macaskill\nco-founder, ceo &amp; chief geek\nsmugmug + flickr\n\nplease share coupon code 25in2019 or link below to give the gift of 25% off flickr pro now.\n\nhttps://www.flickr.com/account/upgrade/pro?coupon=25in2019", "sortedWord": "None", "Identifyer": null, "identifyer": 8107, "year": "2019"}, {"autor": "greencn69", "date": "2019-03-13 22:46:15", "content": "Amateur trying to learn something /!/ Hello everyone! I bought my first camera about 3 months ago and I'm really starting to like the photos I'm creating. Not trying to brag but recognizing self value. Either way I wanted to start adding a personalized stamp or watermark (I think that's what its called) I use Lightroom for my editing and I was curious if there was a way to add it through that program or if there was another way to add my own watermark. ", "link": "https://www.reddit.com/r/photography/comments/b0sjjt/amateur_trying_to_learn_something/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "amateur trying to learn something /!/ hello everyone! -----> i !!!  bought my first camera about 3 months ago and -----> i !!! 'm really starting to like the photos -----> i !!! 'm -----> creating !!! . not trying to brag but recognizing self value. either way i wanted to start adding a personalized stamp or watermark (i think that's what its called) i use lightroom for my editing and i was curious if there was a way to add it through that program or if there was another way to add my own watermark. ", "sortedWord": "None", "Identifyer": null, "identifyer": 64446, "year": "2019"}, {"autor": "Graphicskidunya", "date": "2019-07-01 08:20:41", "content": "Create 3D Hot Pot Design", "link": "https://www.reddit.com/r/photography/comments/c7pzkd/create_3d_hot_pot_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  3d hot pot design", "sortedWord": "None", "Identifyer": null, "identifyer": 64707, "year": "2019"}, {"autor": "ntoporcov", "date": "2019-01-18 06:24:28", "content": "I created a free web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.", "link": "https://www.reddit.com/r/photography/comments/ah7mmj/i_created_a_free_web_app_for_photographers_who/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a free web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.", "sortedWord": "None", "Identifyer": null, "identifyer": 65730, "year": "2019"}, {"autor": "magicconch_", "date": "2019-02-04 16:57:46", "content": "What techniques would allow me to create abstractions such as this one? /!/ &amp;#x200B;\n\n*Processing img egfq0k941le21...*", "link": "https://www.reddit.com/r/photography/comments/an3mfv/what_techniques_would_allow_me_to_create/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "what techniques would allow -----> me !!!  -----> to !!!  -----> create !!!  abstractions such as this one? /!/ &amp;#x200b;\n\n*processing img egfq0k941le21...*", "sortedWord": "None", "Identifyer": null, "identifyer": 65860, "year": "2019"}, {"autor": "Gerbie_Pabilonia", "date": "2019-06-12 11:04:48", "content": "Creating a \"Medieval Powerful Witch\" / Digital Art Photography / Photo Manipulation", "link": "https://www.reddit.com/r/photography/comments/bzptto/creating_a_medieval_powerful_witch_digital_art/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a \"medieval powerful witch\" / digital art photography / photo manipulation", "sortedWord": "None", "Identifyer": null, "identifyer": 66021, "year": "2019"}, {"autor": "steveisblah", "date": "2019-06-12 04:39:17", "content": "Water Mist and side lighting as portrait effect? /!/ Has anybody ever experimented or had any experience with using side lighting as a and water mist with a portrait? I'm trying to create an effect like [this](https://pixabay.com/illustrations/bokeh-background-light-reflections-2245355/) but with a model and having the bokeh in the foreground catching the colored light. So far my proof of concept tests have just been the subject covered by a fog that's just white and mundane.", "link": "https://www.reddit.com/r/photography/comments/bzmrox/water_mist_and_side_lighting_as_portrait_effect/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm trying to create", "selectorShort": "create", "MarkedSent": "water mist and side lighting as portrait effect? /!/ has anybody ever experimented or had any experience with using side lighting as a and water mist with a portrait? -----> i !!! 'm -----> trying !!!  -----> to !!!  -----> create !!!  an effect like [this](https://pixabay.com/illustrations/bokeh-background-light-reflections-2245355/) but with a model and having the bokeh in the foreground catching the colored light. so far my proof of concept tests have just been the subject covered by a fog that's just white and mundane.", "sortedWord": "None", "Identifyer": null, "identifyer": 66035, "year": "2019"}, {"autor": "jyc23", "date": "2019-11-04 14:59:16", "content": "Photography, storefronts, logos, and usage restrictions /!/ My employer is asking me to create a marketing email graphic to promote an ADA (accessibility act) compliance service that our company sells. In light of the recent news involving Dominos Pizza (a blind person sued them for having a non compliant website and won), my manager wants me to use a photograph of a Dominos storefront / logo as the headline image for the email. \n\nSo, the image is marked as Editorial Use Only in the stock image archive, which precludes commercial use. This is clearly commercial use, right? \n\nIs it possible to get around the issue by just going to a Dominos store and taking a photo of a sign myself and use that photo in the design? Or would that then raise other legal issues?", "link": "https://www.reddit.com/r/photography/comments/driqsx/photography_storefronts_logos_and_usage/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "photography, storefronts, logos, and usage restrictions /!/ my employer is asking -----> me !!!  -----> to !!!  -----> create !!!  a marketing email graphic -----> to !!!  promote an ada (accessibility act) compliance service that our company sells. in light of the recent news involving dominos pizza (a blind person sued them for having a non compliant website and won), my manager wants me to use a photograph of a dominos storefront / logo as the headline image for the email. \n\nso, the image is marked as editorial use only in the stock image archive, which precludes commercial use. this is clearly commercial use, right? \n\nis it possible to get around the issue by just going to a dominos store and taking a photo of a sign myself and use that photo in the design? or would that then raise other legal issues?", "sortedWord": "None", "Identifyer": null, "identifyer": 66920, "year": "2019"}, {"autor": "SinePari1231", "date": "2019-04-09 01:29:02", "content": "Noob question /!/ Good evening everyone,\n\nI am just getting into photography, toy photography specifically and I have this picture in mind that I want to set up, but I am not certain how.\n\nI want to have a few 1:12 scale figures of soldiers in the foreground, with a 1:270 scale aircraft doing a flyby in the background (suspended by fishing line I think).\n\nWhat can I do to create the illusion that the aircraft is in scale with the soldiers, but just further back? I assume an effect to make it seem the aircraft is further in the distance than it really is.\n\nThanks for your help.", "link": "https://www.reddit.com/r/photography/comments/bb1yuv/noob_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i do to create", "selectorShort": "create", "MarkedSent": "noob question /!/ good evening everyone,\n\ni am just getting into photography, toy photography specifically and i have this picture in mind that i want to set up, but i am not certain how.\n\ni want to have a few 1:12 scale figures of soldiers in the foreground, with a 1:270 scale aircraft doing a flyby in the background (suspended by fishing line i think).\n\nwhat can -----> i !!!  -----> do !!!  -----> to !!!  -----> create !!!  the illusion that the aircraft is in scale with the soldiers, but just further back? i assume an effect to make it seem the aircraft is further in the distance than it really is.\n\nthanks for your help.", "sortedWord": "None", "Identifyer": null, "identifyer": 67546, "year": "2019"}, {"autor": "K12ish", "date": "2019-03-21 21:28:24", "content": "How has this artist created the source picture for this painting? /!/ [Artwork in question](http://sarah-graham-sweet-temptations.artworkreviews.co.uk/fullimage/Sarah-Graham-Sweet-Temptations-SGGC37-r.jpg)\n\n&amp;#x200B;\n\nSo I am an art student who is analysing the artist Sarah Graham and everything was all fine and dandy until I was required to create a piece in this style in which I was required to draw sweets from a picture.\n\nWow is it difficult to get good pictures of sweets. I used the camera on my smartphone and quickly noticed the difficulties in photography. \n\nI honestly have little idea how to get a picture of this quality and I do not know the techniques involved.\n\nI need to work out exactly how the artist has taken these photos in order to be able to create my own.\n\n&amp;#x200B;\n\nWhat i know/guess:\n\n* The artist uses lamps as there are distinct white spots on the sweets\n* The artist sets up everything on a mirror but leaves the things in it out of focus\n* The artist uses a monotone blue backdrop\n* Not all of the sweets are kept in focus\n\n&amp;#x200B;\n\nHow does the artist achieve these effects specifically? \n\nHow do you keep certain things in and out of focus?\n\nDo they modify perspective?\n\nWhat kind of camera would they use to do this?", "link": "https://www.reddit.com/r/photography/comments/b3w9x5/how_has_this_artist_created_the_source_picture/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was required to create", "selectorShort": "create", "MarkedSent": "how has this artist created the source picture for this painting? /!/ [artwork in question](http://sarah-graham-sweet-temptations.artworkreviews.co.uk/fullimage/sarah-graham-sweet-temptations-sggc37-r.jpg)\n\n&amp;#x200b;\n\nso -----> i !!!  am an art student who is analysing the artist sarah graham and everything -----> was !!!  all fine and dandy until -----> i !!!  -----> was !!!  -----> required !!!  -----> to !!!  -----> create !!!  a piece in this style in which -----> i !!!  -----> was !!!  -----> required !!!  -----> to !!!  draw sweets from a picture.\n\nwow is it difficult to get good pictures of sweets. i used the camera on my smartphone and quickly noticed the difficulties in photography. \n\ni honestly have little idea how to get a picture of this quality and i do not know the techniques involved.\n\ni need to work out exactly how the artist has taken these photos in order to be able to create my own.\n\n&amp;#x200b;\n\nwhat i know/guess:\n\n* the artist uses lamps as there are distinct white spots on the sweets\n* the artist sets up everything on a mirror but leaves the things in it out of focus\n* the artist uses a monotone blue backdrop\n* not all of the sweets are kept in focus\n\n&amp;#x200b;\n\nhow does the artist achieve these effects specifically? \n\nhow do you keep certain things in and out of focus?\n\ndo they modify perspective?\n\nwhat kind of camera would they use to do this?", "sortedWord": "None", "Identifyer": null, "identifyer": 67670, "year": "2019"}, {"autor": "hyngsuk", "date": "2019-02-14 02:17:18", "content": "How do I grow a portfolio and following on social media as an amatuer photographer? /!/ For some reason this seems nearly impossible for me and I am sure others too. The most used place for business and showcasing seems to be Instagram, I have not really seen much potential in using other platforms like Twitter as a main way to get out there and grow a following.\n\nI do understand creating an appealing \"product\" plus taking advantage of hashtags and interaction. However it seems for me that even after doing these things I can never break past a certain amount of followers. I notice a lot of photographers do the \"follow and unfollow\" method, but that just never seems to be something that works or feels right. I feel like there is a big majority that never did this (I dont know maybe thats what everybody does or did)? I just do not want to end up with for example 10k followers and 100 like average per photo, feels like you are lying to anyone you present it to. \n\nThere are plenty of small photographers who have amazing work but are stuck under a thousand followers which doesnt help make it feel like growing is possible. Just curious to hear if others have this same feeling and experience or something completely different?\n\n", "link": "https://www.reddit.com/r/photography/comments/aqep7m/how_do_i_grow_a_portfolio_and_following_on_social/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i do understand creating", "selectorShort": "create", "MarkedSent": "how do i grow a portfolio and following on social media as an amatuer photographer? /!/ for some reason this seems nearly impossible for me and i am sure others too. the most used place for business and showcasing seems to be instagram, i have not really seen much potential in using other platforms like twitter as a main way to get out there and grow a following.\n\n-----> i !!!  -----> do !!!  -----> understand !!!  -----> creating !!!  an appealing \"product\" plus taking advantage of hashtags and interaction. however it seems for me that even after doing these things i can never break past a certain amount of followers. i notice a lot of photographers do the \"follow and unfollow\" method, but that just never seems to be something that works or feels right. i feel like there is a big majority that never did this (i dont know maybe thats what everybody does or did)? i just do not want to end up with for example 10k followers and 100 like average per photo, feels like you are lying to anyone you present it to. \n\nthere are plenty of small photographers who have amazing work but are stuck under a thousand followers which doesnt help make it feel like growing is possible. just curious to hear if others have this same feeling and experience or something completely different?\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 67734, "year": "2019"}, {"autor": "wolo724", "date": "2019-01-08 19:03:40", "content": "Photography Website /!/ Hello everyone!  I just wanted to share the photography website I created for myself (it is a custom built WordPress site).  I know that a lot of you are interested in finding a good way to display your photos and I think this format works well while being highly customizable.  If you are interested in having something created that is similar, please let me know.\n\n[Alex Wolo Photography](https://alexwolophotography.com)", "link": "https://www.reddit.com/r/photography/comments/adxo8p/photography_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "photography website /!/ hello everyone!  -----> i !!!  just wanted to share the photography website -----> i !!!  -----> created !!!  for myself (it is a custom built wordpress site).  i know that a lot of you are interested in finding a good way to display your photos and i think this format works well while being highly customizable.  if you are interested in having something created that is similar, please let me know.\n\n[alex wolo photography](https://alexwolophotography.com)", "sortedWord": "None", "Identifyer": null, "identifyer": 68163, "year": "2019"}, {"autor": "Learn_From_Fred", "date": "2019-01-08 11:38:25", "content": "Create neon lighting with Lighting Effects Filter in Photoshop", "link": "https://www.reddit.com/r/photography/comments/adtei4/create_neon_lighting_with_lighting_effects_filter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  neon lighting with lighting effects filter in photoshop", "sortedWord": "None", "Identifyer": null, "identifyer": 68202, "year": "2019"}, {"autor": "maxiesnax", "date": "2019-01-16 13:38:34", "content": "I've created a survey for photographers to answer for my student project, if you have time please answer.", "link": "https://www.reddit.com/r/photography/comments/agl7l1/ive_created_a_survey_for_photographers_to_answer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "-----> i !!! 've -----> created !!!  a survey for photographers to answer for my student project, if you have time please answer.", "sortedWord": "None", "Identifyer": null, "identifyer": 68302, "year": "2019"}, {"autor": "_gounT", "date": "2019-01-25 17:56:55", "content": "No Budget/Smartphone User /!/ Hey photographs!   \n\n\nI am a terrainbuilder, which means that i create stuff like that [https://imgur.com/gallery/Wz7ZfeL](https://imgur.com/gallery/Wz7ZfeL) .   \nWhen i finished it, i want to shoot some photos but only got my smartphone and i will build a cool lightbox, which was found by another redditor.  [/u/anonymoooooose](https://www.reddit.com/user/anonymoooooooose) \n\nI will buy this [Stativ for Smartphone for 16€](https://www.amazon.de/Smartphone-Halterung-Android-Smartphone-Bluetooth-Fernsteuerung/dp/B076D4LMXQ/ref=sr_1_1_sspa?ie=UTF8&amp;qid=1548368621&amp;sr=8-1-spons&amp;keywords=smartphone+stativ&amp;psc=1) and want to shoot some nice photos and edit it with photoshop. I am looking for some \"lifehacks\" without going to deep in the photography scene. I am looking for some nice gifs like \"You can use xyz for a really cool smoke effect on your photo\", \"by using xyz you can have a pretty cool greenscreen\". \n\n&amp;#x200B;\n\nDo you have any ideas for me? :) ", "link": "https://www.reddit.com/r/photography/comments/ajrn8l/no_budgetsmartphone_user/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "no budget/smartphone user /!/ hey photographs!   \n\n\n-----> i !!!  am a terrainbuilder, which means that -----> i !!!  -----> create !!!  stuff like that [https://imgur.com/gallery/wz7zfel](https://imgur.com/gallery/wz7zfel) .   \nwhen i finished it, i want to shoot some photos but only got my smartphone and i will build a cool lightbox, which was found by another redditor.  [/u/anonymoooooose](https://www.reddit.com/user/anonymoooooooose) \n\ni will buy this [stativ for smartphone for 16€](https://www.amazon.de/smartphone-halterung-android-smartphone-bluetooth-fernsteuerung/dp/b076d4lmxq/ref=sr_1_1_sspa?ie=utf8&amp;qid=1548368621&amp;sr=8-1-spons&amp;keywords=smartphone+stativ&amp;psc=1) and want to shoot some nice photos and edit it with photoshop. i am looking for some \"lifehacks\" without going to deep in the photography scene. i am looking for some nice gifs like \"you can use xyz for a really cool smoke effect on your photo\", \"by using xyz you can have a pretty cool greenscreen\". \n\n&amp;#x200b;\n\ndo you have any ideas for me? :) ", "sortedWord": "None", "Identifyer": null, "identifyer": 68400, "year": "2019"}, {"autor": "Novacanye", "date": "2019-02-03 17:22:19", "content": "Creating Mood and Mystery in your Street Photography (feat. Joshua Jackson)", "link": "https://www.reddit.com/r/photography/comments/amrm8k/creating_mood_and_mystery_in_your_street/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  mood and mystery in your street photography (feat. joshua jackson)", "sortedWord": "None", "Identifyer": null, "identifyer": 68451, "year": "2019"}, {"autor": "skelepibs", "date": "2019-04-27 16:28:53", "content": "What’s a good place in Arkansas that I could create a decent photo essay? /!/ I know that’s some pretty broad criteria so let me narrow it down - I only have Cabot and Little Rock available to me. There’s not a lot that goes on here.   \n\nI would take several pictures of people in routine but that’s something the instructor of my Photography course already covered.  \n\nAre there any diverse places? Maybe where old meets new? I don’t have the option of getting out a lot and am not sure where to look. I really want to get something good that I don’t have to set up or create myself, if possible. Any help is immensely appreciated.", "link": "https://www.reddit.com/r/photography/comments/bi0sdd/whats_a_good_place_in_arkansas_that_i_could/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "what’s a good place in arkansas that -----> i !!!  -----> could !!!  -----> create !!!  a decent photo essay? /!/ i know that’s some pretty broad criteria so let me narrow it down - i only have cabot and little rock available to me. there’s not a lot that goes on here.   \n\ni would take several pictures of people in routine but that’s something the instructor of my photography course already covered.  \n\nare there any diverse places? maybe where old meets new? i don’t have the option of getting out a lot and am not sure where to look. i really want to get something good that i don’t have to set up or create myself, if possible. any help is immensely appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 68534, "year": "2019"}, {"autor": "franc_rizz", "date": "2019-06-28 12:21:11", "content": "How to \"steal\" color grading from every photo you want! /!/ Hi all!\n\nDid you fall in love with some particular artist's colorgrading and you want to replicate it in your photo?\n\nThings are easy!\n\n&amp;#x200B;\n\nFollow my personal \"guide\" and you will be able to produce your art!\n\nIt will be write step by step in order to be **Noob-friendly!**\n\n&amp;#x200B;\n\nI use Photoshop cc 2019 (latest version) but this guide works for every editing software do you use.\n\n&amp;#x200B;\n\nWhat you need:\n\n* Source image (image that you want to \"color-grading copy\" )\n* Destination image ( your image )\n\n&amp;#x200B;\n\n&gt;!I will now type SI as Source Image and DI as destination image!&lt;\n\n&amp;#x200B;\n\nFirst step:\n\nDownload image from your favorite artist. (I use instagram a lot then i download image from there) - google it and you find a site that download image from instagram-\n\n&amp;#x200B;\n\nSecond step (*we're in photoshop now*)\n\nOpen the image you've just downloaded and open your personal image you want to edit.\n\nThey must remain in two different windows.\n\n&amp;#x200B;\n\n**Now the work is gonna start:**\n\n&amp;#x200B;\n\n**SI:**\n\n* Click on **Eyedropper Tool** (Press I on keyboard for shortcut) then move the mouse over the darkest area of the image. (Sample size 3by3 - Sample: All layers)\n* Foreground color now changes and its set to this color.\n* Create a new **empty layer** (SHIFT-CTRL.-N) or go to Layer-New-Layer and press Ok\n* Press now B on keyboard to **Brush** shortcut. Opacity 100% Flow 100% Smoothing 100% Standard brush is ok. Click now on the image to create a circle of color.\n* Click on the layer of the main image.\n* **Repeat** Eyedropper on the image selecting the lighten color (usually over the face if its a portrait) then click on the empty layer and create the circle of the color. NOTE: in case of portraits, we have to pick 2 colors in order to create a good mix of skin tone.\n* Click on the layer of the main image.\n* (we need to sample midtones). Create a copy layer of the image (CTRL + J on WIN) then go to SELECT -&gt; **COLOR RANGE**. Select: midtones. Expand a little bit the range of the midtones (left and right) then click OK.\n* You now could see a selection on the image.\n* Go to **FILTER- BLUR- AVERAGE**\n* Click on **Eyedropper Tool** and sample the color\n* Click on the empty layer and use the brush to create the last one circle.\n* We need to create a palette of colors (explain later): Click on the image then Go to FILE- EXPORT-&gt; **SAVE FOR WEB.**\n* A new windows is not opened.\n* Change the format of the image to **GIF** (top right, Jpeg should be default value) and Set COLORS to 3 (three).\n* Inside the **Color Table** there are those 3 colors. Click on the top right of this Color Table and Click on SAVE COLOR TABLE. (REMEMBER THE PATH YOU SAVE IT)\n* It's time to work over DI, just Copy the empty layer (contains the colors circle) on the DI. (CTRL C + CTRL V is the fast way)\n\n&amp;#x200B;\n\n**DI:**\n\n* **Layer that contains sampled colors must be at the top of the layers**\n* Click on image then Create a **Curves layer** from \"create a new adjustment layer\" icon (the circle bot right of the screen). *Remember to click on the layer, not the mask that is set as default.*\n* **Properties of curves** layer is now opened (if not, go to Windows-Properties)\n* Focus your eye on those 3 sample tools on the left. (top is for black, mid is for grey, bot is for white)\n* Double Right Click over the **black tool** (Color Picker is now opened). Sample the darkest color of the Sample layer by left single click on it, then press OK.\n* Click on \"**NO**\" on the next windows (\"save the new target as default\").\n* Repeat for midtones and light tones. (Midtones of DI -&gt; choose the nearest color to grey of your image. || white --&gt; choose color on face -if portrait-\n* Create now a **Gradient Map** layer above curves layer. (remember to click on gradient layer and not over layer mask)\n* Go to **Windows-Swatches**. Click on top right of the Swatches panel (four lines icon) and select **Load Swatches** and load the Color table you saved previously (if you dont find it, select Color table on the format file).\n* You have now those 3 colors.\n* Open the properties of the **gradient map** then click over the gradient.\n* Left single Click on the darkest color of the right (bottom color) then left click of \"color\" dialog. Color picker window is opened.  \n* Right click on the darkest color of the color table on swatches and REMEMBER value of **B (Brightness).** (Darkest color is the 3rd) . Click ok to confirm.\n* Over **LOCATION** insert the value of the B you've just read.\n* Repeat for the white color. (remember the B again | lighten color is the first)\n* Create a new **gradient color** by left clicking everywhere over the color line.\n* Do the same steps for this color. Hit ok.\n* Changes **Blend mode** of the Gradient map layer from **NORMAL** to **SOFT LIGHT**.\n* Create a new **Vibrance layer** and increase Vibrance a bit (as your taste)\n* Create a new **Selective color** if some colors has trouble (for example on portrait, skin tones etc.)\n* Create a new **Curves layer** and set as you prefer if its not well exposed.\n* Regroup all adjustment layers inside a **group** (select them all then press CTRL +G on keyboard  for fast shortcut).\n\n&amp;#x200B;\n\n**Basically the process is done!**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Note:**\n\n1. **If you use colors of images from artists, photographers,etc. say thank them!**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nJust my 2 cents.\n\n&amp;#x200B;\n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/c6jjai/how_to_steal_color_grading_from_every_photo_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "how to \"steal\" color grading from every photo you want! /!/ hi all!\n\ndid you fall in love with some particular artist's colorgrading and you want to replicate it in your photo?\n\nthings are easy!\n\n&amp;#x200b;\n\nfollow my personal \"guide\" and you will be able to produce your art!\n\nit will be write step by step in order to be **noob-friendly!**\n\n&amp;#x200b;\n\ni use photoshop cc 2019 (latest version) but this guide works for every editing software do you use.\n\n&amp;#x200b;\n\nwhat you need:\n\n* source image (image that you want to \"color-grading copy\" )\n* destination image ( your image )\n\n&amp;#x200b;\n\n&gt;!i will now type si as source image and di as destination image!&lt;\n\n&amp;#x200b;\n\nfirst step:\n\ndownload image from your favorite artist. (i use instagram a lot then i download image from there) - google it and you find a site that download image from instagram-\n\n&amp;#x200b;\n\nsecond step (*we're in photoshop now*)\n\nopen the image you've just downloaded and open your personal image you want to edit.\n\nthey must remain in two different windows.\n\n&amp;#x200b;\n\n**now the work is gonna start:**\n\n&amp;#x200b;\n\n**si:**\n\n* click on **eyedropper tool** (press i on keyboard for shortcut) then move the mouse over the darkest area of the image. (sample size 3by3 - sample: all layers)\n* foreground color now changes and its set to this color.\n* create a new **empty layer** (shift-ctrl.-n) or go to layer-new-layer and press ok\n* press now b on keyboard to **brush** shortcut. opacity 100% flow 100% smoothing 100% standard brush is ok. click now on the image to create a circle of color.\n* click on the layer of the main image.\n* **repeat** eyedropper on the image selecting the lighten color (usually over the face if its a portrait) then click on the empty layer and create the circle of the color. note: in case of portraits, we have to pick 2 colors in order to create a good mix of skin tone.\n* click on the layer of the main image.\n* (we need to sample midtones). -----> create !!!  a copy layer of the image (ctrl + j on win) then go to select -&gt; **color range**. select: midtones. expand a little bit the range of the midtones (left and right) then click ok.\n* you now could see a selection on the image.\n* go to **filter- blur- average**\n* click on **eyedropper tool** and sample the color\n* click on the empty layer and use the brush to create the last one circle.\n* we need to create a palette of colors (explain later): click on the image then go to file- export-&gt; **save for web.**\n* a new windows is not opened.\n* change the format of the image to **gif** (top right, jpeg should be default value) and set colors to 3 (three).\n* inside the **color table** there are those 3 colors. click on the top right of this color table and click on save color table. (remember the path you save it)\n* it's time to work over di, just copy the empty layer (contains the colors circle) on the di. (ctrl c + ctrl v is the fast way)\n\n&amp;#x200b;\n\n**di:**\n\n* **layer that contains sampled colors must be at the top of the layers**\n* click on image then create a **curves layer** from \"create a new adjustment layer\" icon (the circle bot right of the screen). *remember to click on the layer, not the mask that is set as default.*\n* **properties of curves** layer is now opened (if not, go to windows-properties)\n* focus your eye on those 3 sample tools on the left. (top is for black, mid is for grey, bot is for white)\n* double right click over the **black tool** (color picker is now opened). sample the darkest color of the sample layer by left single click on it, then press ok.\n* click on \"**no**\" on the next windows (\"save the new target as default\").\n* repeat for midtones and light tones. (midtones of di -&gt; choose the nearest color to grey of your image. || white --&gt; choose color on face -if portrait-\n* create now a **gradient map** layer above curves layer. (remember to click on gradient layer and not over layer mask)\n* go to **windows-swatches**. click on top right of the swatches panel (four lines icon) and select **load swatches** and load the color table you saved previously (if you dont find it, select color table on the format file).\n* you have now those 3 colors.\n* open the properties of the **gradient map** then click over the gradient.\n* left single click on the darkest color of the right (bottom color) then left click of \"color\" dialog. color picker window is opened.  \n* right click on the darkest color of the color table on swatches and remember value of **b (brightness).** (darkest color is the 3rd) . click ok to confirm.\n* over **location** insert the value of the b you've just read.\n* repeat for the white color. (remember the b again | lighten color is the first)\n* create a new **gradient color** by left clicking everywhere over the color line.\n* do the same steps for this color. hit ok.\n* changes **blend mode** of the gradient map layer from **normal** to **soft light**.\n* create a new **vibrance layer** and increase vibrance a bit (as your taste)\n* create a new **selective color** if some colors has trouble (for example on portrait, skin tones etc.)\n* create a new **curves layer** and set as you prefer if its not well exposed.\n* regroup all adjustment layers inside a **group** (select them all then press ctrl +g on keyboard  for fast shortcut).\n\n&amp;#x200b;\n\n**basically the process is done!**\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n**note:**\n\n1. **if you use colors of images from artists, photographers,etc. say thank them!**\n\n&amp;#x200b;\n\n&amp;#x200b;\n\njust my 2 cents.\n\n&amp;#x200b;\n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 69059, "year": "2019"}, {"autor": "[deleted]", "date": "2019-07-09 11:38:24", "content": "***OFF TOPIC*** - I created an App with Daily Photo Challenges", "link": "https://www.reddit.com/r/photography/comments/cazq4t/off_topic_i_created_an_app_with_daily_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "***off topic*** - -----> i !!!  -----> created !!!  an app with daily photo challenges", "sortedWord": "None", "Identifyer": null, "identifyer": 69326, "year": "2019"}, {"autor": "themontanaguy6", "date": "2019-07-26 22:44:10", "content": "Tips for a beginner photographer /!/ I am new to photography, at least for the most part. I have taken many photos but I am still seeking tips and advice in mainly wildlife photography. The camera I use is a Sony DSC-H300, 20.1 megapixels. As far as I know, this camera is more of a point-and-shoot camera.\n\nSo basically, I am wondering; how can I get a sharper image out of a subject such as a bird or mammal? I do know that lighting is a key part in this, but any suggestions on the camera settings that are required in a sharp image would be very helpful.\n\nAny extra tips, such as a program I could use to create better quality in some pictures? I am looking for any advice I can receive. Much thanks", "link": "https://www.reddit.com/r/photography/comments/ci9oem/tips_for_a_beginner_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could use to create", "selectorShort": "create", "MarkedSent": "tips for a beginner photographer /!/ i am new to photography, at least for the most part. i have taken many photos but i am still seeking tips and advice in mainly wildlife photography. the camera i use is a sony dsc-h300, 20.1 megapixels. as far as i know, this camera is more of a point-and-shoot camera.\n\nso basically, i am wondering; how can i get a sharper image out of a subject such as a bird or mammal? i do know that lighting is a key part in this, but any suggestions on the camera settings that are required in a sharp image would be very helpful.\n\nany extra tips, such as a program -----> i !!!  -----> could !!!  -----> use !!!  -----> to !!!  -----> create !!!  better quality in some pictures? i am looking for any advice i can receive. much thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 69536, "year": "2019"}, {"autor": "Pado3317", "date": "2019-08-04 13:39:29", "content": "Creating a lightroom preset /!/ Hello, would it be possible to create a preset based on a picture just by looking at the colors/effects?\n-Tried it myself but wasn’t that accurate so i guess i need someone experienced in this.", "link": "https://www.reddit.com/r/photography/comments/clwei7/creating_a_lightroom_preset/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a lightroom preset /!/ hello, would it be possible to create a preset based on a picture just by looking at the colors/effects?\n-tried it myself but wasn’t that accurate so i guess i need someone experienced in this.", "sortedWord": "None", "Identifyer": null, "identifyer": 69629, "year": "2019"}, {"autor": "love-momo", "date": "2019-10-25 22:31:44", "content": "Your Thoughts on Constancy in Photography. /!/ I'd like to talk specifically about colors.. I've been trying to figure out what my editing style is. What I've found is that I've been wanting my photos to look like several different film stocks. I can never really say I want all my photos to look one way. \n\nA YouTuber by the name of Sean Tucker made a video about how important consistency can be in photography. **I'd like to know how you guys feel about such a thing.** \n\nMy personal conclusion is that I should try to create one look for one set of photos. Not necessarily for everything I shoot. Only problem is, my mind is always changing.\n\nLink to Sean's video:  [https://www.youtube.com/watch?v=EChE5OJIh\\_M&amp;t=1008s](https://www.youtube.com/watch?v=EChE5OJIh_M&amp;t=1008s)", "link": "https://www.reddit.com/r/photography/comments/dn4ypa/your_thoughts_on_constancy_in_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i should try to create", "selectorShort": "create", "MarkedSent": "your thoughts on constancy in photography. /!/ i'd like to talk specifically about colors.. i've been trying to figure out what my editing style is. what i've found is that i've been wanting my photos to look like several different film stocks. i can never really say i want all my photos to look one way. \n\na youtuber by the name of sean tucker made a video about how important consistency can be in photography. **i'd like to know how you guys feel about such a thing.** \n\nmy personal conclusion is that -----> i !!!  -----> should !!!  -----> try !!!  -----> to !!!  -----> create !!!  one look for one set of photos. not necessarily for everything i shoot. only problem is, my mind is always changing.\n\nlink to sean's video:  [https://www.youtube.com/watch?v=eche5ojih\\_m&amp;t=1008s](https://www.youtube.com/watch?v=eche5ojih_m&amp;t=1008s)", "sortedWord": "None", "Identifyer": null, "identifyer": 70544, "year": "2019"}, {"autor": "kagersoph", "date": "2019-12-01 18:03:46", "content": "What struggles do artists face with gaining exposure for their work? /!/  Hey artists of reddit, I have a question for you. Is there any way you could fill out my form in order for me to learn more about the problems and pain points that artists face? I am working to create a solution for a class I am in, but first I want to get first-hand responses from people in the community!\n\nHere is the form: [https://forms.gle/7xXQtbrCywCMu2ws7](https://forms.gle/7xXQtbrCywCMu2ws7)\n\nThank you so much to anyone who responds! Your input is so greatly appreciated!", "link": "https://www.reddit.com/r/photography/comments/e4kyje/what_struggles_do_artists_face_with_gaining/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am working to create", "selectorShort": "create", "MarkedSent": "what struggles do artists face with gaining exposure for their work? /!/  hey artists of reddit, i have a question for you. is there any way you could fill out my form in order for me to learn more about the problems and pain points that artists face? -----> i !!!  -----> am !!!  -----> working !!!  -----> to !!!  -----> create !!!  a solution for a class -----> i !!!  -----> am !!!  in, but first -----> i !!!  want -----> to !!!  get first-hand responses from people in the community!\n\nhere is the form: [https://forms.gle/7xxqtbrcywcmu2ws7](https://forms.gle/7xxqtbrcywcmu2ws7)\n\nthank you so much to anyone who responds! your input is so greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 70924, "year": "2019"}, {"autor": "martin_19_888", "date": "2019-11-30 23:04:30", "content": "Selling prints online? /!/ Hi all,\n\nI recently created my photography website and have slowly been building it up to look somewhat presentable and adding my work to it. I'd like to one day be able to produce and sell professional looking prints and other products but have no idea where to start, no idea if it's difficult, expensive, etc.  A lot of guides on selling prints always refer to using stock photography websites, but I'm not sure this is what I want. Does anybody else sell prints from their website? Any decent step-by-step, idiot-proof guides they know of?\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/e457m7/selling_prints_online/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "selling prints online? /!/ hi all,\n\n-----> i !!!  -----> recently !!!  -----> created !!!  my photography website and have slowly been building it up to look somewhat presentable and adding my work to it. i'd like to one day be able to produce and sell professional looking prints and other products but have no idea where to start, no idea if it's difficult, expensive, etc.  a lot of guides on selling prints always refer to using stock photography websites, but i'm not sure this is what i want. does anybody else sell prints from their website? any decent step-by-step, idiot-proof guides they know of?\n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 70990, "year": "2019"}, {"autor": "jakers036", "date": "2019-11-30 20:55:23", "content": "Which of these entry level cameras should I get as a amateur hobbyist? /!/ I'm not that much into photography, for now at least, I am even less than a noob, but I do want to create better quality photos than I can with a phone, especially portraits with background blur and nature scenes with a nice amount of detail, so I'm wondering which of these would be the best entry level one for me.\n\nIn my country I can only afford one of the following, with the default lens that they come with:\n\n1. SX430 (or 432)\n2. DSC-H300\n3. B500\n\nI know that there may be cheaper and better ones, however I don't plan on importing, dealing with post,etc., so I only have these as an option, though I suppose each of them are good enough and light years ahead of anything a phone could do.\n\nI suppose they all support connecting with a smartphone (important for me since I want to make solo photos of myself) and they each have 30, 40x zoom levels, which is pretty great, however, with the default lens that I get with them, can they each make good high quality portraits and landscapes? The SX430 for example is 50 euros cheaper than the B500 and has the same zoom level, actually even higher 42 vs 40 on the B500, so should I go for that or does the more expensive H300 or B500 have something the SX430 doesn't?\n\nI don't plan on making macro, ultrawide, fisheye and all that photos, I suppose they require additional lenses, so that's not a factor in my deciding.", "link": "https://www.reddit.com/r/photography/comments/e43b57/which_of_these_entry_level_cameras_should_i_get/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i do want to create", "selectorShort": "create", "MarkedSent": "which of these entry level cameras should i get as a amateur hobbyist? /!/ -----> i !!! 'm not that much into photography, for now at least, -----> i !!!  am even less than a noob, but -----> i !!!  -----> do !!!  -----> want !!!  -----> to !!!  -----> create !!!  better quality photos than -----> i !!!  can with a phone, especially portraits with background blur and nature scenes with a nice amount of detail, so -----> i !!! 'm wondering which of these would be the best entry level one for me.\n\nin my country i can only afford one of the following, with the default lens that they come with:\n\n1. sx430 (or 432)\n2. dsc-h300\n3. b500\n\ni know that there may be cheaper and better ones, however i don't plan on importing, dealing with post,etc., so i only have these as an option, though i suppose each of them are good enough and light years ahead of anything a phone could do.\n\ni suppose they all support connecting with a smartphone (important for me since i want to make solo photos of myself) and they each have 30, 40x zoom levels, which is pretty great, however, with the default lens that i get with them, can they each make good high quality portraits and landscapes? the sx430 for example is 50 euros cheaper than the b500 and has the same zoom level, actually even higher 42 vs 40 on the b500, so should i go for that or does the more expensive h300 or b500 have something the sx430 doesn't?\n\ni don't plan on making macro, ultrawide, fisheye and all that photos, i suppose they require additional lenses, so that's not a factor in my deciding.", "sortedWord": "None", "Identifyer": null, "identifyer": 71001, "year": "2019"}, {"autor": "d750guy", "date": "2019-12-18 03:13:25", "content": "A first attempt at product photography! Inspired by listening to jazz music, I composed this frame simply using Nikon D750, a simple photo box and off camera flash. I wanted to create a jazz romantic mood! All feedback and critics are welcome.", "link": "https://www.reddit.com/r/photography/comments/ec6tq3/a_first_attempt_at_product_photography_inspired/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "a first attempt at product photography! inspired by listening to jazz music, i composed this frame simply using nikon d750, a simple photo box and off camera flash. -----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  a jazz romantic mood! all feedback and critics are welcome.", "sortedWord": "None", "Identifyer": null, "identifyer": 71201, "year": "2019"}, {"autor": "Spatula_The_Great", "date": "2019-12-09 16:38:42", "content": "Using a NAS system to share media with clients instead google drive? /!/ Hello, \n\nSo I usually share my work with my clients through google drive, and was recently thinking of upgrading to 1tb, but after i saw the cost I started thinking if i can create a server to host and share my media.\n\nLittle bit of search and I learned about NAS systems, but after alot of search i coulndt figure out if i can use it the same way as google drive, where i can upload folders and share their links with my clients where they can download it. \n\nIt does say on Synology website that they support such a thing but they dont go into details about it. \n\nSo I want to ask you guys (especially those who have a NAS) how do you think i can do this? \n\nAnd will it be suitable for several clients (about 200 a year?) I was thinking of just uploading the media and never deleting it, giving my client the ability to download it anytime, now this would be super expensive with cloud storage, but pretty reasonable with solid storage.\n\nI hope what i said made sense and thanks alot!", "link": "https://www.reddit.com/r/photography/comments/e8cawx/using_a_nas_system_to_share_media_with_clients/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "using a nas system to share media with clients instead google drive? /!/ hello, \n\nso -----> i !!!  usually share my work with my clients through google drive, and was recently thinking of upgrading to 1tb, but after -----> i !!!  saw the cost -----> i !!!  started thinking if -----> i !!!  -----> can !!!  -----> create !!!  a server to host and share my media.\n\nlittle bit of search and i learned about nas systems, but after alot of search i coulndt figure out if i can use it the same way as google drive, where i can upload folders and share their links with my clients where they can download it. \n\nit does say on synology website that they support such a thing but they dont go into details about it. \n\nso i want to ask you guys (especially those who have a nas) how do you think i can do this? \n\nand will it be suitable for several clients (about 200 a year?) i was thinking of just uploading the media and never deleting it, giving my client the ability to download it anytime, now this would be super expensive with cloud storage, but pretty reasonable with solid storage.\n\ni hope what i said made sense and thanks alot!", "sortedWord": "None", "Identifyer": null, "identifyer": 71263, "year": "2019"}, {"autor": "TheMailerDaemonLives", "date": "2019-03-25 18:53:34", "content": "Giving credit to a photographer on a poster? /!/ I was given permission to use a photo for a poster I'm creating but the artists name is not on the photo as a signature or anything. Would I include a photo by: in the poster details? ", "link": "https://www.reddit.com/r/photography/comments/b5ep0x/giving_credit_to_a_photographer_on_a_poster/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "giving credit to a photographer on a poster? /!/ -----> i !!!  was given permission to use a photo for a poster -----> i !!! 'm -----> creating !!!  but the artists name is not on the photo as a signature or anything. would i include a photo by: in the poster details? ", "sortedWord": "None", "Identifyer": null, "identifyer": 71441, "year": "2019"}, {"autor": "philbert_", "date": "2019-04-04 00:05:05", "content": "Easy photo sync between Lightroom Classic CC and Lightroom CC /!/ I finally figured out a way to easily sync photos between Lightroom Classic CC (PC) and Lightroom CC (Mobile).  I like to have my photos available any time I have a little downtime to edit.  I don't have to be tied to my computer, I can do it on my phone (mostly) or in a pinch in a web browser.\n\n&amp;#x200B;\n\n(you need to make sure your signed in with the same log in on both apps)\n\n&amp;#x200B;\n\nHere is my import/sync process.\n\n&amp;#x200B;\n\nI typically import my photos into a folder in Lightroom Classic CC.  These folders are broken out by date.\n\nhttps://i.redd.it/ybf8yf8jy4q21.png\n\nI then create a collection from this folder. Left click on the folder name and select to create a collection.\n\nhttps://i.redd.it/9afwkq7py4q21.png\n\nThe name of the collection can be adjusted, I typically keep it the same as the folder.  You can also nest the collection under a collection set.  I typically have one collection set per year.\n\n&amp;#x200B;\n\nYou also want to make sure Sync with Lightroom CC is selected.\n\nhttps://i.redd.it/u4r9grhzy4q21.png\n\nThe collection will now appear in the collections section and the little two way arrow means that it is set to sync with Lightroom CC.  If you click on that two way arrow you can turn off sync (the arrow will not display).  That will remove photos from Lightroom CC.  An easy way to clean up if your done editing on  or running out of space on Lightroom CC.\n\nhttps://i.redd.it/ng9qqejcz4q21.png\n\nI made an edit to the highlighted photo in the collection.  This edit syncs with the folder as normal.\n\nhttps://i.redd.it/io5b5k4oz4q21.png\n\nThe collection name will then appear in Lightroom CC.  This is the web browser version but it looks pretty much the same in the mobile version.  You can see in the image above it shows how many photos are syncing below the menu bar.  All of the images will show when that is complete.  You can also see that the edit I made in Lightroom Classic CC is shown in Lightroom CC\n\nhttps://i.redd.it/x1zxydrp05q21.png\n\nIf I then Edit a photo in Lightroom CC.\n\nhttps://i.redd.it/krcyegal15q21.png\n\nAnd go back to Lightroom Classic CC.  After it has finished syncing the edit shows up.  \n\nhttps://i.redd.it/6slbmh9o15q21.png\n\n&amp;#x200B;\n\nThat's it.   I'm sure this won't be for everyone but it's super simple and works great for me. ", "link": "https://www.reddit.com/r/photography/comments/b95p40/easy_photo_sync_between_lightroom_classic_cc_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i then create", "selectorShort": "create", "MarkedSent": "easy photo sync between lightroom classic cc and lightroom cc /!/ i finally figured out a way to easily sync photos between lightroom classic cc (pc) and lightroom cc (mobile).  i like to have my photos available any time i have a little downtime to edit.  i don't have to be tied to my computer, i can do it on my phone (mostly) or in a pinch in a web browser.\n\n&amp;#x200b;\n\n(you need to make sure your signed in with the same log in on both apps)\n\n&amp;#x200b;\n\nhere is my import/sync process.\n\n&amp;#x200b;\n\ni typically import my photos into a folder in lightroom classic cc.  these folders are broken out by date.\n\nhttps://i.redd.it/ybf8yf8jy4q21.png\n\n-----> i !!!  -----> then !!!  -----> create !!!  a collection from this folder. left click on the folder name and select to create a collection.\n\nhttps://i.redd.it/9afwkq7py4q21.png\n\nthe name of the collection can be adjusted, i typically keep it the same as the folder.  you can also nest the collection under a collection set.  i typically have one collection set per year.\n\n&amp;#x200b;\n\nyou also want to make sure sync with lightroom cc is selected.\n\nhttps://i.redd.it/u4r9grhzy4q21.png\n\nthe collection will now appear in the collections section and the little two way arrow means that it is set to sync with lightroom cc.  if you click on that two way arrow you can turn off sync (the arrow will not display).  that will remove photos from lightroom cc.  an easy way to clean up if your done editing on  or running out of space on lightroom cc.\n\nhttps://i.redd.it/ng9qqejcz4q21.png\n\ni made an edit to the highlighted photo in the collection.  this edit syncs with the folder as normal.\n\nhttps://i.redd.it/io5b5k4oz4q21.png\n\nthe collection name will then appear in lightroom cc.  this is the web browser version but it looks pretty much the same in the mobile version.  you can see in the image above it shows how many photos are syncing below the menu bar.  all of the images will show when that is complete.  you can also see that the edit i made in lightroom classic cc is shown in lightroom cc\n\nhttps://i.redd.it/x1zxydrp05q21.png\n\nif i then edit a photo in lightroom cc.\n\nhttps://i.redd.it/krcyegal15q21.png\n\nand go back to lightroom classic cc.  after it has finished syncing the edit shows up.  \n\nhttps://i.redd.it/6slbmh9o15q21.png\n\n&amp;#x200b;\n\nthat's it.   i'm sure this won't be for everyone but it's super simple and works great for me. ", "sortedWord": "None", "Identifyer": null, "identifyer": 71768, "year": "2019"}, {"autor": "musictomyomelette", "date": "2019-02-09 18:49:35", "content": "Question regarding migrating catalog to new NAS drive? /!/ Hello all,\n\nI will be moving to a new city soon and once I'm all set up, I'd like to upgrade my NAS set up. When I create a new drive, I also want to reorganize my photo library files and start a new catalog with better organization. \n\nIn an ideal world what I would like to happen:\nSet up new NAS &gt; transfer files from old to new in organized way &gt; import from new NAS into new catalog.\n\nWhat really happens when I start a new catalog? \n\nDo all of my previous edits also come in the new catalog?\n\nLastly, is there a better way to go about this? Essentially I have wanted to upgrade my NAS set up and reorganize everything for efficiency.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/aov8kb/question_regarding_migrating_catalog_to_new_nas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "question regarding migrating catalog to new nas drive? /!/ hello all,\n\ni will be moving to a new city soon and once i'm all set up, i'd like to upgrade my nas set up. when -----> i !!!  -----> create !!!  a new drive, -----> i !!!  also want to reorganize my photo library files and start a new catalog with better organization. \n\nin an ideal world what i would like to happen:\nset up new nas &gt; transfer files from old to new in organized way &gt; import from new nas into new catalog.\n\nwhat really happens when i start a new catalog? \n\ndo all of my previous edits also come in the new catalog?\n\nlastly, is there a better way to go about this? essentially i have wanted to upgrade my nas set up and reorganize everything for efficiency.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 72106, "year": "2019"}, {"autor": "p511", "date": "2019-02-17 18:26:05", "content": "I created an app that lets you save any photo you find on any app or website. /!/ I made this app called Figgle and I figured you photography lovers would like it. Technically the app is made for saving any content on your phone to it, not just pictures. However, one useful way to use to would be to save all your photos to it whether they're from your photo library, google photos, imgur, some website, etc. Then view them later in one place instead of having to switch between apps\n\nApp Store Link - [https://itunes.apple.com/us/app/figgle/id1449424159?ls=1&amp;mt=8](https://itunes.apple.com/us/app/figgle/id1449424159?ls=1&amp;mt=8)", "link": "https://www.reddit.com/r/photography/comments/arnbvg/i_created_an_app_that_lets_you_save_any_photo_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  an app that lets you save any photo you find on any app or website. /!/ i made this app called figgle and i figured you photography lovers would like it. technically the app is made for saving any content on your phone to it, not just pictures. however, one useful way to use to would be to save all your photos to it whether they're from your photo library, google photos, imgur, some website, etc. then view them later in one place instead of having to switch between apps\n\napp store link - [https://itunes.apple.com/us/app/figgle/id1449424159?ls=1&amp;mt=8](https://itunes.apple.com/us/app/figgle/id1449424159?ls=1&amp;mt=8)", "sortedWord": "None", "Identifyer": null, "identifyer": 72334, "year": "2019"}, {"autor": "Cowboy7220", "date": "2019-03-02 02:55:06", "content": "Photography help /!/ Hey, I’m needing to create a portfolio of some of my work for my university. They guidelines seem to be so vague. Is a portfolio more like a photo book or a folder? Seems like what I have found online is 20 pages long?? I’m really confused so any clarification would be great. ", "link": "https://www.reddit.com/r/photography/comments/awd10t/photography_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m needing to create", "selectorShort": "create", "MarkedSent": "photography help /!/ hey, -----> i !!! ’m -----> needing !!!  -----> to !!!  -----> create !!!  a portfolio of some of my work for my university. they guidelines seem to be so vague. is a portfolio more like a photo book or a folder? seems like what i have found online is 20 pages long?? i’m really confused so any clarification would be great. ", "sortedWord": "None", "Identifyer": null, "identifyer": 72672, "year": "2019"}, {"autor": "Farid_Tech", "date": "2019-01-11 21:17:28", "content": "Create Neon Effect for your images in Photoshop using Lighting Effect filter", "link": "https://www.reddit.com/r/photography/comments/af01gb/create_neon_effect_for_your_images_in_photoshop/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  neon effect for your images in photoshop using lighting effect filter", "sortedWord": "None", "Identifyer": null, "identifyer": 73198, "year": "2019"}, {"autor": "ChicagoHomlessBum", "date": "2019-04-30 20:54:49", "content": "Newbie here, need some beginner help please! /!/ Hello,\n\nI am creating a bracelet brand and selling these through an online shop. Product images are a HUGE factor in getting sales in ecommerce.\n\nAnyways, I want to create an active instagram, facebook page, and of course need product images on my website. I've looked into renting a nice camera but discovered it can be pricey plus I need some time to hone my skills. Therefore, I think my best option is to buy my own camera and start practicing.\n\nMy questions are:\n\n1. Will I be able to create magazine quality photos with a camera like this? https://www.amazon.com/Canon-18-55mm-75-300mm-Filters-Professional/dp/B079GDB7C7/ref=mp_s_a_1_3?crid=1E4DRT82A9OS5&amp;keywords=dslr+camera&amp;qid=1556657464&amp;s=gateway&amp;sprefix=dslr+ca&amp;sr=8-3\n\n2. How realistic is it for me to understand the basics enough to take some really decent photos of my product in a few weeks? (Practicing daily)\n\n3. Do you have any software recommendations that will help my photos \"pop\"? Or any good resources for a beginner?\n\n\nThank you!", "link": "https://www.reddit.com/r/photography/comments/bj8hyq/newbie_here_need_some_beginner_help_please/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "newbie here, need some beginner help please! /!/ hello,\n\n-----> i !!!  -----> am !!!  -----> creating !!!  a bracelet brand and selling these through an online shop. product images are a huge factor in getting sales in ecommerce.\n\nanyways, i want to create an active instagram, facebook page, and of course need product images on my website. i've looked into renting a nice camera but discovered it can be pricey plus i need some time to hone my skills. therefore, i think my best option is to buy my own camera and start practicing.\n\nmy questions are:\n\n1. will i be able to create magazine quality photos with a camera like this? https://www.amazon.com/canon-18-55mm-75-300mm-filters-professional/dp/b079gdb7c7/ref=mp_s_a_1_3?crid=1e4drt82a9os5&amp;keywords=dslr+camera&amp;qid=1556657464&amp;s=gateway&amp;sprefix=dslr+ca&amp;sr=8-3\n\n2. how realistic is it for me to understand the basics enough to take some really decent photos of my product in a few weeks? (practicing daily)\n\n3. do you have any software recommendations that will help my photos \"pop\"? or any good resources for a beginner?\n\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 73950, "year": "2019"}, {"autor": "Rasheediscool", "date": "2019-04-30 14:23:00", "content": "Creating a resume for a photography related job with no formal photography experience /!/ I live in NY so I have all the big magazines here in Manhattan. I graduated college last year and realized that I don't want to work in the IT field anymore.\n\nI've applied to NY Times, Condé Nast, New York Post, Hypebeast, and a few other jobs, but I didn't get any calls back.\n\nI honestly don't know what to put on my resume because I don't have any photography job experience, everything I've done for the past 3-4 years has been freelance.\n\nWhat are some key things to put in a resume for photography when you don't have the job experience?\n\nAny advice will be helpful, thanks in advanced.", "link": "https://www.reddit.com/r/photography/comments/bj3w4w/creating_a_resume_for_a_photography_related_job/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a resume for a photography related job with no formal photography experience /!/ i live in ny so i have all the big magazines here in manhattan. i graduated college last year and realized that i don't want to work in the it field anymore.\n\ni've applied to ny times, condé nast, new york post, hypebeast, and a few other jobs, but i didn't get any calls back.\n\ni honestly don't know what to put on my resume because i don't have any photography job experience, everything i've done for the past 3-4 years has been freelance.\n\nwhat are some key things to put in a resume for photography when you don't have the job experience?\n\nany advice will be helpful, thanks in advanced.", "sortedWord": "None", "Identifyer": null, "identifyer": 73970, "year": "2019"}, {"autor": "TD_hoover", "date": "2019-05-04 18:17:25", "content": "Youtube channel /!/ hey i have just created a car channel on YouTube , i'll be posting content such as footage from events, new and rare super cars , car shows and just car related content in  general. I'm creating this channel to express my passion for cars and share it with other like minded people , any support would mean a lot to me and show it's worth doing :)", "link": "https://www.reddit.com/r/photography/comments/bko1e5/youtube_channel/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have just created", "selectorShort": "create", "MarkedSent": "youtube channel /!/ hey -----> i !!!  -----> have !!!  -----> just !!!  -----> created !!!  a car channel on youtube , -----> i !!! 'll be posting content such as footage from events, new and rare super cars , car shows and -----> just !!!  car related content in  general. i'm creating this channel to express my passion for cars and share it with other like minded people , any support would mean a lot to me and show it's worth doing :)", "sortedWord": "None", "Identifyer": null, "identifyer": 74022, "year": "2019"}, {"autor": "Aetherialistic", "date": "2019-06-10 00:07:39", "content": "Not sure if I should create a separate Instagram for my photography or not /!/ Hi everyone,\n\nI'm starting to get a bit more serious about photography (Still just a hobby tho, not professional) and bought the Nikon D750 + 24-120mm lens and the Nikon 200-500 mm f/5.6E ED VR last week.\n\nAt the moment I have only 1 Instagram account, which is both my personal (Though I don't post much personal stuff really) and my artist page. (I'm a music producer)\n\nNow, on one hand, I want to create a separate Instagram just for photography stuff, because it will look much nicer and more organized. On the other hand, keeping everything on 1 page will (I assume) make my main Instagram grow faster/bigger, rather than spreading followers over 2 pages.\n\nWhat would you guys do in this case?  \nPerhaps another option would be to create a separate page, but also post one or two really good shots to my personal/artist page every now and then.\n\n&amp;#x200B;\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/byr0vo/not_sure_if_i_should_create_a_separate_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": "not sure if -----> i !!!  -----> should !!!  -----> create !!!  a separate instagram for my photography or not /!/ hi everyone,\n\ni'm starting to get a bit more serious about photography (still just a hobby tho, not professional) and bought the nikon d750 + 24-120mm lens and the nikon 200-500 mm f/5.6e ed vr last week.\n\nat the moment i have only 1 instagram account, which is both my personal (though i don't post much personal stuff really) and my artist page. (i'm a music producer)\n\nnow, on one hand, i want to create a separate instagram just for photography stuff, because it will look much nicer and more organized. on the other hand, keeping everything on 1 page will (i assume) make my main instagram grow faster/bigger, rather than spreading followers over 2 pages.\n\nwhat would you guys do in this case?  \nperhaps another option would be to create a separate page, but also post one or two really good shots to my personal/artist page every now and then.\n\n&amp;#x200b;\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 74436, "year": "2019"}, {"autor": "strugglingactress", "date": "2019-05-17 19:47:36", "content": "Best camera for headshots and video? /!/ Hello, I want to create my own headshot/demo reel business in LA. What is the best camera for professionals headshots and amazing quality video footage to create demo reels and scenes for actors? My budget is $1200. If you could also recommend good lenses that would be great. \n\nThank you in advance", "link": "https://www.reddit.com/r/photography/comments/bpvtcc/best_camera_for_headshots_and_video/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "best camera for headshots and video? /!/ hello, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  my own headshot/demo reel business in la. what is the best camera for professionals headshots and amazing quality video footage to create demo reels and scenes for actors? my budget is $1200. if you could also recommend good lenses that would be great. \n\nthank you in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 75149, "year": "2019"}, {"autor": "hi-i-need-advice", "date": "2019-05-17 09:13:02", "content": "Learning photography, need help with this issue /!/ So I need to create a shallow depth of field. Which of the two options is correct for each statement?\n\nCamera (close to/farther from) subject\n\n(Narrow/wide) aperture\n\n(Short/long) focal length", "link": "https://www.reddit.com/r/photography/comments/bpoxmj/learning_photography_need_help_with_this_issue/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "learning photography, need help with this issue /!/ so -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a shallow depth of field. which of the two options is correct for each statement?\n\ncamera (close to/farther from) subject\n\n(narrow/wide) aperture\n\n(short/long) focal length", "sortedWord": "None", "Identifyer": null, "identifyer": 75183, "year": "2019"}, {"autor": "Alotech_", "date": "2019-07-04 19:44:49", "content": "Help Me Create the Ultimate Camera Bag /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/c96tbg/help_me_create_the_ultimate_camera_bag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "help -----> me !!!  -----> create !!!  the ultimate camera bag /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 75319, "year": "2019"}, {"autor": "DublDuck", "date": "2019-07-16 18:14:22", "content": "How do I back up folders from my phone to the cloud? /!/ I've tried a few different cloud services but can't seem to find one that lets me upload entire folders I created on my phone.\n\nCurrently travelling so can't use a pc to do it. I've been uploading my sd cards to my phone and backing up onto an external ssd drive but now need to free up room on my phone and don't want only one back up.\n\nAny ideas or recommendations?\n\nI've tried mega,Google,Amazon and dropbox so far. Having issues making a crashplan account as my country isn't on the list to finalise payment.\n\nBackblaze deletes your stuff if it's removed from your device after 30 days? Did I read that correctly? Guessing it's no good for my needs.\n\nI have about 400gb that needs to be uploaded.", "link": "https://www.reddit.com/r/photography/comments/ce0rz0/how_do_i_back_up_folders_from_my_phone_to_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "how do i back up folders from my phone to the cloud? /!/ -----> i !!! 've tried a few different cloud services but can't seem to find one that lets me upload entire folders -----> i !!!  -----> created !!!  on my phone.\n\ncurrently travelling so can't use a pc to do it. i've been uploading my sd cards to my phone and backing up onto an external ssd drive but now need to free up room on my phone and don't want only one back up.\n\nany ideas or recommendations?\n\ni've tried mega,google,amazon and dropbox so far. having issues making a crashplan account as my country isn't on the list to finalise payment.\n\nbackblaze deletes your stuff if it's removed from your device after 30 days? did i read that correctly? guessing it's no good for my needs.\n\ni have about 400gb that needs to be uploaded.", "sortedWord": "None", "Identifyer": null, "identifyer": 75625, "year": "2019"}, {"autor": "rprutkay", "date": "2019-08-03 12:38:33", "content": "Hi. I have been trying to create good photos of my home city Nové Zámky. This is my best shot, i guess. What do you say? Thanks for recommendations.", "link": "https://www.reddit.com/r/photography/comments/cliaxf/hi_i_have_been_trying_to_create_good_photos_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have been trying to create", "selectorShort": "create", "MarkedSent": "hi. -----> i !!!  -----> have !!!  -----> been !!!  -----> trying !!!  -----> to !!!  -----> create !!!  good photos of my home city nové zámky. this is my best shot, i guess. what do you say? thanks for recommendations.", "sortedWord": "None", "Identifyer": null, "identifyer": 76014, "year": "2019"}, {"autor": "tromatol", "date": "2019-08-02 15:20:42", "content": "I would really need some photos that I could use in my Portfolio. Please help me out :) /!/ Hey! I decided to create my own website, it would be my PHOTOSHOP Portfolio, but i need some photos I could edit and present my services. If you could send me some photos, i would really appreciate it. (Nature, People,Animals... it doesn't matter, I need \\~5 photos) . I am sorry, if it's the wrong sub... And thank you so much for the help!!!", "link": "https://www.reddit.com/r/photography/comments/cl5hy8/i_would_really_need_some_photos_that_i_could_use/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "i would really need some photos that i could use in my portfolio. please help me out :) /!/ hey! -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  my own website, it would be my photoshop portfolio, but -----> i !!!  need some photos -----> i !!!  could edit and present my services. if you could send me some photos, i would really appreciate it. (nature, people,animals... it doesn't matter, i need \\~5 photos) . i am sorry, if it's the wrong sub... and thank you so much for the help!!!", "sortedWord": "None", "Identifyer": null, "identifyer": 76094, "year": "2019"}, {"autor": "Jayton31", "date": "2019-09-18 04:48:22", "content": "Portfolios/ business cards /!/ Hello everyone, I’m looking to get more serious with my photography and I am at the point where I need to create a portfolio. I have a solid amount of work that I am proud of that I want to compile together, but I am unsure if the best way to do it? \n\nDoes anyone here have experience with putting together an online portfolio for their work?\n\nAlso a side note, but I’m looking into business cards as well. If anyone has experience with that I would appreciate the feedback\n\nMuch appreciated in advance!", "link": "https://www.reddit.com/r/photography/comments/d5sswn/portfolios_business_cards/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "portfolios/ business cards /!/ hello everyone, i’m looking to get more serious with my photography and -----> i !!!  am at the point where -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a portfolio. i have a solid amount of work that i am proud of that i want to compile together, but i am unsure if the best way to do it? \n\ndoes anyone here have experience with putting together an online portfolio for their work?\n\nalso a side note, but i’m looking into business cards as well. if anyone has experience with that i would appreciate the feedback\n\nmuch appreciated in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 76271, "year": "2019"}, {"autor": "crozacx", "date": "2019-09-18 04:24:37", "content": "\"Family Album\" Style Photographers? /!/ Does anyone know any photographers who has done this type of style?\n\nI'm working on a student project to create a fashion editorial and I'm inspired by the mundane daily life. I want to create a **simple love story documented from the point of view of the partner (Similar to how parents document their kids growing up)** I'm having trouble looking for inspirations because this is taking something natural and spontaneous and turning it into a solid plan. I can easily find inspiration from photojournalists who document the mundane daily life (Magnum Photographers mostly), but I have yet to come across one that fits what I'm looking for. Any ideas?\n\nOne thing that I want to emphasis is the **emotional relationship of the person behind the camera and the person in front of the camera**.\n\nI have looked at **Martin Parr**, but it lacked that relationship\n\nMaybe someone like **Norman Parkinson and his wife and muse Wenda Parkinson,** but someone newer\n\nI might just have to look through various family/couple photo albums from the point and shoot ages.", "link": "https://www.reddit.com/r/photography/comments/d5sknd/family_album_style_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "\"family album\" style photographers? /!/ does anyone know any photographers who has done this type of style?\n\ni'm working on a student project to create a fashion editorial and i'm inspired by the mundane daily life. -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a **simple love story documented from the point of view of the partner (similar -----> to !!!  how parents document their kids growing up)** i'm having trouble looking for inspirations because this is taking something natural and spontaneous and turning it into a solid plan. i can easily find inspiration from photojournalists who document the mundane daily life (magnum photographers mostly), but i have yet to come across one that fits what i'm looking for. any ideas?\n\none thing that i want to emphasis is the **emotional relationship of the person behind the camera and the person in front of the camera**.\n\ni have looked at **martin parr**, but it lacked that relationship\n\nmaybe someone like **norman parkinson and his wife and muse wenda parkinson,** but someone newer\n\ni might just have to look through various family/couple photo albums from the point and shoot ages.", "sortedWord": "None", "Identifyer": null, "identifyer": 76274, "year": "2019"}, {"autor": "alohadave", "date": "2019-10-02 16:19:07", "content": "B&amp;H will be providing instant rebates on sales tax for purchases with their in-store credit card /!/ Dear Customer,\n\nEverybody likes to save money! I am excited to share B&amp;H’s new way to save you money.\n\nLast year, the Supreme Court ruled that out-of-state retailers must collect sales tax on online sales. As a result, on October 4th, B&amp;H will start collecting tax on shipments to Massachusetts, as required by state law. We have been working hard to develop a solution to eliminate the impact of this ruling on our customers.\n\nOur solution is named Payboo! When you use the new B&amp;H Payboo Credit Card*, you can save the equivalent of the tax — you pay the tax, and we pay you back instantly! Make any purchase at B&amp;H with Payboo, and you will receive an instant reward equal to the sales tax you paid. And at B&amp;H, instant means instant — no expiring points, credits, or coupons to worry about. It’s that simple. (B&amp;H collects and remits state sales tax in accordance with state laws, so all required tax is collected and paid, and B&amp;H issues the instant savings credit to you.)\n\nPayboo is an exciting store credit card with, we believe, the most valuable benefit in the industry — the instant credit equal to the sales tax. As long as you pay your bill on time, you will not incur any interest or other costs. I invite you to apply today at www.BandH.com/payboo.\n\nI know you have many choices where to buy creative tech gear, and I truly appreciate your business. With Payboo, I believe B&amp;H will become an even clearer choice for all your technology needs.\n\nI look forward to a continued great business relationship. Please remember, at B&amp;H the customer always comes first. That’s why we’ve created Payboo to eliminate the impact of sales tax for you.\n\nPlease visit us today and start saving!\n\nThank you,\nMenashe Horowitz\nCEO", "link": "https://www.reddit.com/r/photography/comments/dcch5y/bh_will_be_providing_instant_rebates_on_sales_tax/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we’ve created", "selectorShort": "create", "MarkedSent": "b&amp;h will be providing instant rebates on sales tax for purchases with their in-store credit card /!/ dear customer,\n\neverybody likes to save money! i am excited to share b&amp;h’s new way to save you money.\n\nlast year, the supreme court ruled that out-of-state retailers must collect sales tax on online sales. as a result, on october 4th, b&amp;h will start collecting tax on shipments to massachusetts, as required by state law. we have been working hard to develop a solution to eliminate the impact of this ruling on our customers.\n\nour solution is named payboo! when you use the new b&amp;h payboo credit card*, you can save the equivalent of the tax — you pay the tax, and we pay you back instantly! make any purchase at b&amp;h with payboo, and you will receive an instant reward equal to the sales tax you paid. and at b&amp;h, instant means instant — no expiring points, credits, or coupons to worry about. it’s that simple. (b&amp;h collects and remits state sales tax in accordance with state laws, so all required tax is collected and paid, and b&amp;h issues the instant savings credit to you.)\n\npayboo is an exciting store credit card with, we believe, the most valuable benefit in the industry — the instant credit equal to the sales tax. as long as you pay your bill on time, you will not incur any interest or other costs. i invite you to apply today at www.bandh.com/payboo.\n\ni know you have many choices where to buy creative tech gear, and i truly appreciate your business. with payboo, i believe b&amp;h will become an even clearer choice for all your technology needs.\n\ni look forward to a continued great business relationship. please remember, at b&amp;h the customer always comes first. that’s why -----> we !!! ’ve -----> created !!!  payboo to eliminate the impact of sales tax for you.\n\nplease visit us today and start saving!\n\nthank you,\nmenashe horowitz\nceo", "sortedWord": "None", "Identifyer": null, "identifyer": 76548, "year": "2019"}, {"autor": "MrDrPhysicist", "date": "2019-08-12 23:43:48", "content": "I want to create a photobook for my girlfriend, but it will mostly be NSFW stuff. Is there any anonymous printing center online I can use? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/cpkotr/i_want_to_create_a_photobook_for_my_girlfriend/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a photobook for my girlfriend, but it will mostly be nsfw stuff. is there any anonymous printing center online i can use? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 76888, "year": "2019"}, {"autor": "WomanNotAGirl", "date": "2019-10-10 04:44:43", "content": "I see many photos like this and I would love to create similar effect with my work. Can someone explain to me how to attain such look and feel in editing such as colors, contrast and the overall effect? Or, is there a name to such technique so I can check out some online tutorials? /!/ I see so many high contrast photos that has this type of look&amp;feel and I don’t know how to get this effect. \n\n[here](https://imgur.com/gallery/Jyv3Mqs)\n\n[here](https://www.instagram.com/p/BvBzLpdgbtT/?igshid=hujdrhtcaef4)\n\nWhat are your opinions on this technique? I generally do not like high contrast photos but I find myself drawn to these types of photos over and over again and would love to create some myself. Except, I don’t know how.", "link": "https://www.reddit.com/r/photography/comments/dfszkr/i_see_many_photos_like_this_and_i_would_love_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would love to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  see many photos like this and -----> i !!!  -----> would !!!  -----> love !!!  -----> to !!!  -----> create !!!  similar effect with my work. can someone explain to me how to attain such look and feel in editing such as colors, contrast and the overall effect? or, is there a name to such technique so i can check out some online tutorials? /!/ i see so many high contrast photos that has this type of look&amp;feel and i don’t know how to get this effect. \n\n[here](https://imgur.com/gallery/jyv3mqs)\n\n[here](https://www.instagram.com/p/bvbzlpdgbtt/?igshid=hujdrhtcaef4)\n\nwhat are your opinions on this technique? i generally do not like high contrast photos but i find myself drawn to these types of photos over and over again and would love to create some myself. except, i don’t know how.", "sortedWord": "None", "Identifyer": null, "identifyer": 77070, "year": "2019"}, {"autor": "WomanNotAGirl", "date": "2019-10-10 04:27:37", "content": "Question: I see many photos like this and I would love to create similar effect with my work. Can someone explain to me how to attain such look and feel in editing such as colors, contrast and the overall effect? Or, is there a name to this editing technique so I can check out some online tutorials?", "link": "https://www.reddit.com/r/photography/comments/dfsthd/question_i_see_many_photos_like_this_and_i_would/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would love to create", "selectorShort": "create", "MarkedSent": "question: -----> i !!!  see many photos like this and -----> i !!!  -----> would !!!  -----> love !!!  -----> to !!!  -----> create !!!  similar effect with my work. can someone explain to me how to attain such look and feel in editing such as colors, contrast and the overall effect? or, is there a name to this editing technique so i can check out some online tutorials?", "sortedWord": "None", "Identifyer": null, "identifyer": 77071, "year": "2019"}, {"autor": "tzippy84", "date": "2019-08-30 13:32:12", "content": "App to collect guest's photos at a wedding (Dropbox, Google Drive?) /!/ Hello!\n\nFor a wedding I'm looking for the most convenient way to have guests share their smartphone photos with the newlyweds (not during the ceremony of course..).\n\nI thought maybe create a dropbox shared folder, and then share a public link via printed QR codes on the tables. But people have to be invited to that folder to be able to edit (share photos). With the public link they can only view the folder.\n\nI thought maybe you guys have a nice straight- forward solution to this problem. I could also host something on a server with a simple upload form...", "link": "https://www.reddit.com/r/photography/comments/cxgz7u/app_to_collect_guests_photos_at_a_wedding_dropbox/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i thought maybe create", "selectorShort": "create", "MarkedSent": "app to collect guest's photos at a wedding (dropbox, google drive?) /!/ hello!\n\nfor a wedding i'm looking for the most convenient way to have guests share their smartphone photos with the newlyweds (not during the ceremony of course..).\n\n-----> i !!!  -----> thought !!!  -----> maybe !!!  -----> create !!!  a dropbox shared folder, and then share a public link via printed qr codes on the tables. but people have to be invited to that folder to be able to edit (share photos). with the public link they can only view the folder.\n\ni thought maybe you guys have a nice straight- forward solution to this problem. i could also host something on a server with a simple upload form...", "sortedWord": "None", "Identifyer": null, "identifyer": 77444, "year": "2019"}, {"autor": "JohnnyForeskin", "date": "2019-10-24 12:16:06", "content": "Silly question about my Nikon D3300 vs iPhone 11 pro /!/ I’m sure you can tell by the title that I’m no pro photographer. I create brand experiences and visual identities as my main form of work, but I mostly leave the photography to the pros. Sometimes if a lower paying client (read: friends) needs a social post I’ll take some pictures and edit them for them.\n\nI know DSLRs generally have better capabilities when it comes to depth of field and stuff, but i find even on lower ISOs my shots come out grainy on my Nikon. I’m sure it’s because I’m an amateur but the photos just don’t look as nice even after some post processing.\n\nWould it be worth investing in a lens and filter set from Moment for my iPhone 11 rather than using my D3309? Sometimes I’m required to shoot athletes and can’t get up close enough so I’d need a Tele lens for my iPhone. The current 2x on the pro is nice but not good enough to capture an up close image of an athlete on a field from the sidelines.\n\nI only have the lens my Nikon came with (18-55mm) and I’m not trying to drop thousands of dollars on a telephoto lens.", "link": "https://www.reddit.com/r/photography/comments/dmfjyf/silly_question_about_my_nikon_d3300_vs_iphone_11/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "silly question about my nikon d3300 vs iphone 11 pro /!/ i’m sure you can tell by the title that i’m no pro photographer. -----> i !!!  -----> create !!!  brand experiences and visual identities as my main form of work, but -----> i !!!  mostly leave the photography to the pros. sometimes if a lower paying client (read: friends) needs a social post i’ll take some pictures and edit them for them.\n\ni know dslrs generally have better capabilities when it comes to depth of field and stuff, but i find even on lower isos my shots come out grainy on my nikon. i’m sure it’s because i’m an amateur but the photos just don’t look as nice even after some post processing.\n\nwould it be worth investing in a lens and filter set from moment for my iphone 11 rather than using my d3309? sometimes i’m required to shoot athletes and can’t get up close enough so i’d need a tele lens for my iphone. the current 2x on the pro is nice but not good enough to capture an up close image of an athlete on a field from the sidelines.\n\ni only have the lens my nikon came with (18-55mm) and i’m not trying to drop thousands of dollars on a telephoto lens.", "sortedWord": "None", "Identifyer": null, "identifyer": 77857, "year": "2019"}, {"autor": "dandeemott", "date": "2019-11-01 23:08:35", "content": "Do I extend my services? /!/ Hello, \n\nI major in interior styling/design and do photography as a side hustle between my hospo job. When I studied I often had classmates asking me to take their assessment folios etc. \n\nFlash forward and we’ve graduated, I was approached to do some photography for one of their clients who makes pottery. When I arrived on the day I asked the stylist what she wanted me to capture and based what I shot around her answers. She said the brief was texture, native, natural ect \n\nTrying to word this in a way not attacking anybody, in my own thoughts I thought the styling initially for the pottery was a bit over the top as it involved a lot of food but also because of this tried to take photos of the pieces by themselves as I thought it would have been better, but not many as I wasn’t asked to. \n\nThe final images were sent over yesterday and upon receiving them the client isn’t happy because majority of the photos aren’t simple enough and feels aren’t highlighting his products as he wants, which I think is a fair call. I’m not sure on what’s being said but when hearing this the lead stylist is not happy and saying he should have been more clear and that he already got way more than what he asked for i.e props and things. \n\nI partly feel bad because I created the end products and I feel it’s a reflection on me, should I offer to go out of my way and take some more photos just on my own of what he wanted? Or do I leave it alone because it wasn’t my project nor my actual client?", "link": "https://www.reddit.com/r/photography/comments/dqc0sm/do_i_extend_my_services/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "do i extend my services? /!/ hello, \n\ni major in interior styling/design and do photography as a side hustle between my hospo job. when i studied i often had classmates asking me to take their assessment folios etc. \n\nflash forward and we’ve graduated, i was approached to do some photography for one of their clients who makes pottery. when i arrived on the day i asked the stylist what she wanted me to capture and based what i shot around her answers. she said the brief was texture, native, natural ect \n\ntrying to word this in a way not attacking anybody, in my own thoughts i thought the styling initially for the pottery was a bit over the top as it involved a lot of food but also because of this tried to take photos of the pieces by themselves as i thought it would have been better, but not many as i wasn’t asked to. \n\nthe final images were sent over yesterday and upon receiving them the client isn’t happy because majority of the photos aren’t simple enough and feels aren’t highlighting his products as he wants, which i think is a fair call. i’m not sure on what’s being said but when hearing this the lead stylist is not happy and saying he should have been more clear and that he already got way more than what he asked for i.e props and things. \n\n-----> i !!!  partly feel bad because -----> i !!!  -----> created !!!  the end products and -----> i !!!  feel it’s a reflection on me, should -----> i !!!  offer to go out of my way and take some more photos just on my own of what he wanted? or do i leave it alone because it wasn’t my project nor my actual client?", "sortedWord": "None", "Identifyer": null, "identifyer": 78031, "year": "2019"}, {"autor": "Multi-SELZ", "date": "2019-11-26 12:33:12", "content": "Come to our shop where we create designs for your own t-shirt.", "link": "https://www.reddit.com/r/photography/comments/e1xcae/come_to_our_shop_where_we_create_designs_for_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "come to our shop where -----> we !!!  -----> create !!!  designs for your own t-shirt.", "sortedWord": "None", "Identifyer": null, "identifyer": 78577, "year": "2019"}, {"autor": "alexs2350", "date": "2019-12-26 15:18:13", "content": "Template to help you manage your freelance work /!/ I figured I'd share this here in case it helps some other members of the community [this is not a business promotion].\n\nI created a version of this template for a friend who's a freelance photographer recently, using Notion. With the new year coming up they wanted to have a single place where they could keep track of their bookings, invoices and how much they've earned.\n\n[https://www.notion.so/Freelance-Photographer-Notion-template-4e80cc66daa345eeb6fd8f8962a4e87b](https://www.notion.so/Freelance-Photographer-Notion-template-4e80cc66daa345eeb6fd8f8962a4e87b)\n\nI'm guessing quite a lot of people here won't have heard of Notion before. The friend had been using a spreadsheet to keep track of how much they were earning from their work. Notion's a productivity tool that lets you do a lot more e.g.\n\n- Create a gallery of your best photos, for easy reference to show clients or use in your portfolio / website / adverts etc.  \n- Set reminders when the insurance for your equipment's about to expire  \n- Attach invoices to notes about a specific job\n\nThere is a bit of a learning curve when you're starting to use Notion so if you have any questions, feel free to ask 😄\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/3ebd99e6-604d-4e47-b0d4-aa3c8b7f0a43/Freelance_Photographer_Instagram_Post__Title.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=ASIAT73L2G45LRWXQHHB%2F20191226%2Fus-west-2%2Fs3%2Faws4_request&amp;X-Amz-Date=20191226T151601Z&amp;X-Amz-Expires=86400&amp;X-Amz-Security-Token=IQoJb3JpZ2luX2VjEA0aCXVzLXdlc3QtMiJGMEQCIDkIjXaNUHOKAk4lEZqq3c9Y%2BJ4djtMe%2F%2BFj%2F7I0I%2BPgAiAeX3udET4WATbyE4CwmIUGTkqaloxJFyUQjb9hdzvkzyq0Awh2EAAaDDI3NDU2NzE0OTM3MCIM3stFWmxu%2B9XyxgIsKpEDq77lsPGayln0t%2Bvc5WNYdjEZKYcqN5BwsazdorXQikRTg2zYPIIKiGn36%2Fs6o2aTrWJEryFdJzNBYYtnLQAFvjXUsdPyFSTIt1KlGjzASw5QyFTpvvNovGXqXjgrtE7V2ptLyC%2BAl2KdYjs00%2FV5F3Zifn2QbKoTP0dr2%2FRy%2Bd%2BKvmTWrzpRMxtje%2FaGVAERjYa%2F1Nn5PysIjnDLCjQOVCMI06ie3Ncd7QB3jStuzFP0Q9prxrmQRzPkJTExN%2Bb2%2BqgfseA99TesAi7LsHG738mkxlfFmKboqgwslQh0yUEBuZTNwEW6J7bDLqjek%2BBLkuO8g7CXtwaViStTHgE%2F%2FlNDRMl4WHmCKVJ%2BVXofIk5d9xh8dw7Y6Z866rXjNtEWKvZ4nQ%2F9xW8EN2BVnQWL2CMWn1XCu%2BKjnWF59s3D7LhBPw%2B2Xjf7fS9ens03h5JnduQIp48IQTIP9fahV8%2BBRQA2f%2F5770rEsSlYKzvoTYDTy7q1VFETeZck1VoI0fFezMcxkyKAoXMr9Kw5Ui8A9M8wm%2BCS8AU67AGdMJWbuuQH%2BY4WDDxhqyaoLlLRMybTMVRya%2FV89iLYXqN%2FRXqCYEPUalfen0w6ffZYzPlhLXIW5lRmTAKSIUZdZBCVV77wMlqQWi%2Bz%2FoLpvkZEP3qOqcqykt9DeS%2Bj19YZIGkW%2Fse3NS7rAB0%2FAQHJLbAkO3QIRyGPPnPZZyODXYbdt0ZdLNeZHgT7hdOHB261m28DhI9I1IjBstHEhUTPm193bY5eUlUSUJ92nFFyR0AC2Hbjri9J51y7h4twREIfkSe2oD%2FQ%2FVnnU0XGVE10OyHH5ZCJPHYLy6lhBKcV6IjffDD8t%2BF8xJQf6w%3D%3D&amp;X-Amz-Signature=1e1f299b4281ebae6514aabae3e9df3795eae0f624e904bca7cfc4c86d707bf7&amp;X-Amz-SignedHeaders=host&amp;response-content-disposition=filename%20%3D%22Freelance_Photographer_Instagram_Post__Title.png%22)\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/1d3afca7-fdfd-4d64-867e-bb072c4fe013/Freelance_Photographer_Instagram_Post__Highlights.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=ASIAT73L2G45J72A3WMH%2F20191226%2Fus-west-2%2Fs3%2Faws4_request&amp;X-Amz-Date=20191226T151703Z&amp;X-Amz-Expires=86400&amp;X-Amz-Security-Token=IQoJb3JpZ2luX2VjEA4aCXVzLXdlc3QtMiJIMEYCIQDj6xjCDfwcVzMEmIhvnOgVtgCPTILpsc4ong5C%2F%2FdW7QIhAMaDqhg%2FB%2B%2FdXwCZbxnieShDdQI5LtNNklfFpuWcu3zTKrQDCHcQABoMMjc0NTY3MTQ5MzcwIgz5a3JaK91Lz50O940qkQMAKpyhye2kQWbg1ZTU4iQfycRWv3xXuCOCVOcmm6qXPpH2UZ0BUs%2B2YOqFQfbZgJOwAtcLNiF8P83er5edaKXc2fUmTCg8BJjPcj5nALw9HVDnH8fzvTzJ5Nu8ow5D49AyywBH1SmJkWc%2FKmzzw9xx5te7MDQ22hbHUjgfWMAG%2FWX4ghRX7RxFAtTp%2Br4tHhjA6hNZCOlojae%2ByknljwXZ62qN2Uu%2F1WKMhT4oXtMUh87nfd4Akr4DCFxsW3WBqpYVjbNrAdB78jQr5xRH1bumUbD3HpSie2vgGnug7ubbykBiTmHY4pC%2F9GrW0x%2FkWG82KRcXtoBOBqAJC3eeiVFTVT9KS4NmMgGyHWnFr4Ern6JLQ0n%2BCs4RT085nxECSZpq3wRoPN1tWadYzfuMxXWFaLP1m48lUnWMWHzYqNt6qKhOlVPjgI%2FPGqtDT3uJywerJXnl%2FfWewkkC1oIpH7xpsfOEQBNUDB1gi6wKg6FEMBd5nUlUp%2F%2Bvkg7EWVHwm57NJWn2vvTGG7FVe82f72ZCSjC88pLwBTrqAYPBoRowgAhibNWHQ5AVr6339IN4hbWnXcWQVtxjLxafcA3i%2B%2FF0pdChx1ZKHXhBgJphZRzwl6ECK4srh5fp2l6kYatuJ6PihWe%2FntMXwd%2F%2Fi4VTB289KVsc7yt5N3DCA5EHFEubuCy73OQD3h%2FgeQntcz5X%2B5y0fnYAPrOx5Mn%2F6UX8MKYMtG6d9gSkh0WbRGlb39SyC49YpK8xXgfTxa7jbExU5GmNvN8oqkNcX2LaQsnIEj58Ek%2BpEQSHKFb0rHbkmFXpX1MrCFEceoRuSEjk8UjX%2BAqs4nbIU4bZefL2ouG3UHz5ZmYGkA%3D%3D&amp;X-Amz-Signature=3a994a81d407ba8d868ee8bf21d39e889dec7db6e0d9e62379e1df8acbc75c83&amp;X-Amz-SignedHeaders=host&amp;response-content-disposition=filename%20%3D%22Freelance_Photographer_Instagram_Post__Highlights.png%22)\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/8deae2b6-01f9-41ad-b42b-bbec5a3e9b78/Freelance_Photographer_Instagram_Post__Hierarchy.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=ASIAT73L2G45FDAQ7J56%2F20191226%2Fus-west-2%2Fs3%2Faws4_request&amp;X-Amz-Date=20191226T151733Z&amp;X-Amz-Expires=86400&amp;X-Amz-Security-Token=IQoJb3JpZ2luX2VjEA0aCXVzLXdlc3QtMiJIMEYCIQCNWlpS7JRncc2Uf1hWViPW%2FGgxGZV9EaUuknpF2cI9xgIhAM%2BdahUcdErzacP6yMQjDaztLftrVeB%2BsnzmDGw0bNuAKrQDCHYQABoMMjc0NTY3MTQ5MzcwIgw8anIhvUiXTPdbvy4qkQNn6PcnP0F9TAsLgtxAIyEUWflHQPTm0HmrvHTyk%2BYbfA%2BWdv1LMmYjtZufvbGsNjGG7xYg0waIzYU74kp6y14d94cHQzK0CoN5RvT2ghvVJ3QfDqefPT5HWKc%2BUhDkXizVipBtz0FYkNwEHAgwYK888JKpgSLxsRfHZSuQHPVG2IP%2FDQ%2BRN0jdZWNZYzSSGhStNU9olwC9HlXmpyvCqutxcMUl8IVYZbr%2FZXqvIp0SE%2FQoYN%2BmPuaiQRGgmhxh6p%2F8enWiRqTbZtigtGAAlS8GnkJuNe3EeMbDpV3BL4C0%2B72134JKOhjcp193aaRIcVfOIPuvkM7d600Vw6qrI2L6CDFVBQDuumhKoM0O8QJUsEZZ9LfRHq7whwQq%2FTlQFk321Ste6kICTRtHzLEuN%2B0NbDbO8OZj9idMY8ARGy6Lp6FpBvHE%2Fn4%2FMTcxKDeCWhV0Sn7SWgQENY%2BiWoUg1gsvuTdyh4xPjrK3pTBKN4ALKkXsGr1q7%2BZnHSVHYMJhSi8dFPO1A10pjqp83COvmL40gDDwzpLwBTrqAXyjpuH%2FLEdZazuObi7u31avERzAf16cBPAa0E4uwz2Ht%2BQsWJEoCO6%2BNWqNM54tkYJUxSglhZjUkE0Ex1jOzrYNpwaz4VFsnmhwWfGYxRWz%2FYD57G9dCzWP6Zafai5tQ41i6WIMsmhsAaWzE9c7QTG%2B6akNLssT94xD9qzG0QhSmlLK8zxXWPicFbxgvsKukglQMOXsTZjEXjAcC7VU48SkS3VPMrf%2Fkwtrcj7bT5eQqHJUGQrGA1BB2lSCrFgK28V%2F741FL%2FVHIMHzA%2B1xmW4PPDKupgcvfLD3VmgshOSmHgMw62wbDX5hyg%3D%3D&amp;X-Amz-Signature=ea5788fb9d70fdf2542627b3539660c2032b2bec82594511c04d06ed3dd5a573&amp;X-Amz-SignedHeaders=host&amp;response-content-disposition=filename%20%3D%22Freelance_Photographer_Instagram_Post__Hierarchy.png%22)", "link": "https://www.reddit.com/r/photography/comments/efwkff/template_to_help_you_manage_your_freelance_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "template to help you manage your freelance work /!/ i figured i'd share this here in case it helps some other members of the community [this is not a business promotion].\n\n-----> i !!!  -----> created !!!  a version of this template for a friend who's a freelance photographer recently, using notion. with the new year coming up they wanted to have a single place where they could keep track of their bookings, invoices and how much they've earned.\n\n[https://www.notion.so/freelance-photographer-notion-template-4e80cc66daa345eeb6fd8f8962a4e87b](https://www.notion.so/freelance-photographer-notion-template-4e80cc66daa345eeb6fd8f8962a4e87b)\n\ni'm guessing quite a lot of people here won't have heard of notion before. the friend had been using a spreadsheet to keep track of how much they were earning from their work. notion's a productivity tool that lets you do a lot more e.g.\n\n- create a gallery of your best photos, for easy reference to show clients or use in your portfolio / website / adverts etc.  \n- set reminders when the insurance for your equipment's about to expire  \n- attach invoices to notes about a specific job\n\nthere is a bit of a learning curve when you're starting to use notion so if you have any questions, feel free to ask 😄\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/3ebd99e6-604d-4e47-b0d4-aa3c8b7f0a43/freelance_photographer_instagram_post__title.png?x-amz-algorithm=aws4-hmac-sha256&amp;x-amz-credential=asiat73l2g45lrwxqhhb%2f20191226%2fus-west-2%2fs3%2faws4_request&amp;x-amz-date=20191226t151601z&amp;x-amz-expires=86400&amp;x-amz-security-token=iqojb3jpz2lux2vjea0acxvzlxdlc3qtmijgmeqcidkijxanuhokak4lezqq3c9y%2bj4djtme%2f%2bfj%2f7i0i%2bpgaiaex3udet4watbye4cwmiugtkqaloxjfyuqjb9hdzvkzyq0awh2eaaaddi3ndu2nze0otm3mcim3stfwmxu%2b9xyxgiskpedq77lspgayln0t%2bvc5wnydjezkycqn5bwsazdorxqikrtg2zypiikign36%2fs6o2atrwjeryfdjznbyytnlqafvjxusdpyfstit1klgjzasw5qyftpvvnovgxqxjgrte7v2ptlyc%2bal2kdyjs00%2fv5f3zifn2qbkotp0dr2%2fry%2bd%2bkvmtwrzprmxtje%2fagvaerjya%2f1nn5pysijndlcjqovcmi06ie3ncd7qb3jstuzfp0q9prxrmqrzpkjtexn%2bb2%2bqgfsea99tesai7lshg738mkxlffmkboqgwslqh0yuebuztnwew6j7bdlqjek%2bblkuo8g7cxtwavistthge%2f%2flndrml4whmckvj%2bvxofik5d9xh8dw7y6z866rxjntewkvz4nq%2f9xw8en2bvnqwl2cmwn1xcu%2bkjnwf59s3d7lhbpw%2b2xjf7fs9ens03h5jnduqip48iqtip9fahv8%2bbrqa2f%2f5770resslykzvotydty7q1vfetezck1voi0ffezmcxkykaoxmr9kw5ui8a9m8wm%2bcs8au67agdmjwbuuqh%2by4wddxhqyaolllrmybtmvrya%2fv89ilyxqn%2frxqcyepualfen0w6ffzyzplhlxiw5lrmtaksiuzdzbcvv77wmlqqwi%2bz%2folpvkzep3qoqcqykt9des%2bj19yzigkw%2fse3ns7rab0%2faqhjlbako3qirygppnpzzyodxybdt0zdlnezhgt7hdohb261m28dhi9i1ijbsthehutpm193by5eulusuj92nffyr0ac2hbjri9j51y7h4twreifkse2od%2fq%2fvnnu0xgve10oyhh5zcjphyly6lhbkcv6ijffdd8t%2bf8xjqf6w%3d%3d&amp;x-amz-signature=1e1f299b4281ebae6514aabae3e9df3795eae0f624e904bca7cfc4c86d707bf7&amp;x-amz-signedheaders=host&amp;response-content-disposition=filename%20%3d%22freelance_photographer_instagram_post__title.png%22)\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/1d3afca7-fdfd-4d64-867e-bb072c4fe013/freelance_photographer_instagram_post__highlights.png?x-amz-algorithm=aws4-hmac-sha256&amp;x-amz-credential=asiat73l2g45j72a3wmh%2f20191226%2fus-west-2%2fs3%2faws4_request&amp;x-amz-date=20191226t151703z&amp;x-amz-expires=86400&amp;x-amz-security-token=iqojb3jpz2lux2vjea4acxvzlxdlc3qtmijimeyciqdj6xjcdfwcvzmemihvnogvtgcptilpsc4ong5c%2f%2fdw7qihamadqhg%2fb%2b%2fdxwczbxnieshddqi5ltnnklffpuwcu3ztkrqdchcqabommjc0nty3mtq5mzcwigz5a3jak91lz50o940qkqmakpyhye2kqwbg1ztu4iqfycrwv3xxucocvocmm6qxpph2uz0bus%2b2yoqfqfbzgjowatclnif8p83er5edakxc2fumtcg8bjjpcj5nalw9hvdnh8fzvtzj5nu8ow5d49ayywbh1smjkwc%2fkmzzw9xx5te7mdq22hbhujgfwmag%2fwx4ghrx7rxfattp%2br4thhja6hnzcolojae%2byknljwxz62qn2uu%2f1wkmht4oxtmuh87nfd4akr4dcfxsw3wbqpyvjbnradb78jqr5xrh1bumubd3hpsie2vggnug7ubbykbitmhy4pc%2f9grw0x%2fkwg82krcxtobobqajc3eeivftvt9ks4nmmggyhwnfr4ern6jlq0n%2bcs4rt085nxecszpq3wropn1twadyzfumxxwfalp1m48lunwmwhzyqnt6qkholvpjgi%2fpgqtdt3ujywerjxnl%2ffwewkkc1oiph7xpsfoeqbnudb1gi6wkg6fembd5nulup%2f%2bvkg7ewvhwm57njwn2vvtgg7fve82f72zcsjc88plwbtrqaypborowgahibnwhq5avr6339in4hbwnxcwqvtxjlxafca3i%2b%2ff0pdchx1zkhxhbgjphzrzwl6eck4srh5fp2l6kyatuj6pihwe%2fntmxwd%2f%2fi4vtb289kvsc7yt5n3dca5ehfeubucy73oqd3h%2fgeqntcz5x%2b5y0fnyaprox5mn%2f6ux8mkymtg6d9gskh0wbrglb39syc49ypk8xxgftxa7jbexu5gmnvn8oqkncx2laqsniej58ek%2bpeqshkfb0rhbkmfxpx1mrcfeceorusejk8ujx%2baqs4nbiu4bzefl2oug3uhz5zmygka%3d%3d&amp;x-amz-signature=3a994a81d407ba8d868ee8bf21d39e889dec7db6e0d9e62379e1df8acbc75c83&amp;x-amz-signedheaders=host&amp;response-content-disposition=filename%20%3d%22freelance_photographer_instagram_post__highlights.png%22)\n\n![title,50%](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/8deae2b6-01f9-41ad-b42b-bbec5a3e9b78/freelance_photographer_instagram_post__hierarchy.png?x-amz-algorithm=aws4-hmac-sha256&amp;x-amz-credential=asiat73l2g45fdaq7j56%2f20191226%2fus-west-2%2fs3%2faws4_request&amp;x-amz-date=20191226t151733z&amp;x-amz-expires=86400&amp;x-amz-security-token=iqojb3jpz2lux2vjea0acxvzlxdlc3qtmijimeyciqcnwlps7jrncc2uf1hwvipw%2fggxgzv9eauuknpf2ci9xgiham%2bdahucderzacp6ymqjdaztlftrveb%2bsnzmdgw0bnuakrqdchyqabommjc0nty3mtq5mzcwigw8anihvuixtpdbvy4qkqnn6pcnp0f9taslgtxaiyeuwflhqptm0hmrvhtyk%2bybfa%2bwdv1lmmyjtzufvbgsnjgg7xyg0waizyu74kp6y14d94chqzk0con5rvt2ghvvj3qfdqefpt5hwkc%2buhdkxizvipbtz0fyknwehagwyk888jkpgslxsrfhzsuqhpvg2ip%2fdq%2brn0jdzwnzyzssghstnu9olwc9hlxmpyvcqutxcmul8ivyzbr%2fzxqvip0se%2fqoyn%2bmpuaiqrggmhxh6p%2f8enwirqtbztigtgaals8gnkjune3eembdpv3bl4c0%2b72134jkohjcp193aaricvfoipuvkm7d600vw6qri2l6cdfvbqduumhkom0o8qjusezz9lfrhq7whwqq%2ftlqfk321ste6kictrthzleun%2b0nbdbo8ozj9idmy8argy6lp6fpbvhe%2fn4%2fmtcxkdecwhv0sn7swgqeny%2biwoug1gsvutdyh4xpjrk3ptbkn4alkkxsgr1q7%2bznhsvhymjhsi8dfpo1a10pjqp83covml40gddwzplwbtrqaxyjpuh%2fledzazuobi7u31averzaf16cbpaa0e4uwz2ht%2bqswjeoco6%2bnwqnm54tkyjuxsglhzjuke0ex1jozrynpwaz4vfsnmhwwfgyxrwz%2fyd57g9dczwp6zafai5tq41i6wimsmhsaawze9c7qtg%2b6aknlsst94xd9qzg0qhsmllk8zxxwpicfbxgvskukglqmoxstzjexjacc7vu48sks3vpmrf%2fkwtrcj7bt5eqqhjugqrga1bb2lscrfgk28v%2f741fl%2fvhimhza%2b1xmw4ppdkupgcvfld3vmgshosmhgmw62wbdx5hyg%3d%3d&amp;x-amz-signature=ea5788fb9d70fdf2542627b3539660c2032b2bec82594511c04d06ed3dd5a573&amp;x-amz-signedheaders=host&amp;response-content-disposition=filename%20%3d%22freelance_photographer_instagram_post__hierarchy.png%22)", "sortedWord": "None", "Identifyer": null, "identifyer": 78808, "year": "2019"}, {"autor": "PhoenixCycle", "date": "2019-12-17 15:23:50", "content": "Started shooting on Oct 23, 2019. Numerous people asking to buy my photos daily. Shot with Sony A7R IV, 16mm, f10, 1/13 sec, ISO 64. /!/ Hello all. I retired from the Marine Corps at 38 years old after 20 years of service. One day in autumn I decided to take a 7000 mile road trip across the United States. I bought a Canon M50 and took photos. When I got back, I sold my Harley and bought a Sony A7R IV with a couple nice lenses. I now live in my Jeep and travel while taking photographs. I am currently in Florida and plan on going back out west to Oregon, Washington, Alaska. My plan is to travel all over the world for the rest of my life.\n\nI am starting to get many people asking to buy my photos. I am so busy traveling, shooting, editing that I haven't had time to really research best practices. I never got into this to make money, its a long story. My pension covers my basic needs and allows me to break away from the 9-5 life. I am gaining hundred of followers on Instagram daily and its hard to keep up with the comments. I also created a 500px account today. Anyone have any advice? I have only been shooting for less than 2 months so I know I have a lot to improve on. I have also been shooting in manual mode early on so I was messing up on my exposures. I am self taught but starting to read books, listen to Podcast and Youtube.\n\nThis photo was taken at the Everglades National Park, off the road in an unassuming location, a ditch. There is concrete all around with road defelctors. It was my first day at the Glades and was conflicted where to shoot. I remembered this spot I was earlier in that day and decided to give it a shot. It was 30 mins from sundown and I was racing to the location and could see this amazing clouds start to form. Copyright information in the meta file. Insta @ Jonathanbuyno", "link": "https://www.reddit.com/r/photography/comments/ebx5hp/started_shooting_on_oct_23_2019_numerous_people/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also created", "selectorShort": "create", "MarkedSent": "started shooting on oct 23, 2019. numerous people asking to buy my photos daily. shot with sony a7r iv, 16mm, f10, 1/13 sec, iso 64. /!/ hello all. i retired from the marine corps at 38 years old after 20 years of service. one day in autumn i decided to take a 7000 mile road trip across the united states. i bought a canon m50 and took photos. when i got back, i sold my harley and bought a sony a7r iv with a couple nice lenses. i now live in my jeep and travel while taking photographs. i am currently in florida and plan on going back out west to oregon, washington, alaska. my plan is to travel all over the world for the rest of my life.\n\ni am starting to get many people asking to buy my photos. i am so busy traveling, shooting, editing that i haven't had time to really research best practices. i never got into this to make money, its a long story. my pension covers my basic needs and allows me to break away from the 9-5 life. i am gaining hundred of followers on instagram daily and its hard to keep up with the comments. -----> i !!!  -----> also !!!  -----> created !!!  a 500px account today. anyone have any advice? i have only been shooting for less than 2 months so i know i have a lot to improve on. i have also been shooting in manual mode early on so i was messing up on my exposures. i am self taught but starting to read books, listen to podcast and youtube.\n\nthis photo was taken at the everglades national park, off the road in an unassuming location, a ditch. there is concrete all around with road defelctors. it was my first day at the glades and was conflicted where to shoot. i remembered this spot i was earlier in that day and decided to give it a shot. it was 30 mins from sundown and i was racing to the location and could see this amazing clouds start to form. copyright information in the meta file. insta @ jonathanbuyno", "sortedWord": "None", "Identifyer": null, "identifyer": 79049, "year": "2019"}, {"autor": "Numilo", "date": "2019-04-10 02:25:38", "content": "Hi ! I have create a briefcase espescialy for photography ! What do you think about it ?", "link": "https://www.reddit.com/r/photography/comments/bbgqnx/hi_i_have_create_a_briefcase_espescialy_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have create", "selectorShort": "create", "MarkedSent": "hi ! -----> i !!!  -----> have !!!  -----> create !!!  a briefcase espescialy for photography ! what do you think about it ?", "sortedWord": "None", "Identifyer": null, "identifyer": 79351, "year": "2019"}, {"autor": "SmackedRS", "date": "2019-04-11 15:42:57", "content": "How do I create a photo like this?", "link": "https://www.reddit.com/r/photography/comments/bc1duq/how_do_i_create_a_photo_like_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  a photo like this?", "sortedWord": "None", "Identifyer": null, "identifyer": 79741, "year": "2019"}, {"autor": "9uhbuh9uh", "date": "2019-04-11 02:52:09", "content": "Creating a new portfolio /!/ I’m a portrait photographer.\n\nI haven’t updated my portfolio in a really long time, to the point where I feel like I need to start fresh to fit my new style. With the advancements in technology since I began photography, does anyone have any useful tips on what it should contain or what would be a good platform for one, if any?\n\nThank you!", "link": "https://www.reddit.com/r/photography/comments/bbv0yv/creating_a_new_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a new portfolio /!/ i’m a portrait photographer.\n\ni haven’t updated my portfolio in a really long time, to the point where i feel like i need to start fresh to fit my new style. with the advancements in technology since i began photography, does anyone have any useful tips on what it should contain or what would be a good platform for one, if any?\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 79773, "year": "2019"}, {"autor": "TheMinimalistComics", "date": "2019-03-18 23:26:08", "content": "Setting up small studio for product photography /!/ Hey guys,  \nI am a professional graphic designer. Recently I started doing some photography and I started out a new project. Right now, I need to create a small studio for product photography - isolated type of photo and conceptual compositions. \n\nI want to do it affordable, but right. (let say around 1500 euro for lights) I need a help with lighting, because I never done this before, and I dont know which lights to choose. I understand that constant light is the \"cheap\" option. It may do the job, but he quality is just not there. Do you think that is right?  \n\n\nIf so, I am looking for the set of \"flash\" lights. Shall I do the 3 point light setup? Is that good enough for product photos? In my country, it is easiest to get FOMEI brand products - are they good? Shall I get the pricy softbox, or make them by myself?  \n\n\nSorry guys for asking so dumb - I really dont know much about studio setup. I already gone some articles and videos, but they werent any helpful.   \n\n\nThank you, and wish you a good start of the week. ", "link": "https://www.reddit.com/r/photography/comments/b2pq2m/setting_up_small_studio_for_product_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "setting up small studio for product photography /!/ hey guys,  \ni am a professional graphic designer. recently i started doing some photography and i started out a new project. right now, -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a small studio for product photography - isolated type of photo and conceptual compositions. \n\ni want to do it affordable, but right. (let say around 1500 euro for lights) i need a help with lighting, because i never done this before, and i dont know which lights to choose. i understand that constant light is the \"cheap\" option. it may do the job, but he quality is just not there. do you think that is right?  \n\n\nif so, i am looking for the set of \"flash\" lights. shall i do the 3 point light setup? is that good enough for product photos? in my country, it is easiest to get fomei brand products - are they good? shall i get the pricy softbox, or make them by myself?  \n\n\nsorry guys for asking so dumb - i really dont know much about studio setup. i already gone some articles and videos, but they werent any helpful.   \n\n\nthank you, and wish you a good start of the week. ", "sortedWord": "None", "Identifyer": null, "identifyer": 80322, "year": "2019"}, {"autor": "Chris_4ever", "date": "2019-03-19 19:08:18", "content": "Favourite black and white photographers? /!/ I've always gotten a lot of love for my black and white shots, so I created a separate instagram for them and am looking for some others who shoot primarily b/w to follow.\n\nPlease, suggest away! \n\nAlso, for my fellow b/w photographers, any good IG accounts to tag in photos to try and get some extra love?", "link": "https://www.reddit.com/r/photography/comments/b31g0x/favourite_black_and_white_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "favourite black and white photographers? /!/ -----> i !!! 've always gotten a lot of love for my black and white shots, so -----> i !!!  -----> created !!!  a separate instagram for them and am looking for some others who shoot primarily b/w to follow.\n\nplease, suggest away! \n\nalso, for my fellow b/w photographers, any good ig accounts to tag in photos to try and get some extra love?", "sortedWord": "None", "Identifyer": null, "identifyer": 80449, "year": "2019"}, {"autor": "supercamb", "date": "2019-02-10 05:54:31", "content": "Created with a 3D printer, no ink was used", "link": "https://www.reddit.com/r/photography/comments/ap1abt/created_with_a_3d_printer_no_ink_was_used/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  with a 3d printer, no ink was used", "sortedWord": "None", "Identifyer": null, "identifyer": 80782, "year": "2019"}, {"autor": "sonoranZ", "date": "2019-02-11 17:31:18", "content": "I created a DIY flash diffuser for macro photography /!/ I wasn't happy with the results from my macro ring flash, so I created a soft box style diffuser so I can use my regular flash for macro. The construction is primarily foil lined cardboard and duct tape. I used thin foam meant for protecting dishes to diffuse the light. There are 3 layers of this foam with gaps between them.\n\nIm pretty happy with the results, but I think there might be better materials out there than the foam I am using. Can anybody else suggest materials that have worked well for them to diffuse flashes?\n\nHere is the setup: https://i.imgur.com/L1kxdXV.jpg\n\nExample photo: https://i.imgur.com/rXvej0x.jpg", "link": "https://www.reddit.com/r/photography/comments/apim92/i_created_a_diy_flash_diffuser_for_macro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a diy flash diffuser for macro photography /!/ i wasn't happy with the results from my macro ring flash, so i created a soft box style diffuser so i can use my regular flash for macro. the construction is primarily foil lined cardboard and duct tape. i used thin foam meant for protecting dishes to diffuse the light. there are 3 layers of this foam with gaps between them.\n\nim pretty happy with the results, but i think there might be better materials out there than the foam i am using. can anybody else suggest materials that have worked well for them to diffuse flashes?\n\nhere is the setup: https://i.imgur.com/l1kxdxv.jpg\n\nexample photo: https://i.imgur.com/rxvej0x.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 80874, "year": "2019"}, {"autor": "abbiya", "date": "2019-02-24 15:13:41", "content": "Vincent van Gogh and At eternity's gate /!/ I watched \"At eternity' gate\" today and I can't stop thinking about what is it to be an artist. I wonder if Van Gogh had the cameras that we have now would he have painted or took photos instead. \n\nWith all this social sharing and editing software are we creating art that lasts generations like paintings? That movie is really messing up my thoughts on art especially photography.", "link": "https://www.reddit.com/r/photography/comments/au8tiw/vincent_van_gogh_and_at_eternitys_gate/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we creating", "selectorShort": "create", "MarkedSent": "vincent van gogh and at eternity's gate /!/ i watched \"at eternity' gate\" today and i can't stop thinking about what is it to be an artist. i wonder if van gogh had the cameras that we have now would he have painted or took photos instead. \n\nwith all this social sharing and editing software are -----> we !!!  -----> creating !!!  art that lasts generations like paintings? that movie is really messing up my thoughts on art especially photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 81536, "year": "2019"}, {"autor": "inb4ElonMusk", "date": "2019-03-05 02:14:20", "content": "Create a Professional Photography Studio at Home", "link": "https://www.reddit.com/r/photography/comments/axfpv1/create_a_professional_photography_studio_at_home/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  a professional photography studio at home", "sortedWord": "None", "Identifyer": null, "identifyer": 81707, "year": "2019"}, {"autor": "wheresmymotiv", "date": "2019-03-09 21:35:21", "content": "Please Help - Lightroom5.5 won't import my images. /!/ Crossposted on r/lightroom \\- got no answers there.\n\nHi  all. Now, i'm going to preface this question by saying i have seen  others mentioning it before but haven't come to a conclusion on how to  fix it. It's the old importing/no previews issue. I'm no lightroom whiz  but i'm hoping some of you are when it comes to the technicalites. I'll  include a screenshot over on IMGUR and a link exactly what it is as well  as a video.\n\nIt's happened before and then the issue just seemed to go away on its own.\n\nSpecs:  i5 8600k stock OC/GTX 1080/16gb 2400mhz - it's a good computer and  doubt it would be the problem. I've only see this happen on my SD card  which connects through a CF/SD card reader through USB 3.1\n\nI'm using Lightroom version: 5.5 \\[968504\\]\n\nAnother  thing to note is that before i went out, i imported my photos this  morning so i know it worked then. I shut down my PC, came home and tried  to import the photos from today and this happens \\[see video\\]. Any idea  why this might happen? I'd love to know since this has been an extreme  hassle for a while and extends the time i need to bring a client their  photos. Another thing is that when i double click to view the image, it  allows me to do it no problem, i've shown an example. This example is  also one that shows no preview. Maybe it lies in an update but if anyone  has any answers that may work, do let me know. thanks again\n\n[https://imgur.com/a/bzyFqqB](https://imgur.com/a/bzyFqqB)\n\nEdit: It began happening after i created a new catalog this morning. (felt that might be important)", "link": "https://www.reddit.com/r/photography/comments/az8euv/please_help_lightroom55_wont_import_my_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "please help - lightroom5.5 won't import my images. /!/ crossposted on r/lightroom \\- got no answers there.\n\nhi  all. now, i'm going to preface this question by saying i have seen  others mentioning it before but haven't come to a conclusion on how to  fix it. it's the old importing/no previews issue. i'm no lightroom whiz  but i'm hoping some of you are when it comes to the technicalites. i'll  include a screenshot over on imgur and a link exactly what it is as well  as a video.\n\nit's happened before and then the issue just seemed to go away on its own.\n\nspecs:  i5 8600k stock oc/gtx 1080/16gb 2400mhz - it's a good computer and  doubt it would be the problem. i've only see this happen on my sd card  which connects through a cf/sd card reader through usb 3.1\n\ni'm using lightroom version: 5.5 \\[968504\\]\n\nanother  thing to note is that before i went out, i imported my photos this  morning so i know it worked then. i shut down my pc, came home and tried  to import the photos from today and this happens \\[see video\\]. any idea  why this might happen? i'd love to know since this has been an extreme  hassle for a while and extends the time i need to bring a client their  photos. another thing is that when i double click to view the image, it  allows me to do it no problem, i've shown an example. this example is  also one that shows no preview. maybe it lies in an update but if anyone  has any answers that may work, do let me know. thanks again\n\n[https://imgur.com/a/bzyfqqb](https://imgur.com/a/bzyfqqb)\n\nedit: it began happening after -----> i !!!  -----> created !!!  a new catalog this morning. (felt that might be important)", "sortedWord": "None", "Identifyer": null, "identifyer": 82035, "year": "2019"}, {"autor": "apolinariosteps", "date": "2019-01-02 21:58:09", "content": "I created a bot that selects a random photo from Wikipedia and colorizes it via machine learning /!/ For all photo colorization enthusiasts, I created a bot that simply look for a random black &amp; white photo on Wikipedia, colorizes it automatically with a deep learning algorithm and posts it to this Twitter account: [https://twitter.com/wikicolorize](https://twitter.com/wikicolorize)\n\n*Processing img 9fnky99qz2821...*\n\nI think it is a nice way to observe state of the art automatic colorization with real examples extracted from a Wikipedia's vast royalty-free photo library ", "link": "https://www.reddit.com/r/photography/comments/aby9b3/i_created_a_bot_that_selects_a_random_photo_from/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a bot that selects a random photo from wikipedia and colorizes it via machine learning /!/ for all photo colorization enthusiasts, i created a bot that simply look for a random black &amp; white photo on wikipedia, colorizes it automatically with a deep learning algorithm and posts it to this twitter account: [https://twitter.com/wikicolorize](https://twitter.com/wikicolorize)\n\n*processing img 9fnky99qz2821...*\n\ni think it is a nice way to observe state of the art automatic colorization with real examples extracted from a wikipedia's vast royalty-free photo library ", "sortedWord": "None", "Identifyer": null, "identifyer": 82279, "year": "2019"}, {"autor": "TigrouMeow", "date": "2019-01-10 03:55:51", "content": "How to create/manage one's own private spots map for photography and travels? /!/ Hello everyone!\n\n&amp;#x200B;\n\nI am coming with this question because I am really interested in the answers, but also because I came with my own. I have been using Google Maps (and Google My Maps) for years, but it has too many shortcomings. I do travel a lot in Japan, there are thousands of spots I have visited and thousands more I didn't, but plan to. Those spots are very different in style, and my visits totally depend on the season. The number of spots I have is so overwhelming that I can't possibly take a few days to plan all my next trips for the year; I need a map system that gives me what I am (might) be looking for at any time.\n\n&amp;#x200B;\n\nTo help myself, I created a Map Editor system based on WordPress a few years ago, and photography friends also got interested and started using it. I was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently I decided to work on something much better and more modern that could appeal to more users. That's how Ikuzo was born. It's here: [https://ikuzo.app](https://ikuzo.app). It's totally free for now, but I will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200B;\n\nI am not coming here to find clients; I prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. Of course, I would really love to have your feedback, and how this could be even more useful to you as photographers. I would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200B;\n\nDo not hesitate to contact me here, and also, I think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200B;\n\nThanks for reading :)", "link": "https://www.reddit.com/r/photography/comments/aef6s9/how_to_createmanage_ones_own_private_spots_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "how to create/manage one's own private spots map for photography and travels? /!/ hello everyone!\n\n&amp;#x200b;\n\ni am coming with this question because i am really interested in the answers, but also because i came with my own. i have been using google maps (and google my maps) for years, but it has too many shortcomings. i do travel a lot in japan, there are thousands of spots i have visited and thousands more i didn't, but plan to. those spots are very different in style, and my visits totally depend on the season. the number of spots i have is so overwhelming that i can't possibly take a few days to plan all my next trips for the year; i need a map system that gives me what i am (might) be looking for at any time.\n\n&amp;#x200b;\n\nto help myself, -----> i !!!  -----> created !!!  a map editor system based on wordpress a few years ago, and photography friends also got interested and started using it. i was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently i decided to work on something much better and more modern that could appeal to more users. that's how ikuzo was born. it's here: [https://ikuzo.app](https://ikuzo.app). it's totally free for now, but i will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200b;\n\ni am not coming here to find clients; i prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. of course, i would really love to have your feedback, and how this could be even more useful to you as photographers. i would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200b;\n\ndo not hesitate to contact me here, and also, i think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200b;\n\nthanks for reading :)", "sortedWord": "None", "Identifyer": null, "identifyer": 82720, "year": "2019"}, {"autor": "Netork", "date": "2019-01-09 23:18:56", "content": "How can I re create this effect (before or after taking the shot)", "link": "https://www.reddit.com/r/photography/comments/aecpte/how_can_i_re_create_this_effect_before_or_after/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i re create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> re !!!  -----> create !!!  this effect (before or after taking the shot)", "sortedWord": "None", "Identifyer": null, "identifyer": 82739, "year": "2019"}, {"autor": "Drekk0", "date": "2019-01-21 02:40:25", "content": "So I created my first Day to Night timelapse - critique please /!/  \n\nHi guys I did a test last night. THe conditions where the best but its only the test\n\nConditions were, A full moon that lit up my tree's and would of washed out the stars a little + where I live I am in the red light pollution zone according to ([https://lightpollution.info](https://lightpollution.info/)) and dark site finder + some clouds later\n\nWhat I did was, was put my camera to aperture priority mode and set my interval to 30 sec. When my shutter speed got closer to my interval timer I opened my aperture up. I started at F16 and checked it every 10 mins and changed it eventually putting it to the widest aperture of f2.8\n\nI didnt do much post process, just little bit in lightroom and put it in premiere pro\n\n[https://www.youtube.com/watch?v=r9JQd1iAVwo&amp;feature=youtu.be](https://www.youtube.com/watch?v=r9JQd1iAVwo&amp;feature=youtu.be)\n\nI could probably make it look better the more time I could spend on the photos but im just testing, can anyone give me any things they can see wrong or could check?", "link": "https://www.reddit.com/r/photography/comments/ai5hzq/so_i_created_my_first_day_to_night_timelapse/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "so -----> i !!!  -----> created !!!  my first day to night timelapse - critique please /!/  \n\nhi guys i did a test last night. the conditions where the best but its only the test\n\nconditions were, a full moon that lit up my tree's and would of washed out the stars a little + where i live i am in the red light pollution zone according to ([https://lightpollution.info](https://lightpollution.info/)) and dark site finder + some clouds later\n\nwhat i did was, was put my camera to aperture priority mode and set my interval to 30 sec. when my shutter speed got closer to my interval timer i opened my aperture up. i started at f16 and checked it every 10 mins and changed it eventually putting it to the widest aperture of f2.8\n\ni didnt do much post process, just little bit in lightroom and put it in premiere pro\n\n[https://www.youtube.com/watch?v=r9jqd1iavwo&amp;feature=youtu.be](https://www.youtube.com/watch?v=r9jqd1iavwo&amp;feature=youtu.be)\n\ni could probably make it look better the more time i could spend on the photos but im just testing, can anyone give me any things they can see wrong or could check?", "sortedWord": "None", "Identifyer": null, "identifyer": 83032, "year": "2019"}, {"autor": "drawing247", "date": "2019-01-28 09:05:02", "content": "About this journey /!/  So, let us begin... \n\n I'm a 33 years old, simple person from Romania that loves to spend time in nature, to travel, go fishing, standing in the green grass with a book in the hand, falling asleep in the warm, kind, sunshine take photos of different things, macros, textures, landscapes ( I love taking pictures of roads... don't know, don't judge). I also enjoy watching YouTube videos, tinkering, taking apart everything and after rebuilding them ( not always successful but, hey, look at the bright side- I get a lot of spear parts). \n\n Note: English is not my first language so, please, be kind with my mistakes. Feel free to point my mistakes in this  matter. \n\n But enough about me for now...  \n\n   The project Shutterstockjourney.com\n\n Not long ago, in November 2018, I got in the recommended section of YouTube a video about photography, how to become a better photographer, light, about stock photos, how to get your work, your passion into the world so I said \"hey, why not\" and that's how I stumbled upon the Shutterstock.com website after a simple Google search; I clicked and I was amazed of how many awesome photos are being taken, uploaded, the quality and that was the seed that started to grow in me.  \n\n I had to be apart of this \n\n   Iniatially I created a buyer account and I couldn't find anywhere a link to how to become a member, a contributor  ( I found out this is how we are called after a few searches) and applied with 40 or so images that I considered where my best ones and I waited for them to approve/disapprove my photos. I remember that was a very exciting period,  with many thoughts whether they will like them, if I'm good enough to do this, somehow I wanted so much to be inside, to learn and why not to get something out of this.  The answer came faster then I thought and it was a success, I was finally in YEY! I started uploading photos, doing all the keywords manually (I later found the keyword suggestion tool), titles, descriptions etc.. I remember it took me 9 hours for my first 70 photos ( English was my first stone to carry in this process). I had in total around 100 photos and I had big dreams about this, I started to read about the website, if they had a forum, if I can interact with other users; some of my questions remained to this day unanswered but baby steps, right? \n\n The website shutterstockjourney.com and my first sold picture \n\n Time passed and nothing happened, I continued to take photos, to go out when I had the chance to but somehow I had a bitter taste about this dream, I couldn't find the way to interact with other contributors (not yet), and all the learning process from the pro's resumed to the YouTube creators. Then it happened!  \n\n&amp;#x200B;\n\nhttps://i.redd.it/pxwadohyo4d21.jpg\n\n My first sale on 11/30/2018 was a piece of perforated copper plated PCB board (I told you I like to tinker), my first $0.25! After that other two sales came, to numbers (7 and 9) created from Tic Tac  mints and then it stopped; nothing happened anymore ( I continued to upload),   a lot of my photos where rejected with reasons that I couldn't understand why. Anyways, today 1/27/2019, I had a idea, how would be like to create a website/blog where I can write about this journey, about my feelings, photos, moments around them, interact with people that share my story. I went online and the first word that came into my mind was : shutterstockjourney.com and surprise it was available, I payed and so it began... \n\n **Say 'hi' if you read this and let's connect and share our stories**.  \n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/aklqen/about_this_journey/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "about this journey /!/  so, let us begin... \n\n i'm a 33 years old, simple person from romania that loves to spend time in nature, to travel, go fishing, standing in the green grass with a book in the hand, falling asleep in the warm, kind, sunshine take photos of different things, macros, textures, landscapes ( i love taking pictures of roads... don't know, don't judge). i also enjoy watching youtube videos, tinkering, taking apart everything and after rebuilding them ( not always successful but, hey, look at the bright side- i get a lot of spear parts). \n\n note: english is not my first language so, please, be kind with my mistakes. feel free to point my mistakes in this  matter. \n\n but enough about me for now...  \n\n   the project shutterstockjourney.com\n\n not long ago, in november 2018, i got in the recommended section of youtube a video about photography, how to become a better photographer, light, about stock photos, how to get your work, your passion into the world so i said \"hey, why not\" and that's how i stumbled upon the shutterstock.com website after a simple google search; i clicked and i was amazed of how many awesome photos are being taken, uploaded, the quality and that was the seed that started to grow in me.  \n\n -----> i !!!  had to be apart of this \n\n   iniatially -----> i !!!  -----> created !!!  a buyer account and i couldn't find anywhere a link to how to become a member, a contributor  ( i found out this is how we are called after a few searches) and applied with 40 or so images that i considered where my best ones and i waited for them to approve/disapprove my photos. i remember that was a very exciting period,  with many thoughts whether they will like them, if i'm good enough to do this, somehow i wanted so much to be inside, to learn and why not to get something out of this.  the answer came faster then i thought and it was a success, i was finally in yey! i started uploading photos, doing all the keywords manually (i later found the keyword suggestion tool), titles, descriptions etc.. i remember it took me 9 hours for my first 70 photos ( english was my first stone to carry in this process). i had in total around 100 photos and i had big dreams about this, i started to read about the website, if they had a forum, if i can interact with other users; some of my questions remained to this day unanswered but baby steps, right? \n\n the website shutterstockjourney.com and my first sold picture \n\n time passed and nothing happened, i continued to take photos, to go out when i had the chance to but somehow i had a bitter taste about this dream, i couldn't find the way to interact with other contributors (not yet), and all the learning process from the pro's resumed to the youtube creators. then it happened!  \n\n&amp;#x200b;\n\nhttps://i.redd.it/pxwadohyo4d21.jpg\n\n my first sale on 11/30/2018 was a piece of perforated copper plated pcb board (i told you i like to tinker), my first $0.25! after that other two sales came, to numbers (7 and 9) created from tic tac  mints and then it stopped; nothing happened anymore ( i continued to upload),   a lot of my photos where rejected with reasons that i couldn't understand why. anyways, today 1/27/2019, i had a idea, how would be like to create a website/blog where i can write about this journey, about my feelings, photos, moments around them, interact with people that share my story. i went online and the first word that came into my mind was : shutterstockjourney.com and surprise it was available, i payed and so it began... \n\n **say 'hi' if you read this and let's connect and share our stories**.  \n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 83384, "year": "2019"}, {"autor": "OnePhotog", "date": "2019-01-27 07:42:16", "content": "The Grand Tour Colombia photo challenge episode discussion /!/ In this week's episode of the Grand Tour, Clarkson, Hammond, and May, were tasked to take photos of wildlife in Colombia. \n\nI wanted to create a thread for those who watched it. \n\nFor those who didn't watch it, a little TLDW. The three fully grown children had three different approaches to their photography. Each fits a stereotype. The gorilla, had one camera, and one giant lens, like a 500 mm or similar. The hamster went for the too much equipment, with multiple flashes, and a ring flash attachment and multiple lenses - all of which were held in a thinktank speed belt (that was anything but speedy. Captain slow went for a pocket camera because the sales lady told him it takes good pictures. \n\nI enjoyed the three blokes muck about their cameras, cars and car modifications. \n\nMaybe some of you enjoyed it too. ", "link": "https://www.reddit.com/r/photography/comments/aka3n5/the_grand_tour_colombia_photo_challenge_episode/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "the grand tour colombia photo challenge episode discussion /!/ in this week's episode of the grand tour, clarkson, hammond, and may, were tasked to take photos of wildlife in colombia. \n\n-----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  a thread for those who watched it. \n\nfor those who didn't watch it, a little tldw. the three fully grown children had three different approaches to their photography. each fits a stereotype. the gorilla, had one camera, and one giant lens, like a 500 mm or similar. the hamster went for the too much equipment, with multiple flashes, and a ring flash attachment and multiple lenses - all of which were held in a thinktank speed belt (that was anything but speedy. captain slow went for a pocket camera because the sales lady told him it takes good pictures. \n\ni enjoyed the three blokes muck about their cameras, cars and car modifications. \n\nmaybe some of you enjoyed it too. ", "sortedWord": "None", "Identifyer": null, "identifyer": 83469, "year": "2019"}, {"autor": "hannnahgarcia7", "date": "2019-01-23 14:04:10", "content": "Hi! New here :) I’m trying to create a website to showcase my work, and I’ve decided to go with “First name Last name Photography” but I’m starting to wonder if my name is too boring? Lol. It would be Hannah Garcia Photography. Any tips are greatly appreciated!! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/aizzza/hi_new_here_im_trying_to_create_a_website_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to create", "selectorShort": "create", "MarkedSent": "hi! new here :) -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> create !!!  a website -----> to !!!  showcase my work, and -----> i !!! ’ve decided -----> to !!!  go with “first name last name photography” but i’m starting to wonder if my name is too boring? lol. it would be hannah garcia photography. any tips are greatly appreciated!! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 83674, "year": "2019"}, {"autor": "Lazerdonkey", "date": "2019-04-23 23:20:29", "content": "I am about to lose my mind, choosing a camera that fits my needs as well as my expertise /!/ Okay.\nI want to get into photography. I know that I need a camera and a decent lens.\n\nSo what is a noob like me going to do? Hit up YouTube and Reddit and just browse for \"best beginner camera in 2019\" and stuff like that - it'll be no time until I figured out, where to start right?\n\nI've never been so freakin wrong.\n\nHere's the problem. I know that a decent lens is as important (or more) as the body itself. But most ppl are just reviewing the body, while slamming their best lenses on it and saying \"it makes great fotos\".\n\nI was really into the alpha 6400 as it brings great image quality as well as great recording capabilities. And I thought since this is the best of both worlds, I can safely go with it. My budget is around 1000€ (but preferably under that).\n\nI heard it's a great camera. But as I mentioned before, no one seems to review this camera with its kit lens.\n\nSo today I thought \"okay... I might go with one of the Canon rebel series, for around 500€ and smack an equally priced lens on it.\"\nBut as I dive deeper and deeper into all the little things I have to consider choosing a camera or lens for that matter, I found myself now completely overwhelmed and demotivated.\n\nLong story short.\nShould I buy the alpha 6400 with it's kit lens and be done with it for now OR should I go with a Canon rebel + decent glass on top.\n\nI still lean towards the 6400 since I think, I want to create some cinematic movies as well.\n\nPlease... Help me...", "link": "https://www.reddit.com/r/photography/comments/bgn7yb/i_am_about_to_lose_my_mind_choosing_a_camera_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "i am about to lose my mind, choosing a camera that fits my needs as well as my expertise /!/ okay.\ni want to get into photography. i know that i need a camera and a decent lens.\n\nso what is a noob like me going to do? hit up youtube and reddit and just browse for \"best beginner camera in 2019\" and stuff like that - it'll be no time until i figured out, where to start right?\n\ni've never been so freakin wrong.\n\nhere's the problem. i know that a decent lens is as important (or more) as the body itself. but most ppl are just reviewing the body, while slamming their best lenses on it and saying \"it makes great fotos\".\n\ni was really into the alpha 6400 as it brings great image quality as well as great recording capabilities. and i thought since this is the best of both worlds, i can safely go with it. my budget is around 1000€ (but preferably under that).\n\ni heard it's a great camera. but as i mentioned before, no one seems to review this camera with its kit lens.\n\nso today i thought \"okay... i might go with one of the canon rebel series, for around 500€ and smack an equally priced lens on it.\"\nbut as i dive deeper and deeper into all the little things i have to consider choosing a camera or lens for that matter, i found myself now completely overwhelmed and demotivated.\n\nlong story short.\nshould i buy the alpha 6400 with it's kit lens and be done with it for now or should i go with a canon rebel + decent glass on top.\n\n-----> i !!!  still lean towards the 6400 since -----> i !!!  think, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  some cinematic movies as well.\n\nplease... help me...", "sortedWord": "None", "Identifyer": null, "identifyer": 83710, "year": "2019"}, {"autor": "tom_w45", "date": "2019-04-23 09:43:49", "content": "Lens and tips for Indoor photography? ( Undergroun tube and Train stations in London ) /!/ Im creating 2 double spread photography based for my graphic design uni project.\n\nI want to take pics of the enviroment of busy train stations.\n\nBut Im a graphic designer and not a photographer, so I have no idea of equipment gear.\n\nIm assuming since Im going on daylight theres going be quite strong good lighting.\n\nI dont own a camera so Im taking one from my Uni and they will give me the Nikon D3500 with the standard lens.\n\nTL;DR: Im wondering If a wide lens would be a wise choice or what lens do you guys recommend for indoor.\n\nI was thinking on wide angle to capture everything, and If I needed crop it down, instead of being restricted.\n\nI just need some guidance.", "link": "https://www.reddit.com/r/photography/comments/bgefz1/lens_and_tips_for_indoor_photography_undergroun/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "im creating", "selectorShort": "create", "MarkedSent": "lens and tips for indoor photography? ( undergroun tube and train stations in london ) /!/ -----> i !!! -----> m !!!  -----> creating !!!  2 double spread photography based for my graphic design uni project.\n\ni want to take pics of the enviroment of busy train stations.\n\nbut im a graphic designer and not a photographer, so i have no idea of equipment gear.\n\nim assuming since im going on daylight theres going be quite strong good lighting.\n\ni dont own a camera so im taking one from my uni and they will give me the nikon d3500 with the standard lens.\n\ntl;dr: im wondering if a wide lens would be a wise choice or what lens do you guys recommend for indoor.\n\ni was thinking on wide angle to capture everything, and if i needed crop it down, instead of being restricted.\n\ni just need some guidance.", "sortedWord": "None", "Identifyer": null, "identifyer": 83774, "year": "2019"}, {"autor": "360Stories", "date": "2019-04-29 10:48:21", "content": "360 Stories is now on reddit🌎💫 to share our carefully created content with you. Now enjoy the picturesque St. Patrick’s Cathedral in New York", "link": "https://www.reddit.com/r/photography/comments/bio1w5/360_stories_is_now_on_reddit_to_share_our/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "our carefully created", "selectorShort": "create", "MarkedSent": "360 stories is now on reddit🌎💫 to share -----> our !!!  -----> carefully !!!  -----> created !!!  content with you. now enjoy the picturesque st. patrick’s cathedral in new york", "sortedWord": "None", "Identifyer": null, "identifyer": 84050, "year": "2019"}, {"autor": "Le_Stefan", "date": "2019-05-27 11:02:49", "content": "Photography Survey For School Production /!/ Hi guys, I'm doing street photography for my school media production and I just want your opinion towards my concept !\n\nSo I created a survey with relevant questions towards the topic to see how you guys view my production. Can you please do my survey? \n\nThanks and here's the link: [Survey](https://forms.office.com/Pages/ResponsePage.aspx?id=zFiu6TorLk6Ax8nE_LhQthnQhm0QyXtMnuTm0aCTglFUMEdIMVlaME9SUjM1OVU2VktNU1IzWTYxRy4u)", "link": "https://www.reddit.com/r/photography/comments/btkojh/photography_survey_for_school_production/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "photography survey for school production /!/ hi guys, i'm doing street photography for my school media production and i just want your opinion towards my concept !\n\nso -----> i !!!  -----> created !!!  a survey with relevant questions towards the topic to see how you guys view my production. can you please do my survey? \n\nthanks and here's the link: [survey](https://forms.office.com/pages/responsepage.aspx?id=zfiu6torlk6ax8ne_lhqthnqhm0qyxtmnutm0actglfumedimvlame9sujm1ovu2vktnu1izwtyxry4u)", "sortedWord": "None", "Identifyer": null, "identifyer": 84370, "year": "2019"}, {"autor": "jakester2014", "date": "2019-06-08 20:35:31", "content": "Help me Create my Dreams and Passions!? /!/ Please Dont delete this...\nHave you ever just wished you could’ve caught that one split second thing you did or have seen on camera?? Well I do all the time!! This Go-Fundme is me asking the community to help me reach my Goal of purchasing my first Piece of Photography’s Hardware.\n\nI’ve always taken my pictures with a Point to Shoot or my Camera phone... well sadly I now need to upgrade to progress further and make this hobby into a side occupation. My photos I take are not up to par simply due to the fact the imaging sensors in camera phones and point to shoot devices are not good enough at all for professional level photography... So I’m asking help from the community to help me reach my goal of just $300 for a New DSLR camera. \n\nThe Beginner Budget Camera I’ve chosen for my Goal is the Nikon D3500 and I believe that it could really kickstart my current hobby into a career.! Please help me capture Surreal Concepts and amazing memories!! Help me grow into an amazing photographer and Photo Journalist!\n\nHere is some examples of my work just alone on my Phone, they are good but not truly what they could be.\n\nhttps://imgur.com/a/fOgwEzE/\n\nIf you do want to help Please Visit my go fund me!! The camera is a budget camera and I have high aspirations!!\n\nhttps://www.gofundme.com/1ntvazplk0?utm_medium=copy_link&amp;utm_source=customer&amp;utm_campaign=p_na+share-sheet&amp;rcid=863a9f2034c84740821a073cd3926a7f", "link": "https://www.reddit.com/r/photography/comments/byc9pr/help_me_create_my_dreams_and_passions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "help -----> me !!!  -----> create !!!  my dreams and passions!? /!/ please dont delete this...\nhave you ever just wished you could’ve caught that one split second thing you did or have seen on camera?? well i do all the time!! this go-fundme is me asking the community to help me reach my goal of purchasing my first piece of photography’s hardware.\n\ni’ve always taken my pictures with a point to shoot or my camera phone... well sadly i now need to upgrade to progress further and make this hobby into a side occupation. my photos i take are not up to par simply due to the fact the imaging sensors in camera phones and point to shoot devices are not good enough at all for professional level photography... so i’m asking help from the community to help me reach my goal of just $300 for a new dslr camera. \n\nthe beginner budget camera i’ve chosen for my goal is the nikon d3500 and i believe that it could really kickstart my current hobby into a career.! please help me capture surreal concepts and amazing memories!! help me grow into an amazing photographer and photo journalist!\n\nhere is some examples of my work just alone on my phone, they are good but not truly what they could be.\n\nhttps://imgur.com/a/fogweze/\n\nif you do want to help please visit my go fund me!! the camera is a budget camera and i have high aspirations!!\n\nhttps://www.gofundme.com/1ntvazplk0?utm_medium=copy_link&amp;utm_source=customer&amp;utm_campaign=p_na+share-sheet&amp;rcid=863a9f2034c84740821a073cd3926a7f", "sortedWord": "None", "Identifyer": null, "identifyer": 84610, "year": "2019"}, {"autor": "Here2Day34", "date": "2019-06-08 08:15:52", "content": "Photo organization help /!/ Hello all,\n\nAre there any good apps to organize photos for Windows 10?\n\nI want to essentially create what sites like Getty Images have where you can search for a person, location, etc. and have all of those photos appear in my personal collection. Windows 10 sort of has that with tags but I’m wondering if there is something better. \n\nAny suggestions would be great.", "link": "https://www.reddit.com/r/photography/comments/by5sfg/photo_organization_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to essentially create", "selectorShort": "create", "MarkedSent": "photo organization help /!/ hello all,\n\nare there any good apps -----> to !!!  organize photos for windows 10?\n\n-----> i !!!  -----> want !!!  -----> to !!!  -----> essentially !!!  -----> create !!!  what sites like getty images have where you can search for a person, location, etc. and have all of those photos appear in my personal collection. windows 10 sort of has that with tags but i’m wondering if there is something better. \n\nany suggestions would be great.", "sortedWord": "None", "Identifyer": null, "identifyer": 84643, "year": "2019"}, {"autor": "danielandastro", "date": "2019-06-08 05:30:14", "content": "Created this, it's a little strange, but I like it", "link": "https://www.reddit.com/r/photography/comments/by4nd8/created_this_its_a_little_strange_but_i_like_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  this, it's a little strange, but i like it", "sortedWord": "None", "Identifyer": null, "identifyer": 84656, "year": "2019"}, {"autor": "tnd2k", "date": "2019-06-13 14:55:54", "content": "Where can i market my photography services? apps/ local sites etc /!/ what are some apps people use to find local photographers where i can create a profile for my business?", "link": "https://www.reddit.com/r/photography/comments/c06tfm/where_can_i_market_my_photography_services_apps/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "where can i market my photography services? apps/ local sites etc /!/ what are some apps people use to find local photographers where -----> i !!!  -----> can !!!  -----> create !!!  a profile for my business?", "sortedWord": "None", "Identifyer": null, "identifyer": 84766, "year": "2019"}, {"autor": "damjanv1", "date": "2019-06-23 04:06:59", "content": "Creating website to sell photographs and related products /!/ Hi there,\n\n&amp;#x200B;\n\nI have experience with both photography and coding (though not front end). Am looking to see what the best low price (or ideally free) templates / sites so that I can get a store up and running to sell some of my prints and related products. Ease of use (i.e. being able to quickly add products) and being able to process payments are the main areas of concern. Does anyone have a favourite site (or even template) to use when setting up a site for this purpose?", "link": "https://www.reddit.com/r/photography/comments/c3yyoq/creating_website_to_sell_photographs_and_related/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  website to sell photographs and related products /!/ hi there,\n\n&amp;#x200b;\n\ni have experience with both photography and coding (though not front end). am looking to see what the best low price (or ideally free) templates / sites so that i can get a store up and running to sell some of my prints and related products. ease of use (i.e. being able to quickly add products) and being able to process payments are the main areas of concern. does anyone have a favourite site (or even template) to use when setting up a site for this purpose?", "sortedWord": "None", "Identifyer": null, "identifyer": 84876, "year": "2019"}, {"autor": "vagabondalex", "date": "2019-05-09 07:39:36", "content": "Lens with the best bokeh for macro photography on a full frame? /!/ Hello, I am photographing flowers. I was looking at the canon 100mm 2.8 but I want to go with whatever lens will allow me to create pictures with the best looking bokeh.", "link": "https://www.reddit.com/r/photography/comments/bmgtfx/lens_with_the_best_bokeh_for_macro_photography_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "lens with the best bokeh for macro photography on a full frame? /!/ hello, i am photographing flowers. i was looking at the canon 100mm 2.8 but i want -----> to !!!  go with whatever lens will allow -----> me !!!  -----> to !!!  -----> create !!!  pictures with the best looking bokeh.", "sortedWord": "None", "Identifyer": null, "identifyer": 85375, "year": "2019"}, {"autor": "BatteredConvexity", "date": "2019-06-26 15:32:37", "content": "How can I keep creating fresher and better work, rather than trying to recreate past work?", "link": "https://www.reddit.com/r/photography/comments/c5r8xu/how_can_i_keep_creating_fresher_and_better_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i keep creating", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> keep !!!  -----> creating !!!  fresher and better work, rather than trying to recreate past work?", "sortedWord": "None", "Identifyer": null, "identifyer": 85490, "year": "2019"}, {"autor": "banshee612", "date": "2019-07-06 15:48:43", "content": "Not sure if this is allowed here. I am a hobbyist photographer and occasionally share photos on FB. They are generally like and sometimes I'll over edit them for fun or just over edit. With more and more people asking me to do photos for them, I want to create a business/Facebook page. I need a go /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/c9v103/not_sure_if_this_is_allowed_here_i_am_a_hobbyist/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "not sure if this is allowed here. i am a hobbyist photographer and occasionally share photos on fb. they are generally like and sometimes i'll over edit them for fun or just over edit. with more and more people asking me -----> to !!!  do photos for them, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a business/facebook page. i need a go /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 86120, "year": "2019"}, {"autor": "T4t5u", "date": "2019-07-06 10:05:44", "content": "Meike 35mm F1.7 lens corrections /!/ So I bought the Meike 35mm F1.7 lens and wanted to do lens correction in Lightroom, but I can't find my lens in the dropdown. Can I somehow download a lens correction profile for this lens and add it to Lightroom? \n\nIf not, can I create my own?", "link": "https://www.reddit.com/r/photography/comments/c9rzvq/meike_35mm_f17_lens_corrections/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "meike 35mm f1.7 lens corrections /!/ so i bought the meike 35mm f1.7 lens and wanted to do lens correction in lightroom, but i can't find my lens in the dropdown. can i somehow download a lens correction profile for this lens and add it to lightroom? \n\nif not, can -----> i !!!  -----> create !!!  my own?", "sortedWord": "None", "Identifyer": null, "identifyer": 86136, "year": "2019"}, {"autor": "photographyterryli", "date": "2019-07-10 13:56:48", "content": "Create Memories With Love By Europe Pre Wedding And Wedding Photography by TerryLiPhotography", "link": "https://www.reddit.com/r/photography/comments/cbh0rb/create_memories_with_love_by_europe_pre_wedding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  memories with love by europe pre wedding and wedding photography by terryliphotography", "sortedWord": "None", "Identifyer": null, "identifyer": 86194, "year": "2019"}, {"autor": "williamz902", "date": "2019-07-11 11:49:18", "content": "Most Ideal Picture Dimensions /!/ I'm working on a revamp of a website for a customer (a resort). They have sent me hundreds of pictures - practically all of them taken by a different camera with different dimensions. Some have been slightly cropped over the years! I want to create a photo gallery on the website - but I want to standardize all the pictures - so that they have the same aspect ratio.\n\n&amp;#x200B;\n\nMost of the pictures are either 4:3 or 16:9 (though there are lots of pics that have completely random aspect ratios) I'm wanting to work out the most ideal aspect ratio - perhaps an average between the two most popular: 4:3 and 16:9\n\n&amp;#x200B;\n\nI'm thinking something like 8:5 but wanting to get thoughts on this first from the public.", "link": "https://www.reddit.com/r/photography/comments/cbut0g/most_ideal_picture_dimensions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "most ideal picture dimensions /!/ i'm working on a revamp of a website for a customer (a resort). they have sent me hundreds of pictures - practically all of them taken by a different camera with different dimensions. some have been slightly cropped over the years! -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a photo gallery on the website - but -----> i !!!  -----> want !!!  -----> to !!!  standardize all the pictures - so that they have the same aspect ratio.\n\n&amp;#x200b;\n\nmost of the pictures are either 4:3 or 16:9 (though there are lots of pics that have completely random aspect ratios) i'm wanting to work out the most ideal aspect ratio - perhaps an average between the two most popular: 4:3 and 16:9\n\n&amp;#x200b;\n\ni'm thinking something like 8:5 but wanting to get thoughts on this first from the public.", "sortedWord": "None", "Identifyer": null, "identifyer": 86305, "year": "2019"}, {"autor": "GeoGrrrl", "date": "2019-07-15 15:54:45", "content": "Alternative to Photoshop CS2 (not a joke), but on a budget /!/ Hello guys,\n\nI went to be able to edit the photos I take a bit more. I hardly ever shoot raw because my computer is not particularly powerful, but I'm not excluding it. \n\nI have an old version of Photoshop CS2 on my computer. I know how to use it mostly, but it's very fiddly because the whole menu is tiny as I can't adjust the software to a half modern computer. For those moments where I really want to import and adjust raws it's also not great. I do love creating workflows though.\n\nSo what alternatives do I have? I don't want a subscription or cloud based service, and not spend too much money. Would Elements be an option or will I hate it because it automates too much? Btw, I looked at a student license there and it only seems to be valid for one year?", "link": "https://www.reddit.com/r/photography/comments/cdj6p1/alternative_to_photoshop_cs2_not_a_joke_but_on_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i do love creating", "selectorShort": "create", "MarkedSent": "alternative to photoshop cs2 (not a joke), but on a budget /!/ hello guys,\n\ni went to be able to edit the photos i take a bit more. i hardly ever shoot raw because my computer is not particularly powerful, but i'm not excluding it. \n\ni have an old version of photoshop cs2 on my computer. i know how to use it mostly, but it's very fiddly because the whole menu is tiny as i can't adjust the software to a half modern computer. for those moments where i really want to import and adjust raws it's also not great. -----> i !!!  -----> do !!!  -----> love !!!  -----> creating !!!  workflows though.\n\nso what alternatives do i have? i don't want a subscription or cloud based service, and not spend too much money. would elements be an option or will i hate it because it automates too much? btw, i looked at a student license there and it only seems to be valid for one year?", "sortedWord": "None", "Identifyer": null, "identifyer": 86518, "year": "2019"}, {"autor": "becstainscoop", "date": "2019-07-20 10:08:39", "content": "Photographic conversation and collaboration? /!/ Hello r/photography !  \n\n\nI have been wandering if people would like to get together to create a photo-conversation? This would include a starting image and each individual responds to that image with their own photograph. I was wandering if there is anyone out there who is interested in doing this?   \n\n\nI thought it would be cool to create a publication with the final works compiled together with each source credited. Does anyone have any ideas or contributions? How could we create a community to go about this?   \n\n\nfeel free to message me about this", "link": "https://www.reddit.com/r/photography/comments/cfk95p/photographic_conversation_and_collaboration/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "photographic conversation and collaboration? /!/ hello r/photography !  \n\n\ni have been wandering if people would like to get together to create a photo-conversation? this would include a starting image and each individual responds to that image with their own photograph. i was wandering if there is anyone out there who is interested in doing this?   \n\n\ni thought it would be cool to create a publication with the final works compiled together with each source credited. does anyone have any ideas or contributions? how could -----> we !!!  -----> create !!!  a community to go about this?   \n\n\nfeel free to message me about this", "sortedWord": "None", "Identifyer": null, "identifyer": 86630, "year": "2019"}, {"autor": "Steks34", "date": "2019-07-28 15:17:14", "content": "How Emotions Mold the Art We Create", "link": "https://www.reddit.com/r/photography/comments/cix0ci/how_emotions_mold_the_art_we_create/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "how emotions mold the art -----> we !!!  -----> create !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 86862, "year": "2019"}], "name": "createphotography2019"}