{"interestingcomments": [{"autor": "Rozarfedo", "date": "2018-04-19 06:44:31", "content": "Creating An Alluring Range Of Portraits In Beautiful Spaces /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8dcp8f/creating_an_alluring_range_of_portraits_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an alluring range of portraits in beautiful spaces /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11037, "year": "2018"}, {"autor": "munchkinmann", "date": "2018-03-14 06:14:59", "content": "How do I create this effect with studio lighting set up?", "link": "https://www.reddit.com/r/photography/comments/84b7pv/how_do_i_create_this_effect_with_studio_lighting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  this effect with studio lighting set up?", "sortedWord": "None", "Identifyer": null, "identifyer": 11113, "year": "2018"}, {"autor": "eyyyyy", "date": "2018-05-25 13:22:15", "content": "Where is \"merge photos\" in lightroom cc? /!/ I have watched a few videos now that indicate there should be a \"merge photos\" option within the Photo Menu in Lightroom, but I can't find it! I'm trying to create HDR images, but this is killin me! \n\nI just downloaded it, so I'm trying to orient myself. Anyway ,this is what I see within the menu.\n\n*Processing img 0akgzlub60011...*\n\n*Processing img zu41dsub60011...*", "link": "https://www.reddit.com/r/photography/comments/8m1pbl/where_is_merge_photos_in_lightroom_cc/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm trying to create", "selectorShort": "create", "MarkedSent": "where is \"merge photos\" in lightroom cc? /!/ i have watched a few videos now that indicate there should be a \"merge photos\" option within the photo menu in lightroom, but i can't find it! -----> i !!! 'm -----> trying !!!  -----> to !!!  -----> create !!!  hdr images, but this is killin me! \n\ni just downloaded it, so i'm trying to orient myself. anyway ,this is what i see within the menu.\n\n*processing img 0akgzlub60011...*\n\n*processing img zu41dsub60011...*", "sortedWord": "None", "Identifyer": null, "identifyer": 11237, "year": "2018"}, {"autor": "foodman30", "date": "2018-02-03 10:15:55", "content": "Creating instagram engagement pods ! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7uyktz/creating_instagram_engagement_pods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  instagram engagement pods ! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 12045, "year": "2018"}, {"autor": "aranetiveri", "date": "2018-09-28 17:36:23", "content": "Creating Outrun style photos", "link": "https://www.reddit.com/r/photography/comments/9jp1m2/creating_outrun_style_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  outrun style photos", "sortedWord": "None", "Identifyer": null, "identifyer": 13359, "year": "2018"}, {"autor": "AciTroniX", "date": "2018-11-21 10:15:24", "content": "Possibilities for a 16 year old to make money with photography? /!/ **Some background info: ** \n\nHey guys. My name is Simon Duvenage, and I am absolutely CRAZY about photography! Currently photography is only a hobby, but I hope one day I will be able to do it as a full-time or part-time job. I have been shooting on a Nikon Coolpix P500 bridge camera for the past couple of years, so I have been saving up to buy my first DSLR because I know that will be quite a big step up from my current setup, and I have no family or friends that have a DSLR that I could borrow. So anyways, a couple of weeks ago, as part of my birthday present my parents decided to help me buy a second hand Canon 800D (T7i for those in the US). So, unfortunately, it turns out it was a scam and the seller disappeared with all my money and never sent me my camera. So now I'm left with a burning passion for photography, and almost no money to finance it. I have tried creating a crowdfunding campaign, but I don't expect it to raise a lot of money (if any), and besides, it doesn't really feel right to just ask strangers to give me money for my hobby if they've never even met me in real life. \n\n\n**My actual question:** \n\nSo I have created this post to see if maybe anyone has some tips on how I could make some money with photography as a 16 year old without great equipment? I already have some experience using a DSLR and I fully understand how to use manual mode and have researched a ton of photography related stuff, like what different buttons do, composition tips, full frame vs crop sensors, etc. \nI know a good camera won't suddenly make me a better photographer, but it offers much more room to learn and grow into than my current setup. \n\nI will try to answer all questions you might have. \n\nYou can view some of my work so far [here](https://www.flickr.com/photos/162018749@N02/)", "link": "https://www.reddit.com/r/photography/comments/9z20bj/possibilities_for_a_16_year_old_to_make_money/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have tried creating", "selectorShort": "create", "MarkedSent": "possibilities for a 16 year old to make money with photography? /!/ **some background info: ** \n\nhey guys. my name is simon duvenage, and i am absolutely crazy about photography! currently photography is only a hobby, but i hope one day i will be able to do it as a full-time or part-time job. i have been shooting on a nikon coolpix p500 bridge camera for the past couple of years, so i have been saving up to buy my first dslr because i know that will be quite a big step up from my current setup, and i have no family or friends that have a dslr that i could borrow. so anyways, a couple of weeks ago, as part of my birthday present my parents decided to help me buy a second hand canon 800d (t7i for those in the us). so, unfortunately, it turns out it was a scam and the seller disappeared with all my money and never sent me my camera. so now i'm left with a burning passion for photography, and almost no money to finance it. -----> i !!!  -----> have !!!  -----> tried !!!  -----> creating !!!  a crowdfunding campaign, but -----> i !!!  don't expect it to raise a lot of money (if any), and besides, it doesn't really feel right to just ask strangers to give me money for my hobby if they've never even met me in real life. \n\n\n**my actual question:** \n\nso i have created this post to see if maybe anyone has some tips on how i could make some money with photography as a 16 year old without great equipment? i already have some experience using a dslr and i fully understand how to use manual mode and have researched a ton of photography related stuff, like what different buttons do, composition tips, full frame vs crop sensors, etc. \ni know a good camera won't suddenly make me a better photographer, but it offers much more room to learn and grow into than my current setup. \n\ni will try to answer all questions you might have. \n\nyou can view some of my work so far [here](https://www.flickr.com/photos/162018749@n02/)", "sortedWord": "None", "Identifyer": null, "identifyer": 13682, "year": "2018"}, {"autor": "skyline858", "date": "2018-12-10 21:29:28", "content": "Photo Merge (HDR, Panorama) missing from Lightroom CC? /!/ I'm looking to create a panoramic photo and it appears the Photo Merge option has been removed. Has anyone else had experience with this?\n\n&amp;#x200B;\n\nLightroom is up to date and I have the 3 images selected. It doesn't appear under the Photo drop down either. \n\n![img](p3z65xhaqi321)", "link": "https://www.reddit.com/r/photography/comments/a500kt/photo_merge_hdr_panorama_missing_from_lightroom_cc/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm looking to create", "selectorShort": "create", "MarkedSent": "photo merge (hdr, panorama) missing from lightroom cc? /!/ -----> i !!! 'm -----> looking !!!  -----> to !!!  -----> create !!!  a panoramic photo and it appears the photo merge option has been removed. has anyone else had experience with this?\n\n&amp;#x200b;\n\nlightroom is up to date and i have the 3 images selected. it doesn't appear under the photo drop down either. \n\n![img](p3z65xhaqi321)", "sortedWord": "None", "Identifyer": null, "identifyer": 13735, "year": "2018"}, {"autor": "ColonVenture", "date": "2018-03-22 03:29:30", "content": "How to Reach Your Audience: Photo Book /!/ I'm a beginner so excuse me if this may be in the wrong area. I'm attempting to create a photo book for a project. This project is not a series but a collection that I may add to later. \n\nI want to know what's the difference between print sizes (4x3) vs (8x10) when creating a photo book and it's effect on the viewer? \n\nFor instances in a gallery large pieces of art enable a viewer to be engulfed in the work. How would an image within a book transcend the experience further? \n\nThank you in advance. ", "link": "https://www.reddit.com/r/photography/comments/868kef/how_to_reach_your_audience_photo_book/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm attempting to create", "selectorShort": "create", "MarkedSent": "how to reach your audience: photo book /!/ i'm a beginner so excuse me if this may be in the wrong area. -----> i !!! 'm -----> attempting !!!  -----> to !!!  -----> create !!!  a photo book for a project. this project is not a series but a collection that i may add to later. \n\ni want to know what's the difference between print sizes (4x3) vs (8x10) when creating a photo book and it's effect on the viewer? \n\nfor instances in a gallery large pieces of art enable a viewer to be engulfed in the work. how would an image within a book transcend the experience further? \n\nthank you in advance. ", "sortedWord": "None", "Identifyer": null, "identifyer": 14517, "year": "2018"}, {"autor": "roseretorabbi", "date": "2018-03-29 06:31:27", "content": "I will create t shirt design /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/87z3s3/i_will_create_t_shirt_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> will !!!  -----> create !!!  t shirt design /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 14665, "year": "2018"}, {"autor": "ipez10", "date": "2018-05-05 14:58:20", "content": "Hello everyone I wanted to get into the art of photography, it all started because a few years back I took this picture and I felt like I created something good and so I am asking myself: What should I do?", "link": "https://www.reddit.com/r/photography/comments/8h80tf/hello_everyone_i_wanted_to_get_into_the_art_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hello everyone i wanted to get into the art of photography, it all started because a few years back i took this picture and -----> i !!!  felt like -----> i !!!  -----> created !!!  something good and so i am asking myself: what should i do?", "sortedWord": "None", "Identifyer": null, "identifyer": 14902, "year": "2018"}, {"autor": "Chamberedbeats", "date": "2018-02-22 01:53:16", "content": "Hey everyone I have created a website with an extensive gallery of my artwork! I appreciate all of your Support! Keep at it ya animals Rizzo", "link": "https://www.reddit.com/r/photography/comments/7zb5qh/hey_everyone_i_have_created_a_website_with_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "hey everyone -----> i !!!  -----> have !!!  -----> created !!!  a website with an extensive gallery of my artwork! i appreciate all of your support! keep at it ya animals rizzo", "sortedWord": "None", "Identifyer": null, "identifyer": 15211, "year": "2018"}, {"autor": "jubileo5", "date": "2018-05-14 02:51:00", "content": "How to keep consistent background colour? /!/ Hey,\n\nI'm doing a photography internship at an Ice Cream company and they want me to create photos like these [https://www.instagram.com/p/Bbfy2b5BB0x/?taken\\-by=nadamoo](https://www.instagram.com/p/Bbfy2b5BB0x/?taken-by=nadamoo) . I have no problem getting those photos except for the background. I have been provided a flash, cardboard backgrounds and ample natural lighting to take these photos. However, the background's colours are never consistent. If I try a blue background for example, every week when I do a shoot the blue background has slightly different shades.  For example, a photo taken using same settings but 3min apart. [https://i.imgur.com/6ZJqZdZ.jpg](https://i.imgur.com/6ZJqZdZ.jpg) \n\nWhat would be the best photography technique in keeping a visual colour consistency?", "link": "https://www.reddit.com/r/photography/comments/8j93bk/how_to_keep_consistent_background_colour/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "how to keep consistent background colour? /!/ hey,\n\ni'm doing a photography internship at an ice cream company and they want -----> me !!!  -----> to !!!  -----> create !!!  photos like these [https://www.instagram.com/p/bbfy2b5bb0x/?taken\\-by=nadamoo](https://www.instagram.com/p/bbfy2b5bb0x/?taken-by=nadamoo) . i have no problem getting those photos except for the background. i have been provided a flash, cardboard backgrounds and ample natural lighting to take these photos. however, the background's colours are never consistent. if i try a blue background for example, every week when i do a shoot the blue background has slightly different shades.  for example, a photo taken using same settings but 3min apart. [https://i.imgur.com/6zjqzdz.jpg](https://i.imgur.com/6zjqzdz.jpg) \n\nwhat would be the best photography technique in keeping a visual colour consistency?", "sortedWord": "None", "Identifyer": null, "identifyer": 15383, "year": "2018"}, {"autor": "irinashyshkofan1", "date": "2018-05-14 02:11:20", "content": "How to have clean colour background? /!/ Hey,\n\nI'm doing a photography internship at an Ice Cream company and they want me to create photos like these [https://www.instagram.com/p/Bbfy2b5BB0x/?taken\\-by=nadamoo](https://www.instagram.com/p/Bbfy2b5BB0x/?taken-by=nadamoo) . I have no problem getting those photos except for the background. I have been provided a flash, cardboard backgrounds and ample natural lighting to take these photos. However, the background's colours are never consistent. If I try a blue background for example, every week when I do a shoot the blue background has slightly different shades.\n\nWhat would be the best photography technique in keeping a visual colour consistency?", "link": "https://www.reddit.com/r/photography/comments/8j8v14/how_to_have_clean_colour_background/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "how to have clean colour background? /!/ hey,\n\ni'm doing a photography internship at an ice cream company and they want -----> me !!!  -----> to !!!  -----> create !!!  photos like these [https://www.instagram.com/p/bbfy2b5bb0x/?taken\\-by=nadamoo](https://www.instagram.com/p/bbfy2b5bb0x/?taken-by=nadamoo) . i have no problem getting those photos except for the background. i have been provided a flash, cardboard backgrounds and ample natural lighting to take these photos. however, the background's colours are never consistent. if i try a blue background for example, every week when i do a shoot the blue background has slightly different shades.\n\nwhat would be the best photography technique in keeping a visual colour consistency?", "sortedWord": "None", "Identifyer": null, "identifyer": 15386, "year": "2018"}, {"autor": "velichapaad", "date": "2018-06-02 14:10:43", "content": "(Please help!!) Instagram is creeping on me! /!/ **Background**\n\nI've had a fb account before..I deactivated it 7 months ago...I've never had FB app on my phone..Nor have I accessed FB through any means other than my laptop. I have whatsapp and instagram. I had created a new email id to make my instagram acc. None of my friends are aware of my instagram acc or the new email id. I've not linked instagram to any of my other social media accounts.\n\n**Problem**\n\nI just noticed that instagram is recommending my fb friends' instagram accounts to me. Day before yesterday, I linked my NEW PHONE NUMBER to my instagram acc. None of my friends are aware off my new phone number. How did instagram get to recommend my fb friends to me? And more importantly, how can I stop it?..", "link": "https://www.reddit.com/r/photography/comments/8o0s53/please_help_instagram_is_creeping_on_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i had created", "selectorShort": "create", "MarkedSent": "(please help!!) instagram is creeping on me! /!/ **background**\n\ni've had a fb account before..i deactivated it 7 months ago...i've never had fb app on my phone..nor have i accessed fb through any means other than my laptop. i have whatsapp and instagram. -----> i !!!  -----> had !!!  -----> created !!!  a new email id to make my instagram acc. none of my friends are aware of my instagram acc or the new email id. i've not linked instagram to any of my other social media accounts.\n\n**problem**\n\ni just noticed that instagram is recommending my fb friends' instagram accounts to me. day before yesterday, i linked my new phone number to my instagram acc. none of my friends are aware off my new phone number. how did instagram get to recommend my fb friends to me? and more importantly, how can i stop it?..", "sortedWord": "None", "Identifyer": null, "identifyer": 15527, "year": "2018"}, {"autor": "trocheerio", "date": "2018-07-09 03:28:50", "content": "Creating a separate Instagram account for photography content? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8x7md1/creating_a_separate_instagram_account_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a separate instagram account for photography content? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 15926, "year": "2018"}, {"autor": "andrewc00k", "date": "2018-07-17 02:51:59", "content": "I Created a Globally Ran Instagram Account. The idea is to have it open to anyone across the globe and connect people and showcase different cultures. /!/ My friend and I in marketing have started this little side project on Instagram. The idea is to have it as an open account that anyone (with permission) can access to upload photos and videos.\n\nWe just launched the account \"see.what.eye.sea\" on Saturday, July 14th so it is still in its very early stages. However, we think it could really pick up given the right exposure. In a world where content is king, having content uploaded by numerous people across the globe has the potential to be something big.\n\nLet me know what you think if the idea, toss a follow to @see.what.eye.sea and if you are or know anyone travelling or who likes to take awesome photos of where ever you live, then take over the account and upload your own!", "link": "https://www.reddit.com/r/photography/comments/8zhgnn/i_created_a_globally_ran_instagram_account_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a globally ran instagram account. the idea is to have it open to anyone across the globe and connect people and showcase different cultures. /!/ my friend and i in marketing have started this little side project on instagram. the idea is to have it as an open account that anyone (with permission) can access to upload photos and videos.\n\nwe just launched the account \"see.what.eye.sea\" on saturday, july 14th so it is still in its very early stages. however, we think it could really pick up given the right exposure. in a world where content is king, having content uploaded by numerous people across the globe has the potential to be something big.\n\nlet me know what you think if the idea, toss a follow to @see.what.eye.sea and if you are or know anyone travelling or who likes to take awesome photos of where ever you live, then take over the account and upload your own!", "sortedWord": "None", "Identifyer": null, "identifyer": 16026, "year": "2018"}, {"autor": "OldRuskiNoir", "date": "2018-08-23 00:16:38", "content": "Are there any high quality time lapse cameras that can record images to a network location? /!/ I have an interesting situation at work.\n\nWe have a space that we want to have the ability to make a timelapse with at any time.  The idea is set up a camera have it take photos every 30 seconds and send the photos automatically to a network location on a Wifi network we will create.  The location with the camera will not be accessible once it is set up.\n\nI would like to use something the size of an a6000, doesn't need to have changeable lenses but wouldn't hurt.\n\nI looked into the WiFi SD cards but they seem to be very manual and not really meant for batch/live transfers.  I found some \"construction\" time lapse tools but they require physical access to grab the photos off the device.\n\nDoes anyone know how to set something like this up?  Am I overthinking it and there is a tool already for this?\n\nBudget is around $1kUSD.  Thanks!", "link": "https://www.reddit.com/r/photography/comments/99imbj/are_there_any_high_quality_time_lapse_cameras/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we will create", "selectorShort": "create", "MarkedSent": "are there any high quality time lapse cameras that can record images to a network location? /!/ i have an interesting situation at work.\n\nwe have a space that we want to have the ability to make a timelapse with at any time.  the idea is set up a camera have it take photos every 30 seconds and send the photos automatically to a network location on a wifi network -----> we !!!  -----> will !!!  -----> create !!! .  the location with the camera will not be accessible once it is set up.\n\ni would like to use something the size of an a6000, doesn't need to have changeable lenses but wouldn't hurt.\n\ni looked into the wifi sd cards but they seem to be very manual and not really meant for batch/live transfers.  i found some \"construction\" time lapse tools but they require physical access to grab the photos off the device.\n\ndoes anyone know how to set something like this up?  am i overthinking it and there is a tool already for this?\n\nbudget is around $1kusd.  thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 16418, "year": "2018"}, {"autor": "Max_Thunder", "date": "2018-08-22 15:01:08", "content": "I have a Canon T3i, the 18-55mm kit lens and a 55-250mm lens. What lens should I get next? 24 mm \"pancake\" lens? Details in post. /!/ I mostly take pics when travelling, focusing more on capturing what I see (while still aiming for good composition) than on creating art. I'll want to take a landscape pic, or a picture capturing a whole construction and its context. Portraits are very rare.\n\nI would like to create some art, but that's not my focus. I realized that I take most of my pictures at 18 mm, although I often play with the zoom to achieve the composition I want. Must be kind of weird to use a prime lens after years of being used to a zoom lens. I've had the camera for 7 years.\n\nI have also, very recently, taken an interest in night sky photography. Got some decent pics of the Milky Way with my kit lens, but ISO was boosted to the maximum and it shows.\n\nIt has come to my attention that a 24 mm pancake lens could improve my photos, especially in lower light situations. The inexpensive one I could get is f/2.8. The lighter weight could also be a plus when hiking and wanting to take pics of the views.\n\nAnother lens is the 50 mm one, f/1.8. \n\nWhich one would work best for night sky photography? I think the 50 mm possibly would, but wouldn't be as useful for taking landscape photos.\n\nI'm also not sure if I should consider at all a 50 mm f/1.4. I don't really have a budget but if I put that much money, it has to be really worth it, and it is twice the price.\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/99e280/i_have_a_canon_t3i_the_1855mm_kit_lens_and_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "i have a canon t3i, the 18-55mm kit lens and a 55-250mm lens. what lens should i get next? 24 mm \"pancake\" lens? details in post. /!/ i mostly take pics when travelling, focusing more on capturing what i see (while still aiming for good composition) than on creating art. i'll want to take a landscape pic, or a picture capturing a whole construction and its context. portraits are very rare.\n\n-----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  some art, but that's not my focus. i realized that i take most of my pictures at 18 mm, although i often play with the zoom to achieve the composition i want. must be kind of weird to use a prime lens after years of being used to a zoom lens. i've had the camera for 7 years.\n\ni have also, very recently, taken an interest in night sky photography. got some decent pics of the milky way with my kit lens, but iso was boosted to the maximum and it shows.\n\nit has come to my attention that a 24 mm pancake lens could improve my photos, especially in lower light situations. the inexpensive one i could get is f/2.8. the lighter weight could also be a plus when hiking and wanting to take pics of the views.\n\nanother lens is the 50 mm one, f/1.8. \n\nwhich one would work best for night sky photography? i think the 50 mm possibly would, but wouldn't be as useful for taking landscape photos.\n\ni'm also not sure if i should consider at all a 50 mm f/1.4. i don't really have a budget but if i put that much money, it has to be really worth it, and it is twice the price.\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 16459, "year": "2018"}, {"autor": "RubberS2", "date": "2018-09-19 08:10:17", "content": "Created this photo with my phone, next to the Veluwe, the Netherlands.", "link": "https://www.reddit.com/r/photography/comments/9h39zm/created_this_photo_with_my_phone_next_to_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  this photo with my phone, next to the veluwe, the netherlands.", "sortedWord": "None", "Identifyer": null, "identifyer": 16770, "year": "2018"}, {"autor": "starman-on-roadster", "date": "2018-09-27 22:40:56", "content": "Text in a book portfolio /!/ Hello,\n\nI am currently creating a book displaying my best landscape photography throughout the years.  The book is lay flat and very large (11x14) and most of the photos are double spread as it felt better with that layout. That results in some empty space next to each photo. I have added a title, location and date for each photo. I am considering adding a sentence or two descriptive text for each photo. I would love to hear opinions about should I add that or keep with the simpler title, location, date option.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9jhhgp/text_in_a_book_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am currently creating", "selectorShort": "create", "MarkedSent": "text in a book portfolio /!/ hello,\n\n-----> i !!!  -----> am !!!  -----> currently !!!  -----> creating !!!  a book displaying my best landscape photography throughout the years.  the book is lay flat and very large (11x14) and most of the photos are double spread as it felt better with that layout. that results in some empty space next to each photo. i have added a title, location and date for each photo. i am considering adding a sentence or two descriptive text for each photo. i would love to hear opinions about should i add that or keep with the simpler title, location, date option.\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 16822, "year": "2018"}, {"autor": "HalcyonoyclaH", "date": "2018-11-03 02:56:23", "content": "Where should I begin with selling prints? /!/ I’m not a professional by any means, but I think my photos are good enough that some people would want to buy them. I’ve gotten lots of positive feedback. I’m not sure how the process of selling photos works, though. I know that some people can sell their pictures as part of a limited series, with numbered prints, while others just print lots and sell lots. I’d prefer the former, mainly because I like the thought of something I’ve created being rare/valuable, but I have no photography credit to my name, so I have no idea if that’s even an option for me. If anyone could just offer some insight into the world of professional photography and prints, I would really appreciate it!", "link": "https://www.reddit.com/r/photography/comments/9tqs8c/where_should_i_begin_with_selling_prints/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’ve created", "selectorShort": "create", "MarkedSent": "where should i begin with selling prints? /!/ i’m not a professional by any means, but i think my photos are good enough that some people would want to buy them. i’ve gotten lots of positive feedback. i’m not sure how the process of selling photos works, though. i know that some people can sell their pictures as part of a limited series, with numbered prints, while others just print lots and sell lots. -----> i !!! ’d prefer the former, mainly because -----> i !!!  like the thought of something -----> i !!! ’ve -----> created !!!  being rare/valuable, but -----> i !!!  have no photography credit to my name, so -----> i !!!  have no idea if that’s even an option for me. if anyone could just offer some insight into the world of professional photography and prints, i would really appreciate it!", "sortedWord": "None", "Identifyer": null, "identifyer": 17224, "year": "2018"}, {"autor": "DarcyFitz", "date": "2018-11-02 14:44:15", "content": "Who thinks wedding photography is the WORST form of professional photography? /!/ I hear so often from professional photographers that weddings are the worst, and I can't quite understand that.\n\nFor me, I find shooting weddings to be the absolute most fulfilling form of my craft. For one, I'm taking photos that will be treasured for a lifetime. For another, it's a wonderful blend of portraiture, street photography, and event photography--it's diverse and fun.\n\nSure, I'm exhausted at the end of the day, but I feel like I've created something wonderful that will be valued for a long, long time.\n\nWhy is wedding photography so disliked among professional photographers..?", "link": "https://www.reddit.com/r/photography/comments/9tkpmy/who_thinks_wedding_photography_is_the_worst_form/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "who thinks wedding photography is the worst form of professional photography? /!/ i hear so often from professional photographers that weddings are the worst, and i can't quite understand that.\n\nfor me, i find shooting weddings to be the absolute most fulfilling form of my craft. for one, i'm taking photos that will be treasured for a lifetime. for another, it's a wonderful blend of portraiture, street photography, and event photography--it's diverse and fun.\n\nsure, -----> i !!! 'm exhausted at the end of the day, but -----> i !!!  feel like -----> i !!! 've -----> created !!!  something wonderful that will be valued for a long, long time.\n\nwhy is wedding photography so disliked among professional photographers..?", "sortedWord": "None", "Identifyer": null, "identifyer": 17263, "year": "2018"}, {"autor": "TheBigSausage77", "date": "2018-11-20 23:26:53", "content": "So I really want to get into photography but one question I have is: what do I do with my photographs? /!/ So I recently though about getting a camera and some light equipment.\nBut this question has been bugging me for a while.\n\nIm not really committed to a full instagram page, I don’t create content, and I don’t upload stuff anywhere.\n\nWhat do people do with their photos? I mean you guys shoot thousands of them... where do they go?\n\nI really want some nice idea of what to do with them when I get a camera, thanks in advance.", "link": "https://www.reddit.com/r/photography/comments/9yxlwt/so_i_really_want_to_get_into_photography_but_one/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i don’t create", "selectorShort": "create", "MarkedSent": "so i really want to get into photography but one question i have is: what do i do with my photographs? /!/ so i recently though about getting a camera and some light equipment.\nbut this question has been bugging me for a while.\n\n-----> i !!! m not really committed to a full instagram page, -----> i !!!  -----> do !!! -----> n’t !!!  -----> create !!!  content, and -----> i !!!  -----> do !!! -----> n’t !!!  upload stuff anywhere.\n\nwhat do people do with their photos? i mean you guys shoot thousands of them... where do they go?\n\ni really want some nice idea of what to do with them when i get a camera, thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 17413, "year": "2018"}, {"autor": "holdengt", "date": "2018-11-20 12:23:44", "content": "Practical Effects /!/ Hello!\n\n&amp;#x200B;\n\nHoping the collective knowledge of this thread can help me out a bit!\n\n&amp;#x200B;\n\nI enjoy creating these fine art photographs of buildings, however sometimes it's not very practical to be travelling around the country looking for interesting architecture. \n\n&amp;#x200B;\n\nI am curious how this could be done in camera at home or in a studio? Wether that involves creating models (what materials would be necessary?) or photographing certain items you might have at home. If i were to photograph smaller items how would I go about making them look large like a building? Would it involve shooting really wide or would a macro lens be necessary? \n\n&amp;#x200B;\n\nAny tips or ideas would be greatly appreciated!\n\n[@holden.gt](https://i.redd.it/60ji08icahz11.jpg)", "link": "https://www.reddit.com/r/photography/comments/9yrp9x/practical_effects/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i enjoy creating", "selectorShort": "create", "MarkedSent": "practical effects /!/ hello!\n\n&amp;#x200b;\n\nhoping the collective knowledge of this thread can help me out a bit!\n\n&amp;#x200b;\n\n-----> i !!!  -----> enjoy !!!  -----> creating !!!  these fine art photographs of buildings, however sometimes it's not very practical to be travelling around the country looking for interesting architecture. \n\n&amp;#x200b;\n\ni am curious how this could be done in camera at home or in a studio? wether that involves creating models (what materials would be necessary?) or photographing certain items you might have at home. if i were to photograph smaller items how would i go about making them look large like a building? would it involve shooting really wide or would a macro lens be necessary? \n\n&amp;#x200b;\n\nany tips or ideas would be greatly appreciated!\n\n[@holden.gt](https://i.redd.it/60ji08icahz11.jpg)", "sortedWord": "None", "Identifyer": null, "identifyer": 17445, "year": "2018"}, {"autor": "mrfonsocr", "date": "2018-12-27 18:56:13", "content": "Best WP plugin for site’s Portfolio? /!/ Hi!\n\nI am creating my website in the hope I can reach to more clients. I already have my FB and Instagram accounts (which is OK), but I have always had the impression that a web site is more formal and gives better impression than just mere social accounts.\n\nI know what some may say, “let the work speak for itself” and I agree; however, this techy times require us to adapt and, to me, this is it.\n\nI am building my portfolio. \n\nBut, this is a big deal for me.\n\nI already stumbled against the fact that this WP theme that I use affects picture resolution (at least on the front page) so I am looking for something that allows me to show my work without compromising resolution.\n\nAny idea?\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/aa1zyg/best_wp_plugin_for_sites_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "best wp plugin for site’s portfolio? /!/ hi!\n\n-----> i !!!  -----> am !!!  -----> creating !!!  my website in the hope -----> i !!!  can reach to more clients. i already have my fb and instagram accounts (which is ok), but i have always had the impression that a web site is more formal and gives better impression than just mere social accounts.\n\ni know what some may say, “let the work speak for itself” and i agree; however, this techy times require us to adapt and, to me, this is it.\n\ni am building my portfolio. \n\nbut, this is a big deal for me.\n\ni already stumbled against the fact that this wp theme that i use affects picture resolution (at least on the front page) so i am looking for something that allows me to show my work without compromising resolution.\n\nany idea?\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 17823, "year": "2018"}, {"autor": "nVitius", "date": "2018-12-27 02:09:34", "content": "Storing Digital Photos /!/ I have started doing some photography earlier this year. I recently ran into an issue with storing my images on my computer. The camera I use creates a filename with a numerical ID (e.g. DSC01503.ARW). This was fine for a while, but when I cleared the SD card on my camera to free up room, the counter started from the beginning again.\n\nI thought about storing the photos in a folder by date, but that seems too tedious at this point, unless I write a script to read the metadata on the files. Also, I want to have them all in a single folder.\n\n&amp;#x200B;\n\nWhat kind of systems/conventions do you use for storing digital photographs?", "link": "https://www.reddit.com/r/photography/comments/a9uutl/storing_digital_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i use creates", "selectorShort": "create", "MarkedSent": "storing digital photos /!/ i have started doing some photography earlier this year. i recently ran into an issue with storing my images on my computer. the camera -----> i !!!  -----> use !!!  -----> creates !!!  a filename with a numerical -----> i !!! d (e.g. dsc01503.arw). this was fine for a while, but when i cleared the sd card on my camera to free up room, the counter started from the beginning again.\n\ni thought about storing the photos in a folder by date, but that seems too tedious at this point, unless i write a script to read the metadata on the files. also, i want to have them all in a single folder.\n\n&amp;#x200b;\n\nwhat kind of systems/conventions do you use for storing digital photographs?", "sortedWord": "None", "Identifyer": null, "identifyer": 17894, "year": "2018"}, {"autor": "colietrent", "date": "2018-01-03 07:46:33", "content": "Kirlian photography /!/ I recently came across this type of photography and was wondering if there was a simple way I could create this effect without buying a whole set up?", "link": "https://www.reddit.com/r/photography/comments/7nt72t/kirlian_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "kirlian photography /!/ -----> i !!!  recently came across this type of photography and was wondering if there was a simple way -----> i !!!  -----> could !!!  -----> create !!!  this effect without buying a whole set up?", "sortedWord": "None", "Identifyer": null, "identifyer": 17970, "year": "2018"}, {"autor": "cryptodesign", "date": "2018-01-30 13:02:25", "content": "Made a Guide on How To Photograph Seascapes /!/ Hi guys :)\n\nI'm back with another guide. Felt inspired after just having spent a week in Lofoten. Still have to process lots of images but I did a lot of seascape shots so I figured I'd write up a little guide for Reddit on how to shoot seascapes.\n\n[Header](https://imgur.com/KzQsEwa)\n\nPhotographing the sea and the waves can be both challenging and fun. People often ask me what are ‘the right settings’ to shoot moving water so I decided to write a little guide on it. There are many options depending on what look you’re going for. By using some examples of my own I’ll explain how I shoot my seascapes.\n\nI usually define 3 options: Shooting the sea normally with a very fast shutter speed (not going to discuss it in this article as it’s just pressing the shutter and not doing much else), shooting the sea with a bit of a slower shutter speed of around 0.5 - 2 seconds, and shooting the sea with a very long exposure to get that super silky smooth water.\n\n**Look &amp; Feel**\n\nNow I like to create some ‘life’ into my images. I like them dynamic so I often go with the shutter speed of around 1-2 seconds. Why? Because I still get that ‘painting’ look I love myself, but I still get the movement of the water. The flow that creates the dynamics in an image is very important. It can also be used for compositions. I don’t like very short shutter speeds (except for rare occasions when the sea is very dramatic). Simply because the sea is often quite messy and with very short shutter speed it’s hard to create that painty look I like. This is of course different for everyone, just stating my own style here. I sometimes love extremely long exposures too (30 seconds and up) to create that very smooth surface of water. When you’re shooting with some objects in the foreground (like rocks for example) you can create that ‘misty’ look. \n\n[Rough sea at Tellera Italy with a 1.3 second exposure to capture the dynamics of the sea.](https://imgur.com/H3dN3t8)\n\n**Settings**\n\nAs mentioned above, for flowing waves and water I like to use a shutter speed of around 0.5-2 seconds depending on how fast the water is moving. I use Aperture priority with a closed down aperture of around f/14. I want a rather closed down aperture because I want a big focus plane. I want things in the foreground and background to be both in focus. I also used a closed down aperture because I want to create that longer shutter speed. Use the lowest ISO available on your camera. If you have bright light during the day you’ll not be able to get a shutter speed of 0.5-2 seconds with just closing the aperture. You’ll need some filters. When the weather gets dark and moody, you may just be able to shoot without a filter because there is less light. When you want a really long exposure during the day, you’ll always need a ND (Neutral Density) filter.\n\n[4 minutes exposure during sunset with a 10 stop ND filter.](https://imgur.com/3Ia7wMH)\n\n\n**Filters**\n\nThere are a wide variety of filters available. To slow down the shutter speed you will have to use ND filters. During daytime I mostly use a 4 or 6 stop to slow down the shutter speed just enough to get that silky look. If you want to use a very long shutter speed, you’ll need a 10 stop filter. The stops define how much light an ND filter will let through. The less light, the longer your shutter speed. Think of it as sunglasses with different strength. You can also use ND graduate filters. These only darken the top of the frame (the sky) so that you can balance out your exposure. The most commonly used ND graduate filter is the 3 stops (often called 0.9 grad) I often use an ND graduate filter together with a full ND filter (4-6 stops, or 10 for very long exposures). Another filters that is very useful for shooting water and the sea is the CPL filter. With the CPL filter you can control the reflections and glare on the water. Sometimes you get those nasty highlights on the water that you want to get rid of. That’s where the CPL comes in. By turning it you can control the amount of reflection on the water.\n\n[Very long exposure (3 minutes) of a seascape in the Netherlands. Leading lines point straight to the middle of the wind direction.](https://imgur.com/LfkzTqg)\n\n[The same scene with a different white balance, toning and settings. Exposure time is only 1 second in this shot to still get those ‘painty’ waves but the image retains its dynamics and drama. I like both versions even though they are completely different. ](https://imgur.com/u2Y4XJl)\n\n\n\n**Timing**\n\nIf you’re all set up with the right settings, it’s time to shoot! When want to shoot moving waves timing is crucial. Waves come in and pull back, and hitting the shutter button at the right time is essential. Using a remote for this is recommended, as you don’t want to be touching your camera when shooting longer exposures as your shot might get blurry from you touching the camera. I like to control timing myself, but another option is to shoot in burst/continuous mode on your camera. You can just keep shooting all the time and hope you get a nice wave in your shot. Downside of this is that you will get lots of files to go through later and also the timing is not super precise. \n\nNow let me explain you how I shoot waves action. I pick a composition and setup my camera settings. Depending on the scenery I wait for the right moment and press the shutter. The right moment is often when the water or sea pulls BACK. Not when it’s incoming. When it pulls back you get that white foam pulling back into the sea creating beautiful leading lines in your image. When you have rocks in the foreground and you want water splashing over them, shoot when the water is incoming. But the trick is often to wait until the water pulls back and then press the shutter button. I keep doing this until I see an image on my display that I like. Then I move on to another composition. I try different shutter speeds from 0.5 - 2 seconds depending how rough the water is to see what looks best. Just experiment.\n\n[A wave pulling back during a 1.6 second exposure creating that pullback into the sea and the swirl around the piece of ice.](https://imgur.com/8j0SCyu)\n\n**Compositions**\n\n*some tips on compositions with water:*\n\n* Use flowing water as a leading line through the middle or corners. \n* Put your camera very low to the sea to get close up to the action. But be very careful for rogue waves that might hit your camera. Salt water onto your camera often means death.\n* When using very long exposures, use objects in the foreground to create depth in your shot\n* When you found your composition, try all kinds of shutter speeds. very short, 0.5-2 seconds, and 30 seconds. See what looks best.\n* Try to use objects like rocks in the foreground to use for splashing water, or flowing water around.\n* You can use waves on its own to create a photo out of completely nothing. Sometimes a single wave on it’s own can look amazing, without anything else. Just keep shooting to try and catch that perfect wave.\nA wave pulling back in combination with swirling plants create a nice swirling leading line into the image. \n\n[A wave pulling back in combination with swirling plants create a nice swirling leading line into the image. Exif: Sony A7RIII, 16mm, f18, 0.8s, ISO50 with CPL and 3 stop ND filter.](https://imgur.com/8QaDVSA)\n\n\n**Have fun, but watch out!**\n\nShooting seascapes can be great fun. I can spend hours shooting the same location by just trying to get that perfect wave in my shot. Make sure you wear boots and waterproof pants if you’re going to stand in the waves. Be careful on rough seas and beaches that are known for rogue waves. Also, be very careful that waves are not hitting your camera. Salt water is NOT good! There are cheap rain covers available for cameras that you can use to project your camera. I have seen many cameras die in the sea (and I have had one death myself). So be careful! \n\nHope this little guide was useful to get your started with seascapes!\n\n", "link": "https://www.reddit.com/r/photography/comments/7u0u9f/made_a_guide_on_how_to_photograph_seascapes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i like to create", "selectorShort": "create", "MarkedSent": "made a guide on how to photograph seascapes /!/ hi guys :)\n\ni'm back with another guide. felt inspired after just having spent a week in lofoten. still have to process lots of images but i did a lot of seascape shots so i figured i'd write up a little guide for reddit on how to shoot seascapes.\n\n[header](https://imgur.com/kzqsewa)\n\nphotographing the sea and the waves can be both challenging and fun. people often ask me what are ‘the right settings’ to shoot moving water so i decided to write a little guide on it. there are many options depending on what look you’re going for. by using some examples of my own i’ll explain how i shoot my seascapes.\n\ni usually define 3 options: shooting the sea normally with a very fast shutter speed (not going to discuss it in this article as it’s just pressing the shutter and not doing much else), shooting the sea with a bit of a slower shutter speed of around 0.5 - 2 seconds, and shooting the sea with a very long exposure to get that super silky smooth water.\n\n**look &amp; feel**\n\nnow -----> i !!!  -----> like !!!  -----> to !!!  -----> create !!!  some ‘life’ into my images. i like them dynamic so i often go with the shutter speed of around 1-2 seconds. why? because i still get that ‘painting’ look i love myself, but i still get the movement of the water. the flow that creates the dynamics in an image is very important. it can also be used for compositions. i don’t like very short shutter speeds (except for rare occasions when the sea is very dramatic). simply because the sea is often quite messy and with very short shutter speed it’s hard to create that painty look i like. this is of course different for everyone, just stating my own style here. i sometimes love extremely long exposures too (30 seconds and up) to create that very smooth surface of water. when you’re shooting with some objects in the foreground (like rocks for example) you can create that ‘misty’ look. \n\n[rough sea at tellera italy with a 1.3 second exposure to capture the dynamics of the sea.](https://imgur.com/h3dn3t8)\n\n**settings**\n\nas mentioned above, for flowing waves and water i like to use a shutter speed of around 0.5-2 seconds depending on how fast the water is moving. i use aperture priority with a closed down aperture of around f/14. i want a rather closed down aperture because i want a big focus plane. i want things in the foreground and background to be both in focus. i also used a closed down aperture because i want to create that longer shutter speed. use the lowest iso available on your camera. if you have bright light during the day you’ll not be able to get a shutter speed of 0.5-2 seconds with just closing the aperture. you’ll need some filters. when the weather gets dark and moody, you may just be able to shoot without a filter because there is less light. when you want a really long exposure during the day, you’ll always need a nd (neutral density) filter.\n\n[4 minutes exposure during sunset with a 10 stop nd filter.](https://imgur.com/3ia7wmh)\n\n\n**filters**\n\nthere are a wide variety of filters available. to slow down the shutter speed you will have to use nd filters. during daytime i mostly use a 4 or 6 stop to slow down the shutter speed just enough to get that silky look. if you want to use a very long shutter speed, you’ll need a 10 stop filter. the stops define how much light an nd filter will let through. the less light, the longer your shutter speed. think of it as sunglasses with different strength. you can also use nd graduate filters. these only darken the top of the frame (the sky) so that you can balance out your exposure. the most commonly used nd graduate filter is the 3 stops (often called 0.9 grad) i often use an nd graduate filter together with a full nd filter (4-6 stops, or 10 for very long exposures). another filters that is very useful for shooting water and the sea is the cpl filter. with the cpl filter you can control the reflections and glare on the water. sometimes you get those nasty highlights on the water that you want to get rid of. that’s where the cpl comes in. by turning it you can control the amount of reflection on the water.\n\n[very long exposure (3 minutes) of a seascape in the netherlands. leading lines point straight to the middle of the wind direction.](https://imgur.com/lfkztqg)\n\n[the same scene with a different white balance, toning and settings. exposure time is only 1 second in this shot to still get those ‘painty’ waves but the image retains its dynamics and drama. i like both versions even though they are completely different. ](https://imgur.com/u2y4xjl)\n\n\n\n**timing**\n\nif you’re all set up with the right settings, it’s time to shoot! when want to shoot moving waves timing is crucial. waves come in and pull back, and hitting the shutter button at the right time is essential. using a remote for this is recommended, as you don’t want to be touching your camera when shooting longer exposures as your shot might get blurry from you touching the camera. i like to control timing myself, but another option is to shoot in burst/continuous mode on your camera. you can just keep shooting all the time and hope you get a nice wave in your shot. downside of this is that you will get lots of files to go through later and also the timing is not super precise. \n\nnow let me explain you how i shoot waves action. i pick a composition and setup my camera settings. depending on the scenery i wait for the right moment and press the shutter. the right moment is often when the water or sea pulls back. not when it’s incoming. when it pulls back you get that white foam pulling back into the sea creating beautiful leading lines in your image. when you have rocks in the foreground and you want water splashing over them, shoot when the water is incoming. but the trick is often to wait until the water pulls back and then press the shutter button. i keep doing this until i see an image on my display that i like. then i move on to another composition. i try different shutter speeds from 0.5 - 2 seconds depending how rough the water is to see what looks best. just experiment.\n\n[a wave pulling back during a 1.6 second exposure creating that pullback into the sea and the swirl around the piece of ice.](https://imgur.com/8j0scyu)\n\n**compositions**\n\n*some tips on compositions with water:*\n\n* use flowing water as a leading line through the middle or corners. \n* put your camera very low to the sea to get close up to the action. but be very careful for rogue waves that might hit your camera. salt water onto your camera often means death.\n* when using very long exposures, use objects in the foreground to create depth in your shot\n* when you found your composition, try all kinds of shutter speeds. very short, 0.5-2 seconds, and 30 seconds. see what looks best.\n* try to use objects like rocks in the foreground to use for splashing water, or flowing water around.\n* you can use waves on its own to create a photo out of completely nothing. sometimes a single wave on it’s own can look amazing, without anything else. just keep shooting to try and catch that perfect wave.\na wave pulling back in combination with swirling plants create a nice swirling leading line into the image. \n\n[a wave pulling back in combination with swirling plants create a nice swirling leading line into the image. exif: sony a7riii, 16mm, f18, 0.8s, iso50 with cpl and 3 stop nd filter.](https://imgur.com/8qadvsa)\n\n\n**have fun, but watch out!**\n\nshooting seascapes can be great fun. i can spend hours shooting the same location by just trying to get that perfect wave in my shot. make sure you wear boots and waterproof pants if you’re going to stand in the waves. be careful on rough seas and beaches that are known for rogue waves. also, be very careful that waves are not hitting your camera. salt water is not good! there are cheap rain covers available for cameras that you can use to project your camera. i have seen many cameras die in the sea (and i have had one death myself). so be careful! \n\nhope this little guide was useful to get your started with seascapes!\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 18574, "year": "2018"}, {"autor": "billium28", "date": "2018-04-12 04:07:49", "content": "Am I the only one that has login issues with Flickr?? /!/ I have had a solid 10 year issue of Flickr trouble where they either forget my PW or other log in issues. I basically visit and reset the PW every time I am on there. I use Lastpass and have every god damn fucking password saved. I have even written some down. I want to create an account away from my family account for my more serious photography but I guess my email address is tied to the other one as a backup. I can't login to my normal account now as it shows a page stating \"There is a problem\" I can't get past this screen. It is a total shit show.\n\nSorry had to rant, every do I really need another god damned email address to start over? This is like 1998 fucking account management. I just don't get it.", "link": "https://www.reddit.com/r/photography/comments/8bnf3c/am_i_the_only_one_that_has_login_issues_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "am i the only one that has login issues with flickr?? /!/ i have had a solid 10 year issue of flickr trouble where they either forget my pw or other log in issues. i basically visit and reset the pw every time i am on there. i use lastpass and have every god damn fucking password saved. i have even written some down. -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  an account away from my family account for my more serious photography but i guess my email address is tied to the other one as a backup. i can't login to my normal account now as it shows a page stating \"there is a problem\" i can't get past this screen. it is a total shit show.\n\nsorry had to rant, every do i really need another god damned email address to start over? this is like 1998 fucking account management. i just don't get it.", "sortedWord": "None", "Identifyer": null, "identifyer": 18900, "year": "2018"}, {"autor": "Distantstallion", "date": "2018-04-10 20:20:36", "content": "Should I be concerned about shutter wear for a long photography trip? /!/ I'm going traveling for two years after university and a year or so of hard work to pay for the trip.\n\nI'm planning to bring my Nikon D7200 with a 35mm prime, 10-20 ultrawide, and my monster 55-300 telephoto. Alongside about 4 128gb SD cards, two lightweight HDDs, external flash, aluminium tripod, and whatever online service I can use to create a backup of the photos from anywhere.\n\nI calculated that I'd likely average about 700 images a week upped to the two year, I estimate I'd take  a maximimbetween 90k-100k photos over the two years. \n\nWill my camera mirror wear out before I'm done? I've got 3000 actuations made already And probably another 7k more before I leave to travel. \nI know they're rated for 150k but I'm guessing the failure state begins at 100k. \n\nIs it worth trading for a mirrorless perhaps?\n\nI'm thinking about taking a vintage camera to reduce wear for the more touristy photos, send them back home to develop. It's a lot of extra weight though.  \n\nFor the record I'm not looking for r/ultralight advice, I'm planning my journey specifically with my camera and curated equipment, I've got all the fundementals. \n\n ", "link": "https://www.reddit.com/r/photography/comments/8bb0ap/should_i_be_concerned_about_shutter_wear_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can use to create", "selectorShort": "create", "MarkedSent": "should i be concerned about shutter wear for a long photography trip? /!/ i'm going traveling for two years after university and a year or so of hard work to pay for the trip.\n\ni'm planning to bring my nikon d7200 with a 35mm prime, 10-20 ultrawide, and my monster 55-300 telephoto. alongside about 4 128gb sd cards, two lightweight hdds, external flash, aluminium tripod, and whatever online service -----> i !!!  -----> can !!!  -----> use !!!  -----> to !!!  -----> create !!!  a backup of the photos from anywhere.\n\ni calculated that i'd likely average about 700 images a week upped to the two year, i estimate i'd take  a maximimbetween 90k-100k photos over the two years. \n\nwill my camera mirror wear out before i'm done? i've got 3000 actuations made already and probably another 7k more before i leave to travel. \ni know they're rated for 150k but i'm guessing the failure state begins at 100k. \n\nis it worth trading for a mirrorless perhaps?\n\ni'm thinking about taking a vintage camera to reduce wear for the more touristy photos, send them back home to develop. it's a lot of extra weight though.  \n\nfor the record i'm not looking for r/ultralight advice, i'm planning my journey specifically with my camera and curated equipment, i've got all the fundementals. \n\n ", "sortedWord": "None", "Identifyer": null, "identifyer": 18980, "year": "2018"}, {"autor": "nitinkhannaportland", "date": "2018-03-05 05:33:10", "content": "Creating an Effective Personalization Strategy with Nitin Khanna", "link": "https://www.reddit.com/r/photography/comments/823pkx/creating_an_effective_personalization_strategy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an effective personalization strategy with nitin khanna", "sortedWord": "None", "Identifyer": null, "identifyer": 19780, "year": "2018"}, {"autor": "TheRandomnessOfLife", "date": "2018-05-03 21:05:32", "content": "Looking for some suggestions on cheapish cameras /!/ I am brand new to this, it is currently a hobby with me and my girlfriend that might be rolling over into something more serious so I want to pick up a camera that takes great photos and videos that won't run me $700\\+. At this moment I only have $195 in my Paypal account because every other dime is being saved for our two upcoming concerts, fixing my motorcycle \\(already done saving\\) and buying a house so I'm pretty damn broke right now.\n\nTo be completely straightforward, we have been getting a pretty large following on our adult blogs so we are considering creating more..lots more. But I need to start somewhere so, does anyone have any suggestions for under $200 that isn't just like a regular digital camera you can get anywhere? If I HAVE to go a little higher I will, but I would like it to have the option of attaching a stand or changing the lens when needed. Obviously, all shots will be done in our house and I am already looking up light umbrellas and this big green screen \\(with white and black screens too\\).", "link": "https://www.reddit.com/r/photography/comments/8gts5b/looking_for_some_suggestions_on_cheapish_cameras/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are considering creating", "selectorShort": "create", "MarkedSent": "looking for some suggestions on cheapish cameras /!/ i am brand new to this, it is currently a hobby with me and my girlfriend that might be rolling over into something more serious so i want to pick up a camera that takes great photos and videos that won't run me $700\\+. at this moment i only have $195 in my paypal account because every other dime is being saved for our two upcoming concerts, fixing my motorcycle \\(already done saving\\) and buying a house so i'm pretty damn broke right now.\n\nto be completely straightforward, -----> we !!!  have been getting a pretty large following on our adult blogs so -----> we !!!  -----> are !!!  -----> considering !!!  -----> creating !!!  more..lots more. but i need to start somewhere so, does anyone have any suggestions for under $200 that isn't just like a regular digital camera you can get anywhere? if i have to go a little higher i will, but i would like it to have the option of attaching a stand or changing the lens when needed. obviously, all shots will be done in our house and i am already looking up light umbrellas and this big green screen \\(with white and black screens too\\).", "sortedWord": "None", "Identifyer": null, "identifyer": 20003, "year": "2018"}, {"autor": "Jaybotics", "date": "2018-05-03 19:58:50", "content": "Creating a tight knit Portrait Instagram pod of 15 portrait photographers. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8gt9vs/creating_a_tight_knit_portrait_instagram_pod_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a tight knit portrait instagram pod of 15 portrait photographers. /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 20006, "year": "2018"}, {"autor": "theo_sontag", "date": "2018-05-03 15:26:00", "content": "Best method for collaborative photo album /!/ Hi all, I am working to create a photo book for my son's teacher's retirement. I have a lot of photos \\(300\\) from a lot of people. They are currently located in a Facebook Group album. \n\nMy goal is to, as seamlessly as possible, find the best way to \\(1\\) manage the photo files, captions, and photographer name, and \\(2\\) create a decent photobook uploading the photo with the caption and photographer.\n\nSo far, I've downloaded the photos from FB \\(300 of them\\), and renamed them 1.jpg to 300.jpg. Captions and photographer info have yet to be copied. I'm having difficulty knowing how best to juggle this info.\n\nOn file management, my first thought is to create a spreadsheet with three columns \\(A: Photo #, B: Caption, C: Photographer\\), and then find a site to upload &amp; arrange the photos, then copy/paste the caption info.\n\nI'm feeling overwhelmed by the prospect of a million copy/pastes between websites. I haven't created a book like this, and looking for guidance from some more experienced people. Thanks!", "link": "https://www.reddit.com/r/photography/comments/8gr70b/best_method_for_collaborative_photo_album/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am working to create", "selectorShort": "create", "MarkedSent": "best method for collaborative photo album /!/ hi all, -----> i !!!  -----> am !!!  -----> working !!!  -----> to !!!  -----> create !!!  a photo book for my son's teacher's retirement. i have a lot of photos \\(300\\) from a lot of people. they are currently located in a facebook group album. \n\nmy goal is to, as seamlessly as possible, find the best way to \\(1\\) manage the photo files, captions, and photographer name, and \\(2\\) create a decent photobook uploading the photo with the caption and photographer.\n\nso far, i've downloaded the photos from fb \\(300 of them\\), and renamed them 1.jpg to 300.jpg. captions and photographer info have yet to be copied. i'm having difficulty knowing how best to juggle this info.\n\non file management, my first thought is to create a spreadsheet with three columns \\(a: photo #, b: caption, c: photographer\\), and then find a site to upload &amp; arrange the photos, then copy/paste the caption info.\n\ni'm feeling overwhelmed by the prospect of a million copy/pastes between websites. i haven't created a book like this, and looking for guidance from some more experienced people. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 20025, "year": "2018"}, {"autor": "Kuma2006", "date": "2018-02-08 20:05:29", "content": "Hi, I am a product design student at Walla Walla University in Eastern Washington. I am currently working on my senior project which involves outdoor and sports photography. I need data pertaining to this focus, so I created a short survey. I would greatly appreciate your participation! Thank you!", "link": "https://www.reddit.com/r/photography/comments/7w7of2/hi_i_am_a_product_design_student_at_walla_walla/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi, i am a product design student at walla walla university in eastern washington. i am currently working on my senior project which involves outdoor and sports photography. -----> i !!!  need data pertaining to this focus, so -----> i !!!  -----> created !!!  a short survey. i would greatly appreciate your participation! thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 20350, "year": "2018"}, {"autor": "jghita", "date": "2018-02-11 19:54:56", "content": "After 2 months working on my newly created website, I'm ready for another round for feedback", "link": "https://www.reddit.com/r/photography/comments/7wv37m/after_2_months_working_on_my_newly_created/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my newly created", "selectorShort": "create", "MarkedSent": "after 2 months working on -----> my !!!  -----> newly !!!  -----> created !!!  website, i'm ready for another round for feedback", "sortedWord": "None", "Identifyer": null, "identifyer": 20481, "year": "2018"}, {"autor": "PhantasmagoricGenius", "date": "2018-02-16 15:57:55", "content": "View sunrise, sunset, golden-hour and blue-hour times with Sunrise Companion for Android /!/ If this post breaks any subreddit rules then apologies, feel free to remove it. \n\nHi guys. I've released a new app in the Google Play app store that I hope some of you will be interested in. It's titled Sunrise Companion and it displays sunrise and sunset times (and various other times including golden hour and blue hour) for any location on earth. I know there are some apps out there that already do this, but this is a project I've had my eye on as a good starter project for quite a while, and I've only recently had the opportunity to pursue it. Full transparency, my main motivation for creating such an app is to help boost my portfolio as a developer and start building a presence in the app store. This app is and always will be free, and will never contain ads. A personal goal of this project for me was to create something pure and simple, money is not my motivation.\n\nDevelopment for this app is ongoing, and I hope to add further features (widget and notifications being my priority) in the coming days and weeks.\n\nI would appreciate any feedback, any and all suggestions are welcome. Thanks.\n\nThe Google Play Store link is https://play.google.com/store/apps/details?id=com.macca895.sunriise\n", "link": "https://www.reddit.com/r/photography/comments/7xznbz/view_sunrise_sunset_goldenhour_and_bluehour_times/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me was to create", "selectorShort": "create", "MarkedSent": "view sunrise, sunset, golden-hour and blue-hour times with sunrise companion for android /!/ if this post breaks any subreddit rules then apologies, feel free to remove it. \n\nhi guys. i've released a new app in the google play app store that i hope some of you will be interested in. it's titled sunrise companion and it displays sunrise and sunset times (and various other times including golden hour and blue hour) for any location on earth. i know there are some apps out there that already do this, but this is a project i've had my eye on as a good starter project for quite a while, and i've only recently had the opportunity to pursue it. full transparency, my main motivation for creating such an app is to help boost my portfolio as a developer and start building a presence in the app store. this app is and always will be free, and will never contain ads. a personal goal of this project for -----> me !!!  -----> was !!!  -----> to !!!  -----> create !!!  something pure and simple, money is not my motivation.\n\ndevelopment for this app is ongoing, and i hope to add further features (widget and notifications being my priority) in the coming days and weeks.\n\ni would appreciate any feedback, any and all suggestions are welcome. thanks.\n\nthe google play store link is https://play.google.com/store/apps/details?id=com.macca895.sunriise\n", "sortedWord": "None", "Identifyer": null, "identifyer": 20539, "year": "2018"}, {"autor": "thespy_", "date": "2018-06-05 20:58:01", "content": "Jewelry Product Photography: RAW or JPEG? /!/ Hello, \n\nI am about to begin a jewelry product photography gig, I will obviously be working in a controlled “studio” environment. That being said, would it be best for me to shoot in RAW, or JPEG? I always shoot in RAW for my personal photos, but I’m not sure what would be best here.\n\n(I am using Lightroom, by the way)\n\nIf I shoot in RAW, should I just create a batch preset for editing and export them all with that preset applied? I’m guessing that I won’t have time to go through and tweak each RAW individually. \n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/8ouhuz/jewelry_product_photography_raw_or_jpeg/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just create", "selectorShort": "create", "MarkedSent": "jewelry product photography: raw or jpeg? /!/ hello, \n\ni am about to begin a jewelry product photography gig, i will obviously be working in a controlled “studio” environment. that being said, would it be best for me to shoot in raw, or jpeg? i always shoot in raw for my personal photos, but i’m not sure what would be best here.\n\n(-----> i !!!  am using lightroom, by the way)\n\nif -----> i !!!  shoot in raw, should -----> i !!!  -----> just !!!  -----> create !!!  a batch preset for editing and export them all with that preset applied? i’m guessing that i won’t have time to go through and tweak each raw individually. \n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 21231, "year": "2018"}, {"autor": "RaptorBandito", "date": "2018-05-31 21:36:24", "content": "Reflective surface question /!/ I was wondering if anyone can help me with a problem I have. I'm looking for a sheet of something cheap and reflective I can put objects on to get that reflective look for some photo ideas I want to create. Would a white erase board be good enough or is there anything else someone can suggest. Thank you in advance", "link": "https://www.reddit.com/r/photography/comments/8nmbpy/reflective_surface_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "reflective surface question /!/ i was wondering if anyone can help me with a problem i have. -----> i !!! 'm looking for a sheet of something cheap and reflective -----> i !!!  can put objects on -----> to !!!  get that reflective look for some photo ideas -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!! . would a white erase board be good enough or is there anything else someone can suggest. thank you in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 21441, "year": "2018"}, {"autor": "Canvasbubble", "date": "2018-06-26 11:19:16", "content": "Create Canvas Wall Art to Give Your Wall Attention Grabbing Look /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8tz794/create_canvas_wall_art_to_give_your_wall/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  canvas wall art to give your wall attention grabbing look /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 21803, "year": "2018"}, {"autor": "neshi3", "date": "2018-08-17 12:05:19", "content": "Anyone know how to create a photo index of my photo folder? /!/ I need to create a photo index of all my images to print them.\n\nI have approximately 20-30.000 pictures organized in folders with proper names.\n\nI have used the app Snap2img to print them, but I have problems with images not being rotated properly, they look good in windows explorer or in Photoshop, but the software does not recognize the proper orientation of the images.\n\nWhat I need, a way to create a index, with the folder name for each \"album\" as the title and under each image the image name.\n\nNo idea how I can create that with other software.", "link": "https://www.reddit.com/r/photography/comments/981oya/anyone_know_how_to_create_a_photo_index_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "anyone know how to create a photo index of my photo folder? /!/ -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a photo index of all my images -----> to !!!  print them.\n\ni have approximately 20-30.000 pictures organized in folders with proper names.\n\ni have used the app snap2img to print them, but i have problems with images not being rotated properly, they look good in windows explorer or in photoshop, but the software does not recognize the proper orientation of the images.\n\nwhat i need, a way to create a index, with the folder name for each \"album\" as the title and under each image the image name.\n\nno idea how i can create that with other software.", "sortedWord": "None", "Identifyer": null, "identifyer": 22957, "year": "2018"}, {"autor": "LongLifePipsi", "date": "2018-08-22 00:27:27", "content": "Pro photographers of reddit, im starting a photography IG page /!/ Hi, im starting to like photography, so i decided to show my photos on Instagram, i created an ig account today would some of you mind to check it out? And give me your feedback, i would like some tips if possible, sorry for my wacky english.\n\n\nwww.instagram.com/tiago_photo_shoot/\n\n", "link": "https://www.reddit.com/r/photography/comments/998mr8/pro_photographers_of_reddit_im_starting_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "pro photographers of reddit, im starting a photography ig page /!/ hi, -----> i !!! m starting to like photography, so -----> i !!!  decided to show my photos on instagram, -----> i !!!  -----> created !!!  an ig account today would some of you mind to check it out? and give me your feedback, i would like some tips if possible, sorry for my wacky english.\n\n\nwww.instagram.com/tiago_photo_shoot/\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 22995, "year": "2018"}, {"autor": "zeexik", "date": "2018-08-21 12:34:16", "content": "Is it wrong to \"want\" validation for your work through Instagram? /!/ I'm really big on authenticity and gaining followers organically. For a while I didn't even caption or tag my photos because I wanted the photography to speak for itself. \n\nBut I look at my follower count and I get sad. I look at how many people like my posts and I get sad. \n\nBut then I get confused! I think \"Am I doing this for likes and followers? No. I'm doing this because I enjoy nice pictures and visuals and edits and I want to create them and share them.\" But the lack of activity and interaction makes me believe that my work isn't good enough or just sucks outright. \n\nFriends will come up to me in person and tell me how much they love my work. But I feel like they're biased because they're my friends. \n\nI've noticed people who have a big following because of their personality and real life network will often post lower quality pictures, but because they're well known and popular outside of instagram, they'll receive tons of support. \n\nShould I succumb to the stupid Instagram craze and start following SEO procedures, hashtags, data based scheduling of posts and all that jazz? Or should I just keep doing what I'm doing (which is just posting images that I like that I created) and not worry about it at all? \n\nI've been doing this for 7 years and although I've gotten better, I don't feel like my stuff is good enough yet because of the lack of attention it receives. I don't know if it's because I've been shooting with a crop sensor this entire time? I don't know if it's because my angles suck, composition sucks, editing sucks, or what?\n\nBut shouldn't it be that is an interpretation of what I want it to be? It is my version of photography after all. It is MY art. \n\nI just really wish I knew where I stood in terms of photography and where I could improve, how I can improve my outlook on it, and what I should be doing to grow my art in general. But the lack of eyes on it makes me thing that it's just unnoticed garbage. ", "link": "https://www.reddit.com/r/photography/comments/992r6l/is_it_wrong_to_want_validation_for_your_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "is it wrong to \"want\" validation for your work through instagram? /!/ i'm really big on authenticity and gaining followers organically. for a while i didn't even caption or tag my photos because i wanted the photography to speak for itself. \n\nbut i look at my follower count and i get sad. i look at how many people like my posts and i get sad. \n\nbut then i get confused! i think \"am i doing this for likes and followers? no. -----> i !!! 'm doing this because -----> i !!!  enjoy nice pictures and visuals and edits and -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  them and share them.\" but the lack of activity and interaction makes me believe that my work isn't good enough or just sucks outright. \n\nfriends will come up to me in person and tell me how much they love my work. but i feel like they're biased because they're my friends. \n\ni've noticed people who have a big following because of their personality and real life network will often post lower quality pictures, but because they're well known and popular outside of instagram, they'll receive tons of support. \n\nshould i succumb to the stupid instagram craze and start following seo procedures, hashtags, data based scheduling of posts and all that jazz? or should i just keep doing what i'm doing (which is just posting images that i like that i created) and not worry about it at all? \n\ni've been doing this for 7 years and although i've gotten better, i don't feel like my stuff is good enough yet because of the lack of attention it receives. i don't know if it's because i've been shooting with a crop sensor this entire time? i don't know if it's because my angles suck, composition sucks, editing sucks, or what?\n\nbut shouldn't it be that is an interpretation of what i want it to be? it is my version of photography after all. it is my art. \n\ni just really wish i knew where i stood in terms of photography and where i could improve, how i can improve my outlook on it, and what i should be doing to grow my art in general. but the lack of eyes on it makes me thing that it's just unnoticed garbage. ", "sortedWord": "None", "Identifyer": null, "identifyer": 23055, "year": "2018"}, {"autor": "Gugaomelhor", "date": "2018-08-27 10:57:35", "content": "Spot/place Chooser App/Website /!/ Hello Reddit!\nI was wondering if there is an app or a website where you basically have Google Maps (with pinning options, lists, etc), overlayed with any weather radar and a lightpollution map. It would be a great tool especially for astrophotography.\nIf this doesn't already exist, I'd love to create something like this myself, but I have no idea where to begin (I have no experience with programming or app development) Any ideas?\n", "link": "https://www.reddit.com/r/photography/comments/9anya9/spotplace_chooser_appwebsite/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'd love to create", "selectorShort": "create", "MarkedSent": "spot/place chooser app/website /!/ hello reddit!\ni was wondering if there is an app or a website where you basically have google maps (with pinning options, lists, etc), overlayed with any weather radar and a lightpollution map. it would be a great tool especially for astrophotography.\nif this doesn't already exist, -----> i !!! -----> 'd !!!  -----> love !!!  -----> to !!!  -----> create !!!  something like this myself, but -----> i !!!  have no idea where -----> to !!!  begin (-----> i !!!  have no experience with programming or app development) any ideas?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 23121, "year": "2018"}, {"autor": "lowpockets", "date": "2018-08-26 19:41:36", "content": "Plug in for sort by exported in Lightroom? /!/ Just wondering if anyone has came across a plug in that would allow me to create a smart album based on if an image has been exported or not. \n\nI have folder upon folder of images I have shot for clients and all the rejects are sitting there and this just seems like an easy way to decipher what has been sent to clients and what can be dumped?\n\nIf anyone reading this is a plug in developer would this be a big build? Its something Id happily pay for at this stage. \n ", "link": "https://www.reddit.com/r/photography/comments/9aic6i/plug_in_for_sort_by_exported_in_lightroom/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "plug in for sort by exported in lightroom? /!/ just wondering if anyone has came across a plug in that would allow -----> me !!!  -----> to !!!  -----> create !!!  a smart album based on if an image has been exported or not. \n\ni have folder upon folder of images i have shot for clients and all the rejects are sitting there and this just seems like an easy way to decipher what has been sent to clients and what can be dumped?\n\nif anyone reading this is a plug in developer would this be a big build? its something id happily pay for at this stage. \n ", "sortedWord": "None", "Identifyer": null, "identifyer": 23167, "year": "2018"}, {"autor": "AgingMoss", "date": "2018-09-06 22:01:19", "content": "Creating a vanishing point / rough 3D mesh of my photo in Photoshop? /!/ Hi all, sorry if this is a bit off topic.\n\nFor a college project, I need to put a few simple 3D models in a photo I've taken. It sounds like a simple task, just use Vanishing Point or Camera Calibrator in Cinema 4D. However the problem is my photograph is of a lake (reservoir) surrounded by hills. I only need to get the ground / floor (the lake surface) right to put stuff on that, however there is no rectangular reference I can use. Is it just going to be a matter of trail and error? If so, do you have any tips on going about this?\n\nAdditionally, if it matters, my photograph is a merge of several photographs using perspective merge for a higher res photo, so I'm not sure if that will mess with the focal length calculations?\n\nCheers", "link": "https://www.reddit.com/r/photography/comments/9dnmbt/creating_a_vanishing_point_rough_3d_mesh_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a vanishing point / rough 3d mesh of my photo in photoshop? /!/ hi all, sorry if this is a bit off topic.\n\nfor a college project, i need to put a few simple 3d models in a photo i've taken. it sounds like a simple task, just use vanishing point or camera calibrator in cinema 4d. however the problem is my photograph is of a lake (reservoir) surrounded by hills. i only need to get the ground / floor (the lake surface) right to put stuff on that, however there is no rectangular reference i can use. is it just going to be a matter of trail and error? if so, do you have any tips on going about this?\n\nadditionally, if it matters, my photograph is a merge of several photographs using perspective merge for a higher res photo, so i'm not sure if that will mess with the focal length calculations?\n\ncheers", "sortedWord": "None", "Identifyer": null, "identifyer": 23486, "year": "2018"}, {"autor": "LessRisk43", "date": "2018-09-14 08:32:01", "content": "I Will Create 120 High Authority Dofollow Backlinks For You /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9fqab5/i_will_create_120_high_authority_dofollow/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> will !!!  -----> create !!!  120 high authority dofollow backlinks for you /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 23573, "year": "2018"}, {"autor": "scottklarr", "date": "2018-09-23 03:10:08", "content": "I created a light box for my wife's jewelry /!/ I decided to make a light box to save money... Ended up spending more money than if I just bought one off Amazon. I'm pretty happy with the way it turned out, though.\n\n3 panels, each 24x18\", about 2.5lbs and independently dimmable. I first intended to just use frosted glass cling to diffuse the light but it didn't do good enough of a job so I added a layer of tissue paper. It will be interesting to see how long it holds up! I need to find a better material for the back drop. Right now it's just posterboard but it's not long enough on its own, and it gets marked up pretty easily.\n\n[https://imgur.com/a/DEADEPI](https://imgur.com/a/DEADEPI)", "link": "https://www.reddit.com/r/photography/comments/9i5fcz/i_created_a_light_box_for_my_wifes_jewelry/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a light box for my wife's jewelry /!/ i decided to make a light box to save money... ended up spending more money than if i just bought one off amazon. i'm pretty happy with the way it turned out, though.\n\n3 panels, each 24x18\", about 2.5lbs and independently dimmable. i first intended to just use frosted glass cling to diffuse the light but it didn't do good enough of a job so i added a layer of tissue paper. it will be interesting to see how long it holds up! i need to find a better material for the back drop. right now it's just posterboard but it's not long enough on its own, and it gets marked up pretty easily.\n\n[https://imgur.com/a/deadepi](https://imgur.com/a/deadepi)", "sortedWord": "None", "Identifyer": null, "identifyer": 23842, "year": "2018"}, {"autor": "thenerdyphoto", "date": "2018-10-03 00:12:58", "content": "Do you know what your presets do? /!/ I've seen so many posts (here, on FB, and other forums) about people either A) looking for presets because they're shooting some type of photography they're not used to or B) wondering what 'happened' to their photo when what 'happened' was that they applied a preset and they don't know how that preset actually interacts with their image (e.g. why does this dress look purple?) \n\nI worry that too many photographers are unaware what their shortcuts actually do...\n\n(To be fully transparent, I do use presets that I created myself in my own work...)", "link": "https://www.reddit.com/r/photography/comments/9kw50t/do_you_know_what_your_presets_do/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "do you know what your presets do? /!/ -----> i !!! 've seen so many posts (here, on fb, and other forums) about people either a) looking for presets because they're shooting some type of photography they're not used to or b) wondering what 'happened' to their photo when what 'happened' was that they applied a preset and they don't know how that preset actually interacts with their image (e.g. why does this dress look purple?) \n\n-----> i !!!  worry that too many photographers are unaware what their shortcuts actually do...\n\n(to be fully transparent, -----> i !!!  do use presets that -----> i !!!  -----> created !!!  myself in my own work...)", "sortedWord": "None", "Identifyer": null, "identifyer": 23904, "year": "2018"}, {"autor": "Dogs0fwar", "date": "2018-10-21 02:09:42", "content": "Best online photo storage full size images and secure? /!/ Hi\nI’ve read about Amazon, Google, and ICloud for photo storage services.\n\nI use an IPhone and I am looking for someplace else to store photos aside from ICloud, even if it’s just for a backup, but also wouldn’t mind if I could create albums and so forth to view them. \n\nI don’t want to have the photos compressed which I believe Google does unless you pay.\n\nI don’t want the photos to be viewable unless you’re logged in, which I know is common, but some services have a share publicly option, and I’d like to be able to secure certain albums so that they’re not viewable unless I went and entered a code or something. \n\n", "link": "https://www.reddit.com/r/photography/comments/9pzy3i/best_online_photo_storage_full_size_images_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "best online photo storage full size images and secure? /!/ hi\ni’ve read about amazon, google, and icloud for photo storage services.\n\n-----> i !!!  use an iphone and -----> i !!!  am looking for someplace else to store photos aside from icloud, even if it’s just for a backup, but also wouldn’t mind if -----> i !!!  -----> could !!!  -----> create !!!  albums and so forth to view them. \n\ni don’t want to have the photos compressed which i believe google does unless you pay.\n\ni don’t want the photos to be viewable unless you’re logged in, which i know is common, but some services have a share publicly option, and i’d like to be able to secure certain albums so that they’re not viewable unless i went and entered a code or something. \n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 24357, "year": "2018"}, {"autor": "Jourdy288", "date": "2018-10-20 20:12:44", "content": "Creating better macro photos with Don Komarechka", "link": "https://www.reddit.com/r/photography/comments/9pxd1f/creating_better_macro_photos_with_don_komarechka/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  better macro photos with don komarechka", "sortedWord": "None", "Identifyer": null, "identifyer": 24374, "year": "2018"}, {"autor": "bobdaninja", "date": "2018-10-25 01:39:36", "content": "Technical help for Photobooth /!/ My friend's street shuts down for Halloween, and the whole neighborhood comes out and does a big block party. A lot of the kids are from lower income families, so the hot dogs they get might be their meal for the day. We were talking about setting up a photo booth where the kids can come in costume and have their photo taken. Bust out the strobes, take good photos on non-iphones, etc. We want to give the photos to the famlies as a gift, no charge. But we're having logistical issues.\n\nI have a zenfolio website where I can deliver digital prints to people no problem. I can create password protected galleries, etc. We thought about getting little cards like at Disneyland or races that have the website and can indicate people's photos. My issue is, I don't want to put a bunch of kids' photos on the web that anyone can download. I also don't want to have to spend a day creating 50-100 password protected galleries. I'm open to suggestions, but I'm not sure how to accomplish this, or if it's possible.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9r5vys/technical_help_for_photobooth/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "technical help for photobooth /!/ my friend's street shuts down for halloween, and the whole neighborhood comes out and does a big block party. a lot of the kids are from lower income families, so the hot dogs they get might be their meal for the day. we were talking about setting up a photo booth where the kids can come in costume and have their photo taken. bust out the strobes, take good photos on non-iphones, etc. we want to give the photos to the famlies as a gift, no charge. but we're having logistical issues.\n\ni have a zenfolio website where i can deliver digital prints to people no problem. -----> i !!!  -----> can !!!  -----> create !!!  password protected galleries, etc. we thought about getting little cards like at disneyland or races that have the website and can indicate people's photos. my issue is, i don't want to put a bunch of kids' photos on the web that anyone can download. i also don't want to have to spend a day creating 50-100 password protected galleries. i'm open to suggestions, but i'm not sure how to accomplish this, or if it's possible.\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 24408, "year": "2018"}, {"autor": "Nroak", "date": "2018-11-15 23:45:16", "content": "Advertising Agency wants to buy my photos, how much to charge? /!/ I’m web developer, but in college I did photography as well and still have that work on the internet.\n\nRecently an agency contacted me about buying a few pictures out of a series I created a few years ago.\n\nI think they are interested in purchasing three of them. The final product will be flyers, posters, and a brochure run of ~50,000. I think though they are just interested in showing the pictures initially as a part of the pitch, but may be interested in using them in the final product as well. \n\nHow much should I charge for just using it in the pitch, how about the final run?\n\nHow does that price change if they want exclusive rights?\n\nOn one hand it’s work from years ago that I didn’t expect to make anything off of, but on the other hand it’s pretty unique work that they came to me for.\n\nAny advice is appreciated.", "link": "https://www.reddit.com/r/photography/comments/9xgnz8/advertising_agency_wants_to_buy_my_photos_how/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "advertising agency wants to buy my photos, how much to charge? /!/ i’m web developer, but in college i did photography as well and still have that work on the internet.\n\nrecently an agency contacted me about buying a few pictures out of a series -----> i !!!  -----> created !!!  a few years ago.\n\ni think they are interested in purchasing three of them. the final product will be flyers, posters, and a brochure run of ~50,000. i think though they are just interested in showing the pictures initially as a part of the pitch, but may be interested in using them in the final product as well. \n\nhow much should i charge for just using it in the pitch, how about the final run?\n\nhow does that price change if they want exclusive rights?\n\non one hand it’s work from years ago that i didn’t expect to make anything off of, but on the other hand it’s pretty unique work that they came to me for.\n\nany advice is appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 24933, "year": "2018"}, {"autor": "zorken99", "date": "2018-12-05 09:22:43", "content": "Creating a theme on Instagram /!/ So this weekend I was in Kiev and I wanted to take some pictures for instagram. I want to have a theme on my posts but im not sure how I should do it. I started editing in lightroom recently but im not so good yet. But anyways here are some pictures where I really tried to pop out the blue colours in the photographs. Even if they are all blue they still don't look similiar. tips? What other styles are there to instagram feeds?\n\n&amp;#x200B;\n\n[https://gyazo.com/3159fb36f9a1c1a925db82df747cf2d2](https://gyazo.com/3159fb36f9a1c1a925db82df747cf2d2)\n\n[https://gyazo.com/b46927965a7cfe3432ccf30738264172](https://gyazo.com/b46927965a7cfe3432ccf30738264172)\n\n[https://gyazo.com/b676ad112104728745586a46de5e3518](https://gyazo.com/b676ad112104728745586a46de5e3518)\n\n[https://gyazo.com/9b5ade331ca81b74b42f6ce8a0cae2df](https://gyazo.com/9b5ade331ca81b74b42f6ce8a0cae2df)\n\n[https://gyazo.com/98690ab676a226500278ff8024e93176](https://gyazo.com/98690ab676a226500278ff8024e93176)\n\n[https://gyazo.com/728e2a155528067f6e9153913a61a2f6](https://gyazo.com/728e2a155528067f6e9153913a61a2f6)", "link": "https://www.reddit.com/r/photography/comments/a3aqa4/creating_a_theme_on_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a theme on instagram /!/ so this weekend i was in kiev and i wanted to take some pictures for instagram. i want to have a theme on my posts but im not sure how i should do it. i started editing in lightroom recently but im not so good yet. but anyways here are some pictures where i really tried to pop out the blue colours in the photographs. even if they are all blue they still don't look similiar. tips? what other styles are there to instagram feeds?\n\n&amp;#x200b;\n\n[https://gyazo.com/3159fb36f9a1c1a925db82df747cf2d2](https://gyazo.com/3159fb36f9a1c1a925db82df747cf2d2)\n\n[https://gyazo.com/b46927965a7cfe3432ccf30738264172](https://gyazo.com/b46927965a7cfe3432ccf30738264172)\n\n[https://gyazo.com/b676ad112104728745586a46de5e3518](https://gyazo.com/b676ad112104728745586a46de5e3518)\n\n[https://gyazo.com/9b5ade331ca81b74b42f6ce8a0cae2df](https://gyazo.com/9b5ade331ca81b74b42f6ce8a0cae2df)\n\n[https://gyazo.com/98690ab676a226500278ff8024e93176](https://gyazo.com/98690ab676a226500278ff8024e93176)\n\n[https://gyazo.com/728e2a155528067f6e9153913a61a2f6](https://gyazo.com/728e2a155528067f6e9153913a61a2f6)", "sortedWord": "None", "Identifyer": null, "identifyer": 24994, "year": "2018"}, {"autor": "cubs108108", "date": "2018-12-17 23:48:09", "content": "File Restore Help /!/ I thought I copied a bunch of pictures to my external hard drive from my micro SD card and I actually just created shortcuts. I then deleted the files on my micro SD. Is there any way to restore them? Thanks", "link": "https://www.reddit.com/r/photography/comments/a75fhd/file_restore_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i actually just created", "selectorShort": "create", "MarkedSent": "file restore help /!/ i thought i copied a bunch of pictures to my external hard drive from my micro sd card and -----> i !!!  -----> actually !!!  -----> just !!!  -----> created !!!  shortcuts. i then deleted the files on my micro sd. is there any way to restore them? thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 25445, "year": "2018"}, {"autor": "Sheltac", "date": "2018-12-17 17:50:07", "content": "I created an open-source image processing script to deflicker timelapses. Check it out!", "link": "https://www.reddit.com/r/photography/comments/a721lz/i_created_an_opensource_image_processing_script/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  an open-source image processing script to deflicker timelapses. check it out!", "sortedWord": "None", "Identifyer": null, "identifyer": 25471, "year": "2018"}, {"autor": "schnipdip", "date": "2018-11-26 16:26:59", "content": "I'm not sure this is welcomed here, but I created a open community forum for photographers to meet, share gear, collaborate, share knowledge, etc. /!/ I just started hosting a free forum, it isn't professional by any sense of the word, but I wanted a place to meet people who want to share knowledge and gear. There are a lot of people who are interested in learning new equipment or even styles, but don't have the gear to do it. This was the main idea to starting it.   \n\n\nif you're interested or want to leave feedback, here is the link.  \n\n\n[http://photocommunity.boardhost.com/index.php](http://photocommunity.boardhost.com/index.php)", "link": "https://www.reddit.com/r/photography/comments/a0kt2f/im_not_sure_this_is_welcomed_here_but_i_created_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm not sure this is welcomed here, but -----> i !!!  -----> created !!!  a open community forum for photographers to meet, share gear, collaborate, share knowledge, etc. /!/ i just started hosting a free forum, it isn't professional by any sense of the word, but i wanted a place to meet people who want to share knowledge and gear. there are a lot of people who are interested in learning new equipment or even styles, but don't have the gear to do it. this was the main idea to starting it.   \n\n\nif you're interested or want to leave feedback, here is the link.  \n\n\n[http://photocommunity.boardhost.com/index.php](http://photocommunity.boardhost.com/index.php)", "sortedWord": "None", "Identifyer": null, "identifyer": 25540, "year": "2018"}, {"autor": "coloradofaces", "date": "2018-11-26 03:32:39", "content": "What Really is a Photograph? And What’s With All the Surveillance? /!/ I went to my photo lab this week to pick up some black and white and color prints of my Dad and me sitting at a pub and restaurant on my last trip to Philly.  I always pick up small black and brown wood frames at yard sales and thrift stores whenever I find them to keep on hand, and these photos I framed and hung in my house to keep him close since we live 2000 miles apart.\n\nThen I did a Costco run for some groceries and there were all these people buying 5TB and 8TB hard drives, and signs for **'backing up your photos',** which got me thinking, \"What if the backup fails?\"  Say you have everything saved in duplicate, but then tragedy strikes--twice!  Ok, triplicate--doesn't that sort of guarantee you won't lose the photos?  Well, perhaps.  But...\n\n###### Do you actually have anything?  What is with all these hard drives?  Where are the photos?\n\nThe other hot items at Costco were a three-camera home security system, and a doorbell-cam, and I watched people spend hundreds of dollars to create surveillance for their homes and shook my head.\n\nWhat are we doing?  Are we obsessed with all this surveillance?  Digital images that go nowhere.\n\nNew tech is enticing, but I don't need technology to have a photo of my Dad and me in the house.  I don't need terabytes of storage to make sure I don't lose it.  It's right there, on the wall.\n\nIt's technology right out of the 19th century, and it still works to this day!\n\nAs you may know, I'm a professional photographer and I photograph families and individuals and consider portraits the most important work I do.\n\nBut to get people to order a family portrait, or a portrait of their parents or grandparents, frankly, it's difficult.  Only some of the more affluent folks choose to spend for the quality that I can create.  The rest, they figure they can shoot some with their phone, save the cash, then never bother to print anything.   Why spend on photography?  Why print?\n\nSo it's a phone snap.  I guess after a while it's 'fire up the next hard drive, time for another backup'.\n\nWhat are all these backups good for?\n\n###### When is anyone ever going to use these backed-up files and print a photo?\n\nDo families really gather around the computer to look at photos of Grandpa and Grandma?\n\nI don't think so.\n\nThose phone snapshots are like film negatives that were made and never processed or if they were developed, never printed.  They're a step toward a photo, but not a photo.\n\nThey're essentially *nothing*.\n\n###### Maybe just quit taking the snaps and backing them up--they're useless.\n\nI think about how many Americans there are, and how many households are full of these high-tech gadgets.\n\nHard drives--backups and *backups of backups* full of images never seen.\n\nSurveillance systems tracking our homes like a police state.\n\nAlexa and Google listening to our every move.\n\nBut people refusing to spend on an artist who can create a lasting portrait of a family member who may not be with them much longer.  Dismissing the importance of quality family portraits that are printed and displayed.\n\n*\"I've got my phone.  Which reminds me, I need a new phone--I heard they have a new camera...\"*  What good is it?  You never make a photograph?\n\nFamily photographs are historical documents.  Printing your photographs is the one way to keep family members alive after they pass, and keep them in our homes, living with us, with printing that is done with a very old technology that is guaranteed to last.\n\nWithout the need for electricity or Siri to access.\n\nIt's a real photograph.  It's so simple, somehow people miss it.", "link": "https://www.reddit.com/r/photography/comments/a0fmi3/what_really_is_a_photograph_and_whats_with_all/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "what really is a photograph? and what’s with all the surveillance? /!/ i went to my photo lab this week to pick up some black and white and color prints of my dad and me sitting at a pub and restaurant on my last trip to philly.  i always pick up small black and brown wood frames at yard sales and thrift stores whenever i find them to keep on hand, and these photos i framed and hung in my house to keep him close since we live 2000 miles apart.\n\nthen i did a costco run for some groceries and there were all these people buying 5tb and 8tb hard drives, and signs for **'backing up your photos',** which got me thinking, \"what if the backup fails?\"  say you have everything saved in duplicate, but then tragedy strikes--twice!  ok, triplicate--doesn't that sort of guarantee you won't lose the photos?  well, perhaps.  but...\n\n###### do you actually have anything?  what is with all these hard drives?  where are the photos?\n\nthe other hot items at costco were a three-camera home security system, and a doorbell-cam, and i watched people spend hundreds of dollars to create surveillance for their homes and shook my head.\n\nwhat are we doing?  are we obsessed with all this surveillance?  digital images that go nowhere.\n\nnew tech is enticing, but i don't need technology to have a photo of my dad and me in the house.  i don't need terabytes of storage to make sure i don't lose it.  it's right there, on the wall.\n\nit's technology right out of the 19th century, and it still works to this day!\n\nas you may know, i'm a professional photographer and i photograph families and individuals and consider portraits the most important work i do.\n\nbut to get people to order a family portrait, or a portrait of their parents or grandparents, frankly, it's difficult.  only some of the more affluent folks choose to spend for the quality that -----> i !!!  -----> can !!!  -----> create !!! .  the rest, they figure they can shoot some with their phone, save the cash, then never bother to print anything.   why spend on photography?  why print?\n\nso it's a phone snap.  i guess after a while it's 'fire up the next hard drive, time for another backup'.\n\nwhat are all these backups good for?\n\n###### when is anyone ever going to use these backed-up files and print a photo?\n\ndo families really gather around the computer to look at photos of grandpa and grandma?\n\ni don't think so.\n\nthose phone snapshots are like film negatives that were made and never processed or if they were developed, never printed.  they're a step toward a photo, but not a photo.\n\nthey're essentially *nothing*.\n\n###### maybe just quit taking the snaps and backing them up--they're useless.\n\ni think about how many americans there are, and how many households are full of these high-tech gadgets.\n\nhard drives--backups and *backups of backups* full of images never seen.\n\nsurveillance systems tracking our homes like a police state.\n\nalexa and google listening to our every move.\n\nbut people refusing to spend on an artist who can create a lasting portrait of a family member who may not be with them much longer.  dismissing the importance of quality family portraits that are printed and displayed.\n\n*\"i've got my phone.  which reminds me, i need a new phone--i heard they have a new camera...\"*  what good is it?  you never make a photograph?\n\nfamily photographs are historical documents.  printing your photographs is the one way to keep family members alive after they pass, and keep them in our homes, living with us, with printing that is done with a very old technology that is guaranteed to last.\n\nwithout the need for electricity or siri to access.\n\nit's a real photograph.  it's so simple, somehow people miss it.", "sortedWord": "None", "Identifyer": null, "identifyer": 25590, "year": "2018"}, {"autor": "heyimchandler", "date": "2018-12-26 17:23:13", "content": "How do we create meaningful travel photography without exoticising? /!/ This is always a topic of conversation that comes up between myself and other photographers, but with the rise of Instagram travel photography, I feel like this issue has definitely moved into a broader mainstream question. \n\n&amp;#x200B;\n\nIn short, it's always been an issue with me while traveling, as I struggle with the guilt of taking photos that seem shallow and that romanticize/exoticize other people and ways of life, even if that's not my intention. I won't name names, but I also see more and more photographers on Instagram (a lot of them with hundreds of thousands of followers) traveling to impoverished  countries, and taking photos with no real purpose other than to post to instagram. For instance, a close up portrait of an old man, or photos of random people working on the streets. They claim they are 'documenting', however the photos have no cohesion and tell no real story. The photos are not bad, but there's just something that feels off to me about them, especially when these photographers are presenting them to such a large audience for gain.\n\n&amp;#x200B;\n\nWhere do we draw the line with this? When traveling to impoverished places, is anything between an uncreative snapshot and an editorial/journalistic story inappropriate? Or am I just being too sensitive?", "link": "https://www.reddit.com/r/photography/comments/a9qe4r/how_do_we_create_meaningful_travel_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "how do -----> we !!!  -----> create !!!  meaningful travel photography without exoticising? /!/ this is always a topic of conversation that comes up between myself and other photographers, but with the rise of instagram travel photography, i feel like this issue has definitely moved into a broader mainstream question. \n\n&amp;#x200b;\n\nin short, it's always been an issue with me while traveling, as i struggle with the guilt of taking photos that seem shallow and that romanticize/exoticize other people and ways of life, even if that's not my intention. i won't name names, but i also see more and more photographers on instagram (a lot of them with hundreds of thousands of followers) traveling to impoverished  countries, and taking photos with no real purpose other than to post to instagram. for instance, a close up portrait of an old man, or photos of random people working on the streets. they claim they are 'documenting', however the photos have no cohesion and tell no real story. the photos are not bad, but there's just something that feels off to me about them, especially when these photographers are presenting them to such a large audience for gain.\n\n&amp;#x200b;\n\nwhere do we draw the line with this? when traveling to impoverished places, is anything between an uncreative snapshot and an editorial/journalistic story inappropriate? or am i just being too sensitive?", "sortedWord": "None", "Identifyer": null, "identifyer": 25833, "year": "2018"}, {"autor": "Jamie_Moriarty", "date": "2018-12-26 09:51:51", "content": "Need help creating a Time Lapse on windows /!/ So my boss has decided he wants to start making Time Lapses of our projects. Really cool idea but now it's on me to figure out how to make them. He used a GoPro and now I have a folder with 35805 photo's (JPG) on my Windows laptop. It has to become a video suitable for posting on our website and it will be presented to our clients during the opening with a beamer+screen.\n\nThe photo's are not in sequence for some reason. Highly annoying as that seems to decrease my options, but renaming 35805 photo's?\n\nI have access to the full Adobe suit but all the tutorials I could find are talking about photo's in sequence. I tried to get it to work in Premiere anyways but it hasn't been working out. Not to mention loading all these photo's taking forever.\n\nI tried using the GoPro software but that doesn't want to sync all the pictures, not from the GoPro directly and not from the folder I created. \n\nSomeone PLEASE help me.\n", "link": "https://www.reddit.com/r/photography/comments/a9ncdt/need_help_creating_a_time_lapse_on_windows/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "need help creating a time lapse on windows /!/ so my boss has decided he wants to start making time lapses of our projects. really cool idea but now it's on me to figure out how to make them. he used a gopro and now i have a folder with 35805 photo's (jpg) on my windows laptop. it has to become a video suitable for posting on our website and it will be presented to our clients during the opening with a beamer+screen.\n\nthe photo's are not in sequence for some reason. highly annoying as that seems to decrease my options, but renaming 35805 photo's?\n\ni have access to the full adobe suit but all the tutorials i could find are talking about photo's in sequence. i tried to get it to work in premiere anyways but it hasn't been working out. not to mention loading all these photo's taking forever.\n\n-----> i !!!  tried using the gopro software but that doesn't want to sync all the pictures, not from the gopro directly and not from the folder -----> i !!!  -----> created !!! . \n\nsomeone please help me.\n", "sortedWord": "None", "Identifyer": null, "identifyer": 25863, "year": "2018"}, {"autor": "heyitsty", "date": "2018-03-15 03:37:20", "content": "Create your own vinatge print", "link": "https://www.reddit.com/r/photography/comments/84jkfu/create_your_own_vinatge_print/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  your own vinatge print", "sortedWord": "None", "Identifyer": null, "identifyer": 26898, "year": "2018"}, {"autor": "mhaustria", "date": "2018-03-17 23:15:03", "content": "I created a macro collodion wet plate with two large format cameras - the snowdrop", "link": "https://www.reddit.com/r/photography/comments/857hh1/i_created_a_macro_collodion_wet_plate_with_two/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a macro collodion wet plate with two large format cameras - the snowdrop", "sortedWord": "None", "Identifyer": null, "identifyer": 27197, "year": "2018"}, {"autor": "shian243", "date": "2018-04-28 16:45:06", "content": "Creating captions for photo contests/submissions, conjure a story or be honest? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8fl2f4/creating_captions_for_photo_contestssubmissions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  captions for photo contests/submissions, conjure a story or be honest? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 27827, "year": "2018"}, {"autor": "nibaneze", "date": "2018-04-21 14:57:09", "content": "Creating Soft Light In Small Spaces: The Breakdown with Miguel Quiles", "link": "https://www.reddit.com/r/photography/comments/8dw8hm/creating_soft_light_in_small_spaces_the_breakdown/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  soft light in small spaces: the breakdown with miguel quiles", "sortedWord": "None", "Identifyer": null, "identifyer": 27855, "year": "2018"}, {"autor": "ClimbingDude19", "date": "2018-02-19 04:37:20", "content": "Creating prints of my photos /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7yk66b/creating_prints_of_my_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  prints of my photos /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 28568, "year": "2018"}, {"autor": "yorkydorky26", "date": "2018-05-16 13:52:52", "content": "I don’t like people regramming my work /!/ Platform: Instagram\n\nIs it possible that I’m weird, but I feel that since I created the image I don’t want others to simply repost my work. I want my friends to like and follow me but, I don’t want businesses and organizations to just use my images. I want my work to be public in order to reach out to others, and I don’t want to keep my profile private. Is there maybe a better way to reach out, but also to protect my privacy? Anyone else have that feeling? ", "link": "https://www.reddit.com/r/photography/comments/8jv2p6/i_dont_like_people_regramming_my_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  don’t like people regramming my work /!/ platform: instagram\n\nis it possible that -----> i !!! ’m weird, but -----> i !!!  feel that since -----> i !!!  -----> created !!!  the image -----> i !!!  don’t want others to simply repost my work. i want my friends to like and follow me but, i don’t want businesses and organizations to just use my images. i want my work to be public in order to reach out to others, and i don’t want to keep my profile private. is there maybe a better way to reach out, but also to protect my privacy? anyone else have that feeling? ", "sortedWord": "None", "Identifyer": null, "identifyer": 28838, "year": "2018"}, {"autor": "herro500", "date": "2018-05-26 16:42:35", "content": "Is there a way to add white borders to your photos in batches for instagram? /!/ Want to do something similar to this https://www.instagram.com/tomopoole/\n\nI tried creating actions on photoshop but am having a hard time figuring out how to do it!", "link": "https://www.reddit.com/r/photography/comments/8mbc9w/is_there_a_way_to_add_white_borders_to_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i tried creating", "selectorShort": "create", "MarkedSent": "is there a way to add white borders to your photos in batches for instagram? /!/ want to do something similar to this https://www.instagram.com/tomopoole/\n\n-----> i !!!  -----> tried !!!  -----> creating !!!  actions on photoshop but am having a hard time figuring out how to do it!", "sortedWord": "None", "Identifyer": null, "identifyer": 28906, "year": "2018"}, {"autor": "Awesomedia1", "date": "2018-06-04 11:17:27", "content": "We dont create a fantasy world to escape reality. We create it to be able to stay.", "link": "https://www.reddit.com/r/photography/comments/8oggsr/we_dont_create_a_fantasy_world_to_escape_reality/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we dont create", "selectorShort": "create", "MarkedSent": "-----> we !!!  -----> do !!! -----> nt !!!  -----> create !!!  a fantasy world to escape reality. we create it to be able to stay.", "sortedWord": "None", "Identifyer": null, "identifyer": 28973, "year": "2018"}, {"autor": "jsoltysik", "date": "2018-06-04 02:09:20", "content": "Suggest a Photographer Megathread /!/ I thought it would be cool if we created a giant thread where:\n\n - you comment about a photographer or style you like \n - others can recommend more photographers of that style \n\nI’ll start w an example!", "link": "https://www.reddit.com/r/photography/comments/8odpip/suggest_a_photographer_megathread/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we created", "selectorShort": "create", "MarkedSent": "suggest a photographer megathread /!/ i thought it would be cool if -----> we !!!  -----> created !!!  a giant thread where:\n\n - you comment about a photographer or style you like \n - others can recommend more photographers of that style \n\ni’ll start w an example!", "sortedWord": "None", "Identifyer": null, "identifyer": 29009, "year": "2018"}, {"autor": "IndiceLtd", "date": "2018-05-20 19:52:02", "content": "A new photo tool for iOS dual camera devices - Lighting editing for portrait mode photos! /!/ Well, our team experimented with **lighting modification** on portrait mode photos on dual camera iOS devices. \n\nWe managed to create an app that is actually Apple’s “Portrait Lighting” on steroids: A user can manipulate up to 20 light sources in 3D space over a portrait mode photo and adjust their parameters!\n\nThis app which is the **first of its kind** is the outcome of this effort and was made available for purchase yesterday:\n\n[https://itunes.apple.com/app/id1373682251](https://itunes.apple.com/app/id1373682251)\n\n**What you can do with this app**:You can modify the lighting \\(illumination\\) of any portrait mode photo.\n\n**Videos of the app in action**:[https://www.youtube.com/watch?v=MN5\\-r0qm\\_3s](https://www.youtube.com/watch?v=MN5-r0qm_3s)\n\n[https://www.youtube.com/watch?v=xlbL5AAmFmU](https://www.youtube.com/watch?v=xlbL5AAmFmU)\n\n**Sample photos**:\n\n![img](w8moh04ze2z01 \"Original\")\n\n![img](aufqjqe1f2z01 \"Edit 1\")\n\n![img](tuhvg942f2z01 \"Edit 2\")\n\n![img](p7fv6si4f2z01 \"Edit 3\")\n\n![img](ucvjdvr6f2z01 \"Original\")\n\n![img](4ad9su88f2z01 \"Edited\")\n\n**Site of the app \\(more details and the developer story\\)**:[https://apollo.camera](https://apollo.camera/)\n\n**If you want to try it**:Send me with your Apple ID to add you to the TestFlight testers and get a copy of the app", "link": "https://www.reddit.com/r/photography/comments/8kv1qq/a_new_photo_tool_for_ios_dual_camera_devices/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we managed to create", "selectorShort": "create", "MarkedSent": "a new photo tool for ios dual camera devices - lighting editing for portrait mode photos! /!/ well, our team experimented with **lighting modification** on portrait mode photos on dual camera ios devices. \n\n-----> we !!!  -----> managed !!!  -----> to !!!  -----> create !!!  an app that is actually apple’s “portrait lighting” on steroids: a user can manipulate up -----> to !!!  20 light sources in 3d space over a portrait mode photo and adjust their parameters!\n\nthis app which is the **first of its kind** is the outcome of this effort and was made available for purchase yesterday:\n\n[https://itunes.apple.com/app/id1373682251](https://itunes.apple.com/app/id1373682251)\n\n**what you can do with this app**:you can modify the lighting \\(illumination\\) of any portrait mode photo.\n\n**videos of the app in action**:[https://www.youtube.com/watch?v=mn5\\-r0qm\\_3s](https://www.youtube.com/watch?v=mn5-r0qm_3s)\n\n[https://www.youtube.com/watch?v=xlbl5aamfmu](https://www.youtube.com/watch?v=xlbl5aamfmu)\n\n**sample photos**:\n\n![img](w8moh04ze2z01 \"original\")\n\n![img](aufqjqe1f2z01 \"edit 1\")\n\n![img](tuhvg942f2z01 \"edit 2\")\n\n![img](p7fv6si4f2z01 \"edit 3\")\n\n![img](ucvjdvr6f2z01 \"original\")\n\n![img](4ad9su88f2z01 \"edited\")\n\n**site of the app \\(more details and the developer story\\)**:[https://apollo.camera](https://apollo.camera/)\n\n**if you want to try it**:send me with your apple id to add you to the testflight testers and get a copy of the app", "sortedWord": "None", "Identifyer": null, "identifyer": 29075, "year": "2018"}, {"autor": "enyfour5", "date": "2018-07-06 14:03:04", "content": "Really want to learn photography but don't know where to start! HELP /!/ Hi guys, I basically know nothing about photography, and what camera I should be using, so my question is: where do I begin?!!?! I have $200-400 to spend on a camera, but I'm not sure what's a good choice for someone who is absolutely new to this. I love to travel, and my next trip is going to be in Costa Rica for 2 1/2 weeks in November. I'd really like to buy a camera ASAP to start practicing taking photos. So anything will help! I'm more interested in the technical aspects of photography, and I guess you could say that I'm not afraid to learn some of the more \"confusing\" aspects of photography, like aperture, shutter speed, types of lens to use, etc. I just want to be pointed in the right direction lol. Anything will help, and I really do appreciate and look forward to any info you all have to share! As a software developer, I would love to create a website showcasing some of my work in the days, months, years to come! ", "link": "https://www.reddit.com/r/photography/comments/8wkbf7/really_want_to_learn_photography_but_dont_know/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would love to create", "selectorShort": "create", "MarkedSent": "really want to learn photography but don't know where to start! help /!/ hi guys, i basically know nothing about photography, and what camera i should be using, so my question is: where do i begin?!!?! i have $200-400 to spend on a camera, but i'm not sure what's a good choice for someone who is absolutely new to this. i love to travel, and my next trip is going to be in costa rica for 2 1/2 weeks in november. i'd really like to buy a camera asap to start practicing taking photos. so anything will help! i'm more interested in the technical aspects of photography, and i guess you could say that i'm not afraid to learn some of the more \"confusing\" aspects of photography, like aperture, shutter speed, types of lens to use, etc. i just want to be pointed in the right direction lol. anything will help, and i really do appreciate and look forward to any info you all have to share! as a software developer, -----> i !!!  -----> would !!!  -----> love !!!  -----> to !!!  -----> create !!!  a website showcasing some of my work in the days, months, years -----> to !!!  come! ", "sortedWord": "None", "Identifyer": null, "identifyer": 29825, "year": "2018"}, {"autor": "romanhopp", "date": "2018-07-13 13:47:20", "content": "The Sunset Photography Shooting Guide! /!/ # 5 Sunset Photography Tips\n\nHave you ever wondered how to get that perfect Sunset shot? What are the best Settings for Sunset Photography? What are Tips for Sunset Photography? In this Sunset Photography Tutorial I am going to give you my top 5 Tips for Sunset Photography!\n\n**1. Underexpose**\n\nShooting your Sunset Photo slightly Underexposed is probably the most important tip for Sunset Photography. Slightly Underexposing brings out more detail as well as color in the sky. Also do not forget, when shooting underexposed you can always increase the exposure in the post editing!\n\n**2.  Find the** **foreground** **first**\n\nYou do not want to be shooting the Sun as a direct Bulls eye! Find an Object that you can put in the foreground to create extra depth in your photograph. This is probably the most essential tip for Sunset Photography Composition\n\n**3. The Right Composition** \n\nDepending on how beautiful the sky is you have to decide how much of your composition should be the sky and how much should be the foreground. One basic rule is if the sky looks beautiful, have the upper two thirds of your composition as your sky, if the sky is boring, compose the shot so only the upper third makes up your sky.\n\n**4. Stay longer**\n\nThis is probably one of the most essential tips! After around 25 Minutes the Sunset actually starts to be even more beautiful most of the times! You do not want to miss this, so stay patient and even though the Sun perhaps has already crossed the Horizon Line you might still have the Opportunity for a great Photograph\n\n**5. Create silhouettes in the foreground.** \n\nFind an Object that has a lot of detail and that is recognizable. Then Underexpose so that the sky is properly exposed, but the foreground is underexposed. This will create an interesting looking Silhouette effect for your Photograph!\n\nI hope these 5 Tips are helping you for your Sunset Photography. I use these 5 tips and techniques for pretty much every single one of my Sunset shooting days! Though do not forget the most important Tip for Photography is to simply shoot a lot, so go out and shoot!\n\n***If you are interested in more Sunset Photography Tips, check out this Video below!***\n\n[Sunset Photography - How to shoot Sunsets (2018)](https://www.youtube.com/watch?v=rQGF3YAFAFE)", "link": "https://www.reddit.com/r/photography/comments/8yk3y3/the_sunset_photography_shooting_guide/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "the sunset photography shooting guide! /!/ # 5 sunset photography tips\n\nhave you ever wondered how to get that perfect sunset shot? what are the best settings for sunset photography? what are tips for sunset photography? in this sunset photography tutorial i am going to give you my top 5 tips for sunset photography!\n\n**1. underexpose**\n\nshooting your sunset photo slightly underexposed is probably the most important tip for sunset photography. slightly underexposing brings out more detail as well as color in the sky. also do not forget, when shooting underexposed you can always increase the exposure in the post editing!\n\n**2.  find the** **foreground** **first**\n\nyou do not want to be shooting the sun as a direct bulls eye! find an object that you can put in the foreground to create extra depth in your photograph. this is probably the most essential tip for sunset photography composition\n\n**3. the right composition** \n\ndepending on how beautiful the sky is you have to decide how much of your composition should be the sky and how much should be the foreground. one basic rule is if the sky looks beautiful, have the upper two thirds of your composition as your sky, if the sky is boring, compose the shot so only the upper third makes up your sky.\n\n**4. stay longer**\n\nthis is probably one of the most essential tips! after around 25 minutes the sunset actually starts to be even more beautiful most of the times! you do not want to miss this, so stay patient and even though the sun perhaps has already crossed the horizon line you might still have the opportunity for a great photograph\n\n**5. -----> create !!!  silhouettes in the foreground.** \n\nfind an object that has a lot of detail and that is recognizable. then underexpose so that the sky is properly exposed, but the foreground is underexposed. this will create an interesting looking silhouette effect for your photograph!\n\ni hope these 5 tips are helping you for your sunset photography. i use these 5 tips and techniques for pretty much every single one of my sunset shooting days! though do not forget the most important tip for photography is to simply shoot a lot, so go out and shoot!\n\n***if you are interested in more sunset photography tips, check out this video below!***\n\n[sunset photography - how to shoot sunsets (2018)](https://www.youtube.com/watch?v=rqgf3yafafe)", "sortedWord": "None", "Identifyer": null, "identifyer": 30000, "year": "2018"}, {"autor": "Brunhilda100", "date": "2018-07-11 08:35:17", "content": "How can I create a slide show with the file name showing, without having to write a caption? /!/ I need to present about 2000 pictures 30 minutes after I take them. I need a program that can do this quickly. I need it where I can open folder, highlight pictures, and hit play. Also it would be nice if I can have 2 or 4 pictures showing, instead of just one picture at a time. But that might be asking too much. Showing the file name is most important because that's how people will be able to order their prints. It needs to be a program that works on Windows.", "link": "https://www.reddit.com/r/photography/comments/8xxv2u/how_can_i_create_a_slide_show_with_the_file_name/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  a slide show with the file name showing, without having to write a caption? /!/ i need to present about 2000 pictures 30 minutes after i take them. i need a program that can do this quickly. i need it where i can open folder, highlight pictures, and hit play. also it would be nice if i can have 2 or 4 pictures showing, instead of just one picture at a time. but that might be asking too much. showing the file name is most important because that's how people will be able to order their prints. it needs to be a program that works on windows.", "sortedWord": "None", "Identifyer": null, "identifyer": 30046, "year": "2018"}, {"autor": "JKrallPhoto", "date": "2018-08-11 22:20:00", "content": "I’m a director of photography and I created an adobe spark link to give you guys a small inside look at a commercial photography studio - let me know if anyone is interested in hearing or seeing more!", "link": "https://www.reddit.com/r/photography/comments/96ke8l/im_a_director_of_photography_and_i_created_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!! ’m a director of photography and -----> i !!!  -----> created !!!  an adobe spark link to give you guys a small inside look at a commercial photography studio - let me know if anyone is interested in hearing or seeing more!", "sortedWord": "None", "Identifyer": null, "identifyer": 30541, "year": "2018"}, {"autor": "jeff6606", "date": "2018-07-20 14:14:36", "content": "Product Photography (Comics) /!/ Product photographers and others versed in lighting, exposure settings for a stationary project I am trying to DREAM or think up.\n\nI have to photograph a bunch of comic books (front cover, back cover, maybe an inside page of each one and there is a BUNCH).\n\nI want to set up a photography station where I can mount my D800 on a tripod facing down. The settings will be key to capture the condition of each comic. Have exact aperture (to capture creases in the pages and spine cover and crisp text, yellowness of the aged book pages (white balance) and set zoom just at the right setting so I can don't have to do a lot of cropping in post.\n\nI know I need to choose the right lens. Most suitable are my 50mm 1.8, 17-50mm 2.8, or 85mm 1.8. I have 70-200 but that will be too much...Distance from the comic will be key with choice. 2 feet, 3 feet? It will all depend on the lens I choose. I guess. Suggestions on which lens to use?\n\nLighting: I have 3 flashes - but, I most likely will need one or two with either my 26\" Westcott Rapid Box, or an umbrella setup. With remote triggers.\n\nQuestion to product photo pros or anyone. What lens should I use, how far above the comic that will be sitting stationary should I set the tripod, aperture, ISO, WB, and flash setting. I plan on indoor with sunlight out the windows today. I know I will need to test, but rough estimates please.\n\nAperture small enough to catch any and all comic imperfection (that is big on grading their quality, so no bokeh needed, other than if their is background, but most likely a table top straight on, but large enough I can use my flash if I need to fill in any details of shadows); what lighting setup should I use, the Rapid Box w or w/ beauty dish or an umbrella? And any recommended settings on the power for the flash or angle AT the comic book.\n\nI know a lot of info, but please help, first product item. Learning! I usually to portraits and landscape.\n\nI just want a great idea from you all, to set this up stationary, camera, flash and all set to to settings and start placing book after book, organize later in lightroom by a list of each issue I have shot and organize from there. Most important right now is the setup of camera and its settings so I am not adjusting those settings book by book\n\n(I have tried the scanning method! Scans are too slow, and don't return the real life feel of the comic. Just looks like any other scanned item. With my D800, I thought I can just create a product photography workflowl\n\nRecap for this project: What lens; how far above the comic to set; camera settings (aperture, ISO, shutter speed), flash settings and angle to the comic; any other thoughts on this type of workflow.\n\nTHANKS!", "link": "https://www.reddit.com/r/photography/comments/90gc0l/product_photography_comics/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can just create", "selectorShort": "create", "MarkedSent": "product photography (comics) /!/ product photographers and others versed in lighting, exposure settings for a stationary project i am trying to dream or think up.\n\ni have to photograph a bunch of comic books (front cover, back cover, maybe an inside page of each one and there is a bunch).\n\ni want to set up a photography station where i can mount my d800 on a tripod facing down. the settings will be key to capture the condition of each comic. have exact aperture (to capture creases in the pages and spine cover and crisp text, yellowness of the aged book pages (white balance) and set zoom just at the right setting so i can don't have to do a lot of cropping in post.\n\ni know i need to choose the right lens. most suitable are my 50mm 1.8, 17-50mm 2.8, or 85mm 1.8. i have 70-200 but that will be too much...distance from the comic will be key with choice. 2 feet, 3 feet? it will all depend on the lens i choose. i guess. suggestions on which lens to use?\n\nlighting: i have 3 flashes - but, i most likely will need one or two with either my 26\" westcott rapid box, or an umbrella setup. with remote triggers.\n\nquestion to product photo pros or anyone. what lens should i use, how far above the comic that will be sitting stationary should i set the tripod, aperture, iso, wb, and flash setting. i plan on indoor with sunlight out the windows today. i know i will need to test, but rough estimates please.\n\naperture small enough to catch any and all comic imperfection (that is big on grading their quality, so no bokeh needed, other than if their is background, but most likely a table top straight on, but large enough i can use my flash if i need to fill in any details of shadows); what lighting setup should i use, the rapid box w or w/ beauty dish or an umbrella? and any recommended settings on the power for the flash or angle at the comic book.\n\ni know a lot of info, but please help, first product item. learning! i usually to portraits and landscape.\n\ni just want a great idea from you all, to set this up stationary, camera, flash and all set to to settings and start placing book after book, organize later in lightroom by a list of each issue i have shot and organize from there. most important right now is the setup of camera and its settings so i am not adjusting those settings book by book\n\n(i have tried the scanning method! scans are too slow, and don't return the real life feel of the comic. just looks like any other scanned item. with my d800, -----> i !!!  thought -----> i !!!  -----> can !!!  -----> just !!!  -----> create !!!  a product photography workflowl\n\nrecap for this project: what lens; how far above the comic to set; camera settings (aperture, iso, shutter speed), flash settings and angle to the comic; any other thoughts on this type of workflow.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 30585, "year": "2018"}, {"autor": "rjoisa", "date": "2018-08-24 19:22:47", "content": "Create Stunning details in the eyea using Lightroom", "link": "https://www.reddit.com/r/photography/comments/9a0cws/create_stunning_details_in_the_eyea_using/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  stunning details in the eyea using lightroom", "sortedWord": "None", "Identifyer": null, "identifyer": 31101, "year": "2018"}, {"autor": "catifie", "date": "2018-08-26 06:44:46", "content": "How do I create/edit fog into a picture just in the background? /!/ I'm new to photography and i've really wanted to add fog in the background of some of my pictures, how do I do that? I use my phone for all the editting currently. What are some apps you recommend?", "link": "https://www.reddit.com/r/photography/comments/9adpeu/how_do_i_createedit_fog_into_a_picture_just_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!! /edit fog into a picture just in the background? /!/ i'm new to photography and i've really wanted to add fog in the background of some of my pictures, how do i do that? i use my phone for all the editting currently. what are some apps you recommend?", "sortedWord": "None", "Identifyer": null, "identifyer": 31174, "year": "2018"}, {"autor": "mntbnd", "date": "2018-08-29 14:27:38", "content": "How can I create a colour palette like this?", "link": "https://www.reddit.com/r/photography/comments/9b9r7t/how_can_i_create_a_colour_palette_like_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  a colour palette like this?", "sortedWord": "None", "Identifyer": null, "identifyer": 31276, "year": "2018"}, {"autor": "insaineinventer", "date": "2018-08-29 08:33:52", "content": "If You Wanna Check Out An Amazing Website That I Have Created Click On This Link:", "link": "https://www.reddit.com/r/photography/comments/9b7gg3/if_you_wanna_check_out_an_amazing_website_that_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "if you wanna check out an amazing website that -----> i !!!  -----> have !!!  -----> created !!!  click on this link:", "sortedWord": "None", "Identifyer": null, "identifyer": 31293, "year": "2018"}, {"autor": "Steffeen", "date": "2018-08-29 07:26:13", "content": "Best platform for my images /!/ Hello Reddit\n\nI am an amateur photographer who enjoys taking pictures of motorsport and the nature.\n\nI am seeking a platform where I can share my photos, but I have some requirements.. The website should be able to let me create an album, upload images into these albums (For each motorsport event) and make it possible to embed it to my website.\n\nActually I wanted a way to embed my Facebook albums but that is not really possible because the api is changing alot,\n\nBut does there exist any websites who offers what I want? A photographer community like 500px where I can share my albums to embed (Like imgur, photoland e.g.) with unlimited storage?\n\nPlease post any website you know for this kind a service,\n\nThanks in advance, ", "link": "https://www.reddit.com/r/photography/comments/9b745i/best_platform_for_my_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "best platform for my images /!/ hello reddit\n\ni am an amateur photographer who enjoys taking pictures of motorsport and the nature.\n\ni am seeking a platform where i can share my photos, but i have some requirements.. the website should be able to let -----> me !!!  -----> create !!!  an album, upload images into these albums (for each motorsport event) and make it possible to embed it to my website.\n\nactually i wanted a way to embed my facebook albums but that is not really possible because the api is changing alot,\n\nbut does there exist any websites who offers what i want? a photographer community like 500px where i can share my albums to embed (like imgur, photoland e.g.) with unlimited storage?\n\nplease post any website you know for this kind a service,\n\nthanks in advance, ", "sortedWord": "None", "Identifyer": null, "identifyer": 31296, "year": "2018"}, {"autor": "OrganicEnid", "date": "2018-09-06 01:00:41", "content": "How much is a fair price for taking photos / managing social media? /!/ Long story short:\n\n&amp;#x200B;\n\nseveral months ago, these people wanted me to manage their IG but could not agree to my price. fast forward today, they contacted me again and asked me how much i would charge them.\n\n&amp;#x200B;\n\nissue: i don't think i can go any lower on price other than what I offered originally which is actually kind of low IMO but at the same time they are a VERY small business and have VERY tight budgets so it's not like i want to suck them dry, but other than that i cant invest so much time into this and barely get compensated because honestly i could be doing something else and earning a fair wage.\n\n&amp;#x200B;\n\nduties:\n\nthey are starting an online clothing company and want to use IG as a primary source of traffic/ advertisement - they want me to build their IG from ground 0. \n\nBasically.. I'll be creating original content with their own items (photography), i'll be managing their social media and posting and overseeing everything (social media manager), and also answer all and any questions on IG about orders and products where applicable (customer service). \n\n&amp;#x200B;\n\nKeep in mind, i have to pay models, pay for detailed analytic reports, take and edit my OWN original creative images (some reposting will be done but half or more is original content), drive to great scenic or aesthetically pleasing locations, and even do a little advertising on IG which is money.\n\n&amp;#x200B;\n\nI asked for $400/ wk originally months ago, and now I still stand by it and even think that's low.. but since they're a small business i wont ask for more than that. issue is, that was way too much for them back then and immediately declined. \n\n&amp;#x200B;\n\nMy experience:\n\n&amp;#x200B;\n\nNo professional social media management experience. I have my own acc a little over 1 year and it's at 18k, the other is barely 2 months and less than 30 posts and over 1500. engagement is on par to # of followers - most importantly. \n\nI am a freelance photographer and own a canonn5dmiii and a sony a7iii - I am about to get more into photography as well in the next year/ few months (unrelated). so my lack of experience in the fashion industry is also important to note.\n\n&amp;#x200B;\n\nGoal: my goal is to gain them a lot of traffic + followers AND engagement in the hopes that they could be potential customers. Obviously i have to be aware of targeted demographics, style of photos and what message the acc gives to people (is this a clothing store or what?) etc.. I have a great vision for it, unfortunately just no experience. \n\n&amp;#x200B;\n\nIs $400 / wk fair to ask? Or should I start with $350, and if in 3 months it goes well, we will negotiate new terms and i can then ask for $400 or even $425/ weekly? ", "link": "https://www.reddit.com/r/photography/comments/9dd3bd/how_much_is_a_fair_price_for_taking_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'll be creating", "selectorShort": "create", "MarkedSent": "how much is a fair price for taking photos / managing social media? /!/ long story short:\n\n&amp;#x200b;\n\nseveral months ago, these people wanted me to manage their ig but could not agree to my price. fast forward today, they contacted me again and asked me how much i would charge them.\n\n&amp;#x200b;\n\nissue: i don't think i can go any lower on price other than what i offered originally which is actually kind of low imo but at the same time they are a very small business and have very tight budgets so it's not like i want to suck them dry, but other than that i cant invest so much time into this and barely get compensated because honestly i could be doing something else and earning a fair wage.\n\n&amp;#x200b;\n\nduties:\n\nthey are starting an online clothing company and want to use ig as a primary source of traffic/ advertisement - they want me to build their ig from ground 0. \n\nbasically.. -----> i !!! -----> 'll !!!  -----> be !!!  -----> creating !!!  original content with their own items (photography), -----> i !!! -----> 'll !!!  -----> be !!!  managing their social media and posting and overseeing everything (social media manager), and also answer all and any questions on ig about orders and products where applicable (customer service). \n\n&amp;#x200b;\n\nkeep in mind, i have to pay models, pay for detailed analytic reports, take and edit my own original creative images (some reposting will be done but half or more is original content), drive to great scenic or aesthetically pleasing locations, and even do a little advertising on ig which is money.\n\n&amp;#x200b;\n\ni asked for $400/ wk originally months ago, and now i still stand by it and even think that's low.. but since they're a small business i wont ask for more than that. issue is, that was way too much for them back then and immediately declined. \n\n&amp;#x200b;\n\nmy experience:\n\n&amp;#x200b;\n\nno professional social media management experience. i have my own acc a little over 1 year and it's at 18k, the other is barely 2 months and less than 30 posts and over 1500. engagement is on par to # of followers - most importantly. \n\ni am a freelance photographer and own a canonn5dmiii and a sony a7iii - i am about to get more into photography as well in the next year/ few months (unrelated). so my lack of experience in the fashion industry is also important to note.\n\n&amp;#x200b;\n\ngoal: my goal is to gain them a lot of traffic + followers and engagement in the hopes that they could be potential customers. obviously i have to be aware of targeted demographics, style of photos and what message the acc gives to people (is this a clothing store or what?) etc.. i have a great vision for it, unfortunately just no experience. \n\n&amp;#x200b;\n\nis $400 / wk fair to ask? or should i start with $350, and if in 3 months it goes well, we will negotiate new terms and i can then ask for $400 or even $425/ weekly? ", "sortedWord": "None", "Identifyer": null, "identifyer": 31515, "year": "2018"}, {"autor": "cuffyourjeans", "date": "2018-09-13 20:39:33", "content": "Creating an Invoice (for paid gig) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9fln64/creating_an_invoice_for_paid_gig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an invoice (for paid gig) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 31557, "year": "2018"}, {"autor": "thehayleysofar", "date": "2018-09-25 20:09:40", "content": "Photography Business, Getting Clients /!/ Hi everyone! I was hoping to hear some great tips on how to get clients. The obvious is having great photos but I want to go further into the marketing side. I've also already created a referral program, now I'm just waiting. I don't want to just wait though, I want to keep going and reach out. \n\n- One example being finding engaged couples or expecting mothers on Instagram. How do you reach out to personal accounts on instagram? How do you FIND them? Hashtag examples?\n\n- How do you reach out to your facebook friends without sounding desperate? I don't think many people see my posts offering services. I want to reach out to my friends asking if they are in need of any photos. \n\nIf you have any other ideas, I would love to know! ", "link": "https://www.reddit.com/r/photography/comments/9ivm76/photography_business_getting_clients/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've also already created", "selectorShort": "create", "MarkedSent": "photography business, getting clients /!/ hi everyone! i was hoping to hear some great tips on how to get clients. the obvious is having great photos but i want to go further into the marketing side. -----> i !!! 've -----> also !!!  -----> already !!!  -----> created !!!  a referral program, now -----> i !!! 'm just waiting. i don't want to just wait though, i want to keep going and reach out. \n\n- one example being finding engaged couples or expecting mothers on instagram. how do you reach out to personal accounts on instagram? how do you find them? hashtag examples?\n\n- how do you reach out to your facebook friends without sounding desperate? i don't think many people see my posts offering services. i want to reach out to my friends asking if they are in need of any photos. \n\nif you have any other ideas, i would love to know! ", "sortedWord": "None", "Identifyer": null, "identifyer": 31845, "year": "2018"}, {"autor": "Xayus", "date": "2018-09-30 15:34:00", "content": "How can I re-create this effect with a Nikon D3400 and Lightroom? (Imgur album inside) /!/ Hi r/Photography! I've been playing around with different photography techniques and using Instagram as inspiration. One of the photographers I follow posts a lot of shots that have a night/cyberpunk/bokeh look to them and I really want to try to re-create them. Unfortunately, when I try they come out incorrectly. Taking a look at these photos, do you have any tips for re-creating this type of night-shot? I have a Nikon D3400 and use Adobe Lightroom for post-editing. \n\n[https://imgur.com/a/Z01MYMG](https://imgur.com/a/Z01MYMG)\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9k7842/how_can_i_recreate_this_effect_with_a_nikon_d3400/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i re-create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> re !!! -create this effect with a nikon d3400 and lightroom? (imgur album inside) /!/ hi r/photography! i've been playing around with different photography techniques and using instagram as inspiration. one of the photographers i follow posts a lot of shots that have a night/cyberpunk/bokeh look to them and i really want to try to re-create them. unfortunately, when i try they come out incorrectly. taking a look at these photos, do you have any tips for re-creating this type of night-shot? i have a nikon d3400 and use adobe lightroom for post-editing. \n\n[https://imgur.com/a/z01mymg](https://imgur.com/a/z01mymg)\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 32049, "year": "2018"}, {"autor": "abg452", "date": "2018-10-09 03:51:24", "content": "Boutique stock photo site with Wordpress? /!/ Hey guys! \n\nI am starting my own stock photo site and I was wondering if I could get some advise about the platform. I've always used Wordpress for all my sites before, because I like the great amount of info and tutorials you can find to make a good site, however, I've had no luck whatsoever in finding the right theme or plugin to create a good stock photo site to sell digital images to my costumers. \n\nIt would need to work as an online store, with different prices and licenses for the same image and plenty of space. I started tinkering away at it at the beginning of the year, by using different galleries and plugins and WooCommerce as Ecommerce platform, but at this point I don't think is feasible any longer. With WooCommerce I have to create individual products for each pic (at 50 - 100 pics per group) and it takes too mcuh time. I haven't found any way to optimize the process and to create batch products, and the other plugins I've tried are buggy or out of date. I've also been looking at different photo themes, but none of them seems to offer the multiple price functionality. \n\nDo any of you have ever created a site like this with wordpress or did you have to move somewhere else (I still have a year left in my hosting contract)? ", "link": "https://www.reddit.com/r/photography/comments/9mlw5z/boutique_stock_photo_site_with_wordpress/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have to create", "selectorShort": "create", "MarkedSent": "boutique stock photo site with wordpress? /!/ hey guys! \n\ni am starting my own stock photo site and i was wondering if i could get some advise about the platform. i've always used wordpress for all my sites before, because i like the great amount of info and tutorials you can find to make a good site, however, i've had no luck whatsoever in finding the right theme or plugin to create a good stock photo site to sell digital images to my costumers. \n\nit would need to work as an online store, with different prices and licenses for the same image and plenty of space. i started tinkering away at it at the beginning of the year, by using different galleries and plugins and woocommerce as ecommerce platform, but at this point i don't think is feasible any longer. with woocommerce -----> i !!!  -----> have !!!  -----> to !!!  -----> create !!!  individual products for each pic (at 50 - 100 pics per group) and it takes too mcuh time. i haven't found any way to optimize the process and to create batch products, and the other plugins i've tried are buggy or out of date. i've also been looking at different photo themes, but none of them seems to offer the multiple price functionality. \n\ndo any of you have ever created a site like this with wordpress or did you have to move somewhere else (i still have a year left in my hosting contract)? ", "sortedWord": "None", "Identifyer": null, "identifyer": 32338, "year": "2018"}, {"autor": "ieroxx", "date": "2018-10-03 15:49:53", "content": "When to invest in branding? /!/ So I've been trying to start a small business for a few years, on and off. I've bought domains, I've created and paid for websites, I've had numerous versions of business cards.. everything was wasted. I changed too much and my shots weren't very good. \n\nNow things are picking up without me doing all of that, I'm wondering, would it be a better idea to get biz cards &amp; a renewed website now, or wait a while longer until I am more confident I can bring in clients?\n\n\nWhat would you recommend? \n\ntl;dr - Invest in branding upfront, or build up to it, and hope that clients aren't put off by no cards or website?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/9l2dcu/when_to_invest_in_branding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "when to invest in branding? /!/ so i've been trying to start a small business for a few years, on and off. -----> i !!! 've bought domains, -----> i !!! 've -----> created !!!  and paid for websites, -----> i !!! 've had numerous versions of business cards.. everything was wasted. i changed too much and my shots weren't very good. \n\nnow things are picking up without me doing all of that, i'm wondering, would it be a better idea to get biz cards &amp; a renewed website now, or wait a while longer until i am more confident i can bring in clients?\n\n\nwhat would you recommend? \n\ntl;dr - invest in branding upfront, or build up to it, and hope that clients aren't put off by no cards or website?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 32408, "year": "2018"}, {"autor": "GreenRiot", "date": "2018-10-08 04:57:40", "content": "Creepy edit help; /!/ Hello, fellow bipeds i'm in need of your help.\nI'm currently working on an illustration of a monster i created to scare my friends when i was a kid.\n\nI'm not going to earn any money from it, just the pleasure trying to create something unnerving and maybe share it on the internet in time for halloween and pretend it's some real urban legend for fun.\nSoo i need some junk photos that you guys wouldn't care to have other people messing with and i'd rather not pick random photos online that the author might not be ok to be twisted.\n\nMy idea is to try to create some sort of \"live footage\" screenshot, and edit the \"stuff from the hill\" in.\nThe ideal would be to have a couple of choices on backgrounds, on dark woods in the night... i don't live anywhere near a forest, soo i don't have much choice.\n\nSorry for any possible grammar errors, it's really late and english is not my first language.", "link": "https://www.reddit.com/r/photography/comments/9mbz0e/creepy_edit_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "creepy edit help; /!/ hello, fellow bipeds i'm in need of your help.\n-----> i !!! 'm currently working on an illustration of a monster -----> i !!!  -----> created !!!  to scare my friends when -----> i !!!  was a kid.\n\ni'm not going to earn any money from it, just the pleasure trying to create something unnerving and maybe share it on the internet in time for halloween and pretend it's some real urban legend for fun.\nsoo i need some junk photos that you guys wouldn't care to have other people messing with and i'd rather not pick random photos online that the author might not be ok to be twisted.\n\nmy idea is to try to create some sort of \"live footage\" screenshot, and edit the \"stuff from the hill\" in.\nthe ideal would be to have a couple of choices on backgrounds, on dark woods in the night... i don't live anywhere near a forest, soo i don't have much choice.\n\nsorry for any possible grammar errors, it's really late and english is not my first language.", "sortedWord": "None", "Identifyer": null, "identifyer": 32609, "year": "2018"}, {"autor": "LTX_Jonathan", "date": "2018-10-12 18:22:50", "content": "OMG!! I just created a reddit account in 2018....", "link": "https://www.reddit.com/r/photography/comments/9nmqo7/omg_i_just_created_a_reddit_account_in_2018/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just created", "selectorShort": "create", "MarkedSent": "omg!! -----> i !!!  -----> just !!!  -----> created !!!  a reddit account in 2018....", "sortedWord": "None", "Identifyer": null, "identifyer": 32703, "year": "2018"}, {"autor": "N0DuckingWay", "date": "2018-10-20 06:34:21", "content": "Best websites for selling prints /!/ Hello,\n\n&amp;#x200B;\n\nWhat is the best website out there for selling prints of your photos? I realize I could create a squarespace or something like that, but I’m wondering if there’s any other options for those of us that don’t want to pay for our own site.\n\n&amp;#x200B;\n\nThanks,\n\nZach", "link": "https://www.reddit.com/r/photography/comments/9prvum/best_websites_for_selling_prints/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "best websites for selling prints /!/ hello,\n\n&amp;#x200b;\n\nwhat is the best website out there for selling prints of your photos? -----> i !!!  realize -----> i !!!  -----> could !!!  -----> create !!!  a squarespace or something like that, but -----> i !!! ’m wondering if there’s any other options for those of us that don’t want to pay for our own site.\n\n&amp;#x200b;\n\nthanks,\n\nzach", "sortedWord": "None", "Identifyer": null, "identifyer": 32762, "year": "2018"}, {"autor": "kieranjackwilson", "date": "2018-10-19 18:28:48", "content": "I think I discovered a new technique to emulate a long exposure /!/ A few years back I visited a waterfall in Nebraska in the middle of the fall. The scene was beautiful and begging to be photographed. I pulled out my camera and tripod, but was devastated when I realized I'd left all my filters at home. It was way too bright to shoot a long exposure without an ND, so I went home with a couple nice shots that didn't really show the water's movement.\n\nAbout a year from then, I found a blog post about technique where you substitute multiple stacked images for a single long exposure. [Here's the actual post I am referencing.](https://patdavid.net/2013/09/faking-nd-filter-for-long-exposure.html) The technique was super helpful, and I have used it many times since, however I hadn't shot 40 photographs from the same angle so I was out of luck. It was too little, too late for my waterfall photo.\n\nOr was it?\n\nUsing the Blur, Smudge, and Liquify tools on photoshop, I created around 40 images where the water was edited to be in a slightly different position. I then stacked those images as described in the blog post and was left with this: https://imgur.com/a/hpGjMKO\n\nThe image is solely the result of the process described above. I'm sure I could put more time into the process and add some maskinging and light brush work to further sell the effect, but I think the result is very cool nevertheless.\n\ntl;dr I edited the same photo different way to create motion, then stacked the images to create motion blur", "link": "https://www.reddit.com/r/photography/comments/9pmj8d/i_think_i_discovered_a_new_technique_to_emulate_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i think i discovered a new technique to emulate a long exposure /!/ a few years back i visited a waterfall in nebraska in the middle of the fall. the scene was beautiful and begging to be photographed. i pulled out my camera and tripod, but was devastated when i realized i'd left all my filters at home. it was way too bright to shoot a long exposure without an nd, so i went home with a couple nice shots that didn't really show the water's movement.\n\nabout a year from then, i found a blog post about technique where you substitute multiple stacked images for a single long exposure. [here's the actual post i am referencing.](https://patdavid.net/2013/09/faking-nd-filter-for-long-exposure.html) the technique was super helpful, and i have used it many times since, however i hadn't shot 40 photographs from the same angle so i was out of luck. it was too little, too late for my waterfall photo.\n\nor was it?\n\nusing the blur, smudge, and liquify tools on photoshop, -----> i !!!  -----> created !!!  around 40 images where the water was edited to be in a slightly different position. i then stacked those images as described in the blog post and was left with this: https://imgur.com/a/hpgjmko\n\nthe image is solely the result of the process described above. i'm sure i could put more time into the process and add some maskinging and light brush work to further sell the effect, but i think the result is very cool nevertheless.\n\ntl;dr i edited the same photo different way to create motion, then stacked the images to create motion blur", "sortedWord": "None", "Identifyer": null, "identifyer": 32789, "year": "2018"}, {"autor": "Yakmasterson", "date": "2018-10-22 21:48:39", "content": "What are steps to monetize photography? /!/ I've good enough equipment and skills to make some money shooting portraits and maybe events. I'm just not sure the right steps to take. I've created a Facebook page. It's basic but it's up. Any ideas what to post would be great. I have no idea what to post. I don't ever post on my personal page either so I'm really clueless. I've got a squarespace website, business cards, and some prints to show potential customers. My problem is booking shoots. Should I just do some free shoots until I establish workflow and style? Should I charge a minimal fee? Either way, how do I get shoots booked, I'm thinking of running ads on Facebook for fall portraits at really low rates. Is this a good idea? Right now I just feel like I need subject in front of my camera. I've already gone through my friends and their kids. I've got a bazillion shots of my niece and nephews. a trazillion of my dog. I'm just kind of lost. The fact that I overthink every idea I have isn't helping. I feel rushed about it since I just lost my job. I know if I just keep at it and be patient business will start to develop, I just don't have a lot of patience right now. I'd appreciate any ideas you have to help me get some momentum. ", "link": "https://www.reddit.com/r/photography/comments/9qieab/what_are_steps_to_monetize_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "what are steps to monetize photography? /!/ i've good enough equipment and skills to make some money shooting portraits and maybe events. i'm just not sure the right steps to take. -----> i !!! 've -----> created !!!  a facebook page. it's basic but it's up. any ideas what to post would be great. i have no idea what to post. i don't ever post on my personal page either so i'm really clueless. i've got a squarespace website, business cards, and some prints to show potential customers. my problem is booking shoots. should i just do some free shoots until i establish workflow and style? should i charge a minimal fee? either way, how do i get shoots booked, i'm thinking of running ads on facebook for fall portraits at really low rates. is this a good idea? right now i just feel like i need subject in front of my camera. i've already gone through my friends and their kids. i've got a bazillion shots of my niece and nephews. a trazillion of my dog. i'm just kind of lost. the fact that i overthink every idea i have isn't helping. i feel rushed about it since i just lost my job. i know if i just keep at it and be patient business will start to develop, i just don't have a lot of patience right now. i'd appreciate any ideas you have to help me get some momentum. ", "sortedWord": "None", "Identifyer": null, "identifyer": 32938, "year": "2018"}, {"autor": "jhakeeeey", "date": "2018-10-28 13:32:02", "content": "Tips for street photography /!/ Hello guys, I've been wondering how photographers take pictures such as this\n\nhttps://unsplash.com/photos/ooo4sDkTvJ4\n\nI'm trying to create something similar but I can't seem to create the cinematic feeling of such pics. Is it done in the post processing?", "link": "https://www.reddit.com/r/photography/comments/9s35ps/tips_for_street_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm trying to create", "selectorShort": "create", "MarkedSent": "tips for street photography /!/ hello guys, -----> i !!! 've been wondering how photographers take pictures such as this\n\nhttps://unsplash.com/photos/ooo4sdktvj4\n\n-----> i !!! 'm -----> trying !!!  -----> to !!!  -----> create !!!  something similar but -----> i !!!  can't seem -----> to !!!  -----> create !!!  the cinematic feeling of such pics. is it done in the post processing?", "sortedWord": "None", "Identifyer": null, "identifyer": 32947, "year": "2018"}, {"autor": "alemangui", "date": "2018-10-27 15:24:02", "content": "What are your favorite 500px accounts for inspiration? /!/ TL;DR: I want to stop using Instagram because too many ads. Need suggestions on good 500px to follow (most seem over-shopped).\n\n\nHello fellow shutterbugs,\n\nI've been using Instagram for a while to follow photographers for inspiration, for example Paul Nicklen, Cristina Mittermeier, Alan Schaller, Walter Rothwell, Justin Hoffman, etc., as well as some organization or company accounts like The Street Photography Hub, NatGeo, Sea Legacy, etc. The type of photography I follow is quite varied: wildlife, portrait, landscapes, street, etc.\n\nI find the quality of these accounts superb, and its variety helps me get ideas from a wide variety of styles and situations.\n\nRecently I've been overwhelmed with Instagram's ads. I know ads are the business model of Instagram, but for me personally it's too much. They are also very similar to actual posts which I find very sneaky. Anyway, I want out.\n\nI created a 500px account but I find most of the recommended accounts are waaay too \"shopped\" for my taste (extremely saturated, unrealistic looks, etc). They lack the natural look that I was used to with my Instagram feed. I tried looking for the same photographers in 500px without success.\n\nDo you have any suggestions on this platform?\n\nIs there another Instagram replacement you recommend?", "link": "https://www.reddit.com/r/photography/comments/9rv20c/what_are_your_favorite_500px_accounts_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "what are your favorite 500px accounts for inspiration? /!/ tl;dr: i want to stop using instagram because too many ads. need suggestions on good 500px to follow (most seem over-shopped).\n\n\nhello fellow shutterbugs,\n\ni've been using instagram for a while to follow photographers for inspiration, for example paul nicklen, cristina mittermeier, alan schaller, walter rothwell, justin hoffman, etc., as well as some organization or company accounts like the street photography hub, natgeo, sea legacy, etc. the type of photography i follow is quite varied: wildlife, portrait, landscapes, street, etc.\n\ni find the quality of these accounts superb, and its variety helps me get ideas from a wide variety of styles and situations.\n\nrecently i've been overwhelmed with instagram's ads. i know ads are the business model of instagram, but for me personally it's too much. they are also very similar to actual posts which i find very sneaky. anyway, i want out.\n\n-----> i !!!  -----> created !!!  a 500px account but i find most of the recommended accounts are waaay too \"shopped\" for my taste (extremely saturated, unrealistic looks, etc). they lack the natural look that i was used to with my instagram feed. i tried looking for the same photographers in 500px without success.\n\ndo you have any suggestions on this platform?\n\nis there another instagram replacement you recommend?", "sortedWord": "None", "Identifyer": null, "identifyer": 33001, "year": "2018"}, {"autor": "nicolinoselis", "date": "2018-10-31 13:58:07", "content": "Instagram POD for photographers /!/ Hello my name is @nicolinoselis and I’m trying to create a good pod for photographers where share our works and support each other, if you are interested leave your instagram name below or DM me.\nThis is a serious pod I’m trying to make it very clear and we are almost 15 right now.", "link": "https://www.reddit.com/r/photography/comments/9syykf/instagram_pod_for_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to create", "selectorShort": "create", "MarkedSent": "instagram pod for photographers /!/ hello my name is @nicolinoselis and -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> create !!!  a good pod for photographers where share our works and support each other, if you are interested leave your instagram name below or dm me.\nthis is a serious pod i’m trying to make it very clear and we are almost 15 right now.", "sortedWord": "None", "Identifyer": null, "identifyer": 33050, "year": "2018"}, {"autor": "Mudkipped", "date": "2018-11-06 01:16:47", "content": "How do you guys handle public event photo delivery? /!/ I use Zenfolio as my content provider, so I have the ability to create multiple price lists with different products and assign them to multiple galleries.\n\nI’m sometimes hired to photograph events. Part of what I cover can be bands or speakers, detail shots, vendors, etc. Here is how I am current handling those events:\n\n1) create a private gallery for who hired me (could be a promoter, could be a venue) that has the download option for free, and a lower rate for prints\n\n2) create a public gallery of the same images to use in a blog post, have a link to the public gallery and charge guests and vendors a small for to download a web ready resolution version of the photo and a slightly higher cost for prints\n\nIs this a good practice? Is it fair? How do you guys handle public events like this? Should I be creating private galleries for the vendors and bands that might be playing and put only their photos in there and find their social media/emails to provide them the credentials, or is expecting a small fee for downloads okay?\n\nJust want to make sure I’m not being greedy and not doing a weird practice that others don’t do.", "link": "https://www.reddit.com/r/photography/comments/9ujqwa/how_do_you_guys_handle_public_event_photo_delivery/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i be creating", "selectorShort": "create", "MarkedSent": "how do you guys handle public event photo delivery? /!/ i use zenfolio as my content provider, so i have the ability to create multiple price lists with different products and assign them to multiple galleries.\n\ni’m sometimes hired to photograph events. part of what i cover can be bands or speakers, detail shots, vendors, etc. here is how i am current handling those events:\n\n1) create a private gallery for who hired me (could be a promoter, could be a venue) that has the download option for free, and a lower rate for prints\n\n2) create a public gallery of the same images to use in a blog post, have a link to the public gallery and charge guests and vendors a small for to download a web ready resolution version of the photo and a slightly higher cost for prints\n\nis this a good practice? is it fair? how do you guys handle public events like this? should -----> i !!!  -----> be !!!  -----> creating !!!  private galleries for the vendors and bands that might -----> be !!!  playing and put only their photos in there and find their social media/emails to provide them the credentials, or is expecting a small fee for downloads okay?\n\njust want to make sure -----> i !!! ’m not being greedy and not doing a weird practice that others don’t do.", "sortedWord": "None", "Identifyer": null, "identifyer": 33337, "year": "2018"}, {"autor": "wunhang_lo", "date": "2018-11-09 11:03:20", "content": "Creating a photography calendar.", "link": "https://www.reddit.com/r/photography/comments/9vjjgb/creating_a_photography_calendar/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a photography calendar.", "sortedWord": "None", "Identifyer": null, "identifyer": 33418, "year": "2018"}, {"autor": "______alexa", "date": "2018-12-01 21:23:12", "content": "Feedback for a project /!/ Hi guys :) I am a photographer myself, and I am working on a project and would love to get some feedback on it. I've created a survey (it should take less than a minute to complete) and would love to hear from photography enthusiasts perspectives. Thanks in advance and I really appreciate you taking the time to do this! [https://www.surveymonkey.com/r/CGBTGTM](https://www.surveymonkey.com/r/CGBTGTM)", "link": "https://www.reddit.com/r/photography/comments/a26yzl/feedback_for_a_project/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "feedback for a project /!/ hi guys :) i am a photographer myself, and i am working on a project and would love to get some feedback on it. -----> i !!! 've -----> created !!!  a survey (it should take less than a minute to complete) and would love to hear from photography enthusiasts perspectives. thanks in advance and i really appreciate you taking the time to do this! [https://www.surveymonkey.com/r/cgbtgtm](https://www.surveymonkey.com/r/cgbtgtm)", "sortedWord": "None", "Identifyer": null, "identifyer": 33630, "year": "2018"}, {"autor": "elisa-x", "date": "2018-12-03 08:58:44", "content": "create a Christmas card? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/a2mye0/create_a_christmas_card/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  a christmas card? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 33723, "year": "2018"}, {"autor": "FlyfreshCustoms", "date": "2018-12-25 22:27:32", "content": "A message to my Contemporaries who want to get into photography. Im talking to the millennial natural light only professional “instagram photographers” here. /!/ On this fine Christmas as I finally feel free from being asked by fellow college students: “Hey man what camera should I get for christmas? My budget is...” I would like to take the time to address all of my contemporaries.\n\nLEARN THE BASICS: Get a low cost camera and a prime lens and use it for a YEAR (I know its crazy, recommending to do something consistent to college students). If your first camera is a Sony A73 you will be a shitty photographer and will be down a few grand wondering why photography is not making you happy. Canon 5d classic + 50mm 1.8 would be a good start. You don’t need all this new electronic jazz, start simple. The 5d classic is a legendary camera and can be acquired for less than $400. \n\nPeople compare cameras so often and spend much of their time trying to make a point of which camera is better and why. But photographers from the 30s like Ansel Adams used analog and took better pictures than 90% of the people arguing about which camera is best. Learn the history of photograph and understand how it has grown. Grasp the concept that people used to have to do things manually.\n\nFujifilm, Canon, Sony, Nikon, Leica, etc. all have a camera that has near superior function and use. Each brand is capable of taking a professional picture but this generation spends more time trying to figure out which camera is best out of the box with no skill and what other photographers think on youtube rather than simply picking up a camera and learning the basics of photography and lighting.\n\nSTOP FOCUSING ON FILTERS: \nLearn how to properly light a subject and stop telling yourself that your a natural light photographer. Cause really your about to drop way too much money on a camera you don’t know how to use and not have any lighting equipment! Photography is the capturing of light! Lighting is important! \n\nOnce you learn how to properly use lighting. Try not to butcher it to make the picture look trendy. One way to check that you don’t do this while editing is by using a nifty little thing called a Histogram! You can check your Blacks, shadows, mid-tones, highlights, and whites all in one place!  \n\nTRIPOD TRIPOD TRIPOD:\nHave you noticed that almost no college student uses a tripod and most professional photographers do? Believe it or not. You can take pictures for 1/125-30 seconds without them turning out blurry! Without a tripod you will not have access to &gt;1/125 shutter speed without the picture being blurry. Get a tripod\n\nNot all pictures have to be shared. And you don’t need affirmation to enjoy photography. Create a portfolio for yourself that focuses completely on how to properly photograph a subject or landscape. Keeping in mind composition, lighting, and depth of field. This will help you from feeling the need to over edit a picture!\n\nPhotography is amazing and there is so much more than instagram affirmation and getting a following because of a trendy picture you took. Please take the time to learn! We have a endless source of teaching with the internet. And maybe one day you will be able to take better pictures than photographers from the 30s using analog :)\n\nLast note: Manual modes... check it out. Automatic everything is not going to help you learn!\n\nMerry Christmas! \n\n", "link": "https://www.reddit.com/r/photography/comments/a9ixe1/a_message_to_my_contemporaries_who_want_to_get/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "a message to my contemporaries who want to get into photography. im talking to the millennial natural light only professional “instagram photographers” here. /!/ on this fine christmas as i finally feel free from being asked by fellow college students: “hey man what camera should i get for christmas? my budget is...” i would like to take the time to address all of my contemporaries.\n\nlearn the basics: get a low cost camera and a prime lens and use it for a year (i know its crazy, recommending to do something consistent to college students). if your first camera is a sony a73 you will be a shitty photographer and will be down a few grand wondering why photography is not making you happy. canon 5d classic + 50mm 1.8 would be a good start. you don’t need all this new electronic jazz, start simple. the 5d classic is a legendary camera and can be acquired for less than $400. \n\npeople compare cameras so often and spend much of their time trying to make a point of which camera is better and why. but photographers from the 30s like ansel adams used analog and took better pictures than 90% of the people arguing about which camera is best. learn the history of photograph and understand how it has grown. grasp the concept that people used to have to do things manually.\n\nfujifilm, canon, sony, nikon, leica, etc. all have a camera that has near superior function and use. each brand is capable of taking a professional picture but this generation spends more time trying to figure out which camera is best out of the box with no skill and what other photographers think on youtube rather than simply picking up a camera and learning the basics of photography and lighting.\n\nstop focusing on filters: \nlearn how to properly light a subject and stop telling yourself that your a natural light photographer. cause really your about to drop way too much money on a camera you don’t know how to use and not have any lighting equipment! photography is the capturing of light! lighting is important! \n\nonce you learn how to properly use lighting. try not to butcher it to make the picture look trendy. one way to check that you don’t do this while editing is by using a nifty little thing called a histogram! you can check your blacks, shadows, mid-tones, highlights, and whites all in one place!  \n\ntripod tripod tripod:\nhave you noticed that almost no college student uses a tripod and most professional photographers do? believe it or not. you can take pictures for 1/125-30 seconds without them turning out blurry! without a tripod you will not have access to &gt;1/125 shutter speed without the picture being blurry. get a tripod\n\nnot all pictures have to be shared. and you don’t need affirmation to enjoy photography. -----> create !!!  a portfolio for yourself that focuses completely on how to properly photograph a subject or landscape. keeping in mind composition, lighting, and depth of field. this will help you from feeling the need to over edit a picture!\n\nphotography is amazing and there is so much more than instagram affirmation and getting a following because of a trendy picture you took. please take the time to learn! we have a endless source of teaching with the internet. and maybe one day you will be able to take better pictures than photographers from the 30s using analog :)\n\nlast note: manual modes... check it out. automatic everything is not going to help you learn!\n\nmerry christmas! \n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 34611, "year": "2018"}, {"autor": "taixhi", "date": "2018-12-25 17:40:05", "content": "Created my photography portfolio from scratch and made it available on GitHub!", "link": "https://www.reddit.com/r/photography/comments/a9gnuk/created_my_photography_portfolio_from_scratch_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  my photography portfolio from scratch and made it available on github!", "sortedWord": "None", "Identifyer": null, "identifyer": 34627, "year": "2018"}, {"autor": "serraad", "date": "2018-05-07 18:26:03", "content": "Squarespace, WordPress or Wix for building a photography website? /!/ Hello everyone. I'm not much into tech, but I would like to create a website to use as a portfolio. Which CMS would you recommend?", "link": "https://www.reddit.com/r/photography/comments/8hppvv/squarespace_wordpress_or_wix_for_building_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "squarespace, wordpress or wix for building a photography website? /!/ hello everyone. -----> i !!! 'm not much into tech, but -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  a website -----> to !!!  use as a portfolio. which cms would you recommend?", "sortedWord": "None", "Identifyer": null, "identifyer": 35178, "year": "2018"}, {"autor": "KellyASD", "date": "2018-05-29 17:36:11", "content": "Instagram group for portrait photographer /!/ Hello!\n\nI would like to create a telegram group for photographers focused on portraits (variations allowed).\n\nThe aim is to increase engagements with any stretch.\nI mean without any “you must follow” or “you must like” in order to create a real connection but with benefits.\nThis is why I would like to create a community with people who have te same interests (in this case photography and portraits), so that give a like, a comment or a follow won’t be a stretch.\nBut of course it won’t be fair to join the group only for receiving likes etc. \nTo give is to receive.\n\nSo, If you are a photographer who loves portrait dm me and I will add you to the group, or drop your telegram nickname here🤞🏻", "link": "https://www.reddit.com/r/photography/comments/8n0zw4/instagram_group_for_portrait_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "instagram group for portrait photographer /!/ hello!\n\n-----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  a telegram group for photographers focused on portraits (variations allowed).\n\nthe aim is to increase engagements with any stretch.\ni mean without any “you must follow” or “you must like” in order to create a real connection but with benefits.\nthis is why i would like to create a community with people who have te same interests (in this case photography and portraits), so that give a like, a comment or a follow won’t be a stretch.\nbut of course it won’t be fair to join the group only for receiving likes etc. \nto give is to receive.\n\nso, if you are a photographer who loves portrait dm me and i will add you to the group, or drop your telegram nickname here🤞🏻", "sortedWord": "None", "Identifyer": null, "identifyer": 35492, "year": "2018"}, {"autor": "KellyASD", "date": "2018-05-29 17:25:52", "content": "Instagram group for portrait photography /!/ Hello!\n\nI would like to create a telegram group for photographers focused on portraits (variations allowed).\n\nThe aim is to increase engagements with any stretch.\nI mean without any “you must follow” or “you must like” in order to create a real connection but with benefits.\nThis is why I would like to create a community with people who have te same interests (in this case photography and portraits), so that give a like, a comment or a follow won’t be a stretch.\nBut of course it won’t be fair to join the group only for receiving likes etc. \nTo give is to receive.\n\nSo, If you are a photographer who loves portrait [click here ](https://t.me/joinchat/AnvWrxBQ6HySdzZKiostvA) to join the group🤞🏻\n\n", "link": "https://www.reddit.com/r/photography/comments/8n0wwp/instagram_group_for_portrait_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "instagram group for portrait photography /!/ hello!\n\n-----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  a telegram group for photographers focused on portraits (variations allowed).\n\nthe aim is to increase engagements with any stretch.\ni mean without any “you must follow” or “you must like” in order to create a real connection but with benefits.\nthis is why i would like to create a community with people who have te same interests (in this case photography and portraits), so that give a like, a comment or a follow won’t be a stretch.\nbut of course it won’t be fair to join the group only for receiving likes etc. \nto give is to receive.\n\nso, if you are a photographer who loves portrait [click here ](https://t.me/joinchat/anvwrxbq6hysdzzkiostva) to join the group🤞🏻\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 35496, "year": "2018"}, {"autor": "bxbleu", "date": "2018-05-29 15:46:39", "content": "Flickr &amp; 500px Relevancy /!/ So I'm relatively new to the photo game, having been shooting seriously for about 2 years now. Starting out and to this day, Instagram has been the main platform where I display most of my work and attempt to gain a following. My question is should I create a Flickr &amp; 500px accounts to get my photos seen by more eyes specifically in the photo community? or have I missed the wave?", "link": "https://www.reddit.com/r/photography/comments/8n04cw/flickr_500px_relevancy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "flickr &amp; 500px relevancy /!/ so i'm relatively new to the photo game, having been shooting seriously for about 2 years now. starting out and to this day, instagram has been the main platform where i display most of my work and attempt to gain a following. my question is should -----> i !!!  -----> create !!!  a flickr &amp; 500px accounts to get my photos seen by more eyes specifically in the photo community? or have i missed the wave?", "sortedWord": "None", "Identifyer": null, "identifyer": 35502, "year": "2018"}, {"autor": "-Bears_Beets-", "date": "2018-08-07 12:54:08", "content": "Defining my niche and starting on IG /!/ Hey there guys, I'm a long time lurker here and I've learned a lot through some posts of this subreddit so I thought, \"what better place to come with some existential doubts?\" ahah.\nI've been into photography for about 5 years now but I stopped shooting for a bit when depression got to me. I'm doing better for some time now and have restarted shooting, learning it all from the basics again and I feel really good doing it. \nMy main problem is that, after being encouraged by several people, I decided to create an IG photography only account but I can't really define my niche or how to build my follower base since I don't have a lot of friends. \nAny help is welcome and if you want to check some of my pics I post on my personal account @anafvoliveira in order to give some more insightful opinions , go ahead! \nThanks you so much and I hope I wasn't that boring!", "link": "https://www.reddit.com/r/photography/comments/95bda7/defining_my_niche_and_starting_on_ig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "defining my niche and starting on ig /!/ hey there guys, i'm a long time lurker here and i've learned a lot through some posts of this subreddit so i thought, \"what better place to come with some existential doubts?\" ahah.\ni've been into photography for about 5 years now but i stopped shooting for a bit when depression got to me. i'm doing better for some time now and have restarted shooting, learning it all from the basics again and i feel really good doing it. \nmy main problem is that, after being encouraged by several people, -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  an ig photography only account but i can't really define my niche or how to build my follower base since i don't have a lot of friends. \nany help is welcome and if you want to check some of my pics i post on my personal account @anafvoliveira in order to give some more insightful opinions , go ahead! \nthanks you so much and i hope i wasn't that boring!", "sortedWord": "None", "Identifyer": null, "identifyer": 35861, "year": "2018"}, {"autor": "Baraquito", "date": "2018-07-23 03:48:53", "content": "Software for organizing photographies? /!/ Good day!\n\nAfter reaching quite the amount of taken storage I'm looking for a Software, which could help me organize all this pictures. Earlier, when I was working with a MacBook it was quite easy doing via iPhotos, thanks to albums I was creating and face recognition software, which is really handy for my personal use.\n\nCould some of you suggest anything to me? I've tried to google &amp; search, however most of options don't do as well, as i'd love to as well as most of internet storage has quite limited space (speaking of google photos) and sawing photos not in RAW format - is pleb in my opinion.   \n\n\nSo, is there anything handy or i'm lost in the den of countless folders? ", "link": "https://www.reddit.com/r/photography/comments/913t0a/software_for_organizing_photographies/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "software for organizing photographies? /!/ good day!\n\nafter reaching quite the amount of taken storage i'm looking for a software, which could help me organize all this pictures. earlier, when -----> i !!!  -----> was !!!  working with a macbook it -----> was !!!  quite easy doing via iphotos, thanks to albums -----> i !!!  -----> was !!!  -----> creating !!!  and face recognition software, which is really handy for my personal use.\n\ncould some of you suggest anything to me? i've tried to google &amp; search, however most of options don't do as well, as i'd love to as well as most of internet storage has quite limited space (speaking of google photos) and sawing photos not in raw format - is pleb in my opinion.   \n\n\nso, is there anything handy or i'm lost in the den of countless folders? ", "sortedWord": "None", "Identifyer": null, "identifyer": 36126, "year": "2018"}, {"autor": "kiwipanda777", "date": "2018-08-15 07:19:48", "content": "Debating if I should create another Instagram account specifically for starting out on my photography journey? 🤨 /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/97gakp/debating_if_i_should_create_another_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": "debating if -----> i !!!  -----> should !!!  -----> create !!!  another instagram account specifically for starting out on my photography journey? 🤨 /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 36241, "year": "2018"}, {"autor": "effen13", "date": "2018-09-01 12:12:15", "content": "how do i get more feeling out of this photo the intent is to show my past i want to create more nostalgia in this photo", "link": "https://www.reddit.com/r/photography/comments/9c2lp7/how_do_i_get_more_feeling_out_of_this_photo_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  get more feeling out of this photo the intent is -----> to !!!  show my past -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  more nostalgia in this photo", "sortedWord": "None", "Identifyer": null, "identifyer": 36321, "year": "2018"}, {"autor": "makoualamaboko", "date": "2018-09-12 10:19:58", "content": "Hello everyone! Remember me from the \"Dumpster Fire\" post of 83,000 photos to sort? I'm done!!! It took 9 days. I'm putting the link to the original thread and I'll just stick my edit here. /!/ ## [Original post: Help! I have a fucking dumpster fire shitshow mess of 20 years of pictures totally 83,000 and 247 GB with thousands of duplicates.](https://www.reddit.com/r/photography/comments/9cc7i4/help_i_have_a_fucking_dumpster_fire_shitshow_mess/)\n\nLink\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**I'm DONE EVERYONE!!!**\n\n====================\n\nSECOND AND FINAL EDIT: 2018-09-14\n\nSo. It took about nine days. I worked on this when I had the time, but I'm finally done.\n\nHere is the commented imgur gallery of the work. It's shocking don't judge. I basically spent 2000-2006 traveling and 2 computers died, 3 hard drives crapped out, I kept backing stuff up, I got a desktop and downloaded everything, then saved it all on the same drive, exported my iPhoto library on two drives then combined the two drives.\n\nSo. There were 122,000 + photos with about 38,000 duplicates, which I only found out after I purchased Duplicate Detective for $4,99 on the App Store, because I'm on a Mac.\n\nDuplicate Detective worked for HOURS. And the little guy never crashed once. My mom even came into my office and closed my laptop...because it was open?!? and Duplicate Detective wasn't reset.\n\nI took a bit of time to spot-check his work and then deleted the 38,000 files.\n\nThen, manually I created folder structures (I've completely edited the original folder structure I had thought I would use below) and I included the screenshots.\n\nNow, I'm going to import everything into LightRoom.\n\nI just wanted to take this opportunity to thank EVERYONE ON THIS SUBREDDIT AND ON THIS POST for all the immensely helpful advice you have given me. Once I'm totally done with my photos, I will come back and organize all the different software suggestions you gave, but for the time being, I feel a bit burned out. I'm adding this edit because a number of people asked in the comments and PM'd me to keep them updated as they were in a similar situation.\n\nYou've all been great. I'm in Congo and I never could have imagined I would get the worldwide technical support you guys gave me. You really rock and Reddit is a miracle.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Processing img cnwopgqz9sl11...*\n\n*Processing img a637qjqz9sl11...*\n\n*Processing img r660yrpz9sl11...*", "link": "https://www.reddit.com/r/photography/comments/9f6gza/hello_everyone_remember_me_from_the_dumpster_fire/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hello everyone! remember me from the \"dumpster fire\" post of 83,000 photos to sort? i'm done!!! it took 9 days. i'm putting the link to the original thread and i'll just stick my edit here. /!/ ## [original post: help! i have a fucking dumpster fire shitshow mess of 20 years of pictures totally 83,000 and 247 gb with thousands of duplicates.](https://www.reddit.com/r/photography/comments/9cc7i4/help_i_have_a_fucking_dumpster_fire_shitshow_mess/)\n\nlink\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n**i'm done everyone!!!**\n\n====================\n\nsecond and final edit: 2018-09-14\n\nso. it took about nine days. i worked on this when i had the time, but i'm finally done.\n\nhere is the commented imgur gallery of the work. it's shocking don't judge. i basically spent 2000-2006 traveling and 2 computers died, 3 hard drives crapped out, i kept backing stuff up, i got a desktop and downloaded everything, then saved it all on the same drive, exported my iphoto library on two drives then combined the two drives.\n\nso. there were 122,000 + photos with about 38,000 duplicates, which i only found out after i purchased duplicate detective for $4,99 on the app store, because i'm on a mac.\n\nduplicate detective worked for hours. and the little guy never crashed once. my mom even came into my office and closed my laptop...because it was open?!? and duplicate detective wasn't reset.\n\ni took a bit of time to spot-check his work and then deleted the 38,000 files.\n\nthen, manually -----> i !!!  -----> created !!!  folder structures (-----> i !!! 've completely edited the original folder structure -----> i !!!  had thought -----> i !!!  would use below) and -----> i !!!  included the screenshots.\n\nnow, i'm going to import everything into lightroom.\n\ni just wanted to take this opportunity to thank everyone on this subreddit and on this post for all the immensely helpful advice you have given me. once i'm totally done with my photos, i will come back and organize all the different software suggestions you gave, but for the time being, i feel a bit burned out. i'm adding this edit because a number of people asked in the comments and pm'd me to keep them updated as they were in a similar situation.\n\nyou've all been great. i'm in congo and i never could have imagined i would get the worldwide technical support you guys gave me. you really rock and reddit is a miracle.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n*processing img cnwopgqz9sl11...*\n\n*processing img a637qjqz9sl11...*\n\n*processing img r660yrpz9sl11...*", "sortedWord": "None", "Identifyer": null, "identifyer": 36652, "year": "2018"}, {"autor": "Cap10Haddock", "date": "2018-10-26 17:44:58", "content": "Survey: Online Portfolio Management Tools /!/ [https://berkeley.qualtrics.com/jfe/form/SV\\_29rFaL0oNlYl7Zr](https://berkeley.qualtrics.com/jfe/form/SV_29rFaL0oNlYl7Zr)\n\n&amp;#x200B;\n\nHello! I am a student at U.C. Berkeley and as part of a class project my team is trying to understand the landscape of Online Portfolio management tools that professional and causal photographers/videographers use. We are trying to understand how easy or hard they are to work with and find ideas to improve them to make the user's life easier. \n\n&amp;#x200B;\n\nFor this, we have created a survey which can be accessed via the above link. It would be really helpful if r/photography members can share their experience with online portfolio management with us.\n\n&amp;#x200B;\n\nThanks in advance!\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9rmxpc/survey_online_portfolio_management_tools/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we have created", "selectorShort": "create", "MarkedSent": "survey: online portfolio management tools /!/ [https://berkeley.qualtrics.com/jfe/form/sv\\_29rfal0onlyl7zr](https://berkeley.qualtrics.com/jfe/form/sv_29rfal0onlyl7zr)\n\n&amp;#x200b;\n\nhello! i am a student at u.c. berkeley and as part of a class project my team is trying to understand the landscape of online portfolio management tools that professional and causal photographers/videographers use. we are trying to understand how easy or hard they are to work with and find ideas to improve them to make the user's life easier. \n\n&amp;#x200b;\n\nfor this, -----> we !!!  -----> have !!!  -----> created !!!  a survey which can be accessed via the above link. it would be really helpful if r/photography members can share their experience with online portfolio management with us.\n\n&amp;#x200b;\n\nthanks in advance!\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 37052, "year": "2018"}, {"autor": "pinkpork1990", "date": "2018-10-30 06:03:42", "content": "Help to figure out the mechanics of night photography with a properly exposed subject. /!/ I have a shoot for a magazine I'm doing this weekend, and I have some really cool ideas, involving night photography, stars, and a really simplistic shoot. The magazine cover is about dreams, and I want to create a really simple, portrait-like image of a person laying over a chair and looking back at the camera. If you have trouble picturing it, I added a photo below to help lol. For this photo, I also want to have the stars properly illuminated, but due to the long exposure, how would I avoid overexposing the subject? \n\nexample portrait pose (but draped over a chair): \n\n*Processing img csecotxsj9v11...*\n\nbut I want to have the shadows meld into the background like this:\n\n*Processing img qb6mhzktj9v11...*\n\nI also want to have the stars be fully exposed like this:\n\n*Processing img wl1xj9xzj9v11...*\n\nIf anyone has tips, please share them! About anything, from lighting to techniques to camera functions (i have a nikon d850). If it has to be photoshopped, please let me know although i would definetely prefer a raw photograph.Thanks so much everyone!! ", "link": "https://www.reddit.com/r/photography/comments/9sl9g4/help_to_figure_out_the_mechanics_of_night/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "help to figure out the mechanics of night photography with a properly exposed subject. /!/ i have a shoot for a magazine i'm doing this weekend, and i have some really cool ideas, involving night photography, stars, and a really simplistic shoot. the magazine cover is about dreams, and -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a really simple, portrait-like image of a person laying over a chair and looking back at the camera. if you have trouble picturing it, i added a photo below to help lol. for this photo, i also want to have the stars properly illuminated, but due to the long exposure, how would i avoid overexposing the subject? \n\nexample portrait pose (but draped over a chair): \n\n*processing img csecotxsj9v11...*\n\nbut i want to have the shadows meld into the background like this:\n\n*processing img qb6mhzktj9v11...*\n\ni also want to have the stars be fully exposed like this:\n\n*processing img wl1xj9xzj9v11...*\n\nif anyone has tips, please share them! about anything, from lighting to techniques to camera functions (i have a nikon d850). if it has to be photoshopped, please let me know although i would definetely prefer a raw photograph.thanks so much everyone!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 37075, "year": "2018"}, {"autor": "Shoryouken", "date": "2018-11-13 11:28:08", "content": "What inspired me to become a photographer PLUS a map of photography locations I visited in Iceland 3 years ago /!/  \n\nHello guys.\n\nI started writing my photography blog about my past trips.  \nSome of you might enjoy it and there is a useful map I created in 2016.  \nLet me know what you think and if you found this useful.\n\n[Our Icelandic Adventure](https://www.pristine-view.com/blog/2018/11/11/so-it-begins)\n\nOr if you do not want to read my Blog entry just click on:\n\n[Map](https://www.google.com/maps/d/u/0/edit?mid=1UdWUzOnxH_0KJ_XScOt8qZlNls4&amp;ll=64.74170616305199%2C-18.86649125000008&amp;z=7)\n\nHope ", "link": "https://www.reddit.com/r/photography/comments/9wo9qr/what_inspired_me_to_become_a_photographer_plus_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "what inspired me to become a photographer plus a map of photography locations i visited in iceland 3 years ago /!/  \n\nhello guys.\n\ni started writing my photography blog about my past trips.  \nsome of you might enjoy it and there is a useful map -----> i !!!  -----> created !!!  in 2016.  \nlet me know what you think and if you found this useful.\n\n[our icelandic adventure](https://www.pristine-view.com/blog/2018/11/11/so-it-begins)\n\nor if you do not want to read my blog entry just click on:\n\n[map](https://www.google.com/maps/d/u/0/edit?mid=1udwuzonxh_0kj_xscot8qzlnls4&amp;ll=64.74170616305199%2c-18.86649125000008&amp;z=7)\n\nhope ", "sortedWord": "None", "Identifyer": null, "identifyer": 37328, "year": "2018"}, {"autor": "Seagate_Surfer", "date": "2018-12-05 20:26:41", "content": "Create Like a Pro Giveaway - (Seagate, Drobo, Lowepro, &amp; Toshiba) - Ends 12/12/18 - WW", "link": "https://www.reddit.com/r/photography/comments/a3g7iw/create_like_a_pro_giveaway_seagate_drobo_lowepro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  like a pro giveaway - (seagate, drobo, lowepro, &amp; toshiba) - ends 12/12/18 - ww", "sortedWord": "None", "Identifyer": null, "identifyer": 37444, "year": "2018"}, {"autor": "brunotaut", "date": "2018-12-15 00:27:52", "content": "The Ultimate List of photo editing tools in 2018. 210 pieces of software (excluding mobile) /!/ Hey, photo lovers!\n\nAnother year passed and I’m here with the renewed list of photo editing software.\n\nThe short story behind this list: I’ve started this research for my project [Photolemur](https://photolemur.sjv.io/nLVm6) in July 2016.\n\nThe first list was '61 Photo Editing Tools and Apps'. After the very first post in 2016, I’ve got a lot of suggestions from redditors and decided to complete another list [104 Photo Editing Tools You Should Know About](https://www.reddit.com/r/photography/comments/50613q/104_photo_editing_tools_you_should_know_about/).\n\nThen, Michael Zhang, Petapixel’s Editor, asked me to repost this list on Petapixel. The article got 5,419 shares and tons of comments with a new portion of great tools for photo editing. The next list came with [148 photo editing tools](https://petapixel.com/2016/11/01/148-photo-editing-tools-apps/) Then, ten months after, I’ve published a new list [186 photo editing tools and apps. The biggest list ever existed](https://www.reddit.com/r/photography/comments/72sg6a/186_photo_editing_tools_and_apps_the_biggest_list/).\n\nToday I’m no longer with Photolemur (I’ve left Photolemur a week ago). But I decided to continue doing this research. And the next steps will be putting all this software to the website with filters and user rating option. Actually, I’ve already bought the domain :) [photo-index.com](http://www.photo-index.com)\n\nIf someone of you, redditors wants to help me with building the website - just send me a message.\n\n**What has changed in the new list:**\n\nSome of the apps had gone away from the market (you’ll find them in the list). Also, during my new research, I’ve found that there is almost 100 photo editing mobile apps on the market (in the previous list there were only 31 mobile apps). And I decided to create the separate list of photo editing mobile apps. It will be live very soon! So, there is no mobile apps section in this list. I’ve got a lot of comments about including some kind of recommendations to the list. So, the first 5 to 10 items in each section are the best one (in my personal opinion).\n\nAs always, I want to say thank you, redditors!\n\nIn the beginning, there were only 61 photo tools, and I thought that it’s a huge list!  :)\n\n**Now we have the list of 210 tools for photo editing and photo manipulation (excluding 97 mobile apps)!**\n\n* Enhancers (10)\n* Cross-platform image editors (5)\n* Online photo editors (16)\n* Paid Desktop Photo Editors (26)\n* Free Desktop Photo Editors (14)\n* RAW Processors (21)\n* HDR photo editors (15)\n* Photo viewers and managers (17)\n* Face Editing Software (9)\n* Image Enlargers &amp; Resizing Software (15) ^(new)\n* Photo Utilities, Plugins, Filters &amp; Effects (62)\n\n**Photo Enhancers**\n\n1.[Photolemur](https://photolemur.sjv.io/nLVm6) Fully automated photo enhancement solution to make all photos perfect. It is powered by an AI algorithm that fixes imperfections on images without human involvement. From $35 ($30 in 2017)\n\n2.[Perfectly Clear](http://www.athentech.com) photo editor with a set of automatic correction presets for Windows&amp;Mac. $129 ($149 in 2017)\n\n3.[Ashampoo Photo Optimizer 6](https://www.ashampoo.com/en/usd/pin/1157/multimedia-software/Ashampoo-Photo-Optimizer-6) Software revitalizes photos at the click of a button. Optimize colors and contrasts, adjust the sharpness, remove scratches and noise and realign photos - fast, simple, no prior knowledge required. $8.99 ($20 in 2017)\n\n4.[Photosense](http://veprit.com/photosense) Quick and easy batch photo enhancement software for Mac &amp; iOS. $19.99 ($18.97 in 2017)\n\n5.[Akvis Enhancer](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=25808) the program offers a fast method to fix a dark picture, improve detail on an image, increase contrast and brightness, and adjust tones. $69\n\n6.[Enhance Pho.to](http://enhance.pho.to) online photo enhancer. Lets to fix the most such problems of digital pictures: fix dull colors and bad color balance; remove digital noise; remove red-eye in photos of people\n\n7.[PhotoEQ](https://www.softcolorsoftware.com/photoeq/) SoftColor PhotoEQ makes digital image improvement simpler on your PC. PhotoEQ works with a variety of photo formats, including RAW files. $69\n\n8.^(new) [Vivd Pix Restore](https://www.vivid-pix.com/restore/buy.html) Provides 1-click improvement for scanned Color Slides, Prints (Color, Black &amp; White, Sepia) and Digital Photos. Fine-tune with easy-to-use sliders. For Mac &amp; Windows. $49.99\n\n9.^(new) [FixAnyColor](http://www.srs1software.com/FixAnyColor.aspx) Lets you selectively adjust colors in your digital photos. It combines sophisticated L*C*h\\* color processing and fuzzy logic technology with an easy-to-use interface. For Windows. $59.99\n\n10. ^(new) [PictureSpeed](https://ai.skylum.com/) Cloud-based solution for Businesses to automatically enhance images, using the power of artificial intelligence\n\n&amp;#x200B;\n\n**Cross-platform image editors**\n\n1.[Lightroom](https://lightroom.adobe.com) There is no need to present Lightroom. Now it becomes a really cross-platform photo editor. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n2.[Photoshop](https://lightroom.adobe.com) The second photo editing masterpiece from Adobe. The same story: it becomes a really cross-platform photo editor. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps)\n\n3.[polarr](https://www.polarr.co) Pro photo editor designed for everyone $2.49/Mo. (old price - $19.99)\n\n4.[Pixlr](https://pixlr.com) Online+mobile photo editor. High-end photo editing and quick filtering. $5/Mo. for Pro Subscription. (in 2017 it was Free)\n\n5.[Fotor Pro](http://www.fotor.com) cross-platform editor and designer, available on every major mobile device, desktop computer and online with One-Tap Enhance’ tool and RAW file processing. $3.33/Mo. for Pro Subscr. (in 2017 it was Free)\n\n&amp;#x200B;\n\n**Online photo editors**\n\n1.[PicMonkey](https://www.picmonkey.com/photo-editor) one of the most popular online picture editors. $7.99/Mo.\n\n2.[Befunky](https://www.befunky.com) free online photo editor and collage maker. $4.99/Mo.( Plus Plan)\n\n3.[pho.to](http://editor.pho.to) free simple online photo editor with pre-set photo effects for an instant photo fix\n\n4.[Ribbet](http://www.ribbet.com) Ribbet lets you edit all your photos online, and love every second of it. From $4.95\n\n5.[Canva](https://www.canva.com/photo-editor/) Online photo editor to filter, resize or adjust the images. Free for personal use. From $12.95/Mo.\n\n6.[Sumopaint](http://www.sumopaint.com/home/) the most versatile photo editor and painting application that works in a browser. From $9/Mo. (in 2017 it was Free)\n\n[~~Preloadr~~](http://www.preloadr.com)\n\n7.[Lunapic](http://lunapic.com/editor/) simple free online editor\n\n8.[Picture2life](https://www.picture2life.com/welcome/Default.aspx?auth=NotLoggedIn) An Ajax-based photo editor. It’s focused on grabbing and editing images that are already online. The tool selection is average\n\n[~~Pics.io~~](http://pics.io)\n\n9.[pizap](http://www.pizap.com) online photo editor and collage maker. $2.99 for Pro Plan. (in 2017 it was $29.99/year)\n\n10.[Fotostars](https://fotostars.me/en-US/) Edit your photos using stylish photo effects. Free\n\n11.[Avatan](http://avatan.ru/#/) free online photo editor&amp;collage maker\n\n12.[FotoFlexer](http://fotoflexer.com) photo editor and advanced photo effects for free\n\n[~~Image Enhancer by Canon~~](https://edge.canon.co.in/ImageEnhencer.aspx)\n\n13.^(new) [Fotojet](https://www.fotojet.com/features/photo-editor/photo-enhance.html) Software has everything you need to enhance your photos! Such as improving photos' colors, lights, sharpness etc. From $6.99/Mo.\n\n14.^(new) [FreeOnlinePhotoEditor](https://www.freeonlinephotoeditor.com) Upload your picture or photo or enter the URL of an image on the Internet. After uploading, you can resize, sharpen and/or rotate your photo. Plus several filters. Free\n\n15.^(new) [Film Emulator](https://29a.ch/film-emulator/) Online photo editor with a set of filters.  Free\n\n16.^(new) [Fun Photo Box](http://photoeditor.funphotobox.com/) Edit photos online: crop, resize, enhance, change focus, brightness, contrast, saturation &amp; warmth, add text, add stickers. Free\n\n# Desktop Photo Editors\n\n**Paid Desktop Photo Editors**\n\n1.[Photoshop](http://www.photoshop.com) mother of all photo editors. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n2.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) a photo processor and image organizer developed by Adobe Systems. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n3.[ON1 Photo RAW](https://www.on1.com/) professional photo editor with an easy-to-use interface. $99.99 per license. ($90 in 2017).\n\n4.[Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for Mac and Windows with more powerful controls than in Lightroom and the world's first AI-powered photo filter. $69\n\n5.[Affinity](https://affinity.serif.com/en-gb/photo/) Professional photo editing software for Mac. $49.99\n\n6.[DXO Photo Suite](http://www.dxo.com/us/photography) Powerful photo editing software. From 129€\n\n7.[Pixelmator](http://www.pixelmator.com/mac/) Powerful, fast, and easy-to-use image editor. $29.99\n\n8.[Capture One](https://www.phaseone.com/en/Products/Software/Capture-One-Pro/Highlights.aspx) Professional raw converter and image editing software designed for professional photographers who need to process large volumes of high-quality images in a fast and efficient workflow. $299\n\n9.[Pictorial](http://www.picktorial.com) Editor with an impressive array of powerful professional tools, such as non­destructive RAW editing, and high­ quality retouching. From $9.99/Mo ($24.99 in 2017)\n\n10.[Corel Paintshop Pro](https://store.paintshoppro.com/1184/cookie?affiliate=43964&amp;redirectto=https%3A%2F%2Fwww.paintshoppro.com%2Fen%2Fproducts%2Fpaintshop-pro%2F&amp;redirecthash=EF5E25C0206CBB9458E502D5FEAAF596) Professional photo editor with the world's fastest RAW photo processor. $80\n\n11.[Zoner](https://www.zoner.com) Everything from downloading onto your computer to editing and sharing, all in one place. For Windows only. $99\n\n12.[Radlab](https://www.gettotallyrad.com/radlab) combines intuitive browsing, gorgeous effects and a lightning-fast processing engine for image editing. $149\n\n13.[Acorn 5](http://www.flyingmeat.com/acorn/) an image editor for macOS 10.10 and later. $29.99\n\n14.[Photo Plus](http://www.serif.com/photoplus/) Easy-to-use professional photo editor for PC. $99.99\n\n15.[Photomizer](http://www.engelmann.com/en-us/photomizer.php?affChecked=1) Optimize and repair digital photos. $34.99\n\n16.[Picture Window Pro](http://www.dl-c.com) powerful photo editing tool for Win, designed for serious photographers with demanding creative and quality standards. $89.95\n\n17.[PhotoLine](http://www.pl32.net) Raster and vector graphics editor for Win&amp;Mac. Its features include 16 bits of color depth, full-color management, support of RGB, CMYK, and Lab color models, layer support, and non-destructive image manipulation. 59.00€\n\n18.[Inpixio](https://www.inpixio.com) A set of tools for photo editing including Photo Clip, Photo Editor, Photo Focus, Photo Maximizer, Photo Eraser. The software helps photo enthusiasts to delete,  cut out objects, create photo montages and optimize images. From $19.9\n\n19.[Photo Lab 4](http://www.selteco.com/photolab/) easy photo editing software for Win. $49\n\n20.[Home Photo Studio](http://home-photo-studio.com) desktop photo editing software for Windows. The program includes photo editing options, such as auto enhancement, retouching, red-eye removal, etc. More than 100 special effects can be applied to the images. From $29\n\n21.^(new) [Photoscape X Pro](http://x.photoscape.org) All-in-one photo editing software which provides photo-related features such as Photo Viewer, Editor, Cut Out, Batch, Collage, Screen Capture, RAW images and More. For Win only. $29\n\n22.^(new) [Movavi Photo Editor](https://www.movavi.com/mac-photo-editor/) Enhance image quality manually or automatically. Erase unwanted objects from photos. Remove and change image backgrounds. Crop, flip, rotate, resize and straighten pictures. For Mac &amp; Win. $19\n\n23.^(new) [Ashampoo Photo Commander 16](https://shop.ashampoo.com/10/cookie?affiliate=43964&amp;expiry=30&amp;redirectto=https%3A%2F%2Fwww.ashampoo.com%2Fp%2F2118&amp;redirecthash=E23C8D057EC1F35D355D55606C699B69) The complete solution to view, edit and organize your photos. For Win. From $49.99\n\n24.^(new) [Pixeluvo](http://www.pixeluvo.com/) A Beautifully Designed Image and Photo Editor for Win&amp;Linux. $34\n\n25.^(new) [Xara PHOTO &amp; GRAPHIC DESIGNER](http://www.xara.com/us/photo-graphic-designer/) The software choice for photo and graphic design work, with powerful photo editing and enhancement features, and flexible illustration and design tools. For Win. $59.99\n\n26.^(new) [CyberLink PhotoDirector Ultra](https://www.cyberlink.com/products/photodirector-ultra/) A wide range of easy-to-use, professional-quality tools built specifically for turning your photos into stunning artwork. $14.99/Mo.\n\n&amp;#x200B;\n\n**Free Desktop editors**\n\n1.[Apple Photos](https://www.apple.com/osx/photos/) Photos in macOS helps you keep your growing library organized and accessible. Powerful and intuitive editing tools help you perfect your images. Free\n\n2.^(new) [Microsoft Photos](https://www.apple.com/osx/photos/) View and edit your photos and videos, make movies, and create albums. Free\n\n3.[G’MIC](http://gmic.eu) Full featured framework for image processing with different user interfaces, including a GIMP plugin to convert, manipulate, filter, and visualize image data. For Win&amp;Mac\n\n4.[GIMP](http://www.gimp.org) Cross-platform image editor. Free software, you can change its source code and distribute your changes.\n\n5.[Krita](https://krita.org/en/) Digital painting and illustration application with CMYK support, HDR painting, G’MIC integration and more\n\n6.[Pinta](https://pinta-project.com/pintaproject/pinta/) Pinta is a free, open source program for drawing and image editing.\n\n7.[Photoscape](http://www.photoscape.org) a simple, unusual editor that can handle more than just photos.\n\n8.[Paint.net](http://www.getpaint.net/index.html) Free image and photo editing software for PC.\n\n9.[Imagemagick](http://www.imagemagick.org/script/index.php) A software suite to create, edit, compose or convert images on the command line.\n\n10.[Picture.st](http://picture.st) Edit, crop and share your photos.\n\n11.[Photodemon](http://photodemon.org) Free portable photo editor for Win\n\n12.^(new) [Fotoxx](https://kornelix.net/fotoxx/fotoxx.html) Free open source Linux program for image editing and collection management.\n\n13.^(new) [GraphicsMagick](http://www.graphicsmagick.org/) Comprised of 267K physical lines of source code in the base package GM provides a robust and efficient collection of tools and libraries which support reading, writing, and manipulating an image in over 88 major formats.\n\n14.^(new) [Beauty &amp; Face Photo Editor](https://www.microsoft.com/en-us/p/beauty-face-photo-editor/9ng1r7g8rh2t?activetab=pivot:overviewtab) Software lets you create amazing collages using your photos, cool stickers, backgrounds, emojis, text with fun fonts.\n\n&amp;#x200B;\n\n**RAW Processors**\n\n1.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organizer developed by Adobe Systems. $9.99/Mo. (Lr+Ps).\n\n2.[Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) Powerful photo editor for Mac&amp;Win with more powerful controls than in Lightroom and proprietary RAW processing algorithms. $69\n\n3.[Rawtherapee](http://rawtherapee.com) A cross-platform raw image processing program, released under the GNU General Public License Version 3\n\n4.[Darktable](http://www.darktable.org) An open source photography workflow application and RAW developer.\n\n5.[Aftershot Pro 3](https://store.aftershotpro.com/1184/cookie?affiliate=43964&amp;redirectto=http%3A%2F%2Fwww.aftershotpro.com%2Fen%2Fproducts%2Faftershot%2Fpro%2F&amp;redirecthash=F40CACF847344C9C859EB594109386B7) Edit faster and get back behind your camera where you belong with the world's fastest RAW photo-editing software. $69\n\n6.[RAW Pics.io](https://raw.pics.io/ru/) The most popular in-browser RAW files viewer and converter. Support the most DSLR RAW camera formats. $1.99/Mo.\n\n7.[UFRaw](http://ufraw.sourceforge.net) Utility to read and manipulate raw images from digital cameras. It can be used on its own or as a GIMP plug-in.\n\n8.[Photivo](http://photivo.org) Handles your raw files, as well as your bitmap files, in a non-destructive 16-bit processing pipeline.\n\n9.[Filmulator](https://github.com/CarVac/filmulator-gui) Streamlined raw management and editing application centered around a film-simulating tone mapping algorithm.\n\n10.[PhotoFlow](http://aferrero2707.github.io/PhotoFlow) Raw and raster image processor featuring non-destructive adjustment layers and 32-bit floating-point accuracy.\n\n11.[LightZone](http://www.lightzoneproject.org) Open-source digital darkroom software for Windows/Mac/Linux\n\n12.[RAW Photo Processor](https://www.raw-photo-processor.com/RPP/Overview.html) Raw converter for Mac OS X, supporting almost all available digital Raw formats. Free\n\n13.[Iridient Developer](http://www.iridientdigital.com/products/rawdeveloper.html) Powerful RAW image conversion application designed and optimized specifically for Mac OS X. Supports RAW image formats from over 620 digital camera models. $99\n\n14.[Photoninja](http://www.picturecode.com/index.php) Professional-grade RAW converter that delivers exceptional detail, outstanding image quality, and a distinctive, natural look. $129\n\n15.[RawDigger](http://www.rawdigger.com) Raw Image Analyzer. $19.99\n\n16.[Fastrawviewer](http://www.fastrawviewer.com) WYSIWYG RAW viewer that allows to see RAW exactly as a converter will \"see\" it, and provides RAW-based tools to estimate what a converter will be able to squeeze from the shot. From $19.99\n\n17.[Silkypix Developer Studio Pro 9](https://silkypix.isl.co.jp/en/product/dsp9/) RAW development software for professionals to enable a partial color correction by circular/gradual filter, or equips with completely new sharpness from superior outline detection algorithm. $175 ($213.90 in 2017).\n\n18.[Exposure X4](https://www.alienskin.com?rfsn=900412.b77ab) Advanced creative photo editor and organizer that improves every step in your editing workflow. $149\n\n19.[Canon Digital Photo Professional](http://www.canon-europe.com/support/camera_software/) High-performance RAW image processing, viewing and editing software for EOS digital cameras and PowerShot models with RAW capability. Free\n\n20.[Hasselblad Phocus](http://www.hasselblad.com/software/phocus) Free image processing software, which delivers the best quality RAW file processing, has been updated and expanded with new features that work seamlessly with the Hasselblad cameras.\n\n21.^(new) [DxO PhotoLab](https://www.dxo.com/dxo-photolab/) Powerful photo editing software for. From 129€\n\n&amp;#x200B;\n\n**HDR Photo Editors**\n\n1.[Aurora HDR](https://macphun.evyy.net/c/1328824/309505/3255) The most advanced HDR photo editor for Mac&amp;Win. $99\n\n2.[Photomatix](https://www.hdrsoft.com) One of the first HDR photo editors in the world for Windows and Mac. From $39\n\n3.[Hydra](http://www.creaceed.com/hydra) Lets you create beautiful HDR images by merging multiple exposures, effectively capturing both dark and bright subjects to make it more natural or to enhance scene drama. $49.99 ($60 in 2017)\n\n4.[Machinery HDR](http://www.machineryhdr.com) Easy and powerful HDR photo editor. $39\n\n5.[HDR Darkroom](http://www.everimaging.com/software/hdr-darkroom/) Fast and easy-to-use software for Mac&amp;Win for creating impressive landscape images. $89 ($90 in 2017).\n\n6.[EasyHDR](http://www.easyhdr.com) HDR image processing software for Win&amp;Mac. $35 ($39 in 2017)\n\n7.[HDRExpress](http://pinnacleimagingsystems.com/products/hdr-express-3) easy to use HDR processing software for Mac&amp;Win. $79\n\n8.[Photo-kako](http://www.photo-kako.com/en/hdr.cgi) The free online photo editor, a photo-like composite can be processed into HDR images.\n\n9.[Light Compressor](http://lightcompressor.com) Simple post processing app that lets you combine multiple exposures into a high dynamic range image for Mac. $3.99\n\n10.[Photo Engine](http://www.oloneo.com) Professional HDR Imaging, RAW Processing &amp; Dynamic Relighting. Application to offer digital photographers full control over light and exposure in real-time, as if they were still behind the lens. $149\n\n11.[Fotor HDR](http://www.fotor.com/features/hdr.html) Free online HDR photo editor.\n\n12.[Dynamic Photo HDR](http://www.mediachance.com/hdri) Next generation HDR Software with Anti-Ghosting, HDR Fusion and Unlimited Effects for Win. $59 ($65 in 2017)\n\n13.[LuminanceHDR](http://qtpfsgui.sourceforge.net) Free application to provide a workflow for HDR imaging, creation, and tone mapping.\n\n14.[HDRMerge](http://jcelaya.github.io/hdrmerge/) Free software, that combines two or more raw images into a single raw with an extended dynamic range.\n\n15.[EnfuseGUI](http://software.bergmark.com/enfusegui/Main.html) An Open Source command-line application for creating images with a better dynamic range by blending images with different exposures. Free\n\n&amp;#x200B;\n\n**Photo viewers and managers**\n\n1.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organiser developed by Adobe Systems. $9.99/Mo. for Adobe CC Plan (Lr+Ps).\n\n2.[Acdsee](http://www.acdsee.com/en/products/acdsee-ultimate-9) Photo manager, editor and RAW processor with non destructive layer adjustments all in one. Quick straighten/rotate, rename, batch tools etc. $50\n\n3.[Apple Photos](https://www.apple.com/osx/photos/) Helps you keep your growing library organized and accessible. Powerful and intuitive editing tools help you perfect your images. Free\n\n4.[Microsoft Photos](https://www.apple.com/osx/photos/) View and edit your photos and videos on Windows, make movies, and create albums. Free\n\n[~~Phase One MediaPro1~~](https://www.phaseone.com/MediaProSE)\n\n5.^(new) [Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for Mac and Windows with more powerful controls than in Lightroom and the world's first AI-powered photo filter. In December 2018 comes out with Asset Manager. $69\n\n6.[Digicam](https://www.digikam.org) Advanced digital photo management application for importing and organizing photos. Free\n\n7.[gThumb](https://wiki.gnome.org/Apps/gthumb) Image viewer and browser. Also includes an importer tool for transferring photos from cameras. Free\n\n8.[Nomacs](http://nomacs.org) Free, open source image viewer, which supports multiple platforms. You can use it for viewing all common image formats including raw and psd images.\n\n9.[Google Photos](https://photos.google.com) All your photos are backed up safely, organized and labeled automatically, so you can find them fast, and share them how you like. Free\n\n10.[FastStone](http://www.faststone.org/FSViewerDetail.htm) Fast, stable, user-friendly image browser, converter and editor. Free for Home Users. $35\n\n12.[Auslogics](http://www.auslogics.com/en/software/duplicate-file-finder/) Software for finding exact duplicate images. Free\n\n13.[Irfanview](http://www.irfanview.com)  An image-viewer with added batch editing and conversion. Rename a huge number of files in seconds, as well as resize them. Free\n\n14.[XnViewMP](http://www.xnview.com/en/) Free software for reading, viewing, and processing all your images on Mac, Win, Linux, iOS and Android\n\n15.^(new) [Cannon Irista](https://www.irista.com/)\n\n16.^(new) [Magix Photo Manager Deluxe](http://www.magix.com/us/photo-manager-deluxe/) Allows you to easily browse, sort and rediscover your most beautiful photos &amp; videos. Breathe new life into your most beautiful moments. $49.99\n\n17.^(new) [KPhotoAlbum](https://www.kphotoalbum.org/) Free tool which you can use to easily sort your images.\n\n&amp;#x200B;\n\n**Face Retouching Software**\n\n1.[PortraitPro](http://www.portraitprofessional.com) The world’s best-selling retouching software, that intelligently enhances every aspect of a portrait for beautiful results. $44.95 ($80 in 2017)\n\n2.[Portraiture](http://www.imagenomic.com/pt.aspx) Professional skin retouching software. A Photoshop, Lightroom and Aperture plugin that eliminates the tedious manual labor of selective masking and pixel-by-pixel treatments to help you achieve excellence in portrait retouching. $199.95\n\n3.[ImprovePhoto](http://improvephoto.net) basic automatic free online face retouching software.\n\n4.[Pinkmirror](https://pinkmirror.com) Online photo retouching app that automatically slims the face, lift cheeks and cleans the skin. Subscription from $30/6 Mo.\n\n5.^(new) [Picmonkey](https://www.picmonkey.com/touchup) Face editor is perfect for light photo retouching or full on digital makeup. $7.99/Mo.\n\n6.^(new) [Photolemur](https://photolemur.sjv.io/nLVm6) Fully automated photo enhancement solution to make all photos perfect. v.3 of the software includes automatic face retouching functions. $35 (old price $30)\n\n7.^(new) [Makeup Pho.to](http://makeup.pho.to/) Virtual makeup in a click: remove red eyes, get rid of acne and wrinkles and whiten the teeth. Free\n\n8.^(new) [Photo Makeup Editor](http://www.softsea.com/review/Photo-Makeup-Editor.html) Software that will make you look gorgeous in no time. It's all about making photographed people look better. For Windows only. Free\n\n9.^(new) [Makeover](http://makeovr.com/modiface/index.php) Feature the world's most advanced virtual makeover technology with industry leading facial recognition. Online, Mac, Android.\n\n&amp;#x200B;\n\n**Image Enlargers &amp; Resizing Software**\n\n1.[A.I.Gigapixel](https://topazlabs.com/ai-gigapixel/) Desktop software for Mac &amp; Win that enlarges images up to 600% with A.I. upsampling technology. $99.99\n\n2.[Inpixio Photo Maximizer](https://www.inpixio.com/photo-maximizer/) An easy to use photo editor that allows users to produce high resolution photos from any digital picture you have on your device. $59\n\n3.[ON1 Resize 2018](https://www.on1.com/products/resize/) Desktop Image Resizer for Big Prints. For Mac&amp;Win. $79.99\n\n4.[Blowup (by Alienskin)](https://www.alienskin.com/blowup/) Image enlargement app that enables you to easily create sharp enlargements at any size. $99\n\n5.[AKVIS Magnifier](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=30645) The program allows enlarging an image to a super-high resolution of up to 300,000 x 300,000 pixels, making a 90 gigapixel poster. $89\n\n6.[Let's Enhance](https://letsenhance.io) Cloud solution for upscaling images 4x times + noise removal. $6.99/Mo.\n\n7.[Fotophire Maximizer](https://photo.wondershare.com/photo-maximizer.html) Desktop software for Windows that enlarge your photo by 1000% without losing quality. $29.99 / 1 Year Subscr.\n\n8.[PhotoEnlarger](https://www.photoenlarger.com/) Free online image enlarge service.\n\n9.[ImageEnlarger](https://www.imageenlarger.com/) Another free online image enlarge service.\n\n10.[A Sharper Scaling](http://a-sharper-scaling.com/) A high-quality image scaling technology mainly developed for upscaling. An implementation for Win is available as freeware.\n\n11.[SmillaEnlarger](https://smillaenlarger.soft112.com/) Small graphical tool (based on Qt) to resize, especially magnify bitmaps in high quality. The app is currently available in English and it was last updated on 2010-04-08. The program can be installed on OS X Linux Vista. Free\n\n12.[Reshade](http://reshade.com/) Free desktop image enlarger (up to 400%) for Win\n\n13.[PhotoZoom Pro 7](https://www.benvista.com/photozoompro) Desktop software for Mac&amp;Win. Software not only creates larger images than any other software (up to 1 million by 1 million pixels), it also produces higher quality results. €159.00\n\n14.[Stoik Start resizer](http://www.stoik.com/products/photo/STOIK-Smart-Resizer/) Reduce or Enlarge Images up to 1000% Without Losing Quality. $49\n\n15.[Super Resolution](https://superresolution.skylum.com/) The new generation of image upscaling for Businesses, powered by Artificial Intelligence. Cloud solution. Price by the request\n\n&amp;#x200B;\n\n", "link": "https://www.reddit.com/r/photography/comments/a6ak27/the_ultimate_list_of_photo_editing_tools_in_2018/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": "the ultimate list of photo editing tools in 2018. 210 pieces of software (excluding mobile) /!/ hey, photo lovers!\n\nanother year passed and i’m here with the renewed list of photo editing software.\n\nthe short story behind this list: i’ve started this research for my project [photolemur](https://photolemur.sjv.io/nlvm6) in july 2016.\n\nthe first list was '61 photo editing tools and apps'. after the very first post in 2016, i’ve got a lot of suggestions from redditors and decided to complete another list [104 photo editing tools you should know about](https://www.reddit.com/r/photography/comments/50613q/104_photo_editing_tools_you_should_know_about/).\n\nthen, michael zhang, petapixel’s editor, asked me to repost this list on petapixel. the article got 5,419 shares and tons of comments with a new portion of great tools for photo editing. the next list came with [148 photo editing tools](https://petapixel.com/2016/11/01/148-photo-editing-tools-apps/) then, ten months after, i’ve published a new list [186 photo editing tools and apps. the biggest list ever existed](https://www.reddit.com/r/photography/comments/72sg6a/186_photo_editing_tools_and_apps_the_biggest_list/).\n\ntoday i’m no longer with photolemur (i’ve left photolemur a week ago). but i decided to continue doing this research. and the next steps will be putting all this software to the website with filters and user rating option. actually, i’ve already bought the domain :) [photo-index.com](http://www.photo-index.com)\n\nif someone of you, redditors wants to help me with building the website - just send me a message.\n\n**what has changed in the new list:**\n\nsome of the apps had gone away from the market (you’ll find them in the list). also, during my new research, i’ve found that there is almost 100 photo editing mobile apps on the market (in the previous list there were only 31 mobile apps). and -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  the separate list of photo editing mobile apps. it will be live very soon! so, there is no mobile apps section in this list. i’ve got a lot of comments about including some kind of recommendations to the list. so, the first 5 to 10 items in each section are the best one (in my personal opinion).\n\nas always, i want to say thank you, redditors!\n\nin the beginning, there were only 61 photo tools, and i thought that it’s a huge list!  :)\n\n**now we have the list of 210 tools for photo editing and photo manipulation (excluding 97 mobile apps)!**\n\n* enhancers (10)\n* cross-platform image editors (5)\n* online photo editors (16)\n* paid desktop photo editors (26)\n* free desktop photo editors (14)\n* raw processors (21)\n* hdr photo editors (15)\n* photo viewers and managers (17)\n* face editing software (9)\n* image enlargers &amp; resizing software (15) ^(new)\n* photo utilities, plugins, filters &amp; effects (62)\n\n**photo enhancers**\n\n1.[photolemur](https://photolemur.sjv.io/nlvm6) fully automated photo enhancement solution to make all photos perfect. it is powered by an ai algorithm that fixes imperfections on images without human involvement. from $35 ($30 in 2017)\n\n2.[perfectly clear](http://www.athentech.com) photo editor with a set of automatic correction presets for windows&amp;mac. $129 ($149 in 2017)\n\n3.[ashampoo photo optimizer 6](https://www.ashampoo.com/en/usd/pin/1157/multimedia-software/ashampoo-photo-optimizer-6) software revitalizes photos at the click of a button. optimize colors and contrasts, adjust the sharpness, remove scratches and noise and realign photos - fast, simple, no prior knowledge required. $8.99 ($20 in 2017)\n\n4.[photosense](http://veprit.com/photosense) quick and easy batch photo enhancement software for mac &amp; ios. $19.99 ($18.97 in 2017)\n\n5.[akvis enhancer](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=25808) the program offers a fast method to fix a dark picture, improve detail on an image, increase contrast and brightness, and adjust tones. $69\n\n6.[enhance pho.to](http://enhance.pho.to) online photo enhancer. lets to fix the most such problems of digital pictures: fix dull colors and bad color balance; remove digital noise; remove red-eye in photos of people\n\n7.[photoeq](https://www.softcolorsoftware.com/photoeq/) softcolor photoeq makes digital image improvement simpler on your pc. photoeq works with a variety of photo formats, including raw files. $69\n\n8.^(new) [vivd pix restore](https://www.vivid-pix.com/restore/buy.html) provides 1-click improvement for scanned color slides, prints (color, black &amp; white, sepia) and digital photos. fine-tune with easy-to-use sliders. for mac &amp; windows. $49.99\n\n9.^(new) [fixanycolor](http://www.srs1software.com/fixanycolor.aspx) lets you selectively adjust colors in your digital photos. it combines sophisticated l*c*h\\* color processing and fuzzy logic technology with an easy-to-use interface. for windows. $59.99\n\n10. ^(new) [picturespeed](https://ai.skylum.com/) cloud-based solution for businesses to automatically enhance images, using the power of artificial intelligence\n\n&amp;#x200b;\n\n**cross-platform image editors**\n\n1.[lightroom](https://lightroom.adobe.com) there is no need to present lightroom. now it becomes a really cross-platform photo editor. $9.99/mo. for adobe cc photography plan (lr+ps).\n\n2.[photoshop](https://lightroom.adobe.com) the second photo editing masterpiece from adobe. the same story: it becomes a really cross-platform photo editor. $9.99/mo. for adobe cc photography plan (lr+ps)\n\n3.[polarr](https://www.polarr.co) pro photo editor designed for everyone $2.49/mo. (old price - $19.99)\n\n4.[pixlr](https://pixlr.com) online+mobile photo editor. high-end photo editing and quick filtering. $5/mo. for pro subscription. (in 2017 it was free)\n\n5.[fotor pro](http://www.fotor.com) cross-platform editor and designer, available on every major mobile device, desktop computer and online with one-tap enhance’ tool and raw file processing. $3.33/mo. for pro subscr. (in 2017 it was free)\n\n&amp;#x200b;\n\n**online photo editors**\n\n1.[picmonkey](https://www.picmonkey.com/photo-editor) one of the most popular online picture editors. $7.99/mo.\n\n2.[befunky](https://www.befunky.com) free online photo editor and collage maker. $4.99/mo.( plus plan)\n\n3.[pho.to](http://editor.pho.to) free simple online photo editor with pre-set photo effects for an instant photo fix\n\n4.[ribbet](http://www.ribbet.com) ribbet lets you edit all your photos online, and love every second of it. from $4.95\n\n5.[canva](https://www.canva.com/photo-editor/) online photo editor to filter, resize or adjust the images. free for personal use. from $12.95/mo.\n\n6.[sumopaint](http://www.sumopaint.com/home/) the most versatile photo editor and painting application that works in a browser. from $9/mo. (in 2017 it was free)\n\n[~~preloadr~~](http://www.preloadr.com)\n\n7.[lunapic](http://lunapic.com/editor/) simple free online editor\n\n8.[picture2life](https://www.picture2life.com/welcome/default.aspx?auth=notloggedin) an ajax-based photo editor. it’s focused on grabbing and editing images that are already online. the tool selection is average\n\n[~~pics.io~~](http://pics.io)\n\n9.[pizap](http://www.pizap.com) online photo editor and collage maker. $2.99 for pro plan. (in 2017 it was $29.99/year)\n\n10.[fotostars](https://fotostars.me/en-us/) edit your photos using stylish photo effects. free\n\n11.[avatan](http://avatan.ru/#/) free online photo editor&amp;collage maker\n\n12.[fotoflexer](http://fotoflexer.com) photo editor and advanced photo effects for free\n\n[~~image enhancer by canon~~](https://edge.canon.co.in/imageenhencer.aspx)\n\n13.^(new) [fotojet](https://www.fotojet.com/features/photo-editor/photo-enhance.html) software has everything you need to enhance your photos! such as improving photos' colors, lights, sharpness etc. from $6.99/mo.\n\n14.^(new) [freeonlinephotoeditor](https://www.freeonlinephotoeditor.com) upload your picture or photo or enter the url of an image on the internet. after uploading, you can resize, sharpen and/or rotate your photo. plus several filters. free\n\n15.^(new) [film emulator](https://29a.ch/film-emulator/) online photo editor with a set of filters.  free\n\n16.^(new) [fun photo box](http://photoeditor.funphotobox.com/) edit photos online: crop, resize, enhance, change focus, brightness, contrast, saturation &amp; warmth, add text, add stickers. free\n\n# desktop photo editors\n\n**paid desktop photo editors**\n\n1.[photoshop](http://www.photoshop.com) mother of all photo editors. $9.99/mo. for adobe cc photography plan (lr+ps).\n\n2.[lightroom](http://www.adobe.com/products/photoshop-lightroom.html) a photo processor and image organizer developed by adobe systems. $9.99/mo. for adobe cc photography plan (lr+ps).\n\n3.[on1 photo raw](https://www.on1.com/) professional photo editor with an easy-to-use interface. $99.99 per license. ($90 in 2017).\n\n4.[luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for mac and windows with more powerful controls than in lightroom and the world's first ai-powered photo filter. $69\n\n5.[affinity](https://affinity.serif.com/en-gb/photo/) professional photo editing software for mac. $49.99\n\n6.[dxo photo suite](http://www.dxo.com/us/photography) powerful photo editing software. from 129€\n\n7.[pixelmator](http://www.pixelmator.com/mac/) powerful, fast, and easy-to-use image editor. $29.99\n\n8.[capture one](https://www.phaseone.com/en/products/software/capture-one-pro/highlights.aspx) professional raw converter and image editing software designed for professional photographers who need to process large volumes of high-quality images in a fast and efficient workflow. $299\n\n9.[pictorial](http://www.picktorial.com) editor with an impressive array of powerful professional tools, such as non­destructive raw editing, and high­ quality retouching. from $9.99/mo ($24.99 in 2017)\n\n10.[corel paintshop pro](https://store.paintshoppro.com/1184/cookie?affiliate=43964&amp;redirectto=https%3a%2f%2fwww.paintshoppro.com%2fen%2fproducts%2fpaintshop-pro%2f&amp;redirecthash=ef5e25c0206cbb9458e502d5feaaf596) professional photo editor with the world's fastest raw photo processor. $80\n\n11.[zoner](https://www.zoner.com) everything from downloading onto your computer to editing and sharing, all in one place. for windows only. $99\n\n12.[radlab](https://www.gettotallyrad.com/radlab) combines intuitive browsing, gorgeous effects and a lightning-fast processing engine for image editing. $149\n\n13.[acorn 5](http://www.flyingmeat.com/acorn/) an image editor for macos 10.10 and later. $29.99\n\n14.[photo plus](http://www.serif.com/photoplus/) easy-to-use professional photo editor for pc. $99.99\n\n15.[photomizer](http://www.engelmann.com/en-us/photomizer.php?affchecked=1) optimize and repair digital photos. $34.99\n\n16.[picture window pro](http://www.dl-c.com) powerful photo editing tool for win, designed for serious photographers with demanding creative and quality standards. $89.95\n\n17.[photoline](http://www.pl32.net) raster and vector graphics editor for win&amp;mac. its features include 16 bits of color depth, full-color management, support of rgb, cmyk, and lab color models, layer support, and non-destructive image manipulation. 59.00€\n\n18.[inpixio](https://www.inpixio.com) a set of tools for photo editing including photo clip, photo editor, photo focus, photo maximizer, photo eraser. the software helps photo enthusiasts to delete,  cut out objects, create photo montages and optimize images. from $19.9\n\n19.[photo lab 4](http://www.selteco.com/photolab/) easy photo editing software for win. $49\n\n20.[home photo studio](http://home-photo-studio.com) desktop photo editing software for windows. the program includes photo editing options, such as auto enhancement, retouching, red-eye removal, etc. more than 100 special effects can be applied to the images. from $29\n\n21.^(new) [photoscape x pro](http://x.photoscape.org) all-in-one photo editing software which provides photo-related features such as photo viewer, editor, cut out, batch, collage, screen capture, raw images and more. for win only. $29\n\n22.^(new) [movavi photo editor](https://www.movavi.com/mac-photo-editor/) enhance image quality manually or automatically. erase unwanted objects from photos. remove and change image backgrounds. crop, flip, rotate, resize and straighten pictures. for mac &amp; win. $19\n\n23.^(new) [ashampoo photo commander 16](https://shop.ashampoo.com/10/cookie?affiliate=43964&amp;expiry=30&amp;redirectto=https%3a%2f%2fwww.ashampoo.com%2fp%2f2118&amp;redirecthash=e23c8d057ec1f35d355d55606c699b69) the complete solution to view, edit and organize your photos. for win. from $49.99\n\n24.^(new) [pixeluvo](http://www.pixeluvo.com/) a beautifully designed image and photo editor for win&amp;linux. $34\n\n25.^(new) [xara photo &amp; graphic designer](http://www.xara.com/us/photo-graphic-designer/) the software choice for photo and graphic design work, with powerful photo editing and enhancement features, and flexible illustration and design tools. for win. $59.99\n\n26.^(new) [cyberlink photodirector ultra](https://www.cyberlink.com/products/photodirector-ultra/) a wide range of easy-to-use, professional-quality tools built specifically for turning your photos into stunning artwork. $14.99/mo.\n\n&amp;#x200b;\n\n**free desktop editors**\n\n1.[apple photos](https://www.apple.com/osx/photos/) photos in macos helps you keep your growing library organized and accessible. powerful and intuitive editing tools help you perfect your images. free\n\n2.^(new) [microsoft photos](https://www.apple.com/osx/photos/) view and edit your photos and videos, make movies, and create albums. free\n\n3.[g’mic](http://gmic.eu) full featured framework for image processing with different user interfaces, including a gimp plugin to convert, manipulate, filter, and visualize image data. for win&amp;mac\n\n4.[gimp](http://www.gimp.org) cross-platform image editor. free software, you can change its source code and distribute your changes.\n\n5.[krita](https://krita.org/en/) digital painting and illustration application with cmyk support, hdr painting, g’mic integration and more\n\n6.[pinta](https://pinta-project.com/pintaproject/pinta/) pinta is a free, open source program for drawing and image editing.\n\n7.[photoscape](http://www.photoscape.org) a simple, unusual editor that can handle more than just photos.\n\n8.[paint.net](http://www.getpaint.net/index.html) free image and photo editing software for pc.\n\n9.[imagemagick](http://www.imagemagick.org/script/index.php) a software suite to create, edit, compose or convert images on the command line.\n\n10.[picture.st](http://picture.st) edit, crop and share your photos.\n\n11.[photodemon](http://photodemon.org) free portable photo editor for win\n\n12.^(new) [fotoxx](https://kornelix.net/fotoxx/fotoxx.html) free open source linux program for image editing and collection management.\n\n13.^(new) [graphicsmagick](http://www.graphicsmagick.org/) comprised of 267k physical lines of source code in the base package gm provides a robust and efficient collection of tools and libraries which support reading, writing, and manipulating an image in over 88 major formats.\n\n14.^(new) [beauty &amp; face photo editor](https://www.microsoft.com/en-us/p/beauty-face-photo-editor/9ng1r7g8rh2t?activetab=pivot:overviewtab) software lets you create amazing collages using your photos, cool stickers, backgrounds, emojis, text with fun fonts.\n\n&amp;#x200b;\n\n**raw processors**\n\n1.[lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organizer developed by adobe systems. $9.99/mo. (lr+ps).\n\n2.[luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for mac&amp;win with more powerful controls than in lightroom and proprietary raw processing algorithms. $69\n\n3.[rawtherapee](http://rawtherapee.com) a cross-platform raw image processing program, released under the gnu general public license version 3\n\n4.[darktable](http://www.darktable.org) an open source photography workflow application and raw developer.\n\n5.[aftershot pro 3](https://store.aftershotpro.com/1184/cookie?affiliate=43964&amp;redirectto=http%3a%2f%2fwww.aftershotpro.com%2fen%2fproducts%2faftershot%2fpro%2f&amp;redirecthash=f40cacf847344c9c859eb594109386b7) edit faster and get back behind your camera where you belong with the world's fastest raw photo-editing software. $69\n\n6.[raw pics.io](https://raw.pics.io/ru/) the most popular in-browser raw files viewer and converter. support the most dslr raw camera formats. $1.99/mo.\n\n7.[ufraw](http://ufraw.sourceforge.net) utility to read and manipulate raw images from digital cameras. it can be used on its own or as a gimp plug-in.\n\n8.[photivo](http://photivo.org) handles your raw files, as well as your bitmap files, in a non-destructive 16-bit processing pipeline.\n\n9.[filmulator](https://github.com/carvac/filmulator-gui) streamlined raw management and editing application centered around a film-simulating tone mapping algorithm.\n\n10.[photoflow](http://aferrero2707.github.io/photoflow) raw and raster image processor featuring non-destructive adjustment layers and 32-bit floating-point accuracy.\n\n11.[lightzone](http://www.lightzoneproject.org) open-source digital darkroom software for windows/mac/linux\n\n12.[raw photo processor](https://www.raw-photo-processor.com/rpp/overview.html) raw converter for mac os x, supporting almost all available digital raw formats. free\n\n13.[iridient developer](http://www.iridientdigital.com/products/rawdeveloper.html) powerful raw image conversion application designed and optimized specifically for mac os x. supports raw image formats from over 620 digital camera models. $99\n\n14.[photoninja](http://www.picturecode.com/index.php) professional-grade raw converter that delivers exceptional detail, outstanding image quality, and a distinctive, natural look. $129\n\n15.[rawdigger](http://www.rawdigger.com) raw image analyzer. $19.99\n\n16.[fastrawviewer](http://www.fastrawviewer.com) wysiwyg raw viewer that allows to see raw exactly as a converter will \"see\" it, and provides raw-based tools to estimate what a converter will be able to squeeze from the shot. from $19.99\n\n17.[silkypix developer studio pro 9](https://silkypix.isl.co.jp/en/product/dsp9/) raw development software for professionals to enable a partial color correction by circular/gradual filter, or equips with completely new sharpness from superior outline detection algorithm. $175 ($213.90 in 2017).\n\n18.[exposure x4](https://www.alienskin.com?rfsn=900412.b77ab) advanced creative photo editor and organizer that improves every step in your editing workflow. $149\n\n19.[canon digital photo professional](http://www.canon-europe.com/support/camera_software/) high-performance raw image processing, viewing and editing software for eos digital cameras and powershot models with raw capability. free\n\n20.[hasselblad phocus](http://www.hasselblad.com/software/phocus) free image processing software, which delivers the best quality raw file processing, has been updated and expanded with new features that work seamlessly with the hasselblad cameras.\n\n21.^(new) [dxo photolab](https://www.dxo.com/dxo-photolab/) powerful photo editing software for. from 129€\n\n&amp;#x200b;\n\n**hdr photo editors**\n\n1.[aurora hdr](https://macphun.evyy.net/c/1328824/309505/3255) the most advanced hdr photo editor for mac&amp;win. $99\n\n2.[photomatix](https://www.hdrsoft.com) one of the first hdr photo editors in the world for windows and mac. from $39\n\n3.[hydra](http://www.creaceed.com/hydra) lets you create beautiful hdr images by merging multiple exposures, effectively capturing both dark and bright subjects to make it more natural or to enhance scene drama. $49.99 ($60 in 2017)\n\n4.[machinery hdr](http://www.machineryhdr.com) easy and powerful hdr photo editor. $39\n\n5.[hdr darkroom](http://www.everimaging.com/software/hdr-darkroom/) fast and easy-to-use software for mac&amp;win for creating impressive landscape images. $89 ($90 in 2017).\n\n6.[easyhdr](http://www.easyhdr.com) hdr image processing software for win&amp;mac. $35 ($39 in 2017)\n\n7.[hdrexpress](http://pinnacleimagingsystems.com/products/hdr-express-3) easy to use hdr processing software for mac&amp;win. $79\n\n8.[photo-kako](http://www.photo-kako.com/en/hdr.cgi) the free online photo editor, a photo-like composite can be processed into hdr images.\n\n9.[light compressor](http://lightcompressor.com) simple post processing app that lets you combine multiple exposures into a high dynamic range image for mac. $3.99\n\n10.[photo engine](http://www.oloneo.com) professional hdr imaging, raw processing &amp; dynamic relighting. application to offer digital photographers full control over light and exposure in real-time, as if they were still behind the lens. $149\n\n11.[fotor hdr](http://www.fotor.com/features/hdr.html) free online hdr photo editor.\n\n12.[dynamic photo hdr](http://www.mediachance.com/hdri) next generation hdr software with anti-ghosting, hdr fusion and unlimited effects for win. $59 ($65 in 2017)\n\n13.[luminancehdr](http://qtpfsgui.sourceforge.net) free application to provide a workflow for hdr imaging, creation, and tone mapping.\n\n14.[hdrmerge](http://jcelaya.github.io/hdrmerge/) free software, that combines two or more raw images into a single raw with an extended dynamic range.\n\n15.[enfusegui](http://software.bergmark.com/enfusegui/main.html) an open source command-line application for creating images with a better dynamic range by blending images with different exposures. free\n\n&amp;#x200b;\n\n**photo viewers and managers**\n\n1.[lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organiser developed by adobe systems. $9.99/mo. for adobe cc plan (lr+ps).\n\n2.[acdsee](http://www.acdsee.com/en/products/acdsee-ultimate-9) photo manager, editor and raw processor with non destructive layer adjustments all in one. quick straighten/rotate, rename, batch tools etc. $50\n\n3.[apple photos](https://www.apple.com/osx/photos/) helps you keep your growing library organized and accessible. powerful and intuitive editing tools help you perfect your images. free\n\n4.[microsoft photos](https://www.apple.com/osx/photos/) view and edit your photos and videos on windows, make movies, and create albums. free\n\n[~~phase one mediapro1~~](https://www.phaseone.com/mediaprose)\n\n5.^(new) [luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for mac and windows with more powerful controls than in lightroom and the world's first ai-powered photo filter. in december 2018 comes out with asset manager. $69\n\n6.[digicam](https://www.digikam.org) advanced digital photo management application for importing and organizing photos. free\n\n7.[gthumb](https://wiki.gnome.org/apps/gthumb) image viewer and browser. also includes an importer tool for transferring photos from cameras. free\n\n8.[nomacs](http://nomacs.org) free, open source image viewer, which supports multiple platforms. you can use it for viewing all common image formats including raw and psd images.\n\n9.[google photos](https://photos.google.com) all your photos are backed up safely, organized and labeled automatically, so you can find them fast, and share them how you like. free\n\n10.[faststone](http://www.faststone.org/fsviewerdetail.htm) fast, stable, user-friendly image browser, converter and editor. free for home users. $35\n\n12.[auslogics](http://www.auslogics.com/en/software/duplicate-file-finder/) software for finding exact duplicate images. free\n\n13.[irfanview](http://www.irfanview.com)  an image-viewer with added batch editing and conversion. rename a huge number of files in seconds, as well as resize them. free\n\n14.[xnviewmp](http://www.xnview.com/en/) free software for reading, viewing, and processing all your images on mac, win, linux, ios and android\n\n15.^(new) [cannon irista](https://www.irista.com/)\n\n16.^(new) [magix photo manager deluxe](http://www.magix.com/us/photo-manager-deluxe/) allows you to easily browse, sort and rediscover your most beautiful photos &amp; videos. breathe new life into your most beautiful moments. $49.99\n\n17.^(new) [kphotoalbum](https://www.kphotoalbum.org/) free tool which you can use to easily sort your images.\n\n&amp;#x200b;\n\n**face retouching software**\n\n1.[portraitpro](http://www.portraitprofessional.com) the world’s best-selling retouching software, that intelligently enhances every aspect of a portrait for beautiful results. $44.95 ($80 in 2017)\n\n2.[portraiture](http://www.imagenomic.com/pt.aspx) professional skin retouching software. a photoshop, lightroom and aperture plugin that eliminates the tedious manual labor of selective masking and pixel-by-pixel treatments to help you achieve excellence in portrait retouching. $199.95\n\n3.[improvephoto](http://improvephoto.net) basic automatic free online face retouching software.\n\n4.[pinkmirror](https://pinkmirror.com) online photo retouching app that automatically slims the face, lift cheeks and cleans the skin. subscription from $30/6 mo.\n\n5.^(new) [picmonkey](https://www.picmonkey.com/touchup) face editor is perfect for light photo retouching or full on digital makeup. $7.99/mo.\n\n6.^(new) [photolemur](https://photolemur.sjv.io/nlvm6) fully automated photo enhancement solution to make all photos perfect. v.3 of the software includes automatic face retouching functions. $35 (old price $30)\n\n7.^(new) [makeup pho.to](http://makeup.pho.to/) virtual makeup in a click: remove red eyes, get rid of acne and wrinkles and whiten the teeth. free\n\n8.^(new) [photo makeup editor](http://www.softsea.com/review/photo-makeup-editor.html) software that will make you look gorgeous in no time. it's all about making photographed people look better. for windows only. free\n\n9.^(new) [makeover](http://makeovr.com/modiface/index.php) feature the world's most advanced virtual makeover technology with industry leading facial recognition. online, mac, android.\n\n&amp;#x200b;\n\n**image enlargers &amp; resizing software**\n\n1.[a.i.gigapixel](https://topazlabs.com/ai-gigapixel/) desktop software for mac &amp; win that enlarges images up to 600% with a.i. upsampling technology. $99.99\n\n2.[inpixio photo maximizer](https://www.inpixio.com/photo-maximizer/) an easy to use photo editor that allows users to produce high resolution photos from any digital picture you have on your device. $59\n\n3.[on1 resize 2018](https://www.on1.com/products/resize/) desktop image resizer for big prints. for mac&amp;win. $79.99\n\n4.[blowup (by alienskin)](https://www.alienskin.com/blowup/) image enlargement app that enables you to easily create sharp enlargements at any size. $99\n\n5.[akvis magnifier](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=30645) the program allows enlarging an image to a super-high resolution of up to 300,000 x 300,000 pixels, making a 90 gigapixel poster. $89\n\n6.[let's enhance](https://letsenhance.io) cloud solution for upscaling images 4x times + noise removal. $6.99/mo.\n\n7.[fotophire maximizer](https://photo.wondershare.com/photo-maximizer.html) desktop software for windows that enlarge your photo by 1000% without losing quality. $29.99 / 1 year subscr.\n\n8.[photoenlarger](https://www.photoenlarger.com/) free online image enlarge service.\n\n9.[imageenlarger](https://www.imageenlarger.com/) another free online image enlarge service.\n\n10.[a sharper scaling](http://a-sharper-scaling.com/) a high-quality image scaling technology mainly developed for upscaling. an implementation for win is available as freeware.\n\n11.[smillaenlarger](https://smillaenlarger.soft112.com/) small graphical tool (based on qt) to resize, especially magnify bitmaps in high quality. the app is currently available in english and it was last updated on 2010-04-08. the program can be installed on os x linux vista. free\n\n12.[reshade](http://reshade.com/) free desktop image enlarger (up to 400%) for win\n\n13.[photozoom pro 7](https://www.benvista.com/photozoompro) desktop software for mac&amp;win. software not only creates larger images than any other software (up to 1 million by 1 million pixels), it also produces higher quality results. €159.00\n\n14.[stoik start resizer](http://www.stoik.com/products/photo/stoik-smart-resizer/) reduce or enlarge images up to 1000% without losing quality. $49\n\n15.[super resolution](https://superresolution.skylum.com/) the new generation of image upscaling for businesses, powered by artificial intelligence. cloud solution. price by the request\n\n&amp;#x200b;\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 37582, "year": "2018"}, {"autor": "play4hours", "date": "2018-12-19 23:45:23", "content": "Hats off to Wedding Photographers and the like /!/ I wanted to take a moment to recognize photographers in the Wedding and Portrait industry. Your work is really set apart from many of us here. \n\nI enjoy landscapes, wildlife, abstract, and even some commercial work. My camera meter is telling me what to do as I take my time to make exposure adjustments. My phone is telling me exactly when the sun will set for optimal lighting. I create a creative composition, and with some (lots) of luck, viola! Beautiful landscape. \n\nYou however, accept a challenge to meet the customer’s expectation (ah hm, high expectation) without having any idea of what lighting will be like, what the weather will be, what mood someone will be in, how they’ll dress, etc etc all in a constantly changing environment referred to as a wedding. \n\nI don’t really know how you do it, but I really REALLY admire what you do. \n\nWhile I can sit back and release the shutter a hundred times over until I like what I see, you get one shot. And it better be good! \n\nI’d love for any of you to share some insight on the life of a wedding photographer. What steps do you take to ensure success, despite the constant unknowns???", "link": "https://www.reddit.com/r/photography/comments/a7s14o/hats_off_to_wedding_photographers_and_the_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hats off to wedding photographers and the like /!/ i wanted to take a moment to recognize photographers in the wedding and portrait industry. your work is really set apart from many of us here. \n\ni enjoy landscapes, wildlife, abstract, and even some commercial work. my camera meter is telling me what to do as i take my time to make exposure adjustments. my phone is telling me exactly when the sun will set for optimal lighting. -----> i !!!  -----> create !!!  a creative composition, and with some (lots) of luck, viola! beautiful landscape. \n\nyou however, accept a challenge to meet the customer’s expectation (ah hm, high expectation) without having any idea of what lighting will be like, what the weather will be, what mood someone will be in, how they’ll dress, etc etc all in a constantly changing environment referred to as a wedding. \n\ni don’t really know how you do it, but i really really admire what you do. \n\nwhile i can sit back and release the shutter a hundred times over until i like what i see, you get one shot. and it better be good! \n\ni’d love for any of you to share some insight on the life of a wedding photographer. what steps do you take to ensure success, despite the constant unknowns???", "sortedWord": "None", "Identifyer": null, "identifyer": 37832, "year": "2018"}], "name": "createphotography2018"}