{"interestingcomments": [{"autor": "abdellah95", "date": "2021-05-02 06:17:14", "content": "i create this design what do you think about it ? thanks !", "link": "https://www.reddit.com/r/photography/comments/n30i5w/i_create_this_design_what_do_you_think_about_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> create !!!  this design what do you think about it ? thanks !", "sortedWord": "None", "Identifyer": null, "identifyer": 97224, "year": "2021"}, {"autor": "rrhuleva", "date": "2021-08-31 21:46:27", "content": "Have we gone a bit insane? /!/ So I am a bit confused…maybe even a completely confused.\n\nGoing back to my early photography days we were shooting with film. I’m sure a good number of you have at least some experience shooting film as well!\n\nRemember how there was kind of an unspoken rule…maybe an understanding, if you will, that you should usually choose the slowest film speed you could for a given shoot? Of course, if you were not using flash you would try to choose a film speed that would match the expected natural light conditions.\n\nThe caveat was always that you did not want any faster film than necessary as faster film speeds would introduce more film grain! Back then, apparently we thought grain was bad!\n\nDecades later we have amazing digital sensors to capture extraordinarily clean images…even at somewhat high ISO (the digital similarity to film speed). But even as good as they are we still get digital noise (the digital similarity to grain) at times. So to further clean all noise from our images, we engage in a multitude of noise reduction techniques…and even spend additional money to purchase the latest generation of AI noise reduction tools!\n\nAt the end of all of this digital technology and artist’s efforts, we have some amazing, clean and crisp images! They are stunning!\n\nBut we don’t stop there…at least not any,ore! Now we are being told we can create a more generic look by…you guessed it…adding digitally created grain into the image!\n\nThis is where I’m lost! Why did I spend thousands of dollars and hundreds of hours purchasing and practicing my digital photography equipment and skills…including post processing?\n\nThis seems to be the same lunacy that drives us to buy an 80” TV and then watch Netflix on a smartphone! Or, replace our entire audio system and music collection with CDs…only to now say we prefer the sound of vinyl!\n\n\nAre we just a restless lot who can never find anything satisfactory? I write some of this a bit satirically, however I am seriously looking for someone who can shed a light on why people, photographers in our case, are never satisfied?\n\nChange for something better os progress…but change JUST for something different seems insane!", "link": "https://www.reddit.com/r/photography/comments/pffnoq/have_we_gone_a_bit_insane/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we can create", "selectorShort": "create", "MarkedSent": "have we gone a bit insane? /!/ so i am a bit confused…maybe even a completely confused.\n\ngoing back to my early photography days we were shooting with film. i’m sure a good number of you have at least some experience shooting film as well!\n\nremember how there was kind of an unspoken rule…maybe an understanding, if you will, that you should usually choose the slowest film speed you could for a given shoot? of course, if you were not using flash you would try to choose a film speed that would match the expected natural light conditions.\n\nthe caveat was always that you did not want any faster film than necessary as faster film speeds would introduce more film grain! back then, apparently we thought grain was bad!\n\ndecades later we have amazing digital sensors to capture extraordinarily clean images…even at somewhat high iso (the digital similarity to film speed). but even as good as they are we still get digital noise (the digital similarity to grain) at times. so to further clean all noise from our images, we engage in a multitude of noise reduction techniques…and even spend additional money to purchase the latest generation of ai noise reduction tools!\n\nat the end of all of this digital technology and artist’s efforts, we have some amazing, clean and crisp images! they are stunning!\n\nbut we don’t stop there…at least not any,ore! now -----> we !!!  are being told -----> we !!!  -----> can !!!  -----> create !!!  a more generic look by…you guessed it…adding digitally created grain into the image!\n\nthis is where i’m lost! why did i spend thousands of dollars and hundreds of hours purchasing and practicing my digital photography equipment and skills…including post processing?\n\nthis seems to be the same lunacy that drives us to buy an 80” tv and then watch netflix on a smartphone! or, replace our entire audio system and music collection with cds…only to now say we prefer the sound of vinyl!\n\n\nare we just a restless lot who can never find anything satisfactory? i write some of this a bit satirically, however i am seriously looking for someone who can shed a light on why people, photographers in our case, are never satisfied?\n\nchange for something better os progress…but change just for something different seems insane!", "sortedWord": "None", "Identifyer": null, "identifyer": 97629, "year": "2021"}, {"autor": "jonneymendoza", "date": "2021-01-29 15:15:50", "content": "Creating a photo book /!/ Hi all.\n\ni have a couple of projects i want to finish off really where the finishing touches are producing a proffesional photo book that upon request, could be printed and made by a third party and me shipping it to potential buyers.\n\nI know that loxy colour provides some of this and they do create some really nice quality prints, however, i have to go and create the photo album and its layout using there god awful desktop app.\n\nSeeing how all my photos gets organised and edited on lightroom, i am wondering if i can use lightrooms \"Book\" mode i believe it has to create the photo book(with some text as well, not just images) and generate a pdf that i can then upload to loxley or similar to then go ahead and create that book for me based on what paper quality and cover i want.\n\nOr is there a company like loxley that has a lightroom plugini so it can all be intergrated and \"ordered\" directly from Lightroom?", "link": "https://www.reddit.com/r/photography/comments/l7v01m/creating_a_photo_book/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a photo book /!/ hi all.\n\ni have a couple of projects i want to finish off really where the finishing touches are producing a proffesional photo book that upon request, could be printed and made by a third party and me shipping it to potential buyers.\n\ni know that loxy colour provides some of this and they do create some really nice quality prints, however, i have to go and create the photo album and its layout using there god awful desktop app.\n\nseeing how all my photos gets organised and edited on lightroom, i am wondering if i can use lightrooms \"book\" mode i believe it has to create the photo book(with some text as well, not just images) and generate a pdf that i can then upload to loxley or similar to then go ahead and create that book for me based on what paper quality and cover i want.\n\nor is there a company like loxley that has a lightroom plugini so it can all be intergrated and \"ordered\" directly from lightroom?", "sortedWord": "None", "Identifyer": null, "identifyer": 98077, "year": "2021"}, {"autor": "walgreensfan", "date": "2021-05-01 01:03:37", "content": "Film camera or Polaroid? /!/ This is entirely subjective and all personal opinion; one that I haven’t created my own of yet!\n\nI’m going on a trip to Seattle (I’m fully vaxxed) and am bringing my DSLR and want to bring either a film camera (disposable or reusable) or Polaroid. I’m interested in buying an old school film camera or a Polaroid but don’t know which yet. I’m aware both can get pricey (have to buy film or paper), but does anyone have recommendations? I’m super indecisive and don’t know.\n\nPolaroids are sick and I love that you can see them right away, but the excitement of getting film developed is a whole other thing to look forward to. Let me know! TIA!", "link": "https://www.reddit.com/r/photography/comments/n27tc3/film_camera_or_polaroid/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i haven’t created", "selectorShort": "create", "MarkedSent": "film camera or polaroid? /!/ this is entirely subjective and all personal opinion; one that -----> i !!!  -----> have !!! -----> n’t !!!  -----> created !!!  my own of yet!\n\ni’m going on a trip to seattle (i’m fully vaxxed) and am bringing my dslr and want to bring either a film camera (disposable or reusable) or polaroid. i’m interested in buying an old school film camera or a polaroid but don’t know which yet. i’m aware both can get pricey (have to buy film or paper), but does anyone have recommendations? i’m super indecisive and don’t know.\n\npolaroids are sick and i love that you can see them right away, but the excitement of getting film developed is a whole other thing to look forward to. let me know! tia!", "sortedWord": "None", "Identifyer": null, "identifyer": 98629, "year": "2021"}, {"autor": "sc-musfir-mujahid", "date": "2021-05-16 07:12:11", "content": "Hey guys, add me on sc I create lenses and I do streaks and stuff /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ndisfm/hey_guys_add_me_on_sc_i_create_lenses_and_i_do/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hey guys, add me on sc -----> i !!!  -----> create !!!  lenses and -----> i !!!  do streaks and stuff /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 98779, "year": "2021"}, {"autor": "crzymikeslife", "date": "2021-06-30 17:25:39", "content": "I love to create different worlds with the ideas I have.📸😊 [ crazymikeslife is my insta]", "link": "https://www.reddit.com/r/photography/comments/ob21ui/i_love_to_create_different_worlds_with_the_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i love to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> love !!!  -----> to !!!  -----> create !!!  different worlds with the ideas -----> i !!!  have.📸😊 [ crazymikeslife is my insta]", "sortedWord": "None", "Identifyer": null, "identifyer": 99049, "year": "2021"}, {"autor": "limpchipp", "date": "2021-09-29 01:06:55", "content": "What kind of camera should I use to create a poor quality security cam effect? Example in post", "link": "https://www.reddit.com/r/photography/comments/pxkfpr/what_kind_of_camera_should_i_use_to_create_a_poor/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i use to create", "selectorShort": "create", "MarkedSent": "what kind of camera should -----> i !!!  -----> use !!!  -----> to !!!  -----> create !!!  a poor quality security cam effect? example in post", "sortedWord": "None", "Identifyer": null, "identifyer": 99595, "year": "2021"}, {"autor": "Patricklipp", "date": "2021-10-14 18:33:05", "content": "Thoughts and Critique /!/ Backstory real quick. Been \"doing photography\" for 8-10 years. self taught. I've done wedding, headshots and lots of portrait sessions with customers/clients. I've done commercial and personal as well. \n\nI've been a Sony shooter since the start and have been working video as of a few years ago and about two years ago I switched 100% to video. Recently I picked back up the camera, only this time with a Canon 5diii. My wife does portrait photography as well and decided she wanted to go Canon DSLR over Sony Mirrorless. ANYWAYS..\n\nI decided to take my love of cars and my photography skills and combine them. With a new camera and switching from CaptureOne to Lightroom as my primary editing suite, I decided to build out a few presets that are more my speed, IE \"Moody\" and accentuating the details I want the viewer to focus on specifically. Where I live, \"Automotive photographers\" are a dime a dozen, except what they do is take photos, and it's quite obvious the photos are taken on auto and posted straight out of the camera without any sort of artistic flair involved(framing, light manipulation, depth, etc.). They're pretty much straight on from the front or side.\n\nI've taken a different approach, limiting myself to a 50mm lens and a polarizer for manipulating shadows/light. while I have taken the \"Basic\" and normal angles, my primary focus is on creating depth with foreground/background objects and framing as a whole.  \nMy main concern right now is my editing. I've been consistent with my edits, and I like the look i've created, but after critiquing my own work, I am thinking about re-formulating my own personal presets to make them a bit less \"extreme\", if you will, but want an external opinion with a photography background.   \nI'll use my instagram and website portfolio as examples, albiet theyr'e not nearly all of my current lineup.   \nhttps://patricklipp.com  \n[https://www.instagram.com/patrick\\_lipp/](https://www.instagram.com/patrick_lipp/)", "link": "https://www.reddit.com/r/photography/comments/q85ri5/thoughts_and_critique/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "thoughts and critique /!/ backstory real quick. been \"doing photography\" for 8-10 years. self taught. i've done wedding, headshots and lots of portrait sessions with customers/clients. i've done commercial and personal as well. \n\ni've been a sony shooter since the start and have been working video as of a few years ago and about two years ago i switched 100% to video. recently i picked back up the camera, only this time with a canon 5diii. my wife does portrait photography as well and decided she wanted to go canon dslr over sony mirrorless. anyways..\n\ni decided to take my love of cars and my photography skills and combine them. with a new camera and switching from captureone to lightroom as my primary editing suite, i decided to build out a few presets that are more my speed, ie \"moody\" and accentuating the details i want the viewer to focus on specifically. where i live, \"automotive photographers\" are a dime a dozen, except what they do is take photos, and it's quite obvious the photos are taken on auto and posted straight out of the camera without any sort of artistic flair involved(framing, light manipulation, depth, etc.). they're pretty much straight on from the front or side.\n\ni've taken a different approach, limiting myself to a 50mm lens and a polarizer for manipulating shadows/light. while i have taken the \"basic\" and normal angles, my primary focus is on creating depth with foreground/background objects and framing as a whole.  \nmy main concern right now is my editing. -----> i !!! 've been consistent with my edits, and -----> i !!!  like the look -----> i !!! 've -----> created !!! , but after critiquing my own work, -----> i !!!  am thinking about re-formulating my own personal presets to make them a bit less \"extreme\", if you will, but want an external opinion with a photography background.   \ni'll use my instagram and website portfolio as examples, albiet theyr'e not nearly all of my current lineup.   \nhttps://patricklipp.com  \n[https://www.instagram.com/patrick\\_lipp/](https://www.instagram.com/patrick_lipp/)", "sortedWord": "None", "Identifyer": null, "identifyer": 99693, "year": "2021"}, {"autor": "reebaarts", "date": "2021-10-14 17:46:09", "content": "where to share my work? /!/ I've been looking to create my own website but I'll want a best free option from it so can you guys help me out?\n\nAlso is it absolutely necessary to be active on social media to grow as a photographer?", "link": "https://www.reddit.com/r/photography/comments/q84tue/where_to_share_my_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've been looking to create", "selectorShort": "create", "MarkedSent": "where to share my work? /!/ -----> i !!! 've -----> been !!!  -----> looking !!!  -----> to !!!  -----> create !!!  my own website but -----> i !!! 'll want a best free option from it so can you guys help me out?\n\nalso is it absolutely necessary to be active on social media to grow as a photographer?", "sortedWord": "None", "Identifyer": null, "identifyer": 99698, "year": "2021"}, {"autor": "Cobra7izz", "date": "2021-01-13 22:26:43", "content": "Creating single frame timelapses, Inspired By Pelle Cass", "link": "https://www.reddit.com/r/photography/comments/kwrm0e/creating_single_frame_timelapses_inspired_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  single frame timelapses, inspired by pelle cass", "sortedWord": "None", "Identifyer": null, "identifyer": 63, "year": "2021"}, {"autor": "innocentkitty", "date": "2021-01-13 16:53:41", "content": "Wedding Photographers: What's in your email sequence? /!/ Hey there!\n\nI'm a Virtual Assistant for photographers, and a client who does wedding photography has asked me to create an automated wedding booking sequence for her in Honeybook. \n\nSo far the main sequence goes:\n\n1. Inquiry (date is available)\n2. Invitation to a discovery call\n3. \"You're officially booked\" Welcome email\n4. Email regarding engagement session\n5. Request to fill out logistical questionnaire for ceremony\n6. \"I'm so excited\" email 3 days prior\n\nThere are others in between 1 and 4 chasing up but they aren't part of the main flow. What she's looking for is for me to create emails in between 4 and 5 so it isn't just radio silence for the months/maybe year in between the engagement photos and the wedding, but I have noooo idea what would be useful in a welcome booking sequence.\n\nWhat do your email sequences for weddings look like, and what could I make templates for that are useful/necessary for her or her wedding client to have?\n\nAny leads would be super appreciated - thank you!", "link": "https://www.reddit.com/r/photography/comments/kwkgyu/wedding_photographers_whats_in_your_email_sequence/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "wedding photographers: what's in your email sequence? /!/ hey there!\n\ni'm a virtual assistant for photographers, and a client who does wedding photography has asked -----> me !!!  -----> to !!!  -----> create !!!  an automated wedding booking sequence for her in honeybook. \n\nso far the main sequence goes:\n\n1. inquiry (date is available)\n2. invitation to a discovery call\n3. \"you're officially booked\" welcome email\n4. email regarding engagement session\n5. request to fill out logistical questionnaire for ceremony\n6. \"i'm so excited\" email 3 days prior\n\nthere are others in between 1 and 4 chasing up but they aren't part of the main flow. what she's looking for is for me to create emails in between 4 and 5 so it isn't just radio silence for the months/maybe year in between the engagement photos and the wedding, but i have noooo idea what would be useful in a welcome booking sequence.\n\nwhat do your email sequences for weddings look like, and what could i make templates for that are useful/necessary for her or her wedding client to have?\n\nany leads would be super appreciated - thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 85, "year": "2021"}, {"autor": "mattyice401", "date": "2021-01-13 15:21:34", "content": "Creating a Portfolio /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/kwiikq/creating_a_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a portfolio /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 93, "year": "2021"}, {"autor": "jbilous", "date": "2021-02-04 22:32:35", "content": "Over the last few days I created a web app to solve a problem that I often have while out shooting - keeping tracking of all the spots I want to shoot and where they are. I decided to make the app public - so anyone can use it for free. I'd love to hear if it's useful for you, and any feedback.", "link": "https://www.reddit.com/r/photography/comments/lcs5g5/over_the_last_few_days_i_created_a_web_app_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "over the last few days -----> i !!!  -----> created !!!  a web app to solve a problem that -----> i !!!  often have while out shooting - keeping tracking of all the spots -----> i !!!  want to shoot and where they are. i decided to make the app public - so anyone can use it for free. i'd love to hear if it's useful for you, and any feedback.", "sortedWord": "None", "Identifyer": null, "identifyer": 211, "year": "2021"}, {"autor": "apoch8000", "date": "2021-01-28 20:10:18", "content": "[QUESTION] Looking for a photo series taken from the exact same location on different times for an iOS Shortcut /!/ Hi everyone! Might sound like a weird question but here it goes:\n\nI’m using the iOS app ‘Shortcuts’ which is a powerful app that can be used for all sort of things: send automatic mails, day routines ect. Every routine you make is called a ‘shortcut’ and can be shared to other people\nRecently I created a shortcut that creates and applies a wallpaper, based on the current weather and time on the moment you use the shortcut. It is a quite popular shortcut on [/r/Shortcuts](https://www.reddit.com/r/shortcuts/comments/l42cpe/weatherwalls_20_is_out_new_features_sunrisesunset/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) and several people asked me to do a version of a city skyline.\n\nThe ‘problem’ is that is not so easy to create a ‘night’ version of a photo taken in daytime (apt. lights ect.) so I’m looking for a photographer that maybe have at least two city skyline photo’s taken from the same spot, one at daytime, one in the evening/night. It doesn’t really matter which city it is, but I guess there must be at least several skyscrapers to make it a bit impressive.\n\nI have no idea how licensing or something works. It’s not that I’m making money by creating and sharing a shortcut, it’s just entertaining and fun for me to do. So I was hoping someone is fancy to share some photo’s to use in the shortcut or even better, help me create bettere quality images.\n\nGive me a shout if anyone is interested!", "link": "https://www.reddit.com/r/photography/comments/l77az3/question_looking_for_a_photo_series_taken_from/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "[question] looking for a photo series taken from the exact same location on different times for an ios shortcut /!/ hi everyone! might sound like a weird question but here it goes:\n\ni’m using the ios app ‘shortcuts’ which is a powerful app that can be used for all sort of things: send automatic mails, day routines ect. every routine you make is called a ‘shortcut’ and can be shared to other people\nrecently -----> i !!!  -----> created !!!  a shortcut that creates and applies a wallpaper, based on the current weather and time on the moment you use the shortcut. it is a quite popular shortcut on [/r/shortcuts](https://www.reddit.com/r/shortcuts/comments/l42cpe/weatherwalls_20_is_out_new_features_sunrisesunset/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) and several people asked me to do a version of a city skyline.\n\nthe ‘problem’ is that is not so easy to create a ‘night’ version of a photo taken in daytime (apt. lights ect.) so i’m looking for a photographer that maybe have at least two city skyline photo’s taken from the same spot, one at daytime, one in the evening/night. it doesn’t really matter which city it is, but i guess there must be at least several skyscrapers to make it a bit impressive.\n\ni have no idea how licensing or something works. it’s not that i’m making money by creating and sharing a shortcut, it’s just entertaining and fun for me to do. so i was hoping someone is fancy to share some photo’s to use in the shortcut or even better, help me create bettere quality images.\n\ngive me a shout if anyone is interested!", "sortedWord": "None", "Identifyer": null, "identifyer": 350, "year": "2021"}, {"autor": "-acidlean-", "date": "2021-03-17 16:50:50", "content": "I’m creating my retoucher’s portfolio and hit a wall. /!/ I messaged a few local young (age 18-22) photographers. I liked their photos, their composition skills, I messaged everyone who made me go \"wow... if you only had some post-processing going on here\". We all were doing just fine, I was getting nice pics to retouch and get in my pf, they were getting new nice pics for their pfs. Cool. But one of them send me pictures that are so dull and ??? that I have completely no idea what to do to make them look better. I feel broken, like I can’t post-process anymore or I am too weak. What should I do?", "link": "https://www.reddit.com/r/photography/comments/m74spp/im_creating_my_retouchers_portfolio_and_hit_a_wall/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m creating", "selectorShort": "create", "MarkedSent": "-----> i !!! ’m -----> creating !!!  my retoucher’s portfolio and hit a wall. /!/ i messaged a few local young (age 18-22) photographers. i liked their photos, their composition skills, i messaged everyone who made me go \"wow... if you only had some post-processing going on here\". we all were doing just fine, i was getting nice pics to retouch and get in my pf, they were getting new nice pics for their pfs. cool. but one of them send me pictures that are so dull and ??? that i have completely no idea what to do to make them look better. i feel broken, like i can’t post-process anymore or i am too weak. what should i do?", "sortedWord": "None", "Identifyer": null, "identifyer": 713, "year": "2021"}, {"autor": "DieGo_L_Lapetina", "date": "2021-03-05 06:29:54", "content": "How did social media shaped your photography? /!/ How did social media affected your photography? That's the question I find asking myself more and more often recently.\n\nAs a curious photographer, I try not really narrow my craft to an extreme - like the guy that only takes photos of water droplets during spring mornings, or something exotic like that. But, I definitely feel that a lot of my stylistic choices have been influenced by social media.\n\nNo, I don't create my work exclusively to please people. But, I'm not a hypocrite to say that I don't want to get people's attention. I take photos to share the way I view the world with people, so I do want people to like and appreciate it. And, after years using IG, I came to the conclusion that fighting trends isn't the way to expand your reach\n\nFor example, I'm not a big fan of highly saturated images. But I still find myself posting saturated images in order to reach out more people online.\n\nMentally, I try to justify my choices by arguing that people are looking at my picture in a very tinny screen, so using vibrant colors is the best way to capture people's gaze. But, deep down, I know this is a weak excuse.\n\nSo, I guess the real question is... Am I the only one? Did  you notice your photography changing with social media?", "link": "https://www.reddit.com/r/photography/comments/ly5vsk/how_did_social_media_shaped_your_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i don't create", "selectorShort": "create", "MarkedSent": "how did social media shaped your photography? /!/ how did social media affected your photography? that's the question i find asking myself more and more often recently.\n\nas a curious photographer, i try not really narrow my craft to an extreme - like the guy that only takes photos of water droplets during spring mornings, or something exotic like that. but, i definitely feel that a lot of my stylistic choices have been influenced by social media.\n\nno, -----> i !!!  -----> do !!! -----> n't !!!  -----> create !!!  my work exclusively to please people. but, i'm not a hypocrite to say that i don't want to get people's attention. i take photos to share the way i view the world with people, so i do want people to like and appreciate it. and, after years using ig, i came to the conclusion that fighting trends isn't the way to expand your reach\n\nfor example, i'm not a big fan of highly saturated images. but i still find myself posting saturated images in order to reach out more people online.\n\nmentally, i try to justify my choices by arguing that people are looking at my picture in a very tinny screen, so using vibrant colors is the best way to capture people's gaze. but, deep down, i know this is a weak excuse.\n\nso, i guess the real question is... am i the only one? did  you notice your photography changing with social media?", "sortedWord": "None", "Identifyer": null, "identifyer": 928, "year": "2021"}, {"autor": "bino_navise", "date": "2021-04-07 20:47:27", "content": "Lightroom classic - one or multiple catalogs? /!/ I've been Lightroom classic for many years and I'm still running an old non-subscription version (6). As advise to keep the performance high I got advised to create a catalog per year.\n\nI'm now about to get a classic and cc subscription, but it seems I can only sync 1 catalog of classic to CC, so my question is that it's ok to use one catalog for everything, or should I still use multiple and decide what catalog to sync?\n\nFyi, I'm not a professional so Lightroom is more for keeping and editing my family trips, events, ...", "link": "https://www.reddit.com/r/photography/comments/mmbl8p/lightroom_classic_one_or_multiple_catalogs/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i got advised to create", "selectorShort": "create", "MarkedSent": "lightroom classic - one or multiple catalogs? /!/ i've been lightroom classic for many years and i'm still running an old non-subscription version (6). as advise -----> to !!!  keep the performance high -----> i !!!  -----> got !!!  -----> advised !!!  -----> to !!!  -----> create !!!  a catalog per year.\n\ni'm now about to get a classic and cc subscription, but it seems i can only sync 1 catalog of classic to cc, so my question is that it's ok to use one catalog for everything, or should i still use multiple and decide what catalog to sync?\n\nfyi, i'm not a professional so lightroom is more for keeping and editing my family trips, events, ...", "sortedWord": "None", "Identifyer": null, "identifyer": 1134, "year": "2021"}, {"autor": "flipflip9000", "date": "2021-05-08 16:41:14", "content": "Creating effects on analogue photos? /!/ I'm completely uneducated in photography. I was curious. Between the time you take a photograph and the time it gets developed are there any techniques you can use to alter the photograph? For example can you cover certain parts of the photo with tape so that when it's developed then the part where there was tape will be unsaturated, or completely blank?\n\n  I know that there are digital effects now, but I'm curious as to whether there was any way of creating effects post-production in photography when it was analog? I'm uneducated in this field and i'm a youngster so please don't metaphorically smack me over the head with a rolled up newspaper with words meant to belittle and demean.\n\n  \n\nYours truly, Phinieas Billingsworth", "link": "https://www.reddit.com/r/photography/comments/n7t3o9/creating_effects_on_analogue_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  effects on analogue photos? /!/ i'm completely uneducated in photography. i was curious. between the time you take a photograph and the time it gets developed are there any techniques you can use to alter the photograph? for example can you cover certain parts of the photo with tape so that when it's developed then the part where there was tape will be unsaturated, or completely blank?\n\n  i know that there are digital effects now, but i'm curious as to whether there was any way of creating effects post-production in photography when it was analog? i'm uneducated in this field and i'm a youngster so please don't metaphorically smack me over the head with a rolled up newspaper with words meant to belittle and demean.\n\n  \n\nyours truly, phinieas billingsworth", "sortedWord": "None", "Identifyer": null, "identifyer": 1493, "year": "2021"}, {"autor": "arteist", "date": "2021-05-15 17:19:36", "content": "Creating a Seamless Preset between Bridge and Photoshop /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/nd3shb/creating_a_seamless_preset_between_bridge_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a seamless preset between bridge and photoshop /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 1552, "year": "2021"}, {"autor": "MAGURO561", "date": "2021-05-23 05:33:08", "content": "First post on my newly created Instagram @maguro_561. Please tell me what you all think.", "link": "https://www.reddit.com/r/photography/comments/nj0yr6/first_post_on_my_newly_created_instagram_maguro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my newly created", "selectorShort": "create", "MarkedSent": "first post on -----> my !!!  -----> newly !!!  -----> created !!!  instagram @maguro_561. please tell me what you all think.", "sortedWord": "None", "Identifyer": null, "identifyer": 1684, "year": "2021"}, {"autor": "SgtPepe", "date": "2021-06-07 15:51:14", "content": "Hi everyone, he's an illustration I created for creating NFTs of your artwork (photos, illustrations, etc). /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/nufu87/hi_everyone_hes_an_illustration_i_created_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi everyone, he's an illustration -----> i !!!  -----> created !!!  for creating nfts of your artwork (photos, illustrations, etc). /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 1933, "year": "2021"}, {"autor": "ThePutinTrumpSexTape", "date": "2021-06-22 20:27:09", "content": "What kind of photos should I take to create my dating profile? /!/ Hi,  \nI (29/M) have very few photos of myself, so over the next couple of months I'm aiming to have lots taken when meeting up with friends.\n\nWhat sort of photos work best for dating profiles? Do posed ones work better, or candid ones?  \nAlso, what do I do when having a photo taken by myself? I'm fully confident in having my photo taken with someone else, but I don't know how to stand or what to do with my hands when alone!\n\nAll advice hugely appreciated.  \nThanks :-)", "link": "https://www.reddit.com/r/photography/comments/o5wgep/what_kind_of_photos_should_i_take_to_create_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i take to create", "selectorShort": "create", "MarkedSent": "what kind of photos should -----> i !!!  -----> take !!!  -----> to !!!  -----> create !!!  my dating profile? /!/ hi,  \ni (29/m) have very few photos of myself, so over the next couple of months i'm aiming to have lots taken when meeting up with friends.\n\nwhat sort of photos work best for dating profiles? do posed ones work better, or candid ones?  \nalso, what do i do when having a photo taken by myself? i'm fully confident in having my photo taken with someone else, but i don't know how to stand or what to do with my hands when alone!\n\nall advice hugely appreciated.  \nthanks :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 2376, "year": "2021"}, {"autor": "ThePutinTrumpSexTape", "date": "2021-06-22 14:27:09", "content": "What kind of photos should I take to create my dating profile? /!/ Hi,  \nI (29/M) have very few photos of myself, so over the next couple of months I'm aiming to have lots taken when meeting up with friends.\n\nWhat sort of photos work best for dating profiles? Do posed ones work better, or candid ones?  \nAlso, what do I do when having a photo taken by myself? I'm fully confident in having my photo taken with someone else, but I don't know how to stand or what to do with my hands when alone!\n\nAll advice hugely appreciated.  \nThanks :-)", "link": "https://www.reddit.com/r/photography/comments/o5oe4s/what_kind_of_photos_should_i_take_to_create_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i take to create", "selectorShort": "create", "MarkedSent": "what kind of photos should -----> i !!!  -----> take !!!  -----> to !!!  -----> create !!!  my dating profile? /!/ hi,  \ni (29/m) have very few photos of myself, so over the next couple of months i'm aiming to have lots taken when meeting up with friends.\n\nwhat sort of photos work best for dating profiles? do posed ones work better, or candid ones?  \nalso, what do i do when having a photo taken by myself? i'm fully confident in having my photo taken with someone else, but i don't know how to stand or what to do with my hands when alone!\n\nall advice hugely appreciated.  \nthanks :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 2392, "year": "2021"}, {"autor": "Weigang_Music", "date": "2021-08-13 09:55:24", "content": "I created a tool to automate creating timelapses from a sequence of images with ffmpeg. /!/ Hey guys,\n\n(hope this fits the rules, if not please let me know as I am new to the sub)\n\nTL;DR: Created a tool for timlapses. Sample and github below. Looking for workflow feedback.\n\n&amp;#x200B;\n\nI recently went out to film some timelapses. And my cam has a nifty feature, automatically creating those, but I wanted more control. So I switched to interval shooting and then batch-edited the raw-images to my liking. But then I didn't want to use a full-on Video Editor to create the timelapse, yet I wanted to have full control. FFMPEG does that wonderfully, but getting the details right was a bit of a pain..\n\n&amp;#x200B;\n\nSo after a few days of trial and error and testing the featureset of FFMPEG I resorted to saving my presets to a batch-file. A few days later and that batch-file has grown into a script that offers high quality preset as well as full granular control. All you have to do is put it inside a folder with a sequence of images and run it.\n\n&amp;#x200B;\n\nAs of right now it can encode prores (intermediate codec for editing in 10bit), h264, h265 and gifs (because why not!?). It presets (and lets you adjust) the Dimension/Aspect ratio, framerate, file-container, quality (profile/crf), bitrate, keyframe-interval, and maximum file-size (for gifs). If rendering in Prores it also automatically creates an identically-named proxy file in 720p for editing.\n\n&amp;#x200B;\n\nI thought I would share this so I started using [github](https://github.com/Jan-Weigang/Timelapse-Creator) for this.\n\n**Questions for you:** \n\nWould this fit your workflow? Do you think I am missing an important feature or got something wrong? Would you change anything?\n\n&amp;#x200B;\n\n[Timelapse encoded to 360p gif, 20fps, 100 images](https://i.redd.it/xg0807nqk3h71.gif)", "link": "https://www.reddit.com/r/photography/comments/p3kbja/i_created_a_tool_to_automate_creating_timelapses/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a tool to automate creating timelapses from a sequence of images with ffmpeg. /!/ hey guys,\n\n(hope this fits the rules, if not please let me know as i am new to the sub)\n\ntl;dr: created a tool for timlapses. sample and github below. looking for workflow feedback.\n\n&amp;#x200b;\n\ni recently went out to film some timelapses. and my cam has a nifty feature, automatically creating those, but i wanted more control. so i switched to interval shooting and then batch-edited the raw-images to my liking. but then i didn't want to use a full-on video editor to create the timelapse, yet i wanted to have full control. ffmpeg does that wonderfully, but getting the details right was a bit of a pain..\n\n&amp;#x200b;\n\nso after a few days of trial and error and testing the featureset of ffmpeg i resorted to saving my presets to a batch-file. a few days later and that batch-file has grown into a script that offers high quality preset as well as full granular control. all you have to do is put it inside a folder with a sequence of images and run it.\n\n&amp;#x200b;\n\nas of right now it can encode prores (intermediate codec for editing in 10bit), h264, h265 and gifs (because why not!?). it presets (and lets you adjust) the dimension/aspect ratio, framerate, file-container, quality (profile/crf), bitrate, keyframe-interval, and maximum file-size (for gifs). if rendering in prores it also automatically creates an identically-named proxy file in 720p for editing.\n\n&amp;#x200b;\n\ni thought i would share this so i started using [github](https://github.com/jan-weigang/timelapse-creator) for this.\n\n**questions for you:** \n\nwould this fit your workflow? do you think i am missing an important feature or got something wrong? would you change anything?\n\n&amp;#x200b;\n\n[timelapse encoded to 360p gif, 20fps, 100 images](https://i.redd.it/xg0807nqk3h71.gif)", "sortedWord": "None", "Identifyer": null, "identifyer": 2845, "year": "2021"}, {"autor": "tropical0", "date": "2021-09-22 00:11:21", "content": "Double Exposure. Question. /!/ Hello, so I recently took some shots that I double exposed with images I found on the internet. My question is: Would these count as \"plagiarism\"? or did I create something \"new\" by combining both images? I feel like it is 'new' in the sense that that particular combination of images only exists in my photographs but I'm not 100% sure! Hope you can help me. Thank you!", "link": "https://www.reddit.com/r/photography/comments/psvn0f/double_exposure_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "double exposure. question. /!/ hello, so i recently took some shots that i double exposed with images i found on the internet. my question is: would these count as \"plagiarism\"? or did -----> i !!!  -----> create !!!  something \"new\" by combining both images? i feel like it is 'new' in the sense that that particular combination of images only exists in my photographs but i'm not 100% sure! hope you can help me. thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 3059, "year": "2021"}, {"autor": "PopLockNDropSigSauer", "date": "2021-10-06 15:24:50", "content": "Want to earn money from your photography? Then you should know your value chain /!/ Hello everyone!\n\nI am writing this because I see a lot of people asking the same questions over and over and thought it would be nice to give you all the tools to answer your own questions. Or at least the 2% of you who search before asking questions. Why should you listen to me? With the important caveat that you should never blindly trust anyone and should fact check everything; I am a business consultant; people literally pay me to tell them how to run their businesses. I am not claiming I am the smartest person in the world, but I do feel confident in what I am saying here.\n\nThe point of this post is not to answer your questions but to give a wonderful tool that you can use to solve your own problems. In fact, this will solve nearly all of the business questions I have seen on here in the last few months.\n\nThe tool is taking a day to analyze what is the “value chain” is in your business. A value chain is just a fancy term to describe the steps you take to create a product of value, including the value/cost at every step.\n\nFor example: If I am running a lemonade stand, I buy $100 of product, and sell $200 of product. If that takes 1 hour to set up the physical stand, 3 hours of sales, and 1 hour of begging my mom to come pick me up then we know I am creating ($200-$100)/(1+3+1) = $20/hour. We also know how much value each step creates. If I wanted to hire a buddy to set up the stand, then we know that unless they are priced at below $20 its not worth it. If I want to make my little brother run the stand, then unless they are priced at below $60, its not worth it.\n\nWhy does this apply to photography? Because like any business making the \"lemonade\" is just one step in the process. You also need to do: business functions, like billing, marketing functions like advertising, process functions like editing, and other small things like transportation. People forget these, or under estimate them, and it will ruin your profit margin.\n\nLets look at some example of how you can apply this to your every day.\n\nExample 1: a friend is asking you to shoot their product/event/person/dog, how much should your friends and family discount be?\n\nMany people do not realize this, but there is actually a business case to give a friends and family discount. When you look at your value chain, look at all the steps you do not need to do because they are a friend. You don't need to advertise, because they came to you. You don't need to network because you were already friends. Your communication time is less because you can get some of the details worked out when you normally hang out with them. Lets say you normally charge $900 for a specific job, and you add up all of these savings and it is $300. If you are struggling to get clients, then you can offer them the job for $600, which saves them $300 and gets you profit you would not have gotten otherwise. If you are packed full time with clients, you can offer them the job for $750, saving them $150, and earning you $150 more than you would normally earn since you saved all these costs.\n\nIn either case having your value chain, and knowing what your needs are (more clients, more money, etc.) lets you make a financially sound decision when offering a discount. More importantly it is a win-win situation as both of you are better off had you not made the deal.\n\nExample 2: You hear about this new app that will help you get clients, should you join?\n\nSimilar to the lemonade stand example, except it is slightly reversed, instead of hiring someone and setting the financial boundaries, you are being hired and the boundaries are set for you. Once again your value chain can come to your rescue and help you decide. Now I am going to assume anyone considering this type of gig is new to the business, as they always are in my experience. What you first need to do is quickly think about any red flags from your value chain perspective. In previous jobs, how much time was spent getting the client vs shooting/editing? If networking is 70% of your time, then when you outsource that task you are outsourcing 70% of the profits.\n\nAs a new shooter you may think that 70% is an absurd number but a quick google search of how long pros spend actually shooting will validate it.\n\nhttps://www.thephoblographer.com/2015/07/30/how-professional-photographers-actually-spend-their-time/\n\nFrom this link you can see that most photographers spend ~15% of their time shooting an editing, with one spending as little as 6% of their time on it. So if the only thing you want to do is shoot/edit, then you will only see 15% of the profits. How does that app sound now? For most photographers (let alone new ones) you can expect a small restaurant to pay &lt;$400 for an average food shoot. This means if you work for an app on this gig, you can expect to get paid &lt;$60 for your work. Dividing that by the time to travel to the site, get set up, shoot the food, tear down, travel home, and edit for your hourly wage and you are probably netting &lt; $15/hour. Maybe that's worth it to you, maybe its not, but you at least have the information to make the decision yourself.\n\nSo how do you create a value chain?\n\nI know it might be tempting to steal the % off the link above, and while that is a good starting point it wont work. Your work is different and takes different efforts. Your clients are different and require more/less work. Your location is different and needs more/less time to get around. Most importantly you business model makes a huge difference, are you trying to sell prints? Are you trying to sell to individuals? Are you trying to get repeat customers? Make your own value chain.\n\nFor a small new photography business what you should probably do is\n\n1. List out every step you need to take for a profit. Include things like advertising, networking, doing your finances every month, harassing clients for payments.\n2. Record the time it will take at every step. If you don’t know, ask some pros for advice, if everyone hates you, take your best estimate and adjust, but use this as a last resort.\n3. Come up with a reasonable hourly rate for each step. Think of it this way, dont ask what you want to be paid for each step, ask what you would be willing to pay per hour to have someone else do it. The reason is because this sets up your mind to think of these as the minimum costs, which is what you want.  \n4. Multiple your hours by hourly rate, and total up\n\nExample of a value chain:\n\nTask 1: recruiting clients. 20 hours per week. $10/hour. $200 total.  \nTask 2: shooting/editing. 3 jobs per week, 3 hours per job. $20/hour. $180 total.  \nTask 3: transportation. 3 jobs per week, 1 hour per job. $10/hour. $30 total.  \nTask 4: business operations (e.g. billing). 10 hours per week. $10/hour. $100 total.  \n\nWhat does this tell me?\n\n1. I will be expecting to work 42 hours a week\n2. I will be expecting to have $510 in “costs” per week\n3. For 3 jobs I need them to pay at least $510/3 = $170 a job\n4. If I outsource client acquisition I lose $200/$510 = 40% of the potential profit\n5. If I find a client that does not require transportation (e.g. in my building) I can offer them a $30/$510 = 6% discount\n\n*Note that these are made up numbers with no real relation to the real world*\n\nKeep in mind that these are the breakeven points of everything. So I would not, for example, price a client at $170 because that would be “cost plus pricing” which is generally considered bad. Pricing is a whole different demon to tackle and would have to be its own post.\n\nIf you'd like to learn more from people much smarter than me, I would suggest starting with this HBS article. Do keep in mind, however, that Porter's more refined and detailed value chain analysis is meant for companies, with different departments. For 1-5 people working a super small business, its not really all that necessary to get that detailed, but it definitely wont hurt!\n\nhttps://online.hbs.edu/blog/post/what-is-value-chain-analysis", "link": "https://www.reddit.com/r/photography/comments/q2mqhp/want_to_earn_money_from_your_photography_then_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "want to earn money from your photography? then you should know your value chain /!/ hello everyone!\n\ni am writing this because i see a lot of people asking the same questions over and over and thought it would be nice to give you all the tools to answer your own questions. or at least the 2% of you who search before asking questions. why should you listen to me? with the important caveat that you should never blindly trust anyone and should fact check everything; i am a business consultant; people literally pay me to tell them how to run their businesses. i am not claiming i am the smartest person in the world, but i do feel confident in what i am saying here.\n\nthe point of this post is not to answer your questions but to give a wonderful tool that you can use to solve your own problems. in fact, this will solve nearly all of the business questions i have seen on here in the last few months.\n\nthe tool is taking a day to analyze what is the “value chain” is in your business. a value chain is just a fancy term to describe the steps you take to create a product of value, including the value/cost at every step.\n\nfor example: if i am running a lemonade stand, i buy $100 of product, and sell $200 of product. if that takes 1 hour to set up the physical stand, 3 hours of sales, and 1 hour of begging my mom to come pick me up then we know -----> i !!!  -----> am !!!  -----> creating !!!  ($200-$100)/(1+3+1) = $20/hour. we also know how much value each step creates. if i wanted to hire a buddy to set up the stand, then we know that unless they are priced at below $20 its not worth it. if i want to make my little brother run the stand, then unless they are priced at below $60, its not worth it.\n\nwhy does this apply to photography? because like any business making the \"lemonade\" is just one step in the process. you also need to do: business functions, like billing, marketing functions like advertising, process functions like editing, and other small things like transportation. people forget these, or under estimate them, and it will ruin your profit margin.\n\nlets look at some example of how you can apply this to your every day.\n\nexample 1: a friend is asking you to shoot their product/event/person/dog, how much should your friends and family discount be?\n\nmany people do not realize this, but there is actually a business case to give a friends and family discount. when you look at your value chain, look at all the steps you do not need to do because they are a friend. you don't need to advertise, because they came to you. you don't need to network because you were already friends. your communication time is less because you can get some of the details worked out when you normally hang out with them. lets say you normally charge $900 for a specific job, and you add up all of these savings and it is $300. if you are struggling to get clients, then you can offer them the job for $600, which saves them $300 and gets you profit you would not have gotten otherwise. if you are packed full time with clients, you can offer them the job for $750, saving them $150, and earning you $150 more than you would normally earn since you saved all these costs.\n\nin either case having your value chain, and knowing what your needs are (more clients, more money, etc.) lets you make a financially sound decision when offering a discount. more importantly it is a win-win situation as both of you are better off had you not made the deal.\n\nexample 2: you hear about this new app that will help you get clients, should you join?\n\nsimilar to the lemonade stand example, except it is slightly reversed, instead of hiring someone and setting the financial boundaries, you are being hired and the boundaries are set for you. once again your value chain can come to your rescue and help you decide. now i am going to assume anyone considering this type of gig is new to the business, as they always are in my experience. what you first need to do is quickly think about any red flags from your value chain perspective. in previous jobs, how much time was spent getting the client vs shooting/editing? if networking is 70% of your time, then when you outsource that task you are outsourcing 70% of the profits.\n\nas a new shooter you may think that 70% is an absurd number but a quick google search of how long pros spend actually shooting will validate it.\n\nhttps://www.thephoblographer.com/2015/07/30/how-professional-photographers-actually-spend-their-time/\n\nfrom this link you can see that most photographers spend ~15% of their time shooting an editing, with one spending as little as 6% of their time on it. so if the only thing you want to do is shoot/edit, then you will only see 15% of the profits. how does that app sound now? for most photographers (let alone new ones) you can expect a small restaurant to pay &lt;$400 for an average food shoot. this means if you work for an app on this gig, you can expect to get paid &lt;$60 for your work. dividing that by the time to travel to the site, get set up, shoot the food, tear down, travel home, and edit for your hourly wage and you are probably netting &lt; $15/hour. maybe that's worth it to you, maybe its not, but you at least have the information to make the decision yourself.\n\nso how do you create a value chain?\n\ni know it might be tempting to steal the % off the link above, and while that is a good starting point it wont work. your work is different and takes different efforts. your clients are different and require more/less work. your location is different and needs more/less time to get around. most importantly you business model makes a huge difference, are you trying to sell prints? are you trying to sell to individuals? are you trying to get repeat customers? make your own value chain.\n\nfor a small new photography business what you should probably do is\n\n1. list out every step you need to take for a profit. include things like advertising, networking, doing your finances every month, harassing clients for payments.\n2. record the time it will take at every step. if you don’t know, ask some pros for advice, if everyone hates you, take your best estimate and adjust, but use this as a last resort.\n3. come up with a reasonable hourly rate for each step. think of it this way, dont ask what you want to be paid for each step, ask what you would be willing to pay per hour to have someone else do it. the reason is because this sets up your mind to think of these as the minimum costs, which is what you want.  \n4. multiple your hours by hourly rate, and total up\n\nexample of a value chain:\n\ntask 1: recruiting clients. 20 hours per week. $10/hour. $200 total.  \ntask 2: shooting/editing. 3 jobs per week, 3 hours per job. $20/hour. $180 total.  \ntask 3: transportation. 3 jobs per week, 1 hour per job. $10/hour. $30 total.  \ntask 4: business operations (e.g. billing). 10 hours per week. $10/hour. $100 total.  \n\nwhat does this tell me?\n\n1. i will be expecting to work 42 hours a week\n2. i will be expecting to have $510 in “costs” per week\n3. for 3 jobs i need them to pay at least $510/3 = $170 a job\n4. if i outsource client acquisition i lose $200/$510 = 40% of the potential profit\n5. if i find a client that does not require transportation (e.g. in my building) i can offer them a $30/$510 = 6% discount\n\n*note that these are made up numbers with no real relation to the real world*\n\nkeep in mind that these are the breakeven points of everything. so i would not, for example, price a client at $170 because that would be “cost plus pricing” which is generally considered bad. pricing is a whole different demon to tackle and would have to be its own post.\n\nif you'd like to learn more from people much smarter than me, i would suggest starting with this hbs article. do keep in mind, however, that porter's more refined and detailed value chain analysis is meant for companies, with different departments. for 1-5 people working a super small business, its not really all that necessary to get that detailed, but it definitely wont hurt!\n\nhttps://online.hbs.edu/blog/post/what-is-value-chain-analysis", "sortedWord": "None", "Identifyer": null, "identifyer": 3345, "year": "2021"}, {"autor": "ph_maneiro", "date": "2021-10-14 05:17:32", "content": "Is pinterest a good way to share my work? /!/ It's been two months since i decided to take photography seriously. I created an instagram profile, website, portifolio and etc, and now i've been searching for ways to share my work to more and more people! \n\nDuring this process, i tried pinterest, where you can share pretty much everything. I have some photos there and my profile has now around 800 impressions, and considering you can link posts (pins) to external websites, i feel like this can be a way to share stuff for free and maybe get some new followers in the process. \n\nBut, as it's something i've never tried before, i'd like to know if is it worth my time to post my work there!", "link": "https://www.reddit.com/r/photography/comments/q7t2yc/is_pinterest_a_good_way_to_share_my_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "is pinterest a good way to share my work? /!/ it's been two months since i decided to take photography seriously. -----> i !!!  -----> created !!!  an instagram profile, website, portifolio and etc, and now -----> i !!! 've been searching for ways to share my work to more and more people! \n\nduring this process, i tried pinterest, where you can share pretty much everything. i have some photos there and my profile has now around 800 impressions, and considering you can link posts (pins) to external websites, i feel like this can be a way to share stuff for free and maybe get some new followers in the process. \n\nbut, as it's something i've never tried before, i'd like to know if is it worth my time to post my work there!", "sortedWord": "None", "Identifyer": null, "identifyer": 3373, "year": "2021"}, {"autor": "madmanmok", "date": "2021-10-14 03:27:43", "content": "Should my photography website display both my artistic and corporate/commercial work? /!/ I am creating a photography website as I am finally taking the step to creating my own business. With that said, I want to attract clients for portraits, editorial photography, concerts, real estate and corporate events. Some of these fields of clients are closely related, but when I think of the clientele for real estate and corporate events I often imagine that they may be turned off by the work I display on the more artistic side. \n\nI Amy be overthinking this, so Please correct me if I am wrong. But would it be smart to reach out and apply to corporate clients (businesses and or real estate companies) with the same website I have displayed my artistic work on?", "link": "https://www.reddit.com/r/photography/comments/q7rece/should_my_photography_website_display_both_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "should my photography website display both my artistic and corporate/commercial work? /!/ -----> i !!!  -----> am !!!  -----> creating !!!  a photography website as -----> i !!!  -----> am !!!  finally taking the step to -----> creating !!!  my own business. with that said, i want to attract clients for portraits, editorial photography, concerts, real estate and corporate events. some of these fields of clients are closely related, but when i think of the clientele for real estate and corporate events i often imagine that they may be turned off by the work i display on the more artistic side. \n\ni amy be overthinking this, so please correct me if i am wrong. but would it be smart to reach out and apply to corporate clients (businesses and or real estate companies) with the same website i have displayed my artistic work on?", "sortedWord": "None", "Identifyer": null, "identifyer": 3383, "year": "2021"}, {"autor": "boddy_nock", "date": "2021-08-22 14:29:28", "content": "Yesterday was my first professional gig /!/ Yesterday was my first professional gig. It was a one year Olds birthday party. I was assigned it through a third party on Indeed. Below was my job description:\n\nShot list\n\nBirthday person (blowing out candles, opening gifts, mingling with guests)\n\nCake, cupcakes, cookies display\n\nGroup and Family Photos\n\nThe lady who was the sons mother didn't like my photos. She said that my photos were more portraiture work and she wanted more candid shots. Well, If you wanted those just have your uncle Bob take them. I feel like I created art, but it's not what she wanted. Now I feel like I ruined their memories and won't have that day captured. \n\nThey didn't have the child blow out the candles or open presents. No one was mingling with each other, other than the children. Anyone else have a bad first experience? How do you get over feeling like you did wrong?", "link": "https://www.reddit.com/r/photography/comments/p9dfd2/yesterday_was_my_first_professional_gig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "yesterday was my first professional gig /!/ yesterday was my first professional gig. it was a one year olds birthday party. i was assigned it through a third party on indeed. below was my job description:\n\nshot list\n\nbirthday person (blowing out candles, opening gifts, mingling with guests)\n\ncake, cupcakes, cookies display\n\ngroup and family photos\n\nthe lady who was the sons mother didn't like my photos. she said that my photos were more portraiture work and she wanted more candid shots. well, if you wanted those just have your uncle bob take them. -----> i !!!  feel like -----> i !!!  -----> created !!!  art, but it's not what she wanted. now i feel like i ruined their memories and won't have that day captured. \n\nthey didn't have the child blow out the candles or open presents. no one was mingling with each other, other than the children. anyone else have a bad first experience? how do you get over feeling like you did wrong?", "sortedWord": "None", "Identifyer": null, "identifyer": 3599, "year": "2021"}, {"autor": "eugen_dus", "date": "2021-08-22 09:17:42", "content": "Tipps for creating this kind of website /!/ Hey, I want to create a Photography Website. I checked my favourite Photographers and Websites and found out this vibe would fit me the best. Could you reccoment me a starting point?\n\nI already have photos and videos done. Just need to find out where I get a domain and template \n\n[https://www.clm-agency.com/photographers/tom-craig](https://www.clm-agency.com/photographers/tom-craig)", "link": "https://www.reddit.com/r/photography/comments/p99e7n/tipps_for_creating_this_kind_of_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "tipps for creating this kind of website /!/ hey, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a photography website. i checked my favourite photographers and websites and found out this vibe would fit me the best. could you reccoment me a starting point?\n\ni already have photos and videos done. just need to find out where i get a domain and template \n\n[https://www.clm-agency.com/photographers/tom-craig](https://www.clm-agency.com/photographers/tom-craig)", "sortedWord": "None", "Identifyer": null, "identifyer": 3612, "year": "2021"}, {"autor": "hotbrownbitxh", "date": "2021-10-22 13:44:31", "content": "How can I create this vintage effect through my camera without editing ?", "link": "https://www.reddit.com/r/photography/comments/qdh9bm/how_can_i_create_this_vintage_effect_through_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  this vintage effect through my camera without editing ?", "sortedWord": "None", "Identifyer": null, "identifyer": 3647, "year": "2021"}, {"autor": "Prestigious_Double43", "date": "2021-10-28 09:23:26", "content": "Created with love and mushrooms", "link": "https://www.reddit.com/r/photography/comments/qhj2qr/created_with_love_and_mushrooms/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  with love and mushrooms", "sortedWord": "None", "Identifyer": null, "identifyer": 3806, "year": "2021"}, {"autor": "Independent_Heart_15", "date": "2021-01-06 13:51:17", "content": "Recruiting photographers! /!/ Hello there I'm creating a new graffiti magazine and I am recruiting photographers to take pictures of streetart/and possibly interviews if interested please private message me thanks!", "link": "https://www.reddit.com/r/photography/comments/kro8a5/recruiting_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "recruiting photographers! /!/ hello there -----> i !!! 'm -----> creating !!!  a new graffiti magazine and -----> i !!!  am recruiting photographers to take pictures of streetart/and possibly interviews if interested please private message me thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 3865, "year": "2021"}, {"autor": "alva_szarok", "date": "2021-01-06 03:00:49", "content": "Help me create the OF acc YOU want. I got the Pictures, I got the consistency, I wanna answer all your questions. AMA", "link": "https://www.reddit.com/r/photography/comments/krer6b/help_me_create_the_of_acc_you_want_i_got_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "help -----> me !!!  -----> create !!!  the of acc you want. i got the pictures, i got the consistency, i wanna answer all your questions. ama", "sortedWord": "None", "Identifyer": null, "identifyer": 3900, "year": "2021"}, {"autor": "omari56", "date": "2021-01-25 02:17:26", "content": "Discord for photographers /!/ Hey everyone! I figured I’d create a Discord Server for those who wanted to connect and share their work! I figured since I’m kinda trying to connect with other photographers/videographers this would be a good way to connect! I’ve attached the link below! Hope to see Y’all there👏🏾👏🏾\n\nhttps://discord.gg/TpEkCmuP", "link": "https://www.reddit.com/r/photography/comments/l4dmf5/discord_for_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’d create", "selectorShort": "create", "MarkedSent": "discord for photographers /!/ hey everyone! i figured -----> i !!! -----> ’d !!!  -----> create !!!  a discord server for those who wanted to connect and share their work! i figured since i’m kinda trying to connect with other photographers/videographers this would be a good way to connect! i’ve attached the link below! hope to see y’all there👏🏾👏🏾\n\nhttps://discord.gg/tpekcmup", "sortedWord": "None", "Identifyer": null, "identifyer": 4556, "year": "2021"}, {"autor": "samkatsamkat", "date": "2021-01-26 09:55:51", "content": "I'm creating a free class on the business of photography /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/l5ay64/im_creating_a_free_class_on_the_business_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm -----> creating !!!  a free class on the business of photography /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 4812, "year": "2021"}, {"autor": "EmAndAhr", "date": "2021-02-11 04:02:56", "content": "How can I create this affect with artwork I painted? 3d, laid out, floating? What software can do this if I didn't have photoshop", "link": "https://www.reddit.com/r/photography/comments/lhcfbe/how_can_i_create_this_affect_with_artwork_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  this affect with artwork -----> i !!!  painted? 3d, laid out, floating? what software can do this if i didn't have photoshop", "sortedWord": "None", "Identifyer": null, "identifyer": 4903, "year": "2021"}, {"autor": "njm204", "date": "2021-02-11 02:53:18", "content": "Stock photography for small supplemental income. /!/  Over the past 3 years, I have created a stream of income through Shutterstock which is a stock photography [website](http://submit.shutterstock.com/?rid=190960692). It's relatively simple to make an account and all you have to do is upload photos that you think could be used by companies or individuals. Once you take and upload the photos, it is 100% passive, and they will continue to sell for years. It takes a bit to get started but once you get enough photos out, the sales roll in. The minimum payout is $35. If you build a strong portfolio of photos and videos you can make a good bit of money. With a few hundred photos I make about $10 per month on average but the more actively I upload the better I do for the month because of the way the algorithm works. Good luck!", "link": "https://www.reddit.com/r/photography/comments/lhb6ff/stock_photography_for_small_supplemental_income/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "stock photography for small supplemental income. /!/  over the past 3 years, -----> i !!!  -----> have !!!  -----> created !!!  a stream of income through shutterstock which is a stock photography [website](http://submit.shutterstock.com/?rid=190960692). it's relatively simple to make an account and all you have to do is upload photos that you think could be used by companies or individuals. once you take and upload the photos, it is 100% passive, and they will continue to sell for years. it takes a bit to get started but once you get enough photos out, the sales roll in. the minimum payout is $35. if you build a strong portfolio of photos and videos you can make a good bit of money. with a few hundred photos i make about $10 per month on average but the more actively i upload the better i do for the month because of the way the algorithm works. good luck!", "sortedWord": "None", "Identifyer": null, "identifyer": 4906, "year": "2021"}, {"autor": "WilliamTrostelPhoto", "date": "2021-02-18 16:16:45", "content": "Photographers on YouTube? /!/ Any photographers in this community running YouTube accounts? I’m curious to know what y’all might be making videos about? I’m slowly running out of ideas for creative projects and don’t want to resort to simply creating podcasts talking. I’d like to create something more artistic. Thanks!", "link": "https://www.reddit.com/r/photography/comments/lmqcrl/photographers_on_youtube/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’d like to create", "selectorShort": "create", "MarkedSent": "photographers on youtube? /!/ any photographers in this community running youtube accounts? i’m curious to know what y’all might be making videos about? i’m slowly running out of ideas for creative projects and don’t want to resort to simply creating podcasts talking. -----> i !!! -----> ’d !!!  -----> like !!!  -----> to !!!  -----> create !!!  something more artistic. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 5095, "year": "2021"}, {"autor": "lushieloux", "date": "2021-02-21 20:39:54", "content": "Photography brief: \"experience\" /!/ Hi there! So I'm a university student, who is redoing their 2nd year. Last year we had a brief on : experiences, \"first hand\". Due to the fact of my idea last year and the pandemic starting - the lack of help from my University and lectures lead me to fail.\n\nThis year, the same brief has occured. Last year there was some cool ideas: someone had the idea of \"experiencing the joy of eating a doughnut\".\n\nThe brief states: the brief asks you to encounter the concept of being and reflect this through your project. You are to question the notion of experience. This could relate to photographic explorations such performance, film, visual or participating arts. It could be the depiction and visual interpretation of first hand experiences, smells, sounds, encounters.\nAnd finalises with the quote : it is seeing that establishes our place in the surrounding world. the relation between what we see and what we know is never settled.\n\nI would really love some help on ideas or concepts that I can expand onto my own work and style. \nIf it helps for ideas: I'm currently 4 months pregnant and love to work with studio work that could be seen as \"commerical\" work. I really enjoy \"splash photography\".\n\nI will also have to do all of this from whatever I can create from a homemade studio setup since my course and classes are currently distance learning.", "link": "https://www.reddit.com/r/photography/comments/lp630n/photography_brief_experience/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "photography brief: \"experience\" /!/ hi there! so i'm a university student, who is redoing their 2nd year. last year we had a brief on : experiences, \"first hand\". due to the fact of my idea last year and the pandemic starting - the lack of help from my university and lectures lead me to fail.\n\nthis year, the same brief has occured. last year there was some cool ideas: someone had the idea of \"experiencing the joy of eating a doughnut\".\n\nthe brief states: the brief asks you to encounter the concept of being and reflect this through your project. you are to question the notion of experience. this could relate to photographic explorations such performance, film, visual or participating arts. it could be the depiction and visual interpretation of first hand experiences, smells, sounds, encounters.\nand finalises with the quote : it is seeing that establishes our place in the surrounding world. the relation between what we see and what we know is never settled.\n\ni would really love some help on ideas or concepts that i can expand onto my own work and style. \nif it helps for ideas: i'm currently 4 months pregnant and love to work with studio work that could be seen as \"commerical\" work. i really enjoy \"splash photography\".\n\n-----> i !!!  will also have to do all of this from whatever -----> i !!!  -----> can !!!  -----> create !!!  from a homemade studio setup since my course and classes are currently distance learning.", "sortedWord": "None", "Identifyer": null, "identifyer": 5236, "year": "2021"}, {"autor": "theiinlive", "date": "2021-02-21 16:49:55", "content": "Creating a display for an art show /!/ Hi everybody, I'm putting together my first photography show. I think I have the mat boards and (cheap) frames all set. But I wondering where to get little title cards for below the pictures.. ie. for title and price of the piece.  This is for a coffee shop. Nothing to -er - high end\n\nAny suggestion on frames and mat board supplier would be welcome too", "link": "https://www.reddit.com/r/photography/comments/lp127s/creating_a_display_for_an_art_show/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a display for an art show /!/ hi everybody, i'm putting together my first photography show. i think i have the mat boards and (cheap) frames all set. but i wondering where to get little title cards for below the pictures.. ie. for title and price of the piece.  this is for a coffee shop. nothing to -er - high end\n\nany suggestion on frames and mat board supplier would be welcome too", "sortedWord": "None", "Identifyer": null, "identifyer": 5260, "year": "2021"}, {"autor": "Kangalooney", "date": "2021-03-04 09:39:44", "content": "Creating the black void from Stranger Things", "link": "https://www.reddit.com/r/photography/comments/lxgx4z/creating_the_black_void_from_stranger_things/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  the black void from stranger things", "sortedWord": "None", "Identifyer": null, "identifyer": 5542, "year": "2021"}, {"autor": "Alyslea", "date": "2021-04-07 12:32:18", "content": "I'm looking for high quality RAW photos to edit for my portfolio. Anything you have! (You'll get a free professional edit) /!/ I'm a Photoshop expert with many years of experience, but I'm looking into building a good portfolio t the moment. Since most of my clients prefer me not sharing their images, I'll need to create new ones.  \n\n\nAll I ask for is RAW images of any sort that I can edit, and that I can use them for my portfolio. You'll get a free edit out of it, and much gratitude from me! :)", "link": "https://www.reddit.com/r/photography/comments/mm10hf/im_looking_for_high_quality_raw_photos_to_edit/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'll need to create", "selectorShort": "create", "MarkedSent": "i'm looking for high quality raw photos to edit for my portfolio. anything you have! (you'll get a free professional edit) /!/ i'm a photoshop expert with many years of experience, but i'm looking into building a good portfolio t the moment. since most of my clients prefer me not sharing their images, -----> i !!! -----> 'll !!!  -----> need !!!  -----> to !!!  -----> create !!!  new ones.  \n\n\nall i ask for is raw images of any sort that i can edit, and that i can use them for my portfolio. you'll get a free edit out of it, and much gratitude from me! :)", "sortedWord": "None", "Identifyer": null, "identifyer": 5914, "year": "2021"}, {"autor": "cubedude719", "date": "2021-04-09 19:37:28", "content": "Does anyone know if Pixieset ever does deals? /!/ Hey guys, I created a website through Pixieset, and now that I have a job that makes ok money I think I want to make the jump from the free version to the paid, which will allow me to show more photos on there and sell stuff easier, without a % of the commission taken out. \n\nBut does anyone have any experience with them doing holiday sales or anything? I figured I shouldve checked during black Friday but I forgot. Thanks!", "link": "https://www.reddit.com/r/photography/comments/mnowpz/does_anyone_know_if_pixieset_ever_does_deals/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "does anyone know if pixieset ever does deals? /!/ hey guys, -----> i !!!  -----> created !!!  a website through pixieset, and now that -----> i !!!  have a job that makes ok money -----> i !!!  think -----> i !!!  want to make the jump from the free version to the paid, which will allow me to show more photos on there and sell stuff easier, without a % of the commission taken out. \n\nbut does anyone have any experience with them doing holiday sales or anything? i figured i shouldve checked during black friday but i forgot. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 6033, "year": "2021"}, {"autor": "danisobooka", "date": "2021-04-21 10:14:34", "content": "Hi! I am trying to create the best photography workshop in the market and I need your opinion! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/mvcjsk/hi_i_am_trying_to_create_the_best_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am trying to create", "selectorShort": "create", "MarkedSent": "hi! -----> i !!!  -----> am !!!  -----> trying !!!  -----> to !!!  -----> create !!!  the best photography workshop in the market and -----> i !!!  need your opinion! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 6253, "year": "2021"}, {"autor": "Viridian_Foxx", "date": "2021-05-07 16:14:15", "content": "What is a cheap but effective way to light a moonlit scene? /!/ I want to create a shot of a scene where a man is lit by the moon from the front. Is there a cheap lighting setup, like perhaps a specific type of lightbulb I could purchase, that would create a good night scene moon effect?", "link": "https://www.reddit.com/r/photography/comments/n727p8/what_is_a_cheap_but_effective_way_to_light_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "what is a cheap but effective way to light a moonlit scene? /!/ -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a shot of a scene where a man is lit by the moon from the front. is there a cheap lighting setup, like perhaps a specific type of lightbulb i could purchase, that would create a good night scene moon effect?", "sortedWord": "None", "Identifyer": null, "identifyer": 6623, "year": "2021"}, {"autor": "EricIO", "date": "2021-06-06 19:57:25", "content": "Creating is Enough", "link": "https://www.reddit.com/r/photography/comments/ntu4cw/creating_is_enough/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  is enough", "sortedWord": "None", "Identifyer": null, "identifyer": 7547, "year": "2021"}, {"autor": "mrgrif04", "date": "2021-07-05 00:31:31", "content": "Create a list of equipment to allow staff to take portraits of clothing items. /!/ Ive been asked to create a list of equipment and train some staff to take quality images of clothing products (modelled) to help a small retailer keep costs down and still deliver decent images for their small eCom store and social media.\n\nI have allocated a space and some some basic photography training with them but they require so improved equipment and quality of life items - I know what would be possible but I’m a bit out of the loop on what’s available .\n\n\nIm looking for all easy to use equipment :\n\n\nI’ve already installed an interchangeable backdrop but I’m looking for :\n\nA clothing stand to easily hang flat clothing when there is only one person available\n\nSome sort of decent continuous white light - LED (I want to stray away from flash as it’s too complex for the team) \n\nA tripod with possible phone mounts to allow for easier camera use and videos, sturdy and easy to use.\n\nA modern dSLR that isn’t over the moon expensive but still delivers and is user friendly (can’t believe Im asking that question!)\n\n\nAny suggestions on other equipment ? \n\n\nThanks !", "link": "https://www.reddit.com/r/photography/comments/odwew3/create_a_list_of_equipment_to_allow_staff_to_take/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  a list of equipment to allow staff to take portraits of clothing items. /!/ ive been asked to create a list of equipment and train some staff to take quality images of clothing products (modelled) to help a small retailer keep costs down and still deliver decent images for their small ecom store and social media.\n\ni have allocated a space and some some basic photography training with them but they require so improved equipment and quality of life items - i know what would be possible but i’m a bit out of the loop on what’s available .\n\n\nim looking for all easy to use equipment :\n\n\ni’ve already installed an interchangeable backdrop but i’m looking for :\n\na clothing stand to easily hang flat clothing when there is only one person available\n\nsome sort of decent continuous white light - led (i want to stray away from flash as it’s too complex for the team) \n\na tripod with possible phone mounts to allow for easier camera use and videos, sturdy and easy to use.\n\na modern dslr that isn’t over the moon expensive but still delivers and is user friendly (can’t believe im asking that question!)\n\n\nany suggestions on other equipment ? \n\n\nthanks !", "sortedWord": "None", "Identifyer": null, "identifyer": 7705, "year": "2021"}, {"autor": "Rosellis", "date": "2021-06-28 03:31:02", "content": "An experiment attempting to photograph shiny objects /!/ Well, it's been  a while since I did anything photography related (also first post here). I recently got some inspiration from youtube and decided to try to create a lighting set up to photograph small objects, especially shiny ones. I tried to create a soft light box: I took a cardboard box and cut two windows in the sides which I covered with wax paper. Outside the box I placed 2 1600 lumen LED lights. I then put a piece of white poster board on the inside and covered what remained of the interior in tin foil. The goal was to create lighting from 5 sides, more or less. Here's a picture of the setup:  \n\n\n&amp;#x200B;\n\n[The setup](https://preview.redd.it/6l9yk97zcx771.jpg?width=3712&amp;format=pjpg&amp;auto=webp&amp;s=95c46a5263c9b6bb51aa2fab3692edb2ccc85846)\n\nThe results are ultimately kinda meh, I think. The best I got of the cheese greater was this, I think:\n\n[The depth of field is too narrow](https://preview.redd.it/5oxkt4dndx771.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=91e91e2c65db6d7f3320ffd050cc54245cf07008)\n\nI had to use a narrow depth of field so that the crinkles of the tin foil were not too distracting (they still are distracting). I think I need to reline the walls with white paper instead of tin foil. But I did have fun photographing a small succulent:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/d1i4nic8ex771.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=6625ef7051093fef72e7d48bb7b9295f9ebb2a2d\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w83qbbs9ex771.jpg?width=1999&amp;format=pjpg&amp;auto=webp&amp;s=dfb6701de706083828a112234bab4db81a15626b\n\nAnyway I thought I would share as perhaps others here would find the results interesting. I'll redo the interior and see if I can get decent shots of the shiny metal things. Obviously these are noise messes as I wasn't bothering to use a tripod and have an ancient camera.   \n\n\nCheers", "link": "https://www.reddit.com/r/photography/comments/o9c1yx/an_experiment_attempting_to_photograph_shiny/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i tried to create", "selectorShort": "create", "MarkedSent": "an experiment attempting to photograph shiny objects /!/ well, it's been  a while since i did anything photography related (also first post here). i recently got some inspiration from youtube and decided to try to create a lighting set up to photograph small objects, especially shiny ones. -----> i !!!  -----> tried !!!  -----> to !!!  -----> create !!!  a soft light box: -----> i !!!  took a cardboard box and cut two windows in the sides which -----> i !!!  covered with wax paper. outside the box i placed 2 1600 lumen led lights. i then put a piece of white poster board on the inside and covered what remained of the interior in tin foil. the goal was to create lighting from 5 sides, more or less. here's a picture of the setup:  \n\n\n&amp;#x200b;\n\n[the setup](https://preview.redd.it/6l9yk97zcx771.jpg?width=3712&amp;format=pjpg&amp;auto=webp&amp;s=95c46a5263c9b6bb51aa2fab3692edb2ccc85846)\n\nthe results are ultimately kinda meh, i think. the best i got of the cheese greater was this, i think:\n\n[the depth of field is too narrow](https://preview.redd.it/5oxkt4dndx771.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=91e91e2c65db6d7f3320ffd050cc54245cf07008)\n\ni had to use a narrow depth of field so that the crinkles of the tin foil were not too distracting (they still are distracting). i think i need to reline the walls with white paper instead of tin foil. but i did have fun photographing a small succulent:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/d1i4nic8ex771.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=6625ef7051093fef72e7d48bb7b9295f9ebb2a2d\n\n&amp;#x200b;\n\nhttps://preview.redd.it/w83qbbs9ex771.jpg?width=1999&amp;format=pjpg&amp;auto=webp&amp;s=dfb6701de706083828a112234bab4db81a15626b\n\nanyway i thought i would share as perhaps others here would find the results interesting. i'll redo the interior and see if i can get decent shots of the shiny metal things. obviously these are noise messes as i wasn't bothering to use a tripod and have an ancient camera.   \n\n\ncheers", "sortedWord": "None", "Identifyer": null, "identifyer": 8136, "year": "2021"}, {"autor": "LumpyNV", "date": "2021-07-13 19:07:44", "content": "Stitching wood grain /!/ I'm a wood products manufacturer and hobby photographer. We've got a bunch of products that we need to create pictures we can use in CAD renderings of our different products. Using DSLR with a 25-50ish lens. Cheap ring light. Stationary camera with timber on a roller table. Everything squared up as good as possible by eye.\n\n&amp;#x200B;\n\nThe ring light is giving us inconsistent light across the pictures with darker edges and a lighter center. Any advice? Should I be tryign to take more pictures and use the center portion, use Photoshop to match of blend the pictures, or getting the lighting better? My gut says the lighting needs to be better.\n\n&amp;#x200B;\n\nI can add some cheap softboxes to the sides, I'm sure that will help.  Any other tips? Thansk!", "link": "https://www.reddit.com/r/photography/comments/ojmizs/stitching_wood_grain/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we need to create", "selectorShort": "create", "MarkedSent": "stitching wood grain /!/ i'm a wood products manufacturer and hobby photographer. -----> we !!! 've got a bunch of products that -----> we !!!  -----> need !!!  -----> to !!!  -----> create !!!  pictures -----> we !!!  can use in cad renderings of our different products. using dslr with a 25-50ish lens. cheap ring light. stationary camera with timber on a roller table. everything squared up as good as possible by eye.\n\n&amp;#x200b;\n\nthe ring light is giving us inconsistent light across the pictures with darker edges and a lighter center. any advice? should i be tryign to take more pictures and use the center portion, use photoshop to match of blend the pictures, or getting the lighting better? my gut says the lighting needs to be better.\n\n&amp;#x200b;\n\ni can add some cheap softboxes to the sides, i'm sure that will help.  any other tips? thansk!", "sortedWord": "None", "Identifyer": null, "identifyer": 8208, "year": "2021"}, {"autor": "robita233", "date": "2021-07-12 19:01:06", "content": "Canon M50 Mark II or other gear for beginners /!/ Hello!\n\n&amp;#x200B;\n\nI want to get into photography, I am at the very beginning as this would be my very first \"professional\" camera.\n\nI won't take onto serious projects or shoot to far with my ambitions, I will be starting slow, taking some courses and maybe becoming a little helper on some bigger projects for other people; but firstly, I would love to have a camera that I won't regret buying.\n\nI have done my research, although I still don't know all I should about cameras and gear, but I got a general idea of how things are supposed to be, maybe. So, I have come to the conclusion that firstly, your gear depends more on how YOU use it rather than how good IT is. I know that a good photographer/videographer will make the best out of mostly all gear, so don't think I am coming here to say that I want the best camera possible but I don't have any skill. Secondly, I came to the conclusion that the M50 Mark II might be a good enough camera to start with, I want something that will hold on with the quality down the road, with good lenses and gear, it could be a powerful setup.\n\nI have seen a lot of pros and cons of this camera, but overall, I am thinking of buying it, so I came here to ask: What do you guys think about it?\n\n&amp;#x200B;\n\nIs it a good enough camera for beginners? I know a fair bit of photoshop and lightroom, I want to create some services that I've not seen very much in my country ( Basically have seen A LOT of photographers that are being hired for expensive prices and not delivering the quality I, a beginner, would expect ) so I know that I will have a fair chance of getting a few jobs. Also, I heard that I shouldn't go for weddings for a long time, I know how hard it is to shoot for weddings, how chaotic and demanding it can be, I won't bite more than I can chew, I promise! Haha. I will mostly take part into birthday parties or other events ( After I learn, of course, how to master the camera in a better way, I'm planning to, besides maybe taking some courses, do some street photography of people and the city ).\n\n&amp;#x200B;\n\nSorry if I wrote too much, but I hope you won't come down too hard on me if I did some mistakes in my thought process. I am open to any criticism, tips or advice in what I should focus on, what gear to buy and so on. Thank you for your time!", "link": "https://www.reddit.com/r/photography/comments/oixy64/canon_m50_mark_ii_or_other_gear_for_beginners/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "canon m50 mark ii or other gear for beginners /!/ hello!\n\n&amp;#x200b;\n\ni want to get into photography, i am at the very beginning as this would be my very first \"professional\" camera.\n\ni won't take onto serious projects or shoot to far with my ambitions, i will be starting slow, taking some courses and maybe becoming a little helper on some bigger projects for other people; but firstly, i would love to have a camera that i won't regret buying.\n\ni have done my research, although i still don't know all i should about cameras and gear, but i got a general idea of how things are supposed to be, maybe. so, i have come to the conclusion that firstly, your gear depends more on how you use it rather than how good it is. i know that a good photographer/videographer will make the best out of mostly all gear, so don't think i am coming here to say that i want the best camera possible but i don't have any skill. secondly, i came to the conclusion that the m50 mark ii might be a good enough camera to start with, i want something that will hold on with the quality down the road, with good lenses and gear, it could be a powerful setup.\n\ni have seen a lot of pros and cons of this camera, but overall, i am thinking of buying it, so i came here to ask: what do you guys think about it?\n\n&amp;#x200b;\n\nis it a good enough camera for beginners? -----> i !!!  know a fair bit of photoshop and lightroom, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  some services that -----> i !!! 've not seen very much in my country ( basically have seen a lot of photographers that are being hired for expensive prices and not delivering the quality -----> i !!! , a beginner, would expect ) so i know that i will have a fair chance of getting a few jobs. also, i heard that i shouldn't go for weddings for a long time, i know how hard it is to shoot for weddings, how chaotic and demanding it can be, i won't bite more than i can chew, i promise! haha. i will mostly take part into birthday parties or other events ( after i learn, of course, how to master the camera in a better way, i'm planning to, besides maybe taking some courses, do some street photography of people and the city ).\n\n&amp;#x200b;\n\nsorry if i wrote too much, but i hope you won't come down too hard on me if i did some mistakes in my thought process. i am open to any criticism, tips or advice in what i should focus on, what gear to buy and so on. thank you for your time!", "sortedWord": "None", "Identifyer": null, "identifyer": 8294, "year": "2021"}, {"autor": "Busy_shug", "date": "2021-07-18 19:01:43", "content": "I created a Diesel Brave fragrance commercial by accident.", "link": "https://www.reddit.com/r/photography/comments/omwy75/i_created_a_diesel_brave_fragrance_commercial_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a diesel brave fragrance commercial by accident.", "sortedWord": "None", "Identifyer": null, "identifyer": 8557, "year": "2021"}, {"autor": "AgathaWristy", "date": "2021-07-27 20:36:29", "content": "Where to post portfolio? /!/ Photography is mostly a hobby but on occasion I need a portfolio to show to a person I know because I mentioned I do this and they got interested in maybe getting me to shoot something for them. I want to not have to show them on my phone, but actually shoot a link where they can browse. What’s the most common way?\n\nI wanted to create a profile on a stock website but read their terms, I don’t really want to deal with any of that, I won’t be posting often enough to profit, so I’d just rather do it elsewhere. Since this is once in a blue moon thing, I also don’t want a website, just a profile somewhere on photographers website or something. What do people do these days for this? Please don’t tell me it’s instagram, cause people can’t really see your photos there.\n\nAlso, should I be worried about people stealing my photos?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/osuodq/where_to_post_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "where to post portfolio? /!/ photography is mostly a hobby but on occasion i need a portfolio to show to a person i know because i mentioned i do this and they got interested in maybe getting me to shoot something for them. i want to not have to show them on my phone, but actually shoot a link where they can browse. what’s the most common way?\n\n-----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  a profile on a stock website but read their terms, -----> i !!!  don’t really want -----> to !!!  deal with any of that, -----> i !!!  won’t be posting often enough -----> to !!!  profit, so -----> i !!! ’d just rather do it elsewhere. since this is once in a blue moon thing, i also don’t want a website, just a profile somewhere on photographers website or something. what do people do these days for this? please don’t tell me it’s instagram, cause people can’t really see your photos there.\n\nalso, should i be worried about people stealing my photos?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 8867, "year": "2021"}, {"autor": "Browserhistory666", "date": "2021-08-04 00:40:53", "content": "Trying to learn a new photo editing style! /!/ Hey all,\n\nI've been taking photos for about five years now and I'm trying to teach myself a new color grade technique rather than just rely on a LUT. I'm definitely still a rookie in all areas, and particularly photoshop, but I've done some research and found some references so hopefully this is a good starting point. Thanks in advance!\n\nI'm working on a personal project with a 70s theme and I'd like it to have the deep saturated colours of the below image. This is a screenshot taken from the film If Beale Street could talk, which was inspired by the photography of [Jack Garofalo](https://designyoutrust.com/2018/11/vibrant-life-of-1970s-harlem-as-photographed-by-jack-garofalo/). Those photographers also shot on Provia which was a film stock by Fujifilm. Here's a link to the [colorists reel](https://www.colorcollective.com/beale-street) who did the movie. \n\n\"We didn’t want to rely on period tropes — soft contrast, milky shadows, and a faded color palette,” says the film’s colorist, Alex Bickel.\"  I'm trying to stay away from the cliche orange and teal look too.\n\nHow would you recommend I create this look? Hopefully my research helps as a starting point. I usually use curves and levels to edit. Currently, I see yellow in the highlights, maybe Green in the shadows and warm overall colours (up the saturation, bring the blues down?) Not sure if this is correct, but would love some general pointers to get started. \n\nhttps://preview.redd.it/pmg4g1etl8f71.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;s=87f193ff9205bfb50bee126a4fff493f17cd89cc", "link": "https://www.reddit.com/r/photography/comments/oxh28e/trying_to_learn_a_new_photo_editing_style/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "trying to learn a new photo editing style! /!/ hey all,\n\ni've been taking photos for about five years now and i'm trying to teach myself a new color grade technique rather than just rely on a lut. i'm definitely still a rookie in all areas, and particularly photoshop, but i've done some research and found some references so hopefully this is a good starting point. thanks in advance!\n\ni'm working on a personal project with a 70s theme and i'd like it to have the deep saturated colours of the below image. this is a screenshot taken from the film if beale street could talk, which was inspired by the photography of [jack garofalo](https://designyoutrust.com/2018/11/vibrant-life-of-1970s-harlem-as-photographed-by-jack-garofalo/). those photographers also shot on provia which was a film stock by fujifilm. here's a link to the [colorists reel](https://www.colorcollective.com/beale-street) who did the movie. \n\n\"we didn’t want to rely on period tropes — soft contrast, milky shadows, and a faded color palette,” says the film’s colorist, alex bickel.\"  i'm trying to stay away from the cliche orange and teal look too.\n\nhow would you recommend -----> i !!!  -----> create !!!  this look? hopefully my research helps as a starting point. i usually use curves and levels to edit. currently, i see yellow in the highlights, maybe green in the shadows and warm overall colours (up the saturation, bring the blues down?) not sure if this is correct, but would love some general pointers to get started. \n\nhttps://preview.redd.it/pmg4g1etl8f71.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;s=87f193ff9205bfb50bee126a4fff493f17cd89cc", "sortedWord": "None", "Identifyer": null, "identifyer": 8905, "year": "2021"}, {"autor": "nocomment01", "date": "2021-08-10 18:25:31", "content": "How can I edit a photo so that eyes are in colour and everything else is monochrome? /!/ Hey all.\n\nI'm trying to create an edit that would almost fully be monochrome, except for the eyes of the person ([Here's a similar photo example](https://imgur.com/VzsYzq6)) \nSo far I've tried fiddling with the **HSL / Saturation** panel and decreasing everything but the colour of the eyes. This, however, isn't as effective since the rest of the photo clearly isn't monochrome but heavily saturated.\n\nHopefully, someone has experience with this effect and can offer me some advice on how to approach this. As always, thank you all in advance.", "link": "https://www.reddit.com/r/photography/comments/p1v4yz/how_can_i_edit_a_photo_so_that_eyes_are_in_colour/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm trying to create", "selectorShort": "create", "MarkedSent": "how can i edit a photo so that eyes are in colour and everything else is monochrome? /!/ hey all.\n\n-----> i !!! 'm -----> trying !!!  -----> to !!!  -----> create !!!  an edit that would almost fully be monochrome, except for the eyes of the person ([here's a similar photo example](https://imgur.com/vzsyzq6)) \nso far i've tried fiddling with the **hsl / saturation** panel and decreasing everything but the colour of the eyes. this, however, isn't as effective since the rest of the photo clearly isn't monochrome but heavily saturated.\n\nhopefully, someone has experience with this effect and can offer me some advice on how to approach this. as always, thank you all in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 9107, "year": "2021"}, {"autor": "Xevioni", "date": "2021-08-12 18:27:58", "content": "I'm creating a website to facilitate photo purchase in my area - what size photos should be uploaded? /!/ I'm creating a website where local photographers can upload pictures to be purchased by customers (these customers appear in them, they are taken at local motocross events).\n\nWhat file size, image quality, and resolution do you think would be the best compromise? What would you be comfortable with giving customers?\n\nPersonally, I think 8MB Max at Original Resolution would be okay, but maybe you guys think lower or higher would be okay?", "link": "https://www.reddit.com/r/photography/comments/p35rov/im_creating_a_website_to_facilitate_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm -----> creating !!!  a website to facilitate photo purchase in my area - what size photos should be uploaded? /!/ i'm creating a website where local photographers can upload pictures to be purchased by customers (these customers appear in them, they are taken at local motocross events).\n\nwhat file size, image quality, and resolution do you think would be the best compromise? what would you be comfortable with giving customers?\n\npersonally, i think 8mb max at original resolution would be okay, but maybe you guys think lower or higher would be okay?", "sortedWord": "None", "Identifyer": null, "identifyer": 9249, "year": "2021"}, {"autor": "valentinLue", "date": "2021-09-02 19:49:15", "content": "Look for photographers, videographers, writers, artists /!/ Hello my name is Valentin Lützkendorf\n\n&amp;#x200B;\n\nThis thought has been going through my head for months and I want to finally put it into practice. I need a lot of people from all over the world.\n\n&amp;#x200B;\n\n I want to create a community that really deals with a topic where you can exchange ideas, where you can show someone new perspectives on the world.\n\n&amp;#x200B;\n\nWhere everyone can create their own folder and upload what they want books, poems, photos, videos or just ideas\n\n&amp;#x200B;\n\nI think we have so many opportunities and so much potential, but we don't use it enough.\n\n&amp;#x200B;\n\nI mean, the thought wouldn't be absolutely overwhelming if we had someone in the community from New York who uploads high quality images of Central Park to the cloud.\n\n&amp;#x200B;\n\nOr a Japanese woman who writes poems and books and lives in the middle of Japan and provides us with the first pages.\n\n&amp;#x200B;\n\nFor example, I live in the south of Bavaria. I can send lots of pictures of the Alps or recommend special places.\n\n&amp;#x200B;\n\nBecause I don't grab so many people from this overrun Instagram and yet you feel alone on this platform.\n\n&amp;#x200B;\n\nI think so many works of art are overlooked and not valued at all.\n\n&amp;#x200B;\n\nI want to reach a lot of people\n\n&amp;#x200B;\n\nEveryone is welcome\n\nIf you feel like it, please get in touch with everyone who understands what I'm getting at\n\nwanted to.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nEmail: [valentin.lue@gmail.com](mailto:valentin.lue@gmail.com)\n\n&amp;#x200B;\n\nInstagram: valentin\\_lutzkendorf\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWhat you need: Google Drive as an app or desktop version\n\nhttps://preview.redd.it/0l877oni95l71.jpg?width=1617&amp;format=pjpg&amp;auto=webp&amp;s=02862d2c6a973ba8e27802d63f8297f83026e96c", "link": "https://www.reddit.com/r/photography/comments/pgpa4p/look_for_photographers_videographers_writers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "look for photographers, videographers, writers, artists /!/ hello my name is valentin lützkendorf\n\n&amp;#x200b;\n\nthis thought has been going through my head for months and i want to finally put it into practice. i need a lot of people from all over the world.\n\n&amp;#x200b;\n\n -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a community that really deals with a topic where you can exchange ideas, where you can show someone new perspectives on the world.\n\n&amp;#x200b;\n\nwhere everyone can create their own folder and upload what they want books, poems, photos, videos or just ideas\n\n&amp;#x200b;\n\ni think we have so many opportunities and so much potential, but we don't use it enough.\n\n&amp;#x200b;\n\ni mean, the thought wouldn't be absolutely overwhelming if we had someone in the community from new york who uploads high quality images of central park to the cloud.\n\n&amp;#x200b;\n\nor a japanese woman who writes poems and books and lives in the middle of japan and provides us with the first pages.\n\n&amp;#x200b;\n\nfor example, i live in the south of bavaria. i can send lots of pictures of the alps or recommend special places.\n\n&amp;#x200b;\n\nbecause i don't grab so many people from this overrun instagram and yet you feel alone on this platform.\n\n&amp;#x200b;\n\ni think so many works of art are overlooked and not valued at all.\n\n&amp;#x200b;\n\ni want to reach a lot of people\n\n&amp;#x200b;\n\neveryone is welcome\n\nif you feel like it, please get in touch with everyone who understands what i'm getting at\n\nwanted to.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nemail: [valentin.lue@gmail.com](mailto:valentin.lue@gmail.com)\n\n&amp;#x200b;\n\ninstagram: valentin\\_lutzkendorf\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nwhat you need: google drive as an app or desktop version\n\nhttps://preview.redd.it/0l877oni95l71.jpg?width=1617&amp;format=pjpg&amp;auto=webp&amp;s=02862d2c6a973ba8e27802d63f8297f83026e96c", "sortedWord": "None", "Identifyer": null, "identifyer": 9363, "year": "2021"}, {"autor": "Coomernator", "date": "2021-09-09 09:33:21", "content": "Why photography is important in today's world. /!/ I was creating a brief document on advise on photography for those starting off. More of my personal experience on what do you really need as there is just so much information out there it can be daunting for those starting off.\n\nHowever, I soon realised that it was slowly becoming a document on the importance of photography in today digital age and why we shouldn't take it for granted.\n\nI will continue with it as even for myself it's pleasant to know why I enjoyed the medium. However would this be something others would enjoy reading?", "link": "https://www.reddit.com/r/photography/comments/pkugq2/why_photography_is_important_in_todays_world/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "why photography is important in today's world. /!/ -----> i !!!  -----> was !!!  -----> creating !!!  a brief document on advise on photography for those starting off. more of my personal experience on what do you really need as there is just so much information out there it can be daunting for those starting off.\n\nhowever, i soon realised that it was slowly becoming a document on the importance of photography in today digital age and why we shouldn't take it for granted.\n\ni will continue with it as even for myself it's pleasant to know why i enjoyed the medium. however would this be something others would enjoy reading?", "sortedWord": "None", "Identifyer": null, "identifyer": 9593, "year": "2021"}, {"autor": "M1ndp0we", "date": "2021-09-17 22:49:32", "content": "Newbie here /!/ Hello, everybody nice to meet you! So I'm 17 years old dude who lately recognized new hobby, It is shooting photos of views I want to remember forever. Maybe there's some good ways to level up and drop my photos in some kind of platform and gain clients or just  likers of my work? If yes , which platforms are the best? And maybe there are some veterans reading this right now if you are one text me I will show you my photos excpecting of some honest  criticism. I also create phylosophy texts which might be valuable for some of your's description under your photo I will do it for free for some good info about photography.", "link": "https://www.reddit.com/r/photography/comments/pqan66/newbie_here/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also create", "selectorShort": "create", "MarkedSent": "newbie here /!/ hello, everybody nice to meet you! so i'm 17 years old dude who lately recognized new hobby, it is shooting photos of views i want to remember forever. maybe there's some good ways to level up and drop my photos in some kind of platform and gain clients or just  likers of my work? if yes , which platforms are the best? and maybe there are some veterans reading this right now if you are one text me i will show you my photos excpecting of some honest  criticism. -----> i !!!  -----> also !!!  -----> create !!!  phylosophy texts which might be valuable for some of your's description under your photo -----> i !!!  will do it for free for some good info about photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 9722, "year": "2021"}, {"autor": "LilyJewellcreative", "date": "2021-10-05 19:44:54", "content": "Created a new Instagram for my photography! Hope to see you guys there 🥰📸 ig- jewellcreativee", "link": "https://www.reddit.com/r/photography/comments/q23z0h/created_a_new_instagram_for_my_photography_hope/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  a new instagram for my photography! hope to see you guys there 🥰📸 ig- jewellcreativee", "sortedWord": "None", "Identifyer": null, "identifyer": 10253, "year": "2021"}, {"autor": "StunningStories", "date": "2021-10-12 19:29:14", "content": "Phone/Webcam Photography Tips/Help to get started /!/ At the beginning of the year I did gymshark66, and started a fitness/health Instagram to track my journey. The majority of my posts have been selfies, or the finished product of meals/baking. I would like to transition towards more \"instagramy photo's\", but can't get anywhere close. \n\nHere are some examples of photos I took around my apartment where I tried to create \"instagramy photo's\", but never posted: [https://imgur.com/a/7N8EAfR](https://imgur.com/a/7N8EAfR)\n\nFor now I was thinking of continuing to use my phone(pixel 3)/webcam(Logitech c920), getting a tripod with an adapter for my phone, a light to help with lighting, and maybe using a free editing software(krita?). If I keep at it for \\~6 more months then I will likely look at getting a proper camera.\n\nI was wondering what you would recommend for the light, tripod, and editing software to get started? Also if they are any youtubers/tutorials etc for this kind of thing you would recommended let me know as well.", "link": "https://www.reddit.com/r/photography/comments/q6tqd0/phonewebcam_photography_tipshelp_to_get_started/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i tried to create", "selectorShort": "create", "MarkedSent": "phone/webcam photography tips/help to get started /!/ at the beginning of the year i did gymshark66, and started a fitness/health instagram to track my journey. the majority of my posts have been selfies, or the finished product of meals/baking. i would like to transition towards more \"instagramy photo's\", but can't get anywhere close. \n\nhere are some examples of photos -----> i !!!  took around my apartment where -----> i !!!  -----> tried !!!  -----> to !!!  -----> create !!!  \"instagramy photo's\", but never posted: [https://imgur.com/a/7n8eafr](https://imgur.com/a/7n8eafr)\n\nfor now -----> i !!!  was thinking of continuing -----> to !!!  use my phone(pixel 3)/webcam(logitech c920), getting a tripod with an adapter for my phone, a light -----> to !!!  help with lighting, and maybe using a free editing software(krita?). if i keep at it for \\~6 more months then i will likely look at getting a proper camera.\n\ni was wondering what you would recommend for the light, tripod, and editing software to get started? also if they are any youtubers/tutorials etc for this kind of thing you would recommended let me know as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 10335, "year": "2021"}, {"autor": "Jdphotopdx", "date": "2021-08-26 23:28:55", "content": "Color Checker Passport colors waaaayyyyy off. /!/ Ive had decent luck with my color checker passport in the past. I got a passport 2 and tried it for the first time today shooting artwork. I was using two ad200’s with softboxes. The wall behind the pieces I was shooting is white. Ive created several profiles from my photos and the colors are bananas. The white wall looks teal. Ive manually adjusted the boxes to make sure they are lined up correctly. Adjust white balances (I shot in flash white balance). Using the adobe standard presets the colors are close, but they look like different paintings when using the color checker profiles its so far off. Super saturated too. Using a Sony a7rIV. Lightroom on a Mac. Thanks for any input anyone has.\n\nEdit: I’m wondering if the problem is I am shooting the photos in Capture One. Not sure why it would, but Lightroom wont tether for Sony so I don’t have a choice.", "link": "https://www.reddit.com/r/photography/comments/pcb843/color_checker_passport_colors_waaaayyyyy_off/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "ive created", "selectorShort": "create", "MarkedSent": "color checker passport colors waaaayyyyy off. /!/ ive had decent luck with my color checker passport in the past. i got a passport 2 and tried it for the first time today shooting artwork. i was using two ad200’s with softboxes. the wall behind the pieces i was shooting is white. -----> i !!! -----> ve !!!  -----> created !!!  several profiles from my photos and the colors are bananas. the white wall looks teal. ive manually adjusted the boxes to make sure they are lined up correctly. adjust white balances (i shot in flash white balance). using the adobe standard presets the colors are close, but they look like different paintings when using the color checker profiles its so far off. super saturated too. using a sony a7riv. lightroom on a mac. thanks for any input anyone has.\n\nedit: i’m wondering if the problem is i am shooting the photos in capture one. not sure why it would, but lightroom wont tether for sony so i don’t have a choice.", "sortedWord": "None", "Identifyer": null, "identifyer": 10685, "year": "2021"}, {"autor": "Jdphotopdx", "date": "2021-08-26 22:57:30", "content": "Color Checker Passport colors way off /!/ Ive had decent luck with my color checker passport in the past. I got a passport 2 and tried it for the first time today shooting artwork. I was using two ad200’s with softboxes. The wall behind the pieces I was shooting is white. Ive created several profiles from my photos and the colors are bananas. The white wall looks teal. Ive manually adjusted the boxes to make sure they are lined up correctly. Adjust white balances (I shot in flash white balance). Using the adobe standard presets the colors are close, but they look like different paintings when using the color checker profiles its so far off. Super saturated too. Using a Sony a7rIV. Lightroom on a Mac. Thanks for any input anyone has.", "link": "https://www.reddit.com/r/photography/comments/pcaoke/color_checker_passport_colors_way_off/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "ive created", "selectorShort": "create", "MarkedSent": "color checker passport colors way off /!/ ive had decent luck with my color checker passport in the past. i got a passport 2 and tried it for the first time today shooting artwork. i was using two ad200’s with softboxes. the wall behind the pieces i was shooting is white. -----> i !!! -----> ve !!!  -----> created !!!  several profiles from my photos and the colors are bananas. the white wall looks teal. ive manually adjusted the boxes to make sure they are lined up correctly. adjust white balances (i shot in flash white balance). using the adobe standard presets the colors are close, but they look like different paintings when using the color checker profiles its so far off. super saturated too. using a sony a7riv. lightroom on a mac. thanks for any input anyone has.", "sortedWord": "None", "Identifyer": null, "identifyer": 10688, "year": "2021"}, {"autor": "onepokemanz", "date": "2021-08-26 22:39:32", "content": "How do I create this lighting effect to get a photo to look like this ? /!/ https://imgur.com/a/M9OMoJg\n\nU see how drake has a pink and blue lightning, how do I achieve this effect.  What is it calle.\n\nI’m a complete noob and just want to recreate this dope photoz\n\nThank you 🙏", "link": "https://www.reddit.com/r/photography/comments/pcacxi/how_do_i_create_this_lighting_effect_to_get_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  this lighting effect to get a photo to look like this ? /!/ https://imgur.com/a/m9omojg\n\nu see how drake has a pink and blue lightning, how do i achieve this effect.  what is it calle.\n\ni’m a complete noob and just want to recreate this dope photoz\n\nthank you 🙏", "sortedWord": "None", "Identifyer": null, "identifyer": 10689, "year": "2021"}, {"autor": "tchausk", "date": "2021-10-25 01:36:07", "content": "Need General Photo Advice - Post-Production /!/ I am a graphic designer by trade, but I have been taking photos since I was a kid as a hobby and have had opportunities to photograph professionally. I would love to elevate my side hustle by mastering urban landscapes. I strive to capture the organic \"epic-ness\" of architecture and grounded realism in the everyday objects we walk right by.\n\nI believe that I have a good eye behind the lens, and its the best best feeling in the world when I lose myself on long photo adventure, but once I import my photos to LR/PS, I really have no idea what direction I want to take my images from an editing perspective. I guess I'm going for that \"moody\" faded aesthetic but moreso I want to create that professional polish so that other people can enjoy it. I know its superficial but it would be cool to get some more likes on IG and build a bit of a following.\n\nI feel a constant push and pull of having to \"learn better editing techniques\" or just \"getting a better camera\" but I really don't even know what I'm looking for. I shoot with a Rebel SL1 and my Pixel phone, and while they are lower-tier tools to shoot with, I'm not here to make excuses. I know it comes down to confidence and having a vision, but I honestly don't know where to direct myself towards. Shooting raw comes so natural to me and editing is like bottling up that magic just so that it's presentable to others.\n\nI was just wondering some of the in-the-weeds thought processes anyone has to share from maybe when they were starting out or stick to now. I know its super vague but I would love to hear your thoughts.", "link": "https://www.reddit.com/r/photography/comments/qf65er/need_general_photo_advice_postproduction/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "need general photo advice - post-production /!/ i am a graphic designer by trade, but i have been taking photos since i was a kid as a hobby and have had opportunities to photograph professionally. i would love to elevate my side hustle by mastering urban landscapes. i strive to capture the organic \"epic-ness\" of architecture and grounded realism in the everyday objects we walk right by.\n\ni believe that i have a good eye behind the lens, and its the best best feeling in the world when i lose myself on long photo adventure, but once i import my photos to lr/ps, i really have no idea what direction i want to take my images from an editing perspective. -----> i !!!  guess -----> i !!! 'm going for that \"moody\" faded aesthetic but moreso -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  that professional polish so that other people can enjoy it. i know its superficial but it would be cool to get some more likes on ig and build a bit of a following.\n\ni feel a constant push and pull of having to \"learn better editing techniques\" or just \"getting a better camera\" but i really don't even know what i'm looking for. i shoot with a rebel sl1 and my pixel phone, and while they are lower-tier tools to shoot with, i'm not here to make excuses. i know it comes down to confidence and having a vision, but i honestly don't know where to direct myself towards. shooting raw comes so natural to me and editing is like bottling up that magic just so that it's presentable to others.\n\ni was just wondering some of the in-the-weeds thought processes anyone has to share from maybe when they were starting out or stick to now. i know its super vague but i would love to hear your thoughts.", "sortedWord": "None", "Identifyer": null, "identifyer": 11315, "year": "2021"}, {"autor": "sheepersheep", "date": "2021-01-19 13:29:16", "content": "Hey guys! Need help understanding how to charge clients for product photography. /!/ Hello everyone!\n\nI'm a budding food photographer but I've been doing wildlife for a while now. I have only recently started doing product and food photography as a side hustle to make more money. \n\nI have been getting gigs but I really don't know how to charge them for it. I don't want to over charge then and sound too cocky but don't want to undercharge for the work I create either. \n\nIf you guys could share your tips on how to charge, I'll be thankful. You can view some of my work at https://ujjwalvadhani.pb.online/photography\n\nIf that helps y'all to see what my skills are worth. Any help appreciated as I'm new to this kind of work. Thanks again. :)", "link": "https://www.reddit.com/r/photography/comments/l0jtsg/hey_guys_need_help_understanding_how_to_charge/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hey guys! need help understanding how to charge clients for product photography. /!/ hello everyone!\n\ni'm a budding food photographer but i've been doing wildlife for a while now. i have only recently started doing product and food photography as a side hustle to make more money. \n\ni have been getting gigs but i really don't know how to charge them for it. -----> i !!!  don't want to over charge then and sound too cocky but don't want to undercharge for the work -----> i !!!  -----> create !!!  either. \n\nif you guys could share your tips on how to charge, i'll be thankful. you can view some of my work at https://ujjwalvadhani.pb.online/photography\n\nif that helps y'all to see what my skills are worth. any help appreciated as i'm new to this kind of work. thanks again. :)", "sortedWord": "None", "Identifyer": null, "identifyer": 11844, "year": "2021"}, {"autor": "Mr-Skywalker1", "date": "2021-02-02 12:22:45", "content": "I'm a student, for my project I'm creating a Photography lighting Brand would appreciate some feedback /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/laubwu/im_a_student_for_my_project_im_creating_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm a student, for my project -----> i !!! 'm -----> creating !!!  a photography lighting brand would appreciate some feedback /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11920, "year": "2021"}, {"autor": "Mr-Skywalker1", "date": "2021-02-02 12:21:45", "content": "I'm a business student, for my project I'm creating a Photography lighting company. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/laubdg/im_a_business_student_for_my_project_im_creating/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm a business student, for my project -----> i !!! 'm -----> creating !!!  a photography lighting company. /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11922, "year": "2021"}, {"autor": "Mr-Skywalker1", "date": "2021-02-02 12:20:33", "content": "I'm a business student, for my project I'm creating a Photography lighting company would appreciate some feed back on my ideas below. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/lauank/im_a_business_student_for_my_project_im_creating/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm a business student, for my project -----> i !!! 'm -----> creating !!!  a photography lighting company would appreciate some feed back on my ideas below. /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11923, "year": "2021"}, {"autor": "Top_Cranberry_3248", "date": "2021-02-02 12:18:15", "content": "I'm a business student, for my project I'm creating a Photography lighting (LED) company would appreciate some feedback . /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/lau9f2/im_a_business_student_for_my_project_im_creating/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "-----> i !!! 'm a business student, for my project -----> i !!! 'm -----> creating !!!  a photography lighting (led) company would appreciate some feedback . /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11924, "year": "2021"}, {"autor": "Top_Cranberry_3248", "date": "2021-02-02 12:16:25", "content": "HELP I'm a business student, for my project I'm creating a Photography lighting (LED) company would appreciate some feedback . /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/lau8g3/help_im_a_business_student_for_my_project_im/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "help -----> i !!! 'm a business student, for my project -----> i !!! 'm -----> creating !!!  a photography lighting (led) company would appreciate some feedback . /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 11925, "year": "2021"}, {"autor": "tacomince", "date": "2021-01-31 23:07:36", "content": "How would I re-create a photo like this?", "link": "https://www.reddit.com/r/photography/comments/l9olqw/how_would_i_recreate_a_photo_like_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i re-create", "selectorShort": "create", "MarkedSent": "how would -----> i !!!  -----> re !!! -create a photo like this?", "sortedWord": "None", "Identifyer": null, "identifyer": 12079, "year": "2021"}, {"autor": "Serylt", "date": "2021-01-25 15:41:16", "content": "Your opinion on Stock Photography? /!/ First of all, the personal anecdote.  \nAbout two years ago I created an account at some various Stock Photography sites. I've uploaded about \\~100 to \\~200 images to them. I rechecked and now have an *astonishing* \"unpaid earnings balance\" of about $10 on them combined. Basically, I'm rich now, *right?!*\n\nI have also rechecked on what I even uploaded and what has sold and what hasn't. I am both surprised as well as a bit disappointed in it. At first, I planned - or hoped - to earn a little pocket money by selling off some images I haven't found another use for. It is, indeed, an aimless approach. Maybe I didn't get much off of it because I have no aim in what to \"deliver\" as sellable good. You don't know your client when selling images as stock photography.\n\nNow, *secondly, off to my concerns* I had as I was skimming through my (stock) \"\"portfolio\"\".\n\nPersonally, I feel like it's *devaluing*. Both in an artistic as well as financial sense. You might get a few bucks per image sale, maybe even just a few cents. It's a numbers game, basically. The more you upload, the more you could earn. But can I offer a thousand quality images that find potential buyers to earn me a measly $100 a year, or even a month? Isn't it just quantity over quality and hoping to \"hit the spot\"? What about potential \"reputation damage\" when your stock photography portfolio does not \"feel right\" to you, but you just try to make an extra income with that? Tailored to perceived needs of a buyer?\n\nI really don't know, I am unsure if it's worth it and something to be pursued or just a total waste of time. And yet, I keep on contemplating on pursuing the idea of uploading 1000-2000 images, solely to have the \"chance\" of getting that pocket money over the years.\n\nDo you have an opinion on that?\n\nIf so, please share it. Right now, I am just torn between potential money out of unused images (or even directly trying to pursue images directly for Stock photos) *or* just leaving it entirely because it's a waste of time. Not sure if anyone can relate to that.", "link": "https://www.reddit.com/r/photography/comments/l4qbs6/your_opinion_on_stock_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "your opinion on stock photography? /!/ first of all, the personal anecdote.  \nabout two years ago -----> i !!!  -----> created !!!  an account at some various stock photography sites. i've uploaded about \\~100 to \\~200 images to them. i rechecked and now have an *astonishing* \"unpaid earnings balance\" of about $10 on them combined. basically, i'm rich now, *right?!*\n\ni have also rechecked on what i even uploaded and what has sold and what hasn't. i am both surprised as well as a bit disappointed in it. at first, i planned - or hoped - to earn a little pocket money by selling off some images i haven't found another use for. it is, indeed, an aimless approach. maybe i didn't get much off of it because i have no aim in what to \"deliver\" as sellable good. you don't know your client when selling images as stock photography.\n\nnow, *secondly, off to my concerns* i had as i was skimming through my (stock) \"\"portfolio\"\".\n\npersonally, i feel like it's *devaluing*. both in an artistic as well as financial sense. you might get a few bucks per image sale, maybe even just a few cents. it's a numbers game, basically. the more you upload, the more you could earn. but can i offer a thousand quality images that find potential buyers to earn me a measly $100 a year, or even a month? isn't it just quantity over quality and hoping to \"hit the spot\"? what about potential \"reputation damage\" when your stock photography portfolio does not \"feel right\" to you, but you just try to make an extra income with that? tailored to perceived needs of a buyer?\n\ni really don't know, i am unsure if it's worth it and something to be pursued or just a total waste of time. and yet, i keep on contemplating on pursuing the idea of uploading 1000-2000 images, solely to have the \"chance\" of getting that pocket money over the years.\n\ndo you have an opinion on that?\n\nif so, please share it. right now, i am just torn between potential money out of unused images (or even directly trying to pursue images directly for stock photos) *or* just leaving it entirely because it's a waste of time. not sure if anyone can relate to that.", "sortedWord": "None", "Identifyer": null, "identifyer": 12185, "year": "2021"}, {"autor": "DontWuzzlerTheTIger", "date": "2021-02-09 14:03:06", "content": "Join the wuzzl.pic - Photography Discord Server! ~ Hey Guys, I wanna let you now that I created an discord server for photographers! You can share your knowledge and favourite location with all other photographers out there! Hope to see you soon :)", "link": "https://www.reddit.com/r/photography/comments/lg3y54/join_the_wuzzlpic_photography_discord_server_hey/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "join the wuzzl.pic - photography discord server! ~ hey guys, -----> i !!!  wanna let you now that -----> i !!!  -----> created !!!  an discord server for photographers! you can share your knowledge and favourite location with all other photographers out there! hope to see you soon :)", "sortedWord": "None", "Identifyer": null, "identifyer": 12236, "year": "2021"}, {"autor": "NahlaMonroe", "date": "2021-02-14 19:41:34", "content": "NAHLA MONROE - I am the real Nahla Monroe - I created this account so I could show more of me AND you can help my Reddit exposure! You can find me on IG https://www.instagram.com/nahla.monroe or my Exclusive Sites https://nahlamonroe.vip to get to know me more personally - enjoy the hotness! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ljvmju/nahla_monroe_i_am_the_real_nahla_monroe_i_created/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "nahla monroe - -----> i !!!  am the real nahla monroe - -----> i !!!  -----> created !!!  this account so i could show more of me and you can help my reddit exposure! you can find me on ig https://www.instagram.com/nahla.monroe or my exclusive sites https://nahlamonroe.vip to get to know me more personally - enjoy the hotness! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 12306, "year": "2021"}, {"autor": "whatsamiddler", "date": "2021-02-14 18:41:56", "content": "Is New York Dead? I'm a NY-based amateur photographer and on a mission to prove that New York is far from dead. I created a website to crowd-source a photo collection showing life on every block of NYC. If you're based in NY, please consider contributing photos!", "link": "https://www.reddit.com/r/photography/comments/ljuden/is_new_york_dead_im_a_nybased_amateur/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "is new york dead? i'm a ny-based amateur photographer and on a mission to prove that new york is far from dead. -----> i !!!  -----> created !!!  a website to crowd-source a photo collection showing life on every block of nyc. if you're based in ny, please consider contributing photos!", "sortedWord": "None", "Identifyer": null, "identifyer": 12310, "year": "2021"}, {"autor": "AbedAbedAbedAbeeeed", "date": "2021-02-21 03:58:40", "content": "I feel like I don’t view photography creatively anymore, at least not like I used to. /!/ This isn’t about me being burned out on photography, because I’m not. I just feel like my eye gravitates to the lazy/easy shots now, and I’m only thinking about the best angle/pose/composition until after the fact. I feel like I’m going through the motions when I’m working. I think I feel like this because I’ve just been doing what my clients want, not what I want, for so many years that I feel like I’ve lost my own style.\n\nLately I’ve had two different photographers who have only been shooting for a few years ask me for tips and advice on their work, and I always love when people ask me that, because to me it shows me they Ike and respect my work. But, as soon as I look at their portfolio, I’m in awe of how good both if them were, and they’d been doing photography for half, one of them less than half, the time I have(this year makes ten years for me). One of their portfolios actually reminded me so much of what my portfolio looked like when I first started, using interesting vantage points, creative use of their environment, and clearly traveling to get the shot *they wanted*.\n\nI guess I’m kind of in a photography funk, and I’m just now realizing it today. I had a great start to the year this past year, and going back into 2019 I was really, really loving what I was creating, but now I’m just consistently underwhelmed. I feel like I’m not taking the photos I want to take, just the ones I’m paid to take, and I even feel like I’m unable to take the photos I want to take. Like, I feel like I don’t have permission to go out and take the shots I want to take, if that makes sense.\n\nAnyone else every feel like this? Any tips on how to re-inspire myself?", "link": "https://www.reddit.com/r/photography/comments/loofpb/i_feel_like_i_dont_view_photography_creatively/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "i feel like i don’t view photography creatively anymore, at least not like i used to. /!/ this isn’t about me being burned out on photography, because i’m not. i just feel like my eye gravitates to the lazy/easy shots now, and i’m only thinking about the best angle/pose/composition until after the fact. i feel like i’m going through the motions when i’m working. i think i feel like this because i’ve just been doing what my clients want, not what i want, for so many years that i feel like i’ve lost my own style.\n\nlately i’ve had two different photographers who have only been shooting for a few years ask me for tips and advice on their work, and i always love when people ask me that, because to me it shows me they ike and respect my work. but, as soon as i look at their portfolio, i’m in awe of how good both if them were, and they’d been doing photography for half, one of them less than half, the time i have(this year makes ten years for me). one of their portfolios actually reminded me so much of what my portfolio looked like when i first started, using interesting vantage points, creative use of their environment, and clearly traveling to get the shot *they wanted*.\n\ni guess i’m kind of in a photography funk, and i’m just now realizing it today. -----> i !!!  had a great start to the year this past year, and going back into 2019 -----> i !!!  -----> was !!!  really, really loving what -----> i !!!  -----> was !!!  -----> creating !!! , but now -----> i !!! ’m just consistently underwhelmed. i feel like i’m not taking the photos i want to take, just the ones i’m paid to take, and i even feel like i’m unable to take the photos i want to take. like, i feel like i don’t have permission to go out and take the shots i want to take, if that makes sense.\n\nanyone else every feel like this? any tips on how to re-inspire myself?", "sortedWord": "None", "Identifyer": null, "identifyer": 12412, "year": "2021"}, {"autor": "theiinlive", "date": "2021-02-20 18:45:53", "content": "Creating an art display /!/ Hi, I am displaying some of my prints for the first time and I'm lost. I ordered a set of cheap frames for the 8x12's and I'm okay with those for now. Not ideal, as I wanted something with thin borders and no mat, but we'll let it go unless someone has something better . yikes\n\nLooking for a cheaper option to display and hang the 5x7s and 6x4's. I was thinking black backing of foam core (?) or some cardboard like material. a little bit of a mat, or have the photos kinda floating there. Anyone have suggestions? I am easily overwhelmed and a quick google search led me to a frame site that doesn't have anything in that size/way too many options.\n\nAlso looking for little pieces of paper with the title of the piece and price. But like, where do you find that stuff? lol. crafts stores maybe?", "link": "https://www.reddit.com/r/photography/comments/lodoju/creating_an_art_display/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an art display /!/ hi, i am displaying some of my prints for the first time and i'm lost. i ordered a set of cheap frames for the 8x12's and i'm okay with those for now. not ideal, as i wanted something with thin borders and no mat, but we'll let it go unless someone has something better . yikes\n\nlooking for a cheaper option to display and hang the 5x7s and 6x4's. i was thinking black backing of foam core (?) or some cardboard like material. a little bit of a mat, or have the photos kinda floating there. anyone have suggestions? i am easily overwhelmed and a quick google search led me to a frame site that doesn't have anything in that size/way too many options.\n\nalso looking for little pieces of paper with the title of the piece and price. but like, where do you find that stuff? lol. crafts stores maybe?", "sortedWord": "None", "Identifyer": null, "identifyer": 12446, "year": "2021"}, {"autor": "zwgarrett1988", "date": "2021-03-02 19:18:20", "content": "Metadata /!/ I download so many photographs from the internet by just right clicking. I’m a graphic designer and all though most of the photographs go into a folder titled “web scrap book/photojournal” that I look over from time to time, I do browse through the folder if I know I might have something perfect for a design project. Metadata is often overlooked. If I look at the photograph and it has no metadata to tell me who took it, it was uploaded to a platform that allows me to download it freely, and I can’t find what I need through a reverse image search. I act as if the photographer intended for their art to be shared for free. I would like to save information about the poster but it isn’t something I can do in two clicks. I would like to give the original artist recognition in the metadata of any file I create regardless of licensing too. It’s really simple to add metadata in photoshop and other editing software. This is something that we should all be focusing on. A good picture will spread across the internet rather quickly. Although the quality might be less than due to compression, so long as I don’t have to enlarge the photograph or use it for print (in some cases) the photo is usually good. We all have differing opinions when it comes to license. Ethical designers look for this information because we don’t appreciate theft of intellectual property either. Watermarks are a good, Reddit automatically puts a bar at the bottom of the photo with the name of the user who posted it. I don’t like to be dependent on watermarks because they rub clients the wrong way and can be disruptive to composition. I know pro photographers are aware of how much their content can be worth so they work with stock companies. I have a few pictures posted on line that were taken on my cell phone that aren’t up to pro quality but are still good enough to use depending on how. Sometimes the random cell phone shot is the missing piece to a composition. My whole point, ya never know, I’m not educated about copyright laws but I feel like a court would respect metadata as proof that an artist owns content. I would be enraged to find out that a large corporation was using my content without cutting me out a piece of the pie. Seeing my content used by Non profits, small business, and In portfolio work wouldn’t bug me at all. If I donate work to non-profit organizations I can claim it on my taxes, that’s a win win. If I include a line in metadata indicating who I’m willing to donate too then they don’t even have to ask for it to be considered donated. The most important inclusion is contact information though. If I see nothing but “this photo is the intellectual property of John Doe, he can’t be reached at jodo88@domain.net” I could just email and ask. I know that cameras can add metadata when the photo is shot. I’m sure some if not all pro cameras allow photographers to set defaults for metadata. It’s such a simple thing that addresses a huge ethical problem. From not on I’m going to ensure my photography has metadata. We should really work to make this standard practice among professionals, enthusiasts, amateurs, and cell phone owners. I’m sure a lot of people have been robbed by media outlets.", "link": "https://www.reddit.com/r/photography/comments/lwa5d2/metadata/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "metadata /!/ i download so many photographs from the internet by just right clicking. i’m a graphic designer and all though most of the photographs go into a folder titled “web scrap book/photojournal” that i look over from time to time, i do browse through the folder if i know i might have something perfect for a design project. metadata is often overlooked. if i look at the photograph and it has no metadata to tell me who took it, it was uploaded to a platform that allows me to download it freely, and i can’t find what i need through a reverse image search. i act as if the photographer intended for their art to be shared for free. i would like to save information about the poster but it isn’t something i can do in two clicks. -----> i !!!  would like to give the original artist recognition in the metadata of any file -----> i !!!  -----> create !!!  regardless of licensing too. it’s really simple to add metadata in photoshop and other editing software. this is something that we should all be focusing on. a good picture will spread across the internet rather quickly. although the quality might be less than due to compression, so long as i don’t have to enlarge the photograph or use it for print (in some cases) the photo is usually good. we all have differing opinions when it comes to license. ethical designers look for this information because we don’t appreciate theft of intellectual property either. watermarks are a good, reddit automatically puts a bar at the bottom of the photo with the name of the user who posted it. i don’t like to be dependent on watermarks because they rub clients the wrong way and can be disruptive to composition. i know pro photographers are aware of how much their content can be worth so they work with stock companies. i have a few pictures posted on line that were taken on my cell phone that aren’t up to pro quality but are still good enough to use depending on how. sometimes the random cell phone shot is the missing piece to a composition. my whole point, ya never know, i’m not educated about copyright laws but i feel like a court would respect metadata as proof that an artist owns content. i would be enraged to find out that a large corporation was using my content without cutting me out a piece of the pie. seeing my content used by non profits, small business, and in portfolio work wouldn’t bug me at all. if i donate work to non-profit organizations i can claim it on my taxes, that’s a win win. if i include a line in metadata indicating who i’m willing to donate too then they don’t even have to ask for it to be considered donated. the most important inclusion is contact information though. if i see nothing but “this photo is the intellectual property of john doe, he can’t be reached at jodo88@domain.net” i could just email and ask. i know that cameras can add metadata when the photo is shot. i’m sure some if not all pro cameras allow photographers to set defaults for metadata. it’s such a simple thing that addresses a huge ethical problem. from not on i’m going to ensure my photography has metadata. we should really work to make this standard practice among professionals, enthusiasts, amateurs, and cell phone owners. i’m sure a lot of people have been robbed by media outlets.", "sortedWord": "None", "Identifyer": null, "identifyer": 12706, "year": "2021"}, {"autor": "phototaker1986", "date": "2021-04-05 16:36:56", "content": "Recommendations for appointment scheduling website / software? /!/ I’m looking for recommendations for photography appointment scheduling website / software. I tried a 7 day trial with Acuity but while the interface was neat (and it had some useful features) it can only sync 1 google calendar per account. Sadly this is a dealbreaker. \n\nOur photography business is lucky to be *kinda* busy (in normal times) so I think scheduling appointments is a logical next step for us.\n\nI really want to add the option for customers to book appointments with some appointment scheduling software. I think it'll really help streamline our process. If you have any recommendations please share them, as well as your thoughts.\n\nKey features the appointment scheduling must have -\n\n* Ability to sync multiple Google calendars (business and personal calendars). **This is vital**.\n\n* Ability to add timed window before and after appointments (15 mins before &amp; after for example) to allow for overlap / tidy up.\n\n* Option to let customers select appointments but have us confirm the appointment 100%. This isn’t vital but would be super useful. \n\n* Text / email reminders to clients prior to appointments, automatically.\n\n* Limit availability, so calendar doesn’t always show ALL our availability (to make it look more busy when the diary is a bit empty).\n\n* If possible group appointments together so we aren’t doing a 10am, 1pm and 4pm appointments on one day (instead have them back to back).\n\n* Allow the option to schedule different types of appointments (not just photoshoots).\n\n* Allow us to create custom forms / and gather customer info when booking.\n\n The major issue I’ve ran into is managing multiple Google calendars to one booking diary seems to be tricky / not something widely offered. All the other features are wants, not needs. Can you share your best suggestions based on the requirements? Thanks.", "link": "https://www.reddit.com/r/photography/comments/mkousj/recommendations_for_appointment_scheduling/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "us to create", "selectorShort": "create", "MarkedSent": "recommendations for appointment scheduling website / software? /!/ i’m looking for recommendations for photography appointment scheduling website / software. i tried a 7 day trial with acuity but while the interface was neat (and it had some useful features) it can only sync 1 google calendar per account. sadly this is a dealbreaker. \n\nour photography business is lucky to be *kinda* busy (in normal times) so i think scheduling appointments is a logical next step for us.\n\ni really want to add the option for customers to book appointments with some appointment scheduling software. i think it'll really help streamline our process. if you have any recommendations please share them, as well as your thoughts.\n\nkey features the appointment scheduling must have -\n\n* ability to sync multiple google calendars (business and personal calendars). **this is vital**.\n\n* ability to add timed window before and after appointments (15 mins before &amp; after for example) to allow for overlap / tidy up.\n\n* option to let customers select appointments but have us confirm the appointment 100%. this isn’t vital but would be super useful. \n\n* text / email reminders to clients prior to appointments, automatically.\n\n* limit availability, so calendar doesn’t always show all our availability (to make it look more busy when the diary is a bit empty).\n\n* if possible group appointments together so we aren’t doing a 10am, 1pm and 4pm appointments on one day (instead have them back to back).\n\n* allow the option to schedule different types of appointments (not just photoshoots).\n\n* allow -----> us !!!  -----> to !!!  -----> create !!!  custom forms / and gather customer info when booking.\n\n the major issue i’ve ran into is managing multiple google calendars to one booking diary seems to be tricky / not something widely offered. all the other features are wants, not needs. can you share your best suggestions based on the requirements? thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 13012, "year": "2021"}, {"autor": "pokeranger24", "date": "2021-04-19 17:56:41", "content": "How to create a good background for plant photos? /!/ Hi, I am kinda a beginner at photography and need some advice for plant pics. The thing is I have created a website to sell plants and have got trouble clicking good pics of the plants. The biggest problem is the background, what kind of background should I create for my plants to make them stand out? For now, Just use my mobile camera and then use MS paint to remove the background and made it white but well the photos are losing their quality and color. And the whole process of removing the background manually is really time-consuming.\n\nOh and I use a Panasonic DMC-GF2\n\n[A couple of Photos for reference](https://imgur.com/gallery/h7eXbnL)", "link": "https://www.reddit.com/r/photography/comments/mu6d8k/how_to_create_a_good_background_for_plant_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "how to create a good background for plant photos? /!/ hi, i am kinda a beginner at photography and need some advice for plant pics. the thing is -----> i !!!  -----> have !!!  -----> created !!!  a website to sell plants and -----> have !!!  got trouble clicking good pics of the plants. the biggest problem is the background, what kind of background should i create for my plants to make them stand out? for now, just use my mobile camera and then use ms paint to remove the background and made it white but well the photos are losing their quality and color. and the whole process of removing the background manually is really time-consuming.\n\noh and i use a panasonic dmc-gf2\n\n[a couple of photos for reference](https://imgur.com/gallery/h7exbnl)", "sortedWord": "None", "Identifyer": null, "identifyer": 13219, "year": "2021"}, {"autor": "ElJesusJudas", "date": "2021-04-19 12:59:55", "content": "Which is a good Photo Album /!/ I have taken a lot of photos during the last year, and I was wondering what would be a good photo album to put my pictures in. I want to create a photo album in which I can put my picture in chronological order and add a caption to every photo. Any recommendations? Thanks. :)", "link": "https://www.reddit.com/r/photography/comments/mu027s/which_is_a_good_photo_album/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "which is a good photo album /!/ i have taken a lot of photos during the last year, and i was wondering what would be a good photo album to put my pictures in. -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a photo album in which -----> i !!!  can put my picture in chronological order and add a caption -----> to !!!  every photo. any recommendations? thanks. :)", "sortedWord": "None", "Identifyer": null, "identifyer": 13242, "year": "2021"}, {"autor": "EmmaPhlox", "date": "2021-04-23 20:01:59", "content": "How to accurately maintain colour temperature and illuminance in a photo? /!/ Hey guys,\n\nFor my master thesis, I am desiging a short survey in which respondents answer questions based on photographs of food in different lighting. The lighting differs over the conditions from dim (35 lx) to bright (300 lx) and from cold (6000K) to warm (2700K). Creating these conditions isn't the problem. Accurately photographing them is. \n\nI am a total noob in the field of photography and am using the \"pro mode\" on my smartphone's camera, as the quality of the photo's doesn't really matter (and I have no other equipment available to me). I really don't know how to maintain these brightness levels on a photo. If I set my ISO and shuttertime (I hope I use the correct terms) to a set value, it is either too bright or too dark for one of the conditions. If I don't, the photo's look basically the same.  \n\nAgain, I really don't know what I'm talking about. Any tips on how to do this would be greatly appreciated. Editing the photo's in post-production to accurately reflect the lighting values would work too, but I would need to know the specific illuminance- and CCT-values in lux and Kelvin.\n\nPlease help!", "link": "https://www.reddit.com/r/photography/comments/mx3shm/how_to_accurately_maintain_colour_temperature_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "how to accurately maintain colour temperature and illuminance in a photo? /!/ hey guys,\n\nfor my master thesis, i am desiging a short survey in which respondents answer questions based on photographs of food in different lighting. the lighting differs over the conditions from dim (35 lx) to bright (300 lx) and from cold (6000k) to warm (2700k). -----> creating !!!  these conditions isn't the problem. accurately photographing them is. \n\ni am a total noob in the field of photography and am using the \"pro mode\" on my smartphone's camera, as the quality of the photo's doesn't really matter (and i have no other equipment available to me). i really don't know how to maintain these brightness levels on a photo. if i set my iso and shuttertime (i hope i use the correct terms) to a set value, it is either too bright or too dark for one of the conditions. if i don't, the photo's look basically the same.  \n\nagain, i really don't know what i'm talking about. any tips on how to do this would be greatly appreciated. editing the photo's in post-production to accurately reflect the lighting values would work too, but i would need to know the specific illuminance- and cct-values in lux and kelvin.\n\nplease help!", "sortedWord": "None", "Identifyer": null, "identifyer": 13332, "year": "2021"}, {"autor": "Tech415", "date": "2021-05-05 08:25:25", "content": "How Can I Create Backgrounds Like These? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/n5aznj/how_can_i_create_backgrounds_like_these/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  backgrounds like these? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 13532, "year": "2021"}, {"autor": "Tech415", "date": "2021-05-05 08:23:19", "content": "How Can I Create Backgrounds Like These? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/n5ayiq/how_can_i_create_backgrounds_like_these/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> create !!!  backgrounds like these? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 13533, "year": "2021"}, {"autor": "BERK2525", "date": "2021-05-02 20:33:17", "content": "Creating an Instagram for my photography and need some handle ideas /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/n3f9yt/creating_an_instagram_for_my_photography_and_need/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an instagram for my photography and need some handle ideas /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 13618, "year": "2021"}, {"autor": "Twink-le", "date": "2021-05-12 12:53:45", "content": "Quick Beauty retouching/photography tips for a beginner? /!/ I'm a 19 yo self-taught mua trying to get into beauty photography with just my mirrorless camera. I created tons of work this pandemic but I felt like a newbie using the automatic + exposure adjustment setting. If there's any pro in here I can send private message pics for some critic :3 my question/problems for now r:\n\n1. **What brightness should I set my screen to while editing?** still my biggest struggle, I edit at night then regret them at the day\n2. **I'm overwhelmed by major changes in editing** I'm more of a enhancer and major changes like a +50 brightness/exposure are too much for me, maybe I just don't have vision how do I be original? or where can I find inspo?", "link": "https://www.reddit.com/r/photography/comments/nanyn1/quick_beauty_retouchingphotography_tips_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "quick beauty retouching/photography tips for a beginner? /!/ i'm a 19 yo self-taught mua trying to get into beauty photography with just my mirrorless camera. -----> i !!!  -----> created !!!  tons of work this pandemic but i felt like a newbie using the automatic + exposure adjustment setting. if there's any pro in here i can send private message pics for some critic :3 my question/problems for now r:\n\n1. **what brightness should i set my screen to while editing?** still my biggest struggle, i edit at night then regret them at the day\n2. **i'm overwhelmed by major changes in editing** i'm more of a enhancer and major changes like a +50 brightness/exposure are too much for me, maybe i just don't have vision how do i be original? or where can i find inspo?", "sortedWord": "None", "Identifyer": null, "identifyer": 13804, "year": "2021"}, {"autor": "IOughtToBeThrownAway", "date": "2021-05-17 17:58:15", "content": "what are your thoughts on macro photography? /!/ I've got a cheap 25x lens, and I've been just messing around with it and it's loads of fun. \n\nThen I got to checking out subs like r/macrophotography and r/macroporn and I just gotta say, I'm amazed by what people accomplish with various techniques and their own artistic eye. For example abstract macros- those are really stunning. Also, stacked macros, which I only recently learned about, are exceptionally cool to look at. \n\n&amp;#x200B;\n\nI feel like macro shots give us a glimpse into another world, and it's pretty darn cool. \n\n&amp;#x200B;\n\nAlso, macro photographers may find this of interest: I created a sub called r/guessthemacro, where photographers can post their own original macros, heavily cropped so as not to immediately reveal what the photographed item actually is! it's kind of fun looking at super narrow, almost microscopic focus on an every day item, and having no real reference for what it is. Self promotion is welcome there, if you post your art, just make sure the title and image don't spoil the image puzzle, but feel free to link to your original snaps, or your profile in the comments. &gt;!&gt;!Spoil mark though, so it doesn't reveal the answers! !&lt;!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nBut what do you think of macro photography? are there any macro shots that stand out as really amazing, in your eyes? \n\nFor those who try to snap macro shots as a hobby, are there any must have apps, programs, or accessories that put your shots on the next level?", "link": "https://www.reddit.com/r/photography/comments/nen3oo/what_are_your_thoughts_on_macro_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "what are your thoughts on macro photography? /!/ i've got a cheap 25x lens, and i've been just messing around with it and it's loads of fun. \n\nthen i got to checking out subs like r/macrophotography and r/macroporn and i just gotta say, i'm amazed by what people accomplish with various techniques and their own artistic eye. for example abstract macros- those are really stunning. also, stacked macros, which i only recently learned about, are exceptionally cool to look at. \n\n&amp;#x200b;\n\ni feel like macro shots give us a glimpse into another world, and it's pretty darn cool. \n\n&amp;#x200b;\n\nalso, macro photographers may find this of interest: -----> i !!!  -----> created !!!  a sub called r/guessthemacro, where photographers can post their own original macros, heavily cropped so as not to immediately reveal what the photographed item actually is! it's kind of fun looking at super narrow, almost microscopic focus on an every day item, and having no real reference for what it is. self promotion is welcome there, if you post your art, just make sure the title and image don't spoil the image puzzle, but feel free to link to your original snaps, or your profile in the comments. &gt;!&gt;!spoil mark though, so it doesn't reveal the answers! !&lt;!&lt;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nbut what do you think of macro photography? are there any macro shots that stand out as really amazing, in your eyes? \n\nfor those who try to snap macro shots as a hobby, are there any must have apps, programs, or accessories that put your shots on the next level?", "sortedWord": "None", "Identifyer": null, "identifyer": 13896, "year": "2021"}, {"autor": "Future_Pilot4", "date": "2021-05-27 02:39:40", "content": "Hi! I created a Reddit page for anyone interested in aviation photography or just planes in general. Please feel free to join", "link": "https://www.reddit.com/r/photography/comments/nlxqza/hi_i_created_a_reddit_page_for_anyone_interested/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi! -----> i !!!  -----> created !!!  a reddit page for anyone interested in aviation photography or just planes in general. please feel free to join", "sortedWord": "None", "Identifyer": null, "identifyer": 14217, "year": "2021"}, {"autor": "random_reddit_1010", "date": "2021-05-26 21:54:09", "content": "Between the Fuji X - series or Sony Alpha which is better for someone trying to get back urban/street photography? /!/ Hi,\n\nI used to really enjoy street/urban photography when I used to live abroad I am hoping to get back into soon. I never did it professionally but I loved creating images with some emotion or mood.\n\nI used to have an old canon rebel with different lenses but I will have to start from scratch. The camera is old and the lenses are not on par with what’s out there today (it’s been about 3-4 years since I’ve seriously just explored and took pictures. \n\nThe most I’ll spend in about $2000 (price for kits with standard lenses).\nI[here are pictures I took previously with a damaged lens and body](https://imgur.com/a/c0UsYBu)\n\nSome of my older posts on this profile have my old pictures too. \n\nI miss just aimlessly walking around and taking pictures of things I see. \n\nAny advice of what I can/should do before trying to get back into photography and dropping large amounts of cash?", "link": "https://www.reddit.com/r/photography/comments/nlshoh/between_the_fuji_x_series_or_sony_alpha_which_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i loved creating", "selectorShort": "create", "MarkedSent": "between the fuji x - series or sony alpha which is better for someone trying to get back urban/street photography? /!/ hi,\n\ni used to really enjoy street/urban photography when i used to live abroad i am hoping to get back into soon. i never did it professionally but -----> i !!!  -----> loved !!!  -----> creating !!!  images with some emotion or mood.\n\ni used to have an old canon rebel with different lenses but i will have to start from scratch. the camera is old and the lenses are not on par with what’s out there today (it’s been about 3-4 years since i’ve seriously just explored and took pictures. \n\nthe most i’ll spend in about $2000 (price for kits with standard lenses).\ni[here are pictures i took previously with a damaged lens and body](https://imgur.com/a/c0usybu)\n\nsome of my older posts on this profile have my old pictures too. \n\ni miss just aimlessly walking around and taking pictures of things i see. \n\nany advice of what i can/should do before trying to get back into photography and dropping large amounts of cash?", "sortedWord": "None", "Identifyer": null, "identifyer": 14232, "year": "2021"}, {"autor": "Telikad", "date": "2021-06-08 22:54:37", "content": "This iOS Shortcut will automatically set your wallpaper to a different FStopper's photograph each day /!/ *Note: It's finally done! This shortcut is the fourth iteration of* u/mvan231*'s shortcut, the later three versions made by myself. Here's the link:*\n\n[https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b](https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b) \n\nIf you're like me, you're easily bored by the same wallpaper each day. You want something new, something unique! This Shortcut does just that, and it used FStopper's enormous community photography library. You can easily pick which category (tag) you want to use, including the Photo of the Day, Editor's picks, and various tags.\n\n**To setup this Shortcut to run automatically,** ***you will need to follow these steps:***  \n1. Open Shortcuts and run any of the preinstalled options (iOS security requirement)  \n2. Go to settings, choose Shortcuts, and enable Shortcuts from untrusted locations  \n3. Download the above shortcut  \n4. Create a new automation, using the charging trigger so you can opt to run without prompt  \n5. Add the 'Run a Shortcut' action to your new automation  \n6. That's it! Enjoy!\n\nPlease note, Shortcuts is a powerful application that should be used with care. Always thoroughly examine downloaded Shortcuts before running them! **This shortcut does the following:**  \n1. Creates a database of previously used wallpapers in Notes to prevent duplicates  \n2. Check if the user is connected to WiFi, if so continues  \n3. Queries a variety of FStopper's Community photograph libraries, depending on the category chosen by the user  \n4. Downloads a never-before-used image and sets it as your wallpaper  \n5. Logs the new wallpaper in the database", "link": "https://www.reddit.com/r/photography/comments/nvgzxp/this_ios_shortcut_will_automatically_set_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "this ios shortcut will automatically set your wallpaper to a different fstopper's photograph each day /!/ *note: it's finally done! this shortcut is the fourth iteration of* u/mvan231*'s shortcut, the later three versions made by myself. here's the link:*\n\n[https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b](https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b) \n\nif you're like me, you're easily bored by the same wallpaper each day. you want something new, something unique! this shortcut does just that, and it used fstopper's enormous community photography library. you can easily pick which category (tag) you want to use, including the photo of the day, editor's picks, and various tags.\n\n**to setup this shortcut to run automatically,** ***you will need to follow these steps:***  \n1. open shortcuts and run any of the preinstalled options (ios security requirement)  \n2. go to settings, choose shortcuts, and enable shortcuts from untrusted locations  \n3. download the above shortcut  \n4. -----> create !!!  a new automation, using the charging trigger so you can opt to run without prompt  \n5. add the 'run a shortcut' action to your new automation  \n6. that's it! enjoy!\n\nplease note, shortcuts is a powerful application that should be used with care. always thoroughly examine downloaded shortcuts before running them! **this shortcut does the following:**  \n1. creates a database of previously used wallpapers in notes to prevent duplicates  \n2. check if the user is connected to wifi, if so continues  \n3. queries a variety of fstopper's community photograph libraries, depending on the category chosen by the user  \n4. downloads a never-before-used image and sets it as your wallpaper  \n5. logs the new wallpaper in the database", "sortedWord": "None", "Identifyer": null, "identifyer": 14328, "year": "2021"}, {"autor": "abolishthedea", "date": "2021-06-24 02:47:30", "content": "If UnSplash is 'free', why is CafePress blocking the products I create with it? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/o6rynh/if_unsplash_is_free_why_is_cafepress_blocking_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "if unsplash is 'free', why is cafepress blocking the products -----> i !!!  -----> create !!!  with it? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 14483, "year": "2021"}, {"autor": "RandomName315", "date": "2021-07-05 11:33:36", "content": "Curate/review albums: Exchange help in private /!/ Hello all,\n\nI would like to propose an exchange to fellow amateur photographers:\nI can review (in private, via a mail or a protected album online) albums or photo sets, with my opinions on what I like, what I don't like, what could be done differently, as well help to rate picture and identity keepers. In return, I would like to the person to do the same thing for me for an album of similar size (already filtered for evident flukes, of course:-))\n\nI propose you to comment in this thread with for example:\n\"\nI can review around 50 photos this week\nStyles: Street, portrait, anything\nContact: Reddit DM\n\"\nPeople will be able to contact you directly to exchange the albums.\n\nOnce you have found your fellow reviewer, you can just edit your post to remove it.\n\nWhat do you think of this?\n\n[Longer explanation of why I would like to do it. Feel free to skip :-)]\n\nAs a photographer:\nI cannot see my own pictures with an objective eye: I'm influenced by what I felt that day/that moment, what I intended to create, my current objectives/tastes/influences. I'm often too critical of my pictures, but sometimes proud/happy of pictures not really worth it. A fresh pair of eyes are often needed to judge a photograph.\n\nWhen exposing my pictures to a public critique (for instance on r/photocritique), I need to select only one or two, falling into the same problem as before. \n\nWhen putting photos out, they are judged in isolation compared to the whole world of photography, while I would like to know which are better pictures out of those I have taken (even if they might not be too good in absolute)\n\nThere are pictures of people I would like to have reviewed, but I do not want to post them out on the public internet for all to see.\n\nPublic reviews are often not critical enough, for the sake of public politeness, even if I don't mind (I would like, actually) a hard critique.\n\nAs a reviewer,\nWhen looking at several photos of the same photographer, I can adapt my critique to his style and level.\nThe comment is not public, so I can be more straightforward and hard in my critique without feeling like a jerk. I can be more frank since the person asked explicitly for my opinion. I can be much less verbose and to the point in my comment.\n\nSo anyone find it a good idea?", "link": "https://www.reddit.com/r/photography/comments/oe5i6d/curatereview_albums_exchange_help_in_private/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i intended to create", "selectorShort": "create", "MarkedSent": "curate/review albums: exchange help in private /!/ hello all,\n\ni would like to propose an exchange to fellow amateur photographers:\ni can review (in private, via a mail or a protected album online) albums or photo sets, with my opinions on what i like, what i don't like, what could be done differently, as well help to rate picture and identity keepers. in return, i would like to the person to do the same thing for me for an album of similar size (already filtered for evident flukes, of course:-))\n\ni propose you to comment in this thread with for example:\n\"\ni can review around 50 photos this week\nstyles: street, portrait, anything\ncontact: reddit dm\n\"\npeople will be able to contact you directly to exchange the albums.\n\nonce you have found your fellow reviewer, you can just edit your post to remove it.\n\nwhat do you think of this?\n\n[longer explanation of why i would like to do it. feel free -----> to !!!  skip :-)]\n\nas a photographer:\n-----> i !!!  cannot see my own pictures with an objective eye: -----> i !!! 'm influenced by what -----> i !!!  felt that day/that moment, what -----> i !!!  -----> intended !!!  -----> to !!!  -----> create !!! , my current objectives/tastes/influences. i'm often too critical of my pictures, but sometimes proud/happy of pictures not really worth it. a fresh pair of eyes are often needed to judge a photograph.\n\nwhen exposing my pictures to a public critique (for instance on r/photocritique), i need to select only one or two, falling into the same problem as before. \n\nwhen putting photos out, they are judged in isolation compared to the whole world of photography, while i would like to know which are better pictures out of those i have taken (even if they might not be too good in absolute)\n\nthere are pictures of people i would like to have reviewed, but i do not want to post them out on the public internet for all to see.\n\npublic reviews are often not critical enough, for the sake of public politeness, even if i don't mind (i would like, actually) a hard critique.\n\nas a reviewer,\nwhen looking at several photos of the same photographer, i can adapt my critique to his style and level.\nthe comment is not public, so i can be more straightforward and hard in my critique without feeling like a jerk. i can be more frank since the person asked explicitly for my opinion. i can be much less verbose and to the point in my comment.\n\nso anyone find it a good idea?", "sortedWord": "None", "Identifyer": null, "identifyer": 14813, "year": "2021"}, {"autor": "TSPF11", "date": "2021-06-26 13:06:44", "content": "How do I create photos similar to this? Or are they CGI? /!/ Hi,  \nGenuine question that is from someone purely curious (please go easy). How would one go about re-creating a photo with a similar quality as this? It's a strange question I know however my father is insistent that it is CGI however I believe it's just a heavily photoshopped photo. If it's the latter is anyone aware of any tutorials as we want a similar effect on something.\n\n[https://imgur.com/a/7RfcSy6](https://imgur.com/a/7RfcSy6)", "link": "https://www.reddit.com/r/photography/comments/o8afx3/how_do_i_create_photos_similar_to_this_or_are/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  photos similar to this? or are they cgi? /!/ hi,  \ngenuine question that is from someone purely curious (please go easy). how would one go about re-creating a photo with a similar quality as this? it's a strange question i know however my father is insistent that it is cgi however i believe it's just a heavily photoshopped photo. if it's the latter is anyone aware of any tutorials as we want a similar effect on something.\n\n[https://imgur.com/a/7rfcsy6](https://imgur.com/a/7rfcsy6)", "sortedWord": "None", "Identifyer": null, "identifyer": 15103, "year": "2021"}, {"autor": "possiblykal", "date": "2021-06-26 07:50:24", "content": "How do I grow my photography instagram page? /!/ Hey guys,\n\nOkay so I’m a fairly beginner photographer who has been playing around with photography for about a year now. I bought a DSLR camera a couple months back and been practicing on it.\n\nA couple weeks ago I finally created an instagram page solely for the purpose of posting my pictures. However I have no clue on how to grow my page and gain audience. \n\nI don’t want to promote my account on my main IG because I don’t want my family and friends to find out about this just yet and just want to do it on my own.\n\nAny advice?\n\nP.S i’m leaning more into street photography/ portrait photography", "link": "https://www.reddit.com/r/photography/comments/o86dfj/how_do_i_grow_my_photography_instagram_page/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i finally created", "selectorShort": "create", "MarkedSent": "how do i grow my photography instagram page? /!/ hey guys,\n\nokay so i’m a fairly beginner photographer who has been playing around with photography for about a year now. i bought a dslr camera a couple months back and been practicing on it.\n\na couple weeks ago -----> i !!!  -----> finally !!!  -----> created !!!  an instagram page solely for the purpose of posting my pictures. however i have no clue on how to grow my page and gain audience. \n\ni don’t want to promote my account on my main ig because i don’t want my family and friends to find out about this just yet and just want to do it on my own.\n\nany advice?\n\np.s i’m leaning more into street photography/ portrait photography", "sortedWord": "None", "Identifyer": null, "identifyer": 15116, "year": "2021"}, {"autor": "paxcou", "date": "2021-06-20 19:33:24", "content": "Application for class photos /!/ School principal, i am getting ready for next school year. Usually we have to wait few months before getting the students photo in our database. I would like to be able to do that myself quicker so i can create Clara lists with photos and name for my teachers.\n\nI am trying to find a way to take the picture from my computer (i have the Olympus EM1X so i can do this at least with the Olympus software so i can take the picture, rename it directly with the student name or visualizing the photo number to add it directly in z database so i can after one by one adding each student photo to the correct student profile. \n\nDo you know what software i could use to help me with this process ?", "link": "https://www.reddit.com/r/photography/comments/o4d5q6/application_for_class_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "application for class photos /!/ school principal, i am getting ready for next school year. usually we have to wait few months before getting the students photo in our database. i would like to be able to do that myself quicker so -----> i !!!  -----> can !!!  -----> create !!!  clara lists with photos and name for my teachers.\n\ni am trying to find a way to take the picture from my computer (i have the olympus em1x so i can do this at least with the olympus software so i can take the picture, rename it directly with the student name or visualizing the photo number to add it directly in z database so i can after one by one adding each student photo to the correct student profile. \n\ndo you know what software i could use to help me with this process ?", "sortedWord": "None", "Identifyer": null, "identifyer": 15235, "year": "2021"}, {"autor": "stratodude", "date": "2021-07-20 15:12:41", "content": "I had my first photoshoot last night and I'm absolutely ecstatic. /!/ I've been a \"hobby\" photographer for years, but never took it seriously. But when I found myself chatting more with the photographers at my wedding than I was with my guests, I decided maybe it would be time to look into it a little further. I upgraded from a Sony A6000 to a A6500, and invested a little money in some prime lenses (a 35mm and a 50mm to start) and started reading more on photo composition and lighting techniques. I had posted on my local Facebook groups that I was offering free photo shoots to build my portfolio and last night I had my first one.   \n\n\nI was super nervous at first, but this couple wanted photos of their dogs taken on the beach so it wasn't like I was really \"directing\" anyone to pose, but trying to run around and take halfway decent photos of dogs that just wanted to play was a bit... awkward. I snapped around 100 photos, and 70 of them were passable. The couple and their dogs left after I was done, and I hung around the beach for awhile waiting for golden hour as I wanted to try some landscape photos. A woman who had watched me taking photos of the dogs came up to me and asked if I was a photographer. I nervously said I was, but was just in the beginning stages and trying to put a portfolio together. She seemed excited, and had a chill vibe about her so I asked her if I could take a few portrait photos of her during golden hour and she agreed. I spent an hour taking photos of her, neither one of use knew each other but it just came so natural, I was having fun directing her on how to pose against the sunlight and playing with my camera, figuring out how to make the lighting work with her skin/hair tone to get the best photos. I truly learned what a 50mm could do for portraits and I was in love with my camera and lens setup.  \nWe exchanged info and went on our separate ways, I was on a high like I couldn't believe. I went home and edited all the photos of the dogs and her in lightroom, and was amazed at how the photos came out.   \n\n\nIs this what it feels like to be a photographer? Does anyone else experience a \"high\" from this type of thing? I'm naturally a creative person but never felt this good while I was creating art before.", "link": "https://www.reddit.com/r/photography/comments/oo3z7m/i_had_my_first_photoshoot_last_night_and_im/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "i had my first photoshoot last night and i'm absolutely ecstatic. /!/ i've been a \"hobby\" photographer for years, but never took it seriously. but when i found myself chatting more with the photographers at my wedding than i was with my guests, i decided maybe it would be time to look into it a little further. i upgraded from a sony a6000 to a a6500, and invested a little money in some prime lenses (a 35mm and a 50mm to start) and started reading more on photo composition and lighting techniques. i had posted on my local facebook groups that i was offering free photo shoots to build my portfolio and last night i had my first one.   \n\n\ni was super nervous at first, but this couple wanted photos of their dogs taken on the beach so it wasn't like i was really \"directing\" anyone to pose, but trying to run around and take halfway decent photos of dogs that just wanted to play was a bit... awkward. i snapped around 100 photos, and 70 of them were passable. the couple and their dogs left after i was done, and i hung around the beach for awhile waiting for golden hour as i wanted to try some landscape photos. a woman who had watched me taking photos of the dogs came up to me and asked if i was a photographer. i nervously said i was, but was just in the beginning stages and trying to put a portfolio together. she seemed excited, and had a chill vibe about her so i asked her if i could take a few portrait photos of her during golden hour and she agreed. i spent an hour taking photos of her, neither one of use knew each other but it just came so natural, i was having fun directing her on how to pose against the sunlight and playing with my camera, figuring out how to make the lighting work with her skin/hair tone to get the best photos. i truly learned what a 50mm could do for portraits and i was in love with my camera and lens setup.  \nwe exchanged info and went on our separate ways, i was on a high like i couldn't believe. i went home and edited all the photos of the dogs and her in lightroom, and was amazed at how the photos came out.   \n\n\nis this what it feels like to be a photographer? does anyone else experience a \"high\" from this type of thing? -----> i !!! 'm naturally a creative person but never felt this good while -----> i !!!  -----> was !!!  -----> creating !!!  art before.", "sortedWord": "None", "Identifyer": null, "identifyer": 15547, "year": "2021"}, {"autor": "tenchi39", "date": "2021-08-08 10:12:28", "content": "Dissatisfied with online galleries to display my photos, I created my own... /!/ I'm a noob in photography but created a few webapps before. Tried Single File PHP Gallery, but didn't like it and none of the alternatives were promising either.\n\nI created a really simple PHP based gallery that doesn't need a database to operate. No website for it yet, but it is available on Bitbucket and I put together a demo site here: https://photobook.randomblog.hu/\n\nAny input would be much appreciated...", "link": "https://www.reddit.com/r/photography/comments/p0c4r2/dissatisfied_with_online_galleries_to_display_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "dissatisfied with online galleries to display my photos, -----> i !!!  -----> created !!!  my own... /!/ i'm a noob in photography but created a few webapps before. tried single file php gallery, but didn't like it and none of the alternatives were promising either.\n\ni created a really simple php based gallery that doesn't need a database to operate. no website for it yet, but it is available on bitbucket and i put together a demo site here: https://photobook.randomblog.hu/\n\nany input would be much appreciated...", "sortedWord": "None", "Identifyer": null, "identifyer": 16102, "year": "2021"}, {"autor": "BBQPHOENIX", "date": "2021-09-10 22:18:59", "content": "Creating an HDR and long exposure photograph /!/ I captured a flowing river using exposure bracketing. Now I want that HDR look with smooth flowing water. Do I just simply stack every photograph and apply mean on it? Suggestions needed.", "link": "https://www.reddit.com/r/photography/comments/plv05s/creating_an_hdr_and_long_exposure_photograph/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  an hdr and long exposure photograph /!/ i captured a flowing river using exposure bracketing. now i want that hdr look with smooth flowing water. do i just simply stack every photograph and apply mean on it? suggestions needed.", "sortedWord": "None", "Identifyer": null, "identifyer": 16457, "year": "2021"}, {"autor": "benevans_92", "date": "2021-09-10 20:42:47", "content": "Can someone help me create a filter similar to this on VSCO mobile app(picture for reference)", "link": "https://www.reddit.com/r/photography/comments/plt98b/can_someone_help_me_create_a_filter_similar_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "can someone help -----> me !!!  -----> create !!!  a filter similar to this on vsco mobile app(picture for reference)", "sortedWord": "None", "Identifyer": null, "identifyer": 16461, "year": "2021"}, {"autor": "Studentaccount2021", "date": "2021-09-08 20:28:40", "content": "How to best recreate lighting conditions in space /!/ Hey I have an art project that I need to create reference photos for. \n\nMy subject is supposed to be floating in deep space. \n\nThe location in space can be anywhere, so it doesn't have to directly mimic the Sun's position to us. \n\n&amp;#x200B;\n\nWhat is the best way to achieve a shot like this?        Should I attempt to replicate Sun light in a studio?   Or is it easier to just use natural Sun light?\n\nIdeally I want to eliminate all bounce light and sky light. Just the a star as a single source of light, is the goal.    So if I am using sunlight,   what would be the best way to eliminate all bounce light around a model?\n\n&amp;#x200B;\n\nUnder normal sunlit conditions......do you think ambient skylight, or surrounding bounce light....effect the quality of light very much, so much so that is would be inaccurate in space?    Or is sunlight powerful enough that its really all you pick up on camera, not the bounce light.", "link": "https://www.reddit.com/r/photography/comments/pkil8x/how_to_best_recreate_lighting_conditions_in_space/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "how to best recreate lighting conditions in space /!/ hey -----> i !!!  have an art project that -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  reference photos for. \n\nmy subject is supposed to be floating in deep space. \n\nthe location in space can be anywhere, so it doesn't have to directly mimic the sun's position to us. \n\n&amp;#x200b;\n\nwhat is the best way to achieve a shot like this?        should i attempt to replicate sun light in a studio?   or is it easier to just use natural sun light?\n\nideally i want to eliminate all bounce light and sky light. just the a star as a single source of light, is the goal.    so if i am using sunlight,   what would be the best way to eliminate all bounce light around a model?\n\n&amp;#x200b;\n\nunder normal sunlit conditions......do you think ambient skylight, or surrounding bounce light....effect the quality of light very much, so much so that is would be inaccurate in space?    or is sunlight powerful enough that its really all you pick up on camera, not the bounce light.", "sortedWord": "None", "Identifyer": null, "identifyer": 16512, "year": "2021"}, {"autor": "Morighant", "date": "2021-09-08 15:01:44", "content": "Guilty over not shooting for a while. /!/ I'm not sure if this is normal. This year I bought a new Nikon z6 ii. I only have done two shoots with it. The last being on memorial day. I shoot fashion and I had kinda an awful shoot that day and it absolutely killed my motivation. I think I produce generally good work, but when it comes to fashion, there's a lot of planning that goes into a singular shoot. Creating a moodboard, finding a model, planning the outfits, and sometimes driving across the state for a non paid shoot. So naturally, when something with so much planning turns awry, you can see it's a bit of a bummer.\n\nI've also recently gotten into drawing (which I am also feeling guilty I haven't drawn in a week -_- and am instead booting up rainbow 6..) and that has sucked up my time as well. I LOVE photography. But my genre is just so freaking intensive I can't seem to work up motivation to continue as of late.\n\nNow, I'm going to yosemite national park from Florida, so I'm hoping that will boost my creativity again. But I never do landscape or astro, so who knows. \n\nDoes anyone else struggle with motivation after a shitty shoot? :( \n\n(Also, I'm not a professional by any means but I've been shooting for like, 5 years at this point, so I'm not a beginner and I think most of my work is good. No idea why I'm suddenly hating on myself.)", "link": "https://www.reddit.com/r/photography/comments/pkc8gn/guilty_over_not_shooting_for_a_while/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "guilty over not shooting for a while. /!/ i'm not sure if this is normal. this year i bought a new nikon z6 ii. i only have done two shoots with it. the last being on memorial day. i shoot fashion and i had kinda an awful shoot that day and it absolutely killed my motivation. i think i produce generally good work, but when it comes to fashion, there's a lot of planning that goes into a singular shoot. -----> creating !!!  a moodboard, finding a model, planning the outfits, and sometimes driving across the state for a non paid shoot. so naturally, when something with so much planning turns awry, you can see it's a bit of a bummer.\n\ni've also recently gotten into drawing (which i am also feeling guilty i haven't drawn in a week -_- and am instead booting up rainbow 6..) and that has sucked up my time as well. i love photography. but my genre is just so freaking intensive i can't seem to work up motivation to continue as of late.\n\nnow, i'm going to yosemite national park from florida, so i'm hoping that will boost my creativity again. but i never do landscape or astro, so who knows. \n\ndoes anyone else struggle with motivation after a shitty shoot? :( \n\n(also, i'm not a professional by any means but i've been shooting for like, 5 years at this point, so i'm not a beginner and i think most of my work is good. no idea why i'm suddenly hating on myself.)", "sortedWord": "None", "Identifyer": null, "identifyer": 16530, "year": "2021"}, {"autor": "imperial_account_III", "date": "2021-09-08 12:14:49", "content": "What's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process? /!/ I'm relatively new to photography and quite recently bought my first real camera (a Fuji X-T30). My main purpose is documenting my hikes, which I used to do with my phone, but wanted an upgrade in image quality.\n\nWith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. I also feel like my methods aren't exactly efficient, but I'm not sure what exactly I could improve. So I'd like to collect your preferred processes and learn from them.\n\nFor the record, these are my old and current processes, respectively:\n\n**Old Process (Phone)**\n\n1. Let MS Onedrive back up the pictures from my phone.\n\n2. Create an album for that day/hike/event from the camera reel.\n\n3. Delete the bad or unsuitable pictures from the album.\n\n4. Download the album to my computer and back it up locally.\n\n**New Process**\n\n1. Insert SD Card into card reader on PC.\n\n2. Look through pictures, deleting bad ones and rating really good ones as 4/5 stars within Windows Explorer. See step 4 for relevance of the latter.\n\n3. Be annoyed with Windows 10 because Windows 7 was better and more convenient at literally everything. Be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. Sort by name, manually select the RAW files corresponding to the 4-5 star rated JPEGs, and send them over to a \"Source/RAW\" folder on the hard drive (No use in keeping the mediocre RAWs).\n\n5. Send the remaining JPEGs to the Source folder.\n\n6. At this point, I would use rawtherapee to create optimal PNGs from the RAW files, but I'm still learning how to make those not look shit, so instead at this point, I edit the JPEGs that could be good but need some adjustments.\n\n7. Create an Album folder for that Day/Hike/Event and copy (not move) all the pictures over.\n\n8. Delete the ones I don't want in the Album.\n\n9. Upload the album folder to Onedrive (web, not the windows folder. I hate how that one works) for backup / sharing among family and friends.\n\n10. Optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**Considerations**\n\nI'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. This is not an issue yet, but might become costly in the future.\n\nThe reason I do this is that I find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and I don't trust tags.\n\nWhen I say I don't trust tags, I mean I don't want to go through hours of effort tagging images by content only to find in ten years that my new operating system doesn't know what to do with the tags I created in Windows 10, for example. Themed folders full of copied files seem much more reliable.\n\nThe downside of copy pasting is that if I alter an image later on, be it in name or the image itself, I have to apply those changes everywhere else the image is saved as well.\n\nI think the biggest issue currently is how long steps 1-6 are taking me, and I'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\nI'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\nI've considered having Onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (I'd hate to have to reorganize tens of thousands of pictures the day I stop using Onedrive.)\n\n**What do you do yourself? And what would you change about my approach or recommend to aid me, considering my considerations?** \n\nThanks for your time and have a great day :)", "link": "https://www.reddit.com/r/photography/comments/pk9ah0/whats_your_preferred_import_rating_sorting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "what's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process? /!/ i'm relatively new to photography and quite recently bought my first real camera (a fuji x-t30). my main purpose is documenting my hikes, which i used to do with my phone, but wanted an upgrade in image quality.\n\nwith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. i also feel like my methods aren't exactly efficient, but i'm not sure what exactly i could improve. so i'd like to collect your preferred processes and learn from them.\n\nfor the record, these are my old and current processes, respectively:\n\n**old process (phone)**\n\n1. let ms onedrive back up the pictures from my phone.\n\n2. create an album for that day/hike/event from the camera reel.\n\n3. delete the bad or unsuitable pictures from the album.\n\n4. download the album to my computer and back it up locally.\n\n**new process**\n\n1. insert sd card into card reader on pc.\n\n2. look through pictures, deleting bad ones and rating really good ones as 4/5 stars within windows explorer. see step 4 for relevance of the latter.\n\n3. be annoyed with windows 10 because windows 7 was better and more convenient at literally everything. be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. sort by name, manually select the raw files corresponding to the 4-5 star rated jpegs, and send them over to a \"source/raw\" folder on the hard drive (no use in keeping the mediocre raws).\n\n5. send the remaining jpegs to the source folder.\n\n6. at this point, i would use rawtherapee to create optimal pngs from the raw files, but i'm still learning how to make those not look shit, so instead at this point, i edit the jpegs that could be good but need some adjustments.\n\n7. create an album folder for that day/hike/event and copy (not move) all the pictures over.\n\n8. delete the ones i don't want in the album.\n\n9. upload the album folder to onedrive (web, not the windows folder. i hate how that one works) for backup / sharing among family and friends.\n\n10. optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**considerations**\n\ni'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. this is not an issue yet, but might become costly in the future.\n\nthe reason i do this is that i find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and i don't trust tags.\n\nwhen -----> i !!!  say -----> i !!!  don't trust tags, -----> i !!!  mean -----> i !!!  don't want to go through hours of effort tagging images by content only to find in ten years that my new operating system doesn't know what to do with the tags -----> i !!!  -----> created !!!  in windows 10, for example. themed folders full of copied files seem much more reliable.\n\nthe downside of copy pasting is that if i alter an image later on, be it in name or the image itself, i have to apply those changes everywhere else the image is saved as well.\n\ni think the biggest issue currently is how long steps 1-6 are taking me, and i'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\ni'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\ni've considered having onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (i'd hate to have to reorganize tens of thousands of pictures the day i stop using onedrive.)\n\n**what do you do yourself? and what would you change about my approach or recommend to aid me, considering my considerations?** \n\nthanks for your time and have a great day :)", "sortedWord": "None", "Identifyer": null, "identifyer": 16545, "year": "2021"}, {"autor": "MillyPoolx", "date": "2021-09-19 16:37:28", "content": "I’m creating an Instagram account for my photography, can anybody help me come up with a username for it? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/prbdfe/im_creating_an_instagram_account_for_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m creating", "selectorShort": "create", "MarkedSent": "-----> i !!! ’m -----> creating !!!  an instagram account for my photography, can anybody help me come up with a username for it? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 16715, "year": "2021"}, {"autor": "nowseekingdiscomfort", "date": "2021-09-23 04:17:22", "content": "Artist Survey - Please Help Me Accomplish My Dream /!/ Hey there everyone! I'm working on a clothing brand that exists to empower artists of all mediums (INCLUDING PHOTOGRAPHY) so I created a [Survey](https://forms.gle/KFrbxtd5yCWA9LPy6) to understand how the rest of the world sees storytelling. Please take a few minutes to help me make this dream a reality!\n\nI really appreciate your help and support :)", "link": "https://www.reddit.com/r/photography/comments/ptndad/artist_survey_please_help_me_accomplish_my_dream/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "artist survey - please help me accomplish my dream /!/ hey there everyone! i'm working on a clothing brand that exists to empower artists of all mediums (including photography) so -----> i !!!  -----> created !!!  a [survey](https://forms.gle/kfrbxtd5ycwa9lpy6) to understand how the rest of the world sees storytelling. please take a few minutes to help me make this dream a reality!\n\ni really appreciate your help and support :)", "sortedWord": "None", "Identifyer": null, "identifyer": 16806, "year": "2021"}, {"autor": "Professional_Cut6556", "date": "2021-10-02 13:26:00", "content": "Created my First logo for my photography page, feedback is always appreciated!", "link": "https://www.reddit.com/r/photography/comments/pzv40b/created_my_first_logo_for_my_photography_page/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  my first logo for my photography page, feedback is always appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 16965, "year": "2021"}, {"autor": "qdonnoah", "date": "2021-10-09 08:07:06", "content": "I created this artwork for my debut EP based off of my inner feelings about life &amp; where I feel like I am in my life. I present to you, “Dead on Arrival”. ~ Donnoah.", "link": "https://www.reddit.com/r/photography/comments/q4gwi2/i_created_this_artwork_for_my_debut_ep_based_off/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  this artwork for my debut ep based off of my inner feelings about life &amp; where -----> i !!!  feel like -----> i !!!  am in my life. i present to you, “dead on arrival”. ~ donnoah.", "sortedWord": "None", "Identifyer": null, "identifyer": 17236, "year": "2021"}, {"autor": "Schuloch", "date": "2021-10-09 02:20:32", "content": "Do I need to name models in art photography book? /!/ I am creating a book using images I have taken over the past 5 years and am reaching out to models I would like to use to get their blessing on being in the book. Our previous agreements were that the shoots were for general marketing, ie. social media, websites, etc. legally I’m definitely ok to use the images, but I think it may be outside the wheelhouse of what some models may have thought their images would be used for, so I’m checking in with each one. Everyone has given me the thumbs up and is excited except for one model who wants to have their name listed in the book. I wasn’t planning on any models names being listed and am just curious what an industry standard might be.\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/q4ca66/do_i_need_to_name_models_in_art_photography_book/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "do i need to name models in art photography book? /!/ -----> i !!!  -----> am !!!  -----> creating !!!  a book using images -----> i !!!  have taken over the past 5 years and -----> am !!!  reaching out to models -----> i !!!  would like to use to get their blessing on being in the book. our previous agreements were that the shoots were for general marketing, ie. social media, websites, etc. legally i’m definitely ok to use the images, but i think it may be outside the wheelhouse of what some models may have thought their images would be used for, so i’m checking in with each one. everyone has given me the thumbs up and is excited except for one model who wants to have their name listed in the book. i wasn’t planning on any models names being listed and am just curious what an industry standard might be.\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 17254, "year": "2021"}, {"autor": "eugen_dus", "date": "2021-08-23 06:56:05", "content": "Creating a Name for my Photography Website. Long Surname /!/ Hey there,\n\nI want to create a Website for my Photography Portfolio. I am not sure about the domain name.\n\nNow I post mostly on IG. There my name is  eugen\\_dus  (Eugen my Name, DUS - Shortcut for Düsseldorf -my cite). I don\\`t like my instaname so much, but had no ideas when I started. I also want to travel and don\\`t want to be seen as a Düsseldorf only fotographer.\n\nMy Surename is : \" E I C H E L B E R G \", which is kind of long .\n\nWould you mind to reccoment me a good domain name for my Photography - ( I shoot mostly lifestyle, dreamy, sensual Vibe + Videos like Fashion Videos and a little bit of Landscape)", "link": "https://www.reddit.com/r/photography/comments/p9uefa/creating_a_name_for_my_photography_website_long/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a name for my photography website. long surname /!/ hey there,\n\ni want to create a website for my photography portfolio. i am not sure about the domain name.\n\nnow i post mostly on ig. there my name is  eugen\\_dus  (eugen my name, dus - shortcut for düsseldorf -my cite). i don\\`t like my instaname so much, but had no ideas when i started. i also want to travel and don\\`t want to be seen as a düsseldorf only fotographer.\n\nmy surename is : \" e i c h e l b e r g \", which is kind of long .\n\nwould you mind to reccoment me a good domain name for my photography - ( i shoot mostly lifestyle, dreamy, sensual vibe + videos like fashion videos and a little bit of landscape)", "sortedWord": "None", "Identifyer": null, "identifyer": 17398, "year": "2021"}, {"autor": "Mongostein", "date": "2021-08-17 02:02:39", "content": "How can I quickly and easily create a PDF document with thumbnails to send to clients? /!/ I just shot a small festival this past weekend. I ended up with about 500 shots of 11 bands and random festival shots. The promoter paid me a small amount to be there and the bands were aware I would be there, but weren't committed to paying me anything. \n\n&amp;#x200B;\n\nSo now I have the shots and I need to create PDFs of thumbnails with the photos of each band for them to look through. There's gotta be a way to automate this. I'm picturing a document with 6 thumbnails per page and the file name above or below each thumbnail. Then the bands respond to me with the ones they want and the pay me based on how many they want \\*before\\* I clean them up. \n\n&amp;#x200B;\n\nThere's potential to make a lot of money off this one day of shooting, but I dread having to import each photo, resize, and add the file name of 500 photos one by one. Help!", "link": "https://www.reddit.com/r/photography/comments/p5ug3s/how_can_i_quickly_and_easily_create_a_pdf/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "how can i quickly and easily create a pdf document with thumbnails to send to clients? /!/ i just shot a small festival this past weekend. i ended up with about 500 shots of 11 bands and random festival shots. the promoter paid me a small amount to be there and the bands were aware i would be there, but weren't committed to paying me anything. \n\n&amp;#x200b;\n\nso now -----> i !!!  have the shots and -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  pdfs of thumbnails with the photos of each band for them -----> to !!!  look through. there's gotta be a way to automate this. i'm picturing a document with 6 thumbnails per page and the file name above or below each thumbnail. then the bands respond to me with the ones they want and the pay me based on how many they want \\*before\\* i clean them up. \n\n&amp;#x200b;\n\nthere's potential to make a lot of money off this one day of shooting, but i dread having to import each photo, resize, and add the file name of 500 photos one by one. help!", "sortedWord": "None", "Identifyer": null, "identifyer": 17563, "year": "2021"}, {"autor": "Rechabneffo", "date": "2021-08-16 17:01:21", "content": "Landscape Photography via multiple image stitching /!/ At first I tried image stitching as a neat trick. Then I tried it to see how big of a final image I could create, and to work around the fact I only had a 50mm prime to shoot with.  Now I believe this is a legitimate standard way to approach landscape photography.  I often shoot with a lens that only covers 46 degrees field of view, shooting locked-off on a tripod panoramically with 1/3 frame overlap allows me to create images that are 110 degrees field of view.  Though I'm on a full frame DSLR, stitching multiple shots together allows me to get up to large format sized image results.  It has it's pitfalls, such as dealing with lens distortion on horizon lines or architectural lines, but I don't think I'll ever shoot single frame landscape on digital again, Adobe Lightroom's stitch algorithm is just too good at blending panorama shots together.  And by panorama I don't mean wide screen, my finished images are often 2x3 frame ratio.\n\nWhere do you stand on image stitching?", "link": "https://www.reddit.com/r/photography/comments/p5k871/landscape_photography_via_multiple_image_stitching/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "landscape photography via multiple image stitching /!/ at first i tried image stitching as a neat trick. then -----> i !!!  tried it to see how big of a final image -----> i !!!  -----> could !!!  -----> create !!! , and to work around the fact -----> i !!!  only had a 50mm prime to shoot with.  now i believe this is a legitimate standard way to approach landscape photography.  i often shoot with a lens that only covers 46 degrees field of view, shooting locked-off on a tripod panoramically with 1/3 frame overlap allows me to create images that are 110 degrees field of view.  though i'm on a full frame dslr, stitching multiple shots together allows me to get up to large format sized image results.  it has it's pitfalls, such as dealing with lens distortion on horizon lines or architectural lines, but i don't think i'll ever shoot single frame landscape on digital again, adobe lightroom's stitch algorithm is just too good at blending panorama shots together.  and by panorama i don't mean wide screen, my finished images are often 2x3 frame ratio.\n\nwhere do you stand on image stitching?", "sortedWord": "None", "Identifyer": null, "identifyer": 17599, "year": "2021"}, {"autor": "spro22", "date": "2021-10-17 02:32:27", "content": "Need help Creating contrast and shadows on flat samples from microscope. /!/ I'm doing research using images of rocks, but my imaging skills are weak. \n\nI need to create a shadow or a contrast of some kind to make the edges of each shape very clear, even though it's pretty flat samples. \n\nNotice my typical image in white light above the sample has little definition / contrast so my algorithm can't read the edges of each shape. \n\n&amp;#x200B;\n\nDo I need to simply mount a light at a low angle on the side to create shadows? Or are there special cameras to also mount on the side? My micro camera can adjust gamma, monochrome, negative, and horizontal / vertical mirror. I don't know if these features would bring out the tiny edges of each shape or if I need to completely change my setup. \n\nDo I need a coaxial light? Mount a light on the side? Mount another camera on the side? \n\nI'm hoping someone here has familiarity with shadows on flat-ish samples. thanks", "link": "https://www.reddit.com/r/photography/comments/q9pzx9/need_help_creating_contrast_and_shadows_on_flat/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "need help creating contrast and shadows on flat samples from microscope. /!/ i'm doing research using images of rocks, but my imaging skills are weak. \n\n-----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a shadow or a contrast of some kind -----> to !!!  make the edges of each shape very clear, even though it's pretty flat samples. \n\nnotice my typical image in white light above the sample has little definition / contrast so my algorithm can't read the edges of each shape. \n\n&amp;#x200b;\n\ndo i need to simply mount a light at a low angle on the side to create shadows? or are there special cameras to also mount on the side? my micro camera can adjust gamma, monochrome, negative, and horizontal / vertical mirror. i don't know if these features would bring out the tiny edges of each shape or if i need to completely change my setup. \n\ndo i need a coaxial light? mount a light on the side? mount another camera on the side? \n\ni'm hoping someone here has familiarity with shadows on flat-ish samples. thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 17729, "year": "2021"}, {"autor": "photo-to-text", "date": "2021-10-23 10:41:23", "content": "Create A Personalised Birthday Gift For Loved One With Images Made From Text /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/qe2ian/create_a_personalised_birthday_gift_for_loved_one/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  a personalised birthday gift for loved one with images made from text /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 18126, "year": "2021"}, {"autor": "eugemalattini", "date": "2021-01-08 02:36:53", "content": "I like to create little storys with pictures edited like this, like frames on a movie it leads me to write", "link": "https://www.reddit.com/r/photography/comments/kst6qx/i_like_to_create_little_storys_with_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i like to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> like !!!  -----> to !!!  -----> create !!!  little storys with pictures edited -----> like !!!  this, -----> like !!!  frames on a movie it leads me -----> to !!!  write", "sortedWord": "None", "Identifyer": null, "identifyer": 18260, "year": "2021"}, {"autor": "eugemalattini", "date": "2021-01-08 01:31:36", "content": "I like to create little storys with pictures edited like this, like frames on a movie it leads me to write", "link": "https://www.reddit.com/r/photography/comments/kss0uv/i_like_to_create_little_storys_with_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i like to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> like !!!  -----> to !!!  -----> create !!!  little storys with pictures edited -----> like !!!  this, -----> like !!!  frames on a movie it leads me -----> to !!!  write", "sortedWord": "None", "Identifyer": null, "identifyer": 18264, "year": "2021"}, {"autor": "[deleted]", "date": "2021-01-08 01:13:31", "content": "I lile to create a story with frames /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/ksropp/i_lile_to_create_a_story_with_frames/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i lile to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> lile !!!  -----> to !!!  -----> create !!!  a story with frames /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 18266, "year": "2021"}, {"autor": "nshoots01", "date": "2021-10-26 04:03:51", "content": "social media ruins a photographers creativity. /!/ One of the things that I hate about social media is that you sort of get categorized into a singe niche. For example, I enjoy landscape photography therefore most people expect me to ONLY create photographs relating to that. But if I one day decide to share a photograph of food or even just a coffee mug, people won’t like it. And if your a photographer who does all sorts of genres, your sort of viewed as a jack of all trades and a master at none. I feel like we are sort of being bound to a single genre and we aren’t allowed to explore other areas of photography.", "link": "https://www.reddit.com/r/photography/comments/qfy76f/social_media_ruins_a_photographers_creativity/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to only create", "selectorShort": "create", "MarkedSent": "social media ruins a photographers creativity. /!/ one of the things that i hate about social media is that you sort of get categorized into a singe niche. for example, i enjoy landscape photography therefore most people expect -----> me !!!  -----> to !!!  -----> only !!!  -----> create !!!  photographs relating -----> to !!!  that. but if i one day decide to share a photograph of food or even just a coffee mug, people won’t like it. and if your a photographer who does all sorts of genres, your sort of viewed as a jack of all trades and a master at none. i feel like we are sort of being bound to a single genre and we aren’t allowed to explore other areas of photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 18333, "year": "2021"}, {"autor": "SubieSage", "date": "2021-01-18 17:34:05", "content": "Tips for beginners /!/ I just bought a Canon Rebel t6 and I was going to let you guys have a field day with random photography tips for an absolute beginner, whether it be tips for using the rebel, lighting, editing software, or anything else. Thanks in advance and I’m excited to show you guys what I can create!", "link": "https://www.reddit.com/r/photography/comments/kzzblh/tips_for_beginners/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "tips for beginners /!/ i just bought a canon rebel t6 and i was going to let you guys have a field day with random photography tips for an absolute beginner, whether it be tips for using the rebel, lighting, editing software, or anything else. thanks in advance and -----> i !!! ’m excited to show you guys what -----> i !!!  -----> can !!!  -----> create !!! !", "sortedWord": "None", "Identifyer": null, "identifyer": 18446, "year": "2021"}, {"autor": "Ckmyers", "date": "2021-07-05 04:02:11", "content": "Now that Instagram has effectively killed photography, where will you go next? /!/ Latest from instagram is that they're moving to totally focus on video content. Perfect, since I'm finally starting to love my feed and the content I'm creating. Now my question is, where will the photography community go to post its photos or do we all just turn the dial to video and never look back? Perhaps some of you have found a genius way to show stills in the reels feed?", "link": "https://www.reddit.com/r/photography/comments/odzcr0/now_that_instagram_has_effectively_killed/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "now that instagram has effectively killed photography, where will you go next? /!/ latest from instagram is that they're moving to totally focus on video content. perfect, since -----> i !!! 'm finally starting to love my feed and the content -----> i !!! 'm -----> creating !!! . now my question is, where will the photography community go to post its photos or do we all just turn the dial to video and never look back? perhaps some of you have found a genius way to show stills in the reels feed?", "sortedWord": "None", "Identifyer": null, "identifyer": 18718, "year": "2021"}, {"autor": "cinnamonmarigold", "date": "2021-08-10 21:21:25", "content": "Those with businesses: how did you decide on a name? Do you regret your brand? How important has it been for you? /!/ I’m trying to create a new “business” of engagement photos, mini sessions, etc. w/o my former partner, and I’m second-guessing my name.\n\nThe working title is “Stingray Photography.” It’s childish, but I think it’s more memorable than just like “First Name Last Name Photography” (my name is not terribly memorable or easy to spell lol). \n\nHappy to hear any and all thoughts!", "link": "https://www.reddit.com/r/photography/comments/p1ylyz/those_with_businesses_how_did_you_decide_on_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to create", "selectorShort": "create", "MarkedSent": "those with businesses: how did you decide on a name? do you regret your brand? how important has it been for you? /!/ -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> create !!!  a new “business” of engagement photos, mini sessions, etc. w/o my former partner, and i’m second-guessing my name.\n\nthe working title is “stingray photography.” it’s childish, but i think it’s more memorable than just like “first name last name photography” (my name is not terribly memorable or easy to spell lol). \n\nhappy to hear any and all thoughts!", "sortedWord": "None", "Identifyer": null, "identifyer": 18853, "year": "2021"}], "name": "createphotography2021"}