{"interestingcomments": [{"autor": "BigRedHair92", "date": "2019-05-26 04:58:29", "content": "Graphic for Watermark /!/ I want to switch from the text that I currently use to a graphic that I design for my watermark. I more or less know what I want to do, but I'm not sure where to go to make it. What sites/resources do you use to make these? I have Lightroom but not Photoshop.", "link": "https://www.reddit.com/r/photography/comments/bt44ct/graphic_for_watermark/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "graphic for watermark /!/ -----> i !!!  want to switch from the text that -----> i !!!  currently use to a graphic that -----> i !!!  -----> design !!!  for my watermark. i more or less know what i want to do, but i'm not sure where to go to make it. what sites/resources do you use to make these? i have lightroom but not photoshop.", "sortedWord": "None", "Identifyer": null, "identifyer": 5500, "year": "2019"}, {"autor": "thesunartworks", "date": "2019-06-13 06:06:13", "content": "Its My Blog….So its ME Time now… MY HOBBIES /!/ My hobby is\n\n**cooking**\n=======\n\n**drawing**\n=======\n\n**listening music**\n===============\n\n_However I always prefer Drawing._\n\nEvery one of us has some kind of liking/ disliking for certain things in life. Similarly I love drawing because drawing do not cost much and is always fun. I cannot imagine a colorful life without drawing. My greatest inspiration is my sister who always encourages me to design her dresses. It is my believe that to display your art you do not have to be a great artist.\n\nYou just have to make a unique piece. So get your paint brush and pencil and start drawing.When I am blue I cheer myself up by drawing something so that I can make myself happy. Drawing is a way for me to show my creativity. However drawing is not as easy as it seems to be. It needs a lot of devotion as well as practice. I can never feel bored when I have my colors with me. My colors are my best friend.\n\nI like drawing since I was 6 years old. I like to make unrealistic things look realistic through drawing. Drawing is the perfect way to make things look alive. I imagine all kinds of strange things to show it on a piece of paper such as hell &amp; demons, a beautiful house in heaven etc.I have decorated my house with lot of my drawings. Drawing has now become the most important part of my life. But most of the times I am unable to take out much time due to my studies and social life. But still I manage to take out sometime and practice to improve my drawing.  My leisure hours are always occupied to my drawing paper, pen and brush.\n\nThe strangest thing about my hobby is that nobody taught me how to paint. Even when I was in school drawing was not my subject. I learnt it by myself and later got inspiration by my parents. I learnt few concepts through text book containing different types of sketches. I have always intimated everything from those books such as rivers, hills, trees, human faces, clouds and animals. With days my drawing improved step by steps &amp; is still improving. I constantly make efforts to retain my hobby.\n\nOther than drawing, I like reading whether it is newspaper, news, novels, G K book or any knowledgeable book written by any good author. I always read story books, newspaper, magazines, and any other material that I find interesting in my free time. This hobby of reading books of mine was first noticed by my father and he motivated me by saying that it is a very good habit given to you naturally, never let this habit off and keep it in practice.\n\n \n\n   \n   \n from WordPress http://bit.ly/2WGWlx7", "link": "https://www.reddit.com/r/photography/comments/c025hb/its_my_blogso_its_me_time_now_my_hobbies/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "its my blog….so its me time now… my hobbies /!/ my hobby is\n\n**cooking**\n=======\n\n**drawing**\n=======\n\n**listening music**\n===============\n\n_however i always prefer drawing._\n\nevery one of us has some kind of liking/ disliking for certain things in life. similarly i love drawing because drawing do not cost much and is always fun. i cannot imagine a colorful life without drawing. my greatest inspiration is my sister who always encourages -----> me !!!  -----> to !!!  -----> design !!!  her dresses. it is my believe that to display your art you do not have to be a great artist.\n\nyou just have to make a unique piece. so get your paint brush and pencil and start drawing.when i am blue i cheer myself up by drawing something so that i can make myself happy. drawing is a way for me to show my creativity. however drawing is not as easy as it seems to be. it needs a lot of devotion as well as practice. i can never feel bored when i have my colors with me. my colors are my best friend.\n\ni like drawing since i was 6 years old. i like to make unrealistic things look realistic through drawing. drawing is the perfect way to make things look alive. i imagine all kinds of strange things to show it on a piece of paper such as hell &amp; demons, a beautiful house in heaven etc.i have decorated my house with lot of my drawings. drawing has now become the most important part of my life. but most of the times i am unable to take out much time due to my studies and social life. but still i manage to take out sometime and practice to improve my drawing.  my leisure hours are always occupied to my drawing paper, pen and brush.\n\nthe strangest thing about my hobby is that nobody taught me how to paint. even when i was in school drawing was not my subject. i learnt it by myself and later got inspiration by my parents. i learnt few concepts through text book containing different types of sketches. i have always intimated everything from those books such as rivers, hills, trees, human faces, clouds and animals. with days my drawing improved step by steps &amp; is still improving. i constantly make efforts to retain my hobby.\n\nother than drawing, i like reading whether it is newspaper, news, novels, g k book or any knowledgeable book written by any good author. i always read story books, newspaper, magazines, and any other material that i find interesting in my free time. this hobby of reading books of mine was first noticed by my father and he motivated me by saying that it is a very good habit given to you naturally, never let this habit off and keep it in practice.\n\n \n\n   \n   \n from wordpress http://bit.ly/2wgwlx7", "sortedWord": "None", "Identifyer": null, "identifyer": 5671, "year": "2019"}, {"autor": "avenoir_fl", "date": "2019-07-14 19:19:25", "content": "I’m looking for a photo to use as album art. /!/ Hi there Reddit, \n\nI’m releasing a song tomorrow and I am having a hard time deciding what to use for album artwork. I typically design my own album artwork in photoshop and illustrator but because it’s just a single I don’t want to use the album art I already designed.\n\nThis is a non commercial release. I’m giving the song away for free. If anyone has a photo that they wouldn’t mind allowing me to use I would greatly appreciate it. I wouldn’t edit the photo at all except to add the artist name and song name on plain text. \n\nI’m open to any ideas for photos and can send a copy of the song to anyone who wants to hear it first. I will credit the photographer in whatever way they see fit. The song is being released tomorrow. I am aware I am a slacker.", "link": "https://www.reddit.com/r/photography/comments/cd6z1o/im_looking_for_a_photo_to_use_as_album_art/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i typically design", "selectorShort": "design", "MarkedSent": "i’m looking for a photo to use as album art. /!/ hi there reddit, \n\ni’m releasing a song tomorrow and i am having a hard time deciding what to use for album artwork. -----> i !!!  -----> typically !!!  -----> design !!!  my own album artwork in photoshop and illustrator but because it’s just a single -----> i !!!  don’t want to use the album art -----> i !!!  already designed.\n\nthis is a non commercial release. i’m giving the song away for free. if anyone has a photo that they wouldn’t mind allowing me to use i would greatly appreciate it. i wouldn’t edit the photo at all except to add the artist name and song name on plain text. \n\ni’m open to any ideas for photos and can send a copy of the song to anyone who wants to hear it first. i will credit the photographer in whatever way they see fit. the song is being released tomorrow. i am aware i am a slacker.", "sortedWord": "None", "Identifyer": null, "identifyer": 6296, "year": "2019"}, {"autor": "Stompya", "date": "2019-10-03 18:22:36", "content": "Can I convince my Canon camera to play back an edited image? /!/ *The goal:* I want to have a custom viewfinder mask applied to my viewscreen (Canon EOS RP).\n\n*The plan:* I designed the mask in Photoshop, and if I can make it appear on the viewscreen then I would use it as a guide to draw the lines on a clear screen protector.\n\n*The problem:* when I put the template image on a camera card, the camera says it \"Can not play back image\".\n\n*Failed attempts* (things I have tried):\n*Different camera cards \n*using exact same image dimensions\n*using the same naming format (i.e. IMG_0123.JPG)\n*.JPG vs .jpg\n*exporting as 'standard', 'optimized', and 'progressive'\n*cursing under my breath\n\nSo far, no luck.  Has anyone had success with this and can anyone lend insight into how/why my camera is 'detecting' photos it didn't capture and then refusing to show them?  (Seems a bit snobby, tbh.)", "link": "https://www.reddit.com/r/photography/comments/dcuv50/can_i_convince_my_canon_camera_to_play_back_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "can i convince my canon camera to play back an edited image? /!/ *the goal:* i want to have a custom viewfinder mask applied to my viewscreen (canon eos rp).\n\n*the plan:* -----> i !!!  -----> designed !!!  the mask in photoshop, and if -----> i !!!  can make it appear on the viewscreen then -----> i !!!  would use it as a guide to draw the lines on a clear screen protector.\n\n*the problem:* when i put the template image on a camera card, the camera says it \"can not play back image\".\n\n*failed attempts* (things i have tried):\n*different camera cards \n*using exact same image dimensions\n*using the same naming format (i.e. img_0123.jpg)\n*.jpg vs .jpg\n*exporting as 'standard', 'optimized', and 'progressive'\n*cursing under my breath\n\nso far, no luck.  has anyone had success with this and can anyone lend insight into how/why my camera is 'detecting' photos it didn't capture and then refusing to show them?  (seems a bit snobby, tbh.)", "sortedWord": "None", "Identifyer": null, "identifyer": 6687, "year": "2019"}, {"autor": "notanexus6", "date": "2019-12-23 16:22:10", "content": "Have you ever had security called on you? /!/ I’m not sure if this is the right place, but I was just taking photographs at a museum that I helped design at a previous job. \n\nI was in town and decided to stop by and take some photographs and had some woman who worked there cause a scene and call security on me. \n\nHas this happened to anyone before?", "link": "https://www.reddit.com/r/photography/comments/eemo8u/have_you_ever_had_security_called_on_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i helped design", "selectorShort": "design", "MarkedSent": "have you ever had security called on you? /!/ -----> i !!! ’m not sure if this is the right place, but -----> i !!!  was just taking photographs at a museum that -----> i !!!  -----> helped !!!  -----> design !!!  at a previous job. \n\ni was in town and decided to stop by and take some photographs and had some woman who worked there cause a scene and call security on me. \n\nhas this happened to anyone before?", "sortedWord": "None", "Identifyer": null, "identifyer": 8072, "year": "2019"}, {"autor": "baronsindo", "date": "2019-12-15 23:20:01", "content": "Power Your Dreams with Xbox Series X, Available Holiday 2020 /!/ **_Xbox Game Studios unveils Senua’s Saga: Hellblade II, a new chapter in the award-winning Hellblade story from Ninja Theory_**\n\nFor eighteen years and three console generations, the Xbox community has shown us the power both games and fun can have on all of us. As we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. With the new Xbox Series X, we will realize that vision. \n\nXbox Series X will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. Its industrial design enables us to deliver four times the processing power of Xbox One X in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. We also designed Xbox Series X to support both vertical and horizontal orientation. It’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nThe name Xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at Microsoft. It also signifies our belief that a gaming console should be for just that – gaming.\n\nAlongside Xbox Series X, we also unveiled the new Xbox Wireless Controller. Its size and shape have been refined to accommodate an even wider range of people, and it also features a new Share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the Xbox Elite Wireless Controller Series 2. The new Xbox Wireless Controller will be compatible with Xbox One and Windows 10 PCs, and will be included with every Xbox Series X.\n\nThe possibilities of what Xbox Series X enables developers to achieve was also brought to life this evening with the unveiling of _Senua’s Saga: Hellblade II_. A sequel to the award-winning _Hellblade: Senua’s Sacrifice_ from world-renowned developers Ninja Theory, the game is being built to leverage the full power of Xbox Series X.  The footage shared tonight was captured in-engine and reflects the power of Xbox Series X available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **Bringing Developers’ Dreams to Life with Xbox Series X**\n\nGames today deliver amazing visuals and tell an array of different and deep stories.  That’s why, when we started work on Xbox Series X, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. With Xbox Series X, we will elevate the way games look, play and feel. We will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nFrom a technical standpoint, this will manifest as world-class visuals in 4K at 60FPS, with the possibility of up to 120FPS, including support for Variable Refresh Rate (VRR), and 8K capability. Powered by our custom-designed processor leveraging the latest Zen 2 and next-generation RDNA architecture from our partners at AMD, Xbox Series X will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  Additionally, our patented Variable Rate Shading (VRS) technology will allow developers to get even more out of the Xbox Series X GPU and our next-generation SSD will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nWe are minimizing latency by leveraging technology such as Auto Low Latency Mode (ALLM) and giving developers new functionality like Dynamic Latency Input (DLI) to make Xbox Series X the most responsive console ever.  Xbox Series X is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. Xbox Series X will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **One Console, Four Generations of Gaming**\n\nOne of the things we’re most proud of with Xbox Series X is the promise we’re delivering to our fans who have and continue to invest with Xbox. Thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your Xbox One gaming accessories, and industry-leading services like Xbox Game Pass to be available when you power on your Xbox Series X in Holiday 2020.\n\nBuilding on our compatibility promise, with Xbox Series X we’re also investing in consumer-friendly pathways to game ownership across generations. Leading the way with our first-party titles including _Halo Infinite_ in 2020, we’re committed to ensuring that games from Xbox Game Studios support cross-generation entitlements and that your Achievements and game saves are shared across devices.  As we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our Xbox offering.  Game creators around the globe are already hard at work building content for Xbox Series X and our 15 Xbox Game Studios are developing the largest and most creatively diverse lineup of Xbox exclusive games in our history. On behalf of Team Xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nThe post [Power Your Dreams with Xbox Series X, Available Holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [Bulky Face](https://www.bulkyface.com).\n\n   \n   \n from WordPress https://ift.tt/2PLIyiN", "link": "https://www.reddit.com/r/photography/comments/eb6gs8/power_your_dreams_with_xbox_series_x_available/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we also designed", "selectorShort": "design", "MarkedSent": "power your dreams with xbox series x, available holiday 2020 /!/ **_xbox game studios unveils senua’s saga: hellblade ii, a new chapter in the award-winning hellblade story from ninja theory_**\n\nfor eighteen years and three console generations, the xbox community has shown us the power both games and fun can have on all of us. as we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. with the new xbox series x, we will realize that vision. \n\nxbox series x will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. its industrial design enables us to deliver four times the processing power of xbox one x in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. -----> we !!!  -----> also !!!  -----> designed !!!  xbox series x to support both vertical and horizontal orientation. it’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nthe name xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at microsoft. it also signifies our belief that a gaming console should be for just that – gaming.\n\nalongside xbox series x, we also unveiled the new xbox wireless controller. its size and shape have been refined to accommodate an even wider range of people, and it also features a new share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the xbox elite wireless controller series 2. the new xbox wireless controller will be compatible with xbox one and windows 10 pcs, and will be included with every xbox series x.\n\nthe possibilities of what xbox series x enables developers to achieve was also brought to life this evening with the unveiling of _senua’s saga: hellblade ii_. a sequel to the award-winning _hellblade: senua’s sacrifice_ from world-renowned developers ninja theory, the game is being built to leverage the full power of xbox series x.  the footage shared tonight was captured in-engine and reflects the power of xbox series x available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **bringing developers’ dreams to life with xbox series x**\n\ngames today deliver amazing visuals and tell an array of different and deep stories.  that’s why, when we started work on xbox series x, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. with xbox series x, we will elevate the way games look, play and feel. we will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nfrom a technical standpoint, this will manifest as world-class visuals in 4k at 60fps, with the possibility of up to 120fps, including support for variable refresh rate (vrr), and 8k capability. powered by our custom-designed processor leveraging the latest zen 2 and next-generation rdna architecture from our partners at amd, xbox series x will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  additionally, our patented variable rate shading (vrs) technology will allow developers to get even more out of the xbox series x gpu and our next-generation ssd will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nwe are minimizing latency by leveraging technology such as auto low latency mode (allm) and giving developers new functionality like dynamic latency input (dli) to make xbox series x the most responsive console ever.  xbox series x is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. xbox series x will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **one console, four generations of gaming**\n\none of the things we’re most proud of with xbox series x is the promise we’re delivering to our fans who have and continue to invest with xbox. thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your xbox one gaming accessories, and industry-leading services like xbox game pass to be available when you power on your xbox series x in holiday 2020.\n\nbuilding on our compatibility promise, with xbox series x we’re also investing in consumer-friendly pathways to game ownership across generations. leading the way with our first-party titles including _halo infinite_ in 2020, we’re committed to ensuring that games from xbox game studios support cross-generation entitlements and that your achievements and game saves are shared across devices.  as we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our xbox offering.  game creators around the globe are already hard at work building content for xbox series x and our 15 xbox game studios are developing the largest and most creatively diverse lineup of xbox exclusive games in our history. on behalf of team xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nthe post [power your dreams with xbox series x, available holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [bulky face](https://www.bulkyface.com).\n\n   \n   \n from wordpress https://ift.tt/2pliyin", "sortedWord": "None", "Identifyer": null, "identifyer": 8224, "year": "2019"}, {"autor": "thenickdude", "date": "2019-08-06 11:18:30", "content": "I designed and 3D-printed a massive 300mm Canon extension tube for super-macro at 5x magnification, it even has autofocus! /!/ For the past month I've been working on creating a stupid-long 300mm 3D-printed extension tube so that I could push my macro lens all the way to 5x magnification, and it's finally done!\n\nSince Canon cameras controls their lens aperture electronically, and stopping down the aperture is pretty much a requirement for getting any depth of field in macro, I had to create a lens contact system using gold contacts, a ribbon cable, and pogo pins. It even supports autofocus!\n\nYou can see the extension tube and a couple of photos I shot with it here:\n\nhttps://imgur.com/a/r7kHDC2\n\nI've posted the 3D-printable models and full build instructions on my Thingiverse page here:\n\nhttps://www.thingiverse.com/thing:3761957\n\nThingiverse's server is really struggling right now, so if that doesn't load I've posted a mirror of it here too:\n\nhttps://sherlock-photography.github.io/canon-extension-tube/\n\nThe tube was printed in black PETG filament on my Prusa i3 MK3S.", "link": "https://www.reddit.com/r/photography/comments/cmpa2z/i_designed_and_3dprinted_a_massive_300mm_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed a massive 300mm canon extension tube for super-macro at 5x magnification, it even has autofocus! /!/ for the past month i've been working on creating a stupid-long 300mm 3d-printed extension tube so that i could push my macro lens all the way to 5x magnification, and it's finally done!\n\nsince canon cameras controls their lens aperture electronically, and stopping down the aperture is pretty much a requirement for getting any depth of field in macro, i had to create a lens contact system using gold contacts, a ribbon cable, and pogo pins. it even supports autofocus!\n\nyou can see the extension tube and a couple of photos i shot with it here:\n\nhttps://imgur.com/a/r7khdc2\n\ni've posted the 3d-printable models and full build instructions on my thingiverse page here:\n\nhttps://www.thingiverse.com/thing:3761957\n\nthingiverse's server is really struggling right now, so if that doesn't load i've posted a mirror of it here too:\n\nhttps://sherlock-photography.github.io/canon-extension-tube/\n\nthe tube was printed in black petg filament on my prusa i3 mk3s.", "sortedWord": "None", "Identifyer": null, "identifyer": 64833, "year": "2019"}, {"autor": "thenickdude", "date": "2019-08-06 11:12:42", "content": "I designed and 3D-printed a massive 300mm Canon extension tube for super-macro at 5x magnification, it even has autofocus!", "link": "https://www.reddit.com/r/photography/comments/cmp8b1/i_designed_and_3dprinted_a_massive_300mm_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed a massive 300mm canon extension tube for super-macro at 5x magnification, it even has autofocus!", "sortedWord": "None", "Identifyer": null, "identifyer": 64834, "year": "2019"}, {"autor": "luftfield", "date": "2019-12-29 22:47:41", "content": "What do you want in a light meter? /!/ I’ve designed a few prototype light meters, and I’m aiming at a keychain-size light meter for photography. So far my design is quite rudimentary, and might be difficult for novices to use, or photographers not familiar with the EV scale. There’s a light diffuser dome, two light sensors (one for low and one for high light), and a 4-digit 7-segment display which displays the EV level when a button is pushed. The benefit of such a basic system is yearlong battery life and easy operation, but converting EV to shutter speed/aperture takes around half a minute and is generally inconvenient, although the unit cost per device is ~$7 which is very low compared to something like a Sekonic meter. Also this design has the benefit of being open source.\n\nNot considering what I’ve written about above, what do you want in a light meter? What features would you reasonably expect a ~$20 meter to have?", "link": "https://www.reddit.com/r/photography/comments/ehcvxl/what_do_you_want_in_a_light_meter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’ve designed", "selectorShort": "design", "MarkedSent": "what do you want in a light meter? /!/ -----> i !!! ’ve -----> designed !!!  a few prototype light meters, and -----> i !!! ’m aiming at a keychain-size light meter for photography. so far my design is quite rudimentary, and might be difficult for novices to use, or photographers not familiar with the ev scale. there’s a light diffuser dome, two light sensors (one for low and one for high light), and a 4-digit 7-segment display which displays the ev level when a button is pushed. the benefit of such a basic system is yearlong battery life and easy operation, but converting ev to shutter speed/aperture takes around half a minute and is generally inconvenient, although the unit cost per device is ~$7 which is very low compared to something like a sekonic meter. also this design has the benefit of being open source.\n\nnot considering what i’ve written about above, what do you want in a light meter? what features would you reasonably expect a ~$20 meter to have?", "sortedWord": "None", "Identifyer": null, "identifyer": 65204, "year": "2019"}, {"autor": "GOLDlSILVER", "date": "2019-05-24 12:24:43", "content": "Emilia Clarke my design", "link": "https://www.reddit.com/r/photography/comments/bsga8h/emilia_clarke_my_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "emilia clarke -----> my !!!  -----> design !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 66206, "year": "2019"}, {"autor": "perfectpeachblonde", "date": "2019-12-01 07:29:29", "content": "Looking for a A3 Photo printer? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? Which one can print the highest quality Photo and high quality color document? What other brands or models do you recommend please? /!/  \n\nHiya,\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\-I'm looking for a A3 Photo printer? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? Which one can print the highest quality Photo and high quality color document? What other brands or models do you recommend please?\n\n\\-I'm looking to buy a perfect 'Photo color printer'. A printer that can accurately print all photos and high quality documents accurately? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10 that have 4800x2400 dpi or more? What else do you suggesting? For me the final print results, DPI and quality and color accuracy of print, durability of color/print, and capability of printer to print on all printable papers by printer is important(looking to print on many different types of papers preferably).\n\n\\-If it can print border-less, it would be an advantage, as two above mentioned ones are border-less?\n\n\\-What do you suggest me between these two Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10?\n\n\\-Is the print quality is same on both Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? What about possibility to print on different papers?\n\n\\-Is there a way to prevent the print/color being destroyed if any water accidentally drops/spills on the paper printed by any of the Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? If I print on quality A4 'laser printer papers', does the color/print is vulnerable to spill of water? Is there any way to prevent this? e.g. color laser photo printers are not vulnerable to spill of water even if the print is done on normal photocopy A4 papers, is there any way to make this happen on the inkjet/dye/pigment based printers? As both Canon PIXMA-Pro-100 and Canon PIXMA-Pro-10 are 'dye' based printers, are they more resilient to accidental spill of water?\n\n\\-If I want to stamp the paper by printer instead of physical stamp, will the color of stamp will be realistic, in case I tune the stamp color that I may design in Photoshop for use as corporate stamp to be printed by printer on high quality documents and photos? I like to replace traditional stamps by a digital stamp that can be printed from Photoshop design of stamp for increasing security of stamp not being stolen physically? Is there any way to make stamp color realistic with any of the above printer? if not, what printer can do this for me?\n\n\\-What else accurate and high quality Photo color printer do you suggesting me please?\n\n&amp;#x200B;\n\nTnx and best of luck", "link": "https://www.reddit.com/r/photography/comments/e4d6ez/looking_for_a_a3_photo_printer_what_about_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i may design", "selectorShort": "design", "MarkedSent": "looking for a a3 photo printer? what about canon pixma-pro-100 or canon pixma-pro-10? which one can print the highest quality photo and high quality color document? what other brands or models do you recommend please? /!/  \n\nhiya,\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\-i'm looking for a a3 photo printer? what about canon pixma-pro-100 or canon pixma-pro-10? which one can print the highest quality photo and high quality color document? what other brands or models do you recommend please?\n\n\\-i'm looking to buy a perfect 'photo color printer'. a printer that can accurately print all photos and high quality documents accurately? what about canon pixma-pro-100 or canon pixma-pro-10 that have 4800x2400 dpi or more? what else do you suggesting? for me the final print results, dpi and quality and color accuracy of print, durability of color/print, and capability of printer to print on all printable papers by printer is important(looking to print on many different types of papers preferably).\n\n\\-if it can print border-less, it would be an advantage, as two above mentioned ones are border-less?\n\n\\-what do you suggest me between these two canon pixma-pro-100 or canon pixma-pro-10?\n\n\\-is the print quality is same on both canon pixma-pro-100 or canon pixma-pro-10? what about possibility to print on different papers?\n\n\\-is there a way to prevent the print/color being destroyed if any water accidentally drops/spills on the paper printed by any of the canon pixma-pro-100 or canon pixma-pro-10? if i print on quality a4 'laser printer papers', does the color/print is vulnerable to spill of water? is there any way to prevent this? e.g. color laser photo printers are not vulnerable to spill of water even if the print is done on normal photocopy a4 papers, is there any way to make this happen on the inkjet/dye/pigment based printers? as both canon pixma-pro-100 and canon pixma-pro-10 are 'dye' based printers, are they more resilient to accidental spill of water?\n\n\\-if -----> i !!!  want to stamp the paper by printer instead of physical stamp, will the color of stamp will be realistic, in case -----> i !!!  tune the stamp color that -----> i !!!  -----> may !!!  -----> design !!!  in photoshop for use as corporate stamp to be printed by printer on high quality documents and photos? i like to replace traditional stamps by a digital stamp that can be printed from photoshop design of stamp for increasing security of stamp not being stolen physically? is there any way to make stamp color realistic with any of the above printer? if not, what printer can do this for me?\n\n\\-what else accurate and high quality photo color printer do you suggesting me please?\n\n&amp;#x200b;\n\ntnx and best of luck", "sortedWord": "None", "Identifyer": null, "identifyer": 70960, "year": "2019"}, {"autor": "vivienw", "date": "2019-04-08 02:24:21", "content": "Question about doing game/graphic design for free (more details below)? /!/ Going to try to make this as simple as I can!\n\nA family friend's son designed a (potential) mobile game and wants me to design graphics for it, and has promised to pay me a percentage of the shares if the game makes a profit. \n\nIt's basically a ton of game pieces (like icons/logos) that need to be designed, so I only want to do a partial amount of work. He can take what I've done and hire other artists to finish it once he gets enough funding (he doesn't know when that would be).\n\nI'm going to have him sign a standard Graphic Design contract, but am not completely sure how to word the Compensation part. Especially given that I'm not doing the entire design; it will be more like art direction.\nI don't do design work for free so I want to make sure I get some type of pay regardless of whether my designs are used, or whether or not the game earns a profit. I was thinking along the lines of 1% of the shares of the game profit.\n\nThanks in advance! Any tips or advice is very much appreciated.", "link": "https://www.reddit.com/r/photography/comments/bao9nq/question_about_doing_gamegraphic_design_for_free/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "question about doing game/graphic design for free (more details below)? /!/ going to try to make this as simple as i can!\n\na family friend's son designed a (potential) mobile game and wants -----> me !!!  -----> to !!!  -----> design !!!  graphics for it, and has promised -----> to !!!  pay -----> me !!!  a percentage of the shares if the game makes a profit. \n\nit's basically a ton of game pieces (like icons/logos) that need to be designed, so i only want to do a partial amount of work. he can take what i've done and hire other artists to finish it once he gets enough funding (he doesn't know when that would be).\n\ni'm going to have him sign a standard graphic design contract, but am not completely sure how to word the compensation part. especially given that i'm not doing the entire design; it will be more like art direction.\ni don't do design work for free so i want to make sure i get some type of pay regardless of whether my designs are used, or whether or not the game earns a profit. i was thinking along the lines of 1% of the shares of the game profit.\n\nthanks in advance! any tips or advice is very much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 71846, "year": "2019"}, {"autor": "Emotionalmomentau", "date": "2019-08-13 13:07:02", "content": "Design Your Sweetest Memories In Beautiful Frames", "link": "https://www.reddit.com/r/photography/comments/cpswds/design_your_sweetest_memories_in_beautiful_frames/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  your sweetest memories in beautiful frames", "sortedWord": "None", "Identifyer": null, "identifyer": 76837, "year": "2019"}, {"autor": "madams1126", "date": "2019-03-06 04:52:17", "content": "Looking for ideas/ways that I can get wildlife photography /!/ Some context: I am a graphic design major working on a big project for one of my two final college classes. I have chosen to design a wildlife conservation website, along with some other small things. For this website, I want to have a lot of nice wildlife photography, but I would like to avoid using stock photography because it's not as unique and I'd like as much of the website to be original as possible. However, I live in the Midwest and don't have the means to take a lot of my own wildlife photography (such as rainforest and ocean wildlife). My professor suggested I find a way to get in contact with someone who lives in those kinds of areas to find people who may be willing to let me use their photography.\n\nDoes anyone have any suggestions on how/where I might be able to do this? Unfortunately I don't know anyone personally who could help me with this. I should also mention, this website will not be an active website available to the public. It would only be shown to my class and in my own personal portfolio. I would not claim any rights to the photographs. \n\nThank you for any suggestions!", "link": "https://www.reddit.com/r/photography/comments/axuwqr/looking_for_ideasways_that_i_can_get_wildlife/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have chosen to design", "selectorShort": "design", "MarkedSent": "looking for ideas/ways that i can get wildlife photography /!/ some context: i am a graphic design major working on a big project for one of my two final college classes. -----> i !!!  -----> have !!!  -----> chosen !!!  -----> to !!!  -----> design !!!  a wildlife conservation website, along with some other small things. for this website, i want to have a lot of nice wildlife photography, but i would like to avoid using stock photography because it's not as unique and i'd like as much of the website to be original as possible. however, i live in the midwest and don't have the means to take a lot of my own wildlife photography (such as rainforest and ocean wildlife). my professor suggested i find a way to get in contact with someone who lives in those kinds of areas to find people who may be willing to let me use their photography.\n\ndoes anyone have any suggestions on how/where i might be able to do this? unfortunately i don't know anyone personally who could help me with this. i should also mention, this website will not be an active website available to the public. it would only be shown to my class and in my own personal portfolio. i would not claim any rights to the photographs. \n\nthank you for any suggestions!", "sortedWord": "None", "Identifyer": null, "identifyer": 81828, "year": "2019"}, {"autor": "davni_", "date": "2019-01-09 23:14:58", "content": "Designing /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/aecof5/designing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 82741, "year": "2019"}, {"autor": "thenickdude", "date": "2019-01-24 06:45:16", "content": "I designed and 3D-printed my own LED softbox! /!/ I got my first 3D printer recently, but it sits in a shady corner of my room, so I thought I'd design a light for it. Then I realised I could kill two birds with one stone and design it to be useful for photography as well.\n\nHere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/VCciOoA\n\nI've posted the LED softbox model and the build instructions to Thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\nEver since I bought a bunch of YongNuo flashes I've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!", "link": "https://www.reddit.com/r/photography/comments/aj9s1c/i_designed_and_3dprinted_my_own_led_softbox/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed my own led softbox! /!/ i got my first 3d printer recently, but it sits in a shady corner of my room, so i thought i'd design a light for it. then i realised i could kill two birds with one stone and design it to be useful for photography as well.\n\nhere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/vcciooa\n\ni've posted the led softbox model and the build instructions to thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\never since i bought a bunch of yongnuo flashes i've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!", "sortedWord": "None", "Identifyer": null, "identifyer": 83601, "year": "2019"}], "name": "designphotography2019"}