{"interestingcomments": [{"autor": "anakist101", "date": "2018-09-10 11:30:05", "content": "Giving out my web design services for FREE to anyone who is starting up their own small business? /!/ I am currently in the middle of starting my own web design business after working for sometime for \n\nother people, I will need some projects to undertake to build up my portfolio. So its a good way to get \n\na free website built if any of you guys need it.\n\nMy only prerequisites are;\n\n* No e commerce sites\n* 5 pages max\n\nThese are only because of time restraints.\n\nI will design, build and give you the site but its up to you to get it hosted, I can help / walk \n\nyou through this if you are not sure.\n\n&amp;#x200B;\n\nPM me if anyone is interested.", "link": "https://www.reddit.com/r/photography/comments/9em8p5/giving_out_my_web_design_services_for_free_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will design", "selectorShort": "design", "MarkedSent": "giving out my web design services for free to anyone who is starting up their own small business? /!/ i am currently in the middle of starting my own web design business after working for sometime for \n\nother people, i will need some projects to undertake to build up my portfolio. so its a good way to get \n\na free website built if any of you guys need it.\n\nmy only prerequisites are;\n\n* no e commerce sites\n* 5 pages max\n\nthese are only because of time restraints.\n\n-----> i !!!  -----> will !!!  -----> design !!! , build and give you the site but its up to you to get it hosted, -----> i !!!  can help / walk \n\nyou through this if you are not sure.\n\n&amp;#x200b;\n\npm me if anyone is interested.", "sortedWord": "None", "Identifyer": null, "identifyer": 13236, "year": "2018"}, {"autor": "swordgeek", "date": "2018-05-22 20:04:39", "content": "What is the optimum *pixel size*, given modern technology? /!/ This is kind of an armchair exercise, but I was curious.\n\nAges ago, there was a grand debate between pixel size and pixel density (MP), and the general rule-of-thumb was that a 6.5µm pixel was roughly ideal. Turns out, it came from [This Paper](http://www-isl.stanford.edu/~abbas/group/papers_and_pub/pixelsize.pdf), which did simulations, and pointed out that it was based on the then-current CMOS technology of 0.35µm, but also mentioned that it scaled non-linearly with technology (down to 4.5µm for 0.18µm CMOS).\n\nAs near as I can understand, our current CMOS technology (~a tenth of that value) should be small enough that it is no longer a factor, and we should be able to achieve an optimum pixel size (aka pitch) based on DR, SNR, and MTF.\n\nDoes anyone know what that value is? Is there a finite limit, and does the CMOS scaling just increase fill factor now?\n\nOr put another way: If I were to design an absolutely ideal (for typical light) sensor, where the size was arbitrary to achieve the resolution I wanted, what pixel pitch should I choose?\n", "link": "https://www.reddit.com/r/photography/comments/8ld4gm/what_is_the_optimum_pixel_size_given_modern/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i were to design", "selectorShort": "design", "MarkedSent": "what is the optimum *pixel size*, given modern technology? /!/ this is kind of an armchair exercise, but i was curious.\n\nages ago, there was a grand debate between pixel size and pixel density (mp), and the general rule-of-thumb was that a 6.5µm pixel was roughly ideal. turns out, it came from [this paper](http://www-isl.stanford.edu/~abbas/group/papers_and_pub/pixelsize.pdf), which did simulations, and pointed out that it was based on the then-current cmos technology of 0.35µm, but also mentioned that it scaled non-linearly with technology (down to 4.5µm for 0.18µm cmos).\n\nas near as i can understand, our current cmos technology (~a tenth of that value) should be small enough that it is no longer a factor, and we should be able to achieve an optimum pixel size (aka pitch) based on dr, snr, and mtf.\n\ndoes anyone know what that value is? is there a finite limit, and does the cmos scaling just increase fill factor now?\n\nor put another way: if -----> i !!!  -----> were !!!  -----> to !!!  -----> design !!!  an absolutely ideal (for typical light) sensor, where the size was arbitrary -----> to !!!  achieve the resolution -----> i !!!  wanted, what pixel pitch should -----> i !!!  choose?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 15450, "year": "2018"}, {"autor": "Arachnorchis", "date": "2018-02-17 11:09:16", "content": "I designed and 3D printed a 150mm filter mounting system to adapt to most lenses /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7y63cd/i_designed_and_3d_printed_a_150mm_filter_mounting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a 150mm filter mounting system to adapt to most lenses /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 20498, "year": "2018"}, {"autor": "ZachWinterton", "date": "2018-06-04 04:13:56", "content": "My first attempt at a flatlay showcasing a font I designed", "link": "https://www.reddit.com/r/photography/comments/8oegzz/my_first_attempt_at_a_flatlay_showcasing_a_font_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "my first attempt at a flatlay showcasing a font -----> i !!!  -----> designed !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 29005, "year": "2018"}, {"autor": "stijnbenjamin", "date": "2018-08-08 20:38:02", "content": "Hey Reddit users! What are camera features you want, that are not on today’s cameras? /!/ I’m starting a camera company, funded by Kickstarter, and i’m trying to design the perfect modern camera. Thanks in advance.", "link": "https://www.reddit.com/r/photography/comments/95pte0/hey_reddit_users_what_are_camera_features_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to design", "selectorShort": "design", "MarkedSent": "hey reddit users! what are camera features you want, that are not on today’s cameras? /!/ -----> i !!! ’m starting a camera company, funded by kickstarter, and -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> design !!!  the perfect modern camera. thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 30228, "year": "2018"}, {"autor": "glebsergeev", "date": "2018-09-25 19:04:36", "content": "Design with a piece of Bauhaus history (1919-1933) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9iv1mw/design_with_a_piece_of_bauhaus_history_19191933/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  with a piece of bauhaus history (1919-1933) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 31852, "year": "2018"}, {"autor": "BadConductor", "date": "2018-10-10 02:59:03", "content": "I also designed and 3D printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [Album Here](https://imgur.com/a/XIKBIaz)\n\nThis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. Changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\nI plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes I use have a built-in holder), and I currently have a diffuser printing in white filament.\n\nThe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. If anyone wants, I can provide the original Autodesk Inventor files so it can be modified easily.", "link": "https://www.reddit.com/r/photography/comments/9mvs85/i_also_designed_and_3d_printed_some_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> also !!!  -----> designed !!!  and 3d printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [album here](https://imgur.com/a/xikbiaz)\n\nthis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\ni plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes i use have a built-in holder), and i currently have a diffuser printing in white filament.\n\nthe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. if anyone wants, i can provide the original autodesk inventor files so it can be modified easily.", "sortedWord": "None", "Identifyer": null, "identifyer": 32247, "year": "2018"}, {"autor": "ddblah", "date": "2018-10-23 03:37:35", "content": "Just 3 quick questions (multiple choice) to help me design a more versatile camera app /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9ql76z/just_3_quick_questions_multiple_choice_to_help_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me design", "selectorShort": "design", "MarkedSent": "just 3 quick questions (multiple choice) to help -----> me !!!  -----> design !!!  a more versatile camera app /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 32922, "year": "2018"}, {"autor": "meta_detectorist", "date": "2018-12-06 18:02:57", "content": "Where to print double-sided glossy? /!/ Hey, I've been photographing for years, but rarely print. I recently designed a 2-sided save-the-date with some awesome shots from La Jolla, with one photo on each side. But...I can't find anywhere that'll just make a double-sided glossy print. Amazon and Costco do double sided matte cards, but I really wasn't impressed with the Amazon samples I ordered. I need 300!\n\nAny suggestions? Thanks in advance! ", "link": "https://www.reddit.com/r/photography/comments/a3qfia/where_to_print_doublesided_glossy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently designed", "selectorShort": "design", "MarkedSent": "where to print double-sided glossy? /!/ hey, i've been photographing for years, but rarely print. -----> i !!!  -----> recently !!!  -----> designed !!!  a 2-sided save-the-date with some awesome shots from la jolla, with one photo on each side. but...i can't find anywhere that'll just make a double-sided glossy print. amazon and costco do double sided matte cards, but i really wasn't impressed with the amazon samples i ordered. i need 300!\n\nany suggestions? thanks in advance! ", "sortedWord": "None", "Identifyer": null, "identifyer": 33820, "year": "2018"}, {"autor": "trejonw", "date": "2018-12-16 14:09:48", "content": "I feel stuck. /!/ I'm sure there are better places to post something like this, but I'm more comfortable sharing with like-minded people.\n\nSo I'm an 18yo photographer, about 6 months out of high school. I'm not going to college and i don't plan to. I currently focus on fashion work but I do lifestyle work, food, event, etc. I'm also a graphic designer. My design portfolio isn't as consistent as my photo one but I've been in the field for about 5 years, so I think it's fair to give myself the title. My currently goals are to get my work published in a fashion magazine (Schon, Dazed, 032c, so on) and host a solo exhibition by next Summer. Long term goal - I want to be creative/art director of a major publication.\n\nMy problem is money. I've been applying to photography/design jobs for the last two months and I'll either get no response or rejected. I'll even follow up on the phone and most of the time some receptionist tells me the person I want to be speaking to is \"in a meeting\". Id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. I try to promote my own photography services but I get no inquiries. Maybe I'm doing it wrong. This industry seems like it's built by and for extroverts and I'm just not that loud. I don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nHas anyone here been in a similar position? How do you stay financially stable while still working toward your photography career? How do you promote yourself? I don't know if I'm allowed to link my website but if someone asks ill be happy to send it over.\n\nI live in Dallas, TX if that helps. Thank you in advance&lt;3\n", "link": "https://www.reddit.com/r/photography/comments/a6p99m/i_feel_stuck/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "i feel stuck. /!/ i'm sure there are better places to post something like this, but i'm more comfortable sharing with like-minded people.\n\nso i'm an 18yo photographer, about 6 months out of high school. i'm not going to college and i don't plan to. i currently focus on fashion work but i do lifestyle work, food, event, etc. i'm also a graphic designer. -----> my !!!  -----> design !!!  portfolio isn't as consistent as -----> my !!!  photo one but i've been in the field for about 5 years, so i think it's fair to give myself the title. my currently goals are to get my work published in a fashion magazine (schon, dazed, 032c, so on) and host a solo exhibition by next summer. long term goal - i want to be creative/art director of a major publication.\n\nmy problem is money. i've been applying to photography/design jobs for the last two months and i'll either get no response or rejected. i'll even follow up on the phone and most of the time some receptionist tells me the person i want to be speaking to is \"in a meeting\". id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. i try to promote my own photography services but i get no inquiries. maybe i'm doing it wrong. this industry seems like it's built by and for extroverts and i'm just not that loud. i don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nhas anyone here been in a similar position? how do you stay financially stable while still working toward your photography career? how do you promote yourself? i don't know if i'm allowed to link my website but if someone asks ill be happy to send it over.\n\ni live in dallas, tx if that helps. thank you in advance&lt;3\n", "sortedWord": "None", "Identifyer": null, "identifyer": 34197, "year": "2018"}, {"autor": "pylesrm", "date": "2018-09-20 14:22:10", "content": "Let's design our dream camera! /!/ I just had this same discussion with a couple co-workers, so I thought I'd bring it here and see what you guys have to say.\n\nIf you could design any DSLR you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nSo I'll go first:\n\nMedium format sensor in a DSLR body\nRuns Android\nBuilt-in mini tripod\nBuilt in drone\n\nAnd a lot more", "link": "https://www.reddit.com/r/photography/comments/9hfphq/lets_design_our_dream_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "'s design", "selectorShort": "design", "MarkedSent": "let-----> 's !!!  -----> design !!!  our dream camera! /!/ i just had this same discussion with a couple co-workers, so i thought i'd bring it here and see what you guys have to say.\n\nif you could design any dslr you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nso i'll go first:\n\nmedium format sensor in a dslr body\nruns android\nbuilt-in mini tripod\nbuilt in drone\n\nand a lot more", "sortedWord": "None", "Identifyer": null, "identifyer": 36725, "year": "2018"}, {"autor": "JohnCarson89", "date": "2018-11-08 18:59:37", "content": "Good host/builders to create a website? /!/ Looking to creating a website for my photography/videography to create a portfolio. I've been hearing about Squarespace but wondering what your opinion is on options such as Wordpress, Wix etc. I do not know coding or anything so I would be designing from a template stand point. ", "link": "https://www.reddit.com/r/photography/comments/9vct6z/good_hostbuilders_to_create_a_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would be designing", "selectorShort": "design", "MarkedSent": "good host/builders to create a website? /!/ looking to creating a website for my photography/videography to create a portfolio. i've been hearing about squarespace but wondering what your opinion is on options such as wordpress, wix etc. -----> i !!!  do not know coding or anything so -----> i !!!  -----> would !!!  -----> be !!!  -----> designing !!!  from a template stand point. ", "sortedWord": "None", "Identifyer": null, "identifyer": 37234, "year": "2018"}], "name": "designphotography2018"}