{"interestingcomments": [{"autor": "nathawnb", "date": "2020-05-24 02:00:52", "content": "What are some free Rendering Softwares for digital photography? /!/ I am talking about Rendering Softwares where I can design my own landscapes digitally, play with lighting, and just let my creativity overtake. (If you follow @dovneon on Instagram you will know what I’m talking about)", "link": "https://www.reddit.com/r/photography/comments/gphdjt/what_are_some_free_rendering_softwares_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can design", "selectorShort": "design", "MarkedSent": "what are some free rendering softwares for digital photography? /!/ -----> i !!!  am talking about rendering softwares where -----> i !!!  -----> can !!!  -----> design !!!  my own landscapes digitally, play with lighting, and just let my creativity overtake. (if you follow @dovneon on instagram you will know what i’m talking about)", "sortedWord": "None", "Identifyer": null, "identifyer": 60852, "year": "2020"}, {"autor": "Stunnerbee", "date": "2020-01-16 23:24:38", "content": "Design 2 photography signature logo in 6hrs by Ravindu_ps", "link": "https://www.reddit.com/r/photography/comments/eprlep/design_2_photography_signature_logo_in_6hrs_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  2 photography signature logo in 6hrs by ravindu_ps", "sortedWord": "None", "Identifyer": null, "identifyer": 63034, "year": "2020"}, {"autor": "sneaker7z7", "date": "2020-04-27 03:02:43", "content": "Designed by Joe Exotic, the tiger king himself!", "link": "https://www.reddit.com/r/photography/comments/g8sdlq/designed_by_joe_exotic_the_tiger_king_himself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  by joe exotic, the tiger king himself!", "sortedWord": "None", "Identifyer": null, "identifyer": 63347, "year": "2020"}, {"autor": "kidfantastic", "date": "2020-05-05 06:08:10", "content": "Composition Overlays - any iphone apps? /!/ Greetings Reddit Photographers! \n\nI've just started learning photography on a Canon 750d. I've studied design in the past and am familiar with the compositional elements such as rule of thirds, golden section etc. When designing I can use an overlay of the element to check my work. What I'd really like is to be able to do the same with a photograph *before* I take it. I know I can drag it into some software and check it that way, but by that time I'm already home and the moment has passed. I've read about Magic Lantern but am not confident enough to install that on my camera and it's not compatible yet anyway. Does anyone know of an iPhone app that would allow me to use these compositional elements as overlays while I'm checking the composition of shot before I take it? As a beginner it would be such a useful learning tool, and a lot easier than carrying around a bunch of transparencies with the overlay printed option - this is not great, I know - but it's my next best plan at this point. Thank you so much in advance for your help!", "link": "https://www.reddit.com/r/photography/comments/gdsbxq/composition_overlays_any_iphone_apps/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've studied design", "selectorShort": "design", "MarkedSent": "composition overlays - any iphone apps? /!/ greetings reddit photographers! \n\ni've just started learning photography on a canon 750d. -----> i !!! 've -----> studied !!!  -----> design !!!  in the past and am familiar with the compositional elements such as rule of thirds, golden section etc. when designing i can use an overlay of the element to check my work. what i'd really like is to be able to do the same with a photograph *before* i take it. i know i can drag it into some software and check it that way, but by that time i'm already home and the moment has passed. i've read about magic lantern but am not confident enough to install that on my camera and it's not compatible yet anyway. does anyone know of an iphone app that would allow me to use these compositional elements as overlays while i'm checking the composition of shot before i take it? as a beginner it would be such a useful learning tool, and a lot easier than carrying around a bunch of transparencies with the overlay printed option - this is not great, i know - but it's my next best plan at this point. thank you so much in advance for your help!", "sortedWord": "None", "Identifyer": null, "identifyer": 63463, "year": "2020"}, {"autor": "SpartanFlight", "date": "2020-07-16 20:00:10", "content": "ZNO Book Review /!/ I'm going to keep it short cause I suck at expressing my thoughts. I saw an add pop up on my IG feed \"saying free 8 x 8 hard cover book\".\n\nI said why not.  After giving some personal information (my website, website email, pretty much checking to see if I was a photographer) I was given a coupon code to get a free 24 page 8 x 8 book.  I still had to pay shipping (around 12 dollars)\n\nPros:\n\n* Book arrived quickly after ordered (1 week)\n\n* Inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* The website was really really easy to use\n\n\n\nCons:\n\n*  Book ships from China (I would never trust my full res photos to a chinese company EVER, for my own clothing brands and local printing I can vet for my local shops not to steal my designs, and control the quality of my work.  Also the company plays off like they are Canadian.\n\n* The print quality was very mediocre.  For comparison, my previous book was printed from blurb.  Any brightness adjustments were made in when i designed my book, and what i saw on my monitor was shown on the book.  Not so much with zno.  The Hardcover feels like a pillow?  .  My photos were missing fine detail.  I suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* Price is expensive.  This book was 66 dollars Canadian if I paid, for 24 pages.  For Comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\nTL;DR.  \n\nJust use blurb.  ZNO is essentially a fancy dropshipping website.", "link": "https://www.reddit.com/r/photography/comments/hsh51t/zno_book_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my designs", "selectorShort": "design", "MarkedSent": "zno book review /!/ i'm going to keep it short cause i suck at expressing my thoughts. i saw an add pop up on my ig feed \"saying free 8 x 8 hard cover book\".\n\ni said why not.  after giving some personal information (my website, website email, pretty much checking to see if i was a photographer) i was given a coupon code to get a free 24 page 8 x 8 book.  i still had to pay shipping (around 12 dollars)\n\npros:\n\n* book arrived quickly after ordered (1 week)\n\n* inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* the website was really really easy to use\n\n\n\ncons:\n\n*  book ships from china (i would never trust -----> my !!!  full res photos to a chinese company ever, for -----> my !!!  own clothing brands and local printing i can vet for -----> my !!!  local shops not to steal -----> my !!!  -----> designs !!! , and control the quality of -----> my !!!  work.  also the company plays off like they are canadian.\n\n* the print quality was very mediocre.  for comparison, my previous book was printed from blurb.  any brightness adjustments were made in when i designed my book, and what i saw on my monitor was shown on the book.  not so much with zno.  the hardcover feels like a pillow?  .  my photos were missing fine detail.  i suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* price is expensive.  this book was 66 dollars canadian if i paid, for 24 pages.  for comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\ntl;dr.  \n\njust use blurb.  zno is essentially a fancy dropshipping website.", "sortedWord": "None", "Identifyer": null, "identifyer": 64146, "year": "2020"}, {"autor": "DivisionalMedia", "date": "2020-04-30 19:18:36", "content": "I got bored and made a platform to hopefully help creative content creators showcase, collaborate and create in one place. /!/ I built out a little project for creative content creators and talent called  [Vidafi.com](https://vidafi.com/) \n\n(SSL certificate not in place yet so it may show a warning in your browser)\n\nThe idea is to be a bit more refined DeviantArt meets ModelMayhem (as there's a focus on video and performance talent as well). Designed to hopefully build a community to encourage collaborating worldwide and helping creators showcase and get hired/commissioned for work in a single place. \n\nWould love to have anyone here try it and feature their portfolio work there.\n\nI'm looking for a solid core catalog of creatives before promoting it and also really need feedback.\n\nSeriously ANY feedback is welcome (keeping in mid this is only the core beta build and there's a lot of incomplete and placeholder elements).\n\nAll the best to everyone!", "link": "https://www.reddit.com/r/photography/comments/gb28ly/i_got_bored_and_made_a_platform_to_hopefully_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "i got bored and made a platform to hopefully help creative content creators showcase, collaborate and create in one place. /!/ i built out a little project for creative content creators and talent called  [vidafi.com](https://vidafi.com/) \n\n(ssl certificate not in place yet so it may show a warning in your browser)\n\nthe idea is to be a bit more refined deviantart meets modelmayhem (as there's a focus on video and performance talent as well). -----> designed !!!  to hopefully build a community to encourage collaborating worldwide and helping creators showcase and get hired/commissioned for work in a single place. \n\nwould love to have anyone here try it and feature their portfolio work there.\n\ni'm looking for a solid core catalog of creatives before promoting it and also really need feedback.\n\nseriously any feedback is welcome (keeping in mid this is only the core beta build and there's a lot of incomplete and placeholder elements).\n\nall the best to everyone!", "sortedWord": "None", "Identifyer": null, "identifyer": 68740, "year": "2020"}, {"autor": "WiccedSwede", "date": "2020-06-01 18:22:27", "content": "I designed and 3D printed a beefy camera grip so I won't get hand pains anymore while shooting for extended periods of time. Hope I can help someone with this idea.", "link": "https://www.reddit.com/r/photography/comments/gupuvc/i_designed_and_3d_printed_a_beefy_camera_grip_so/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a beefy camera grip so -----> i !!!  won't get hand pains anymore while shooting for extended periods of time. hope i can help someone with this idea.", "sortedWord": "None", "Identifyer": null, "identifyer": 69437, "year": "2020"}, {"autor": "esheventer", "date": "2020-07-12 10:15:17", "content": "If you are a photographer facing problems while doing SEO of your website. I built a Trello board to follow SEO tasks step by step. I also designed a mindmap to make your SEO Journey. It’s completely free.", "link": "https://www.reddit.com/r/photography/comments/hps5u9/if_you_are_a_photographer_facing_problems_while/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also designed", "selectorShort": "design", "MarkedSent": "if you are a photographer facing problems while doing seo of your website. i built a trello board to follow seo tasks step by step. -----> i !!!  -----> also !!!  -----> designed !!!  a mindmap to make your seo journey. it’s completely free.", "sortedWord": "None", "Identifyer": null, "identifyer": 70344, "year": "2020"}, {"autor": "photopracticum", "date": "2020-09-14 11:31:09", "content": "Designing Photography Books in Photoshop and InDesign", "link": "https://www.reddit.com/r/photography/comments/isj451/designing_photography_books_in_photoshop_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  photography books in photoshop and indesign", "sortedWord": "None", "Identifyer": null, "identifyer": 71458, "year": "2020"}, {"autor": "i_no_exist", "date": "2020-11-15 21:37:20", "content": "Designing a photography product! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/juu33p/designing_a_photography_product/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  a photography product! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 73977, "year": "2020"}, {"autor": "kendalinwonderland", "date": "2020-01-27 22:41:12", "content": "Question about IP/copyrights when you ask for help taking a picture /!/ So a few years ago, I started a self-portrait project to promote myself as an actress on Instagram. It's been fun, 99% of the photos I take myself and edit myself. On occasion I collaborate with someone like a boyfriend, friend, or photographer on something. \n\nLast year, I designed and hand-made a dress to be nearly identical to one that Audrey Hepburn wore in an early photo in Kew Gardens. I put together the whole outfit, and when I went to London, my plan was to go there either with a tripod or a friend and make my recreations. A newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nWe met at the park, and we started looking for the locations where the photos in Audrey's photo session were taken. I handed him my camera, and I and his mom would check the pictures on my phone to double check the angles and the poses. I ended up with three photos on my 'to do' list, which I then took home and edited, and shared on Instagram, of course thanking them for their help.\n\nCut to this year, another friend was working with a publisher on a book on Audrey Hepburn and really wanted to include some photos of me in the introduction. I sent over 9 of my favourites, including one from Kew. He decided on two that I had edited myself into, which were taken in the 1950's and 1960's. I assume he did whatever needed done to clear those. And the third was one from Kew. \n\nNow, the whole time before this, I've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. It's been a stressful year - I moved from California to France, and then went on a 3 month road trip (with my cat) between five countries. Then I spent a month apartment-hunting, and then trying to furnish the place. I've been extremely forgetful. I'll find emails I failed to reply to from 3 months ago. Anyway when I posted a photo of the page in the book, it was *then* that it was brought to my attention. I freaked the hell out and had a panic attack. I didn't mean to do that to my friends who had helped me create this picture I love. I was a wreck. I wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on IG that I had to take a mental health break for a while. I couldn't deal. For 3 days. Just couldn't eat, couldn't do much of anything, but I decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* I could do for myself because I don't even feel in control of my own brain at this point. Anyway I got it together and wrote her son a long apology on Friday, and told him what I would try to do to fix it, and to make it up to him. Still no response. But now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and I don't know, he's dealt with photos for decades, he's a collector and author and worked at the National Portrait Gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nSide note. My own personal issue here is WTF would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nBut my legal question (and sorry it took me this long to write this, but UGGGGG) is who owns this photo? I mean I was thinking about it today and honestly, I would be kind of pissed if HE used it without telling me, or asking me. Because it's my project, my series, I put way more effort into creating the photo than he did (I spent DAYS making the dress), he has no use for it, and I basically just handed him my camera. If you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? Personally, yes, I would appreciate a credit if someone used the photo I took of them, but I certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. This is MY photo. Now he's trying to limit what I can do with it, just because he stood there and pushed the button. I have another friend who told me to do whatever I wanted with the photos she took of me. We're friends and it's for fun. Now of course when I work with a photographer and sign a release, I get that I have to ask them first. But I'm 99% sure we did not sign a release (I'll leave 1% of doubt because I'm forgetful and haven't dug through my papers. But in my moving process I don't recall coming across one for that day). If he's going to start a fight over who can use MY photo, oh yeah I'm going to fight him. But hell, if he's going to be such an asshole about it, I'll just go back and take new photos there next time I'm in London. \n\nI'm definitely feeling bad about not acknowledging him, but I'm also getting pretty annoyed right now at the way they're dealing with this. I need some input, please!", "link": "https://www.reddit.com/r/photography/comments/euvv9f/question_about_ipcopyrights_when_you_ask_for_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "question about ip/copyrights when you ask for help taking a picture /!/ so a few years ago, i started a self-portrait project to promote myself as an actress on instagram. it's been fun, 99% of the photos i take myself and edit myself. on occasion i collaborate with someone like a boyfriend, friend, or photographer on something. \n\nlast year, -----> i !!!  -----> designed !!!  and hand-made a dress to be nearly identical to one that audrey hepburn wore in an early photo in kew gardens. i put together the whole outfit, and when i went to london, my plan was to go there either with a tripod or a friend and make my recreations. a newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nwe met at the park, and we started looking for the locations where the photos in audrey's photo session were taken. i handed him my camera, and i and his mom would check the pictures on my phone to double check the angles and the poses. i ended up with three photos on my 'to do' list, which i then took home and edited, and shared on instagram, of course thanking them for their help.\n\ncut to this year, another friend was working with a publisher on a book on audrey hepburn and really wanted to include some photos of me in the introduction. i sent over 9 of my favourites, including one from kew. he decided on two that i had edited myself into, which were taken in the 1950's and 1960's. i assume he did whatever needed done to clear those. and the third was one from kew. \n\nnow, the whole time before this, i've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. it's been a stressful year - i moved from california to france, and then went on a 3 month road trip (with my cat) between five countries. then i spent a month apartment-hunting, and then trying to furnish the place. i've been extremely forgetful. i'll find emails i failed to reply to from 3 months ago. anyway when i posted a photo of the page in the book, it was *then* that it was brought to my attention. i freaked the hell out and had a panic attack. i didn't mean to do that to my friends who had helped me create this picture i love. i was a wreck. i wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on ig that i had to take a mental health break for a while. i couldn't deal. for 3 days. just couldn't eat, couldn't do much of anything, but i decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* i could do for myself because i don't even feel in control of my own brain at this point. anyway i got it together and wrote her son a long apology on friday, and told him what i would try to do to fix it, and to make it up to him. still no response. but now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and i don't know, he's dealt with photos for decades, he's a collector and author and worked at the national portrait gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nside note. my own personal issue here is wtf would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nbut my legal question (and sorry it took me this long to write this, but uggggg) is who owns this photo? i mean i was thinking about it today and honestly, i would be kind of pissed if he used it without telling me, or asking me. because it's my project, my series, i put way more effort into creating the photo than he did (i spent days making the dress), he has no use for it, and i basically just handed him my camera. if you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? personally, yes, i would appreciate a credit if someone used the photo i took of them, but i certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. this is my photo. now he's trying to limit what i can do with it, just because he stood there and pushed the button. i have another friend who told me to do whatever i wanted with the photos she took of me. we're friends and it's for fun. now of course when i work with a photographer and sign a release, i get that i have to ask them first. but i'm 99% sure we did not sign a release (i'll leave 1% of doubt because i'm forgetful and haven't dug through my papers. but in my moving process i don't recall coming across one for that day). if he's going to start a fight over who can use my photo, oh yeah i'm going to fight him. but hell, if he's going to be such an asshole about it, i'll just go back and take new photos there next time i'm in london. \n\ni'm definitely feeling bad about not acknowledging him, but i'm also getting pretty annoyed right now at the way they're dealing with this. i need some input, please!", "sortedWord": "None", "Identifyer": null, "identifyer": 77793, "year": "2020"}, {"autor": "amellice", "date": "2020-12-15 18:57:46", "content": "Saal Digital Photobook Review /!/ Hi all, I've recently ordered a photobook from Saal Digital which is a German print house, and wanted to share my thoughts with you.\n\n&amp;#x200B;\n\nWhile I was looking for a printing house to print a portfolio photo book, I stumbled on Saal Digital which is a German print house that offers high quality prints and photo books. I've never tried Saal Digital before and having tried a different bunch of other print houses, I decided to give Saal Digital a try. I printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# Design\n\nThere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. I chose the Professional Line photobook with the black leather cover surface and went for the glossy finish.\n\nSaal Digital offers layout design software for both Mac OS and Windows where you can customize your book. This is the tool that I used to design, upload, and order my book. You can design your book with other software and upload it for printing as a PDF.\n\nI found the software to be very easy to use. You start out by designing the cover of the book including the back and the spine. Then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nAs for the paper itself, Saal Digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) Fuji Crystal Archive paper. For each page, two papers will be glued back to back with a thickness of about 0.36mm per page. I personally love this paper and use it in my darkroom printing since it's widely available in sheets. It has beautiful color rendering with deep blacks and beautiful highlights.\n\nAs for color management, Saal Digital provides ICC color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. I found that the profile rendering stays very close to the exported sRGB JPEGs and the final print. You would get an accurate representation if your monitor is calibrated.\n\nAnother aspect that I liked is what Saal Digital calls \"Layflat Binding\" where you can print panorama on two pages and they would look (hopefully) flat. I've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# Print Quality\n\nIt all comes down to print quality when I want to pick which print house to print my photos. Sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. Personally, I was impressed with Saal's final book and I'll break it down for you.\n\nAs for the cover, the leather cover felt premium and not cheap. It has a non-noticeable nice smell. The binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). The spine looks fine and sturdy. You can print on the first page glued to the front and back cover if you choose to do so.\n\nThe pages themselves feel thick since they are two prints glued back to back together. The glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. Since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nThe color rendering stayed very true to the original photos. I increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. The prints look and feel very close to what I see on the screen and print personally on an Inkjet printer. Looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. Shadows are not lost too, the subtle different tones are still rendered as I wanted which was quite surprising to me.\n\nLooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nYou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). The contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. This may be due to the continuous tone of RA-4 printing with this paper vs Inkjet printing for example.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\nDeep shadows and subtle tones rendering looks amazing in color photographs too. Like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# Summary\n\nAll in all, I was very pleased with the quality of the book and prints. The Professional Line Photobook product did indeed feel professional and premium. The color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nThe one thing that I felt missing is offering other types of paper for books, as Fuji Crystal Archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. For me, I love the Crystal Archive paper and use it personally. \n\nAnother thing to note is that I capped the max number of pages allowed at 130 pages. The software wouldn't let me add more pages after that. This restriction may exist to ensure \"Layflat Binding\" would work.", "link": "https://www.reddit.com/r/photography/comments/kdrw88/saal_digital_photobook_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i used to design", "selectorShort": "design", "MarkedSent": "saal digital photobook review /!/ hi all, i've recently ordered a photobook from saal digital which is a german print house, and wanted to share my thoughts with you.\n\n&amp;#x200b;\n\nwhile i was looking for a printing house to print a portfolio photo book, i stumbled on saal digital which is a german print house that offers high quality prints and photo books. i've never tried saal digital before and having tried a different bunch of other print houses, i decided to give saal digital a try. i printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# design\n\nthere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. i chose the professional line photobook with the black leather cover surface and went for the glossy finish.\n\nsaal digital offers layout design software for both mac os and windows where you can customize your book. this is the tool that -----> i !!!  -----> used !!!  -----> to !!!  -----> design !!! , upload, and order my book. you can design your book with other software and upload it for printing as a pdf.\n\ni found the software to be very easy to use. you start out by designing the cover of the book including the back and the spine. then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200b;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nas for the paper itself, saal digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) fuji crystal archive paper. for each page, two papers will be glued back to back with a thickness of about 0.36mm per page. i personally love this paper and use it in my darkroom printing since it's widely available in sheets. it has beautiful color rendering with deep blacks and beautiful highlights.\n\nas for color management, saal digital provides icc color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. i found that the profile rendering stays very close to the exported srgb jpegs and the final print. you would get an accurate representation if your monitor is calibrated.\n\nanother aspect that i liked is what saal digital calls \"layflat binding\" where you can print panorama on two pages and they would look (hopefully) flat. i've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# print quality\n\nit all comes down to print quality when i want to pick which print house to print my photos. sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. personally, i was impressed with saal's final book and i'll break it down for you.\n\nas for the cover, the leather cover felt premium and not cheap. it has a non-noticeable nice smell. the binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). the spine looks fine and sturdy. you can print on the first page glued to the front and back cover if you choose to do so.\n\nthe pages themselves feel thick since they are two prints glued back to back together. the glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nthe color rendering stayed very true to the original photos. i increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. the prints look and feel very close to what i see on the screen and print personally on an inkjet printer. looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. shadows are not lost too, the subtle different tones are still rendered as i wanted which was quite surprising to me.\n\nlooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nyou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). the contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. this may be due to the continuous tone of ra-4 printing with this paper vs inkjet printing for example.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\ndeep shadows and subtle tones rendering looks amazing in color photographs too. like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# summary\n\nall in all, i was very pleased with the quality of the book and prints. the professional line photobook product did indeed feel professional and premium. the color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nthe one thing that i felt missing is offering other types of paper for books, as fuji crystal archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. for me, i love the crystal archive paper and use it personally. \n\nanother thing to note is that i capped the max number of pages allowed at 130 pages. the software wouldn't let me add more pages after that. this restriction may exist to ensure \"layflat binding\" would work.", "sortedWord": "None", "Identifyer": null, "identifyer": 85240, "year": "2020"}, {"autor": "argusromblei", "date": "2020-11-18 21:03:52", "content": "Pro photographers with successful portfolio print websites, I need some insight. /!/ \nI’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. Need a mix of experience to help start my own website.\n\nDoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nIs your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? Do you choose a certain resolution and do your photos get stolen lifted from your site? \n\nI’m highly experienced in wordpress themes and have picked a bunch I like from themeforest but need some personal experiences before I design my photo website.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/jwoeak/pro_photographers_with_successful_portfolio_print/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "pro photographers with successful portfolio print websites, i need some insight. /!/ \ni’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. need a mix of experience to help start my own website.\n\ndoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nis your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? do you choose a certain resolution and do your photos get stolen lifted from your site? \n\n-----> i !!! ’m highly experienced in wordpress themes and have picked a bunch -----> i !!!  like from themeforest but need some personal experiences before -----> i !!!  -----> design !!!  my photo website.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 86748, "year": "2020"}, {"autor": "goodvibes_alacarte", "date": "2020-10-21 23:31:28", "content": "Design your dream camera system /!/ Disregarding internal electronics, if you could design your dream camera system from the ground up—any shape, size , layout, lens system, etc.—how would it look?", "link": "https://www.reddit.com/r/photography/comments/jfoalm/design_your_dream_camera_system/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  your dream camera system /!/ disregarding internal electronics, if you could design your dream camera system from the ground up—any shape, size , layout, lens system, etc.—how would it look?", "sortedWord": "None", "Identifyer": null, "identifyer": 90805, "year": "2020"}], "name": "designphotography2020"}