{"interestingcomments": [{"autor": "Fandyus", "date": "2020-04-18 21:20:11", "content": "Any other individuals here interested in experimental photography techniques (computational imaging, DIY macro, weird and vintage lenses, odd filmstocks etc.)? I want to start a sub dedicated to it, but I'm not sure if there's enough folks who would be interested. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g3vanq/any_other_individuals_here_interested_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any other individuals here interested in experimental photography techniques (computational imaging, -----> diy !!!  macro, weird and vintage lenses, odd filmstocks etc.)? i want to start a sub dedicated to it, but i'm not sure if there's enough folks who would be interested. /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 59230, "year": "2020"}, {"autor": "FinnedSgang", "date": "2020-08-05 07:57:47", "content": "Feiyutech SPG2 gimbal with a mirrorless camera /!/ Hi Everyone  \nI have a Feiyutech SPG2 gimbal made for smartphones, so with clips made to accommodate smartphones of different sizes. I never used it so much, so I was thinking to convert it in a mirrorless gimbal, just for fun, no pretending to be professional or other. Is there an accessory or a DIY mod that I can use to transform the clip in a support for the camera?", "link": "https://www.reddit.com/r/photography/comments/i417sk/feiyutech_spg2_gimbal_with_a_mirrorless_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "feiyutech spg2 gimbal with a mirrorless camera /!/ hi everyone  \ni have a feiyutech spg2 gimbal made for smartphones, so with clips made to accommodate smartphones of different sizes. i never used it so much, so i was thinking to convert it in a mirrorless gimbal, just for fun, no pretending to be professional or other. is there an accessory or a -----> diy !!!  mod that i can use to transform the clip in a support for the camera?", "sortedWord": "None", "Identifyer": null, "identifyer": 59683, "year": "2020"}, {"autor": "dstlouis", "date": "2020-12-29 17:28:55", "content": "DIY/Pro Product Photography Tips", "link": "https://www.reddit.com/r/photography/comments/kmipa4/diypro_product_photography_tips/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!! /pro product photography tips", "sortedWord": "None", "Identifyer": null, "identifyer": 59939, "year": "2020"}, {"autor": "shian243", "date": "2020-02-05 05:14:39", "content": "More specs on the Godox AD1200Pro released by Pixapro - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/ez4aj0/more_specs_on_the_godox_ad1200pro_released_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "more specs on the godox ad1200pro released by pixapro - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 60616, "year": "2020"}, {"autor": "[deleted]", "date": "2020-06-11 15:28:50", "content": "DIY inexpensive memory card holder. Is this a safe way to store your cards? /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/h11goh/diy_inexpensive_memory_card_holder_is_this_a_safe/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  inexpensive memory card holder. is this a safe way to store your cards? /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 60962, "year": "2020"}, {"autor": "shian243", "date": "2020-09-28 07:53:15", "content": "I'm a little annoyed that many photography related products pivot towards macbooks rather than both macbook and windows laptops /!/ I say a little annoyed because I can still work with the tiny differences in compatibility and size of products. Like the jerk stopper I got, yea it's meant for macbook but they could had at least made one for Windows laptops? \n\nI've asked a few companies, and they seem to only do products that fit exactly 15 inch macbook or 13 inch macbook, whereas if you are like me who used a windows laptop for tethering, you have to DIY or modify it to fit your workflow.\n\nI've asked companies like iworkcase, look up tethertools and innovativ and they offer their products standardised to macbooks. Now, I'm not blaming them, it's probably easier as a manufacturer without having to have a few products of the same product to fit different laptops, but it'll be really nice for me and many others who use Windows laptops for tethering and work. Besides, they stand to gain more customers but I guess its not important enough for them. \n\nI know, macbooks and iMacs are the industry standard. I've used them, I just don't like the work flow with macbooks and I use Windows for other stuff like gaming. But there are plenty of people using non-mac os for photography work. \n\nAnd they'll also have to just pray that Apple doesn't come up with new hardware or make old hardware redundant with their current products because that will just make people upset.", "link": "https://www.reddit.com/r/photography/comments/j17wtt/im_a_little_annoyed_that_many_photography_related/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm a little annoyed that many photography related products pivot towards macbooks rather than both macbook and windows laptops /!/ i say a little annoyed because i can still work with the tiny differences in compatibility and size of products. like the jerk stopper i got, yea it's meant for macbook but they could had at least made one for windows laptops? \n\ni've asked a few companies, and they seem to only do products that fit exactly 15 inch macbook or 13 inch macbook, whereas if you are like me who used a windows laptop for tethering, you have to -----> diy !!!  or modify it to fit your workflow.\n\ni've asked companies like iworkcase, look up tethertools and innovativ and they offer their products standardised to macbooks. now, i'm not blaming them, it's probably easier as a manufacturer without having to have a few products of the same product to fit different laptops, but it'll be really nice for me and many others who use windows laptops for tethering and work. besides, they stand to gain more customers but i guess its not important enough for them. \n\ni know, macbooks and imacs are the industry standard. i've used them, i just don't like the work flow with macbooks and i use windows for other stuff like gaming. but there are plenty of people using non-mac os for photography work. \n\nand they'll also have to just pray that apple doesn't come up with new hardware or make old hardware redundant with their current products because that will just make people upset.", "sortedWord": "None", "Identifyer": null, "identifyer": 61476, "year": "2020"}, {"autor": "spacemishka", "date": "2020-09-27 16:34:16", "content": "Who does create diy-stuff for their Camera?", "link": "https://www.reddit.com/r/photography/comments/j0u3j4/who_does_create_diystuff_for_their_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "who does create -----> diy !!! -stuff for their camera?", "sortedWord": "None", "Identifyer": null, "identifyer": 61512, "year": "2020"}, {"autor": "photoshark0", "date": "2020-10-16 04:56:01", "content": "Question - fake ice for beverage photography /!/ Is there a rule of thumb or generally preferred look in beverage photography when it comes to ice clarity? I am new to styling and pretty new to this type of photography (ive been shooting other things for over 15 years), and I cant seem to find any clarification here. It seems that all kinds of ice shapes, with air bubbles and without, etc. \n\nI also purchased some low-end acrylic ice, it has air bubbles and is a more organic type shape compared to the average mold. I bought a large cube mold and plan on attempting a DIY to make my own fake ice, but I dont know if very clear ice will look bad. Any assistance appreciated!", "link": "https://www.reddit.com/r/photography/comments/jc3m5x/question_fake_ice_for_beverage_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "question - fake ice for beverage photography /!/ is there a rule of thumb or generally preferred look in beverage photography when it comes to ice clarity? i am new to styling and pretty new to this type of photography (ive been shooting other things for over 15 years), and i cant seem to find any clarification here. it seems that all kinds of ice shapes, with air bubbles and without, etc. \n\ni also purchased some low-end acrylic ice, it has air bubbles and is a more organic type shape compared to the average mold. i bought a large cube mold and plan on attempting a -----> diy !!!  to make my own fake ice, but i dont know if very clear ice will look bad. any assistance appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 61643, "year": "2020"}, {"autor": "doubleknotshoelace", "date": "2020-02-22 17:52:01", "content": "DIY Trekpak in Harbor Freight 3800 case /!/ [DIY Trekpak](https://i.imgur.com/DHq1fyl.jpg)\nMade this with one sheet of Coroplast from Michael's and some 2mm and 3mm foam and bobby pins to connect. This is just for storage so I'm not planning on traveling with the case. And now I have more space in my camera bag for bodies.", "link": "https://www.reddit.com/r/photography/comments/f7vzvs/diy_trekpak_in_harbor_freight_3800_case/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  trekpak in harbor freight 3800 case /!/ [diy trekpak](https://i.imgur.com/dhq1fyl.jpg)\nmade this with one sheet of coroplast from michael's and some 2mm and 3mm foam and bobby pins to connect. this is just for storage so i'm not planning on traveling with the case. and now i have more space in my camera bag for bodies.", "sortedWord": "None", "Identifyer": null, "identifyer": 62217, "year": "2020"}, {"autor": "doubleknotshoelace", "date": "2020-02-22 17:11:26", "content": "DIY Trekpak in Harbor Freight hard case", "link": "https://www.reddit.com/r/photography/comments/f7ve5g/diy_trekpak_in_harbor_freight_hard_case/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  trekpak in harbor freight hard case", "sortedWord": "None", "Identifyer": null, "identifyer": 62221, "year": "2020"}, {"autor": "HEVIHITR", "date": "2020-04-08 14:08:19", "content": "Looking for a cheap split diopter for 67mm lens. /!/ So yeah I know split diopters are kinda gimmicky, but I'm into unusual shots and I figured why not, this was about 6 months ago and back then my primary lens was a 30mm sony lens, 49mm thread, now I've kind of moved up and my daily is a 16mm and it's 67mm, seems as though split diopters are a little harder to find in that thread size, in any reasonable price range anyway, I found a brand that used to sell them, kood I think, and hoya made one too, but trying to find stock is a little tricky, I was thing of going diy, being stuck at home makes things trickier too, any ideas, resources would be great, I'm OK with ghettoing something, I saw mention of using a cokin style filter possible hand hend, anyway any ideas are welcome.", "link": "https://www.reddit.com/r/photography/comments/fx739h/looking_for_a_cheap_split_diopter_for_67mm_lens/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "looking for a cheap split diopter for 67mm lens. /!/ so yeah i know split diopters are kinda gimmicky, but i'm into unusual shots and i figured why not, this was about 6 months ago and back then my primary lens was a 30mm sony lens, 49mm thread, now i've kind of moved up and my daily is a 16mm and it's 67mm, seems as though split diopters are a little harder to find in that thread size, in any reasonable price range anyway, i found a brand that used to sell them, kood i think, and hoya made one too, but trying to find stock is a little tricky, i was thing of going -----> diy !!! , being stuck at home makes things trickier too, any ideas, resources would be great, i'm ok with ghettoing something, i saw mention of using a cokin style filter possible hand hend, anyway any ideas are welcome.", "sortedWord": "None", "Identifyer": null, "identifyer": 62729, "year": "2020"}, {"autor": "RubyScorpion", "date": "2020-05-22 23:13:34", "content": "What differentiates a \"professional\" studio setup from a \"DIY\" one? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gou226/what_differentiates_a_professional_studio_setup/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what differentiates a \"professional\" studio setup from a \"-----> diy !!! \" one? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 63664, "year": "2020"}, {"autor": "Mr_Drizz", "date": "2020-07-16 20:45:03", "content": "Fake-Pan, for when you don't have a real X-pan /!/ I really wish Fujifilm would give us the option of selecting the classic X-pan aspect ration. It would make framing up a lot less like guesswork.\n\nI'm sure they can, doesn't the GRX series of cameras have it?\n\nUntil they do I guess I'll have to stick to my DIY version :D\n\n[Fake-Pan](https://preview.redd.it/bbjh84us6ab51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=eb032507d3907690b94a3d95084cba4b3a265bca)", "link": "https://www.reddit.com/r/photography/comments/hshzvo/fakepan_for_when_you_dont_have_a_real_xpan/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "fake-pan, for when you don't have a real x-pan /!/ i really wish fujifilm would give us the option of selecting the classic x-pan aspect ration. it would make framing up a lot less like guesswork.\n\ni'm sure they can, doesn't the grx series of cameras have it?\n\nuntil they do i guess i'll have to stick to my -----> diy !!!  version :d\n\n[fake-pan](https://preview.redd.it/bbjh84us6ab51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=eb032507d3907690b94a3d95084cba4b3a265bca)", "sortedWord": "None", "Identifyer": null, "identifyer": 64141, "year": "2020"}, {"autor": "shian243", "date": "2020-07-16 15:35:23", "content": "Profoto AirX lets you shoot your iPhone with the Profoto B10 at up to 1/25,000 of a second - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/hsbrbk/profoto_airx_lets_you_shoot_your_iphone_with_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "profoto airx lets you shoot your iphone with the profoto b10 at up to 1/25,000 of a second - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 64182, "year": "2020"}, {"autor": "Nibroc99", "date": "2020-07-08 06:00:46", "content": "Trying this one more time, auto-mod keeps taking my post down for not having context...? This is not an ad, I'm not selling these; just wanted to share my idea. Adjustable survival bracelet wrist-strap for my Nikon D3500, with clip for quick-release. Two half hitches used for adjustable wrist size. /!/ https://i.imgur.com/HInrwEt.jpg\n\nI understand that this isn't a 100% original idea, but I haven't seen this idea with a double-half-hitch knot being used as a slip knot to allow for adjustability!  Thought it was a fun idea, and it's a nice easy DIY project.\n\nAlso, idk why my post keeps getting taken down for \"not having enough context.\"  How much context does the auto-mod require!?  Sheesh.", "link": "https://www.reddit.com/r/photography/comments/hnbnlu/trying_this_one_more_time_automod_keeps_taking_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "trying this one more time, auto-mod keeps taking my post down for not having context...? this is not an ad, i'm not selling these; just wanted to share my idea. adjustable survival bracelet wrist-strap for my nikon d3500, with clip for quick-release. two half hitches used for adjustable wrist size. /!/ https://i.imgur.com/hinrwet.jpg\n\ni understand that this isn't a 100% original idea, but i haven't seen this idea with a double-half-hitch knot being used as a slip knot to allow for adjustability!  thought it was a fun idea, and it's a nice easy -----> diy !!!  project.\n\nalso, idk why my post keeps getting taken down for \"not having enough context.\"  how much context does the auto-mod require!?  sheesh.", "sortedWord": "None", "Identifyer": null, "identifyer": 64280, "year": "2020"}, {"autor": "luivithania", "date": "2020-08-13 22:28:09", "content": "DIY Tools and Methods? /!/ A thing I've come across a lot is people thinking there's a high paywall if you want to get started in photography. Lights, diffusers, lenses, etc. I'll admit even I thought this way for a while. \n\nBut struggling artists will find a way. That being said, what are some cheap DIY hacks you've used to overcome having \"proper\" gear? Tricks and methods that make the process easier, life hacks pertaining to the field, anything to help someone who might not be able to drop cold hard cash on accessories, and so on.\n\nLet's help our friends out!", "link": "https://www.reddit.com/r/photography/comments/i99snn/diy_tools_and_methods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  tools and methods? /!/ a thing i've come across a lot is people thinking there's a high paywall if you want to get started in photography. lights, diffusers, lenses, etc. i'll admit even i thought this way for a while. \n\nbut struggling artists will find a way. that being said, what are some cheap diy hacks you've used to overcome having \"proper\" gear? tricks and methods that make the process easier, life hacks pertaining to the field, anything to help someone who might not be able to drop cold hard cash on accessories, and so on.\n\nlet's help our friends out!", "sortedWord": "None", "Identifyer": null, "identifyer": 64361, "year": "2020"}, {"autor": "ThePancakeChair", "date": "2020-09-08 13:29:52", "content": "DIY laminate recommendations? /!/ I bought some canvas prints recently without laminate - with the intention of doing the lamination myself (I'd get decent use out of it between photos and paintings). Any recommendations for particular lamination products? I'm not dead-set on spray, roll, etc. Whatever works and is recommended.", "link": "https://www.reddit.com/r/photography/comments/iotki4/diy_laminate_recommendations/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  laminate recommendations? /!/ i bought some canvas prints recently without laminate - with the intention of doing the lamination myself (i'd get decent use out of it between photos and paintings). any recommendations for particular lamination products? i'm not dead-set on spray, roll, etc. whatever works and is recommended.", "sortedWord": "None", "Identifyer": null, "identifyer": 64688, "year": "2020"}, {"autor": "bflbfl", "date": "2020-09-17 23:48:10", "content": "Simple lighting tweaks for deep-set eyes (male)? /!/ I've got really deep-set (blue) eyes, and am playing with how best to tweak lighting to bring them out more for self-tapes.  I'm a guy and want to avoid makeup in this case.   (I realize this is a photography subreddit, but am assuming approach is similar).\n\nIs something like a curved reflector thing (or DIY facsimile) probably the best option?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/iuv7m4/simple_lighting_tweaks_for_deepset_eyes_male/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "simple lighting tweaks for deep-set eyes (male)? /!/ i've got really deep-set (blue) eyes, and am playing with how best to tweak lighting to bring them out more for self-tapes.  i'm a guy and want to avoid makeup in this case.   (i realize this is a photography subreddit, but am assuming approach is similar).\n\nis something like a curved reflector thing (or -----> diy !!!  facsimile) probably the best option?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 64810, "year": "2020"}, {"autor": "BlackStarCorona", "date": "2020-10-26 02:57:48", "content": "Rgb strips to replace gels /!/ I’ve gone a good amount of gel lighting in my photography, mostly in boudoir and portraiture. I also do videography shoots but they’re not my main focus. I use speed lights, not studio lighting. \n\nI got into a rabbit hole the last two days about RGB LED bars/Wands and was thinking they could be a very good substitute for gelled lighting in the studio and on site. \n\nWhat initially caught my eye was the ColorSpike, but I found very few reviews/usage videos on YouTube and when looking at the Kickstarter that funded the product I found a LOT of the backers were left out to dry when the product broke after a few uses or the internal battery quit charging in under two years. \n\nSome of the ones I’ve found have built in barn doors which would be amazing. Some have a full spectrum of color and some only do 9 or 12 predetermined color sets. \n\nMy question is do any of y’all have experience with these products? Are the wands going to give the brightness I need in a shoot if I’m shootings full body? I’ve seen several DIY options where people have made them as large as 8ft tall, but again I’m concerned about brightness. \n\nI just like the idea of dialing in a color instead of halting the shoot to change gels. \n\nI would love any recommendations as I’d like to buy at least two before the year is out but I don’t want to spend a ton of money on a product that won’t do what I need.", "link": "https://www.reddit.com/r/photography/comments/ji6y9k/rgb_strips_to_replace_gels/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "rgb strips to replace gels /!/ i’ve gone a good amount of gel lighting in my photography, mostly in boudoir and portraiture. i also do videography shoots but they’re not my main focus. i use speed lights, not studio lighting. \n\ni got into a rabbit hole the last two days about rgb led bars/wands and was thinking they could be a very good substitute for gelled lighting in the studio and on site. \n\nwhat initially caught my eye was the colorspike, but i found very few reviews/usage videos on youtube and when looking at the kickstarter that funded the product i found a lot of the backers were left out to dry when the product broke after a few uses or the internal battery quit charging in under two years. \n\nsome of the ones i’ve found have built in barn doors which would be amazing. some have a full spectrum of color and some only do 9 or 12 predetermined color sets. \n\nmy question is do any of y’all have experience with these products? are the wands going to give the brightness i need in a shoot if i’m shootings full body? i’ve seen several -----> diy !!!  options where people have made them as large as 8ft tall, but again i’m concerned about brightness. \n\ni just like the idea of dialing in a color instead of halting the shoot to change gels. \n\ni would love any recommendations as i’d like to buy at least two before the year is out but i don’t want to spend a ton of money on a product that won’t do what i need.", "sortedWord": "None", "Identifyer": null, "identifyer": 65731, "year": "2020"}, {"autor": "shabutie8", "date": "2020-10-26 02:14:27", "content": "Does anyone know where I can get a pinspot light with a controllable aperture size and brightness? /!/ [I found this.](https://www.amazon.com/dp/B07FKQD8F2/?coliid=I1DXJC4WNGP2AK&amp;colid=3DXGBJL2QX0NA&amp;psc=1&amp;ref_=lv_ov_lig_dp_it) but it's designed for stage stuff. I want something I can use to help me manipulate color data on a subject for some artsy in camera fuckery.   \n\n\nI also want something I can mount jells to. Any ideas? or should i just break out the old 3d printer for some DIY solution.", "link": "https://www.reddit.com/r/photography/comments/ji6atg/does_anyone_know_where_i_can_get_a_pinspot_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "does anyone know where i can get a pinspot light with a controllable aperture size and brightness? /!/ [i found this.](https://www.amazon.com/dp/b07fkqd8f2/?coliid=i1dxjc4wngp2ak&amp;colid=3dxgbjl2qx0na&amp;psc=1&amp;ref_=lv_ov_lig_dp_it) but it's designed for stage stuff. i want something i can use to help me manipulate color data on a subject for some artsy in camera fuckery.   \n\n\ni also want something i can mount jells to. any ideas? or should i just break out the old 3d printer for some -----> diy !!!  solution.", "sortedWord": "None", "Identifyer": null, "identifyer": 65734, "year": "2020"}, {"autor": "arielestulin", "date": "2020-01-25 17:42:17", "content": "DIY Trekpak for under $20 (2020 Update) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/etttfu/diy_trekpak_for_under_20_2020_update/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  trekpak for under $20 (2020 update) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 68213, "year": "2020"}, {"autor": "mykbz", "date": "2020-01-30 01:45:53", "content": "Does anyone know of ProMist filter alternatives for those on a budget? /!/ I'd love to have a selection of ProMist filters but given they are £120+ each, I'm  wondering if there is an alternative that's a bit easier on the wallet?\n\nPlease don't recommend things like vaseline on the lens or stretch tights over the front, I'm looking for something a bit less 'DIY'.", "link": "https://www.reddit.com/r/photography/comments/evxh01/does_anyone_know_of_promist_filter_alternatives/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "does anyone know of promist filter alternatives for those on a budget? /!/ i'd love to have a selection of promist filters but given they are £120+ each, i'm  wondering if there is an alternative that's a bit easier on the wallet?\n\nplease don't recommend things like vaseline on the lens or stretch tights over the front, i'm looking for something a bit less '-----> diy !!! '.", "sortedWord": "None", "Identifyer": null, "identifyer": 68342, "year": "2020"}, {"autor": "authenticards", "date": "2020-06-23 06:12:10", "content": "DIY black flags /!/ Hey guys I was wondering what is the best material to use if one is trying to make a black flag. Something that is affordable would be my preference, so black muslin is a bit pricey for me.", "link": "https://www.reddit.com/r/photography/comments/he99nj/diy_black_flags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  black flags /!/ hey guys i was wondering what is the best material to use if one is trying to make a black flag. something that is affordable would be my preference, so black muslin is a bit pricey for me.", "sortedWord": "None", "Identifyer": null, "identifyer": 69957, "year": "2020"}, {"autor": "rachelkjklumprq", "date": "2020-07-15 23:11:32", "content": "9 Best Passport Photo Apps In 2020 To DIY And Save Money | HomiesFoto", "link": "https://www.reddit.com/r/photography/comments/hrydsm/9_best_passport_photo_apps_in_2020_to_diy_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "9 best passport photo apps in 2020 to -----> diy !!!  and save money | homiesfoto", "sortedWord": "None", "Identifyer": null, "identifyer": 70152, "year": "2020"}, {"autor": "anonymoooooooose", "date": "2020-07-12 13:48:45", "content": "Astrophotographers can capture the Comet NEOWISE right now - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/hpunqr/astrophotographers_can_capture_the_comet_neowise/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "astrophotographers can capture the comet neowise right now - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 70323, "year": "2020"}, {"autor": "[deleted]", "date": "2020-07-07 01:17:34", "content": "Better Beamer DIY: I bought a replacement lens for $10 and saved money by not having to buy the $37 product which includes plastic pieces that I made myself using a sheet of plastic and a heat gun. /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/hmkwco/better_beamer_diy_i_bought_a_replacement_lens_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "better beamer -----> diy !!! : i bought a replacement lens for $10 and saved money by not having to buy the $37 product which includes plastic pieces that i made myself using a sheet of plastic and a heat gun. /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 70799, "year": "2020"}, {"autor": "anonymoooooooose", "date": "2020-08-21 00:49:11", "content": "DIY Gobo Holder | Petri Damstén", "link": "https://www.reddit.com/r/photography/comments/idmr2j/diy_gobo_holder_petri_damstén/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  gobo holder | petri damstén", "sortedWord": "None", "Identifyer": null, "identifyer": 70846, "year": "2020"}, {"autor": "dreamsindigital01", "date": "2020-09-03 18:25:44", "content": "DIY fishline flare line suggestions /!/ I'm interested in playing around with the DIY technique of using fishing line over a lens to create long anamorphic style lens flare. \n\nI'm wondering if anyone has tested and documented the results from using various gauge, color, and construction of line. I'm keen to purchase a cheap spook of .3 gauge clear line, but does it matter if it's monofilament or braided? Blue? Neon green? How much will the line color affect the flare? Does braided scatter more light or deflect it? You get the idea.\n\nAny insight is appreciated! Thanks", "link": "https://www.reddit.com/r/photography/comments/ilz3ce/diy_fishline_flare_line_suggestions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  fishline flare line suggestions /!/ i'm interested in playing around with the diy technique of using fishing line over a lens to create long anamorphic style lens flare. \n\ni'm wondering if anyone has tested and documented the results from using various gauge, color, and construction of line. i'm keen to purchase a cheap spook of .3 gauge clear line, but does it matter if it's monofilament or braided? blue? neon green? how much will the line color affect the flare? does braided scatter more light or deflect it? you get the idea.\n\nany insight is appreciated! thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 71201, "year": "2020"}, {"autor": "jatinxsharmaa", "date": "2020-09-17 11:13:33", "content": "How to make Professional studio light in 30 Minutes | DIY SOFTBOX LIGHT", "link": "https://www.reddit.com/r/photography/comments/iuhejp/how_to_make_professional_studio_light_in_30/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to make professional studio light in 30 minutes | -----> diy !!!  softbox light", "sortedWord": "None", "Identifyer": null, "identifyer": 71255, "year": "2020"}, {"autor": "Argonaut_11", "date": "2020-07-29 18:12:35", "content": "DIY: Color Gels for your Godox / Flashpoint AD200", "link": "https://www.reddit.com/r/photography/comments/i05ig6/diy_color_gels_for_your_godox_flashpoint_ad200/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!! : color gels for your godox / flashpoint ad200", "sortedWord": "None", "Identifyer": null, "identifyer": 71947, "year": "2020"}, {"autor": "Jrose152", "date": "2020-10-13 23:39:19", "content": "DIY lens elements recalibration? Blurry edges after drop. /!/ https://www.dropbox.com/sh/90g3pg37zjhobyb/AADvvcnBJ2mpbjlOVmwrshKza?dl=0\n\nI gotta nikon 70-300mm lens for basically free that did not focus. It was dropped by the previous owner. I took it apart and fixed the focus mechanism as it was shifted to the side and jammed. I put it back together and everything is fine except the photos are blurry around the edges which leads me to believe the elements have shifted. I know you can send it into nikon but I literally can't find any information online on how to attempt this at home DIY. Any tips if this is doable?.", "link": "https://www.reddit.com/r/photography/comments/jap9qb/diy_lens_elements_recalibration_blurry_edges/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  lens elements recalibration? blurry edges after drop. /!/ https://www.dropbox.com/sh/90g3pg37zjhobyb/aadvvcnbj2mpbjlovmwrshkza?dl=0\n\ni gotta nikon 70-300mm lens for basically free that did not focus. it was dropped by the previous owner. i took it apart and fixed the focus mechanism as it was shifted to the side and jammed. i put it back together and everything is fine except the photos are blurry around the edges which leads me to believe the elements have shifted. i know you can send it into nikon but i literally can't find any information online on how to attempt this at home diy. any tips if this is doable?.", "sortedWord": "None", "Identifyer": null, "identifyer": 72427, "year": "2020"}, {"autor": "HandelmanPhotography", "date": "2020-12-13 23:46:41", "content": "Advice for making a camera backpack more comfortable? /!/ I recently bought the Lowepro Freeline 350 after doing a lot of research.  I was finally able to take it out today for a few hours.  With one body, two lenses, and a travel tripod the bag was not as comfortable as I had hoped and as others have said.  I was able to adjust it to get most of the weight in the hips with the straps.  Only problem is they have very thin waist straps.  I knew that going in, but everything else about the bag seemed really good so I figured I'd be fine.\n\nAnyway, Lowepro doesn't sell any kind of strap replacement.  Does anyone have any advice to increase comfort, or to create some kind of DIY waist strap so the weight that I carry can be more comfortable?", "link": "https://www.reddit.com/r/photography/comments/kclsa6/advice_for_making_a_camera_backpack_more/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "advice for making a camera backpack more comfortable? /!/ i recently bought the lowepro freeline 350 after doing a lot of research.  i was finally able to take it out today for a few hours.  with one body, two lenses, and a travel tripod the bag was not as comfortable as i had hoped and as others have said.  i was able to adjust it to get most of the weight in the hips with the straps.  only problem is they have very thin waist straps.  i knew that going in, but everything else about the bag seemed really good so i figured i'd be fine.\n\nanyway, lowepro doesn't sell any kind of strap replacement.  does anyone have any advice to increase comfort, or to create some kind of -----> diy !!!  waist strap so the weight that i carry can be more comfortable?", "sortedWord": "None", "Identifyer": null, "identifyer": 73001, "year": "2020"}, {"autor": "sean-mac-tire", "date": "2020-12-26 21:39:55", "content": "images very under exposed on nikon d3200 and colour tint to skin /!/ guys so I had a practice portrait shoot the other day. subject was about 4 feet from a black back drop. I was about 10 or 15 feet in front of the subject. i had a speed light about 3 or 4 feet at 45 degrees in front and above the subject. I was looking to do a low key shoot. \n\nwhen I imported the raw file into Lightroom they were extremely under exposed. on camera screen the \"blinkies\" for highlights didnt show so I assumed I was not under exposed. but when in Light Room I had to lift the exposure by anything from +2 to +4 depending on what flash speed I had used. I was shooting F4 T1/200 ISO100. spawn light varied between 1/16 and 1/64. \n\nwhat am I missing in relation to the exposure to get a better brighter image? I dont usually use the histogram because honestly I'm not familiar on how to use it. should I focus on that? looking back at my images in camera today I can see the histogram was for sure to the right and not more centred. \n\nsecond issue is this particular person no matter what  I do I always end up with a colour tint on their skin. in the face it usually has a lot of red. not whiskey nose red but definitely a slight colour case. but then their hands have a pale blue cast. they are very pale skinned to begin with so I'm thinking the red case on the face may be their makeup? so should I asked them not to add that tone to their makeup next time? from speaking to them they do apply some sort of base layer (in DIY terms I'd call it a primer lol).\n\nthis person doesn't do social media and wont agree to me posting images I'm afraid, they are extremely private otherwise I'd share a same unprocessed.", "link": "https://www.reddit.com/r/photography/comments/kkqj5z/images_very_under_exposed_on_nikon_d3200_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "images very under exposed on nikon d3200 and colour tint to skin /!/ guys so i had a practice portrait shoot the other day. subject was about 4 feet from a black back drop. i was about 10 or 15 feet in front of the subject. i had a speed light about 3 or 4 feet at 45 degrees in front and above the subject. i was looking to do a low key shoot. \n\nwhen i imported the raw file into lightroom they were extremely under exposed. on camera screen the \"blinkies\" for highlights didnt show so i assumed i was not under exposed. but when in light room i had to lift the exposure by anything from +2 to +4 depending on what flash speed i had used. i was shooting f4 t1/200 iso100. spawn light varied between 1/16 and 1/64. \n\nwhat am i missing in relation to the exposure to get a better brighter image? i dont usually use the histogram because honestly i'm not familiar on how to use it. should i focus on that? looking back at my images in camera today i can see the histogram was for sure to the right and not more centred. \n\nsecond issue is this particular person no matter what  i do i always end up with a colour tint on their skin. in the face it usually has a lot of red. not whiskey nose red but definitely a slight colour case. but then their hands have a pale blue cast. they are very pale skinned to begin with so i'm thinking the red case on the face may be their makeup? so should i asked them not to add that tone to their makeup next time? from speaking to them they do apply some sort of base layer (in -----> diy !!!  terms i'd call it a primer lol).\n\nthis person doesn't do social media and wont agree to me posting images i'm afraid, they are extremely private otherwise i'd share a same unprocessed.", "sortedWord": "None", "Identifyer": null, "identifyer": 73127, "year": "2020"}, {"autor": "boyn3xtdoor", "date": "2020-12-26 17:45:40", "content": "Dora Goodman Zone | Film /!/ Has anyone had any experience using the Dora Goodman Zone? It’s an open source project - a diy medium format camera. Does anyone regularly shoot with one of these? If you do can you tell me a little about your experience with it?", "link": "https://www.reddit.com/r/photography/comments/kkmheu/dora_goodman_zone_film/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "dora goodman zone | film /!/ has anyone had any experience using the dora goodman zone? it’s an open source project - a -----> diy !!!  medium format camera. does anyone regularly shoot with one of these? if you do can you tell me a little about your experience with it?", "sortedWord": "None", "Identifyer": null, "identifyer": 73151, "year": "2020"}, {"autor": "GAGARIN0461", "date": "2020-11-11 17:33:29", "content": "Lenses for DIY medium format camera, or alternatives to Mamiya Press lenses /!/ I'm looking to design and build a Hasselblad inspired medium format camera. I'm trying to go for the easiest possible design. Most DIY MF cameras seem to use Mamiya Press lenses because of the shutter.\n\nWhat are some alternatives to the Mamiya Press lenses, that are suitable for a project like this? I was inspired by [Dora Goodman](https://www.doragoodman.com) cameras. \n\nI want to shoot film, of course, and I'd like to use it held in hand, and not using it on a tripod.", "link": "https://www.reddit.com/r/photography/comments/jscizq/lenses_for_diy_medium_format_camera_or/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lenses for -----> diy !!!  medium format camera, or alternatives to mamiya press lenses /!/ i'm looking to design and build a hasselblad inspired medium format camera. i'm trying to go for the easiest possible design. most diy mf cameras seem to use mamiya press lenses because of the shutter.\n\nwhat are some alternatives to the mamiya press lenses, that are suitable for a project like this? i was inspired by [dora goodman](https://www.doragoodman.com) cameras. \n\ni want to shoot film, of course, and i'd like to use it held in hand, and not using it on a tripod.", "sortedWord": "None", "Identifyer": null, "identifyer": 73845, "year": "2020"}, {"autor": "robvann", "date": "2020-02-07 14:53:48", "content": "DIY Slides to iPhone technique /!/ &amp;#x200B;\n\n[Wax paper white box](https://preview.redd.it/p9kv3e1cmif41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=703fcad2af86873339378af89b6584ac3ad1c268)\n\n Easy way to get SLIDES onto your phone. Trick is to do them in a batches rather than ONE at a time. Then edit them individually in the phone! I don’t have a white light box, which would be better, but just a folded piece of wax paper with a bright light underneath works ok. Bigger batches mean lower resolution, so some I just do individually, getting as close as the focus allows with some zoom.  \nThe iPhone camera is only 7MP vs 26MP for my digital camera, so even better results can be had that way.  \nApparently there are apps that can convert 35mm colour negatives into the proper colours using the same technique.", "link": "https://www.reddit.com/r/photography/comments/f0biq1/diy_slides_to_iphone_technique/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  slides to iphone technique /!/ &amp;#x200b;\n\n[wax paper white box](https://preview.redd.it/p9kv3e1cmif41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=703fcad2af86873339378af89b6584ac3ad1c268)\n\n easy way to get slides onto your phone. trick is to do them in a batches rather than one at a time. then edit them individually in the phone! i don’t have a white light box, which would be better, but just a folded piece of wax paper with a bright light underneath works ok. bigger batches mean lower resolution, so some i just do individually, getting as close as the focus allows with some zoom.  \nthe iphone camera is only 7mp vs 26mp for my digital camera, so even better results can be had that way.  \napparently there are apps that can convert 35mm colour negatives into the proper colours using the same technique.", "sortedWord": "None", "Identifyer": null, "identifyer": 74399, "year": "2020"}, {"autor": "SATXpipe", "date": "2020-02-06 18:24:36", "content": "Suggestions for non DIY, self contained professional level photo light box? /!/ I am in need of a really nice lightbox. I have been using one very similar to this: \n\nhttps://www.amazon.com/TimmyHouse-Folding-Lightbox-Photography-Lighting/dp/B07SCV8CDW/ref=sr_1_31?keywords=lightbox+photos&amp;qid=1581013134&amp;sr=8-31\n\nWhile it has worked ok for a few years, it has some massive issues:\n\n- reflective foil like sides, no side lights\n- harsh LED overhead lighting\n\nI really need the replacement to be as self contained as possible, with side lights, and if LED lights, something either way more diffused or less harsh. Not interested in doing anything DIY, budget can be up to $350 or so if needed. Thanks!", "link": "https://www.reddit.com/r/photography/comments/ezwhpz/suggestions_for_non_diy_self_contained/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "suggestions for non -----> diy !!! , self contained professional level photo light box? /!/ i am in need of a really nice lightbox. i have been using one very similar to this: \n\nhttps://www.amazon.com/timmyhouse-folding-lightbox-photography-lighting/dp/b07scv8cdw/ref=sr_1_31?keywords=lightbox+photos&amp;qid=1581013134&amp;sr=8-31\n\nwhile it has worked ok for a few years, it has some massive issues:\n\n- reflective foil like sides, no side lights\n- harsh led overhead lighting\n\ni really need the replacement to be as self contained as possible, with side lights, and if led lights, something either way more diffused or less harsh. not interested in doing anything diy, budget can be up to $350 or so if needed. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 74483, "year": "2020"}, {"autor": "magicman21", "date": "2020-02-19 01:45:55", "content": "My $50 Pelican 1560 with DIY TrekPak", "link": "https://www.reddit.com/r/photography/comments/f6324r/my_50_pelican_1560_with_diy_trekpak/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my $50 pelican 1560 with -----> diy !!!  trekpak", "sortedWord": "None", "Identifyer": null, "identifyer": 74723, "year": "2020"}, {"autor": "magicman21", "date": "2020-02-19 14:10:53", "content": "My $30 Pelican 1560 and DIY TrekPak! /!/ Got this HUGE Pelican and SKB case lot from a liquidation center that takes in pallets of merch. A lot of this was from military use that is no longer “usable.” I paid $300 for https://imgur.com/gallery/hyhBXVQ \n\nLeft to right starting in back is 2 SKB 2918-10’s, Pelican 1650, middle is Pelican 1620, Pelican 1560, front SKB 1813-7 and Pelican 1600. \n\nThe Pelican 1560, SKB 1813-7 and Pelican 1600 I got for $20 a piece and I spent like $8 on new wheels for the 1560. \n\nI really liked the TrekPak system but didn’t want to pay to outfit all the cases with them. So I went to Michales and got a couple sheets of corrugated black plastic (20x30” for $4.50) 1/4 EVA foam sheets (.99 each,) a pack of EVA foam mats from Harbor Freight ($8.00) and 1/8” armature wire ($4.50 for 20ft) and yellow ribbon for tabs and about half the cases are outfitted and ready to go! Probably spent $60 total on insert material so far. Now I have a system on how to make dividers\n\nA lot of the cases had VERY specific custom hard foam in them for what ever gear they were transporting. So I tried to save any bottom foam and scrapped the rest. Got some 1’ cushion foam for bottom liner on the rest and now I’m rolling in style! \n\nThis is a EXTREMELY time consuming project but the savings and protection is huge in the end.", "link": "https://www.reddit.com/r/photography/comments/f6b4t3/my_30_pelican_1560_and_diy_trekpak/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my $30 pelican 1560 and -----> diy !!!  trekpak! /!/ got this huge pelican and skb case lot from a liquidation center that takes in pallets of merch. a lot of this was from military use that is no longer “usable.” i paid $300 for https://imgur.com/gallery/hyhbxvq \n\nleft to right starting in back is 2 skb 2918-10’s, pelican 1650, middle is pelican 1620, pelican 1560, front skb 1813-7 and pelican 1600. \n\nthe pelican 1560, skb 1813-7 and pelican 1600 i got for $20 a piece and i spent like $8 on new wheels for the 1560. \n\ni really liked the trekpak system but didn’t want to pay to outfit all the cases with them. so i went to michales and got a couple sheets of corrugated black plastic (20x30” for $4.50) 1/4 eva foam sheets (.99 each,) a pack of eva foam mats from harbor freight ($8.00) and 1/8” armature wire ($4.50 for 20ft) and yellow ribbon for tabs and about half the cases are outfitted and ready to go! probably spent $60 total on insert material so far. now i have a system on how to make dividers\n\na lot of the cases had very specific custom hard foam in them for what ever gear they were transporting. so i tried to save any bottom foam and scrapped the rest. got some 1’ cushion foam for bottom liner on the rest and now i’m rolling in style! \n\nthis is a extremely time consuming project but the savings and protection is huge in the end.", "sortedWord": "None", "Identifyer": null, "identifyer": 74884, "year": "2020"}, {"autor": "photoexperts", "date": "2020-03-07 15:06:33", "content": "A4 Size Ultra-Thin Portable LED Light Box Tracer LED Artcraft Tracing Light Pad Light Box w 3 Level Brightness for Artists Drawing Sketching Animation and 5D DIY Diamond Painting", "link": "https://www.reddit.com/r/photography/comments/fewabe/a4_size_ultrathin_portable_led_light_box_tracer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a4 size ultra-thin portable led light box tracer led artcraft tracing light pad light box w 3 level brightness for artists drawing sketching animation and 5d -----> diy !!!  diamond painting", "sortedWord": "None", "Identifyer": null, "identifyer": 75445, "year": "2020"}, {"autor": "tncx", "date": "2020-04-09 21:34:46", "content": "Getting great team photos for remote team /!/ The difference between average and great photos fo the \"team\" section of a company website can make a huge impact. \n\nOur team is mostly remote, and I'm looking for creative ways to get great photos of all our team members. \"Great\" doesn't necessarily mean they look like they were shot in a studio, but that they are all clear, of a cohesive style, and without distraction. \n\nWe have about 30 people. \n\nI'm open to holding a \"virtual\" photo shoot where I meet with each person via web meeting, or I'm open to a DIY option where my team self-generates the photos.", "link": "https://www.reddit.com/r/photography/comments/fy16e1/getting_great_team_photos_for_remote_team/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "getting great team photos for remote team /!/ the difference between average and great photos fo the \"team\" section of a company website can make a huge impact. \n\nour team is mostly remote, and i'm looking for creative ways to get great photos of all our team members. \"great\" doesn't necessarily mean they look like they were shot in a studio, but that they are all clear, of a cohesive style, and without distraction. \n\nwe have about 30 people. \n\ni'm open to holding a \"virtual\" photo shoot where i meet with each person via web meeting, or i'm open to a -----> diy !!!  option where my team self-generates the photos.", "sortedWord": "None", "Identifyer": null, "identifyer": 76609, "year": "2020"}, {"autor": "ankitsingh_reddit", "date": "2020-04-25 09:43:36", "content": "DIY Collapsible Backdrop /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g7qxmj/diy_collapsible_backdrop/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  collapsible backdrop /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 78378, "year": "2020"}, {"autor": "sattakamiya", "date": "2020-05-19 23:32:29", "content": "my house diy", "link": "https://www.reddit.com/r/photography/comments/gmzz2d/my_house_diy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my house -----> diy !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 79682, "year": "2020"}, {"autor": "crystalizedwolf", "date": "2020-05-19 22:12:37", "content": "Had to DIY a headshot on my iPhone for LinkedIn- Some say my eye makeup is too much, does this photo still seem professional from the eyes of headshot photographers?", "link": "https://www.reddit.com/r/photography/comments/gmyjed/had_to_diy_a_headshot_on_my_iphone_for_linkedin/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "had to -----> diy !!!  a headshot on my iphone for linkedin- some say my eye makeup is too much, does this photo still seem professional from the eyes of headshot photographers?", "sortedWord": "None", "Identifyer": null, "identifyer": 79687, "year": "2020"}, {"autor": "umer420", "date": "2020-05-19 16:44:14", "content": "Help! Can anyone tell me why my shutter blades and mirror are stuck? Is there a DIY fix for this? Images are turning up half black", "link": "https://www.reddit.com/r/photography/comments/gms6qj/help_can_anyone_tell_me_why_my_shutter_blades_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help! can anyone tell me why my shutter blades and mirror are stuck? is there a -----> diy !!!  fix for this? images are turning up half black", "sortedWord": "None", "Identifyer": null, "identifyer": 79722, "year": "2020"}, {"autor": "lsfoto", "date": "2020-07-05 19:37:36", "content": "The ultimate DIY Nikon wireless tethering tool. Built with the Raspberry Pi. For more details please check the video description. Hope you will enjoy this little project. If you like the project pls don't forget to like, share and subscribe 😉", "link": "https://www.reddit.com/r/photography/comments/hlsp30/the_ultimate_diy_nikon_wireless_tethering_tool/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the ultimate -----> diy !!!  nikon wireless tethering tool. built with the raspberry pi. for more details please check the video description. hope you will enjoy this little project. if you like the project pls don't forget to like, share and subscribe 😉", "sortedWord": "None", "Identifyer": null, "identifyer": 82242, "year": "2020"}, {"autor": "iwebman04", "date": "2020-07-28 03:32:07", "content": "Need ideas to replace lost diffusers for semi-large softboxes /!/ In moving, I’ve managed to lose diffusers for 2 somewhat large softboxes. Any suggestions on material to use to make DIY diffusers that will work very similar to the real thing? I’ve seen a few things online that just doesn’t seem realistic for my situation.", "link": "https://www.reddit.com/r/photography/comments/hz78qb/need_ideas_to_replace_lost_diffusers_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need ideas to replace lost diffusers for semi-large softboxes /!/ in moving, i’ve managed to lose diffusers for 2 somewhat large softboxes. any suggestions on material to use to make -----> diy !!!  diffusers that will work very similar to the real thing? i’ve seen a few things online that just doesn’t seem realistic for my situation.", "sortedWord": "None", "Identifyer": null, "identifyer": 83828, "year": "2020"}, {"autor": "GoBackToLeddit", "date": "2020-10-02 20:16:45", "content": "Looking for DIY ideas for a stereoscopic camera setup /!/ Soon, I will have two Canon S95 cameras which I will be using to take/record stereoscopic images/video. For the best 3D effects, I will need to be able to adjust the distance between the cameras (the greater the distance, the more intense the 3D effect), so my next purchase will be a camera bracket like this:\n\n[https://www.amazon.com/USJBGO-Bracket-10-6inch-Camera-Microphone/dp/B088PFK6MW](https://www.amazon.com/USJBGO-Bracket-10-6inch-Camera-Microphone/dp/B088PFK6MW)\n\nBut there is one final challenge: With stereoscopic photography that uses moving subjects, both images or each frame in both video streams must be in sync or you will have difficulty converging the two vantage points. Therefore, I will need to find a way to ensure that both shutter buttons are pressed simultaneously at the *exact same moment*.\n\nAnyone have any ideas on how I can get two cameras in perfect sync?", "link": "https://www.reddit.com/r/photography/comments/j42475/looking_for_diy_ideas_for_a_stereoscopic_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "looking for -----> diy !!!  ideas for a stereoscopic camera setup /!/ soon, i will have two canon s95 cameras which i will be using to take/record stereoscopic images/video. for the best 3d effects, i will need to be able to adjust the distance between the cameras (the greater the distance, the more intense the 3d effect), so my next purchase will be a camera bracket like this:\n\n[https://www.amazon.com/usjbgo-bracket-10-6inch-camera-microphone/dp/b088pfk6mw](https://www.amazon.com/usjbgo-bracket-10-6inch-camera-microphone/dp/b088pfk6mw)\n\nbut there is one final challenge: with stereoscopic photography that uses moving subjects, both images or each frame in both video streams must be in sync or you will have difficulty converging the two vantage points. therefore, i will need to find a way to ensure that both shutter buttons are pressed simultaneously at the *exact same moment*.\n\nanyone have any ideas on how i can get two cameras in perfect sync?", "sortedWord": "None", "Identifyer": null, "identifyer": 84021, "year": "2020"}, {"autor": "wewewawa", "date": "2020-11-25 20:36:01", "content": "Google Photos - Bait, meet Switch - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/k10bpi/google_photos_bait_meet_switch_diy_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "google photos - bait, meet switch - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 84259, "year": "2020"}, {"autor": "anonymoooooooose", "date": "2020-11-29 13:41:59", "content": "Here are 12 ND filters compared for color and sharpness - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/k39k00/here_are_12_nd_filters_compared_for_color_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here are 12 nd filters compared for color and sharpness - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 84670, "year": "2020"}, {"autor": "_zamm_", "date": "2020-12-02 15:14:02", "content": "Auto Play Slideshow for Website /!/ TL;DR -  I am looking for a free or one time pay way to **design a very simple** **website**. I want the main page to **play a randomized slideshow of my images**, and if the user clicks an image they can access a more **traditional gallery view**. So: user arrives at website (using any device) and gets a full screen random image, and that image will change every 5 seconds. If they click the image, they get taken to a traditional gallery view of my favorite 100 images. \n\n//\n\nI don't use social media, and just want a way to direct friends/family to my website (www.skybc.ca) which will display 100 of my favorite images, in a random order. So if someone wants to see my photos, I just point them there, but they will see something different each time they visit. This is not for business purposes, so I dont need anything fancy, no extra pages. I just want users to see my images in a random order and to have the ability to get to a gallery view. \n\nCurrently I am using Lightroom Classic, and have explored plugin route (for the Web module) but have not found anything clean and simple. There were old clunky pay modules, but nothing like what I want.\n\nWhen I googled to do this myself, some websites exist ([cincopa.com](https://cincopa.com)) which could work, or even Squarespace would fit the bill, but those are subscription model. I shouldn't have to pay ongoing fees for my simple needs. \n\nI also found I could DIY a simple version myself using this link [https://www.w3schools.com/howto/howto\\_js\\_slideshow\\_gallery.asp](https://www.w3schools.com/howto/howto_js_slideshow_gallery.asp) ... this is close to what I want but to get it where I want it would require too much coding on my part (to add the regular gallery view on click, remove the buttons etc). So this is close....\n\nWhat I currently used is the Web module of Lightroom Classic, and it works ok, but I don't like that depending on what device is used, all 101 images don't display. It also lacks the randomized full screen slides which is my main goal. \n\nMANY THANKS for your help. How can I do this on the cheap?", "link": "https://www.reddit.com/r/photography/comments/k5b0ad/auto_play_slideshow_for_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "auto play slideshow for website /!/ tl;dr -  i am looking for a free or one time pay way to **design a very simple** **website**. i want the main page to **play a randomized slideshow of my images**, and if the user clicks an image they can access a more **traditional gallery view**. so: user arrives at website (using any device) and gets a full screen random image, and that image will change every 5 seconds. if they click the image, they get taken to a traditional gallery view of my favorite 100 images. \n\n//\n\ni don't use social media, and just want a way to direct friends/family to my website (www.skybc.ca) which will display 100 of my favorite images, in a random order. so if someone wants to see my photos, i just point them there, but they will see something different each time they visit. this is not for business purposes, so i dont need anything fancy, no extra pages. i just want users to see my images in a random order and to have the ability to get to a gallery view. \n\ncurrently i am using lightroom classic, and have explored plugin route (for the web module) but have not found anything clean and simple. there were old clunky pay modules, but nothing like what i want.\n\nwhen i googled to do this myself, some websites exist ([cincopa.com](https://cincopa.com)) which could work, or even squarespace would fit the bill, but those are subscription model. i shouldn't have to pay ongoing fees for my simple needs. \n\ni also found i could -----> diy !!!  a simple version myself using this link [https://www.w3schools.com/howto/howto\\_js\\_slideshow\\_gallery.asp](https://www.w3schools.com/howto/howto_js_slideshow_gallery.asp) ... this is close to what i want but to get it where i want it would require too much coding on my part (to add the regular gallery view on click, remove the buttons etc). so this is close....\n\nwhat i currently used is the web module of lightroom classic, and it works ok, but i don't like that depending on what device is used, all 101 images don't display. it also lacks the randomized full screen slides which is my main goal. \n\nmany thanks for your help. how can i do this on the cheap?", "sortedWord": "None", "Identifyer": null, "identifyer": 84807, "year": "2020"}, {"autor": "AMPhotographer", "date": "2020-12-03 10:12:08", "content": "DIY WOOD PHOTOGRAPHY BACKDROP | Rustic background for food photography", "link": "https://www.reddit.com/r/photography/comments/k5ulqi/diy_wood_photography_backdrop_rustic_background/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  wood photography backdrop | rustic background for food photography", "sortedWord": "None", "Identifyer": null, "identifyer": 84911, "year": "2020"}, {"autor": "edwardianpug", "date": "2020-12-13 11:10:32", "content": "A DIY Jerkstopper for tethered shooting", "link": "https://www.reddit.com/r/photography/comments/kc8vy1/a_diy_jerkstopper_for_tethered_shooting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a -----> diy !!!  jerkstopper for tethered shooting", "sortedWord": "None", "Identifyer": null, "identifyer": 85168, "year": "2020"}, {"autor": "knight_rider_", "date": "2020-11-13 20:08:04", "content": "Gear Storage: DIY Custom foam punchouts for storing gear /!/ What is the foam part of this product called? Can I buy the foam with the precut punchouts without purchasing the whole case? What do I search for?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https://www.bhphotovideo.com/c/product/330231-REG/Pelican\\_1510\\_000\\_110\\_1510\\_Carry\\_On\\_Case.html](https://www.bhphotovideo.com/c/product/330231-REG/Pelican_1510_000_110_1510_Carry_On_Case.html)", "link": "https://www.reddit.com/r/photography/comments/jtn71i/gear_storage_diy_custom_foam_punchouts_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "gear storage: -----> diy !!!  custom foam punchouts for storing gear /!/ what is the foam part of this product called? can i buy the foam with the precut punchouts without purchasing the whole case? what do i search for?\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n[https://www.bhphotovideo.com/c/product/330231-reg/pelican\\_1510\\_000\\_110\\_1510\\_carry\\_on\\_case.html](https://www.bhphotovideo.com/c/product/330231-reg/pelican_1510_000_110_1510_carry_on_case.html)", "sortedWord": "None", "Identifyer": null, "identifyer": 86462, "year": "2020"}, {"autor": "spr0922", "date": "2020-06-15 21:45:05", "content": "Need to print/frame a series of photos... bad idea to do it with the same company? /!/ Hi All -- \n\nAs part of a DIY project, I'd like to print a series of 16 of my favorite photos from over the years. All the same size and frame style, and I'll be arranging them in a 4x4 rectangle on a wall in my house.\n\nI've used FrameBridge in the past for framing, but was not thrilled with their photo printing. (Seemed to come out dark, but that might've been a problem with my editing?)\n\nI'm wondering, has anybody done a project like this? I'm ready to spend decent $ (thinking $1,000USD+) on this project, but I want to be SURE that it turns out great. So, if that means printing the photos using one service, waiting for delivery, and then either shipping them back out to a framing service or bringing them in-person to a place near where I live, then I'll do that. \n\n&amp;#x200B;\n\nTLDR; Can anybody recommend a printing/framing service that does a good job on both? Or am I better off using a printing service recommended on here and then dealing with framing separately? \n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/h9plro/need_to_printframe_a_series_of_photos_bad_idea_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need to print/frame a series of photos... bad idea to do it with the same company? /!/ hi all -- \n\nas part of a -----> diy !!!  project, i'd like to print a series of 16 of my favorite photos from over the years. all the same size and frame style, and i'll be arranging them in a 4x4 rectangle on a wall in my house.\n\ni've used framebridge in the past for framing, but was not thrilled with their photo printing. (seemed to come out dark, but that might've been a problem with my editing?)\n\ni'm wondering, has anybody done a project like this? i'm ready to spend decent $ (thinking $1,000usd+) on this project, but i want to be sure that it turns out great. so, if that means printing the photos using one service, waiting for delivery, and then either shipping them back out to a framing service or bringing them in-person to a place near where i live, then i'll do that. \n\n&amp;#x200b;\n\ntldr; can anybody recommend a printing/framing service that does a good job on both? or am i better off using a printing service recommended on here and then dealing with framing separately? \n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 88904, "year": "2020"}], "name": "diyphotography2020"}