{"interestingcomments": [{"autor": "MrCameraJunkie", "date": "2019-09-21 20:54:23", "content": "( Camera Hack ) DIY Flash Mod Speed light hack budget photography", "link": "https://www.reddit.com/r/photography/comments/d7g64j/camera_hack_diy_flash_mod_speed_light_hack_budget/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "( camera hack ) -----> diy !!!  flash mod speed light hack budget photography", "sortedWord": "None", "Identifyer": null, "identifyer": 373, "year": "2019"}, {"autor": "ryansliv", "date": "2019-09-29 22:25:15", "content": "Budget friendly portable RGB light /!/ Hi everyone, I want to expand my photography skills by using external lights. I really like the way Brandon Woelfel uses colorful external lights as a lighting source so I want to do something along the lines of that (I’m not trying to copy his style, I want to utilize colorful lights to achieve the composition I want).\n\nDoes anyone know where I can get a portable RGB light that isn’t over-the-top expensive? I know of the profoto RGB lights but those are like $300 which I’m definitely not trying to spend. I really don’t want to spend more than $100 for a RGB light. I have a few ideas for a DIY setup but I am a college student so I don’t have much time to build one. Any help is appreciated!", "link": "https://www.reddit.com/r/photography/comments/db29bu/budget_friendly_portable_rgb_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "budget friendly portable rgb light /!/ hi everyone, i want to expand my photography skills by using external lights. i really like the way brandon woelfel uses colorful external lights as a lighting source so i want to do something along the lines of that (i’m not trying to copy his style, i want to utilize colorful lights to achieve the composition i want).\n\ndoes anyone know where i can get a portable rgb light that isn’t over-the-top expensive? i know of the profoto rgb lights but those are like $300 which i’m definitely not trying to spend. i really don’t want to spend more than $100 for a rgb light. i have a few ideas for a -----> diy !!!  setup but i am a college student so i don’t have much time to build one. any help is appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 615, "year": "2019"}, {"autor": "MightyBE4RD", "date": "2019-10-04 04:41:37", "content": "Hiking with a gimbal /!/ Hi guys! Will be heading to Big Bend in a couple of weeks and this will be my first time taking my gimbal (ronin sc). \n\nI don't want to hold it everywhere I go or put it in my bag (having to set it up everytime I take it out.) \n\nWhat are some tips or DIY hacks that would allow me carry it around without actually holding it for entire hikes? \n\nAppreciate the help!", "link": "https://www.reddit.com/r/photography/comments/dd2l2d/hiking_with_a_gimbal/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hiking with a gimbal /!/ hi guys! will be heading to big bend in a couple of weeks and this will be my first time taking my gimbal (ronin sc). \n\ni don't want to hold it everywhere i go or put it in my bag (having to set it up everytime i take it out.) \n\nwhat are some tips or -----> diy !!!  hacks that would allow me carry it around without actually holding it for entire hikes? \n\nappreciate the help!", "sortedWord": "None", "Identifyer": null, "identifyer": 705, "year": "2019"}, {"autor": "edtheasis", "date": "2019-10-02 01:14:11", "content": "DIY RGB LED Lightstick - Yongnuo 360 inspired /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/dc35q4/diy_rgb_led_lightstick_yongnuo_360_inspired/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  rgb led lightstick - yongnuo 360 inspired /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 838, "year": "2019"}, {"autor": "FoxKeegan", "date": "2019-10-13 00:53:08", "content": "Camera flash bulbs: Can you DIY a tiny one that's worth making? /!/ I am **not** a photographer, but figured you all would be the best ones to ask: \n\n*What's the smallest camera flash style light source that is still bright enough to be considered a camera flash?*\n\nHalloween is approaching, and I'm researching creating a prop that will require a very small, bright flash. (It's the MIB neuralizer, for those who've seen it.) I can create LED lights, but I believe they're still not bright enough for this, and know cameras have much better flash equipment. I was curious how small they've gotten? I suspect most camera tech will be too large to fit into something slightly larger than a pen, but thought it doesn't hurt to ask. Thank you.", "link": "https://www.reddit.com/r/photography/comments/dh3nt5/camera_flash_bulbs_can_you_diy_a_tiny_one_thats/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "camera flash bulbs: can you -----> diy !!!  a tiny one that's worth making? /!/ i am **not** a photographer, but figured you all would be the best ones to ask: \n\n*what's the smallest camera flash style light source that is still bright enough to be considered a camera flash?*\n\nhalloween is approaching, and i'm researching creating a prop that will require a very small, bright flash. (it's the mib neuralizer, for those who've seen it.) i can create led lights, but i believe they're still not bright enough for this, and know cameras have much better flash equipment. i was curious how small they've gotten? i suspect most camera tech will be too large to fit into something slightly larger than a pen, but thought it doesn't hurt to ask. thank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 1342, "year": "2019"}, {"autor": "swtandsassy", "date": "2019-08-16 05:37:28", "content": "Help with bridezilla client /!/ Hi everyone! This is going to be a rant + needing advice post. There’s too many details to get in to so I’ll try my best to shorten it. \n\nThere’s this bride that absolutely LOVES my work, and I documented her wedding recently. It rained on her wedding day, and we did plan b (which I always have and discuss in advance) with clear umbrellas etc. The pictures still came out beautiful. \n\nNow... a few days later the bride calls me and asks if she could schedule another session for bridal portraits because she was so sad that it rained. Basically she wants more greenery and sun. I kindly gave her two options: 1.) wait for the photos to see if she likes it 2.) book it now within 1 week BECAUSE I am actually getting married next month and am taking time off from work to plan my own. Well, she wants option 2, but is being SOOO difficult to communicate with. She literally doesn’t even consider my wedding coming up, and how I am busy/booked up and won’t have time to schedule her in besides the dates I gave her. She is actually really crazy. On her wedding day, she was so mean to everyone including her husband, was SUPER unorganized, and everything was DIY which caused so much chaos. The other vendors agreed that she was not a good client. \n\nI know I have this issue where I can’t “put my foot down” when it comes to clients because I ALWAYS put them first and don’t want  to risk me and my business. She also texts me constantly EVEN THOUGH I ask her to email me to keep it professional. I screen shot all our texts so there’s proof of how she talks to me... sometimes rude. I still keep it professional. So my question is... at what point is it OK for me to tell her I literally can’t deal with this right now?! I don’t think we can get this post-wedding session in until after MY wedding, but then it would be fall and she doesn’t want that. How would you guys handle this?! Why am I having a difficult time just standing up for myself?!", "link": "https://www.reddit.com/r/photography/comments/cr20dr/help_with_bridezilla_client/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help with bridezilla client /!/ hi everyone! this is going to be a rant + needing advice post. there’s too many details to get in to so i’ll try my best to shorten it. \n\nthere’s this bride that absolutely loves my work, and i documented her wedding recently. it rained on her wedding day, and we did plan b (which i always have and discuss in advance) with clear umbrellas etc. the pictures still came out beautiful. \n\nnow... a few days later the bride calls me and asks if she could schedule another session for bridal portraits because she was so sad that it rained. basically she wants more greenery and sun. i kindly gave her two options: 1.) wait for the photos to see if she likes it 2.) book it now within 1 week because i am actually getting married next month and am taking time off from work to plan my own. well, she wants option 2, but is being sooo difficult to communicate with. she literally doesn’t even consider my wedding coming up, and how i am busy/booked up and won’t have time to schedule her in besides the dates i gave her. she is actually really crazy. on her wedding day, she was so mean to everyone including her husband, was super unorganized, and everything was -----> diy !!!  which caused so much chaos. the other vendors agreed that she was not a good client. \n\ni know i have this issue where i can’t “put my foot down” when it comes to clients because i always put them first and don’t want  to risk me and my business. she also texts me constantly even though i ask her to email me to keep it professional. i screen shot all our texts so there’s proof of how she talks to me... sometimes rude. i still keep it professional. so my question is... at what point is it ok for me to tell her i literally can’t deal with this right now?! i don’t think we can get this post-wedding session in until after my wedding, but then it would be fall and she doesn’t want that. how would you guys handle this?! why am i having a difficult time just standing up for myself?!", "sortedWord": "None", "Identifyer": null, "identifyer": 1583, "year": "2019"}, {"autor": "TabooARGIE", "date": "2019-10-31 02:47:36", "content": "Converting cameras to Full spectrum / IR sensitive cameras /!/ Hello lads, I got a Canon 60Da, which is a \"very\" good astrophography camera thanks to it's lower IR filter, but I'm craving, or more correctly, curious, about full spectrum and IR sensitive cameras.  \nIn case you don't know what I'm talking about: it's basically a regular camera which had it's IR and UW (for full spectrum) or it's IR (for IR sensitive) senseor built-in filters removed, be it by a company or DIY.  \n  \nPlease note that the modifications are really, if not exrtremely, hard and risky to do, but the pay off is inmense, just [look up Flickr's results for \"infrarred\"](https://www.flickr.com/search/?text=infrared).  \nI'm more interested in cutting off low longitude wavelenghts and get \"full infrarred\" photos, be it from people, trees, landscapes or whatever comes to my mind whenever I got a camera in my hands.  \nAt this moment, I got a Canon 6D and a Canon 60Da (sensitive specifically to hydrogen alpha wavelengths, of 656mm).  \nI was wondering if, given that the 60Da got a little more infrarred sensitivity, should I go up and buy a 700nm cutoff IR filter and try to get what I desire by taking advantage of this bonus sensitivity with regular to poor-ish results, or if I should get me a cheap older digital DSLR and DIY my way into removing the IR filter.  \nAppart from that, I also wanted to know how many of you guys shoot, or even dabble on IR photography, because it's a very big aspect of photography I'm interested in.  \n  \nRegarding the DIY part: I live in a 3rd world country (Argentina, if you're curious) and there's no company that provides that service (locally) and I don't feel like nor have the recourses to spend a ton of mone y to send any camera to another country to have the service done.  \n  \nThanks for reading, please treat me and my post kindly, since I'm just an amateur and am asking about something that gives me curiosity.", "link": "https://www.reddit.com/r/photography/comments/dphgf0/converting_cameras_to_full_spectrum_ir_sensitive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "converting cameras to full spectrum / ir sensitive cameras /!/ hello lads, i got a canon 60da, which is a \"very\" good astrophography camera thanks to it's lower ir filter, but i'm craving, or more correctly, curious, about full spectrum and ir sensitive cameras.  \nin case you don't know what i'm talking about: it's basically a regular camera which had it's ir and uw (for full spectrum) or it's ir (for ir sensitive) senseor built-in filters removed, be it by a company or -----> diy !!! .  \n  \nplease note that the modifications are really, if not exrtremely, hard and risky to do, but the pay off is inmense, just [look up flickr's results for \"infrarred\"](https://www.flickr.com/search/?text=infrared).  \ni'm more interested in cutting off low longitude wavelenghts and get \"full infrarred\" photos, be it from people, trees, landscapes or whatever comes to my mind whenever i got a camera in my hands.  \nat this moment, i got a canon 6d and a canon 60da (sensitive specifically to hydrogen alpha wavelengths, of 656mm).  \ni was wondering if, given that the 60da got a little more infrarred sensitivity, should i go up and buy a 700nm cutoff ir filter and try to get what i desire by taking advantage of this bonus sensitivity with regular to poor-ish results, or if i should get me a cheap older digital dslr and diy my way into removing the ir filter.  \nappart from that, i also wanted to know how many of you guys shoot, or even dabble on ir photography, because it's a very big aspect of photography i'm interested in.  \n  \nregarding the diy part: i live in a 3rd world country (argentina, if you're curious) and there's no company that provides that service (locally) and i don't feel like nor have the recourses to spend a ton of mone y to send any camera to another country to have the service done.  \n  \nthanks for reading, please treat me and my post kindly, since i'm just an amateur and am asking about something that gives me curiosity.", "sortedWord": "None", "Identifyer": null, "identifyer": 2570, "year": "2019"}, {"autor": "kazemirphoto", "date": "2019-11-28 18:06:11", "content": "My DIY Double Drop Photography System explained", "link": "https://www.reddit.com/r/photography/comments/e31ook/my_diy_double_drop_photography_system_explained/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my -----> diy !!!  double drop photography system explained", "sortedWord": "None", "Identifyer": null, "identifyer": 3398, "year": "2019"}, {"autor": "kawaiibae69", "date": "2019-12-13 04:57:52", "content": "Has anyone ever lost a diffuser screen on their flash?? /!/ I have a matchbox flash, an osram sunnyboy (pictured) and i unfortunately lost the diffuser. \n\nwould anyone know if i will ever be able to find a replacement for it? any resources on how to replace it? even DIY methods? Thank you!\n\nhttps://preview.redd.it/68fg9r9u0c441.jpg?width=1022&amp;format=pjpg&amp;auto=webp&amp;s=2f79376a0286af7505ac3c35785eb59d53898379", "link": "https://www.reddit.com/r/photography/comments/e9zfgo/has_anyone_ever_lost_a_diffuser_screen_on_their/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "has anyone ever lost a diffuser screen on their flash?? /!/ i have a matchbox flash, an osram sunnyboy (pictured) and i unfortunately lost the diffuser. \n\nwould anyone know if i will ever be able to find a replacement for it? any resources on how to replace it? even -----> diy !!!  methods? thank you!\n\nhttps://preview.redd.it/68fg9r9u0c441.jpg?width=1022&amp;format=pjpg&amp;auto=webp&amp;s=2f79376a0286af7505ac3c35785eb59d53898379", "sortedWord": "None", "Identifyer": null, "identifyer": 3624, "year": "2019"}, {"autor": "optionsinvesting", "date": "2019-01-01 02:50:32", "content": "Lens dust particles: DIY? Or pay someone to do it? /!/ I went through a webpage that talked about taking long exposure white screen to see all the dust particles on the lenses.\nI have found that all 3 of my lenses would need some cleaning. Same with the camera body itself. There are some small black string pieces. Fairly sure, it was from the brush I used to clean...I know, FML.\n\nAnyone got any experience with this issue? I have a small blower and a small brush pen for cleaning the lenses, but the particles seem to be stuck within, not on the two outside lens surfaces :/", "link": "https://www.reddit.com/r/photography/comments/abe8jo/lens_dust_particles_diy_or_pay_someone_to_do_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lens dust particles: -----> diy !!! ? or pay someone to do it? /!/ i went through a webpage that talked about taking long exposure white screen to see all the dust particles on the lenses.\ni have found that all 3 of my lenses would need some cleaning. same with the camera body itself. there are some small black string pieces. fairly sure, it was from the brush i used to clean...i know, fml.\n\nanyone got any experience with this issue? i have a small blower and a small brush pen for cleaning the lenses, but the particles seem to be stuck within, not on the two outside lens surfaces :/", "sortedWord": "None", "Identifyer": null, "identifyer": 4964, "year": "2019"}, {"autor": "droptheone", "date": "2019-01-20 10:15:21", "content": "Properly Wrapping Canvas /!/ Hey guys, as a very DIY (or cheap) photographer who's wrapping his own canvas I'm running into various issues; the biggest one is ink rubbing off on the corners when I'm folding.  I want to ask, for those who wrap their own, if there is a fix for this, or laminate that you prefer to use..... or if there is a good top to bottom on properly DIY-ing canvas in general? ", "link": "https://www.reddit.com/r/photography/comments/ahwan9/properly_wrapping_canvas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "properly wrapping canvas /!/ hey guys, as a very -----> diy !!!  (or cheap) photographer who's wrapping his own canvas i'm running into various issues; the biggest one is ink rubbing off on the corners when i'm folding.  i want to ask, for those who wrap their own, if there is a fix for this, or laminate that you prefer to use..... or if there is a good top to bottom on properly diy-ing canvas in general? ", "sortedWord": "None", "Identifyer": null, "identifyer": 5132, "year": "2019"}, {"autor": "neetoday", "date": "2019-07-10 20:53:50", "content": "Three-cent finger strap /!/ [Here](https://imgur.com/MHFKxBa) is my DIY finger strap.\n\nI use a quick-access bag when I'm hiking and don't like to also have a full neck strap.  I don't trust my fumble fingers to go completely unprotected from drops, so I made this finger loop out of paracord/utility cord from REI.  It's rated to 400 lbs. of tensile strength, so it's plenty strong and was only 10 cents/foot.", "link": "https://www.reddit.com/r/photography/comments/cbmazt/threecent_finger_strap/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "three-cent finger strap /!/ [here](https://imgur.com/mhfkxba) is my -----> diy !!!  finger strap.\n\ni use a quick-access bag when i'm hiking and don't like to also have a full neck strap.  i don't trust my fumble fingers to go completely unprotected from drops, so i made this finger loop out of paracord/utility cord from rei.  it's rated to 400 lbs. of tensile strength, so it's plenty strong and was only 10 cents/foot.", "sortedWord": "None", "Identifyer": null, "identifyer": 6445, "year": "2019"}, {"autor": "fir3dp", "date": "2019-09-20 14:52:03", "content": "How do you attach your camera to your backpack when hiking? /!/ I will be hiking a mountain, slightly technical with abseiling and abit of scrambling.\n\nI use to use a spyder holster on my shoulder strap for my past few hikes as i always want the camera with me at all times. (best camera you have is the one with you) if not ill be too lazy to take it out. \n\n&amp;#x200B;\n\nAny one has any diy solution for something quick? \n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/d6w0x6/how_do_you_attach_your_camera_to_your_backpack/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how do you attach your camera to your backpack when hiking? /!/ i will be hiking a mountain, slightly technical with abseiling and abit of scrambling.\n\ni use to use a spyder holster on my shoulder strap for my past few hikes as i always want the camera with me at all times. (best camera you have is the one with you) if not ill be too lazy to take it out. \n\n&amp;#x200b;\n\nany one has any -----> diy !!!  solution for something quick? \n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 6556, "year": "2019"}, {"autor": "bottledutopia", "date": "2019-01-17 20:14:50", "content": "DIY nonreflective (or minimally reflective) material for macro? /!/ I am looking to take macro shots of lichen specimens - I don't need a lot of nonreflective material so it doesn't make a lot of sense to go out and buy a roll... Is there any way I could DIY this? Or something else?", "link": "https://www.reddit.com/r/photography/comments/ah1xxn/diy_nonreflective_or_minimally_reflective/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  nonreflective (or minimally reflective) material for macro? /!/ i am looking to take macro shots of lichen specimens - i don't need a lot of nonreflective material so it doesn't make a lot of sense to go out and buy a roll... is there any way i could diy this? or something else?", "sortedWord": "None", "Identifyer": null, "identifyer": 65769, "year": "2019"}, {"autor": "Rectumwarts00", "date": "2019-06-29 04:57:41", "content": "Need help with lens repair /!/ I have a Sigma-XQ Fisheye lens that came with a canon AE-1 I just bought. The lens with way too blurry to use. Instead of just having it as a paper weight I figured I might take it apart to repair and clean. I did not find any manuals online or DIY guides for this model. \n\n&amp;#x200B;\n\nIt was going smoothly until these parts fell out \n\n[HERE](https://imgur.com/a/R2AOxtr)\n\nI do not recognize this set up so much and do not know how to apply it.\n\nAny help is appreciated. I am currently trying to skim other disassembly videos on youtube and hopefully one has a similar part.\n\n&amp;#x200B;\n\nIf any other pictures of the lens would help you help me. I can update the pics. Thanks in advance", "link": "https://www.reddit.com/r/photography/comments/c6uq7e/need_help_with_lens_repair/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need help with lens repair /!/ i have a sigma-xq fisheye lens that came with a canon ae-1 i just bought. the lens with way too blurry to use. instead of just having it as a paper weight i figured i might take it apart to repair and clean. i did not find any manuals online or -----> diy !!!  guides for this model. \n\n&amp;#x200b;\n\nit was going smoothly until these parts fell out \n\n[here](https://imgur.com/a/r2aoxtr)\n\ni do not recognize this set up so much and do not know how to apply it.\n\nany help is appreciated. i am currently trying to skim other disassembly videos on youtube and hopefully one has a similar part.\n\n&amp;#x200b;\n\nif any other pictures of the lens would help you help me. i can update the pics. thanks in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 66181, "year": "2019"}, {"autor": "inb4ElonMusk", "date": "2019-06-27 23:29:51", "content": "DIY - How to Make a Solar Lens Filter to Photograph a Solar Eclipse", "link": "https://www.reddit.com/r/photography/comments/c6cokn/diy_how_to_make_a_solar_lens_filter_to_photograph/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  - how to make a solar lens filter to photograph a solar eclipse", "sortedWord": "None", "Identifyer": null, "identifyer": 69098, "year": "2019"}, {"autor": "katnip_fl", "date": "2019-05-22 12:28:49", "content": "DIY rainbow.", "link": "https://www.reddit.com/r/photography/comments/bro6nc/diy_rainbow/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  rainbow.", "sortedWord": "None", "Identifyer": null, "identifyer": 69258, "year": "2019"}, {"autor": "DonTuxedo", "date": "2019-12-27 11:04:36", "content": "How to make a DIY shaped bokeh filter", "link": "https://www.reddit.com/r/photography/comments/eg9wi1/how_to_make_a_diy_shaped_bokeh_filter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to make a -----> diy !!!  shaped bokeh filter", "sortedWord": "None", "Identifyer": null, "identifyer": 71038, "year": "2019"}, {"autor": "CarVac", "date": "2019-12-18 15:21:31", "content": "DIY hot shoe rigid rain cover — The-Digital-Picture", "link": "https://www.reddit.com/r/photography/comments/ecdyzf/diy_hot_shoe_rigid_rain_cover_thedigitalpicture/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  hot shoe rigid rain cover — the-digital-picture", "sortedWord": "None", "Identifyer": null, "identifyer": 71171, "year": "2019"}, {"autor": "goodgodzilla", "date": "2019-12-09 20:31:00", "content": "Help! Need to mail 20 (5x7) photos to family for X-mas. Need the safest method, please. /!/ I have a very large family. Our parents are no longer alive and I found an amazing photo of them dancing together! I had this photo professionally restored and it looks amazing! Since everyone has different tastes, I thought to send them the printed photo with a note for X-mas. Can I use a thick piece of cardboard on each side of the photo to protect it from bending? I have been told that having a \"Do Not Bend\" sticker on the package does absolutely nothing. \n\nPlease offer any DIY advice as I do want to send a physical photo and not a digital version through email.", "link": "https://www.reddit.com/r/photography/comments/e8fjk1/help_need_to_mail_20_5x7_photos_to_family_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help! need to mail 20 (5x7) photos to family for x-mas. need the safest method, please. /!/ i have a very large family. our parents are no longer alive and i found an amazing photo of them dancing together! i had this photo professionally restored and it looks amazing! since everyone has different tastes, i thought to send them the printed photo with a note for x-mas. can i use a thick piece of cardboard on each side of the photo to protect it from bending? i have been told that having a \"do not bend\" sticker on the package does absolutely nothing. \n\nplease offer any -----> diy !!!  advice as i do want to send a physical photo and not a digital version through email.", "sortedWord": "None", "Identifyer": null, "identifyer": 71245, "year": "2019"}, {"autor": "FinderOfE", "date": "2019-03-29 01:05:05", "content": "Water droplet photography /!/ For those of you that have done water droplet photography what water dropping set up have you used? I am trying to look for ideas for a DIY contraption before sending the money on a dedicated unit.", "link": "https://www.reddit.com/r/photography/comments/b6r12a/water_droplet_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "water droplet photography /!/ for those of you that have done water droplet photography what water dropping set up have you used? i am trying to look for ideas for a -----> diy !!!  contraption before sending the money on a dedicated unit.", "sortedWord": "None", "Identifyer": null, "identifyer": 71337, "year": "2019"}, {"autor": "Omatticus", "date": "2019-02-26 19:50:39", "content": "Has anyone tried building a spekular light? How can I DIY this? /!/ I have been wanting to try using a spekular light for my portraits, but don't really want to spend $600+ dollars. Has anyone had luck trying to build one themselves? How did it go? Example of light here: [https://www.lightingrumours.com/wp-content/uploads/2017/08/26-spk-str-800x1199.jpg](https://www.lightingrumours.com/wp-content/uploads/2017/08/26-spk-str-800x1199.jpg)", "link": "https://www.reddit.com/r/photography/comments/av3p57/has_anyone_tried_building_a_spekular_light_how/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "has anyone tried building a spekular light? how can i -----> diy !!!  this? /!/ i have been wanting to try using a spekular light for my portraits, but don't really want to spend $600+ dollars. has anyone had luck trying to build one themselves? how did it go? example of light here: [https://www.lightingrumours.com/wp-content/uploads/2017/08/26-spk-str-800x1199.jpg](https://www.lightingrumours.com/wp-content/uploads/2017/08/26-spk-str-800x1199.jpg)", "sortedWord": "None", "Identifyer": null, "identifyer": 72568, "year": "2019"}, {"autor": "obicankenobi", "date": "2019-01-12 13:59:35", "content": "Making another print with my DIY Arduino Darkroom Timer, this time with some dodging and burning", "link": "https://www.reddit.com/r/photography/comments/af7luv/making_another_print_with_my_diy_arduino_darkroom/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "making another print with my -----> diy !!!  arduino darkroom timer, this time with some dodging and burning", "sortedWord": "None", "Identifyer": null, "identifyer": 73136, "year": "2019"}, {"autor": "cyberboxrd", "date": "2019-01-25 02:55:51", "content": "How to Make a Stylish Shoot: Diy Product Photography", "link": "https://www.reddit.com/r/photography/comments/ajkkrt/how_to_make_a_stylish_shoot_diy_product/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to make a stylish shoot: -----> diy !!!  product photography", "sortedWord": "None", "Identifyer": null, "identifyer": 73646, "year": "2019"}, {"autor": "Supermaster239", "date": "2019-05-31 12:32:30", "content": "Is this haze or seperation? /!/ &amp;#x200B;\n\n[Does anyone know if this is a do-able DIY project? Lens is mamiya rz 75mm](https://i.redd.it/y4ggqxsgjj131.png)", "link": "https://www.reddit.com/r/photography/comments/bv6yap/is_this_haze_or_seperation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "is this haze or seperation? /!/ &amp;#x200b;\n\n[does anyone know if this is a do-able -----> diy !!!  project? lens is mamiya rz 75mm](https://i.redd.it/y4ggqxsgjj131.png)", "sortedWord": "None", "Identifyer": null, "identifyer": 74301, "year": "2019"}, {"autor": "shian243", "date": "2019-07-16 14:48:16", "content": "Home Photography Studio Setup - Tips for building a DIY Home Portrait Studio on a budget", "link": "https://www.reddit.com/r/photography/comments/cdy05g/home_photography_studio_setup_tips_for_building_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "home photography studio setup - tips for building a -----> diy !!!  home portrait studio on a budget", "sortedWord": "None", "Identifyer": null, "identifyer": 75646, "year": "2019"}, {"autor": "AnimationNation", "date": "2019-10-29 20:14:21", "content": "Recommendation for Photographing Graphic Design Print Portfolio? /!/ So I'm a graphic designer that mostly focuses on print, and I'm looking to upgrade how I display work on my website. Here's the [link](https://www.isaacmorrell.com/). I keep struggling with getting my focus right, getting my images sharp, and getting my white balance correct. I'm using a 7D with either a 50mm 1.8 or the kit 18-135. I don't have a tripod and am mostly using natural lighting (shooting by a window) so I'm having a hard time getting my lighting right. How would you recommend I shoot top down with a tripod? I want the framing to stay the same when I turn the page, so I'd love to be locked down, but also top down. Do you have a top down lighting setup (preferably cheap or DIY) that you recommend? \n\nThanks for the help!", "link": "https://www.reddit.com/r/photography/comments/dovhmz/recommendation_for_photographing_graphic_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "recommendation for photographing graphic design print portfolio? /!/ so i'm a graphic designer that mostly focuses on print, and i'm looking to upgrade how i display work on my website. here's the [link](https://www.isaacmorrell.com/). i keep struggling with getting my focus right, getting my images sharp, and getting my white balance correct. i'm using a 7d with either a 50mm 1.8 or the kit 18-135. i don't have a tripod and am mostly using natural lighting (shooting by a window) so i'm having a hard time getting my lighting right. how would you recommend i shoot top down with a tripod? i want the framing to stay the same when i turn the page, so i'd love to be locked down, but also top down. do you have a top down lighting setup (preferably cheap or -----> diy !!! ) that you recommend? \n\nthanks for the help!", "sortedWord": "None", "Identifyer": null, "identifyer": 77910, "year": "2019"}, {"autor": "kbeautyblogger", "date": "2019-11-15 20:44:01", "content": "Cheap DIY Kino Flo Lighting? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/dwwml3/cheap_diy_kino_flo_lighting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "cheap -----> diy !!!  kino flo lighting? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 78352, "year": "2019"}, {"autor": "shrine", "date": "2019-04-07 02:39:23", "content": "Any DIY guides for mounting non-photography work lights onto C stands or other mounts? /!/ Thinking of buying a 500w work light and mounting it to something.\n\n [https://www.amazon.com/Ustellar-Equivalent-Brightness-Waterproof-Construction/dp/B071GYRYQD/ref=sr\\_1\\_1?keywords=led+work+light&amp;qid=1554604704&amp;s=digital-skills&amp;sr=8-1](https://www.amazon.com/Ustellar-Equivalent-Brightness-Waterproof-Construction/dp/B071GYRYQD/ref=sr_1_1?keywords=led+work+light&amp;qid=1554604704&amp;s=digital-skills&amp;sr=8-1) \n\n&amp;#x200B;\n\nAny basic guides on doing that properly and safely?", "link": "https://www.reddit.com/r/photography/comments/babycu/any_diy_guides_for_mounting_nonphotography_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any -----> diy !!!  guides for mounting non-photography work lights onto c stands or other mounts? /!/ thinking of buying a 500w work light and mounting it to something.\n\n [https://www.amazon.com/ustellar-equivalent-brightness-waterproof-construction/dp/b071gyryqd/ref=sr\\_1\\_1?keywords=led+work+light&amp;qid=1554604704&amp;s=digital-skills&amp;sr=8-1](https://www.amazon.com/ustellar-equivalent-brightness-waterproof-construction/dp/b071gyryqd/ref=sr_1_1?keywords=led+work+light&amp;qid=1554604704&amp;s=digital-skills&amp;sr=8-1) \n\n&amp;#x200b;\n\nany basic guides on doing that properly and safely?", "sortedWord": "None", "Identifyer": null, "identifyer": 80113, "year": "2019"}, {"autor": "Ryz0n", "date": "2019-02-20 06:16:52", "content": "Really interested in this soft-focus look. Part of the image is clear but a lot of it is blurry and obscured. What is the best way to achieve this effect? Filter? DIY?", "link": "https://www.reddit.com/r/photography/comments/askvpb/really_interested_in_this_softfocus_look_part_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "really interested in this soft-focus look. part of the image is clear but a lot of it is blurry and obscured. what is the best way to achieve this effect? filter? -----> diy !!! ?", "sortedWord": "None", "Identifyer": null, "identifyer": 81218, "year": "2019"}, {"autor": "MakeAndRepeat", "date": "2019-03-05 21:16:47", "content": "DIY Wooden Photography Board", "link": "https://www.reddit.com/r/photography/comments/axqcg9/diy_wooden_photography_board/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  wooden photography board", "sortedWord": "None", "Identifyer": null, "identifyer": 81861, "year": "2019"}, {"autor": "AdiPlaysOW", "date": "2019-03-05 20:57:32", "content": "DIY Wooden Photography Board", "link": "https://www.reddit.com/r/photography/comments/axq4gn/diy_wooden_photography_board/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  wooden photography board", "sortedWord": "None", "Identifyer": null, "identifyer": 81864, "year": "2019"}, {"autor": "CodgerConsulting", "date": "2019-01-14 00:55:05", "content": "Man says Laser from self driving car nuked his Sony a7R II - DIY Photography", "link": "https://www.reddit.com/r/photography/comments/afq6mt/man_says_laser_from_self_driving_car_nuked_his/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "man says laser from self driving car nuked his sony a7r ii - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 82592, "year": "2019"}, {"autor": "Gales1436", "date": "2019-01-31 10:30:21", "content": "Trying to find photo of Toronto from last year /!/ Hi, sometime before fall of 2018, I found a post on r/toronto (I think) of a picture someone had taken. It was absolutely breathtaking. The photo was of the CN Tower from across the water, and represented each of the four seasons. I had my heart set on having a four panel piece printed of it, as it went from (iirc) Winter, Spring, Summer, and Fall in equal parts right to left. Honestly, I can't describe how incredibly beautiful it was, and I had actually saved it to my hard disk. Since then, I've updated my desktop since a lot of the parts from a time before I was in very poor financial straits, but during the process, the pins on the data connection on the disk in question were damaged. I cannot get a solid connection, which has barred me from accessing nearly 3TB of data. I've been looking for ways to fix it, and looked at potentially taking it in to be repaired professionally. I've even looked at buying a new PCB entirely and doing a DIY job, but I haven't acted on any of it. Honestly, I can live without a great deal of the data on that drive, but that photo means more to me than exists vocabulary to explain. I've tried googling it, I've scoured reddit, and I definitely saved the picture on my reddit account, but apparently there's a limit on how many things can be saved, so it's not there. I cannot possibly be the only person to have fallen in love with this photo, so if anyone has it, or has a link to the post in reference, I'd be extraordinariy grateful for some help here.\n\nI've experienced a lot of pain in this city. Almost nothing but loss and regret, and I resent this place for it. I can't go anywhere without being reminded of some terrible event at the hands of my family, or from when I was homeless. The one thing I that gave me some pleasure is how beautiful this place is, and this photo that I'm looking for truly incapsulates and immortalizes Toronto's splendor. Thanks in advance to you all.", "link": "https://www.reddit.com/r/photography/comments/alo6uy/trying_to_find_photo_of_toronto_from_last_year/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "trying to find photo of toronto from last year /!/ hi, sometime before fall of 2018, i found a post on r/toronto (i think) of a picture someone had taken. it was absolutely breathtaking. the photo was of the cn tower from across the water, and represented each of the four seasons. i had my heart set on having a four panel piece printed of it, as it went from (iirc) winter, spring, summer, and fall in equal parts right to left. honestly, i can't describe how incredibly beautiful it was, and i had actually saved it to my hard disk. since then, i've updated my desktop since a lot of the parts from a time before i was in very poor financial straits, but during the process, the pins on the data connection on the disk in question were damaged. i cannot get a solid connection, which has barred me from accessing nearly 3tb of data. i've been looking for ways to fix it, and looked at potentially taking it in to be repaired professionally. i've even looked at buying a new pcb entirely and doing a -----> diy !!!  job, but i haven't acted on any of it. honestly, i can live without a great deal of the data on that drive, but that photo means more to me than exists vocabulary to explain. i've tried googling it, i've scoured reddit, and i definitely saved the picture on my reddit account, but apparently there's a limit on how many things can be saved, so it's not there. i cannot possibly be the only person to have fallen in love with this photo, so if anyone has it, or has a link to the post in reference, i'd be extraordinariy grateful for some help here.\n\ni've experienced a lot of pain in this city. almost nothing but loss and regret, and i resent this place for it. i can't go anywhere without being reminded of some terrible event at the hands of my family, or from when i was homeless. the one thing i that gave me some pleasure is how beautiful this place is, and this photo that i'm looking for truly incapsulates and immortalizes toronto's splendor. thanks in advance to you all.", "sortedWord": "None", "Identifyer": null, "identifyer": 83100, "year": "2019"}, {"autor": "justmehere85", "date": "2019-01-24 01:11:44", "content": "Question for the Pros /!/ Backstory: Over the last 5 months I have been working on a food blog. My husband bought me a starter camera a few years back that I am finally starting to feel comfortable with. My food photos have grown with my collection of props and background. \n\n&amp;#x200B;\n\nToday: I am looking to do a photo shoot, in my home, for my profile on my blog. As of right now I have a lame selfie and that is it. I am trying to look more professional and let people get to know me through this shoot. I have a odd style and not a \"Pinterest ready home\". I don't have any pro equipment like a tripod or lighting. \n\nMy Question: Ant tips, and/or advice for doing my first self photo shoot. Are there tips and trick for people starting out? Mind you I am tight on budget so any DIY things would be great. ", "link": "https://www.reddit.com/r/photography/comments/aj6zoz/question_for_the_pros/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "question for the pros /!/ backstory: over the last 5 months i have been working on a food blog. my husband bought me a starter camera a few years back that i am finally starting to feel comfortable with. my food photos have grown with my collection of props and background. \n\n&amp;#x200b;\n\ntoday: i am looking to do a photo shoot, in my home, for my profile on my blog. as of right now i have a lame selfie and that is it. i am trying to look more professional and let people get to know me through this shoot. i have a odd style and not a \"pinterest ready home\". i don't have any pro equipment like a tripod or lighting. \n\nmy question: ant tips, and/or advice for doing my first self photo shoot. are there tips and trick for people starting out? mind you i am tight on budget so any -----> diy !!!  things would be great. ", "sortedWord": "None", "Identifyer": null, "identifyer": 83622, "year": "2019"}, {"autor": "glengdek", "date": "2019-04-24 02:16:09", "content": "I need ideas for a primary school photography club /!/ Hello everyone! I'm a primary school teacher and avid amateur photographer.  My school picked up on this and asked me to run a photography club.  I thought it was a great idea and the club has been running successfully for 9 months now.  The problem is, I've completely run out of ideas.  This is what we have done so far:\n\n&amp;#x200B;\n\nCamera share - bring in our equipment and share our experiences.  I also brought in some old film cameras which amazed the children\n\n&amp;#x200B;\n\nComposition - rule of thirds, leading lines etc\n\n&amp;#x200B;\n\nExposure - aperture, shutter, ISO.  Studied each one separately and did practical activities experimenting with them\n\n&amp;#x200B;\n\nAction/sports photography - taking pictures of the football team training\n\n&amp;#x200B;\n\nStill life - taking creative photos of classroom objects, making photo's for the school's chess competition posters\n\n&amp;#x200B;\n\nNatural light portraits - we built our own reflectors and used them to take natural light portraits of each other\n\n&amp;#x200B;\n\nFlash photography - low key photography and freezing motion\n\n&amp;#x200B;\n\nOil and water close ups\n\n&amp;#x200B;\n\nMaking DIY flash modifiers\n\n&amp;#x200B;\n\nScrunched up foil to make a 'sparkling' backdrop\n\n&amp;#x200B;\n\nFalling water droplets\n\n&amp;#x200B;\n\nLocal area photowalk\n\n&amp;#x200B;\n\nLight painting (they loved this, but we've done it to death)\n\n&amp;#x200B;\n\nThe age range of the children are from around 9 to 12, and most of our sessions have to be indoors.  Does anyone have any suggestions for different activities I could try with them?\n\n&amp;#x200B;\n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/bgp1pv/i_need_ideas_for_a_primary_school_photography_club/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i need ideas for a primary school photography club /!/ hello everyone! i'm a primary school teacher and avid amateur photographer.  my school picked up on this and asked me to run a photography club.  i thought it was a great idea and the club has been running successfully for 9 months now.  the problem is, i've completely run out of ideas.  this is what we have done so far:\n\n&amp;#x200b;\n\ncamera share - bring in our equipment and share our experiences.  i also brought in some old film cameras which amazed the children\n\n&amp;#x200b;\n\ncomposition - rule of thirds, leading lines etc\n\n&amp;#x200b;\n\nexposure - aperture, shutter, iso.  studied each one separately and did practical activities experimenting with them\n\n&amp;#x200b;\n\naction/sports photography - taking pictures of the football team training\n\n&amp;#x200b;\n\nstill life - taking creative photos of classroom objects, making photo's for the school's chess competition posters\n\n&amp;#x200b;\n\nnatural light portraits - we built our own reflectors and used them to take natural light portraits of each other\n\n&amp;#x200b;\n\nflash photography - low key photography and freezing motion\n\n&amp;#x200b;\n\noil and water close ups\n\n&amp;#x200b;\n\nmaking -----> diy !!!  flash modifiers\n\n&amp;#x200b;\n\nscrunched up foil to make a 'sparkling' backdrop\n\n&amp;#x200b;\n\nfalling water droplets\n\n&amp;#x200b;\n\nlocal area photowalk\n\n&amp;#x200b;\n\nlight painting (they loved this, but we've done it to death)\n\n&amp;#x200b;\n\nthe age range of the children are from around 9 to 12, and most of our sessions have to be indoors.  does anyone have any suggestions for different activities i could try with them?\n\n&amp;#x200b;\n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 83704, "year": "2019"}, {"autor": "jakeloopy", "date": "2019-06-04 15:32:51", "content": "HIDDEN CAMERA IDEAS /!/ I need to film an event secretively for a prank. They will know they were filmed eventually. But what’s everyone’s best hiding spots? I plan to use gopros... ideas on how to hide them? Tips? Maybe even a diy project to make a hidden camera case.", "link": "https://www.reddit.com/r/photography/comments/bwq2jy/hidden_camera_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hidden camera ideas /!/ i need to film an event secretively for a prank. they will know they were filmed eventually. but what’s everyone’s best hiding spots? i plan to use gopros... ideas on how to hide them? tips? maybe even a -----> diy !!!  project to make a hidden camera case.", "sortedWord": "None", "Identifyer": null, "identifyer": 84527, "year": "2019"}, {"autor": "mhaustria", "date": "2019-07-24 02:44:36", "content": "Lens support system and plate holder diy making of with a new tool.", "link": "https://www.reddit.com/r/photography/comments/ch2cne/lens_support_system_and_plate_holder_diy_making/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lens support system and plate holder -----> diy !!!  making of with a new tool.", "sortedWord": "None", "Identifyer": null, "identifyer": 86714, "year": "2019"}], "name": "diyphotography2019"}