{"interestingcomments": [{"autor": "BleuRougeViolet", "date": "2019-02-13 23:41:03", "content": "Anyone using 500px needs to update their password asap. /!/ Received this from 500px\n\n\"What happened?\nOn February 8, 2019, our engineering team became aware of a potential security issue affecting certain user profile data. We immediately launched a comprehensive review of our systems to understand the nature and scope of the issue. We engaged a third-party expert to assist us in our investigation and are coordinating with law enforcement authorities on this matter.\nBased on our investigation to date, we believe that an unauthorized party gained access to our systems and acquired partial user data on approximately July 5, 2018. We’ve concluded this issue affected certain information that users provided when filling out their user profiles, as listed below. Our engineers are closely monitoring our platform and we’ve found no evidence to date of any recurrence of this issue.\"", "link": "https://www.reddit.com/r/photography/comments/aqd7ee/anyone_using_500px_needs_to_update_their_password/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "our engineers", "selectorShort": "engineer", "MarkedSent": "anyone using 500px needs to update their password asap. /!/ received this from 500px\n\n\"what happened?\non february 8, 2019, our engineering team became aware of a potential security issue affecting certain user profile data. we immediately launched a comprehensive review of our systems to understand the nature and scope of the issue. we engaged a third-party expert to assist us in our investigation and are coordinating with law enforcement authorities on this matter.\nbased on our investigation to date, we believe that an unauthorized party gained access to our systems and acquired partial user data on approximately july 5, 2018. we’ve concluded this issue affected certain information that users provided when filling out their user profiles, as listed below. -----> our !!!  -----> engineers !!!  are closely monitoring -----> our !!!  platform and we’ve found no evidence to date of any recurrence of this issue.\"", "sortedWord": "None", "Identifyer": null, "identifyer": 67745, "year": "2019"}], "name": "engineerphotography2019"}