{"interestingcomments": [{"Unnamed: 0": 120703, "autor": "rabidsoggymoose", "date": 1609821425000, "content": "Pocketable advanced zoom camera with an ultrawide? /!/ As the years go by with traveling I find myself really disliking using my Sony a6500, 10-18mm, and 18-105mm. The weight, the constant changing of the lenses, the disconnection from smartphone apps, the lack of geotagging, the lack of computational photography, all push me to take 95% of my photos and videos with my smartphone. I want to sell the entire kit which leaves more space in my pack for things like a drone and makes hiking much more enjoyable.\n\nBut I still want the quality of a larger sensor that's at least 1\" like the Sony RX100 series.\n\nThe problem is that the ultrawide focal range is critical to travel photography.\n\nAre there any all-in-one compact, pocketable, advanced zoom cameras like the RX100 with the option of a high quality, sharp, distortion-free ultrawide? Like maybe an ultrawide attachment that doesn't suck?\n\nOr maybe an ultra compact m43 camera with a super small \\~8mm ultrawide and an equally small walkaround lens in the 12-50mm range?", "link": "https://www.reddit.com/r/photography/comments/kqqnzm/pocketable_advanced_zoom_camera_with_an_ultrawide/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "pocketable advanced zoom camera with an ultrawide? /!/ as the years go by with traveling i find myself really disliking using my sony a6500, 10-18mm, and 18-105mm. the weight, the constant changing of the lenses, the disconnection from smartphone apps, the lack of -----> geotagging !!! , the lack of computational photography, all push me to take 95% of my photos and videos with my smartphone. i want to sell the entire kit which leaves more space in my pack for things like a drone and makes hiking much more enjoyable.\n\nbut i still want the quality of a larger sensor that's at least 1\" like the sony rx100 series.\n\nthe problem is that the ultrawide focal range is critical to travel photography.\n\nare there any all-in-one compact, pocketable, advanced zoom cameras like the rx100 with the option of a high quality, sharp, distortion-free ultrawide? like maybe an ultrawide attachment that doesn't suck?\n\nor maybe an ultra compact m43 camera with a super small \\~8mm ultrawide and an equally small walkaround lens in the 12-50mm range?", "sortedWord": "None", "identifyer": 11039, "year": "2021"}], "name": "geotaggingphotography2021"}