{"interestingcomments": [{"autor": "np2fast", "date": "2020-08-05 05:51:44", "content": "Where to go from here? Improving my photography. /!/ Hey photogs, \n\nLike many, I am currently in a photography funk. No quite sure where to go from here. \n\nAbout me:  \nBeen shooting for the last 5-7 years. Have greatly improved over this time but have hit a stagnant bit. Have been mostly shooting with an Olympus OMD em10 mark 1 and 2; love them but not sure if it's time to move on? Will changing cameras help my photography?\n\nIf not that, should I be working on my composition? Should I be relearning editing?\n\n[My IG for some reference.](https://www.instagram.com/tallcupofchocolatemilk/)\n\nLove shooting, just looking for some insight on what else I can do to progress from here. \n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/i3zt1o/where_to_go_from_here_improving_my_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "where to go from here? -----> improving !!!  my photography. /!/ hey photogs, \n\nlike many, i am currently in a photography funk. no quite sure where to go from here. \n\nabout me:  \nbeen shooting for the last 5-7 years. have greatly improved over this time but have hit a stagnant bit. have been mostly shooting with an olympus omd em10 mark 1 and 2; love them but not sure if it's time to move on? will changing cameras help my photography?\n\nif not that, should i be working on my composition? should i be relearning editing?\n\n[my ig for some reference.](https://www.instagram.com/tallcupofchocolatemilk/)\n\nlove shooting, just looking for some insight on what else i can do to progress from here. \n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 59691, "year": "2020"}, {"autor": "OGB234", "date": "2020-01-09 01:10:04", "content": "Improve Photography! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/em27s1/improve_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  photography! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 62920, "year": "2020"}, {"autor": "OGB234", "date": "2020-01-08 23:14:47", "content": "Improve Photography! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/em0p6j/improve_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  photography! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 62929, "year": "2020"}, {"autor": "UnitAppropriate", "date": "2020-12-14 19:20:19", "content": "Improving portraits by adding light after a picture was taken", "link": "https://www.reddit.com/r/photography/comments/kd4c3z/improving_portraits_by_adding_light_after_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  portraits by adding light after a picture was taken", "sortedWord": "None", "Identifyer": null, "identifyer": 72917, "year": "2020"}, {"autor": "davidcorkill", "date": "2020-10-27 10:05:13", "content": "Improving Water Sports photography and light reflection /!/ Hi Photography, \n\nI am an avid windsurfer and also a keen amateur photographer (emphasis on the amateur) and as such enjoy taking photographs of windsurfing, as well as other water activities. The location that I sail and take most of my photographs from (or if I am sailing my wife takes them) is facing into the south west and so usually towards the sun. This often results in a lot of water light reflection in the images (here is an example [https://imgur.com/a/A8ZLhV4](https://imgur.com/a/A8ZLhV4)) and can be quite bad at times meaning the subject is dark. I have tried with some limited knowledge to remove the highlights but often so bright nothing can be done. The winter sun lower in the sky doesn't help at times either.\n\nDoes anyone have any experience with shooting with water in this scenario to even out light across the image and make the subjects better quality? I think that maybe a polarized filter of some type may help but before I invest in one I would like to make sure it is the best solution. I have a Canon 70D and just got a Canon 100-400mm lens of Ebay to get a bit closer to the subjects on the water. \n\nPotentially there are better settings to use or post processing I could try? And don't get me wrong, occasionally I get a really nice image with the sailor silhouetted against the water, but not what I want all the time.\n\nFirst time posting here so I hope I have done it right and any advice would be really appreciated.", "link": "https://www.reddit.com/r/photography/comments/jiycvq/improving_water_sports_photography_and_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  water sports photography and light reflection /!/ hi photography, \n\ni am an avid windsurfer and also a keen amateur photographer (emphasis on the amateur) and as such enjoy taking photographs of windsurfing, as well as other water activities. the location that i sail and take most of my photographs from (or if i am sailing my wife takes them) is facing into the south west and so usually towards the sun. this often results in a lot of water light reflection in the images (here is an example [https://imgur.com/a/a8zlhv4](https://imgur.com/a/a8zlhv4)) and can be quite bad at times meaning the subject is dark. i have tried with some limited knowledge to remove the highlights but often so bright nothing can be done. the winter sun lower in the sky doesn't help at times either.\n\ndoes anyone have any experience with shooting with water in this scenario to even out light across the image and make the subjects better quality? i think that maybe a polarized filter of some type may help but before i invest in one i would like to make sure it is the best solution. i have a canon 70d and just got a canon 100-400mm lens of ebay to get a bit closer to the subjects on the water. \n\npotentially there are better settings to use or post processing i could try? and don't get me wrong, occasionally i get a really nice image with the sailor silhouetted against the water, but not what i want all the time.\n\nfirst time posting here so i hope i have done it right and any advice would be really appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 85982, "year": "2020"}], "name": "improvephotography2020"}