{"interestingcomments": [{"Unnamed: 0": 103504, "autor": "inmn", "date": 1563568757000, "content": "File Management Question - Land of mobile, RAW, game trail cams, camcorders, etc /!/ I am looking for file management suggestions. Ideally a file server where we can mount them and view with connected devices. \n\n&amp;#x200B;\n\nWe are a mac family, excluding a few mobile outliers, and need a way for my wife to access my RAW files when she does her annual calendars, cards, etc. \n\n&amp;#x200B;\n\nAlso would like a file system where the kids devices can be backed into it. Date preservation and meta tags is ideal. \n\n&amp;#x200B;\n\nCan buy a device (like a File Server. I have a 7-8 yr old synology. it sucks for this). \n\n&amp;#x200B;\n\nI dont exactly like MAC's PHOTOS compressed library/virtual drive, nor do I love lightroom CC's file management.\n\n&amp;#x200B;\n\nWe currently use Network mounts, Local Mounts, and Google compressed photos for mobile backups; Raw is getting exported and dumped into a folder, usually by date/event, but that doesnt help her.  Ideally nothing too proprietary so if the device fails, Im dealing with a nightmare for recovery. \n\n&amp;#x200B;\n\nDoes anyone have any recommendations?", "link": "https://www.reddit.com/r/photography/comments/cfcuhm/file_management_question_land_of_mobile_raw_game/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "-----> file !!!  -----> management !!!  question - land of mobile, raw, game trail cams, camcorders, etc /!/ i am looking for file management suggestions. ideally a file server where we can mount them and view with connected devices. \n\n&amp;#x200b;\n\nwe are a mac family, excluding a few mobile outliers, and need a way for my wife to access my raw files when she does her annual calendars, cards, etc. \n\n&amp;#x200b;\n\nalso would like a file system where the kids devices can be backed into it. date preservation and meta tags is ideal. \n\n&amp;#x200b;\n\ncan buy a device (like a file server. i have a 7-8 yr old synology. it sucks for this). \n\n&amp;#x200b;\n\ni dont exactly like mac's photos compressed library/virtual drive, nor do i love lightroom cc's file management.\n\n&amp;#x200b;\n\nwe currently use network mounts, local mounts, and google compressed photos for mobile backups; raw is getting exported and dumped into a folder, usually by date/event, but that doesnt help her.  ideally nothing too proprietary so if the device fails, im dealing with a nightmare for recovery. \n\n&amp;#x200b;\n\ndoes anyone have any recommendations?", "sortedWord": "None", "identifyer": 6308, "year": "2019"}, {"Unnamed: 0": 105196, "autor": "taintmonger", "date": 1577132192000, "content": "Digital file management confusion /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/eepw5l/digital_file_management_confusion/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "digital -----> file !!!  -----> management !!!  confusion /!/ [removed]", "sortedWord": "None", "identifyer": 8057, "year": "2019"}, {"Unnamed: 0": 332062, "autor": "darrenphillipjones", "date": 1554958677000, "content": "Working deliriously late, I just can't get over how hilarious this suggestion is for speeding Lightroom up... #5: Use Graphics Professor: Try enabling or disabling the use of your graphics processor to see if that improves performance. /!/ For context - I'm grinding a 3 day conference for multiple shooters, 20-30 drops a day, Photo Mechanic -&gt; -&gt;Backup -&gt; LR -&gt; Smugmug -&gt; Portable Drive for Local Vendor Sharing. Nothing crazy, but transfers and exports, combined with a bunch of small card drops, *makes LR a slow boy*.\n\nIt's not 20k photos a day or something either. LR just really has a slight edge in a test tube for projects like this over something like Capture One. But damn, I'm itching like crazy to 100% drop LR.\n\n*And I'll be honest, part of it is habit.* Yesterday I had a colleague offer to help process on his laptop and I accepted his help, because I was sleep deprived from a busy first day. And in the mix, a few cards got mixed up. It was only 2 cards, but you can easily end up with 3x copies of photos in the same location by just running a card through my import process. In LR I have the fix to that down to every keystroke needed with zero extra requirements. And at no risk of deleting anything, but duplicates.\n\nSo when I'm waiting for uploads or exports, when things are going as planned, LR basically turns into \"Not Responding, because you touched a menu button.\" Sometimes I search for people's tricks. I've done it all 100 times, pinching seconds here or there, but this suggestion in the title above really gave me a good chuckle.\n\n\"Is your product not working properly? Have you tried doing X?\" Yea. \"Well, have you like, tried not doing X?\" Uh.......\n\n(five minutes later)\n\n\"ROBBY! ROBBY! Get over here! OMG I have the best blog idea! Let's offer solutions, and also offer the exact opposite. Nobody can tell us we're wrong then! Don't even need to fact check or explain why we suggested it!\"\n\n[Here's a sneak peak at **a very basic idea** of what I do if anyone is interested in this type of stuff.](https://i.imgur.com/eR9aDXd.jpg) It's not perfect, or 100% exactly what I do every time, but I like to have a chart to help clients understand the complexities involved with data (photos) collection and delivery. I was going to publish it to /r/dataisbeautiful, but I'm beat. And I sure wont be able to post it there at 9:17am for that juicy Karma train. So enjoy! I might make a video and post, but only time will tell. I'm slammed here out of state, and the second I get home, have to roll right into some high end architecture work.\n\nAnyone remember my processing post with 9 bracketed photos and SNS? Sorry I delete my posts and comments sometimes. It helps me get back on track and focused on work, I also apply for jobs and don't want any paper trail online to stuff that might be troublesome.\n\nTo anyone who thinks it's bad to share this stuff, because someone can hop in and take mah business! Be my guest haha. It's mostly a job for people who enjoy file management structures And limited sleep. Not high pay. My first day started at 6am  on Monday and I didn't sleep the entire first night, then worked until 2am the next night, with few breaks. I got 4 hours of sleep last night, and shared a drink with some nice peeps, last night, and went right back in at 7am. (I don't like stopping until I know everything is 100% ready to deliver the second I leave - This job was an extreme example though. The first day had dozens of tiny changes, interruptions, needing to stop a job backing up and processing to get 4 random photos for XYZ - yada yada).\n\nWhen the system works, I will admit, it's really fun for me. And I still have a lot to learn.\n\nI'm wrapping up soon, but this post was a good 10 minute breather for me (I like to downplay how long it takes me to write a post like this, to get a few extra minutes of rest!!!), I hope you enjoy the joke and flow chart. I won't lie, I might not be responding to too many questions here, asap, hopefully others who know this stuff can chime in. The photo mechanic stuff is a little complicated at first. I'll try to followup sooner than later.\n\n*Quick note for anyone who thinks smugmug sucks, or LR isn't needed for XYZ! I'm on the same page! There's plenty of reasons why something else is better, but budget aren't always unlimited, and the smugmug is my client's setup, I'm just delivering to their spec. It actually handles jobs like this really well. with duplicate blocking and tertiary organization.\n\nAnd I don't promote any of the software shared or discussed. You can easily put Capture One or something like Google Drive in place of other stuff in there.\n\nNight! Or good morning to anyone catching this on the flip-side.", "link": "https://www.reddit.com/r/photography/comments/bbw3ms/working_deliriously_late_i_just_cant_get_over_how/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "working deliriously late, i just can't get over how hilarious this suggestion is for speeding lightroom up... #5: use graphics professor: try enabling or disabling the use of your graphics processor to see if that improves performance. /!/ for context - i'm grinding a 3 day conference for multiple shooters, 20-30 drops a day, photo mechanic -&gt; -&gt;backup -&gt; lr -&gt; smugmug -&gt; portable drive for local vendor sharing. nothing crazy, but transfers and exports, combined with a bunch of small card drops, *makes lr a slow boy*.\n\nit's not 20k photos a day or something either. lr just really has a slight edge in a test tube for projects like this over something like capture one. but damn, i'm itching like crazy to 100% drop lr.\n\n*and i'll be honest, part of it is habit.* yesterday i had a colleague offer to help process on his laptop and i accepted his help, because i was sleep deprived from a busy first day. and in the mix, a few cards got mixed up. it was only 2 cards, but you can easily end up with 3x copies of photos in the same location by just running a card through my import process. in lr i have the fix to that down to every keystroke needed with zero extra requirements. and at no risk of deleting anything, but duplicates.\n\nso when i'm waiting for uploads or exports, when things are going as planned, lr basically turns into \"not responding, because you touched a menu button.\" sometimes i search for people's tricks. i've done it all 100 times, pinching seconds here or there, but this suggestion in the title above really gave me a good chuckle.\n\n\"is your product not working properly? have you tried doing x?\" yea. \"well, have you like, tried not doing x?\" uh.......\n\n(five minutes later)\n\n\"robby! robby! get over here! omg i have the best blog idea! let's offer solutions, and also offer the exact opposite. nobody can tell us we're wrong then! don't even need to fact check or explain why we suggested it!\"\n\n[here's a sneak peak at **a very basic idea** of what i do if anyone is interested in this type of stuff.](https://i.imgur.com/er9adxd.jpg) it's not perfect, or 100% exactly what i do every time, but i like to have a chart to help clients understand the complexities involved with data (photos) collection and delivery. i was going to publish it to /r/dataisbeautiful, but i'm beat. and i sure wont be able to post it there at 9:17am for that juicy karma train. so enjoy! i might make a video and post, but only time will tell. i'm slammed here out of state, and the second i get home, have to roll right into some high end architecture work.\n\nanyone remember my processing post with 9 bracketed photos and sns? sorry i delete my posts and comments sometimes. it helps me get back on track and focused on work, i also apply for jobs and don't want any paper trail online to stuff that might be troublesome.\n\nto anyone who thinks it's bad to share this stuff, because someone can hop in and take mah business! be my guest haha. it's mostly a job for people who enjoy -----> file !!!  -----> management !!!  structures and limited sleep. not high pay. my first day started at 6am  on monday and i didn't sleep the entire first night, then worked until 2am the next night, with few breaks. i got 4 hours of sleep last night, and shared a drink with some nice peeps, last night, and went right back in at 7am. (i don't like stopping until i know everything is 100% ready to deliver the second i leave - this job was an extreme example though. the first day had dozens of tiny changes, interruptions, needing to stop a job backing up and processing to get 4 random photos for xyz - yada yada).\n\nwhen the system works, i will admit, it's really fun for me. and i still have a lot to learn.\n\ni'm wrapping up soon, but this post was a good 10 minute breather for me (i like to downplay how long it takes me to write a post like this, to get a few extra minutes of rest!!!), i hope you enjoy the joke and flow chart. i won't lie, i might not be responding to too many questions here, asap, hopefully others who know this stuff can chime in. the photo mechanic stuff is a little complicated at first. i'll try to followup sooner than later.\n\n*quick note for anyone who thinks smugmug sucks, or lr isn't needed for xyz! i'm on the same page! there's plenty of reasons why something else is better, but budget aren't always unlimited, and the smugmug is my client's setup, i'm just delivering to their spec. it actually handles jobs like this really well. with duplicate blocking and tertiary organization.\n\nand i don't promote any of the software shared or discussed. you can easily put capture one or something like google drive in place of other stuff in there.\n\nnight! or good morning to anyone catching this on the flip-side.", "sortedWord": "None", "identifyer": 79764, "year": "2019"}], "name": "managementphotography2019"}