{"interestingcomments": [{"Unnamed: 0": 65287, "autor": "thesensitivechild", "date": 1583773015000, "content": "I need to invest in a raid or some way of managing over 30-40tb of files /!/ Hi guys,\n\nI have an ongoing problem that is starting to take away from my love of photography. Digital asset management. I currents have over 15 different drives spanning the past 10 years. Things are duplicated and mixed up and all over the place. It’s a nightmare. It becomes impossible to locate any file without having to search through multiple drives. I would like to begin to work and edit the family photo series I have spent time on the last several years. I would also like to not feel crazy. I avoid my photography. Ow because the file management aspect has become so exhausting. I figure this is when I need to invest in some sort of raid system and multiple drives. I shoot digital, film, and do video work. I shoot the rare event, occasionally\neditorially, but the majority is fine art based \n\nI am okay spending money if it means this issue finally is dealt with. One friend said uses CRU, which I have never heard of. He also stored to the cloud with blaze something or other. \n\nI would greatly appreciate any suggestions. If there are questions I can answer to help your suggestion please let me know! \n\nThe time has come. I should have done this three years ago. My career has so much waiting to happen and I avoid it because I feel out of control in regard to my files. \n\nThank you so very much", "link": "https://www.reddit.com/r/photography/comments/ffxqwf/i_need_to_invest_in_a_raid_or_some_way_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "i need to invest in a raid or some way of managing over 30-40tb of files /!/ hi guys,\n\ni have an ongoing problem that is starting to take away from my love of photography. digital asset management. i currents have over 15 different drives spanning the past 10 years. things are duplicated and mixed up and all over the place. it’s a nightmare. it becomes impossible to locate any file without having to search through multiple drives. i would like to begin to work and edit the family photo series i have spent time on the last several years. i would also like to not feel crazy. i avoid my photography. ow because the -----> file !!!  -----> management !!!  aspect has become so exhausting. i figure this is when i need to invest in some sort of raid system and multiple drives. i shoot digital, film, and do video work. i shoot the rare event, occasionally\neditorially, but the majority is fine art based \n\ni am okay spending money if it means this issue finally is dealt with. one friend said uses cru, which i have never heard of. he also stored to the cloud with blaze something or other. \n\ni would greatly appreciate any suggestions. if there are questions i can answer to help your suggestion please let me know! \n\nthe time has come. i should have done this three years ago. my career has so much waiting to happen and i avoid it because i feel out of control in regard to my files. \n\nthank you so very much", "sortedWord": "None", "identifyer": 66891, "year": "2020"}, {"Unnamed: 0": 82290, "autor": "MonthyPythonista", "date": 1606484426000, "content": "Lightroom alternatives: is Acdsee Ultimate the best one for my needs? /!/ I have seen similar discussions here in the past, so I hope this won't be considered off-topic. At the same time, software changes all the time so I don't think it's redundant to ask the same question that was asked a few years ago.\n\nI am considering moving away from Lightroom. After about a week of research and trying a few alternatives, I am reaching the conclusion that Acdsee Ultimate is probably the best Lightroom alternative for my needs. **I would like people with more experience than me to critique this and tell me if I got something wrong / am missing something.**\n\n&amp;#x200B;\n\nMy needs:\n\n* I am a non-professional photographer. I have about 40,000 photos and typically add about 800 - 1,000 photos every year. \n* My edits are fairly basic and I don't use any plugins.\n* The software must run on Windows and come with a perpetual licence - no ~~protection money~~ periodic subscription \n\n&amp;#x200B;\n\n**What I have ruled out, and why**\n\n* Corel  AfterShot Pro: doesn't support DNGs; many users complain Corel abandoned the software and stopped developing it\n* Luminar: limited DAM (digital asset management, ie poor at organising all the files) ; no keywords\n* Darktable: many reviewers say it wouldn't handle libraries &gt; 40k photos well; no file management features; I have tried it and like Acdsee better\n* Digikam: DAM only, limited editing\n* Capture One Pro: expensive, doesn't support DNGs, limited DAM; very advanced raw editing (too advanced for me)\n* RawTherapee: very limited DAM\n\n&amp;#x200B;\n\nThoughts? Thanks!", "link": "https://www.reddit.com/r/photography/comments/k219zv/lightroom_alternatives_is_acdsee_ultimate_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "lightroom alternatives: is acdsee ultimate the best one for my needs? /!/ i have seen similar discussions here in the past, so i hope this won't be considered off-topic. at the same time, software changes all the time so i don't think it's redundant to ask the same question that was asked a few years ago.\n\ni am considering moving away from lightroom. after about a week of research and trying a few alternatives, i am reaching the conclusion that acdsee ultimate is probably the best lightroom alternative for my needs. **i would like people with more experience than me to critique this and tell me if i got something wrong / am missing something.**\n\n&amp;#x200b;\n\nmy needs:\n\n* i am a non-professional photographer. i have about 40,000 photos and typically add about 800 - 1,000 photos every year. \n* my edits are fairly basic and i don't use any plugins.\n* the software must run on windows and come with a perpetual licence - no ~~protection money~~ periodic subscription \n\n&amp;#x200b;\n\n**what i have ruled out, and why**\n\n* corel  aftershot pro: doesn't support dngs; many users complain corel abandoned the software and stopped developing it\n* luminar: limited dam (digital asset -----> management !!! , ie poor at organising all the files) ; no keywords\n* darktable: many reviewers say it wouldn't handle libraries &gt; 40k photos well; no -----> file !!!  -----> management !!!  features; i have tried it and like acdsee better\n* digikam: dam only, limited editing\n* capture one pro: expensive, doesn't support dngs, limited dam; very advanced raw editing (too advanced for me)\n* rawtherapee: very limited dam\n\n&amp;#x200b;\n\nthoughts? thanks!", "sortedWord": "None", "identifyer": 84522, "year": "2020"}], "name": "managementphotography2020"}