{"interestingcomments": [{"Unnamed: 0": 267029, "autor": "Ghub1", "date": 1527096258000, "content": "Google maps photos question /!/ I have shared a handful of photos to Google maps and I am curious how they are viewed. I have one photo with over 1.5 million views which strikes me as odd but cool at the same time. Does anyone know how or where those views could be coming from?", "link": "https://www.reddit.com/r/photography/comments/8ll6li/google_maps_photos_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "-----> google !!!  -----> maps !!!  photos question /!/ i have shared a handful of photos to google maps and i am curious how they are viewed. i have one photo with over 1.5 million views which strikes me as odd but cool at the same time. does anyone know how or where those views could be coming from?", "sortedWord": "None", "identifyer": 12682, "year": "2018"}, {"Unnamed: 0": 269820, "autor": "symmetrygear", "date": 1527869555000, "content": "Why does photography have such a negative public perception and what can we do as a community to change that? /!/ Although I am not stopped personally too frequently while out and about shooting street photography I know that some of my photographer friends are very often questioned about their intentions when it comes to shooting in public.\nMy most recent confrontation was earlier today by a security guard. I was stood by the side of the road with my camera and he came over and asked me to remove my headphones. He asked what I was photographing and I showed him my camera screen. I was friendly and polite and he was in return. However he then said that I should be careful \"after current events with people being injured and that I should watch out for people wanting to question me when I'm photographing.\" I asked jokingly if it had been photographers committing crimes and he said no, but that it was suspicious activity.\n\nThis got me thinking - why exactly is photography so associated with crime? Surely people who are up to no good would use their iPhones, or even Google Maps to plan any kind of act of terror. Even paedophile would be a bit more discreet surely?\n\nI'm genuinely interested to know what kind of precident or examples there are of photography being directly linked to a cause of a crime or act of terror?\n\nI'm also curious to know whether there is a movement in the photographic community to help dissolve this negative perception on photography and photographers. ", "link": "https://www.reddit.com/r/photography/comments/8nt5t5/why_does_photography_have_such_a_negative_public/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "why does photography have such a negative public perception and what can we do as a community to change that? /!/ although i am not stopped personally too frequently while out and about shooting street photography i know that some of my photographer friends are very often questioned about their intentions when it comes to shooting in public.\nmy most recent confrontation was earlier today by a security guard. i was stood by the side of the road with my camera and he came over and asked me to remove my headphones. he asked what i was photographing and i showed him my camera screen. i was friendly and polite and he was in return. however he then said that i should be careful \"after current events with people being injured and that i should watch out for people wanting to question me when i'm photographing.\" i asked jokingly if it had been photographers committing crimes and he said no, but that it was suspicious activity.\n\nthis got me thinking - why exactly is photography so associated with crime? surely people who are up to no good would use their iphones, or even -----> google !!!  -----> maps !!!  to plan any kind of act of terror. even paedophile would be a bit more discreet surely?\n\ni'm genuinely interested to know what kind of precident or examples there are of photography being directly linked to a cause of a crime or act of terror?\n\ni'm also curious to know whether there is a movement in the photographic community to help dissolve this negative perception on photography and photographers. ", "sortedWord": "None", "identifyer": 15582, "year": "2018"}, {"Unnamed: 0": 269840, "autor": "folli", "date": 1528655396000, "content": "Moon Locator - An Android App to help Photographer's predicting the Moon's location /!/ I developed an Android app that predicts the Moon location during the course of a day and the year.\n\nThe Camera View (Augmented Reality) shows the position through the phone's camera and the user can fastforward throughout the day and year. \n\nThe Map View shows a 3D schematic on top of Google Maps, displaying the Moon's position and its shadow.\n\nLink on Google Play: https://play.google.com/store/apps/details?id=com.genewarrior.sunlocator.moon\n\nAny feedback is appreciated. The app is similar to another app where I've gotten some very helpful feedback from the Reddit-Photography community (Sun Locator), but this app focuses solely on the Moon.", "link": "https://www.reddit.com/r/photography/comments/8q2rr4/moon_locator_an_android_app_to_help_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "moon locator - an android app to help photographer's predicting the moon's location /!/ i developed an android app that predicts the moon location during the course of a day and the year.\n\nthe camera view (augmented reality) shows the position through the phone's camera and the user can fastforward throughout the day and year. \n\nthe map view shows a 3d schematic on top of -----> google !!!  -----> maps !!! , displaying the moon's position and its shadow.\n\nlink on google play: https://play.google.com/store/apps/details?id=com.genewarrior.sunlocator.moon\n\nany feedback is appreciated. the app is similar to another app where i've gotten some very helpful feedback from the reddit-photography community (sun locator), but this app focuses solely on the moon.", "sortedWord": "None", "identifyer": 15602, "year": "2018"}, {"Unnamed: 0": 270640, "autor": "spdorsey", "date": 1534977623000, "content": "Is there anything to shoot in Southwest Wyoming? /!/ I'm planning a major beer, biking, and photo tour of the western USA and I cannot find good places to stop in Southwest Wyoming. I have heard that Cheyenne is super bland, so I have no plans to stop there. Is there anything else worth stopping for to shoot between Ft. Collins and Idaho?\n\nthanks\n\nMap: [https://drive.google.com/open?id=1pweOdbseS1yXfI-6dJ9V-4N4jE\\_pht0c&amp;usp=sharing](https://drive.google.com/open?id=1pweOdbseS1yXfI-6dJ9V-4N4jE_pht0c&amp;usp=sharing)", "link": "https://www.reddit.com/r/photography/comments/99hwjt/is_there_anything_to_shoot_in_southwest_wyoming/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "is there anything to shoot in southwest wyoming? /!/ i'm planning a major beer, biking, and photo tour of the western usa and i cannot find good places to stop in southwest wyoming. i have heard that cheyenne is super bland, so i have no plans to stop there. is there anything else worth stopping for to shoot between ft. collins and idaho?\n\nthanks\n\n-----> map !!! : [https://drive.google.com/open?id=1pweodbses1yxfi-6dj9v-4n4je\\_pht0c&amp;usp=sharing](https://drive.google.com/open?id=1pweodbses1yxfi-6dj9v-4n4je_pht0c&amp;usp=sharing)", "sortedWord": "None", "identifyer": 16423, "year": "2018"}, {"Unnamed: 0": 271651, "autor": "azmudeuzjay19", "date": 1542699023000, "content": "The corrosion on this water tap looks like a map", "link": "https://www.reddit.com/r/photography/comments/9ypyg2/the_corrosion_on_this_water_tap_looks_like_a_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the corrosion on this water tap looks like a -----> map !!! ", "sortedWord": "None", "identifyer": 17462, "year": "2018"}, {"Unnamed: 0": 271663, "autor": "NearEarthOrbit", "date": 1542687527000, "content": "Is there a site that will host my pictures on a clickable map? Bonus points for connection to a printing service /!/ I live in an area that is rural and beautiful. It's tourist-y in the summer and cold in the winter. Towns are spread out and a few hundred people. Tons of lakes. I do aerial drone photography and want to present a clickable map on my website of pictures from their geotagged locations. Has anyone found a good method for this? If it worked well I feel like it would be a really cool way for clients to browse my pictures.\n\nI just got a Pixma Pro-10 and want to handle orders myself for prints &lt;13x19 but I would love if folks could order a canvas or print larger than that from my site.\n\nThank you for any and all advice!", "link": "https://www.reddit.com/r/photography/comments/9yoljq/is_there_a_site_that_will_host_my_pictures_on_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "is there a site that will host my pictures on a clickable -----> map !!! ? bonus points for connection to a printing service /!/ i live in an area that is rural and beautiful. it's tourist-y in the summer and cold in the winter. towns are spread out and a few hundred people. tons of lakes. i do aerial drone photography and want to present a clickable map on my website of pictures from their geotagged locations. has anyone found a good method for this? if it worked well i feel like it would be a really cool way for clients to browse my pictures.\n\ni just got a pixma pro-10 and want to handle orders myself for prints &lt;13x19 but i would love if folks could order a canvas or print larger than that from my site.\n\nthank you for any and all advice!", "sortedWord": "None", "identifyer": 17474, "year": "2018"}, {"Unnamed: 0": 272291, "autor": "ReverseTheKirs", "date": 1515680423000, "content": "PSA: Don't let your photos sit in your camera. I just had my camera stolen and I wish I had ingested my media more often. /!/ This just happened a couple hours ago and I am still upset. I'm abroad traveling in my homeland and I take photos and videos for a \"growing\" fan base on YouTube and Instagram. They are mainly about the culture of my people and aimed at educating my friends and viewers in the US about a small dot on a map. So there is a blurry line between family photos/videos and content for the public in the images I capture. \n\nI left my camera in the car to go shopping in the market for 20 minutes.  When we had gotten back, somone had broken in and stole my Canon T3i Rebel, Kit lens, 50mm f/1.8 prime lens, Rode Directional microphone, and camera stabilizer.  The gear must have totaled at least $1000 which might not be a lot for many but it is a crushing for an amature student.\n\nHowever, I can replace all my gear but I cannot replace the pictures and footage that was stored on my SD cards. I would pay another $1000 for that SD card.  My trip is almost over and I had been capturing images for the past 2 weeks. Luckily for me, I have been ingesting my media every night onto my laptop.  However, I didn't do it the past 2 nights and so I have lost almost 3 days of photos and videos.  A lot of stuff with my grandparents and cousins are gone. People I may not see for many years because plane tickets are expensive are no longer immortalized in the images I captured.\n\nSo don't end up like me. Don't be one of those people who just leaves their pictures on their camera. You probably have some New Years pictures you still haven't ingested.  Go download those images now. You never knew when you will break, lose, or have your gear stolen.\n\nEdit:\n\nYou guys have been very kind and have also given some great advice. I'll compile the tips here.\n\n* Car theft is very common everywhere. Do not leave your camera in the car unattended if you can help it.\n* On the off chance that you HAVE to leave it in a vehicle, stow it somewhere difficult to access. Stick it in the trunk, where no one is any the wiser that its there.\n* At the very least, put your memory card in your pocket.\n* BACKUP your photos, Backup your backups, and then back it up once more. Laptop, Hard drive, USB Stick, and the Cloud.\n* Memory is cheap, buy a lot of it\n* Wi-Fi cameras or cards can let you backup your photos quickly and automatically to your phone or tablet which may save you.\n\nLooking back, if I had taken some of this advice today then I would be in a much better spot. Don't be like me, take precaution or you will be taken advantage of.", "link": "https://www.reddit.com/r/photography/comments/7podji/psa_dont_let_your_photos_sit_in_your_camera_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "psa: don't let your photos sit in your camera. i just had my camera stolen and i wish i had ingested my media more often. /!/ this just happened a couple hours ago and i am still upset. i'm abroad traveling in my homeland and i take photos and videos for a \"growing\" fan base on youtube and instagram. they are mainly about the culture of my people and aimed at educating my friends and viewers in the us about a small dot on a -----> map !!! . so there is a blurry line between family photos/videos and content for the public in the images i capture. \n\ni left my camera in the car to go shopping in the market for 20 minutes.  when we had gotten back, somone had broken in and stole my canon t3i rebel, kit lens, 50mm f/1.8 prime lens, rode directional microphone, and camera stabilizer.  the gear must have totaled at least $1000 which might not be a lot for many but it is a crushing for an amature student.\n\nhowever, i can replace all my gear but i cannot replace the pictures and footage that was stored on my sd cards. i would pay another $1000 for that sd card.  my trip is almost over and i had been capturing images for the past 2 weeks. luckily for me, i have been ingesting my media every night onto my laptop.  however, i didn't do it the past 2 nights and so i have lost almost 3 days of photos and videos.  a lot of stuff with my grandparents and cousins are gone. people i may not see for many years because plane tickets are expensive are no longer immortalized in the images i captured.\n\nso don't end up like me. don't be one of those people who just leaves their pictures on their camera. you probably have some new years pictures you still haven't ingested.  go download those images now. you never knew when you will break, lose, or have your gear stolen.\n\nedit:\n\nyou guys have been very kind and have also given some great advice. i'll compile the tips here.\n\n* car theft is very common everywhere. do not leave your camera in the car unattended if you can help it.\n* on the off chance that you have to leave it in a vehicle, stow it somewhere difficult to access. stick it in the trunk, where no one is any the wiser that its there.\n* at the very least, put your memory card in your pocket.\n* backup your photos, backup your backups, and then back it up once more. laptop, hard drive, usb stick, and the cloud.\n* memory is cheap, buy a lot of it\n* wi-fi cameras or cards can let you backup your photos quickly and automatically to your phone or tablet which may save you.\n\nlooking back, if i had taken some of this advice today then i would be in a much better spot. don't be like me, take precaution or you will be taken advantage of.", "sortedWord": "None", "identifyer": 18116, "year": "2018"}, {"Unnamed: 0": 272354, "autor": "kirbypuckett34", "date": 1515611368000, "content": "Tools for scouting photography locations? Is there a way to save locations with a picture on Google Maps? /!/ I spend a lot of time driving around in the country looking for photo opportunities.  Lots of times I will find a great place/subject but the lighting isn't great or I don't have time to stop and take a picture.  Is there a way I can take a quick photo on my phone and pin it on Google maps at the location?  If not is there an app out there that works like this?  ", "link": "https://www.reddit.com/r/photography/comments/7phv17/tools_for_scouting_photography_locations_is_there/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "tools for scouting photography locations? is there a way to save locations with a picture on -----> google !!!  -----> maps !!! ? /!/ i spend a lot of time driving around in the country looking for photo opportunities.  lots of times i will find a great place/subject but the lighting isn't great or i don't have time to stop and take a picture.  is there a way i can take a quick photo on my phone and pin it on google maps at the location?  if not is there an app out there that works like this?  ", "sortedWord": "None", "identifyer": 18181, "year": "2018"}, {"Unnamed: 0": 272613, "autor": "kmilrs", "date": 1517084508000, "content": "Global map being created with photos from locals", "link": "https://www.reddit.com/r/photography/comments/7tfawj/global_map_being_created_with_photos_from_locals/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "global -----> map !!!  being created with photos from locals", "sortedWord": "None", "identifyer": 18449, "year": "2018"}, {"Unnamed: 0": 272957, "autor": "NoTimeForPoopin", "date": 1523084624000, "content": "High speed sync flash photography /!/ Hey guys, I have a senior sesh tomorrow at 3pm when it will be pretty sunny out. I want to use HSS but I'm used to doing it more around sunset. The weather, which has generally been terribly cloudy, is breaking away tomorrow when I have the booking. I mapped the sun and I can use some buildings for shadow coverage. Can anyone point me in the right direction for using HSS in kind of a bright day? It'd be much appreciated. ", "link": "https://www.reddit.com/r/photography/comments/8aghai/high_speed_sync_flash_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "high speed sync flash photography /!/ hey guys, i have a senior sesh tomorrow at 3pm when it will be pretty sunny out. i want to use hss but i'm used to doing it more around sunset. the weather, which has generally been terribly cloudy, is breaking away tomorrow when i have the booking. i -----> mapped !!!  the sun and i can use some buildings for shadow coverage. can anyone point me in the right direction for using hss in kind of a bright day? it'd be much appreciated. ", "sortedWord": "None", "identifyer": 18803, "year": "2018"}, {"Unnamed: 0": 274711, "autor": "FuturePreparation", "date": 1519086716000, "content": "Switching to documentary style has invigorated my photography /!/ In the last year or so, I became more and more frustrated with my photography and I took fewer and fewer photos. My primary goal was to shoot \"good photos\".\n\nSo I might have taken a walk through the forest with my camera with the intention to take beautiful, aesthetically pleasing photos. And even though the light might have been gorgeous and I might have seen something interesting, most often I didn't even bother to take the photo, because it just wouldn't have been \"really good\". Without realising it, I judged my photos by unachievable standards, mainly because of my Instagram consumption.\n\nA simple walk through an average landscape can't really compare to four hours location scouting on google maps, rising at 3 a.m., driving three hours to the perfect spot and then setting up your gear and waiting another hour for the perfect conditions.\n\nSo a few months ago I switched to a more documentary style photography. My primary intention to take photos (and also short videos and timelapses) these days is not trying to take super amazing photos but to just document my life. Documenting can mean just taking a photo of my potted plants or taking a selfie when I feel a certain way or simply taking a snapshot of some detail I might find interesting.\n\nAs far as \"aesthetic\" photography is concerned I am more focused on capturing a certain atmosphere or moment in time. So if I am in a certain landscape, I try to ask myself what I feel here, what the nature of this place is and how I best capture it (in camera and also through post-processing).\n\nTaking photos this way not only is more fun to me but it is also more rewarding in review. When I look at my old photos I often find, that I don't really care about them, because they weren't really connected to my life. They were mostly efforts to achieve some \"objective\" standard of beauty and as a result they were basically meaningless.\nAs a sidenote it also helped me to less focus about gear. I can only recommend it.\n\nEdit1: Grammar\n\nEdit2: Thank you for all your responses and sharing your experiences.", "link": "https://www.reddit.com/r/photography/comments/7yroyk/switching_to_documentary_style_has_invigorated_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "switching to documentary style has invigorated my photography /!/ in the last year or so, i became more and more frustrated with my photography and i took fewer and fewer photos. my primary goal was to shoot \"good photos\".\n\nso i might have taken a walk through the forest with my camera with the intention to take beautiful, aesthetically pleasing photos. and even though the light might have been gorgeous and i might have seen something interesting, most often i didn't even bother to take the photo, because it just wouldn't have been \"really good\". without realising it, i judged my photos by unachievable standards, mainly because of my instagram consumption.\n\na simple walk through an average landscape can't really compare to four hours location scouting on -----> google !!!  -----> maps !!! , rising at 3 a.m., driving three hours to the perfect spot and then setting up your gear and waiting another hour for the perfect conditions.\n\nso a few months ago i switched to a more documentary style photography. my primary intention to take photos (and also short videos and timelapses) these days is not trying to take super amazing photos but to just document my life. documenting can mean just taking a photo of my potted plants or taking a selfie when i feel a certain way or simply taking a snapshot of some detail i might find interesting.\n\nas far as \"aesthetic\" photography is concerned i am more focused on capturing a certain atmosphere or moment in time. so if i am in a certain landscape, i try to ask myself what i feel here, what the nature of this place is and how i best capture it (in camera and also through post-processing).\n\ntaking photos this way not only is more fun to me but it is also more rewarding in review. when i look at my old photos i often find, that i don't really care about them, because they weren't really connected to my life. they were mostly efforts to achieve some \"objective\" standard of beauty and as a result they were basically meaningless.\nas a sidenote it also helped me to less focus about gear. i can only recommend it.\n\nedit1: grammar\n\nedit2: thank you for all your responses and sharing your experiences.", "sortedWord": "None", "identifyer": 20639, "year": "2018"}, {"Unnamed: 0": 275151, "autor": "NotLurk1ng", "date": 1527571423000, "content": "Are there any websites that map natural light by region and time of day? /!/ I'm a new photographer and enjoy nature photography.\n\nUp here in Seattle light is very extreme by season and time of day. \n\nMaybe this is crazy, but is tnere a website that can tell you what the light (without clouds) might be like dependent on season and time of day?\n\nThank you!\n\nPs I swear I tried to google this first!", "link": "https://www.reddit.com/r/photography/comments/8mwl6k/are_there_any_websites_that_map_natural_light_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "are there any websites that -----> map !!!  natural light by region and time of day? /!/ i'm a new photographer and enjoy nature photography.\n\nup here in seattle light is very extreme by season and time of day. \n\nmaybe this is crazy, but is tnere a website that can tell you what the light (without clouds) might be like dependent on season and time of day?\n\nthank you!\n\nps i swear i tried to google this first!", "sortedWord": "None", "identifyer": 21101, "year": "2018"}, {"Unnamed: 0": 275277, "autor": "CanOnlyBeNice", "date": 1528229570000, "content": "Best site for prints?? /!/ Hey guys and gals. So a high end restaurant owner contacted me to do a 2 month commissioned gallery showing (yay!). I’ve dabbled with prints from a bunch of different sites and have found the consistency to be all over the map. \nArt.com sent me a print that’s darkness was equal to my monitor set on the absolute lowest light setting and that’s just not going to work. \n\nArtmill is great but I don’t think they do basic printing. Everything seems to be mounted in someway. \n\nBasically what I’m looking for is a site that can do custom prints that show the same as what I see when they’re sent. \n\nSide note: it’s not a calibration issue with Art.com. They just print super dark for some reason. Thanks!", "link": "https://www.reddit.com/r/photography/comments/8ou42j/best_site_for_prints/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "best site for prints?? /!/ hey guys and gals. so a high end restaurant owner contacted me to do a 2 month commissioned gallery showing (yay!). i’ve dabbled with prints from a bunch of different sites and have found the consistency to be all over the -----> map !!! . \nart.com sent me a print that’s darkness was equal to my monitor set on the absolute lowest light setting and that’s just not going to work. \n\nartmill is great but i don’t think they do basic printing. everything seems to be mounted in someway. \n\nbasically what i’m looking for is a site that can do custom prints that show the same as what i see when they’re sent. \n\nside note: it’s not a calibration issue with art.com. they just print super dark for some reason. thanks!", "sortedWord": "None", "identifyer": 21232, "year": "2018"}, {"Unnamed: 0": 277091, "autor": "Gugaomelhor", "date": 1535367455000, "content": "Spot/place Chooser App/Website /!/ Hello Reddit!\nI was wondering if there is an app or a website where you basically have Google Maps (with pinning options, lists, etc), overlayed with any weather radar and a lightpollution map. It would be a great tool especially for astrophotography.\nIf this doesn't already exist, I'd love to create something like this myself, but I have no idea where to begin (I have no experience with programming or app development) Any ideas?\n", "link": "https://www.reddit.com/r/photography/comments/9anya9/spotplace_chooser_appwebsite/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "spot/place chooser app/website /!/ hello reddit!\ni was wondering if there is an app or a website where you basically have -----> google !!!  -----> maps !!!  (with pinning options, lists, etc), overlayed with any weather radar and a lightpollution map. it would be a great tool especially for astrophotography.\nif this doesn't already exist, i'd love to create something like this myself, but i have no idea where to begin (i have no experience with programming or app development) any ideas?\n", "sortedWord": "None", "identifyer": 23121, "year": "2018"}, {"Unnamed: 0": 277519, "autor": "anonymoooooooose", "date": 1536923947000, "content": "2018 Fall Foliage Map &amp; Nationwide Peak Leaf Forecast", "link": "https://www.reddit.com/r/photography/comments/9fr4wl/2018_fall_foliage_map_nationwide_peak_leaf/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "2018 fall foliage -----> map !!!  &amp; nationwide peak leaf forecast", "sortedWord": "None", "identifyer": 23564, "year": "2018"}, {"Unnamed: 0": 279199, "autor": "John4REYcomp", "date": 1542655936000, "content": "editing on a 4k tv...good idea? /!/ I've been hemming and hawing over what display to get for my new PC (it's got a Ryzen 2600 and an 8GB RX 580, so it can definitely drive nicer/bigger screens), and I keep thinking that a 4k TV would be my best bang for my buck.  Specifically the 43\" TCL S405.  My \"problem\" is that I am getting back into PC gaming to go along with photo editing, so I've been all over the map looking at different monitors.  1080p is great for games, but not for photos.  1440p (QHD) is a nice compromise, but a bit expensive in most cases.  and 4k monitors, according to forum posts (so it's gotta be true) don't like running lower than native (and some games are going to need that flexibility in the future).\n\nBut that model tv from TCL has native output for both 4k (photos and regular computer stuff) and 1080 (for higher FPS gaming...so I can't be the 1st person to think this way...\n\nso any of y'all have first hand experience using a 4k TV for photo editing?  perhaps maybe even this TCL specifically?", "link": "https://www.reddit.com/r/photography/comments/9yk1z2/editing_on_a_4k_tvgood_idea/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "editing on a 4k tv...good idea? /!/ i've been hemming and hawing over what display to get for my new pc (it's got a ryzen 2600 and an 8gb rx 580, so it can definitely drive nicer/bigger screens), and i keep thinking that a 4k tv would be my best bang for my buck.  specifically the 43\" tcl s405.  my \"problem\" is that i am getting back into pc gaming to go along with photo editing, so i've been all over the -----> map !!!  looking at different monitors.  1080p is great for games, but not for photos.  1440p (qhd) is a nice compromise, but a bit expensive in most cases.  and 4k monitors, according to forum posts (so it's gotta be true) don't like running lower than native (and some games are going to need that flexibility in the future).\n\nbut that model tv from tcl has native output for both 4k (photos and regular computer stuff) and 1080 (for higher fps gaming...so i can't be the 1st person to think this way...\n\nso any of y'all have first hand experience using a 4k tv for photo editing?  perhaps maybe even this tcl specifically?", "sortedWord": "None", "identifyer": 25300, "year": "2018"}, {"Unnamed: 0": 280204, "autor": "abphotos", "date": 1515726522000, "content": "Making Locations Work For You /!/ I wrote this on my website a few months ago, and thought it might be worth reposting here if it helps some new starters in portrait photography. This is basically around how I organise and plan my on-location shoots so that I can work to a location’s strengths and ensure a successful shoot, as well as some example locations that are publicly accessible around my hometown, Sydney. This advice isn't for large commercial teams or projects - those will usually need permits. But if you’re shooting light for creative/portfolio development, this advice may be right up your alley.\n\n\nI have to be quite flexible with the location for my shoots. I select a location based on one or more of the following factors: Shoot Style, Time of Day &amp; Geographical Area.\n\n\n**Shoot Style**\n\nThe style of shoot can be your biggest factor when selecting a location. This can include shooting for swim, street, activewear, or simply knowing you have to shoot at a particular location by request. If you’re lucky though, you have creative control to influence this in some way. For example, swimwear may look just as good at a garden, beach house or pool and doesn’t require a beach in sight. The more creative you are with your locations, the more interesting and novel your shoots could be.\n\n\nRecognise the strengths of different location types and adjust your shoot to take advantage of them. Keep a shortlist of locations that have worked for you so you’re not starting from scratch for every shoot, which can be hard. I save my locations on Google Maps so I can review them when looking at the area I might look to shoot in. This is a godsend for me.\n\n\n**Time of Day**\n\nThis to me is the factor with the biggest impact on the look of your photos. When you don’t have time to scout locations (and I don’t), you can instead rely on a couple of great tools: Google Maps and [Suncalc](http://suncalc.net/). Suncalc overlays itself on Google Maps and shows you the arc of the sun throughout any day. It will give you a pretty good idea of where the sun will be, and based on the type of location you can use this to decide whether it’s appropriate for your aesthetic.\n\n\nFor example, shooting a late afternoon session on an east-facing beach will probably see you plunged into darkness well before sunset as the buildings cast a shadow over the whole beach. Using suncalc can instead help you find locations that might be facing more towards the sun and therefore get you more time to shoot (I use Vaucluse a lot for late afternoon shoots). Personally my favourite times of day are during sunrise and sunset so that I can get more interesting natural light punching through the shot, but that's just my style. When it comes to shooting inland, streetview and community-submitted photos are also your friend because buildings and elevation can limit the type of light you’ll have and viewing the street imagery will help you see what you’re in for.\n\n\nThere’s also a case to be made about shooting indoors - if you’re lucky enough to have a place offered. I’ve done a number of shoots in apartments and used the furnishings and decorations to modify the light and create some really great scenes. \n\n\nIf I’m shooting when the sun is high in the sky, I look for man-made structures that can give me more interesting backgrounds, but can also shield myself and the model from the sun - or even act as a reflector to provide more even light. Fortunately the more limited you are the more creative you have to be. If you're struggling to find structures to help you, instead adjust poses to make use of the light. Embrace the harsh lighting! Focus instead on the leading lines, the shadows and the overall mood of the day that you and your model have control of.\n\n\n**Geographical Area**\n\nYou’ll also have to address the location types available to you. If you live on the coast, you may have access to heaps of great beaches. If you live inland, not so much - but perhaps you can find a lake, lagoon, or pool if you need water. If you live in mountains and pick your time of day appropriately, you’ll get some stunning images. I am fortunate to live in Sydney and have access to some of the greatest beach locations, but you’ll find a lot of my work is shot all over Sydney or parkland a few hours out. Sometimes I just shoot down an alley. Check out your local tennis/basketball courts and book a slot when it’s not busy. Use the colours and lines to your advantage.\n\n\nIt’s easy to think you’re limited by only having access to public spaces for shoots. But then I remember how I wouldn’t have come up with a lot of the lighting, backdrops and poses without being challenged in the first place. Think critically about your surroundings - what types of public spaces are there? What about alleyways, or interesting homes? Rooftops, backyards, even carparks can all allow you to be creative and produce something amazing. Locations that I’ve struggled with the most have yielded some of my favourite photos due to the unusual angles, lighting and backdrops that resulted from it.\n\n\n\n**TLDR:** Use Google Maps and [Suncalc](http://suncalc.net/).", "link": "https://www.reddit.com/r/photography/comments/7ptpdu/making_locations_work_for_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "making locations work for you /!/ i wrote this on my website a few months ago, and thought it might be worth reposting here if it helps some new starters in portrait photography. this is basically around how i organise and plan my on-location shoots so that i can work to a location’s strengths and ensure a successful shoot, as well as some example locations that are publicly accessible around my hometown, sydney. this advice isn't for large commercial teams or projects - those will usually need permits. but if you’re shooting light for creative/portfolio development, this advice may be right up your alley.\n\n\ni have to be quite flexible with the location for my shoots. i select a location based on one or more of the following factors: shoot style, time of day &amp; geographical area.\n\n\n**shoot style**\n\nthe style of shoot can be your biggest factor when selecting a location. this can include shooting for swim, street, activewear, or simply knowing you have to shoot at a particular location by request. if you’re lucky though, you have creative control to influence this in some way. for example, swimwear may look just as good at a garden, beach house or pool and doesn’t require a beach in sight. the more creative you are with your locations, the more interesting and novel your shoots could be.\n\n\nrecognise the strengths of different location types and adjust your shoot to take advantage of them. keep a shortlist of locations that have worked for you so you’re not starting from scratch for every shoot, which can be hard. i save my locations on -----> google !!!  -----> maps !!!  so i can review them when looking at the area i might look to shoot in. this is a godsend for me.\n\n\n**time of day**\n\nthis to me is the factor with the biggest impact on the look of your photos. when you don’t have time to scout locations (and i don’t), you can instead rely on a couple of great tools: google maps and [suncalc](http://suncalc.net/). suncalc overlays itself on google maps and shows you the arc of the sun throughout any day. it will give you a pretty good idea of where the sun will be, and based on the type of location you can use this to decide whether it’s appropriate for your aesthetic.\n\n\nfor example, shooting a late afternoon session on an east-facing beach will probably see you plunged into darkness well before sunset as the buildings cast a shadow over the whole beach. using suncalc can instead help you find locations that might be facing more towards the sun and therefore get you more time to shoot (i use vaucluse a lot for late afternoon shoots). personally my favourite times of day are during sunrise and sunset so that i can get more interesting natural light punching through the shot, but that's just my style. when it comes to shooting inland, streetview and community-submitted photos are also your friend because buildings and elevation can limit the type of light you’ll have and viewing the street imagery will help you see what you’re in for.\n\n\nthere’s also a case to be made about shooting indoors - if you’re lucky enough to have a place offered. i’ve done a number of shoots in apartments and used the furnishings and decorations to modify the light and create some really great scenes. \n\n\nif i’m shooting when the sun is high in the sky, i look for man-made structures that can give me more interesting backgrounds, but can also shield myself and the model from the sun - or even act as a reflector to provide more even light. fortunately the more limited you are the more creative you have to be. if you're struggling to find structures to help you, instead adjust poses to make use of the light. embrace the harsh lighting! focus instead on the leading lines, the shadows and the overall mood of the day that you and your model have control of.\n\n\n**geographical area**\n\nyou’ll also have to address the location types available to you. if you live on the coast, you may have access to heaps of great beaches. if you live inland, not so much - but perhaps you can find a lake, lagoon, or pool if you need water. if you live in mountains and pick your time of day appropriately, you’ll get some stunning images. i am fortunate to live in sydney and have access to some of the greatest beach locations, but you’ll find a lot of my work is shot all over sydney or parkland a few hours out. sometimes i just shoot down an alley. check out your local tennis/basketball courts and book a slot when it’s not busy. use the colours and lines to your advantage.\n\n\nit’s easy to think you’re limited by only having access to public spaces for shoots. but then i remember how i wouldn’t have come up with a lot of the lighting, backdrops and poses without being challenged in the first place. think critically about your surroundings - what types of public spaces are there? what about alleyways, or interesting homes? rooftops, backyards, even carparks can all allow you to be creative and produce something amazing. locations that i’ve struggled with the most have yielded some of my favourite photos due to the unusual angles, lighting and backdrops that resulted from it.\n\n\n\n**tldr:** use google maps and [suncalc](http://suncalc.net/).", "sortedWord": "None", "identifyer": 26337, "year": "2018"}, {"Unnamed: 0": 284277, "autor": "dekdekwho", "date": 1532120174000, "content": "What’s a place or thing you wanted to take a photo of but never had a chance? /!/ As a photographer, we are always for a look out for something that catches our eyes. There are several places in my city where I would love to create a series on Americana( Eggleston-like places) buildings that have a vintage feel to it but on my google map list it’s all spread out and biking with a film camera in my backpack is a challenge, however I been to those places and shot several photos of it. In my question, was there a place you wanted to take a photo of but you had or never had a chance.", "link": "https://www.reddit.com/r/photography/comments/90jpjb/whats_a_place_or_thing_you_wanted_to_take_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "what’s a place or thing you wanted to take a photo of but never had a chance? /!/ as a photographer, we are always for a look out for something that catches our eyes. there are several places in my city where i would love to create a series on americana( eggleston-like places) buildings that have a vintage feel to it but on my google -----> map !!!  list it’s all spread out and biking with a film camera in my backpack is a challenge, however i been to those places and shot several photos of it. in my question, was there a place you wanted to take a photo of but you had or never had a chance.", "sortedWord": "None", "identifyer": 30566, "year": "2018"}, {"Unnamed: 0": 286173, "autor": "homedesignpro", "date": 1538669283000, "content": "27 Various Ways To Do Home Design Software Online | home design software online /!/ Sick of afraid to aloof one clear architecture software program? Why don’t you accord some new online clear architecture software a try instead?\n\n98+ Free Home Design Programs For Windows 7 – Container … – home design software online | home design software online\n   \nWe’ve aggregate a sampling of 10 beautiful, accessible, and convenient options to empower you to acquisition a architecture software that works altogether for you—and will advice you actualize some absolute stunners to accommodate in your online architecture portfolio.\n\nIf arrangement is the aroma of life, Architecture Wizard is the tastiest clear architecture software advantage on the menu—and one of the best accessible. With its able absorption to beheld detail, Architecture Wizard offers bags of aesthetically adorable templates for both amusing media and print, as able-bodied as over a actor high-quality images (including icons, vectors, and cellophane images).\n\nThe expertly curated beheld library is adapted daily, and is brimming of amaranthine video, illustration, and cartoon options. Everything is accountant and actually attainable for bartering use\n\nAnd with a ambit of bales from Apprentice (free!) to Expert ($16.95 monthly), every annual is welcome.\n\nDesign Wizard at a glance:\n\nAnyone can actualize captivating, professional-grade beheld agreeable with this chargeless clear architecture software. BeFunky’s capital alms comprises three artistic accoutrement that are simple abundant for beginners but able abundant to accouterment a arrangement projects: Photo Editor, Collage Maker, and Designer.\n\nBeFunky’s “fun and functional” architecture software proves that you don’t charge a accomplishments in architecture to aftermath beauteous results. With the advantage to assignment from admirable pre-designed templates or body your own from scratch, there’s a ton of artistic flexibility.\n\nBeFunky at a glance:\n\nWhat if creating a admirable beheld canvas was as attainable as drag-and-drop? Canva makes it accessible by prioritizing simplicity, variety, and affordability.\n\nWhen you appointment their website, you will be asked to announce what you’re appliance Canva’s architecture software for—education, baby business, ample company, non-profit, and so on. Canva wants to accommodate an accomplished acquaintance for designers of all kinds.\n\nHouse design software free download – home design software online | home design software online\n   \nBilled primarily as a photo editor, Canva is a actual Swiss army knife: it additionally works as a blush palette generator, chantry another tool, photo collage assembler, and infographic maker. It additionally appearance hundreds of chargeless architecture elements for every project. Canva alike provides online educational resources.\n\nCanva at a glance:\n\nA able and automatic (and did we acknowledgment free?) another to Adobe Photoshop, Pixlr additionally fabricated our annual of the best chargeless online photo editors. With over 500 actor users, we’re not the alone fans.\n\nBut Pixlr additionally holds its own as a solid chargeless clear architecture software option, abnormally for beginners who don’t appetite to advance too abundant time and money or apprentice a complicated appliance beeline out of the gate.\n\nYou can get started creating and alteration admirable images with Pixlr’s able-bodied toolset in actually minutes, anon in your internet browser or via iPhone or Adroid apps—without any bizarre accession process.\n\nThough Pixlr is abnormally absurd for alteration photos on-the-go and provides a chargeless agent editor and an arrangement of chargeless fonts, graphics, and banal images, abounding avant-garde appearance crave a Pixlr Pro account. Luckily, it’s a baby amount to pay, as far as online clear architecture software goes, at aloof $5 a month.\n\nPixlr at a glance:\n\nWith an alarming angel annal of over 65 actor files, 12,000 templates, and hundreds of fonts, Crello is a frontrunner for best able clear architecture software advantage on the list. With expertly created templates that can be customized in a simple and automated way, Crello makes designing enjoyable.\n\nThis architecture software can advice you actualize an all-encompassing arrangement of aesthetically beauteous designs for book materials, agenda ads, and amusing media posts. You can alike actualize activated graphics. Beheld assets are organized into themed collections to advice affect you.\n\nIf there’s abundant jerk allowance in your budget, we advance blockage out Crello Pro; it’s alone $8.30 a month. Featuring absolute bartering use after Crello watermarks or branding and admission to avant-garde action functionality, it’s able-bodied annual it.\n\nFree Download 3d Home Architect Software | brucall.com – home design software online | home design software online\n   \nCrello at a glance:\n\nThe best clear architecture software for beginners is one that makes designing feel like a snap. Enter Snappa, the cartoon software that will acquiesce you to architecture like a pro.\n\nSnappa break bottomward the architecture action into easy, actionable steps. You can acquisition the absolute angel ambit (whether it be for a blog, ad, email, or amusing media platform) in a one click, accept from bags of crowd-pleasing templates in the blink of an eye, and booty advantage of over 500,000 beautiful, high-quality banal photos in seconds.\n\nYou can additionally affix your Buffer annual to Snappa to pre-schedule your posts, add a arrangement of argument and furnishings to images, resize cartoon for cross-platform posting, and accomplish use of abounding added adorable chargeless features.\n\nSnappa at a glance:\n\nA accepted online clear architecture toolkit, Infogram transforms charts, graphs, maps, graphics, dashboards, amusing media visuals, and added into little works of art. Infogram’s architecture address spans several industries including the non-profit sector, online publishing, education, and government, allowance all kinds of business advance their own cast themes. Select from over 20 professionally advised capacity or go rogue with your own blush palette, logo, and fonts.\n\nInfogram’s automatic drag-and-drop editor allows you to bung in your abstracts and transform it into article aesthetically admirable and impactful—quickly. Along with alone architecture options, there are additionally assorted appraisement options for every creative, entrepreneur, business, and enterprise.\n\nInfogram at a glance:\n\nTake your 2D account and accompany them to activity with Tinkercad, an calmly simple online clear architecture toolkit for creating avant-garde 3D designs and coding. Catering to designers and creatives of all levels, Tinkercad is actually free. You can get started immediately—nothing to download, no diffuse accession process.\n\nWith an alluring arcade of designs conceived by a association of creators to atom your inspiration, you’ll be agog to alpha acquirements 3D design. Tinkercad’s motto? “No acquaintance preferred.” Get started with Tinkercad’s acquirements assets and you’ll never attending back.\n\nToday's Impact of Free Home Interior Design Software … – home design software online | home design software online\n   \nTinkercad at a glance:\n\nYou ability already be accustomed with this chargeless clear architecture software beneath its antecedent name, Gravit. Billed as a “cross-platform architecture apparatus for the 21st century,” Gravit Designer delivers the goods.\n\nWhether you use it online or download it as an app, Gravit Architecture is an absurd ability for agent architecture and comes with a actively able-bodied toolkit. Icon designs, logo presentations, analogy work, animation, argument integration? You’re covered.\n\nDesigned for artlessness and affluence of use, the belvedere is still diminutive abundant for a advanced arrangement of projects. A austere advantage for active designers is the Gravit Billow account that will let you design-on-the-go from any device, anywhere with internet access. Talk about a abundance boost!\n\nGravit Designer at a glance:\n\nVectr is a chargeless clear architecture software for creating admirable agent cartoon that is both affected and attainable to use. Simple and streamlined, designers at any akin can jump appropriate into their assignment after any annoying acquirements curve.\n\nAnother abundant cross-platform option, Vectr will synch your projects in real-time so you can activate designing at home on your desktop web browser and abide after on your iPad. It’s a actually seamless experience. What’s more, you can admission collaborators admission to your certificate so that they can watch you actualize and adapt as it happens.\n\nWhether you’re alive on website architecture mockups, cast logos, presentations, brochures, posters, and more, your designs will attending brittle and clear—no amount the size. The sky’s the limit!\n\nVectr at a glance:\n\nMore budget-friendly online assets for creatives:11 Extremely Helpful (And Free!) Online Clear Architecture CoursesThe Best Online Analogy Classes for ArtistsBest Chargeless Online Courses and Tutorials for Photographers\n\nBest Home Design Software Free – home design software online | home design software online\n   \n27 Various Ways To Do Home Design Software Online | home design software online – home design software online\n   \n | Welcome to help my personal blog, with this time I am going to explain to you with regards to keyword. And from now on, this can be the primary photograph:\n\nHouse Design Software Free Download Full Version – YouTube – home design software online | home design software online\n   \nThink about picture preceding? is that will amazing???. if you think maybe consequently, I’l d explain to you many photograph again below:\n\nSo, if you’d like to get the magnificent pics related to (27 Various Ways To Do Home Design Software Online | home design software online), just click save link to download these shots to your personal computer. They’re ready for download, if you want and wish to obtain it, simply click save symbol on the page, and it’ll be immediately down loaded in your laptop.} Lastly if you like to have new and latest picture related with (27 Various Ways To Do Home Design Software Online | home design software online), please follow us on google plus or save this website, we try our best to offer you regular up-date with fresh and new images. We do hope you like staying right here. For many updates and recent news about (27 Various Ways To Do Home Design Software Online | home design software online) graphics, please kindly follow us on tweets, path, Instagram and google plus, or you mark this page on bookmark section, We try to give you up-date regularly with fresh and new pictures, love your searching, and find the best for you.\n\nThanks for visiting our website, contentabove (27 Various Ways To Do Home Design Software Online | home design software online) published .  At this time we are pleased to declare that we have found a veryinteresting contentto be reviewed, namely (27 Various Ways To Do Home Design Software Online | home design software online) Lots of people searching for details about(27 Various Ways To Do Home Design Software Online | home design software online) and of course one of these is you, is not it?\n\n10 Best Free Online Virtual Room Programs and Tools – home design software online | home design software online\n   \nOpen Position Guitar Chords Chart – dummies – home design software online | home design software online\n   \nHome Design Software Download | Joy Studio Design Gallery … – home design software online | home design software online\n   \nIntroduction to Software Evolution: The Software Volcano – home design software online | home design software online\n   \nEasy House Design Software – home design software online | home design software online\n   \nHome designing software – 1HomeDesigns.Com – home design software online | home design software online\n   \nFree Home Design Software Reviews – home design software online | home design software online\n   \n45 Lovely Pc Home Design software Home Design idea – home design software online | home design software online\n   \nFree Home Design Software Reviews – home design software online | home design software online\n   \nFree home design software for Windows – home design software online | home design software online\n   \nHouse Design Software Free Download 3d – YouTube – home design software online | home design software online\n   \n3D Home Designing Software | Star Dreams Homes – home design software online | home design software online\n   \nArchitecture. Decorating And Furnishing A Room Planner 3d: Architecture Design Design A Floorplan To Game Arranger Making Make 3 – home design software online | home design software online\n   \nDesign Your Own Home Using Best House Design Software … – home design software online | home design software online\n   \nMy Beautiful Home by American Leather: Our Top 5 Online … – home design software online | home design software online\n   \n3d House Design App Free Download – YouTube – home design software online | home design software online\n   \n3d House Design App Free Download – YouTube – home design software online | home design software online\n   \nAdobe Animate replaces Flash Pro – News – Digital Arts – home design software online | home design software online\n   \n100+ Home Design Gold Free Porcelain Tile Looks Like Calacatta Gold Evolution U2013 Pental Sit To,Harvest Gold Toilet Seat Comfo – home design software online | home design software online\n   \nBest FREE Online Home Interior Design Software Programs – home design software online | home design software online\n   \nFree Home Design Software Reviews – home design software online | home design software online\n   \nThe post [27 Various Ways To Do Home Design Software Online | home design software online](https://homedesignpro.online/27-various-ways-to-do-home-design-software-online-home-design-software-online/) appeared first on [Home Design Pro](https://homedesignpro.online).\n\n   \n   \n from WordPress https://ift.tt/2y0QOmJ\n   \n", "link": "https://www.reddit.com/r/photography/comments/9ld9dg/27_various_ways_to_do_home_design_software_online/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "27 various ways to do home design software online | home design software online /!/ sick of afraid to aloof one clear architecture software program? why don’t you accord some new online clear architecture software a try instead?\n\n98+ free home design programs for windows 7 – container … – home design software online | home design software online\n   \nwe’ve aggregate a sampling of 10 beautiful, accessible, and convenient options to empower you to acquisition a architecture software that works altogether for you—and will advice you actualize some absolute stunners to accommodate in your online architecture portfolio.\n\nif arrangement is the aroma of life, architecture wizard is the tastiest clear architecture software advantage on the menu—and one of the best accessible. with its able absorption to beheld detail, architecture wizard offers bags of aesthetically adorable templates for both amusing media and print, as able-bodied as over a actor high-quality images (including icons, vectors, and cellophane images).\n\nthe expertly curated beheld library is adapted daily, and is brimming of amaranthine video, illustration, and cartoon options. everything is accountant and actually attainable for bartering use\n\nand with a ambit of bales from apprentice (free!) to expert ($16.95 monthly), every annual is welcome.\n\ndesign wizard at a glance:\n\nanyone can actualize captivating, professional-grade beheld agreeable with this chargeless clear architecture software. befunky’s capital alms comprises three artistic accoutrement that are simple abundant for beginners but able abundant to accouterment a arrangement projects: photo editor, collage maker, and designer.\n\nbefunky’s “fun and functional” architecture software proves that you don’t charge a accomplishments in architecture to aftermath beauteous results. with the advantage to assignment from admirable pre-designed templates or body your own from scratch, there’s a ton of artistic flexibility.\n\nbefunky at a glance:\n\nwhat if creating a admirable beheld canvas was as attainable as drag-and-drop? canva makes it accessible by prioritizing simplicity, variety, and affordability.\n\nwhen you appointment their website, you will be asked to announce what you’re appliance canva’s architecture software for—education, baby business, ample company, non-profit, and so on. canva wants to accommodate an accomplished acquaintance for designers of all kinds.\n\nhouse design software free download – home design software online | home design software online\n   \nbilled primarily as a photo editor, canva is a actual swiss army knife: it additionally works as a blush palette generator, chantry another tool, photo collage assembler, and infographic maker. it additionally appearance hundreds of chargeless architecture elements for every project. canva alike provides online educational resources.\n\ncanva at a glance:\n\na able and automatic (and did we acknowledgment free?) another to adobe photoshop, pixlr additionally fabricated our annual of the best chargeless online photo editors. with over 500 actor users, we’re not the alone fans.\n\nbut pixlr additionally holds its own as a solid chargeless clear architecture software option, abnormally for beginners who don’t appetite to advance too abundant time and money or apprentice a complicated appliance beeline out of the gate.\n\nyou can get started creating and alteration admirable images with pixlr’s able-bodied toolset in actually minutes, anon in your internet browser or via iphone or adroid apps—without any bizarre accession process.\n\nthough pixlr is abnormally absurd for alteration photos on-the-go and provides a chargeless agent editor and an arrangement of chargeless fonts, graphics, and banal images, abounding avant-garde appearance crave a pixlr pro account. luckily, it’s a baby amount to pay, as far as online clear architecture software goes, at aloof $5 a month.\n\npixlr at a glance:\n\nwith an alarming angel annal of over 65 actor files, 12,000 templates, and hundreds of fonts, crello is a frontrunner for best able clear architecture software advantage on the list. with expertly created templates that can be customized in a simple and automated way, crello makes designing enjoyable.\n\nthis architecture software can advice you actualize an all-encompassing arrangement of aesthetically beauteous designs for book materials, agenda ads, and amusing media posts. you can alike actualize activated graphics. beheld assets are organized into themed collections to advice affect you.\n\nif there’s abundant jerk allowance in your budget, we advance blockage out crello pro; it’s alone $8.30 a month. featuring absolute bartering use after crello watermarks or branding and admission to avant-garde action functionality, it’s able-bodied annual it.\n\nfree download 3d home architect software | brucall.com – home design software online | home design software online\n   \ncrello at a glance:\n\nthe best clear architecture software for beginners is one that makes designing feel like a snap. enter snappa, the cartoon software that will acquiesce you to architecture like a pro.\n\nsnappa break bottomward the architecture action into easy, actionable steps. you can acquisition the absolute angel ambit (whether it be for a blog, ad, email, or amusing media platform) in a one click, accept from bags of crowd-pleasing templates in the blink of an eye, and booty advantage of over 500,000 beautiful, high-quality banal photos in seconds.\n\nyou can additionally affix your buffer annual to snappa to pre-schedule your posts, add a arrangement of argument and furnishings to images, resize cartoon for cross-platform posting, and accomplish use of abounding added adorable chargeless features.\n\nsnappa at a glance:\n\na accepted online clear architecture toolkit, infogram transforms charts, graphs, -----> maps !!! , graphics, dashboards, amusing media visuals, and added into little works of art. infogram’s architecture address spans several industries including the non-profit sector, online publishing, education, and government, allowance all kinds of business advance their own cast themes. select from over 20 professionally advised capacity or go rogue with your own blush palette, logo, and fonts.\n\ninfogram’s automatic drag-and-drop editor allows you to bung in your abstracts and transform it into article aesthetically admirable and impactful—quickly. along with alone architecture options, there are additionally assorted appraisement options for every creative, entrepreneur, business, and enterprise.\n\ninfogram at a glance:\n\ntake your 2d account and accompany them to activity with tinkercad, an calmly simple online clear architecture toolkit for creating avant-garde 3d designs and coding. catering to designers and creatives of all levels, tinkercad is actually free. you can get started immediately—nothing to download, no diffuse accession process.\n\nwith an alluring arcade of designs conceived by a association of creators to atom your inspiration, you’ll be agog to alpha acquirements 3d design. tinkercad’s motto? “no acquaintance preferred.” get started with tinkercad’s acquirements assets and you’ll never attending back.\n\ntoday's impact of free home interior design software … – home design software online | home design software online\n   \ntinkercad at a glance:\n\nyou ability already be accustomed with this chargeless clear architecture software beneath its antecedent name, gravit. billed as a “cross-platform architecture apparatus for the 21st century,” gravit designer delivers the goods.\n\nwhether you use it online or download it as an app, gravit architecture is an absurd ability for agent architecture and comes with a actively able-bodied toolkit. icon designs, logo presentations, analogy work, animation, argument integration? you’re covered.\n\ndesigned for artlessness and affluence of use, the belvedere is still diminutive abundant for a advanced arrangement of projects. a austere advantage for active designers is the gravit billow account that will let you design-on-the-go from any device, anywhere with internet access. talk about a abundance boost!\n\ngravit designer at a glance:\n\nvectr is a chargeless clear architecture software for creating admirable agent cartoon that is both affected and attainable to use. simple and streamlined, designers at any akin can jump appropriate into their assignment after any annoying acquirements curve.\n\nanother abundant cross-platform option, vectr will synch your projects in real-time so you can activate designing at home on your desktop web browser and abide after on your ipad. it’s a actually seamless experience. what’s more, you can admission collaborators admission to your certificate so that they can watch you actualize and adapt as it happens.\n\nwhether you’re alive on website architecture mockups, cast logos, presentations, brochures, posters, and more, your designs will attending brittle and clear—no amount the size. the sky’s the limit!\n\nvectr at a glance:\n\nmore budget-friendly online assets for creatives:11 extremely helpful (and free!) online clear architecture coursesthe best online analogy classes for artistsbest chargeless online courses and tutorials for photographers\n\nbest home design software free – home design software online | home design software online\n   \n27 various ways to do home design software online | home design software online – home design software online\n   \n | welcome to help my personal blog, with this time i am going to explain to you with regards to keyword. and from now on, this can be the primary photograph:\n\nhouse design software free download full version – youtube – home design software online | home design software online\n   \nthink about picture preceding? is that will amazing???. if you think maybe consequently, i’l d explain to you many photograph again below:\n\nso, if you’d like to get the magnificent pics related to (27 various ways to do home design software online | home design software online), just click save link to download these shots to your personal computer. they’re ready for download, if you want and wish to obtain it, simply click save symbol on the page, and it’ll be immediately down loaded in your laptop.} lastly if you like to have new and latest picture related with (27 various ways to do home design software online | home design software online), please follow us on google plus or save this website, we try our best to offer you regular up-date with fresh and new images. we do hope you like staying right here. for many updates and recent news about (27 various ways to do home design software online | home design software online) graphics, please kindly follow us on tweets, path, instagram and google plus, or you mark this page on bookmark section, we try to give you up-date regularly with fresh and new pictures, love your searching, and find the best for you.\n\nthanks for visiting our website, contentabove (27 various ways to do home design software online | home design software online) published .  at this time we are pleased to declare that we have found a veryinteresting contentto be reviewed, namely (27 various ways to do home design software online | home design software online) lots of people searching for details about(27 various ways to do home design software online | home design software online) and of course one of these is you, is not it?\n\n10 best free online virtual room programs and tools – home design software online | home design software online\n   \nopen position guitar chords chart – dummies – home design software online | home design software online\n   \nhome design software download | joy studio design gallery … – home design software online | home design software online\n   \nintroduction to software evolution: the software volcano – home design software online | home design software online\n   \neasy house design software – home design software online | home design software online\n   \nhome designing software – 1homedesigns.com – home design software online | home design software online\n   \nfree home design software reviews – home design software online | home design software online\n   \n45 lovely pc home design software home design idea – home design software online | home design software online\n   \nfree home design software reviews – home design software online | home design software online\n   \nfree home design software for windows – home design software online | home design software online\n   \nhouse design software free download 3d – youtube – home design software online | home design software online\n   \n3d home designing software | star dreams homes – home design software online | home design software online\n   \narchitecture. decorating and furnishing a room planner 3d: architecture design design a floorplan to game arranger making make 3 – home design software online | home design software online\n   \ndesign your own home using best house design software … – home design software online | home design software online\n   \nmy beautiful home by american leather: our top 5 online … – home design software online | home design software online\n   \n3d house design app free download – youtube – home design software online | home design software online\n   \n3d house design app free download – youtube – home design software online | home design software online\n   \nadobe animate replaces flash pro – news – digital arts – home design software online | home design software online\n   \n100+ home design gold free porcelain tile looks like calacatta gold evolution u2013 pental sit to,harvest gold toilet seat comfo – home design software online | home design software online\n   \nbest free online home interior design software programs – home design software online | home design software online\n   \nfree home design software reviews – home design software online | home design software online\n   \nthe post [27 various ways to do home design software online | home design software online](https://homedesignpro.online/27-various-ways-to-do-home-design-software-online-home-design-software-online/) appeared first on [home design pro](https://homedesignpro.online).\n\n   \n   \n from wordpress https://ift.tt/2y0qomj\n   \n", "sortedWord": "None", "identifyer": 32529, "year": "2018"}, {"Unnamed: 0": 287860, "autor": "hughred22", "date": 1543021803000, "content": "How to Facebook 3D Photo w/ iPhone or Kandao Qoocam 3D depth map camera", "link": "https://www.reddit.com/r/photography/comments/9zu12s/how_to_facebook_3d_photo_w_iphone_or_kandao/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how to facebook 3d photo w/ iphone or kandao qoocam 3d depth -----> map !!!  camera", "sortedWord": "None", "identifyer": 34273, "year": "2018"}, {"Unnamed: 0": 288196, "autor": "laurax42O", "date": 1545766268000, "content": "Approached by \"marketing manager\" of a cemetery to purchase a photo of mine- this is my first time being approached for something like this. Unsure of what to do /!/ So two years ago I had taken a photograph of the cemetery's property (photo is of some beautiful trees). I recieved an email from the cemetery's marketing manager in regards to the photo and my work. She would like to purchase the photo for use on the cemetery's website and to print on the maps they provide to visitors (these are free to the visitors). \n\nI've tried endlessly searching for some insight on the pricing and the use of a contract, but I'm in the dark. From my understanding, they would make no profit from using my photograph. I do think a contract would be smart- to ensure I receive proper credit and so they are only allowed to use the photo for what we discussed, but again I have no experience with this and would love some advice.\n\nShe also wants to discuss the potential for me to come back to the grounds in the spring to take more photos of the property for use on the website. She mentioned the old company they used was paid for the time on the site, the time it took to edit the photos, and for the photos they chose to use on the website.\n\nI am by no means a professional, and this was actually super exciting to me since my favourite thing to photograph is nature :)\n\nAny advice or links to websites that can shed light on this would be amazing.\n\nI apologize if this question has been asked- I tried searching old posts, but I didn't find a situation similar to this.\n\nThank you, guys!", "link": "https://www.reddit.com/r/photography/comments/a9hka6/approached_by_marketing_manager_of_a_cemetery_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "approached by \"marketing manager\" of a cemetery to purchase a photo of mine- this is my first time being approached for something like this. unsure of what to do /!/ so two years ago i had taken a photograph of the cemetery's property (photo is of some beautiful trees). i recieved an email from the cemetery's marketing manager in regards to the photo and my work. she would like to purchase the photo for use on the cemetery's website and to print on the -----> maps !!!  they provide to visitors (these are free to the visitors). \n\ni've tried endlessly searching for some insight on the pricing and the use of a contract, but i'm in the dark. from my understanding, they would make no profit from using my photograph. i do think a contract would be smart- to ensure i receive proper credit and so they are only allowed to use the photo for what we discussed, but again i have no experience with this and would love some advice.\n\nshe also wants to discuss the potential for me to come back to the grounds in the spring to take more photos of the property for use on the website. she mentioned the old company they used was paid for the time on the site, the time it took to edit the photos, and for the photos they chose to use on the website.\n\ni am by no means a professional, and this was actually super exciting to me since my favourite thing to photograph is nature :)\n\nany advice or links to websites that can shed light on this would be amazing.\n\ni apologize if this question has been asked- i tried searching old posts, but i didn't find a situation similar to this.\n\nthank you, guys!", "sortedWord": "None", "identifyer": 34623, "year": "2018"}, {"Unnamed: 0": 288246, "autor": "BJozi", "date": 1545688975000, "content": "Process/workflow for moving around images and backing up /!/ My other post was deleted, hopefully this is allowed\n\nhttp://imgur.com/gallery/i7Eqtz9\n\nI hope everyone is having a nice Christmas! \n\nI've been sitting here watching TV and not much else to do so I decided to map out my process for moving images around and exporting.\n\nI'm an amateur photographer, mainly shoot car (shows) related things and holidays. My gf pretty much only shots holiday snaps, hence the export section for albums and printing images.\n\nI'm getting a nas in the new year (local drive filling up to much) to store images as well as backing up to the cloud, I would be in serious toggle if I lost a holiday album...\n\nI haven't gone into great detail on how I do the editing, the aim was to map how the images move from the SD card to the pc/nas, where processing fits in, backed up to the cloud as well as exporting images for printing and showing of (on our smart display).\n\nI thought this might be useful for others as well as maybe receiving comments on where or how this could be improved. I'm not focused on the prices of editing, primarily concerned with all the images that get produced and moved around the nas/pc/cloud", "link": "https://www.reddit.com/r/photography/comments/a998hq/processworkflow_for_moving_around_images_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "process/workflow for moving around images and backing up /!/ my other post was deleted, hopefully this is allowed\n\nhttp://imgur.com/gallery/i7eqtz9\n\ni hope everyone is having a nice christmas! \n\ni've been sitting here watching tv and not much else to do so i decided to -----> map !!!  out my process for moving images around and exporting.\n\ni'm an amateur photographer, mainly shoot car (shows) related things and holidays. my gf pretty much only shots holiday snaps, hence the export section for albums and printing images.\n\ni'm getting a nas in the new year (local drive filling up to much) to store images as well as backing up to the cloud, i would be in serious toggle if i lost a holiday album...\n\ni haven't gone into great detail on how i do the editing, the aim was to map how the images move from the sd card to the pc/nas, where processing fits in, backed up to the cloud as well as exporting images for printing and showing of (on our smart display).\n\ni thought this might be useful for others as well as maybe receiving comments on where or how this could be improved. i'm not focused on the prices of editing, primarily concerned with all the images that get produced and moved around the nas/pc/cloud", "sortedWord": "None", "identifyer": 34677, "year": "2018"}, {"Unnamed: 0": 288248, "autor": "BJozi", "date": 1545688112000, "content": "I was bored and decided to map my process/workflow for file storage and backup", "link": "https://www.reddit.com/r/photography/comments/a9949c/i_was_bored_and_decided_to_map_my_processworkflow/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i was bored and decided to -----> map !!!  my process/workflow for file storage and backup", "sortedWord": "None", "identifyer": 34679, "year": "2018"}, {"Unnamed: 0": 288656, "autor": "jsoltysik", "date": 1517936130000, "content": "On Location Freelance Planning /!/ Do you guys have any preferred apps or websites for planning travel among multiple on location shoots in a day? \n\nRight now I manually chug A to B, B to C, C to D etc as I go into Apple or Google Maps.\n\nIs there a good app for just throwing in a bunch of addresses? Something that maybe provides an optimal route if you have say 5 shoots in a day?\n\nBias toward public transportation preferred.", "link": "https://www.reddit.com/r/photography/comments/7voor8/on_location_freelance_planning/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "on location freelance planning /!/ do you guys have any preferred apps or websites for planning travel among multiple on location shoots in a day? \n\nright now i manually chug a to b, b to c, c to d etc as i go into apple or -----> google !!!  -----> maps !!! .\n\nis there a good app for just throwing in a bunch of addresses? something that maybe provides an optimal route if you have say 5 shoots in a day?\n\nbias toward public transportation preferred.", "sortedWord": "None", "identifyer": 35109, "year": "2018"}, {"Unnamed: 0": 289932, "autor": "Drummerke1995", "date": 1535398367000, "content": "Why does CRI matter if colour temperature and hue are fixed? - if everything is only RGB anyway /!/ Hi all,\n\nI (think) I understand the concept of Colour Rendition Index, but I feel like I'm missing a part of the puzzle since it contradicts other things I know (RGB).  \n\n\nIf I understand correctly, CRI is a metric for the \"completeness\" of the spectrum of a light source. A light with a poor CRI rating would miss certain frequency components of the spectrum and therefore render these colours improperly.   \n\n\nWhy does this matter though, as long as the light has the correct colour temperature and hue? It is my understanding that any light with the same colour temp and hue would map similarly to the RGB-space. Since camera's, monitors and even our eyes work exclusively with RGB, why does it matter if certain colours are missing from the spectrum, if the totality of the light maps properly and evenly to RGB?  \n\n\nConcrete example:\n\nI photograph a yellow banana under three lighting setups.   \n1. Daylight: 100% CRI, all frequencies represented properly:  \nThe yellow wavelengths of the light reflect off the banana, these yellow wavelengths excite the R and G subpixels of my DSLR evenly, perfect picture.\n\n2. indoors, at night, using a low CRI light but it has the same hue and colour temperature as daylight.   \nIt's CRI is poor because it doesn't have enough yellow in it's spectrum. It would have to make up for it with extra red and extra green, otherwise the hue and colour temperature would be off.   \nThe green and red wavelengths reflect off the banana, less so than the yellow wavelengths but they add up to the same total. These green and red wavelenghts excite the R and G subpixels of my DSLR evenly, perfect picture. \n\n3. Extreme example: a combination of a pure RED, pure GREEN and pure BLUE light. So 3 lights, only 3 wavelengths. To our perception they add up to white of the same hue and colour temperature as setups 1. and 2.   \nThis setup would have a very poor CRI, since only 3 distinct wavelengths of the spectrum are represented.   \nThe red and green get reflected by the banana less so than the yellow wavelengths but they add up to the same total. These green and red wavelenghts excite the R and G subpixels of my DSLR evenly, perfect picture even though there never was any yellow light.   \n\n\nWhat is wrong with my reasoning in 2. and 3. ?   \nAm I wrong in assuming that a light with poor CRI could still have the correct overall colour tone?   \n", "link": "https://www.reddit.com/r/photography/comments/9as0kr/why_does_cri_matter_if_colour_temperature_and_hue/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "why does cri matter if colour temperature and hue are fixed? - if everything is only rgb anyway /!/ hi all,\n\ni (think) i understand the concept of colour rendition index, but i feel like i'm missing a part of the puzzle since it contradicts other things i know (rgb).  \n\n\nif i understand correctly, cri is a metric for the \"completeness\" of the spectrum of a light source. a light with a poor cri rating would miss certain frequency components of the spectrum and therefore render these colours improperly.   \n\n\nwhy does this matter though, as long as the light has the correct colour temperature and hue? it is my understanding that any light with the same colour temp and hue would -----> map !!!  similarly to the rgb-space. since camera's, monitors and even our eyes work exclusively with rgb, why does it matter if certain colours are missing from the spectrum, if the totality of the light maps properly and evenly to rgb?  \n\n\nconcrete example:\n\ni photograph a yellow banana under three lighting setups.   \n1. daylight: 100% cri, all frequencies represented properly:  \nthe yellow wavelengths of the light reflect off the banana, these yellow wavelengths excite the r and g subpixels of my dslr evenly, perfect picture.\n\n2. indoors, at night, using a low cri light but it has the same hue and colour temperature as daylight.   \nit's cri is poor because it doesn't have enough yellow in it's spectrum. it would have to make up for it with extra red and extra green, otherwise the hue and colour temperature would be off.   \nthe green and red wavelengths reflect off the banana, less so than the yellow wavelengths but they add up to the same total. these green and red wavelenghts excite the r and g subpixels of my dslr evenly, perfect picture. \n\n3. extreme example: a combination of a pure red, pure green and pure blue light. so 3 lights, only 3 wavelengths. to our perception they add up to white of the same hue and colour temperature as setups 1. and 2.   \nthis setup would have a very poor cri, since only 3 distinct wavelengths of the spectrum are represented.   \nthe red and green get reflected by the banana less so than the yellow wavelengths but they add up to the same total. these green and red wavelenghts excite the r and g subpixels of my dslr evenly, perfect picture even though there never was any yellow light.   \n\n\nwhat is wrong with my reasoning in 2. and 3. ?   \nam i wrong in assuming that a light with poor cri could still have the correct overall colour tone?   \n", "sortedWord": "None", "identifyer": 36429, "year": "2018"}, {"Unnamed: 0": 290529, "autor": "didykong", "date": 1540573277000, "content": "Official : Lightroom map view no longer available on perpetual licenses by the end of November 2018 /!/ Adobe has [annonced](https://helpx.adobe.com/lightroom/kb/map-view-no-longer-supported.html) the end of map view for perpetual licenses of Lightroom.\n\n* Lightroom 4 and 5 : The map module has been discontinued.\n* Lightroom CC 2015.x / Lightroom 6.x : Map view will be discontinued starting on November 30, 2018\n* Lightroom Classic CC 7.x : upgrade to Lightroom Classic 8.0 to be able to use map view from November 30, 2018\n\n**Reason**\n\n\"A change in Map calls has been made.\"\n\n This is probably linked to the Google Map API price rise in July 2018.", "link": "https://www.reddit.com/r/photography/comments/9rmjmk/official_lightroom_map_view_no_longer_available/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "official : lightroom -----> map !!!  view no longer available on perpetual licenses by the end of november 2018 /!/ adobe has [annonced](https://helpx.adobe.com/lightroom/kb/map-view-no-longer-supported.html) the end of map view for perpetual licenses of lightroom.\n\n* lightroom 4 and 5 : the map module has been discontinued.\n* lightroom cc 2015.x / lightroom 6.x : map view will be discontinued starting on november 30, 2018\n* lightroom classic cc 7.x : upgrade to lightroom classic 8.0 to be able to use map view from november 30, 2018\n\n**reason**\n\n\"a change in map calls has been made.\"\n\n this is probably linked to the google map api price rise in july 2018.", "sortedWord": "None", "identifyer": 37056, "year": "2018"}, {"Unnamed: 0": 290797, "autor": "Shoryouken", "date": 1542108488000, "content": "What inspired me to become a photographer PLUS a map of photography locations I visited in Iceland 3 years ago /!/  \n\nHello guys.\n\nI started writing my photography blog about my past trips.  \nSome of you might enjoy it and there is a useful map I created in 2016.  \nLet me know what you think and if you found this useful.\n\n[Our Icelandic Adventure](https://www.pristine-view.com/blog/2018/11/11/so-it-begins)\n\nOr if you do not want to read my Blog entry just click on:\n\n[Map](https://www.google.com/maps/d/u/0/edit?mid=1UdWUzOnxH_0KJ_XScOt8qZlNls4&amp;ll=64.74170616305199%2C-18.86649125000008&amp;z=7)\n\nHope ", "link": "https://www.reddit.com/r/photography/comments/9wo9qr/what_inspired_me_to_become_a_photographer_plus_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "what inspired me to become a photographer plus a -----> map !!!  of photography locations i visited in iceland 3 years ago /!/  \n\nhello guys.\n\ni started writing my photography blog about my past trips.  \nsome of you might enjoy it and there is a useful map i created in 2016.  \nlet me know what you think and if you found this useful.\n\n[our icelandic adventure](https://www.pristine-view.com/blog/2018/11/11/so-it-begins)\n\nor if you do not want to read my blog entry just click on:\n\n[map](https://www.google.com/maps/d/u/0/edit?mid=1udwuzonxh_0kj_xscot8qzlnls4&amp;ll=64.74170616305199%2c-18.86649125000008&amp;z=7)\n\nhope ", "sortedWord": "None", "identifyer": 37328, "year": "2018"}], "name": "mapphotography2018"}