{"interestingcomments": [{"Unnamed: 0": 95387, "autor": "ShinigamiArmor", "date": 1610671500000, "content": "Hey guys! I’m making a website that is like Zillow for Artists, and I wanted to get some feedback... /!/ * I’m making a website that lets you search, discover, and engage with different artists in your area. \n* I thought it’d be cool for artists of all types (musicians, photographers, filmmakers, painters, dancers, producers, models, etc.) to have a platform where we could easily search up each other and collaborate.\n* The website will have a map, like Zillow, and when you search your city/town, different artists will appear and you can DM them.\n\nI’m launching this in a few weeks. If you think it’s a cool idea, drop your email in [this link](https://forms.gle/7Nzrv1xHBLsEbG8BA) and I’ll notify you when it’s out.", "link": "https://www.reddit.com/r/photography/comments/kxj37u/hey_guys_im_making_a_website_that_is_like_zillow/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "hey guys! i’m making a website that is like zillow for artists, and i wanted to get some feedback... /!/ * i’m making a website that lets you search, discover, and engage with different artists in your area. \n* i thought it’d be cool for artists of all types (musicians, photographers, filmmakers, painters, dancers, producers, models, etc.) to have a platform where we could easily search up each other and collaborate.\n* the website will have a -----> map !!! , like zillow, and when you search your city/town, different artists will appear and you can dm them.\n\ni’m launching this in a few weeks. if you think it’s a cool idea, drop your email in [this link](https://forms.gle/7nzrv1xhblsebg8ba) and i’ll notify you when it’s out.", "sortedWord": "None", "identifyer": 97951, "year": "2021"}, {"Unnamed: 0": 95807, "autor": "NotHenryGale815", "date": 1617136359000, "content": "How are high resolution face diffuse maps, such as this one, captured from real subjects without capturing pores? /!/ https://cdna.artstation.com/p/assets/images/images/010/841/926/large/sefki-ibrahim-screenshot-2018-05-02-18-36-15-copy.jpg?1526501368\n\nWhat kind of photography tricks are used? Or is most of it done as post?", "link": "https://www.reddit.com/r/photography/comments/mgpaye/how_are_high_resolution_face_diffuse_maps_such_as/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "how are high resolution face diffuse -----> maps !!! , such as this one, captured from real subjects without capturing pores? /!/ https://cdna.artstation.com/p/assets/images/images/010/841/926/large/sefki-ibrahim-screenshot-2018-05-02-18-36-15-copy.jpg?1526501368\n\nwhat kind of photography tricks are used? or is most of it done as post?", "sortedWord": "None", "identifyer": 98382, "year": "2021"}, {"Unnamed: 0": 95808, "autor": "NotHenryGale815", "date": 1617136275000, "content": "How are high resolution face diffuse maps, such as this one, captured from real subjects without capturing pores? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/mgp9xd/how_are_high_resolution_face_diffuse_maps_such_as/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "how are high resolution face diffuse -----> maps !!! , such as this one, captured from real subjects without capturing pores? /!/ [removed]", "sortedWord": "None", "identifyer": 98383, "year": "2021"}, {"Unnamed: 0": 95912, "autor": "TranslucentGold", "date": 1615890658000, "content": "Images submitted to Google Maps - People can put watermarks on their photos /!/ It seems like a really good way to promote your business, and you're allowed to do it but I've never seen anybody go though the effort to do this. Has anybody done this and gained leads from it? I am curious.\n\nTheir guidelines for using watermarks in images: https://support.google.com/contributionpolicy/answer/7411351?hl=en#zippy=%2Cstylistic-adjustments%2Cphotos%2Csuperimposed-text-or-graphics", "link": "https://www.reddit.com/r/photography/comments/m660ot/images_submitted_to_google_maps_people_can_put/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "images submitted to -----> google !!!  -----> maps !!!  - people can put watermarks on their photos /!/ it seems like a really good way to promote your business, and you're allowed to do it but i've never seen anybody go though the effort to do this. has anybody done this and gained leads from it? i am curious.\n\ntheir guidelines for using watermarks in images: https://support.google.com/contributionpolicy/answer/7411351?hl=en#zippy=%2cstylistic-adjustments%2cphotos%2csuperimposed-text-or-graphics", "sortedWord": "None", "identifyer": 98491, "year": "2021"}, {"Unnamed: 0": 111161, "autor": "Gundam_net", "date": 1617829988000, "content": "How to tone map RAW files to 10-bit HEIF or HLG with 1000nit peak brightness? /!/ I don't want to export 8-bit SDR jpegs anymore.  I want to start exclusively producing true hdr photos with 10-bit color spaces and peak brightness of highlights beyond 100nits. \n\nBut I can't find any photo editing software that allows me to do this.  Anyone know of any? \n\nI can't afford brand new full frame cameras from Panasonic and Canon that can do this in camera.  So I'm hoping I can simply shoot RAW and use affordable software to export true HDR images that require HDR displays to be viewed properly.", "link": "https://www.reddit.com/r/photography/comments/mmc4f9/how_to_tone_map_raw_files_to_10bit_heif_or_hlg/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how to tone -----> map !!!  raw files to 10-bit heif or hlg with 1000nit peak brightness? /!/ i don't want to export 8-bit sdr jpegs anymore.  i want to start exclusively producing true hdr photos with 10-bit color spaces and peak brightness of highlights beyond 100nits. \n\nbut i can't find any photo editing software that allows me to do this.  anyone know of any? \n\ni can't afford brand new full frame cameras from panasonic and canon that can do this in camera.  so i'm hoping i can simply shoot raw and use affordable software to export true hdr images that require hdr displays to be viewed properly.", "sortedWord": "None", "identifyer": 1131, "year": "2021"}, {"Unnamed: 0": 112795, "autor": "RandomAccessMelodies", "date": 1628885943000, "content": "Good hourly wage for a photo editor in California /!/ I have about 5 years of experience as a hobbyist photographer. I’ve taken one photography class and two graphic design courses during undergrad. I have some public exposure as I submitted some of my photos to a local zine.\n\nI have a bachelors degree and completed multiple internships that required light editing in photoshop. I’m also in a GIS graduate certificate and I often edit my maps in Illustrator and Photoshop.\n\nHowever I have never worked as a photo editor for pay. I have the opportunity to do so and I know they are going to ask about how I’m looking to make. It is part time. I don’t want to overshoot (and scare them away) or undersell my worth. The job is editing yearbook photos for a local photography business. It sounds like they are the go to for the schools in the area.  \n\nWhat would you guys suggest?", "link": "https://www.reddit.com/r/photography/comments/p3t95e/good_hourly_wage_for_a_photo_editor_in_california/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my maps", "selectorShort": "map", "MarkedSent": "good hourly wage for a photo editor in california /!/ i have about 5 years of experience as a hobbyist photographer. i’ve taken one photography class and two graphic design courses during undergrad. i have some public exposure as i submitted some of my photos to a local zine.\n\ni have a bachelors degree and completed multiple internships that required light editing in photoshop. i’m also in a gis graduate certificate and i often edit -----> my !!!  -----> maps !!!  in illustrator and photoshop.\n\nhowever i have never worked as a photo editor for pay. i have the opportunity to do so and i know they are going to ask about how i’m looking to make. it is part time. i don’t want to overshoot (and scare them away) or undersell my worth. the job is editing yearbook photos for a local photography business. it sounds like they are the go to for the schools in the area.  \n\nwhat would you guys suggest?", "sortedWord": "None", "identifyer": 2816, "year": "2021"}, {"Unnamed: 0": 114918, "autor": "orange_scam_zone", "date": 1613423358000, "content": "How to make gigapixel photo with video? (any decent dslr) /!/ Im aware of how to stitch together photos to make a gigapixel panorama - some people on reddit made superb creation. I'm curious about videos - for example this JFK one - [https://www.youtube.com/watch?v=Sqk3sdfXFkc](https://www.youtube.com/watch?v=Sqk3sdfXFkc) \\- why cant there be simple software to screencap your entire screen on android/ios (to get say, a map of a video game) then one software to reconstruct the lot? \n\n  \nAm i missing the very obvious? thank you!", "link": "https://www.reddit.com/r/photography/comments/lkn8lz/how_to_make_gigapixel_photo_with_video_any_decent/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how to make gigapixel photo with video? (any decent dslr) /!/ im aware of how to stitch together photos to make a gigapixel panorama - some people on reddit made superb creation. i'm curious about videos - for example this jfk one - [https://www.youtube.com/watch?v=sqk3sdfxfkc](https://www.youtube.com/watch?v=sqk3sdfxfkc) \\- why cant there be simple software to screencap your entire screen on android/ios (to get say, a -----> map !!!  of a video game) then one software to reconstruct the lot? \n\n  \nam i missing the very obvious? thank you!", "sortedWord": "None", "identifyer": 5022, "year": "2021"}, {"Unnamed: 0": 116523, "autor": "Stonetown_Radio", "date": 1620313413000, "content": "Shot this model with a canon 5dmkiv 50mm 1.8, Godox strobe overhead with a 42” soft box. Then added an antique map over her in post.", "link": "https://www.reddit.com/r/photography/comments/n69c19/shot_this_model_with_a_canon_5dmkiv_50mm_18_godox/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "shot this model with a canon 5dmkiv 50mm 1.8, godox strobe overhead with a 42” soft box. then added an antique -----> map !!!  over her in post.", "sortedWord": "None", "identifyer": 6690, "year": "2021"}, {"Unnamed: 0": 116558, "autor": "BdR76", "date": 1620719500000, "content": "Is it possible to store photo and image map integrated into a single jpg file? /!/ Is it possible to store a photo with an image map or tags, integrated into one image file? So is there maybe some sort of standardised way to do this in JPG files?\n\nOn sites like Facebook you can tag photos and indicate who is in it so that when you hover the mouse over the persons a label will pop up with their names. Other websites have different options, I'm not familiar with Instagram but it only supports geotags afaik.\n\nI'm asking mainly for personal use and archiving, because when you look back on old photos after a couple of years, sometimes you may have forgotten some names or locations. Especially for group photos, like school photos, weddings, parties (remember those? :\\\\) etc. Like when I backup photos on harddisk or NAS, I could store an HTML file with an image map for some of the photos. But keeping separate files seems old fashioned and inconvenient.", "link": "https://www.reddit.com/r/photography/comments/n9roja/is_it_possible_to_store_photo_and_image_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "is it possible to store photo and image -----> map !!!  integrated into a single jpg file? /!/ is it possible to store a photo with an image map or tags, integrated into one image file? so is there maybe some sort of standardised way to do this in jpg files?\n\non sites like facebook you can tag photos and indicate who is in it so that when you hover the mouse over the persons a label will pop up with their names. other websites have different options, i'm not familiar with instagram but it only supports geotags afaik.\n\ni'm asking mainly for personal use and archiving, because when you look back on old photos after a couple of years, sometimes you may have forgotten some names or locations. especially for group photos, like school photos, weddings, parties (remember those? :\\\\) etc. like when i backup photos on harddisk or nas, i could store an html file with an image map for some of the photos. but keeping separate files seems old fashioned and inconvenient.", "sortedWord": "None", "identifyer": 6726, "year": "2021"}, {"Unnamed: 0": 118224, "autor": "JordanMccphoto", "date": 1624009139000, "content": "Photography Helped Me Learn to Love Where I'm From /!/ Greetings fellow users of the internet.\n\nPhotography is a funny thing, sometimes. Weather conditions can make or break a shot, which can completely alter your opinion of a location. Getting the perfect spot before anyone else can be the difference between a trip well worth it, or a waste of time. For the vast majority of the places I’ve visited, my general feelings towards them are connected to how good they were to me as a photographer. However, things get a little more complicated when that location is where you used to, and still occasionally, call “home”. \n\nDespite growing up and spending the majority of my life in the Greater Vancouver Area, I never really had the time or money to photograph it, in depth. I’ve been to the city countless times, but almost never as a photographer, at least not since actually learning what all the buttons on my camera do. This means that my overall opinion of Vancouver was as a result of having grown up nearby, rather than as a photographer. I’ll skip the details, but that more or less meant I had a rather negative opinion of the city. I mean, you usually don’t choose to gamble on an all or nothing move halfway across the world because your life is going particularly well. \n\nSince moving away from home my complex relationship with Vancouver had only become more completed. Perhaps it’s the nine hour flight. Perhaps it’s the hundreds of dollars I have to spend just to get there. Perhaps it’s the cost of food. Or perhaps it’s the mixed history I have with the city, but I never looked forward to a trip “home”. I looked forward to seeing my friends and family, drinking french vanilla cappuccinos, eating real poutine, and watching my hockey team disappoint me for 60 glorious minutes, but not to the city itself. Give me a choice between Busan and Vancouver, and I’d pick Busan 9 out of 10 times, despite the fact that I can’t handle even the mildest of Korean spices and to call my Korean “poor” would be an understatement. All of this is to say that I never really willingly went back to Vancouver, rather, I’ve always gone back out of a sense of obligation.\n\nBack in 2019, I took a trip back to Vancouver, for a wedding. As per the usual, I was looking forward the things I mentioned above. However, I wasn’t really looking forward actually being back in the city itself. Typically, November is the rainiest month in Vancouver, which only added to my lack of excitement. I remember one week before my trip, I checked the forecast, with a sense of dread. I was not surprised to see that it was calling for rain, from the day I arrived to the day I left. Despite it being exactly what I had expected, I was still so dejected that I honestly reconsidered even bringing my camera at all. “I think this city hates me more than I hate it” I murmured to myself. However as my departure date drew closer and closer, something happened. Things seemed like they were starting to change, in a good way. Unlike in Japan, it actually seemed like I was going to get lucky (not like that).\n\nI arrived at the airport early in the morning, as I usually do, grabbed some Tim’s and made my way towards the city. I had a lot of time to kill before sunset, so I walked around looking for any abstract architecture opportunities I could find, which was my bread and butter at the time. “Were these buildings always this ugly?” I muttered to myself as I walked around looking for something, anything, to produce a worthwhile image. I should add that I had just returned from Paju a week earlier, which provided me with countless abstract architecture opportunities. I’ve honestly never had so much fun getting blisters on my feet. I continued exploring Vancouver, including parts I’d never been to before, but I just couldn’t find anything. I’d seemingly hit a wall. Uninspired, half asleep, and grumpy, I put my camera away. I had to hope that sunset would give me something, anything worthwhile to shoot\n\nFinally, it was time to head to my first planned destination for sunset. I walked to Stanley Park, to a spot I’d been eyeing on Google Maps for months, and set up my camera. The perfect location to grab a panoramic image of Vancouver’s stunning skyline. The ground was uneven, but I had to take the risk, only a panoramic image could do this scene justice. As the sun began to get lower and lower, I could feel it, “I’m about to get lucky” (again, not like that). The sky eventually lit up in a variety of colours. Finally, I felt good about a photo I’d taken, after hours of nothing. It wasn’t the best photo I’d ever taken, but it was enough to get the inspiration juices flowing. I headed back to my hotel, crawled into bed after being awake for over 36 hours, and passed out just in time to miss my hockey team lose to our bitter rivals.\n\nThe next morning, I overslept. My original plans for the morning were not going to work out. I was still exhausted from my flight but using the inspiration juices I’d gained from the evening before, I dragged myself out of bed and headed out. I could see the clouds starting to catch some color, in the distance. With time and options running out, I decided to return to the same location I’d shot the sunset. As I got closer to the location, I felt something I hadn’t really felt since about 2018, excitement for a genuinely awe inspiring sunrise. I ran to the location to ensure I didn’t blow my chance to get something truly special. I can’t quite put into words how mind-blowing the sunrise was. It was easily the best sunrise I’d ever seen, not just as a photographer, but in my life. Even being as experienced as I am, I still get nervous when conditions are this perfect, because if something goes wrong, I have no one and nothing to blame but myself. I arrived at my location, set my tripod up, got my camera level, and made sure all the settings were right. “I might actually pull this off”, I thought to myself. Just then I noticed my hands were shaking, but I wasn’t cold. I had to calm myself down, this was it, one chance, make or break. I took a deep breath and shot a few panoramic images as the sky continued to put on a show. In what simultaneously felt like an instant and an eternity, it was over.\n\nAs the colors begin to fade I finally took a moment to take everything in. I thought to myself. “My goodness, this place is something special”. I knew following the sunrise, I’d have head out of the city for the wedding. I packed up my gear, and started walking back to my hotel, when I suddenly I felt something strange. Typically, when I’m in Vancouver, I get “reverse homesick”, where I can’t wait to come back to Japan, but on this particular morning I had a feeling I’d never felt before. For the first time ever, I actually wanted to spend more time in Vancouver.\n\nIt’s been over a year and a half since that trip, and for the first time since moving abroad, I’m actually looking forward to going back. The irony of not being able to travel there now that I actually want to isn’t lost on me, but there will be no questions about whether or not I bring my gear, next time. For the first time in my life I can actually say that I’ve kind of fallen love Vancouver.\n\nNow, I can hear some of you screaming at your screens “Jordan, it took you like 4 paragraphs to get into the photography bits! Also, how could you not love Vancouver, it’s so beautiful!”. First of all, yeah, there’s a reason I’m not a writer, and secondly the reason I wrote this is because I didn’t really get into photography until after I moved away from Vancouver, mostly due to monetary and time constraints. This was my first time being in Vancouver alone with my camera, the right set of skills, the time, and the money to actually see Vancouver as a photographer, rather than a broke college student working 2 jobs and volunteering in the city, just looking to get lucky (actually kind of like that, this time). \n\nI think it’s important for us to remember, we can never really think of a location in an objective way, as our experiences change our perception, especially when that place is home. For me, it took over 30 years to finally see my own hometown in a positive way, and I owe that to photography, and getting the right conditions to grab a photo that might be a once in a lifetime opportunity for me. If there’s one thing I love about photography, it’s that it demands that I see the world with a keener eye and motivates me to both see more of the world and to revisit old places with a sense of newfound wonder. If it wasn’t for photography, I don’t know if I would ever feel the way I currently do about a city I once disliked so much I literally moved halfway across the world. For all of the stress, disappointment, and failure I’ve endured due to photography, it’s wins like this that make it such an important part of my life… also I actually watched my hockey team win a game, so that was nice.\n\n&amp;#x200B;\n\nTL;DR: Me didn't like home. Then me take good picture of home. Now me like home.", "link": "https://www.reddit.com/r/photography/comments/o2l929/photography_helped_me_learn_to_love_where_im_from/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "photography helped me learn to love where i'm from /!/ greetings fellow users of the internet.\n\nphotography is a funny thing, sometimes. weather conditions can make or break a shot, which can completely alter your opinion of a location. getting the perfect spot before anyone else can be the difference between a trip well worth it, or a waste of time. for the vast majority of the places i’ve visited, my general feelings towards them are connected to how good they were to me as a photographer. however, things get a little more complicated when that location is where you used to, and still occasionally, call “home”. \n\ndespite growing up and spending the majority of my life in the greater vancouver area, i never really had the time or money to photograph it, in depth. i’ve been to the city countless times, but almost never as a photographer, at least not since actually learning what all the buttons on my camera do. this means that my overall opinion of vancouver was as a result of having grown up nearby, rather than as a photographer. i’ll skip the details, but that more or less meant i had a rather negative opinion of the city. i mean, you usually don’t choose to gamble on an all or nothing move halfway across the world because your life is going particularly well. \n\nsince moving away from home my complex relationship with vancouver had only become more completed. perhaps it’s the nine hour flight. perhaps it’s the hundreds of dollars i have to spend just to get there. perhaps it’s the cost of food. or perhaps it’s the mixed history i have with the city, but i never looked forward to a trip “home”. i looked forward to seeing my friends and family, drinking french vanilla cappuccinos, eating real poutine, and watching my hockey team disappoint me for 60 glorious minutes, but not to the city itself. give me a choice between busan and vancouver, and i’d pick busan 9 out of 10 times, despite the fact that i can’t handle even the mildest of korean spices and to call my korean “poor” would be an understatement. all of this is to say that i never really willingly went back to vancouver, rather, i’ve always gone back out of a sense of obligation.\n\nback in 2019, i took a trip back to vancouver, for a wedding. as per the usual, i was looking forward the things i mentioned above. however, i wasn’t really looking forward actually being back in the city itself. typically, november is the rainiest month in vancouver, which only added to my lack of excitement. i remember one week before my trip, i checked the forecast, with a sense of dread. i was not surprised to see that it was calling for rain, from the day i arrived to the day i left. despite it being exactly what i had expected, i was still so dejected that i honestly reconsidered even bringing my camera at all. “i think this city hates me more than i hate it” i murmured to myself. however as my departure date drew closer and closer, something happened. things seemed like they were starting to change, in a good way. unlike in japan, it actually seemed like i was going to get lucky (not like that).\n\ni arrived at the airport early in the morning, as i usually do, grabbed some tim’s and made my way towards the city. i had a lot of time to kill before sunset, so i walked around looking for any abstract architecture opportunities i could find, which was my bread and butter at the time. “were these buildings always this ugly?” i muttered to myself as i walked around looking for something, anything, to produce a worthwhile image. i should add that i had just returned from paju a week earlier, which provided me with countless abstract architecture opportunities. i’ve honestly never had so much fun getting blisters on my feet. i continued exploring vancouver, including parts i’d never been to before, but i just couldn’t find anything. i’d seemingly hit a wall. uninspired, half asleep, and grumpy, i put my camera away. i had to hope that sunset would give me something, anything worthwhile to shoot\n\nfinally, it was time to head to my first planned destination for sunset. i walked to stanley park, to a spot i’d been eyeing on -----> google !!!  -----> maps !!!  for months, and set up my camera. the perfect location to grab a panoramic image of vancouver’s stunning skyline. the ground was uneven, but i had to take the risk, only a panoramic image could do this scene justice. as the sun began to get lower and lower, i could feel it, “i’m about to get lucky” (again, not like that). the sky eventually lit up in a variety of colours. finally, i felt good about a photo i’d taken, after hours of nothing. it wasn’t the best photo i’d ever taken, but it was enough to get the inspiration juices flowing. i headed back to my hotel, crawled into bed after being awake for over 36 hours, and passed out just in time to miss my hockey team lose to our bitter rivals.\n\nthe next morning, i overslept. my original plans for the morning were not going to work out. i was still exhausted from my flight but using the inspiration juices i’d gained from the evening before, i dragged myself out of bed and headed out. i could see the clouds starting to catch some color, in the distance. with time and options running out, i decided to return to the same location i’d shot the sunset. as i got closer to the location, i felt something i hadn’t really felt since about 2018, excitement for a genuinely awe inspiring sunrise. i ran to the location to ensure i didn’t blow my chance to get something truly special. i can’t quite put into words how mind-blowing the sunrise was. it was easily the best sunrise i’d ever seen, not just as a photographer, but in my life. even being as experienced as i am, i still get nervous when conditions are this perfect, because if something goes wrong, i have no one and nothing to blame but myself. i arrived at my location, set my tripod up, got my camera level, and made sure all the settings were right. “i might actually pull this off”, i thought to myself. just then i noticed my hands were shaking, but i wasn’t cold. i had to calm myself down, this was it, one chance, make or break. i took a deep breath and shot a few panoramic images as the sky continued to put on a show. in what simultaneously felt like an instant and an eternity, it was over.\n\nas the colors begin to fade i finally took a moment to take everything in. i thought to myself. “my goodness, this place is something special”. i knew following the sunrise, i’d have head out of the city for the wedding. i packed up my gear, and started walking back to my hotel, when i suddenly i felt something strange. typically, when i’m in vancouver, i get “reverse homesick”, where i can’t wait to come back to japan, but on this particular morning i had a feeling i’d never felt before. for the first time ever, i actually wanted to spend more time in vancouver.\n\nit’s been over a year and a half since that trip, and for the first time since moving abroad, i’m actually looking forward to going back. the irony of not being able to travel there now that i actually want to isn’t lost on me, but there will be no questions about whether or not i bring my gear, next time. for the first time in my life i can actually say that i’ve kind of fallen love vancouver.\n\nnow, i can hear some of you screaming at your screens “jordan, it took you like 4 paragraphs to get into the photography bits! also, how could you not love vancouver, it’s so beautiful!”. first of all, yeah, there’s a reason i’m not a writer, and secondly the reason i wrote this is because i didn’t really get into photography until after i moved away from vancouver, mostly due to monetary and time constraints. this was my first time being in vancouver alone with my camera, the right set of skills, the time, and the money to actually see vancouver as a photographer, rather than a broke college student working 2 jobs and volunteering in the city, just looking to get lucky (actually kind of like that, this time). \n\ni think it’s important for us to remember, we can never really think of a location in an objective way, as our experiences change our perception, especially when that place is home. for me, it took over 30 years to finally see my own hometown in a positive way, and i owe that to photography, and getting the right conditions to grab a photo that might be a once in a lifetime opportunity for me. if there’s one thing i love about photography, it’s that it demands that i see the world with a keener eye and motivates me to both see more of the world and to revisit old places with a sense of newfound wonder. if it wasn’t for photography, i don’t know if i would ever feel the way i currently do about a city i once disliked so much i literally moved halfway across the world. for all of the stress, disappointment, and failure i’ve endured due to photography, it’s wins like this that make it such an important part of my life… also i actually watched my hockey team win a game, so that was nice.\n\n&amp;#x200b;\n\ntl;dr: me didn't like home. then me take good picture of home. now me like home.", "sortedWord": "None", "identifyer": 8462, "year": "2021"}, {"Unnamed: 0": 120900, "autor": "YakGroundbreaking915", "date": 1634746024000, "content": "How To Use / Predict Natural Light /!/ I've been an aspiring amateur photographer for 20yrs and I admit that I struggle with making the best of natural light.\n\nDoes anyone have any resources, advice, websites or recommended books (especially with examples of photos and required post) showing how to work with natural light, best times of day for various types of photography and how to predict in advance when there will be good light?\n\nI'm going to put what I've learnt here and hopefully some wiser folks than me can correct or add to it:\n\nA lot of the time when people answer this question they just talk about the golden hour and the blue hour. Basically shoot only at the beginning and end of the day. I think this is hugely oversimplified and not that helpful. Sure, beautiful sunsets and sunrises only happen in this time frame but there are also a lot of overcast days where the light just gets dimmer and slides uneventfully into night time. Boooo! I've taken a lot of my favourites photos on days with little cloud and bright sunlight. You just have to make sure you keep the sun behind you and you get lovely warm and saturated colour.\n\nIf you do intend on shooting in the blue/golden hour then online meteorological cloud maps can sometimes help. Or at least it's worth  try. Some of the best sunrises and sunsets happen when you have broken cloud in the sky which is illuminated by low level sun peeking through gaps in the cloud. But I've found that even using cloud maps, you often get duds from what looks like perfect conditions and the occasional spectacular sky from what looks like a write off day. So essentially random luck! Any help with predicting cloud cover and light is welcome.\n\nOne tip that I'd really love to share is to go out before or after storms. Thick black clouds opposite direct sunlight can create really striking contrasty images that still fall easily within the dynamic range of your camera.\n\nAnother thing that I think causes a lot of confusion is overcast light. People say that heavy cloud cover is beautifully soft and ideal. I think it can go too far though giving you desaturated colours and white out skies. Especially if you're shooting towards thick clouds that are back-lit by the sun. \n\nEven if you can't see the sun, it still pays to keep it at your back. This may mean that the photo you have in mind can only be taken in the morning or afternoon. It also means that there are some buildings / landscapes that never really get good light. They are often North facing. With such challenging shots, a heavily overcast day might give you the best shot you're ever likely to get.\n\nOf course there are exceptions. Macro photography can produce some great results under heavy overcast skies. And you can get good results under thick cloud if you shoot with a B&amp;W conversion in mind.\n\nTLDR; I'd love to hear everyone's recommendations and tips on how to make the most of natural light. I think there's a lot of bad or oversimplified information in books and I really want to improve. If I could stop having to get up before sunrise for no reward then that'd be great too 🙃", "link": "https://www.reddit.com/r/photography/comments/qc4bk8/how_to_use_predict_natural_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "how to use / predict natural light /!/ i've been an aspiring amateur photographer for 20yrs and i admit that i struggle with making the best of natural light.\n\ndoes anyone have any resources, advice, websites or recommended books (especially with examples of photos and required post) showing how to work with natural light, best times of day for various types of photography and how to predict in advance when there will be good light?\n\ni'm going to put what i've learnt here and hopefully some wiser folks than me can correct or add to it:\n\na lot of the time when people answer this question they just talk about the golden hour and the blue hour. basically shoot only at the beginning and end of the day. i think this is hugely oversimplified and not that helpful. sure, beautiful sunsets and sunrises only happen in this time frame but there are also a lot of overcast days where the light just gets dimmer and slides uneventfully into night time. boooo! i've taken a lot of my favourites photos on days with little cloud and bright sunlight. you just have to make sure you keep the sun behind you and you get lovely warm and saturated colour.\n\nif you do intend on shooting in the blue/golden hour then online meteorological cloud -----> maps !!!  can sometimes help. or at least it's worth  try. some of the best sunrises and sunsets happen when you have broken cloud in the sky which is illuminated by low level sun peeking through gaps in the cloud. but i've found that even using cloud maps, you often get duds from what looks like perfect conditions and the occasional spectacular sky from what looks like a write off day. so essentially random luck! any help with predicting cloud cover and light is welcome.\n\none tip that i'd really love to share is to go out before or after storms. thick black clouds opposite direct sunlight can create really striking contrasty images that still fall easily within the dynamic range of your camera.\n\nanother thing that i think causes a lot of confusion is overcast light. people say that heavy cloud cover is beautifully soft and ideal. i think it can go too far though giving you desaturated colours and white out skies. especially if you're shooting towards thick clouds that are back-lit by the sun. \n\neven if you can't see the sun, it still pays to keep it at your back. this may mean that the photo you have in mind can only be taken in the morning or afternoon. it also means that there are some buildings / landscapes that never really get good light. they are often north facing. with such challenging shots, a heavily overcast day might give you the best shot you're ever likely to get.\n\nof course there are exceptions. macro photography can produce some great results under heavy overcast skies. and you can get good results under thick cloud if you shoot with a b&amp;w conversion in mind.\n\ntldr; i'd love to hear everyone's recommendations and tips on how to make the most of natural light. i think there's a lot of bad or oversimplified information in books and i really want to improve. if i could stop having to get up before sunrise for no reward then that'd be great too 🙃", "sortedWord": "None", "identifyer": 11250, "year": "2021"}, {"Unnamed: 0": 123292, "autor": "razor0pt", "date": 1620885073000, "content": "Wrld o' map", "link": "https://www.reddit.com/r/photography/comments/nb9mod/wrld_o_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "wrld o' -----> map !!! ", "sortedWord": "None", "identifyer": 13746, "year": "2021"}, {"Unnamed: 0": 123822, "autor": "DanielJStein", "date": 1623241913000, "content": "Stop guessing, start planning! June New Moon is this weekend. Let’s figure out how to perfectly plan out your Milky Way shots so you can absolutely CRUSH IT this Core season. /!/ Plan your work and work your plan… That’s what….. idk someone important once told me? Anywho, in my opinion, planning out your Milky Way shots is absolutely one of the best ways to increase the likelihood you will be shooting bangers. \n\nAloha I am Dan and welcome back to another one of my nightscape/Milky Way photography tutorials. \n\nI will be talking about how to read the weather, Moon phases, light pollution maps, and of course—the timing of the Milky Way core. While I touched upon these items in my [Milky Way photography 101 tut,](https://danieljstein.com/tutorials/milkywaybasics) I will be going further in depth in this post so you can really nail it down. Fear not though young citizen, everything here is super easy to follow along with.\n\n### What do you need to make the wow?\n\nWanna hear something cool? Pretty much every tool I am about to describe is free…. with a few exceptions depending on your use cases. So let’s run down one by one what I use to plan and what each tool is used for.\n\n* [National Weather Service ](https://www.weather.gov/) \\- this free website is by the most accurate way to determine if the weather is going to be good at your location of interest.\n* [Astrospheric](https://www.astrospheric.com/?Latitude=47.606143&amp;Longitude=-122.332346) \\- This handy free website and phone app is super helpful to determine how “clear” the sky will actually be. More on that later.\n* [Gaia GPS ](https://www.gaiagps.com/)\\- This free source is great for hikers and backpackers alike. Optional if you are not into hiking, but if you are chances are you already have this. Note: to use offline features you will need a paid subscription.\n* [The Light Pollution Map](https://darksitefinder.com/maps/world.html#4/28.01/-71.39) \\-  as you probably are already aware of, this free website is the ultimate way to figure out where dark skies are near you.\n* [Planit Pro](https://www.yingwentech.com/) &amp; [Photopills](https://www.photopills.com/). These paid tools are essential. I don’t like telling people to spend their moolah, but as you will see $10 goes a long way. Each tool has their pros and cons, and this tutorial is cross compatible with both. Either one works, determining which one is for you will ultimately be up to what interface you think you will enjoy!\n* [Google Maps.](https://www.google.com/maps) Last but certainly not least, this is mega helpful in determining where you want to go. Street &amp; 360's views are key, that way you can determine your landscape before even getting there. This is critical for planning.\n\n*Note: I am by no means affiliated nor sponsored by any of the above mentioned websites and tools.* \n\n*Double note: for international folks reading this, chances are your country has a similar service the NWS. This is most likely going to be your best bet for weather as well.*\n\n### What I do with these things? This is already a lot?\n\nDon’t worry little Jimmy. We will break these down one by one. I have a very linear thought pattern so we will go through them in the order I use them. Ok cool. Let’s do it.\n\n### First things first, determine the darknessness.\n\nThe first thing I like to do when it comes to planning my shot is determine IF it will be dark enough. I mean, come on, makes sense right? Why waste the time figuring out all of the other nonsense if the sky is going to be wayyyyyy tooo light pollluteddd.\n\nSo, simply fire up the [light pollution map.](https://darksitefinder.com/maps/world.html#4/41.64/-88.33) Now, if you are not already familiar with the color coding this map uses, lemme explain real quick…\n\nThis map uses something called the Bortle Scale. Essentially, the brighter, warmer colors depict MORE light pollution with white being the brightest, while the cooler and darker colors depict less light pollution. [Here is a graphic I made which correlates to this scale.](https://i.imgur.com/uccg5GX.jpg)\n\nSo, in order to photograph our galaxy, you will want to shoot for a Bortle Zone 4 or better. The darker the skies, the more potent the Milky Way will be. **This is a great starting point for determining a location where you want to shoot.**\n\n*Now here is something you need to consider. Not only does the Light Pollution in the spot where you are shooting from matter, but so does the direction you are looking towards. If you are looking towards a Core rising in the heat of a massive city, you will capture lots of light pollution on the horizon in that direction.*\n\n### When see core?\n\nThe visibility of the Milky Way core is not consistent from one night to the next. Rather, it is determined by these factors:\n\n* Time of year\n* Latitude\n* Moon phase\n* The direction you are facing (kind of goes into time of year, more on that below)\n\nI will break these down below. Let’s get it.\n\n### Time of year\n\nAs briefly discussed in my [Milky Way basics post](https://danieljstein.com/tutorials/milkywaybasics), the core rises and sets at different times and directions throughout the year. Click on the links for heckin examples.\n\n* [During “early core season” such as March, the core will rise in the very early morning such as about 03:00 due Southeast.](https://i.imgur.com/55M1fr0.jpg)\n* [During “mid peak season” such as July, the core can be seen rising once dark night has begun due at about 23:00 due South.](https://i.imgur.com/1OKpiwD.jpg)\n* [During “late season” such as September, the core can be seen setting due Southwest just after sunset at about 21:00.](https://i.imgur.com/nDQF2Of.jpg)\n\nNote that these times and directions will vary slight based on your *latitude*. \n\n### Oh look, Latitude. \n\nWot n tarnation is that? Sounds complicated. The latitude is measurement of your location in vicinity to the Earth’s poles. Since believe it or not the Earth is indeed a sphere, think about a circle. Halfway around a circle is 180º of rotation. Latitude starts at -90º and spans to 90º. So there ya go, 180º of rotation.\n\nIf you are standing at -90º, you would be on the South pole. If you are standing at 0º, you would be dead center at the equator. Likewise at 90º, you would be directly under the North Pole with that dude who is always wearing fluffy red jackets.\n\nWe can apply this to finding the Milky Way by understanding that the latitude you plan to shoot at will effect how much dark night you actually have to work with. Think about how there is a summer and winter solstice and how they effect daylight hours. During the summer solstice in the northern hemisphere, the days are long but the nights are short. This will ultimately limit the window of time you can shoot… as will OUR ROCK BUDDY!!!!!!!\n\n### Duh Moooooooooon\n\nThis is a biggy and it is easy to understand why! The Moon acts as one big ol bucket of light in the sky that will wash out the sky during a full Moon, but completely reveal even the faintest detail of nebula during a new moon.\n\nWhat is New Moon exactly then? Well no, the Moon is not literally new, but rather its *phase* is. The New Moon phase is when the location of the Moon is between the Earth and Sun. Therefore, the bright side of the Moon is facing away from us essentially makes the Moon invisible to us.  Full Moon is of course, the opposite. \n\nThe Moon transitions from New Moon to Full Moon over the course of 14 days. This is called *waxing.* As it transitions from Full Moon back to New Moon, it is then *waning*. The Moon rises in the East and Sets in the West every night, just like the Sun. Once we understand these Moon Phases, we can then apply it to our Core timing we learned above and thus **realize that it does not always need to be New Moon to shoot the Milky Way Core!!!!**\n\n[In this shot for example,](https://i.imgur.com/R65fwFv.jpg) I captured a Waxing Crescent Moon setting on the horizon. This means that despite the Moon Phase not being New, it was still going to set in time for me to shoot the Milky Way Core shortly afterwards.\n\n# Using the apps.\n\nAt this point, you can use the above information directly in an app like Photopills or Planit. This will allow you to make a specific plan for a specific shot, down to the act time and focal length. That way, you can visualize your shot before you get there, thus reducing the possibility of perhaps looking in the wrong direction, or being there when the moon is too bright.\n\n# Putting all the wow together.\n\nSo now you know how to time the Milky Way Core, let’s apply this to how I would use these tools to plan a shot.\n\n1. [Check the Light pollution Map to find your spot.](https://i.imgur.com/ImaSb22.jpg) You can actually do this right in Planit or [Astrospheric](https://i.imgur.com/xmtYCc9.png) which is super handy! \n2. Zoom out on the map to determine your surroundings. How much light pollution is going to be on the horizon? [In my example, there will certainly be some.](https://i.imgur.com/8oQUwgP.jpg)\n3. [Use Google Maps to figure out what your shot looks like](https://i.imgur.com/DeS9FYV.jpg). If you are lucky, maybe you can drop that little dude to determine there is a street or 360º view someone took of your location, therefore figuring out what your landscape looks like. Do this side by side with Photopills or Planit to figure out the different features and what your shot may look like. Plug in your focal length and figure out if you want to shoot wide or telephoto. \n4. These apps have the [NPF calculator built in](https://i.imgur.com/Lghf8jM.jpg), so if you are not shooting with a tracker, you can figure out your shutter speed based on your camera and focal length easy peasy!\n5. Determine when you want to shoot your shot. What time of year are going? And as a result, [what direction will the Core be rising and setting to and from?](https://i.imgur.com/xPP7hCe.jpg) How is the light pollution on the horizon effected by this?\n6. Look at the Moon phase! [What time is it rising and setting?](https://i.imgur.com/7ZHu9lY.jpg) Will the Core be visible **before** or **after** the Moon **rises** or **sets**? In my example, it looks like the Moon sets at 00:09, while the Core will already have risen. This means I would have the rest of the night to shoot! Weeeee.\n7. Ok so now we know the timing works out, what about how to get there? Back to Google Maps for a second here. If your shot is car accessible, **legally**, no problem. But if you will be hiking, this is where an app like [Gaia GPS will be critical for planning](https://i.imgur.com/ZN6qpLt.jpg). I will not get too deep into hiking basics and etiquette here as that is an entire post on its own, **but regardless of where you choose to go,** [**PLEASE LEAVE NO TRACE!!!!**](https://www.lnt.org)\n8. Omg we are so close! Now it is up to Mama nature to determine if our plan can come to life. [So, let's check the weather.](https://i.imgur.com/cPasAhX.png) Note that this really does not become accurate until perhaps a few days out, maybe even the day of. Type in your location into the NWS site. See what the clouds are doing, and **do not forget to check the wind speeds!** If it is too windy, it may be too difficult to setup a tripod and get good exposures. \n9. Use the forecast as an opportunity to be prepared. What clothing do you need to bring? How many layers, etc...\n10. One last often overlooked step is to determine how clear the sky will actually be beyond just cloud cover. [Astrospheric shines at this. You can use the map layers to determine sky transparency](https://i.imgur.com/LAC3i1a.png), as well as if there is any smoke or haze in your area. The clearer the skies, the juicier the shot.\n11. It is time. Let's go. You worked hard for this shot. Make it happen.\n\nSo, what shots are you going to plan this year?", "link": "https://www.reddit.com/r/photography/comments/nvusvp/stop_guessing_start_planning_june_new_moon_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "stop guessing, start planning! june new moon is this weekend. let’s figure out how to perfectly plan out your milky way shots so you can absolutely crush it this core season. /!/ plan your work and work your plan… that’s what….. idk someone important once told me? anywho, in my opinion, planning out your milky way shots is absolutely one of the best ways to increase the likelihood you will be shooting bangers. \n\naloha i am dan and welcome back to another one of my nightscape/milky way photography tutorials. \n\ni will be talking about how to read the weather, moon phases, light pollution maps, and of course—the timing of the milky way core. while i touched upon these items in my [milky way photography 101 tut,](https://danieljstein.com/tutorials/milkywaybasics) i will be going further in depth in this post so you can really nail it down. fear not though young citizen, everything here is super easy to follow along with.\n\n### what do you need to make the wow?\n\nwanna hear something cool? pretty much every tool i am about to describe is free…. with a few exceptions depending on your use cases. so let’s run down one by one what i use to plan and what each tool is used for.\n\n* [national weather service ](https://www.weather.gov/) \\- this free website is by the most accurate way to determine if the weather is going to be good at your location of interest.\n* [astrospheric](https://www.astrospheric.com/?latitude=47.606143&amp;longitude=-122.332346) \\- this handy free website and phone app is super helpful to determine how “clear” the sky will actually be. more on that later.\n* [gaia gps ](https://www.gaiagps.com/)\\- this free source is great for hikers and backpackers alike. optional if you are not into hiking, but if you are chances are you already have this. note: to use offline features you will need a paid subscription.\n* [the light pollution map](https://darksitefinder.com/maps/world.html#4/28.01/-71.39) \\-  as you probably are already aware of, this free website is the ultimate way to figure out where dark skies are near you.\n* [planit pro](https://www.yingwentech.com/) &amp; [photopills](https://www.photopills.com/). these paid tools are essential. i don’t like telling people to spend their moolah, but as you will see $10 goes a long way. each tool has their pros and cons, and this tutorial is cross compatible with both. either one works, determining which one is for you will ultimately be up to what interface you think you will enjoy!\n* [google maps.](https://www.google.com/maps) last but certainly not least, this is mega helpful in determining where you want to go. street &amp; 360's views are key, that way you can determine your landscape before even getting there. this is critical for planning.\n\n*note: i am by no means affiliated nor sponsored by any of the above mentioned websites and tools.* \n\n*double note: for international folks reading this, chances are your country has a similar service the nws. this is most likely going to be your best bet for weather as well.*\n\n### what i do with these things? this is already a lot?\n\ndon’t worry little jimmy. we will break these down one by one. i have a very linear thought pattern so we will go through them in the order i use them. ok cool. let’s do it.\n\n### first things first, determine the darknessness.\n\nthe first thing i like to do when it comes to planning my shot is determine if it will be dark enough. i mean, come on, makes sense right? why waste the time figuring out all of the other nonsense if the sky is going to be wayyyyyy tooo light pollluteddd.\n\nso, simply fire up the [light pollution map.](https://darksitefinder.com/maps/world.html#4/41.64/-88.33) now, if you are not already familiar with the color coding this map uses, lemme explain real quick…\n\nthis map uses something called the bortle scale. essentially, the brighter, warmer colors depict more light pollution with white being the brightest, while the cooler and darker colors depict less light pollution. [here is a graphic i made which correlates to this scale.](https://i.imgur.com/uccg5gx.jpg)\n\nso, in order to photograph our galaxy, you will want to shoot for a bortle zone 4 or better. the darker the skies, the more potent the milky way will be. **this is a great starting point for determining a location where you want to shoot.**\n\n*now here is something you need to consider. not only does the light pollution in the spot where you are shooting from matter, but so does the direction you are looking towards. if you are looking towards a core rising in the heat of a massive city, you will capture lots of light pollution on the horizon in that direction.*\n\n### when see core?\n\nthe visibility of the milky way core is not consistent from one night to the next. rather, it is determined by these factors:\n\n* time of year\n* latitude\n* moon phase\n* the direction you are facing (kind of goes into time of year, more on that below)\n\ni will break these down below. let’s get it.\n\n### time of year\n\nas briefly discussed in my [milky way basics post](https://danieljstein.com/tutorials/milkywaybasics), the core rises and sets at different times and directions throughout the year. click on the links for heckin examples.\n\n* [during “early core season” such as march, the core will rise in the very early morning such as about 03:00 due southeast.](https://i.imgur.com/55m1fr0.jpg)\n* [during “mid peak season” such as july, the core can be seen rising once dark night has begun due at about 23:00 due south.](https://i.imgur.com/1okpiwd.jpg)\n* [during “late season” such as september, the core can be seen setting due southwest just after sunset at about 21:00.](https://i.imgur.com/ndqf2of.jpg)\n\nnote that these times and directions will vary slight based on your *latitude*. \n\n### oh look, latitude. \n\nwot n tarnation is that? sounds complicated. the latitude is measurement of your location in vicinity to the earth’s poles. since believe it or not the earth is indeed a sphere, think about a circle. halfway around a circle is 180º of rotation. latitude starts at -90º and spans to 90º. so there ya go, 180º of rotation.\n\nif you are standing at -90º, you would be on the south pole. if you are standing at 0º, you would be dead center at the equator. likewise at 90º, you would be directly under the north pole with that dude who is always wearing fluffy red jackets.\n\nwe can apply this to finding the milky way by understanding that the latitude you plan to shoot at will effect how much dark night you actually have to work with. think about how there is a summer and winter solstice and how they effect daylight hours. during the summer solstice in the northern hemisphere, the days are long but the nights are short. this will ultimately limit the window of time you can shoot… as will our rock buddy!!!!!!!\n\n### duh moooooooooon\n\nthis is a biggy and it is easy to understand why! the moon acts as one big ol bucket of light in the sky that will wash out the sky during a full moon, but completely reveal even the faintest detail of nebula during a new moon.\n\nwhat is new moon exactly then? well no, the moon is not literally new, but rather its *phase* is. the new moon phase is when the location of the moon is between the earth and sun. therefore, the bright side of the moon is facing away from us essentially makes the moon invisible to us.  full moon is of course, the opposite. \n\nthe moon transitions from new moon to full moon over the course of 14 days. this is called *waxing.* as it transitions from full moon back to new moon, it is then *waning*. the moon rises in the east and sets in the west every night, just like the sun. once we understand these moon phases, we can then apply it to our core timing we learned above and thus **realize that it does not always need to be new moon to shoot the milky way core!!!!**\n\n[in this shot for example,](https://i.imgur.com/r65fwfv.jpg) i captured a waxing crescent moon setting on the horizon. this means that despite the moon phase not being new, it was still going to set in time for me to shoot the milky way core shortly afterwards.\n\n# using the apps.\n\nat this point, you can use the above information directly in an app like photopills or planit. this will allow you to make a specific plan for a specific shot, down to the act time and focal length. that way, you can visualize your shot before you get there, thus reducing the possibility of perhaps looking in the wrong direction, or being there when the moon is too bright.\n\n# putting all the wow together.\n\nso now you know how to time the milky way core, let’s apply this to how i would use these tools to plan a shot.\n\n1. [check the light pollution map to find your spot.](https://i.imgur.com/imasb22.jpg) you can actually do this right in planit or [astrospheric](https://i.imgur.com/xmtycc9.png) which is super handy! \n2. zoom out on the map to determine your surroundings. how much light pollution is going to be on the horizon? [in my example, there will certainly be some.](https://i.imgur.com/8oquwgp.jpg)\n3. [use -----> google !!!  -----> maps !!!  to figure out what your shot looks like](https://i.imgur.com/des9fyv.jpg). if you are lucky, maybe you can drop that little dude to determine there is a street or 360º view someone took of your location, therefore figuring out what your landscape looks like. do this side by side with photopills or planit to figure out the different features and what your shot may look like. plug in your focal length and figure out if you want to shoot wide or telephoto. \n4. these apps have the [npf calculator built in](https://i.imgur.com/lghf8jm.jpg), so if you are not shooting with a tracker, you can figure out your shutter speed based on your camera and focal length easy peasy!\n5. determine when you want to shoot your shot. what time of year are going? and as a result, [what direction will the core be rising and setting to and from?](https://i.imgur.com/xpp7hce.jpg) how is the light pollution on the horizon effected by this?\n6. look at the moon phase! [what time is it rising and setting?](https://i.imgur.com/7zhu9ly.jpg) will the core be visible **before** or **after** the moon **rises** or **sets**? in my example, it looks like the moon sets at 00:09, while the core will already have risen. this means i would have the rest of the night to shoot! weeeee.\n7. ok so now we know the timing works out, what about how to get there? back to google maps for a second here. if your shot is car accessible, **legally**, no problem. but if you will be hiking, this is where an app like [gaia gps will be critical for planning](https://i.imgur.com/zn6qplt.jpg). i will not get too deep into hiking basics and etiquette here as that is an entire post on its own, **but regardless of where you choose to go,** [**please leave no trace!!!!**](https://www.lnt.org)\n8. omg we are so close! now it is up to mama nature to determine if our plan can come to life. [so, let's check the weather.](https://i.imgur.com/cpasahx.png) note that this really does not become accurate until perhaps a few days out, maybe even the day of. type in your location into the nws site. see what the clouds are doing, and **do not forget to check the wind speeds!** if it is too windy, it may be too difficult to setup a tripod and get good exposures. \n9. use the forecast as an opportunity to be prepared. what clothing do you need to bring? how many layers, etc...\n10. one last often overlooked step is to determine how clear the sky will actually be beyond just cloud cover. [astrospheric shines at this. you can use the map layers to determine sky transparency](https://i.imgur.com/lac3i1a.png), as well as if there is any smoke or haze in your area. the clearer the skies, the juicier the shot.\n11. it is time. let's go. you worked hard for this shot. make it happen.\n\nso, what shots are you going to plan this year?", "sortedWord": "None", "identifyer": 14299, "year": "2021"}, {"Unnamed: 0": 123888, "autor": "JordanMccphoto", "date": 1625319762000, "content": "Photography Slumps, and How I Overcome Them /!/ Every photographer, regardless of their skill level, has been through a photography slump at some point. I’d even say I’m in the middle of one right now, because the rainy season came a little bit later than expected this year, completely messing up all of my planned shots. As a result, I feel like there’s nothing much to shoot at the moment as all the hydrangea have more or less wilted away, and I’m avoiding major cities like Tokyo for the time being.\n\nI’ve personally been through slumps a few times over the years, but I’ve always found my way out of them. Here’s a list of things I do when I’m in a photography slump/drought/lull to break out of them. Hopefully you’ll find it helpful if you find yourself in a similar situation.\n\n1) **Just Go Somewhere** \\- Sometimes, I just go somewhere with my camera, without a clear idea of what kind of images I might come home with. I simply pick a location, walk around, and see what I can see. Sometimes I come home with nothing, other times I come home with a new portfolio image. I have to admit, I live near some pretty picturesque areas, so I understand success may vary. However, sometimes, the best photos are the ones we don’t plan or even expect. My favorite city shot of 2021, so far, was a quick grab in Yokohama, while I was killing time. Had I been there 10 minutes later, walked down a different road, or been looking at my phone, I would have missed it. While some of my best work is created through weeks or months of planning, some of my favorites are produced by simply being in the right place at the right time while out for a walk. Worst case scenario, I go for a nice walk, or cycle.\n\n2) **Go Back to \"Old Reliable\"**  \\- Personally, I have a few locations I feel like I can always go to, regardless of the weather. I try not to photograph the same locations over and over, as it can lead to repetitive work, but going to one of my “old reliable” spots can help recharge the juices. On top of that, it forces me to see the location in a different way, if want to avoid producing an image identical to one I have in the past. Again, I have to admit, my “old reliable” location is Minato-Mirai, in Yokohama, which just so happens to be one of the best skylines in Japan, so I am a bit spoiled, in that regard. However, an “old reliable” spot doesn’t have to be an epic location or stunning skyline, it could be anywhere, anything, or anyone that helps you find your inspiration.\n\n3) **Think differently** \\- I wrote a whole posts on my website about how I completely changed my photography style after having a baby, but I’ll write the gist of that verbose masterpiece here. Being unable to go out and photograph landscape sunsets caused me to lose motivation for a while. However, it eventually forced me to turn my attention to the ‘boring’ suburban area around me. Instead of seeing the buildings around me as buildings, I saw them as abstract subjects. This lead to some of my favorite photos in 2019 and early 2020, and helped me land on the shortlist of the 2021 World Photography Awards. I’ve since moved out of the city, so this kind of photography has become a little more challenging, as the towering structures I was using to produce my images have been replaced by surfers, temples, and shrines. However, to prevent myself from getting into a slump, I tried finding interesting ways to create images using them as subjects, which again, led to some of my favorite images of late 2020.\n\n4) **Find Other Photography Related Things to Do** \\- Sometimes, I have the opposite problem, I go out too much, I shoot too much, so I fall behind on all of my “housekeeping” and editing. So when things are slow, I turn my attention to all the stuff we tend to pay less attention to when we’re going out and producing image after image. This includes: backing up my photos, updating my portfolio, updating shops, planning realistic future trips, editing old photos that fell through the cracks, being active in the online community, and I sometimes write about photography (as you may have noticed). I sometimes forget that there’s so much more to photography than taking photos. When things slow down, I also tend to forget how stressed I get about “not having enough time for \\*insert task here\\*” during highly active periods. Being in a slump doesn’t have to mean being unproductive, photography slumps are the perfect time to be productive in different ways. I’ve also found that looking through my old photos, talking to others about photography online, and writing about photography can help me find that spark to go out and shoot.\n\n5) **Look at Local Photography** \\- As much as I love the work of the professionals I follow, it’s not the kind of work I seek out when I’m in a slump. That’s not to diminish the quality of their work, but epic photographs taken in locations like Iceland, misty forests, and the mountains of Northern England don’t really help me find my spark when I live in a mid-sized, relatively flat, beach city in Japan. In fact, I would say that in the past, it’s actually made me feel worse, as I would dwell on the fact that I can’t visit those locations to create something that amazing. I’ve found that looking at local photographs are more likely spark my motivation to go out and explore. The photos you look at don’t have to be from professionals, either. In the past, I’ve found motivation from snapshots on the web, images shared by locals on social media, local exhibits, even just pictures uploaded to Google Maps. I think a lot of us get caught up in the world of photography and following the work of professionals, but sometimes it’s a good idea to look a little closer to home. I’ve found I’m more productive when I focus on the photographs I can take, rather than the ones I wish I could take.\n\n6) **Just Let It Be** \\- The fast pace life of social media can lead us to believe that we always have to be producing new and exciting work. However, sometimes it's OK to just let yourself be in a slump. In the past, I've gone over a month without even taking my camera out the drawer. Sometimes it's OK to focus on things that aren’t photography. I think a lot of people believe that by forcing themselves to go out and shoot, they’ll eventually produce something they’re proud of. However, it could also lead to increased frustration and burnout. Put the camera away, close your editing software, and find something else to do. They say that distance helps the heart grow fonder, so put some distance between yourself and photography, you will find your way back to it eventually.\n\nPhotography slumps come and photography slumps go. One of the things that determines our success is how we deal with them. I hope this list helps those of you currently experiencing a slump find your way out of it.\n\nIf you have any techniques you use, feel free to share them in the comments.", "link": "https://www.reddit.com/r/photography/comments/ocyaxz/photography_slumps_and_how_i_overcome_them/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "photography slumps, and how i overcome them /!/ every photographer, regardless of their skill level, has been through a photography slump at some point. i’d even say i’m in the middle of one right now, because the rainy season came a little bit later than expected this year, completely messing up all of my planned shots. as a result, i feel like there’s nothing much to shoot at the moment as all the hydrangea have more or less wilted away, and i’m avoiding major cities like tokyo for the time being.\n\ni’ve personally been through slumps a few times over the years, but i’ve always found my way out of them. here’s a list of things i do when i’m in a photography slump/drought/lull to break out of them. hopefully you’ll find it helpful if you find yourself in a similar situation.\n\n1) **just go somewhere** \\- sometimes, i just go somewhere with my camera, without a clear idea of what kind of images i might come home with. i simply pick a location, walk around, and see what i can see. sometimes i come home with nothing, other times i come home with a new portfolio image. i have to admit, i live near some pretty picturesque areas, so i understand success may vary. however, sometimes, the best photos are the ones we don’t plan or even expect. my favorite city shot of 2021, so far, was a quick grab in yokohama, while i was killing time. had i been there 10 minutes later, walked down a different road, or been looking at my phone, i would have missed it. while some of my best work is created through weeks or months of planning, some of my favorites are produced by simply being in the right place at the right time while out for a walk. worst case scenario, i go for a nice walk, or cycle.\n\n2) **go back to \"old reliable\"**  \\- personally, i have a few locations i feel like i can always go to, regardless of the weather. i try not to photograph the same locations over and over, as it can lead to repetitive work, but going to one of my “old reliable” spots can help recharge the juices. on top of that, it forces me to see the location in a different way, if want to avoid producing an image identical to one i have in the past. again, i have to admit, my “old reliable” location is minato-mirai, in yokohama, which just so happens to be one of the best skylines in japan, so i am a bit spoiled, in that regard. however, an “old reliable” spot doesn’t have to be an epic location or stunning skyline, it could be anywhere, anything, or anyone that helps you find your inspiration.\n\n3) **think differently** \\- i wrote a whole posts on my website about how i completely changed my photography style after having a baby, but i’ll write the gist of that verbose masterpiece here. being unable to go out and photograph landscape sunsets caused me to lose motivation for a while. however, it eventually forced me to turn my attention to the ‘boring’ suburban area around me. instead of seeing the buildings around me as buildings, i saw them as abstract subjects. this lead to some of my favorite photos in 2019 and early 2020, and helped me land on the shortlist of the 2021 world photography awards. i’ve since moved out of the city, so this kind of photography has become a little more challenging, as the towering structures i was using to produce my images have been replaced by surfers, temples, and shrines. however, to prevent myself from getting into a slump, i tried finding interesting ways to create images using them as subjects, which again, led to some of my favorite images of late 2020.\n\n4) **find other photography related things to do** \\- sometimes, i have the opposite problem, i go out too much, i shoot too much, so i fall behind on all of my “housekeeping” and editing. so when things are slow, i turn my attention to all the stuff we tend to pay less attention to when we’re going out and producing image after image. this includes: backing up my photos, updating my portfolio, updating shops, planning realistic future trips, editing old photos that fell through the cracks, being active in the online community, and i sometimes write about photography (as you may have noticed). i sometimes forget that there’s so much more to photography than taking photos. when things slow down, i also tend to forget how stressed i get about “not having enough time for \\*insert task here\\*” during highly active periods. being in a slump doesn’t have to mean being unproductive, photography slumps are the perfect time to be productive in different ways. i’ve also found that looking through my old photos, talking to others about photography online, and writing about photography can help me find that spark to go out and shoot.\n\n5) **look at local photography** \\- as much as i love the work of the professionals i follow, it’s not the kind of work i seek out when i’m in a slump. that’s not to diminish the quality of their work, but epic photographs taken in locations like iceland, misty forests, and the mountains of northern england don’t really help me find my spark when i live in a mid-sized, relatively flat, beach city in japan. in fact, i would say that in the past, it’s actually made me feel worse, as i would dwell on the fact that i can’t visit those locations to create something that amazing. i’ve found that looking at local photographs are more likely spark my motivation to go out and explore. the photos you look at don’t have to be from professionals, either. in the past, i’ve found motivation from snapshots on the web, images shared by locals on social media, local exhibits, even just pictures uploaded to -----> google !!!  -----> maps !!! . i think a lot of us get caught up in the world of photography and following the work of professionals, but sometimes it’s a good idea to look a little closer to home. i’ve found i’m more productive when i focus on the photographs i can take, rather than the ones i wish i could take.\n\n6) **just let it be** \\- the fast pace life of social media can lead us to believe that we always have to be producing new and exciting work. however, sometimes it's ok to just let yourself be in a slump. in the past, i've gone over a month without even taking my camera out the drawer. sometimes it's ok to focus on things that aren’t photography. i think a lot of people believe that by forcing themselves to go out and shoot, they’ll eventually produce something they’re proud of. however, it could also lead to increased frustration and burnout. put the camera away, close your editing software, and find something else to do. they say that distance helps the heart grow fonder, so put some distance between yourself and photography, you will find your way back to it eventually.\n\nphotography slumps come and photography slumps go. one of the things that determines our success is how we deal with them. i hope this list helps those of you currently experiencing a slump find your way out of it.\n\nif you have any techniques you use, feel free to share them in the comments.", "sortedWord": "None", "identifyer": 14368, "year": "2021"}, {"Unnamed: 0": 123907, "autor": "Alexoconnell1", "date": 1625291803000, "content": "Looks like a map from the video game", "link": "https://www.reddit.com/r/photography/comments/ocs61j/looks_like_a_map_from_the_video_game/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "looks like a -----> map !!!  from the video game", "sortedWord": "None", "identifyer": 14388, "year": "2021"}, {"Unnamed: 0": 125683, "autor": "mshaefer", "date": 1630542675000, "content": "Stitch together images to make one huge image? /!/ I've attempted this with some success in photoshop but it's so far been a tedious process without promising results.  What are y'all using and/or can you recommend a program that might automate or speed up this process?  (If there is a better sub for this, please direct me.  This is not my wheelhouse.)\n\nThe impetus for this came after I inherited some nautical maps that are 200 years old and older, one of them very large.  They were fancy decorations for a long time until we realized that there was very faint handwriting on almost all of them, notations from when they were used (i.e., these were not simply decorations to everyone, they were actually used for navigation).  Now we're trying to document them as best we can before some or any of the faint writing is no longer visible.  I have no idea the provenance of significance of the maps, but that's a lot of the reason why we're hoping to preserve them in detailed images, so they're easier to share with some cartographers I've connected with.  I appreciate the advice.", "link": "https://www.reddit.com/r/photography/comments/pg6sm6/stitch_together_images_to_make_one_huge_image/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "stitch together images to make one huge image? /!/ i've attempted this with some success in photoshop but it's so far been a tedious process without promising results.  what are y'all using and/or can you recommend a program that might automate or speed up this process?  (if there is a better sub for this, please direct me.  this is not my wheelhouse.)\n\nthe impetus for this came after i inherited some nautical -----> maps !!!  that are 200 years old and older, one of them very large.  they were fancy decorations for a long time until we realized that there was very faint handwriting on almost all of them, notations from when they were used (i.e., these were not simply decorations to everyone, they were actually used for navigation).  now we're trying to document them as best we can before some or any of the faint writing is no longer visible.  i have no idea the provenance of significance of the maps, but that's a lot of the reason why we're hoping to preserve them in detailed images, so they're easier to share with some cartographers i've connected with.  i appreciate the advice.", "sortedWord": "None", "identifyer": 16250, "year": "2021"}, {"Unnamed: 0": 125768, "autor": "Sad-Cook5855", "date": 1630762155000, "content": "Map on the table", "link": "https://www.reddit.com/r/photography/comments/phrko4/map_on_the_table/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "-----> map !!!  on the table", "sortedWord": "None", "identifyer": 16344, "year": "2021"}, {"Unnamed: 0": 128133, "autor": "levsw", "date": 1628073384000, "content": "I developed an Android App for photographers and travelers /!/ I developed an app that displays your personal photos on a world map. It reads the exif information from your photos and show them on a google map (or openstreetmaps).\n\nHere is the link to the Play Store: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map\n\nAny feedback is welcome :)", "link": "https://www.reddit.com/r/photography/comments/oxpwr0/i_developed_an_android_app_for_photographers_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i developed an android app for photographers and travelers /!/ i developed an app that displays your personal photos on a world -----> map !!! . it reads the exif information from your photos and show them on a google map (or openstreetmaps).\n\nhere is the link to the play store: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map\n\nany feedback is welcome :)", "sortedWord": "None", "identifyer": 18820, "year": "2021"}], "name": "mapphotography2021"}