{"interestingcomments": [{"Unnamed: 0": 112066, "autor": "xtraburnacct", "date": 1625774193000, "content": "Does anyone find themselves shooting more portrait orientation photos because of social media? /!/ I’ve often find myself shooting one photo in landscape then shooting another in portrait just so I can have a version I can post on social media. \n\nOr do you all just crop your photos?", "link": "https://www.reddit.com/r/photography/comments/ogf2cq/does_anyone_find_themselves_shooting_more/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "does anyone find themselves shooting more portrait -----> orientation !!!  photos because of social media? /!/ i’ve often find myself shooting one photo in landscape then shooting another in portrait just so i can have a version i can post on social media. \n\nor do you all just crop your photos?", "sortedWord": "None", "identifyer": 2067, "year": "2021"}, {"Unnamed: 0": 122391, "autor": "OLegacy", "date": 1615317390000, "content": "Portrait Mode Tripod Rotation Method? /!/ I am curious if there is consensus on which method of rotating the camera into portrait mode is preferred or common practice when using a lens with a collar - the setup below is just an example using the Canon 100-400 and an Oben tripod head\n\n[Portrait Orientation Rotation](https://preview.redd.it/6snjilpbu1m61.jpg?width=1343&amp;format=pjpg&amp;auto=webp&amp;s=a7625e1b5d89b35e35e68e91f38c5a341e7e6d37)\n\n&amp;#x200B;\n\n# Pros of Rotating at the collar: \n\n* Keeps center of gravity of the camera setup more in line with the tripod's center, reducing the chance of an accidental tip over\n* Fast and east to rotate without as much re-composition using the tripod head\n* Isolates the rotation purely around the lens' direction\n* For lenses that do not have a collar, using a frame or cage that allows for portrait mounting could be a good alternative to using the collar but would not allow for fine grained control\n\n# Pros of rotating at the tripod head:\n\n* Hard to line up a shot with a level or other method - there's no mechanical hard stop to indicate the collar is exactly straight, which if alternating back and forth frequently can lead to slightly mis-aligned shots, especially if in a hurry\n* Potential wear on thumbscrew and internal ring of the lens has a chance to damage a more expensive piece of gear vs the tripod head which is more typically meant for this purpose\n* Most tripod heads have a notch that automatically sets the angle using a hard stop to 90 and will lock only that mode of movement\n* Still allows for a fine grained control over rotation via the collar, as long as the thumbscrew is accessible\n\n&amp;#x200B;\n\nAre these common thoughts, or anything I've missed? Do you have a particular preference or default for a particular rationale for using one method over the other? \n\n&amp;#x200B;\n\n*Apologies if this is posted in the incorrect place, I didn't see any similar discussions in the past, but let me know where to discuss this if there is a better location!*", "link": "https://www.reddit.com/r/photography/comments/m1dvc3/portrait_mode_tripod_rotation_method/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "portrait mode tripod rotation method? /!/ i am curious if there is consensus on which method of rotating the camera into portrait mode is preferred or common practice when using a lens with a collar - the setup below is just an example using the canon 100-400 and an oben tripod head\n\n[portrait -----> orientation !!!  rotation](https://preview.redd.it/6snjilpbu1m61.jpg?width=1343&amp;format=pjpg&amp;auto=webp&amp;s=a7625e1b5d89b35e35e68e91f38c5a341e7e6d37)\n\n&amp;#x200b;\n\n# pros of rotating at the collar: \n\n* keeps center of gravity of the camera setup more in line with the tripod's center, reducing the chance of an accidental tip over\n* fast and east to rotate without as much re-composition using the tripod head\n* isolates the rotation purely around the lens' direction\n* for lenses that do not have a collar, using a frame or cage that allows for portrait mounting could be a good alternative to using the collar but would not allow for fine grained control\n\n# pros of rotating at the tripod head:\n\n* hard to line up a shot with a level or other method - there's no mechanical hard stop to indicate the collar is exactly straight, which if alternating back and forth frequently can lead to slightly mis-aligned shots, especially if in a hurry\n* potential wear on thumbscrew and internal ring of the lens has a chance to damage a more expensive piece of gear vs the tripod head which is more typically meant for this purpose\n* most tripod heads have a notch that automatically sets the angle using a hard stop to 90 and will lock only that mode of movement\n* still allows for a fine grained control over rotation via the collar, as long as the thumbscrew is accessible\n\n&amp;#x200b;\n\nare these common thoughts, or anything i've missed? do you have a particular preference or default for a particular rationale for using one method over the other? \n\n&amp;#x200b;\n\n*apologies if this is posted in the incorrect place, i didn't see any similar discussions in the past, but let me know where to discuss this if there is a better location!*", "sortedWord": "None", "identifyer": 12806, "year": "2021"}, {"Unnamed: 0": 122876, "autor": "Gezginite", "date": 1619223792000, "content": "Looking for a reasonable prices tripod. /!/ Hello everyone,\n\nBackstory: \nI been having my DSLR for a long time (10+ years) and mainly used it for taking private pictures when traveling and to private events (like family birthdays, weddings etc.). \nFurthermore I have been photographing food and small paintings/drawings (I made myself). \n\nMy issue:\nIt is very difficult for me to take stable photos of food and paintings (laying flat on the table). Until now I have been staying on the table with spread legs to both sides and the object in the middle (which have been fine for a long time). The issue is that my hands lately began to shake so the pictures ain’t longer are on a personal satisfying level. \n\n\nWhat I need help with:\nI am looking for a tripod that allows me to switch to overhead orientation (where the centrepost can be moved for overhead shooting) if I understand it correctly.\n\nExperience\nI would place myself between beginner and intermediate user since I am no professional photographer and exclusively do it on a hobby level and my knowledge about tripods are very limited (which is also the reason I ask for your expertise). I don’t really have a (locked) budget but I am thinking around $100-$150 (if that’s even possible). I read things about ball head is preferred (dunno why) and that manfrotto, Boron and gitzo (are some of the preferred brands but it was on old post here on Reddit, so ain’t sure if that is still the brands prefers when it comes to tripods)", "link": "https://www.reddit.com/r/photography/comments/mx8ssc/looking_for_a_reasonable_prices_tripod/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "looking for a reasonable prices tripod. /!/ hello everyone,\n\nbackstory: \ni been having my dslr for a long time (10+ years) and mainly used it for taking private pictures when traveling and to private events (like family birthdays, weddings etc.). \nfurthermore i have been photographing food and small paintings/drawings (i made myself). \n\nmy issue:\nit is very difficult for me to take stable photos of food and paintings (laying flat on the table). until now i have been staying on the table with spread legs to both sides and the object in the middle (which have been fine for a long time). the issue is that my hands lately began to shake so the pictures ain’t longer are on a personal satisfying level. \n\n\nwhat i need help with:\ni am looking for a tripod that allows me to switch to overhead -----> orientation !!!  (where the centrepost can be moved for overhead shooting) if i understand it correctly.\n\nexperience\ni would place myself between beginner and intermediate user since i am no professional photographer and exclusively do it on a hobby level and my knowledge about tripods are very limited (which is also the reason i ask for your expertise). i don’t really have a (locked) budget but i am thinking around $100-$150 (if that’s even possible). i read things about ball head is preferred (dunno why) and that manfrotto, boron and gitzo (are some of the preferred brands but it was on old post here on reddit, so ain’t sure if that is still the brands prefers when it comes to tripods)", "sortedWord": "None", "identifyer": 13314, "year": "2021"}, {"Unnamed: 0": 123095, "autor": "StupidBump", "date": 1620083150000, "content": "Results from super resolution through sensor rotation experiment /!/ Results from traditional super resolution processing through image averaging can often be mixed due to either too much, or too little movement of the camera sensor.\n\nAs a little experiment, I decided I'd try and use sensor rotation as a means achieving super resolution by taking a series of stable images in an (almost) complete circle using a lens ring fixed to a sturdy tripod.\n\n[Here are some results](https://imgur.com/a/4JpziBm)!\n\nWhen I have more time I plan to use some proper test images to compare this method to traditional super resolution through image averaging. Even if the results between the two are similar, having the flexibility of cropping the image into any square orientation is a nice bonus that comes with the circular image.", "link": "https://www.reddit.com/r/photography/comments/n4a19q/results_from_super_resolution_through_sensor/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "results from super resolution through sensor rotation experiment /!/ results from traditional super resolution processing through image averaging can often be mixed due to either too much, or too little movement of the camera sensor.\n\nas a little experiment, i decided i'd try and use sensor rotation as a means achieving super resolution by taking a series of stable images in an (almost) complete circle using a lens ring fixed to a sturdy tripod.\n\n[here are some results](https://imgur.com/a/4jpzibm)!\n\nwhen i have more time i plan to use some proper test images to compare this method to traditional super resolution through image averaging. even if the results between the two are similar, having the flexibility of cropping the image into any square -----> orientation !!!  is a nice bonus that comes with the circular image.", "sortedWord": "None", "identifyer": 13540, "year": "2021"}, {"Unnamed: 0": 128212, "autor": "rrrlasse", "date": 1631976614000, "content": "Removing fungus between glued lense elements /!/ I had a bad case of fungus in a Sony kit lense. The fungus was between the two outermost lenses which are assembled together in a glued plastic case.\n\nhttps://preview.redd.it/kbe0hzegu9o71.jpg?width=864&amp;format=pjpg&amp;auto=webp&amp;s=4f855dc245f696d73d8b89c7133f3711a2a4ee25\n\nI placed it in a cleaned vacuum box with enough rubbing alcohol to submerge it (I had to til the box to cover it - should have added more).\n\nFirst I of course cleaned everything very thoroughly.\n\nhttps://preview.redd.it/yjqck9egu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=f51a20f45a3f07b07cb743c0eafe869435ded0a8\n\nSucking air out. Observing small bubbles from the lense.\n\nhttps://preview.redd.it/xgd399egu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=42b32e12e55588597246e1ec9b7487cc2b28d0ef\n\nLetting air out. Make sure it's fully covered with alcohol while letting air out so that it can seep in.\n\nhttps://preview.redd.it/scahhpcgu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=bfc3d2e81568e4fb048c913ea6cc7191803a5a8d\n\nAlcohol between the lenses:\n\nhttps://preview.redd.it/girv2utnw9o71.jpg?width=1152&amp;format=pjpg&amp;auto=webp&amp;s=0817cc595d8cb8baaf0cf4be36467a86e757d6b8\n\nNow empty the box and put the lense back and suck air out. It almost all came out in the first go, but you may need to experiment with the orientation of the lense because the leaking hole needs to be below the alcohol.\n\nThe last droplet on shown on the photo below and it won't come out with suction. Now it gets crucial! If you just let it evaporate it will leave a dried out mark.\n\nSo here's what to do: Swing the lense in your arm so that it creeps to the rand of the lense, and leave the lense to dry upright, standing on the spot where the droplet went so that it stays down at the rand.\n\nhttps://preview.redd.it/jeftwoz3x9o71.jpg?width=864&amp;format=pjpg&amp;auto=webp&amp;s=a286109530122c9a6ed7fc96ba1e1439919326fc\n\nFixed lense! The stuff on top is all what's left from the alcohol residue drying by itself. There's no haze or any remains at all on the rest of the lens.\n\nIn hindsight I would have placed the lense in a new clean ziplock bag with alcohol and put that in the box to avoid any dust or grease residue completely.\n\nhttps://preview.redd.it/2bjlg1fgu9o71.jpg?width=1152&amp;format=pjpg&amp;auto=webp&amp;s=4d4983cc54c6c42768454769f555b4ab66c6b3fe", "link": "https://www.reddit.com/r/photography/comments/pqntae/removing_fungus_between_glued_lense_elements/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "removing fungus between glued lense elements /!/ i had a bad case of fungus in a sony kit lense. the fungus was between the two outermost lenses which are assembled together in a glued plastic case.\n\nhttps://preview.redd.it/kbe0hzegu9o71.jpg?width=864&amp;format=pjpg&amp;auto=webp&amp;s=4f855dc245f696d73d8b89c7133f3711a2a4ee25\n\ni placed it in a cleaned vacuum box with enough rubbing alcohol to submerge it (i had to til the box to cover it - should have added more).\n\nfirst i of course cleaned everything very thoroughly.\n\nhttps://preview.redd.it/yjqck9egu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=f51a20f45a3f07b07cb743c0eafe869435ded0a8\n\nsucking air out. observing small bubbles from the lense.\n\nhttps://preview.redd.it/xgd399egu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=42b32e12e55588597246e1ec9b7487cc2b28d0ef\n\nletting air out. make sure it's fully covered with alcohol while letting air out so that it can seep in.\n\nhttps://preview.redd.it/scahhpcgu9o71.jpg?width=912&amp;format=pjpg&amp;auto=webp&amp;s=bfc3d2e81568e4fb048c913ea6cc7191803a5a8d\n\nalcohol between the lenses:\n\nhttps://preview.redd.it/girv2utnw9o71.jpg?width=1152&amp;format=pjpg&amp;auto=webp&amp;s=0817cc595d8cb8baaf0cf4be36467a86e757d6b8\n\nnow empty the box and put the lense back and suck air out. it almost all came out in the first go, but you may need to experiment with the -----> orientation !!!  of the lense because the leaking hole needs to be below the alcohol.\n\nthe last droplet on shown on the photo below and it won't come out with suction. now it gets crucial! if you just let it evaporate it will leave a dried out mark.\n\nso here's what to do: swing the lense in your arm so that it creeps to the rand of the lense, and leave the lense to dry upright, standing on the spot where the droplet went so that it stays down at the rand.\n\nhttps://preview.redd.it/jeftwoz3x9o71.jpg?width=864&amp;format=pjpg&amp;auto=webp&amp;s=a286109530122c9a6ed7fc96ba1e1439919326fc\n\nfixed lense! the stuff on top is all what's left from the alcohol residue drying by itself. there's no haze or any remains at all on the rest of the lens.\n\nin hindsight i would have placed the lense in a new clean ziplock bag with alcohol and put that in the box to avoid any dust or grease residue completely.\n\nhttps://preview.redd.it/2bjlg1fgu9o71.jpg?width=1152&amp;format=pjpg&amp;auto=webp&amp;s=4d4983cc54c6c42768454769f555b4ab66c6b3fe", "sortedWord": "None", "identifyer": 18904, "year": "2021"}], "name": "orientationphotography2021"}