{"interestingcomments": [{"Unnamed: 0": 94419, "autor": "redactedname87", "date": 1612053307000, "content": "Godox Purchase Recommendations? /!/ Hi All\n\nWorking on getting back into photography after being away from it for a long time.   I was a self taught photographer who landed in some commercial work, so sometimes the technical bits are a bit fuzzy to me.  Especially with lights.   I used to shoot mostly products, portraits, and full body e-commerce - so that is where I am making my choices from as to what lighting.\n\nI don't have the budget to go with Profoto, but Godox seems like a decent alternative.   I'm having a hard time figuring out which lights I want though.   My studio space will be about 22' wide, 14' ceilings, and I have a run of about 30' or more. Walls are white brick, ceiling is black. \n\nAny suggestion to what power range I need to look at for a key light and a fill??   I have read really great things about the AD400pro.  But I think I would run into trouble with the power on it.\n\nAlternatively, does anyone have any suggestions on purchases for various light positions?   I'm looking at probably buying 2 background lights, 1 fill, 1 key, and probably an accent light. \n\nOther things to consider : I want TTL &amp; HSS on my key.", "link": "https://www.reddit.com/r/photography/comments/l903ou/godox_purchase_recommendations/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "godox purchase recommendations? /!/ hi all\n\nworking on getting back into photography after being away from it for a long time.   i was a self taught photographer who landed in some commercial work, so sometimes the technical bits are a bit fuzzy to me.  especially with lights.   i used to shoot mostly products, portraits, and full body e-commerce - so that is where i am making my choices from as to what lighting.\n\ni don't have the budget to go with profoto, but godox seems like a decent alternative.   i'm having a hard time figuring out which lights i want though.   my studio space will be about 22' wide, 14' ceilings, and i have a run of about 30' or more. walls are white brick, ceiling is black. \n\nany suggestion to what power range i need to look at for a key light and a fill??   i have read really great things about the ad400pro.  but i think i would run into trouble with the power on it.\n\nalternatively, does anyone have any suggestions on purchases for various light -----> positions !!! ?   i'm looking at probably buying 2 background lights, 1 fill, 1 key, and probably an accent light. \n\nother things to consider : i want ttl &amp; hss on my key.", "sortedWord": "None", "identifyer": 96939, "year": "2021"}, {"Unnamed: 0": 95010, "autor": "pinkjasperr", "date": 1627781950000, "content": "Have you ever had to increase the rate for a current client of yours? /!/ I booked a wedding client in March of 2020, one week before lockdowns started to happen.  The wedding was set to be in October of 2020.  We met in person, went over the contract and the deposit was paid same day.  Obviously at the time we believed it was only going to be a two-week lockdown, so it was until July of 2020 did they inform me that they've rescheduled the wedding to the following October (2021).  Obviously I had no issue moving the deposit and contract over to the following year as the choice was not theirs.  Fast forward to this July when they contact me again and inform me that they've changed their wedding date again until the Spring of 2022.  As much as I respect everyone's decisions for their special day, we currently don't have any restrictions on weddings where I live and their decision to move the wedding again is purely their own decision and not government imposed.  I answered back quickly letting them know the contract and deposit could be carried over until next year.  I wish I hadn't answered so fast because I didn't take into account that my rates have increased.  \n\nI feel a bit stuck because on the one hand, Covid was not their fault and the wedding would have already happened had Covid not been a thing.  On the other hand, I feel with the second date change I have more leverage to ask them to pay the difference of my price increase.  They are going to be paying well-under my current rates and I don't want to feel any sort of resentment doing the work for less than I currently charge.  I've never been in this position as deposits and sessions usually happen very close together so I just feel a bit stuck on what to do.\n\nIf the wedding doesn't happen for another 3 years (for example), is it fair for me to lock them into the price at signing forever? If you think it's fair for me to ask for the increase amount, what is the best way for me to approach this/word it? If you don't think it's fair, I want to hear your thoughts as well! \n\n  \nThanks :)", "link": "https://www.reddit.com/r/photography/comments/ovjbhc/have_you_ever_had_to_increase_the_rate_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "have you ever had to increase the rate for a current client of yours? /!/ i booked a wedding client in march of 2020, one week before lockdowns started to happen.  the wedding was set to be in october of 2020.  we met in person, went over the contract and the deposit was paid same day.  obviously at the time we believed it was only going to be a two-week lockdown, so it was until july of 2020 did they inform me that they've rescheduled the wedding to the following october (2021).  obviously i had no issue moving the deposit and contract over to the following year as the choice was not theirs.  fast forward to this july when they contact me again and inform me that they've changed their wedding date again until the spring of 2022.  as much as i respect everyone's decisions for their special day, we currently don't have any restrictions on weddings where i live and their decision to move the wedding again is purely their own decision and not government imposed.  i answered back quickly letting them know the contract and deposit could be carried over until next year.  i wish i hadn't answered so fast because i didn't take into account that my rates have increased.  \n\ni feel a bit stuck because on the one hand, covid was not their fault and the wedding would have already happened had covid not been a thing.  on the other hand, i feel with the second date change i have more leverage to ask them to pay the difference of my price increase.  they are going to be paying well-under my current rates and i don't want to feel any sort of resentment doing the work for less than i currently charge.  i've never been in this -----> position !!!  as deposits and sessions usually happen very close together so i just feel a bit stuck on what to do.\n\nif the wedding doesn't happen for another 3 years (for example), is it fair for me to lock them into the price at signing forever? if you think it's fair for me to ask for the increase amount, what is the best way for me to approach this/word it? if you don't think it's fair, i want to hear your thoughts as well! \n\n  \nthanks :)", "sortedWord": "None", "identifyer": 97559, "year": "2021"}, {"Unnamed: 0": 95833, "autor": "justindustin", "date": 1617113201000, "content": "Concerns Over Licensing and Pricing /!/ Let me introduce myself and my situation. I’m a semi-professional photographer (read: not my day job) who specializes in live events, architectural, and specialty photography. Most of my work is within my local city for private businesses and the city government itself. The use of my images is primarily for marketing purposes and centers around social media use and promotion of the businesses and events for those who hire me.\n\nRecently a “large corporate entity” (not to be named) has begun a campaign to advertise their presence in the city and is showcasing a lot of the businesses and events found here using some familiar images. I am fairly certain they obtained those images from the city, who originally hired me to to photograph them, even though I have a clause in my contract that limits use beyond the original licensee (no sub-licensing). The good news is that I’ve been put in touch with this larger entity and they are asking to directly license several images for use, and these include the photos that have already been shared on social media. (Yeah, I’m a little concerned that this happened in reverse though I’m not going to ruin a good relationship and I’m glad to have a proper path forward.)\n\nThat said, I am no stranger to licensing my images for various purposes though that is usually to a distinct person or entity for a very specific use. Also, I’ve provided images for exclusive use before, but not for the broad description that has been provided in the corporate contract I’m now reviewing. Here are the primary concerns I have over the terms and there are questions that I feel need to be brought up with this corporate entity before I can fulfill their request:\n\n1. I am the copyright holder of the images and owner of the images, though I still need to ensure the images will not violate the rights of any third party. Since all of the images to be licensed were created at public events I do not have model releases, even for stage performers. The chosen images do (or will) have crowd faces blurred as the people are not the sole subject, the ambiance of the event is what’s being used. I feel I may have to decline the performer images unless I can get a release from them if I can track down a contact. Is there anything I’m missing in this scenario that would pose a problem? I feel there is enough precedence regarding “reasonable expectation of privacy” and the voluntary presence at a public event that puts participants in a position of implicitly giving consent by their attendance.\n2. The requesting entity is asking for an “unlimited, perpetual, exclusive, irrevocable worldwide license to distribute, publicly display, alter, edit, retouch and create derivative works”. For the most part I don’t have an issue with this—the images are not on their own of any monetary value beyond what was already paid to capture them. Aside from my own portfolio, the contract does state that I cannot license the works to any other parties. However, there are a few which have already been licensed by other (or original) entities or I consider released as public domain (meaning enough people have stolen one image that I don’t have the time or energy to go after compensation). Does prior licensing exclude me from granting an exclusive license going forward—or should I simply inform the requesting entity and have them make the determination of whether they wish to proceed with certain images?\n3. The requesting entity intends to use the images for marketing and advertising purposes in digital and print media, and/or prints for framed photographs. There used to be a pricing calculator on Getty’s website, but they seem to have caught on to folks using it for free and now it just prompts you to call them for more info. How does one determine a fair and reasonable licensing price for mixed distribution when the usage seems open-ended? Should I just invest in some more trustworthy software to help get me in a ballpark range?\n\nSo my main concerns are fair pricing and obtaining releases. Are there any other concerns that I might need to consider based on the conditions above?", "link": "https://www.reddit.com/r/photography/comments/mggu99/concerns_over_licensing_and_pricing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "concerns over licensing and pricing /!/ let me introduce myself and my situation. i’m a semi-professional photographer (read: not my day job) who specializes in live events, architectural, and specialty photography. most of my work is within my local city for private businesses and the city government itself. the use of my images is primarily for marketing purposes and centers around social media use and promotion of the businesses and events for those who hire me.\n\nrecently a “large corporate entity” (not to be named) has begun a campaign to advertise their presence in the city and is showcasing a lot of the businesses and events found here using some familiar images. i am fairly certain they obtained those images from the city, who originally hired me to to photograph them, even though i have a clause in my contract that limits use beyond the original licensee (no sub-licensing). the good news is that i’ve been put in touch with this larger entity and they are asking to directly license several images for use, and these include the photos that have already been shared on social media. (yeah, i’m a little concerned that this happened in reverse though i’m not going to ruin a good relationship and i’m glad to have a proper path forward.)\n\nthat said, i am no stranger to licensing my images for various purposes though that is usually to a distinct person or entity for a very specific use. also, i’ve provided images for exclusive use before, but not for the broad description that has been provided in the corporate contract i’m now reviewing. here are the primary concerns i have over the terms and there are questions that i feel need to be brought up with this corporate entity before i can fulfill their request:\n\n1. i am the copyright holder of the images and owner of the images, though i still need to ensure the images will not violate the rights of any third party. since all of the images to be licensed were created at public events i do not have model releases, even for stage performers. the chosen images do (or will) have crowd faces blurred as the people are not the sole subject, the ambiance of the event is what’s being used. i feel i may have to decline the performer images unless i can get a release from them if i can track down a contact. is there anything i’m missing in this scenario that would pose a problem? i feel there is enough precedence regarding “reasonable expectation of privacy” and the voluntary presence at a public event that puts participants in a -----> position !!!  of implicitly giving consent by their attendance.\n2. the requesting entity is asking for an “unlimited, perpetual, exclusive, irrevocable worldwide license to distribute, publicly display, alter, edit, retouch and create derivative works”. for the most part i don’t have an issue with this—the images are not on their own of any monetary value beyond what was already paid to capture them. aside from my own portfolio, the contract does state that i cannot license the works to any other parties. however, there are a few which have already been licensed by other (or original) entities or i consider released as public domain (meaning enough people have stolen one image that i don’t have the time or energy to go after compensation). does prior licensing exclude me from granting an exclusive license going forward—or should i simply inform the requesting entity and have them make the determination of whether they wish to proceed with certain images?\n3. the requesting entity intends to use the images for marketing and advertising purposes in digital and print media, and/or prints for framed photographs. there used to be a pricing calculator on getty’s website, but they seem to have caught on to folks using it for free and now it just prompts you to call them for more info. how does one determine a fair and reasonable licensing price for mixed distribution when the usage seems open-ended? should i just invest in some more trustworthy software to help get me in a ballpark range?\n\nso my main concerns are fair pricing and obtaining releases. are there any other concerns that i might need to consider based on the conditions above?", "sortedWord": "None", "identifyer": 98409, "year": "2021"}, {"Unnamed: 0": 95857, "autor": "General_Keyboard", "date": 1615931419000, "content": "Question about Canon EF-S 18-200mm f/3.5-5.6 USM Lens /!/ Is the lens supposed to fall out of it's original position when pointing the camera down or did I get a defective lens?", "link": "https://www.reddit.com/r/photography/comments/m6ke8l/question_about_canon_efs_18200mm_f3556_usm_lens/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question about canon ef-s 18-200mm f/3.5-5.6 usm lens /!/ is the lens supposed to fall out of it's original -----> position !!!  when pointing the camera down or did i get a defective lens?", "sortedWord": "None", "identifyer": 98435, "year": "2021"}, {"Unnamed: 0": 97289, "autor": "azoth85", "date": 1610027676000, "content": "Why I Ditched my Camera Bag /!/ Recently I ditched my camera bag and switched to a camera insert. This was after spending months trying to find a bag that would fit my needs. Don’t get me wrong I love a good camera bag. (Looks at Peter McKinnon’s Nomadic bag longingly). But I wasn’t finding a bag that fit my needs. So I kept looking. Until I found that I didn’t need a camera bag at all.\n\nThis journey began back in August of 2019. After taking my first photograph trip to Northern California I knew that I needed a bigger bag. After shedding my extra layers while hiking up a mountain when it warmed up, my bag was stuffed to the gills! No way would I be able to do a longer hike that required me to carry more food or water.\n\nSo began the search for my next camera bag. I looked at all the major brands and watched every camera bag video I came across. Some of them multiple times. One could say I was a little obsessed. As I did my research, I fleshed out what I was looking for in a bag until I realized that I might need more than one bag to fit my needs. This realization came when I decided that I wanted to get back into backpacking and take my camera with me too. I started to look at bag systems like the Shimoda Action X line and the F-stop Mountain Series bags. One of the big selling points for these two systems was their modular nature. I could purchase a larger bag for backpacking, a smaller bag for day hikes and traveling, and one inner camera unit. Then I could switch between them depending on what I needed at the time. Not to mention I could remove the camera unit if I was forced to gate check my bag.\n\nThat all changed when I found an article on backpacking with camera gear that talked about using a camera insert instead of a camera bag. I had heard of camera inserts before, but I had never given them much thought. So, after a lot of research I pulled the trigger and ordered one.\n\nWhich insert did I go with? The Tenba BYOB 10. I originally ordered the Tenba BYOB 9 but found that it wouldn’t fit my camera (Canon RP with a Canon RF 24-105 f/4) and had to get the 10 instead. That said, it still fits inside the small messenger bag I have for when I want to take it out around town or to a local event. When it came time to buy a hiking/travelling backpack I took it with me to my local REI to make sure it would fit inside whatever bag I wanted. After trying on several bags I saw the REI Trail 40 and my curiosity was peaked. What makes this bag different is that it has a quad zipper design with a large U-shaped opening. That’s right, four zippers! This allows you to leave two zippers at the top and one at the bottom of each side. Now you can get in your bag from both sides as well as the top. I currently have the camera insert positioned so that I can open the bag from the side and not have to dig through everything on top of the bag if I need to change lenses or grab a filter.\n\nIs a camera insert right for you? You will have to be the one to figure that out. If you’re like me and travel light it might just work for you. Now I may pick up another camera bag in the future, but for now I’m happy that I ditched my camera bag.", "link": "https://www.reddit.com/r/photography/comments/ksdp4q/why_i_ditched_my_camera_bag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "why i ditched my camera bag /!/ recently i ditched my camera bag and switched to a camera insert. this was after spending months trying to find a bag that would fit my needs. don’t get me wrong i love a good camera bag. (looks at peter mckinnon’s nomadic bag longingly). but i wasn’t finding a bag that fit my needs. so i kept looking. until i found that i didn’t need a camera bag at all.\n\nthis journey began back in august of 2019. after taking my first photograph trip to northern california i knew that i needed a bigger bag. after shedding my extra layers while hiking up a mountain when it warmed up, my bag was stuffed to the gills! no way would i be able to do a longer hike that required me to carry more food or water.\n\nso began the search for my next camera bag. i looked at all the major brands and watched every camera bag video i came across. some of them multiple times. one could say i was a little obsessed. as i did my research, i fleshed out what i was looking for in a bag until i realized that i might need more than one bag to fit my needs. this realization came when i decided that i wanted to get back into backpacking and take my camera with me too. i started to look at bag systems like the shimoda action x line and the f-stop mountain series bags. one of the big selling points for these two systems was their modular nature. i could purchase a larger bag for backpacking, a smaller bag for day hikes and traveling, and one inner camera unit. then i could switch between them depending on what i needed at the time. not to mention i could remove the camera unit if i was forced to gate check my bag.\n\nthat all changed when i found an article on backpacking with camera gear that talked about using a camera insert instead of a camera bag. i had heard of camera inserts before, but i had never given them much thought. so, after a lot of research i pulled the trigger and ordered one.\n\nwhich insert did i go with? the tenba byob 10. i originally ordered the tenba byob 9 but found that it wouldn’t fit my camera (canon rp with a canon rf 24-105 f/4) and had to get the 10 instead. that said, it still fits inside the small messenger bag i have for when i want to take it out around town or to a local event. when it came time to buy a hiking/travelling backpack i took it with me to my local rei to make sure it would fit inside whatever bag i wanted. after trying on several bags i saw the rei trail 40 and my curiosity was peaked. what makes this bag different is that it has a quad zipper design with a large u-shaped opening. that’s right, four zippers! this allows you to leave two zippers at the top and one at the bottom of each side. now you can get in your bag from both sides as well as the top. i currently have the camera insert -----> positioned !!!  so that i can open the bag from the side and not have to dig through everything on top of the bag if i need to change lenses or grab a filter.\n\nis a camera insert right for you? you will have to be the one to figure that out. if you’re like me and travel light it might just work for you. now i may pick up another camera bag in the future, but for now i’m happy that i ditched my camera bag.", "sortedWord": "None", "identifyer": 99925, "year": "2021"}, {"Unnamed: 0": 111652, "autor": "PraderaNoire", "date": 1621001579000, "content": "Offered first Gig as DP today. /!/ I have been a professional studio photographer by trade for a while now and have made most of my money that way and through studio managing for a long time. Today I was offered the position as DP on a reality show created by NBC (keeping details tight until finalized). Not really sure what else to say other than I’m torn between being excited and petrified m ahah. Out of my wheelhouse as a photographer for sure, but thought I’d share !:)", "link": "https://www.reddit.com/r/photography/comments/nc9kic/offered_first_gig_as_dp_today/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "offered first gig as dp today. /!/ i have been a professional studio photographer by trade for a while now and have made most of my money that way and through studio managing for a long time. today i was offered the -----> position !!!  as dp on a reality show created by nbc (keeping details tight until finalized). not really sure what else to say other than i’m torn between being excited and petrified m ahah. out of my wheelhouse as a photographer for sure, but thought i’d share !:)", "sortedWord": "None", "identifyer": 1641, "year": "2021"}, {"Unnamed: 0": 111878, "autor": "Girlwithfrecklebike", "date": 1623141629000, "content": "What are some good angles and positions to pose someone for grad pics?", "link": "https://www.reddit.com/r/photography/comments/nv0330/what_are_some_good_angles_and_positions_to_pose/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "what are some good angles and -----> positions !!!  to pose someone for grad pics?", "sortedWord": "None", "identifyer": 1874, "year": "2021"}, {"Unnamed: 0": 112853, "autor": "SnowQueenSpell", "date": 1631008540000, "content": "Question for photographers and models /!/ Would you shoot a model with fresh self harm scars if some of them are slightly showing? (Not usually exposed body parts?) and later on photoshop them out? Or would that be a problem for you and you’d refuse to photograph such model? \nWould you rather a model told you about this before the shoot?\n\nFor models:\nHave you even been in that position and did you agree to model? Did you face any problems during shoots?", "link": "https://www.reddit.com/r/photography/comments/pjjyrd/question_for_photographers_and_models/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question for photographers and models /!/ would you shoot a model with fresh self harm scars if some of them are slightly showing? (not usually exposed body parts?) and later on photoshop them out? or would that be a problem for you and you’d refuse to photograph such model? \nwould you rather a model told you about this before the shoot?\n\nfor models:\nhave you even been in that -----> position !!!  and did you agree to model? did you face any problems during shoots?", "sortedWord": "None", "identifyer": 2877, "year": "2021"}, {"Unnamed: 0": 113174, "autor": "Watermelon_Mermaid", "date": 1632778829000, "content": "Do I take to small claims court? /!/ First I know this is posted about a lot but I wanted to get a few opinions on the matter. \nSecond, I don’t do photography professionally anymore and do it more for fun now. I’m a veterinary nurse full time and only take my photo gear out for personal trips. \nI was working at a clinic for awhile and I overheard the owner and office manager complain that they couldn’t find a photographer to take staff photos for them. I offered myself since I had background with doing it before. They seemed happy with the idea and I asked them if they wanted to see my old portfolio which they declined. I asked them what sort of photos they wanted and they said indoor photos against a brick wall. I said I could do that but I did better with ambient light and not studio because I don’t have all the gear for it. They said it was fine. I’d also charge time per shoot at one rate and time for “editing” (sifting through all the photos, editing out blemishes, adjusting light) at another. Again, all good. \nI take the photos of about 18 staff with their pets in a room with only a south facing window and a box light. Room is maybe 13x18 or so. \nA good handful of the photos came out blurry due to the low light and constant movement with dogs and cats, especially for those that had their shoot later in the day. I told the owner and manager and offered reshoots if they didn’t work out but they wanted to try and use them. \nThey paid part of the bill when I was about half way done with everything and I ended up leaving the clinic when I was offered a better position at a hospital but told them I’d finish the project. \nWhen I sent the finished project and remaining invoice I didn’t hear anything  \nfor awhile. When I reached out they said they didn’t like the editing I did and they requested the raw photos. \nAt first I was completely against giving them the raw photos but eventually gave in after a month of fighting. \nDidn’t hear anything for 2 months. I started texting them about stopping by for the remaining balance and every time they said they were too busy. Finally i asked them to send it to me. \nThey said they didn’t think the photos or edits are usable and they wouldn’t be paying the balance left. I checked their website and all the photos I did are either being used with my editing or as the raw photo. \nI spent a lot of time with these photos and clearly marked what each charge was for in the invoice. I felt like it was such a slap in the face for them to tell me they wouldn’t pay. To say the least I’ve become fairly angry about it! Do I take them to small claims for the $500?", "link": "https://www.reddit.com/r/photography/comments/pwrbef/do_i_take_to_small_claims_court/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "do i take to small claims court? /!/ first i know this is posted about a lot but i wanted to get a few opinions on the matter. \nsecond, i don’t do photography professionally anymore and do it more for fun now. i’m a veterinary nurse full time and only take my photo gear out for personal trips. \ni was working at a clinic for awhile and i overheard the owner and office manager complain that they couldn’t find a photographer to take staff photos for them. i offered myself since i had background with doing it before. they seemed happy with the idea and i asked them if they wanted to see my old portfolio which they declined. i asked them what sort of photos they wanted and they said indoor photos against a brick wall. i said i could do that but i did better with ambient light and not studio because i don’t have all the gear for it. they said it was fine. i’d also charge time per shoot at one rate and time for “editing” (sifting through all the photos, editing out blemishes, adjusting light) at another. again, all good. \ni take the photos of about 18 staff with their pets in a room with only a south facing window and a box light. room is maybe 13x18 or so. \na good handful of the photos came out blurry due to the low light and constant movement with dogs and cats, especially for those that had their shoot later in the day. i told the owner and manager and offered reshoots if they didn’t work out but they wanted to try and use them. \nthey paid part of the bill when i was about half way done with everything and i ended up leaving the clinic when i was offered a better -----> position !!!  at a hospital but told them i’d finish the project. \nwhen i sent the finished project and remaining invoice i didn’t hear anything  \nfor awhile. when i reached out they said they didn’t like the editing i did and they requested the raw photos. \nat first i was completely against giving them the raw photos but eventually gave in after a month of fighting. \ndidn’t hear anything for 2 months. i started texting them about stopping by for the remaining balance and every time they said they were too busy. finally i asked them to send it to me. \nthey said they didn’t think the photos or edits are usable and they wouldn’t be paying the balance left. i checked their website and all the photos i did are either being used with my editing or as the raw photo. \ni spent a lot of time with these photos and clearly marked what each charge was for in the invoice. i felt like it was such a slap in the face for them to tell me they wouldn’t pay. to say the least i’ve become fairly angry about it! do i take them to small claims for the $500?", "sortedWord": "None", "identifyer": 3209, "year": "2021"}, {"Unnamed: 0": 113511, "autor": "CarrotCake104", "date": 1629669632000, "content": "Need help with an Opportunity I’ve been given. /!/ I just got into photography a few months ago and I volunteer for free at a place every week about 3-4hrs taking pictures. I decided to apply for a position that pays, at another place. \n\nThey are actually interested in giving me the position but I only know the basics. How can I make sure that I’m prepared? I believe they offer a bit of training. Please don’t come at me for not knowing everything, I’m still in high school and needed a something to do for summer break. I didn’t expect to actually get this opportunity and they want to meet with me next week.", "link": "https://www.reddit.com/r/photography/comments/p9lyyw/need_help_with_an_opportunity_ive_been_given/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help with an opportunity i’ve been given. /!/ i just got into photography a few months ago and i volunteer for free at a place every week about 3-4hrs taking pictures. i decided to apply for a -----> position !!!  that pays, at another place. \n\nthey are actually interested in giving me the position but i only know the basics. how can i make sure that i’m prepared? i believe they offer a bit of training. please don’t come at me for not knowing everything, i’m still in high school and needed a something to do for summer break. i didn’t expect to actually get this opportunity and they want to meet with me next week.", "sortedWord": "None", "identifyer": 3561, "year": "2021"}, {"Unnamed: 0": 113512, "autor": "CarrotCake104", "date": 1629668933000, "content": "I need Advice for an opportunity. /!/ I just got into photography a few months ago and I volunteer for free at a place every week about 3-4hrs taking pictures. I decided to apply for a position that pays, at another place. They are actually interested in giving me the position but I only know the basics. What else should I learn to make sure I’m not lost when I get there? I believe they offer a bit of training. Please don’t come at me for not knowing everything, I’m still in high school and needed a summer job. I didn’t expect to actually get this opportunity. They want to meet with me next week.", "link": "https://www.reddit.com/r/photography/comments/p9lr8h/i_need_advice_for_an_opportunity/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i need advice for an opportunity. /!/ i just got into photography a few months ago and i volunteer for free at a place every week about 3-4hrs taking pictures. i decided to apply for a -----> position !!!  that pays, at another place. they are actually interested in giving me the position but i only know the basics. what else should i learn to make sure i’m not lost when i get there? i believe they offer a bit of training. please don’t come at me for not knowing everything, i’m still in high school and needed a summer job. i didn’t expect to actually get this opportunity. they want to meet with me next week.", "sortedWord": "None", "identifyer": 3562, "year": "2021"}, {"Unnamed: 0": 113745, "autor": "nillich39", "date": 1635412842000, "content": "Film Photography Survey 2021 /!/ Hi everyone!\n\nI am a Ph.D. researcher in heritage studies, and the subject of my research is film photography or gelatin sliver process. My second master's was based upon the Fotokemika factory and film photographic industry, so I decided to make my doctoral research about film photography as I realized the rapid decline and disappearance of film photography in the world. Also, I'm an amateur photographer and very passionate about film photography, the type of photography that reminds me of my childhood and growing up, so I need to admit that I'm pretty nostalgic about it in the digital era. The goal of the project is to safeguard film photography, know-how knowledge in this type of photography and pronounce it as a world cultural heritage.\n\nOne of my methods in the research is a survey as the easiest way to try to reach a worldwide film photography community and get a diversity of answers from all around the world. This survey is designed for the users of film photography, as an integral part of my Ph.D. project 'Analog photography as tangible and intangible world heritage'. If you would please spare 9 minutes to answer the questions, I would truly appreciate it as it will significantly benefit my research. Your answers will contribute to the research to gain a better insight into the position of film photography in the 21st century.\n\n[https://forms.gle/XWRAzW47v47QcMhK8](https://forms.gle/XWRAzW47v47QcMhK8?fbclid=IwAR1u7FCY55KcCZ-WZbveEMB0v3lJeRLW8Yb-SmahQI8DPJTO0dg62cqU5Uc)\n\nThank you in advance!\n\nNev", "link": "https://www.reddit.com/r/photography/comments/qhj1ef/film_photography_survey_2021/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "film photography survey 2021 /!/ hi everyone!\n\ni am a ph.d. researcher in heritage studies, and the subject of my research is film photography or gelatin sliver process. my second master's was based upon the fotokemika factory and film photographic industry, so i decided to make my doctoral research about film photography as i realized the rapid decline and disappearance of film photography in the world. also, i'm an amateur photographer and very passionate about film photography, the type of photography that reminds me of my childhood and growing up, so i need to admit that i'm pretty nostalgic about it in the digital era. the goal of the project is to safeguard film photography, know-how knowledge in this type of photography and pronounce it as a world cultural heritage.\n\none of my methods in the research is a survey as the easiest way to try to reach a worldwide film photography community and get a diversity of answers from all around the world. this survey is designed for the users of film photography, as an integral part of my ph.d. project 'analog photography as tangible and intangible world heritage'. if you would please spare 9 minutes to answer the questions, i would truly appreciate it as it will significantly benefit my research. your answers will contribute to the research to gain a better insight into the -----> position !!!  of film photography in the 21st century.\n\n[https://forms.gle/xwrazw47v47qcmhk8](https://forms.gle/xwrazw47v47qcmhk8?fbclid=iwar1u7fcy55kccz-wzbveemb0v3ljerlw8yb-smahqi8dpjto0dg62cqu5uc)\n\nthank you in advance!\n\nnev", "sortedWord": "None", "identifyer": 3807, "year": "2021"}, {"Unnamed: 0": 113770, "autor": "pranjallk1995", "date": 1635389452000, "content": "Professional photographers will have a hard time in future and is a dying art. /!/ Hi,\n\nI would want to know your opinions on this topic, \"Professional photographers will have a hard time in future\". And I would go one step beyond and even claim that it is soon going to die.\n\nLet me explain my point of view and why I believe so. I will start with some trivial reasons and then move on the main reason in the latter half of this discussion post. \n\nFirst of all I am really worried with the advancement in camera technology happening these days and it getting cheaper and more accessible every day. There are so many hobbyist (like me) that are coming up due to this and they like to take their pictures themselves. They don't need a lot of fancy gear and can get what they want even from their smartphones and software techniques without much pain. There are already cameras in smartphones that can open up to f/1.4 (Vivo X60 pro) giving tremendous low light performance for example. So be it, but the most worrisome part is that they are ready to sell their pictures (again like me) for peanuts. I for example sell my photos for less than a dollar per picture. May be this doesn't pose a lot of threat to professionals but keep up with me.\n\nNext issue that I would like to point out is that of websites like unsplash and pexels. People including some top notch photographers post their pictures here for free. Individuals and more importantly major companies/industries now have an access to large amount of stock photos for free! I myself was shocked to see my photos reaching far and wide to websites like Buzzfeed, WordPress, Flickr etc and I gained nothing in return apart from come graphs and stats showing my reach, views and downloads.\n\nAll these things are eating up the photography market from inside out like a parasite I believe. But as if this was not enough, let me introduce you to GANs (Generative Adversarial Networks). So far you might be wondering that there is still scope for specialization in fields like weddings, fashion, product, food, landscape, wildlife, portraits etc. If so, then I request you to kindly read further into this discussion.\n\nGANs are a deep learning based set of algorithm that can literally do magic. They will change the dynamics completely. **Photos will soon be created** (not taken). Once trained against a large set of database (which is available for free as mentioned before), they can make new photos. restore old photos, include what you want in a scene (like yourself), replace something that you want in a scene and what not!\n\nSome applications already available are:\n\n* Generation of random realistic portraits/models completely wiping out fashion photography.\n* Generation of cartoon characters, wiping out graphics/vector designers.\n* Image to image translation. (restoring old photos as high definition new photos, black and white to color images, sketches to realistic images)\n* Text to image translation. wiping out landscape/wildlife photography. (literally converting text like, \"A small Indian ringneck sitting on a branch\" into multiple image choices.)\n* Face repositioning and regeneration. (generate/reorient a face into required position)\n\nGANs are no joke. The results are already staggering. You must have seen deepfake challenges inviting you to find the difference between fake and original images.\n\n I would like to know your thoughts on it. Are you concerned? or things are not as grim as I portray. These GANs are only gonna get better with time.", "link": "https://www.reddit.com/r/photography/comments/qhd7zr/professional_photographers_will_have_a_hard_time/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "professional photographers will have a hard time in future and is a dying art. /!/ hi,\n\ni would want to know your opinions on this topic, \"professional photographers will have a hard time in future\". and i would go one step beyond and even claim that it is soon going to die.\n\nlet me explain my point of view and why i believe so. i will start with some trivial reasons and then move on the main reason in the latter half of this discussion post. \n\nfirst of all i am really worried with the advancement in camera technology happening these days and it getting cheaper and more accessible every day. there are so many hobbyist (like me) that are coming up due to this and they like to take their pictures themselves. they don't need a lot of fancy gear and can get what they want even from their smartphones and software techniques without much pain. there are already cameras in smartphones that can open up to f/1.4 (vivo x60 pro) giving tremendous low light performance for example. so be it, but the most worrisome part is that they are ready to sell their pictures (again like me) for peanuts. i for example sell my photos for less than a dollar per picture. may be this doesn't pose a lot of threat to professionals but keep up with me.\n\nnext issue that i would like to point out is that of websites like unsplash and pexels. people including some top notch photographers post their pictures here for free. individuals and more importantly major companies/industries now have an access to large amount of stock photos for free! i myself was shocked to see my photos reaching far and wide to websites like buzzfeed, wordpress, flickr etc and i gained nothing in return apart from come graphs and stats showing my reach, views and downloads.\n\nall these things are eating up the photography market from inside out like a parasite i believe. but as if this was not enough, let me introduce you to gans (generative adversarial networks). so far you might be wondering that there is still scope for specialization in fields like weddings, fashion, product, food, landscape, wildlife, portraits etc. if so, then i request you to kindly read further into this discussion.\n\ngans are a deep learning based set of algorithm that can literally do magic. they will change the dynamics completely. **photos will soon be created** (not taken). once trained against a large set of database (which is available for free as mentioned before), they can make new photos. restore old photos, include what you want in a scene (like yourself), replace something that you want in a scene and what not!\n\nsome applications already available are:\n\n* generation of random realistic portraits/models completely wiping out fashion photography.\n* generation of cartoon characters, wiping out graphics/vector designers.\n* image to image translation. (restoring old photos as high definition new photos, black and white to color images, sketches to realistic images)\n* text to image translation. wiping out landscape/wildlife photography. (literally converting text like, \"a small indian ringneck sitting on a branch\" into multiple image choices.)\n* face repositioning and regeneration. (generate/reorient a face into required -----> position !!! )\n\ngans are no joke. the results are already staggering. you must have seen deepfake challenges inviting you to find the difference between fake and original images.\n\n i would like to know your thoughts on it. are you concerned? or things are not as grim as i portray. these gans are only gonna get better with time.", "sortedWord": "None", "identifyer": 3834, "year": "2021"}, {"Unnamed: 0": 113854, "autor": "lemonpolarseltzer", "date": 1609883721000, "content": "Remote editing/retouching job advice? /!/ Sorry if this isn’t allowed, delete if needed. \n\n\nI’m in a tough financial situation and want to pick up some remote editing, retouching, or digital restoration work. I’ve done this as a full time job in the past, but I don’t know how to go about finding a remote position that I can do at home or down time at my full time job. Does anyone have advice or anecdotes about this kind of work? I have already reached out to my former position (I still have a good relationship with the company) but they don’t need any extra help right now.", "link": "https://www.reddit.com/r/photography/comments/kr8ubm/remote_editingretouching_job_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "remote editing/retouching job advice? /!/ sorry if this isn’t allowed, delete if needed. \n\n\ni’m in a tough financial situation and want to pick up some remote editing, retouching, or digital restoration work. i’ve done this as a full time job in the past, but i don’t know how to go about finding a remote -----> position !!!  that i can do at home or down time at my full time job. does anyone have advice or anecdotes about this kind of work? i have already reached out to my former position (i still have a good relationship with the company) but they don’t need any extra help right now.", "sortedWord": "None", "identifyer": 3920, "year": "2021"}, {"Unnamed: 0": 114029, "autor": "Srosebud420", "date": 1610222405000, "content": "HELP WITH WEDDING /!/ Hey everyone! I need some advice. So I’ve recently quit my general manager position at a restaurant to peruse shooting full time. I’ve been booking appointments for one on one shoots and I’m working with several restaurants as a photographer as well. One of my tables just asked if I would come shoot their wedding reception on the 21st of this month. It’s going to be low key and only like 20 people and they said they would want me for 2-3 hours. I got their information and told them I’d get back with pricing but I have no idea what I should charge. HELP", "link": "https://www.reddit.com/r/photography/comments/kty5ge/help_with_wedding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help with wedding /!/ hey everyone! i need some advice. so i’ve recently quit my general manager -----> position !!!  at a restaurant to peruse shooting full time. i’ve been booking appointments for one on one shoots and i’m working with several restaurants as a photographer as well. one of my tables just asked if i would come shoot their wedding reception on the 21st of this month. it’s going to be low key and only like 20 people and they said they would want me for 2-3 hours. i got their information and told them i’d get back with pricing but i have no idea what i should charge. help", "sortedWord": "None", "identifyer": 4106, "year": "2021"}, {"Unnamed: 0": 114166, "autor": "upsndwns", "date": 1610952557000, "content": "Say you are at Disneyland and your family is going to wait in line for the Silly Symphony Swings /!/ but you won't ride because the chain is probably going to break and send you flying into the ferris wheel. So now you've got to take full advantage of this time to look for interesting compositions and shoot like mad without your family getting irritated.\n\nHow much are you thinking about camera settings vs. just getting into position for your shots? Is it OK to just go full auto, or are you always considering depth of field and shutter speed?", "link": "https://www.reddit.com/r/photography/comments/kzpb3z/say_you_are_at_disneyland_and_your_family_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "say you are at disneyland and your family is going to wait in line for the silly symphony swings /!/ but you won't ride because the chain is probably going to break and send you flying into the ferris wheel. so now you've got to take full advantage of this time to look for interesting compositions and shoot like mad without your family getting irritated.\n\nhow much are you thinking about camera settings vs. just getting into -----> position !!!  for your shots? is it ok to just go full auto, or are you always considering depth of field and shutter speed?", "sortedWord": "None", "identifyer": 4247, "year": "2021"}, {"Unnamed: 0": 114504, "autor": "partiallycylon", "date": 1611480858000, "content": "CaptureOne vs Lightroom: Colors and Contrast on Identical Images /!/ In pandemic-induced boredom, I decided to run a simple experiment- Photograph a color checker chart and run it through white balance and contrast adjustment in both CaptureOne and Lightroom. I had heard somewhere that CaptureOne was \"better\" for Sony's (I currently use an a7r2) but I never thought that meant much beyond tethered workflow- since a decent colorist (aka, not me) would individually pick colors, calibrate to the known values and come out with pretty identical results regardless of the software. But I was curious what they would do to the colors natively, without profiles.\n\nI took the shots, processed them in each software from RAW, and exported them each to identical jpegs. I then opened the jpegs in photoshop to resize and add the blank white background. Everything was kept as identical (within my knowledge) as possible.\n\nThe results are surprisingly quite different. I will refrain from offering subjective opinions, because I don't know how useful it would be. There probably aren't many people who are 1) in a position to notice the difference 2) whose workflow uses either or both softwares 3) and their work is important enough for it to matter 4) who haven't already taken appropriate steps to avoid it happening.\n\nBut it was an interesting way to spend an hour. I hope you're able to download these and compare for yourself. All I learned from this is I should probably set up a calibrated color profile... that will be my next project.\n\n^(And in the likelihood there's some flaw in my methodology, don't @ me. it was a quick test.) \n\n&amp;#x200B;\n\n*Processing img s58pqhm9u8d61...*\n\n*Processing img qi59piwpu8d61...*", "link": "https://www.reddit.com/r/photography/comments/l3wezd/captureone_vs_lightroom_colors_and_contrast_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "captureone vs lightroom: colors and contrast on identical images /!/ in pandemic-induced boredom, i decided to run a simple experiment- photograph a color checker chart and run it through white balance and contrast adjustment in both captureone and lightroom. i had heard somewhere that captureone was \"better\" for sony's (i currently use an a7r2) but i never thought that meant much beyond tethered workflow- since a decent colorist (aka, not me) would individually pick colors, calibrate to the known values and come out with pretty identical results regardless of the software. but i was curious what they would do to the colors natively, without profiles.\n\ni took the shots, processed them in each software from raw, and exported them each to identical jpegs. i then opened the jpegs in photoshop to resize and add the blank white background. everything was kept as identical (within my knowledge) as possible.\n\nthe results are surprisingly quite different. i will refrain from offering subjective opinions, because i don't know how useful it would be. there probably aren't many people who are 1) in a -----> position !!!  to notice the difference 2) whose workflow uses either or both softwares 3) and their work is important enough for it to matter 4) who haven't already taken appropriate steps to avoid it happening.\n\nbut it was an interesting way to spend an hour. i hope you're able to download these and compare for yourself. all i learned from this is i should probably set up a calibrated color profile... that will be my next project.\n\n^(and in the likelihood there's some flaw in my methodology, don't @ me. it was a quick test.) \n\n&amp;#x200b;\n\n*processing img s58pqhm9u8d61...*\n\n*processing img qi59piwpu8d61...*", "sortedWord": "None", "identifyer": 4598, "year": "2021"}, {"Unnamed: 0": 114724, "autor": "alfredfive", "date": 1611627654000, "content": "Is it ok to keep my gimbal stored like this for longer periods of time? The motors on the DJI gimbal have locks that hold them in this position.", "link": "https://www.reddit.com/r/photography/comments/l53wp5/is_it_ok_to_keep_my_gimbal_stored_like_this_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is it ok to keep my gimbal stored like this for longer periods of time? the motors on the dji gimbal have locks that hold them in this -----> position !!! .", "sortedWord": "None", "identifyer": 4826, "year": "2021"}, {"Unnamed: 0": 114755, "autor": "Comrade_Zach", "date": 1612816557000, "content": "First Hire - Advice? /!/ Hello all! \n\nSo, the TLDR; is I have a minor in photography but my sister smashed my camera, and it took me a while to replace it. Fast forward a bit and I have a lower end (i assume? Rebel t1i) dslr. Been taking a lot more pictures and its been great. \n\nSo, I've been contacted by a local candy shop thats done some renovations and wants to update their social media info and offered to pay me to take the pics, and honestly I'm really excited! They said if it goes well it can turn into a permanent on ca position. \n\nThis is the first time though Ive done something like this for someone I dont know. I wanted to ask if any of you had any advice regarding things you wish you knew for your first job, or tips shooting a larger store with social media pics in mind? \n\nI'm not worried, I like taking pictures and editing them so taking a bunch and doing that for them sounds fun. But I also want to do a good job obviously and I feel like you cant really get too much good advice from people better than you so...here we are :D \n\nTLDR; first paid gig asking for advice you wish you heard for the first gig/any tips for shooting a large candy store with facebook in mind.", "link": "https://www.reddit.com/r/photography/comments/lfl5l0/first_hire_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "first hire - advice? /!/ hello all! \n\nso, the tldr; is i have a minor in photography but my sister smashed my camera, and it took me a while to replace it. fast forward a bit and i have a lower end (i assume? rebel t1i) dslr. been taking a lot more pictures and its been great. \n\nso, i've been contacted by a local candy shop thats done some renovations and wants to update their social media info and offered to pay me to take the pics, and honestly i'm really excited! they said if it goes well it can turn into a permanent on ca -----> position !!! . \n\nthis is the first time though ive done something like this for someone i dont know. i wanted to ask if any of you had any advice regarding things you wish you knew for your first job, or tips shooting a larger store with social media pics in mind? \n\ni'm not worried, i like taking pictures and editing them so taking a bunch and doing that for them sounds fun. but i also want to do a good job obviously and i feel like you cant really get too much good advice from people better than you so...here we are :d \n\ntldr; first paid gig asking for advice you wish you heard for the first gig/any tips for shooting a large candy store with facebook in mind.", "sortedWord": "None", "identifyer": 4857, "year": "2021"}, {"Unnamed: 0": 118042, "autor": "JeffTennis", "date": 1626140508000, "content": "Has anyone ever attached an iPhone to a small drone? /!/ I go hiking a bunch around the US. I hike alone almost all the time. Every now and then I'll come across a hiker who has a real camera and has some actual photography experience, so I ask them to take the pic I want. I always have my mini joby gorilla pod, so when I can't get someone to take a pic I want, I generally just set up the pod and my iPhone on a branch or rock and take a pic. I've gotten very good at it, with using the timer and getting into position. But some summits don't always have a proper place for me to place the tripod and get the right money shot.  \n  \nThe iPhone 12 Pro Max is by far the best camera phone I've ever used, and I'm going on a 42 road trip all around the country so I'm excited to use it again. I used it for the first time at Guadalupe National Park Summit in February as you can see [here](https://i.imgur.com/JkOSyhs.jpg) and at Desert Peaks National Monument, New Mexico [here](https://i.imgur.com/E9jDxr7.jpg). I've looked on Amazon at some small drones, and was debating on attaching my joby and iPhone to it just to get a little bit of height above me for some wide over the shoulder shots for the next few hikes I do. I think it'd look amazing. Just wondering if anyone has done this previously.", "link": "https://www.reddit.com/r/photography/comments/oj5hf6/has_anyone_ever_attached_an_iphone_to_a_small/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "has anyone ever attached an iphone to a small drone? /!/ i go hiking a bunch around the us. i hike alone almost all the time. every now and then i'll come across a hiker who has a real camera and has some actual photography experience, so i ask them to take the pic i want. i always have my mini joby gorilla pod, so when i can't get someone to take a pic i want, i generally just set up the pod and my iphone on a branch or rock and take a pic. i've gotten very good at it, with using the timer and getting into -----> position !!! . but some summits don't always have a proper place for me to place the tripod and get the right money shot.  \n  \nthe iphone 12 pro max is by far the best camera phone i've ever used, and i'm going on a 42 road trip all around the country so i'm excited to use it again. i used it for the first time at guadalupe national park summit in february as you can see [here](https://i.imgur.com/jkosyhs.jpg) and at desert peaks national monument, new mexico [here](https://i.imgur.com/e9jdxr7.jpg). i've looked on amazon at some small drones, and was debating on attaching my joby and iphone to it just to get a little bit of height above me for some wide over the shoulder shots for the next few hikes i do. i think it'd look amazing. just wondering if anyone has done this previously.", "sortedWord": "None", "identifyer": 8267, "year": "2021"}, {"Unnamed: 0": 118455, "autor": "Gargoose", "date": 1627261753000, "content": "Looking for advice on how professional photographers “made it” /!/ Hello all, recently my S/O and I have graduated from college in the US and are on the hunt for jobs. I recently acquired a well paying job which was expected for my degree but my S/O has not. She has a bachelors in photography and I believe her to be an incredible photographer but she is seriously struggling to find any meaningful work. Her family from another country is putting immense pressure on her to find a job with ridiculous salary expectations in a very short timeframe otherwise they want her to go back and live with them again in a country that has absolutely zero opportunities. They constantly badmouth her and the hard work she has done to obtain her degree and make her feel like shit. I am feeling immense stress as is she. She is currently living with family in another state and I’m not sure if they’ll take her parent side and send her away. I wish I could support her right now but my job has not officially begun yet so there’s nothing I could do. She has applied to god knows how many photography positions and hears nothing back for the most part. I have seen online people’s sentiment on photography degrees and how they don’t help with the job search at all, I find this so fucking sad and ridiculous because I have seen all the effort she has put in over the years. Please, if anyone has any advice, connections or if anyone can share their journey on how they became a professional photographer it would be very much appreciated. Maybe if we could show her family that their is a path to success, even if it starts with a low salary things could change for the better. I’m sorry for the long rambling sob story, I just can’t bare to see her go.", "link": "https://www.reddit.com/r/photography/comments/oroaah/looking_for_advice_on_how_professional/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "looking for advice on how professional photographers “made it” /!/ hello all, recently my s/o and i have graduated from college in the us and are on the hunt for jobs. i recently acquired a well paying job which was expected for my degree but my s/o has not. she has a bachelors in photography and i believe her to be an incredible photographer but she is seriously struggling to find any meaningful work. her family from another country is putting immense pressure on her to find a job with ridiculous salary expectations in a very short timeframe otherwise they want her to go back and live with them again in a country that has absolutely zero opportunities. they constantly badmouth her and the hard work she has done to obtain her degree and make her feel like shit. i am feeling immense stress as is she. she is currently living with family in another state and i’m not sure if they’ll take her parent side and send her away. i wish i could support her right now but my job has not officially begun yet so there’s nothing i could do. she has applied to god knows how many photography -----> positions !!!  and hears nothing back for the most part. i have seen online people’s sentiment on photography degrees and how they don’t help with the job search at all, i find this so fucking sad and ridiculous because i have seen all the effort she has put in over the years. please, if anyone has any advice, connections or if anyone can share their journey on how they became a professional photographer it would be very much appreciated. maybe if we could show her family that their is a path to success, even if it starts with a low salary things could change for the better. i’m sorry for the long rambling sob story, i just can’t bare to see her go.", "sortedWord": "None", "identifyer": 8704, "year": "2021"}, {"Unnamed: 0": 118536, "autor": "shoshilyawkward", "date": 1627170647000, "content": "Wheelchair photo shoot advice /!/ I have a photo shoot planned for tomorrow, very unofficial, it's just my mom taking some pictures of me in the park and maybe a few other places. However, as of a few weeks ago I am temporarily wheelchair bound and I don't know for how long. \n\nI can get from the wheelchair to another seated position like a park bench on my own.\n\nWhat are the most natural, ideally candid, poses in a seated position? I want these photos to seem like they are not of somebody wheelchair-bound, since I will hopefully be out of the wheelchair very soon. I want somebody to be able to look at these photos and not even realize that every single photo is taken in a seated position, that's how natural I want them to look. I'd like variety.\n\nAny advice helps! Thanks in advance!\n\nAlso, if this is the wrong sub, please direct me to the sub that this post belongs in", "link": "https://www.reddit.com/r/photography/comments/or0wjl/wheelchair_photo_shoot_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wheelchair photo shoot advice /!/ i have a photo shoot planned for tomorrow, very unofficial, it's just my mom taking some pictures of me in the park and maybe a few other places. however, as of a few weeks ago i am temporarily wheelchair bound and i don't know for how long. \n\ni can get from the wheelchair to another seated -----> position !!!  like a park bench on my own.\n\nwhat are the most natural, ideally candid, poses in a seated position? i want these photos to seem like they are not of somebody wheelchair-bound, since i will hopefully be out of the wheelchair very soon. i want somebody to be able to look at these photos and not even realize that every single photo is taken in a seated position, that's how natural i want them to look. i'd like variety.\n\nany advice helps! thanks in advance!\n\nalso, if this is the wrong sub, please direct me to the sub that this post belongs in", "sortedWord": "None", "identifyer": 8790, "year": "2021"}, {"Unnamed: 0": 118705, "autor": "sharksfan6", "date": 1627982848000, "content": "What should I do if an employer asks for a portfolio, but I don't have one already? /!/ Hey everyone! I recently messaged a small business about hiring me for a position. The owner asked for a link to my portfolio. The only problem is I don't really have one. I've only shared my photos on Instagram and occasionally here on Reddit. I was wondering what the proper response  would be? Should I go ahead and try to create an online portfolio before responding, tell him that I don't have one, or give him the link to my Insta? Sorry if this is a dumb question, I'm pretty inexperienced with the professional aspects of photography. Any advice would be much appreciated!", "link": "https://www.reddit.com/r/photography/comments/owzuhl/what_should_i_do_if_an_employer_asks_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what should i do if an employer asks for a portfolio, but i don't have one already? /!/ hey everyone! i recently messaged a small business about hiring me for a -----> position !!! . the owner asked for a link to my portfolio. the only problem is i don't really have one. i've only shared my photos on instagram and occasionally here on reddit. i was wondering what the proper response  would be? should i go ahead and try to create an online portfolio before responding, tell him that i don't have one, or give him the link to my insta? sorry if this is a dumb question, i'm pretty inexperienced with the professional aspects of photography. any advice would be much appreciated!", "sortedWord": "None", "identifyer": 8964, "year": "2021"}, {"Unnamed: 0": 118888, "autor": "heisenberg0389", "date": 1628559645000, "content": "Need ways to light up a couple /!/ What's the best way to light up a couple positioned in the marked position in the image. This shot was taken using a smartphone but I would be using an 85 mm lens which will cut off most of the water, except the reflection. Need help in positioning a softbox or something without it coming in the frame.\n\n&amp;#x200B;\n\n[https://imgur.com/a/mJsdL9S](https://imgur.com/a/mJsdL9S)", "link": "https://www.reddit.com/r/photography/comments/p1fep3/need_ways_to_light_up_a_couple/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "need ways to light up a couple /!/ what's the best way to light up a couple -----> positioned !!!  in the marked position in the image. this shot was taken using a smartphone but i would be using an 85 mm lens which will cut off most of the water, except the reflection. need help in positioning a softbox or something without it coming in the frame.\n\n&amp;#x200b;\n\n[https://imgur.com/a/mjsdl9s](https://imgur.com/a/mjsdl9s)", "sortedWord": "None", "identifyer": 9152, "year": "2021"}, {"Unnamed: 0": 119288, "autor": "Ok-Measurement5590", "date": 1631208476000, "content": "I like sunsets, it's the transition of day into night,the day hasn't finished completely and the night life is warming up. Clicked this on my outside my balcony waiting for it to come just at right position", "link": "https://www.reddit.com/r/photography/comments/pl2dy1/i_like_sunsets_its_the_transition_of_day_into/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i like sunsets, it's the transition of day into night,the day hasn't finished completely and the night life is warming up. clicked this on my outside my balcony waiting for it to come just at right -----> position !!! ", "sortedWord": "None", "identifyer": 9566, "year": "2021"}, {"Unnamed: 0": 119312, "autor": "FlyLikeMouse", "date": 1631182658000, "content": "Telephoto lens advice for canon 80D /!/ Hi all. \n\nYou can skip the first three paragraphs if you don’t want the backstory…!\n\nI studied photography a good 12 years ago at college, but now mostly work as a live performer (Circus, Gymnastics and Theatre). Whilst thats been terrible for affording new photography kit, its put me in some great situations to capture other high-skilled performers, from dancers to jugglers to aerialists to fire performers etc. \n\nI’ve always done odd jobs here and there for  other artists for their web design or show promotion, and have shot a few weddings. But only at a “better than an amateur but certainly not a pro” kinda level.\n\nI’m in a position now where I’d like to pursue it more, collate a portfolio and even a simple home lighting studio. I mostly shoot live highly dynamic events, indoor and outdoors… but I’d like to get better at portrait shoots.\n\nCurrently I shoot everything on a Canon 80D with a Canon 17-55mm (f/2.8). I also have a cheap 50mm prime which came with the camera.\n\nI think a telephoto lens is the next bit of kit I’d like to buy - to get closer to the action at dynamic performances/shoot from further away at live events, and to also experiment with portrait/studio style shooting with more depth. I’ll probably pick up a wide angle lens too as I keep finding myself in situations where one would be handy.\n\nI’ve never used a telephoto lens before, so not sure what to look out for and I’m wondering if people here could point me the right direction / share any insights. \n\nCurrently I’ve been looking at\nCanon EF 70-300mm f/4.0-5.6 IS USM\nand\nCanon EF-S 55-250 mm F4-5.6 IS STM\n\nThe former would be compatible with a full frame - which I am tempted to upgrade to in the next few years, whereas the latter seems shorter range but more versatile.\n\nOn a limited budget, but would also be happy to spend up to 800 on a good recommendation. \n\nWould appreciate any insights/total corrections on my line of thinking!", "link": "https://www.reddit.com/r/photography/comments/pkv05s/telephoto_lens_advice_for_canon_80d/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "telephoto lens advice for canon 80d /!/ hi all. \n\nyou can skip the first three paragraphs if you don’t want the backstory…!\n\ni studied photography a good 12 years ago at college, but now mostly work as a live performer (circus, gymnastics and theatre). whilst thats been terrible for affording new photography kit, its put me in some great situations to capture other high-skilled performers, from dancers to jugglers to aerialists to fire performers etc. \n\ni’ve always done odd jobs here and there for  other artists for their web design or show promotion, and have shot a few weddings. but only at a “better than an amateur but certainly not a pro” kinda level.\n\ni’m in a -----> position !!!  now where i’d like to pursue it more, collate a portfolio and even a simple home lighting studio. i mostly shoot live highly dynamic events, indoor and outdoors… but i’d like to get better at portrait shoots.\n\ncurrently i shoot everything on a canon 80d with a canon 17-55mm (f/2.8). i also have a cheap 50mm prime which came with the camera.\n\ni think a telephoto lens is the next bit of kit i’d like to buy - to get closer to the action at dynamic performances/shoot from further away at live events, and to also experiment with portrait/studio style shooting with more depth. i’ll probably pick up a wide angle lens too as i keep finding myself in situations where one would be handy.\n\ni’ve never used a telephoto lens before, so not sure what to look out for and i’m wondering if people here could point me the right direction / share any insights. \n\ncurrently i’ve been looking at\ncanon ef 70-300mm f/4.0-5.6 is usm\nand\ncanon ef-s 55-250 mm f4-5.6 is stm\n\nthe former would be compatible with a full frame - which i am tempted to upgrade to in the next few years, whereas the latter seems shorter range but more versatile.\n\non a limited budget, but would also be happy to spend up to 800 on a good recommendation. \n\nwould appreciate any insights/total corrections on my line of thinking!", "sortedWord": "None", "identifyer": 9590, "year": "2021"}, {"Unnamed: 0": 120445, "autor": "Matt_Sterbate710", "date": 1629233062000, "content": "Just accepted a photography job /!/ 31 years old, in my senior year of college (I went back to college at 28). I got offered a position to be the marching band photographer and I accepted. This is my first real gig, and I feel the imposter syndrome some people talk about. I’m nervous about something new and something a lot of people will be looking at. Any tips for amateur photographers going into their first shoots?", "link": "https://www.reddit.com/r/photography/comments/p6c3kt/just_accepted_a_photography_job/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just accepted a photography job /!/ 31 years old, in my senior year of college (i went back to college at 28). i got offered a -----> position !!!  to be the marching band photographer and i accepted. this is my first real gig, and i feel the imposter syndrome some people talk about. i’m nervous about something new and something a lot of people will be looking at. any tips for amateur photographers going into their first shoots?", "sortedWord": "None", "identifyer": 10774, "year": "2021"}, {"Unnamed: 0": 120576, "autor": "SadMasterpiece3076", "date": 1634553106000, "content": "Can Anyone Offer Advice on the Best Way I should Register my Photography Business - UK /!/ Hi,  \n\n\nJust as a starter, thank you all for any potential advice offered here! Essentially, myself and my partner have been interested in starting our own photography business for a while specializing in weddings and events. We decided to just build an entire portfolio working for free, and so that's exactly what we did. We shot a fairly extensive library of wedding and events images, which has now put us in the position that we have a decent sized backlog of people wanting us for paid work, which is fantastic. The thing is, neither myself or my partner are massively savvy on the best way to register the business, so that we can make sure we're paying the proper tax and whatnot. I have put a decent amount of time in to researching this, but wanted to reach out to actual photographers for their experience.\n\n&amp;#x200B;\n\nIs anybody here able to offer advice on what they would recommend as the best set-up for a joint-ownership photography business?\n\n&amp;#x200B;\n\nThanks all so much for your help!", "link": "https://www.reddit.com/r/photography/comments/qajz6s/can_anyone_offer_advice_on_the_best_way_i_should/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "can anyone offer advice on the best way i should register my photography business - uk /!/ hi,  \n\n\njust as a starter, thank you all for any potential advice offered here! essentially, myself and my partner have been interested in starting our own photography business for a while specializing in weddings and events. we decided to just build an entire portfolio working for free, and so that's exactly what we did. we shot a fairly extensive library of wedding and events images, which has now put us in the -----> position !!!  that we have a decent sized backlog of people wanting us for paid work, which is fantastic. the thing is, neither myself or my partner are massively savvy on the best way to register the business, so that we can make sure we're paying the proper tax and whatnot. i have put a decent amount of time in to researching this, but wanted to reach out to actual photographers for their experience.\n\n&amp;#x200b;\n\nis anybody here able to offer advice on what they would recommend as the best set-up for a joint-ownership photography business?\n\n&amp;#x200b;\n\nthanks all so much for your help!", "sortedWord": "None", "identifyer": 10910, "year": "2021"}, {"Unnamed: 0": 121048, "autor": "lilagg29", "date": 1635375277000, "content": "Photographer missed deadline /!/ Sorry if this isn’t the best place for this, but I have nowhere else to go to get a photographers pov. \n\ni hired a photographer to do a newborn shoot. during the shoot i asked her what the turn around times were. she said i’d get sneak peeks that day or the next and a full gallery in 2-3weeks. i never got the sneak peaks but i didn’t say anything because i figured she was really busy and i had no problem waiting for the full gallery any way. Well, yesterday was the three week mark and i didn’t get the full gallery or even a message from her notifying me that she’d be late. \n\nI don’t know if i should give her until monday or another week or what to even do. what would you like a client to do if you were in this position? \n\ni have 4 other shoots scheduled that have already been paid for and i don’t like that i can’t expect my photos when she said i should.", "link": "https://www.reddit.com/r/photography/comments/qh8ua2/photographer_missed_deadline/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photographer missed deadline /!/ sorry if this isn’t the best place for this, but i have nowhere else to go to get a photographers pov. \n\ni hired a photographer to do a newborn shoot. during the shoot i asked her what the turn around times were. she said i’d get sneak peeks that day or the next and a full gallery in 2-3weeks. i never got the sneak peaks but i didn’t say anything because i figured she was really busy and i had no problem waiting for the full gallery any way. well, yesterday was the three week mark and i didn’t get the full gallery or even a message from her notifying me that she’d be late. \n\ni don’t know if i should give her until monday or another week or what to even do. what would you like a client to do if you were in this -----> position !!! ? \n\ni have 4 other shoots scheduled that have already been paid for and i don’t like that i can’t expect my photos when she said i should.", "sortedWord": "None", "identifyer": 11403, "year": "2021"}, {"Unnamed: 0": 121049, "autor": "lilagg29", "date": 1635374966000, "content": "Photographer missed deadline? /!/ Sorry if this isn’t the best place for this, but I have nowhere else to go to get a photographers pov. \n\ni hired a photographer to do a newborn shoot. during the shoot i asked her what the turn around times were. she said i’d get sneak peeks that day or the next and a full gallery in 2-3weeks. i never got the sneak peaks but i didn’t say anything because i figured she was really busy and i had no problem waiting for the full gallery any way. Well, yesterday was the three week mark and i didn’t get the full gallery or even a message from her notifying me that she’d be late. \n\nI don’t know if i should give her until monday or another week or what to even do. what would you like a client to do if you were in this position? \n\ni have 4 other shoots scheduled that have already been paid for and i don’t like that i can’t expect my photos when she said i should.", "link": "https://www.reddit.com/r/photography/comments/qh8qq9/photographer_missed_deadline/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photographer missed deadline? /!/ sorry if this isn’t the best place for this, but i have nowhere else to go to get a photographers pov. \n\ni hired a photographer to do a newborn shoot. during the shoot i asked her what the turn around times were. she said i’d get sneak peeks that day or the next and a full gallery in 2-3weeks. i never got the sneak peaks but i didn’t say anything because i figured she was really busy and i had no problem waiting for the full gallery any way. well, yesterday was the three week mark and i didn’t get the full gallery or even a message from her notifying me that she’d be late. \n\ni don’t know if i should give her until monday or another week or what to even do. what would you like a client to do if you were in this -----> position !!! ? \n\ni have 4 other shoots scheduled that have already been paid for and i don’t like that i can’t expect my photos when she said i should.", "sortedWord": "None", "identifyer": 11404, "year": "2021"}, {"Unnamed: 0": 122437, "autor": "BeardedGothLord", "date": 1615575263000, "content": "Initial thoughts on TTArtisan 50mm f1.4 ASPH for Leica M Mount /!/ For the Leica shooter on a budget (Yes, we exist. No, we are not the most logical bunch), few offerings have been as intriguing as the Chinese \"Summiluxes\" from TTArtisan. They promise impressive build quality at a seemingly impossible budget, with optical quality that allegedly edges in on Leica glass. I received my copy of the lens about a week ago and was floored with the high-quality feel of the lens. Its all-metal construction, focus dampening, and precise aperture ring genuinely felt more impressive than my Voigtlander lenses. I won't spend too much time praising the optical quality of this lens. Many have done so in a more professional fashion than I care to attempt. I am a hobbyist, not a pixel peeper. If you want the nitty-gritty, Benj Haisch and Ken Rockwell both go into detail about the optical strengths and shortcomings of this inexpensive Summilux clone. What I will say is that it's good. Very good. Not \"very good for a $369 lens.\" Just very good, period. \n\n[TTArtisan 50mm f1.4 ASPH in box](https://preview.redd.it/49tuvby16nm61.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6b65fefc3217e59e8431c26be6aca721ff0961cd)\n\nHowever, I was not able to keep my first copy of this lens. Purchased new from B&amp;H, it was not until after I finished the calibration process (a royal pain on film bodies like my M7) that I noticed something odd happening in the rangefinder. This lens was pulling up the correct 50mm frame lines, that was true, but it was simultaneously pulling up a second pair of frame lines. I was met with lines for 50mm, 75mm, and partial lines for 35mm and 135mm. Of course, the lens was still usable, but this is a pretty basic thing for an M Mount lens to be expected to accomplish. \n\n&amp;#x200B;\n\n[Calibrating on a film body... A test in patience](https://preview.redd.it/nu0hivv86nm61.jpg?width=2268&amp;format=pjpg&amp;auto=webp&amp;s=4b38beb3963839679c53ed391f827135b32954a5)\n\nThe culprit? I can't say for certain. My best guess is that the lens mount is not made to the same standards as more expensive glass, which comes as no surprise, but it was made so sloppily that it was not able to correctly interact with the frame line mechanism in the camera body. What I do know is that the issue is not with my camera body, as I have tried 3 other 50mm lenses (one being a Canon 1.8 LTM with a cheap adapter) that pulled up the correct frame lines without issue.\n\n[Extra frame lines](https://preview.redd.it/ym51maeg6nm61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=1858d6f9ba48bdbcc8ec340b5103402519aa92cb)\n\nTo B&amp;H's credit, they took care of it without question and I received my new copy of the lens today... which has the same issue. This time I get a sliver of the 35mm frame line on the left side of the viewfinder, so it's less extreme than last time around. Is it enough of an issue to warrant sending it back a second time? I can't yet say. I'll have to spend some time shooting with it to see how distracting this issue is, and it appears that I might be able to remedy the issue by over-rotating the lens with the lock disengaged (past the locking pin, triggering 28mm/90mm frame lines) and rotating it back to its proper position. A ridiculous mounting process for a brand new lens, but hey... it's still a $369 50mm f1.4 for M mount. I might be willing to put up with some issues for the performance per dollar. That, and it works perfectly on my Sony A7iii.\n\n[Attempt number two on my Leica M7. Better, but not perfect.](https://preview.redd.it/73u91efy6nm61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=71f644deb99611d7e684252d5ed70eb8cd4304f2)\n\nAll this to say, take the overwhelmingly positive reviews about this lens with a grain of salt. I have no doubt that the reviewers of this lens have been honest in their writings, but I also know that many reviewers have received their copies of these lenses from TTA for the purpose of reviewing. I would not be surprised if review units were given a second once-over before being put in the mail, and I  think there may be some manufacturing inconsistencies present with these TTArtisan lenses. Perhaps you will have better luck than I have. Perhaps I will exchange it again and try my luck a third time. Perhaps I'll just send it back and buy a used Zeiss 50mm F2. Time will tell, but your mileage may vary. The bottom line remains, it's an optically fantastic lens and has no issues on a mirrorless camera. But on an M mount system, where it was intended to be used, two brand new lenses shouldn't have this type of issue. \n\n*Processing img g5nxf3b38nm61...*", "link": "https://www.reddit.com/r/photography/comments/m3oc95/initial_thoughts_on_ttartisan_50mm_f14_asph_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "initial thoughts on ttartisan 50mm f1.4 asph for leica m mount /!/ for the leica shooter on a budget (yes, we exist. no, we are not the most logical bunch), few offerings have been as intriguing as the chinese \"summiluxes\" from ttartisan. they promise impressive build quality at a seemingly impossible budget, with optical quality that allegedly edges in on leica glass. i received my copy of the lens about a week ago and was floored with the high-quality feel of the lens. its all-metal construction, focus dampening, and precise aperture ring genuinely felt more impressive than my voigtlander lenses. i won't spend too much time praising the optical quality of this lens. many have done so in a more professional fashion than i care to attempt. i am a hobbyist, not a pixel peeper. if you want the nitty-gritty, benj haisch and ken rockwell both go into detail about the optical strengths and shortcomings of this inexpensive summilux clone. what i will say is that it's good. very good. not \"very good for a $369 lens.\" just very good, period. \n\n[ttartisan 50mm f1.4 asph in box](https://preview.redd.it/49tuvby16nm61.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6b65fefc3217e59e8431c26be6aca721ff0961cd)\n\nhowever, i was not able to keep my first copy of this lens. purchased new from b&amp;h, it was not until after i finished the calibration process (a royal pain on film bodies like my m7) that i noticed something odd happening in the rangefinder. this lens was pulling up the correct 50mm frame lines, that was true, but it was simultaneously pulling up a second pair of frame lines. i was met with lines for 50mm, 75mm, and partial lines for 35mm and 135mm. of course, the lens was still usable, but this is a pretty basic thing for an m mount lens to be expected to accomplish. \n\n&amp;#x200b;\n\n[calibrating on a film body... a test in patience](https://preview.redd.it/nu0hivv86nm61.jpg?width=2268&amp;format=pjpg&amp;auto=webp&amp;s=4b38beb3963839679c53ed391f827135b32954a5)\n\nthe culprit? i can't say for certain. my best guess is that the lens mount is not made to the same standards as more expensive glass, which comes as no surprise, but it was made so sloppily that it was not able to correctly interact with the frame line mechanism in the camera body. what i do know is that the issue is not with my camera body, as i have tried 3 other 50mm lenses (one being a canon 1.8 ltm with a cheap adapter) that pulled up the correct frame lines without issue.\n\n[extra frame lines](https://preview.redd.it/ym51maeg6nm61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=1858d6f9ba48bdbcc8ec340b5103402519aa92cb)\n\nto b&amp;h's credit, they took care of it without question and i received my new copy of the lens today... which has the same issue. this time i get a sliver of the 35mm frame line on the left side of the viewfinder, so it's less extreme than last time around. is it enough of an issue to warrant sending it back a second time? i can't yet say. i'll have to spend some time shooting with it to see how distracting this issue is, and it appears that i might be able to remedy the issue by over-rotating the lens with the lock disengaged (past the locking pin, triggering 28mm/90mm frame lines) and rotating it back to its proper -----> position !!! . a ridiculous mounting process for a brand new lens, but hey... it's still a $369 50mm f1.4 for m mount. i might be willing to put up with some issues for the performance per dollar. that, and it works perfectly on my sony a7iii.\n\n[attempt number two on my leica m7. better, but not perfect.](https://preview.redd.it/73u91efy6nm61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=71f644deb99611d7e684252d5ed70eb8cd4304f2)\n\nall this to say, take the overwhelmingly positive reviews about this lens with a grain of salt. i have no doubt that the reviewers of this lens have been honest in their writings, but i also know that many reviewers have received their copies of these lenses from tta for the purpose of reviewing. i would not be surprised if review units were given a second once-over before being put in the mail, and i  think there may be some manufacturing inconsistencies present with these ttartisan lenses. perhaps you will have better luck than i have. perhaps i will exchange it again and try my luck a third time. perhaps i'll just send it back and buy a used zeiss 50mm f2. time will tell, but your mileage may vary. the bottom line remains, it's an optically fantastic lens and has no issues on a mirrorless camera. but on an m mount system, where it was intended to be used, two brand new lenses shouldn't have this type of issue. \n\n*processing img g5nxf3b38nm61...*", "sortedWord": "None", "identifyer": 12855, "year": "2021"}, {"Unnamed: 0": 122861, "autor": "willumasaurus", "date": 1619252157000, "content": "Need kit help /!/ I am a professional photographer and videographer that has recently left a full time salaried position to go it on my own. (I've thought a lot about it, and have work once with gear) I need a camera that will take excellent pictures and also shoot pretty solid video. I am looking at Sony A7RIV. I have extensive work use with the R3 and am hopeing my reddit friends can help with the decision. My budget is about 12k. Thanks friends!", "link": "https://www.reddit.com/r/photography/comments/mxfm6p/need_kit_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need kit help /!/ i am a professional photographer and videographer that has recently left a full time salaried -----> position !!!  to go it on my own. (i've thought a lot about it, and have work once with gear) i need a camera that will take excellent pictures and also shoot pretty solid video. i am looking at sony a7riv. i have extensive work use with the r3 and am hopeing my reddit friends can help with the decision. my budget is about 12k. thanks friends!", "sortedWord": "None", "identifyer": 13298, "year": "2021"}, {"Unnamed: 0": 122885, "autor": "Vincetagram", "date": 1619214497000, "content": "My boss just screwed me into shooting a wedding for a fraction of what I would have charged, I can’t get out of this now, but how should I go about a situation like this in the future? /!/ So I do Automotive photography, and I recently came upon a full time job shooting the listing photography as well as managing and creating marketing material for social media for a high end dealership.  I can’t imagine a better position at 21 years old getting to drive and shoot exotic cars almost every day. However, my boss, who owns the dealership recently asked me to shoot a wedding. I don’t normally shoot weddings, I don’t prefer shooting weddings, but I have and am more than capable. If someone ask me then sure but I don’t actively go out looking for weddings to shoot. Our previous photographer who recently moved into a new profession, was supposed to do it, and he forgot that he was hiring a photographer, as a gift to the heir to the owner of a very well known automotive group in my area for his wedding. So he asks me to do it LESS THAN A FUCKING WEEK IN ADVANCE. However, I did oblige. I was going to be working on that day, but he said I could have the day off to shoot the wedding, and a week was definitely enough time to go scope out the venue and get to know what the couple wanted. Here’s where the problem starts. I get into his office and meet with the couple, and I immediately get the vibe that I’m not gonna be getting paid what I would normally charge for this shoot. He said earlier that he’s just pay me as a bonus in my check, which I was fine with if that made it easier, but this changed the dynamic because this is no longer a contract between OP’s Photography and him, but part of my work duties. A couple days later, I ask him how much is this bonus going to be, especially because I didn’t want to rent the equipment and Rob myself of a profit margin. He asked me how much I needed, I was thinking about charging $1000(I would normally charge a hefty late fee, but said fuck it, it may whatever), but knew he wasn’t even trying to pay half that, so I quoted half that, $500, and he wants to pay me $300. He said with all the times I have missed work due to college and that this is what it’s worth(even though I get my work done and make sure I’m caught up and even work remotely). At this point, I felt like I couldn’t back out of it, especially being that at the point of this convo there was only 3 days until the wedding. I went to go scope the venue out, and it’s also so far out of the way to the point that I would have charged more. Any advice for how I should go about any situation like this next time, or what I can do now? I kinda goofed letting him take it this far and the only reason I’m not telling anyone to fuck off yet is because I don’t want this to have an effect on the dynamic at work for the rest of the time that I do photography for this dealership.", "link": "https://www.reddit.com/r/photography/comments/mx5xtx/my_boss_just_screwed_me_into_shooting_a_wedding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my boss just screwed me into shooting a wedding for a fraction of what i would have charged, i can’t get out of this now, but how should i go about a situation like this in the future? /!/ so i do automotive photography, and i recently came upon a full time job shooting the listing photography as well as managing and creating marketing material for social media for a high end dealership.  i can’t imagine a better -----> position !!!  at 21 years old getting to drive and shoot exotic cars almost every day. however, my boss, who owns the dealership recently asked me to shoot a wedding. i don’t normally shoot weddings, i don’t prefer shooting weddings, but i have and am more than capable. if someone ask me then sure but i don’t actively go out looking for weddings to shoot. our previous photographer who recently moved into a new profession, was supposed to do it, and he forgot that he was hiring a photographer, as a gift to the heir to the owner of a very well known automotive group in my area for his wedding. so he asks me to do it less than a fucking week in advance. however, i did oblige. i was going to be working on that day, but he said i could have the day off to shoot the wedding, and a week was definitely enough time to go scope out the venue and get to know what the couple wanted. here’s where the problem starts. i get into his office and meet with the couple, and i immediately get the vibe that i’m not gonna be getting paid what i would normally charge for this shoot. he said earlier that he’s just pay me as a bonus in my check, which i was fine with if that made it easier, but this changed the dynamic because this is no longer a contract between op’s photography and him, but part of my work duties. a couple days later, i ask him how much is this bonus going to be, especially because i didn’t want to rent the equipment and rob myself of a profit margin. he asked me how much i needed, i was thinking about charging $1000(i would normally charge a hefty late fee, but said fuck it, it may whatever), but knew he wasn’t even trying to pay half that, so i quoted half that, $500, and he wants to pay me $300. he said with all the times i have missed work due to college and that this is what it’s worth(even though i get my work done and make sure i’m caught up and even work remotely). at this point, i felt like i couldn’t back out of it, especially being that at the point of this convo there was only 3 days until the wedding. i went to go scope the venue out, and it’s also so far out of the way to the point that i would have charged more. any advice for how i should go about any situation like this next time, or what i can do now? i kinda goofed letting him take it this far and the only reason i’m not telling anyone to fuck off yet is because i don’t want this to have an effect on the dynamic at work for the rest of the time that i do photography for this dealership.", "sortedWord": "None", "identifyer": 13324, "year": "2021"}, {"Unnamed: 0": 123099, "autor": "don_cornichon", "date": 1620079807000, "content": "Any semi-comfortable option for taking a (relatively small, mirrorless) camera hiking that does not involve putting it in the backpack? /!/ I'd like to have the camera at hand, relatively ready to shoot, without actually carrying it the whole time. But I also want it to be safe, and out of the way, meaning not impeding my movement.\n\nPutting it in the backpack is out of the question since I take a picture every five minutes or so to document the trail.\n\nI tried a capture clip after having read good things, but I can't find a good position to use it in. [Relevant reddit thread for more details](https://www.reddit.com/r/peakdesign/comments/n48ocf/comfortable_positions_for_a_capture_clip/)\n\nI definitely don't want it dangling from my neck.\n\nAre there any good options or is hiking with a camera just innately uncomfortable and that's just the way it is?", "link": "https://www.reddit.com/r/photography/comments/n48u7w/any_semicomfortable_option_for_taking_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any semi-comfortable option for taking a (relatively small, mirrorless) camera hiking that does not involve putting it in the backpack? /!/ i'd like to have the camera at hand, relatively ready to shoot, without actually carrying it the whole time. but i also want it to be safe, and out of the way, meaning not impeding my movement.\n\nputting it in the backpack is out of the question since i take a picture every five minutes or so to document the trail.\n\ni tried a capture clip after having read good things, but i can't find a good -----> position !!!  to use it in. [relevant reddit thread for more details](https://www.reddit.com/r/peakdesign/comments/n48ocf/comfortable_positions_for_a_capture_clip/)\n\ni definitely don't want it dangling from my neck.\n\nare there any good options or is hiking with a camera just innately uncomfortable and that's just the way it is?", "sortedWord": "None", "identifyer": 13544, "year": "2021"}, {"Unnamed: 0": 123306, "autor": "RolleisAndRollies", "date": 1620866649000, "content": "What's this blemish on my lens? Is it anything to worry about? /!/ I just got this Nikonos V on eBay. The lens is a 35mm and has this soft white blemish at the 3-4 o'clock position on the outer protective layer of the lens. The protective layer isn't removable since the lens is waterproof, and the blemish doesn't rub off from the outside.\n\nWhat is it? Is it fungus, or anything to worry about? I'm going to run a roll of film through it tomorrow and see if it affects the image quality.\n\nThanks in advance! - Rob\n\n&amp;#x200B;\n\n![img](dgi9c2u8asy61)\n\n![video](2wix839xasy61)", "link": "https://www.reddit.com/r/photography/comments/nb4683/whats_this_blemish_on_my_lens_is_it_anything_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what's this blemish on my lens? is it anything to worry about? /!/ i just got this nikonos v on ebay. the lens is a 35mm and has this soft white blemish at the 3-4 o'clock -----> position !!!  on the outer protective layer of the lens. the protective layer isn't removable since the lens is waterproof, and the blemish doesn't rub off from the outside.\n\nwhat is it? is it fungus, or anything to worry about? i'm going to run a roll of film through it tomorrow and see if it affects the image quality.\n\nthanks in advance! - rob\n\n&amp;#x200b;\n\n![img](dgi9c2u8asy61)\n\n![video](2wix839xasy61)", "sortedWord": "None", "identifyer": 13761, "year": "2021"}, {"Unnamed: 0": 123647, "autor": "DanielAviationPhotos", "date": 1622635821000, "content": "Disappointed by the EOS RP file quality /!/ First of all, keep in mind that I shoot aviation photography, both from the ground and from the air. \n\nLet's start with what I've found good about the RP:\n\n * Weight, it's very light  \n * Size, it's small, and with the low weight it makes a good camera for air to air shootings in a small cockpit  \n * Compatibility with EF lenses with an adapter\n\nBut for the cons, oh man i have a lot to say.\n\n * Battery life, it's unbelivable how little the batteries last. I mean I start shooting at 10, shoot like 150 shots and by 16 the camera can't even turn on. And keep in mind, shooting manual, wifi and bluethoot are off and making sure the viewfinder isn't covered when not shooting. Not a lot changes if i turn off the camera when i'm not using it.\n\n * Viewfinder, can't say i like the electronic viewfinder, especially when shooting prop planes and helicopters, i get some strange flickering/artifacts on the props and rotors which sometimes is distracting. Something else that I don't like, but maybe I'm doing something wrong with the settings is the viewfinder freezing on the picture I've just taken for a second instead of showing me what the sensor is seeing through the lens, especially when in continuos shooting. Plus for some reason if i shoot and let go of the shutter button the viewfinder keeps showing the picture i just took \n\n * Exposure, maybe I'm doing something wrong but this camera tends to overexpose A LOT from 1/2 of a stop to sometimes 1 ore more stops, even with the EV meter bang in the center, tried with various EV metering options, still underexposes\n \n * Colors, well, not a lot to say to be honest, but when I'm importing my RAWs on Lightroom my colors are dull and \"dead\" i have to really work with the vibrance and saturation sliders to make the colors look more real\n\n * White balance, shooting raw and importing the photos in LR the white balance and tint are always off by a lot. [https://imgur.com/a/Sv5JgqV](Here you can find a few examples of what I mean in the last 3 points)\n\nKeep in mind that with my 5DMKIII and the same lenses I don't have those problems.\n\n* controls and dials position, not a fan to be honest. Plus 70% of the time the aperture dial doesn't work, still trying to understand why. It's not a lens issue because if I go in the \"Q\" menu and change if from there, it works, same if I mount the lens on my 5DMKIII.\n\nMaybe it's me that I'm doing something wrong, maybe it's the camera that it's not build for this kind of work. I'm a bit sad because I like it at the start but the more i use it, the less I like it. Guess I'll have to bring it back to the shop.  \nAm i the only one with this kind of problems?", "link": "https://www.reddit.com/r/photography/comments/nqkbzw/disappointed_by_the_eos_rp_file_quality/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "disappointed by the eos rp file quality /!/ first of all, keep in mind that i shoot aviation photography, both from the ground and from the air. \n\nlet's start with what i've found good about the rp:\n\n * weight, it's very light  \n * size, it's small, and with the low weight it makes a good camera for air to air shootings in a small cockpit  \n * compatibility with ef lenses with an adapter\n\nbut for the cons, oh man i have a lot to say.\n\n * battery life, it's unbelivable how little the batteries last. i mean i start shooting at 10, shoot like 150 shots and by 16 the camera can't even turn on. and keep in mind, shooting manual, wifi and bluethoot are off and making sure the viewfinder isn't covered when not shooting. not a lot changes if i turn off the camera when i'm not using it.\n\n * viewfinder, can't say i like the electronic viewfinder, especially when shooting prop planes and helicopters, i get some strange flickering/artifacts on the props and rotors which sometimes is distracting. something else that i don't like, but maybe i'm doing something wrong with the settings is the viewfinder freezing on the picture i've just taken for a second instead of showing me what the sensor is seeing through the lens, especially when in continuos shooting. plus for some reason if i shoot and let go of the shutter button the viewfinder keeps showing the picture i just took \n\n * exposure, maybe i'm doing something wrong but this camera tends to overexpose a lot from 1/2 of a stop to sometimes 1 ore more stops, even with the ev meter bang in the center, tried with various ev metering options, still underexposes\n \n * colors, well, not a lot to say to be honest, but when i'm importing my raws on lightroom my colors are dull and \"dead\" i have to really work with the vibrance and saturation sliders to make the colors look more real\n\n * white balance, shooting raw and importing the photos in lr the white balance and tint are always off by a lot. [https://imgur.com/a/sv5jgqv](here you can find a few examples of what i mean in the last 3 points)\n\nkeep in mind that with my 5dmkiii and the same lenses i don't have those problems.\n\n* controls and dials -----> position !!! , not a fan to be honest. plus 70% of the time the aperture dial doesn't work, still trying to understand why. it's not a lens issue because if i go in the \"q\" menu and change if from there, it works, same if i mount the lens on my 5dmkiii.\n\nmaybe it's me that i'm doing something wrong, maybe it's the camera that it's not build for this kind of work. i'm a bit sad because i like it at the start but the more i use it, the less i like it. guess i'll have to bring it back to the shop.  \nam i the only one with this kind of problems?", "sortedWord": "None", "identifyer": 14118, "year": "2021"}, {"Unnamed: 0": 123981, "autor": "Pumpkinskydie", "date": 1624530446000, "content": "Help: Product photography with horses /!/ In four hours I’m driving two and a half hours south of where I live for some product photography on horses. It’s a bandage wrap for animals, and this guy needs pictures of it being used on bigger animals. \n\nI’ve never shot a product on an animal before, so I’m just looking for any tips and advice on what kind of shots to get for this product. I’ve only done one product photography shoot in the past, and that was with “money” as the subject.\n\nI’m looking for advice on types of composition, settings, positions, etc. The environment is going to be outdoors, with only slightly cloudy so I’m expecting some harsh light. We do have an inside facility, a barn, that we could use in that I plan on using.\n\nI have a Canon T5i with the kit lens and a 300 mm lens. I know this technology is out dated, but I’ve been able to push a lot out of it for portraits and landscapes. One thing that really holds me back is definitely the lack of aperture (lowest 5.6f). So any tips and tricks on how to make this work with horses and animals is greatly appreciated!! \n\nThank you \n\nTl:dr - taking pictures of a vet bandage wrap on horses in a field and barn. Just looking for tips and things to look out for.", "link": "https://www.reddit.com/r/photography/comments/o6y5vh/help_product_photography_with_horses/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "help: product photography with horses /!/ in four hours i’m driving two and a half hours south of where i live for some product photography on horses. it’s a bandage wrap for animals, and this guy needs pictures of it being used on bigger animals. \n\ni’ve never shot a product on an animal before, so i’m just looking for any tips and advice on what kind of shots to get for this product. i’ve only done one product photography shoot in the past, and that was with “money” as the subject.\n\ni’m looking for advice on types of composition, settings, -----> positions !!! , etc. the environment is going to be outdoors, with only slightly cloudy so i’m expecting some harsh light. we do have an inside facility, a barn, that we could use in that i plan on using.\n\ni have a canon t5i with the kit lens and a 300 mm lens. i know this technology is out dated, but i’ve been able to push a lot out of it for portraits and landscapes. one thing that really holds me back is definitely the lack of aperture (lowest 5.6f). so any tips and tricks on how to make this work with horses and animals is greatly appreciated!! \n\nthank you \n\ntl:dr - taking pictures of a vet bandage wrap on horses in a field and barn. just looking for tips and things to look out for.", "sortedWord": "None", "identifyer": 14465, "year": "2021"}, {"Unnamed: 0": 124117, "autor": "gordonaf3", "date": 1622858975000, "content": "Advice needed on dealing with a specific type of client.. before I facepalm myself to death /!/ Desperately seeking advice, will do my very best to keep this from becoming a rant \\*fingers crossed\\*\n\nI am a portrait photographer, working in a big city professionally for the last 5-6 years. Most of my jobs/clients are for different types of portrait work. As I'm sure you other photographers working in portraiture know, there are a lot of different styles and looks even within just the portrait field, so of course the first thing I do when a client approaches or hires me is that I try to figure out what they would like to have done so that I can figure out how best to give it to them (or if I'm even the right photographer for the shoot in the first place). But something that can often happen is that the client is very vague about what it is they want, to the point where I honestly only have the slightest clue. \n\nCase in point, a very recent example...\n\nA woman hires me for a portrait shoot, saying she would like photos for her dating site profiles and social media. Under \"additional details\" she puts that she would like a \"fun vibe\".\n\nCondensed version of our conversation: \n\nMe: Hi Client, Thanks for booking a shoot! It looks like you're wanting some photos that are more casual and informal, and not formal/posed type of photos?\n\nHer: Yes, I want it to look classy though\n\nMe: \\[Unsure what the F she means by \"classy\"\\] Ok.. so by classy do you mean something that still clearly looks like it was taken with by a professional photographer, it's definitely not a snapshot or smartphone photo, but it has a casual vibe like being on a date or hanging out with friends?\n\nHer: I would want some photos with a casual vibe and some that look more professional\n\nAt this point I'm still pretty unsure of what this girl wants, she's using very vague language, so I think Ok, I'll put together some mood board examples with images and see what she likes. \n\nSo I put together two folders, one called \"formal\", the other called \"informal\".. in the \"formal\" folder I put shots that are very deliberately composed and where the subject is very clearly posed for the camera; senior portrait, corporate headshots, lifestyle stuff, we all know the look. In the \"informal\" folder I put photos like you would see on a social influencer page, the type you can tell is actually taken by a professional photographer but which is meant to look casual, like sipping an iced coffee with a funny look on their face, tossing their hair as they walk by a carousel or ferris wheel, eating an ice cream cone while laughing and pretending like they want the photo taker to stop taking photos.. we all know those photos too. \n\nSo I send these folders to her and ask her which style she is leaning toward, the more formal type of portrait, or the more informal casual photos, or maybe even a mix of the two? I'm thinking this can at the very least point me in the right direction, like at the eye doctors when they say \"what looks better, A or B? what looks better, 1 or 2?\", like maybe this girl just needs to see what I'm talking about to get an idea of what I mean and what she wants for her photos.\n\nHer response:  \"I would like photos that look professional and natural at the same time.\"\n\nNow I just want to start hitting myself in the head with a hammer.. so much pain, torture, and agony over a g-damn ONE HOUR SHOOT!\n\nIs it just me? Am I trying too hard to please clients? \n\nMy point of view is how am I supposed to give a client what they want if I don't know what they want? \n\nFor instance I know, I KNOWWWWW, from past experience that this girl is going to show up to the shoot and not have any idea what to do, how to stand, where to put her hands, etc., and is going to act like a statue that doesn't move until and unless I give very clear specific instructions, at which point she will perform only that one movement until I issue another a command, the whole time asking me \"what should I do? what do you want me to do?\" while simultaneously I am screaming in my head \"I DON'T KNOW WHAT YOU SHOULD DO BECAUSE I HAVE NO F-ING CLUE WHAT YOU WANT FROM ME\".  \n\nAs a rundown, the full description of what this girl has told me she wants (after much prodding, cajoling, and teeth pulling from me) is photos that are: \"fun\", \"classy\", \"casual but professional\", \"professional but natural\". All extremely broad terms that could mean almost anything.\n\nIn all seriousness what am I supposed to do with that? How would you fellow photogs handle these clients (because while this is the latest, it is by NNOOOO means the only), and/or how do you prevent from getting in this position at all?", "link": "https://www.reddit.com/r/photography/comments/nsl9tw/advice_needed_on_dealing_with_a_specific_type_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice needed on dealing with a specific type of client.. before i facepalm myself to death /!/ desperately seeking advice, will do my very best to keep this from becoming a rant \\*fingers crossed\\*\n\ni am a portrait photographer, working in a big city professionally for the last 5-6 years. most of my jobs/clients are for different types of portrait work. as i'm sure you other photographers working in portraiture know, there are a lot of different styles and looks even within just the portrait field, so of course the first thing i do when a client approaches or hires me is that i try to figure out what they would like to have done so that i can figure out how best to give it to them (or if i'm even the right photographer for the shoot in the first place). but something that can often happen is that the client is very vague about what it is they want, to the point where i honestly only have the slightest clue. \n\ncase in point, a very recent example...\n\na woman hires me for a portrait shoot, saying she would like photos for her dating site profiles and social media. under \"additional details\" she puts that she would like a \"fun vibe\".\n\ncondensed version of our conversation: \n\nme: hi client, thanks for booking a shoot! it looks like you're wanting some photos that are more casual and informal, and not formal/posed type of photos?\n\nher: yes, i want it to look classy though\n\nme: \\[unsure what the f she means by \"classy\"\\] ok.. so by classy do you mean something that still clearly looks like it was taken with by a professional photographer, it's definitely not a snapshot or smartphone photo, but it has a casual vibe like being on a date or hanging out with friends?\n\nher: i would want some photos with a casual vibe and some that look more professional\n\nat this point i'm still pretty unsure of what this girl wants, she's using very vague language, so i think ok, i'll put together some mood board examples with images and see what she likes. \n\nso i put together two folders, one called \"formal\", the other called \"informal\".. in the \"formal\" folder i put shots that are very deliberately composed and where the subject is very clearly posed for the camera; senior portrait, corporate headshots, lifestyle stuff, we all know the look. in the \"informal\" folder i put photos like you would see on a social influencer page, the type you can tell is actually taken by a professional photographer but which is meant to look casual, like sipping an iced coffee with a funny look on their face, tossing their hair as they walk by a carousel or ferris wheel, eating an ice cream cone while laughing and pretending like they want the photo taker to stop taking photos.. we all know those photos too. \n\nso i send these folders to her and ask her which style she is leaning toward, the more formal type of portrait, or the more informal casual photos, or maybe even a mix of the two? i'm thinking this can at the very least point me in the right direction, like at the eye doctors when they say \"what looks better, a or b? what looks better, 1 or 2?\", like maybe this girl just needs to see what i'm talking about to get an idea of what i mean and what she wants for her photos.\n\nher response:  \"i would like photos that look professional and natural at the same time.\"\n\nnow i just want to start hitting myself in the head with a hammer.. so much pain, torture, and agony over a g-damn one hour shoot!\n\nis it just me? am i trying too hard to please clients? \n\nmy point of view is how am i supposed to give a client what they want if i don't know what they want? \n\nfor instance i know, i knowwwww, from past experience that this girl is going to show up to the shoot and not have any idea what to do, how to stand, where to put her hands, etc., and is going to act like a statue that doesn't move until and unless i give very clear specific instructions, at which point she will perform only that one movement until i issue another a command, the whole time asking me \"what should i do? what do you want me to do?\" while simultaneously i am screaming in my head \"i don't know what you should do because i have no f-ing clue what you want from me\".  \n\nas a rundown, the full description of what this girl has told me she wants (after much prodding, cajoling, and teeth pulling from me) is photos that are: \"fun\", \"classy\", \"casual but professional\", \"professional but natural\". all extremely broad terms that could mean almost anything.\n\nin all seriousness what am i supposed to do with that? how would you fellow photogs handle these clients (because while this is the latest, it is by nnoooo means the only), and/or how do you prevent from getting in this -----> position !!!  at all?", "sortedWord": "None", "identifyer": 14605, "year": "2021"}, {"Unnamed: 0": 124211, "autor": "schlop_schlop", "date": 1623449822000, "content": "How to go about taking self portraits? /!/ Not sure if I'm posting in the right place but I've always wanted to take self portraits. Usually when I'm taking photos of my self it's selfies using my phone but the quality is either rubbish or it just looks cheesy. Sometimes it's mirror selfie but these are just getting boring. \n\nMy photography skill isn't the worst when it comes to nature and other people. But I'm really unsure how to go about taking portraits of myself. What tools do I need. What techniques. What software. I'd go as far as ask what settings might be good or positions or how to make it look somewhat interesting (like not just making it obvious to the viewer it's a portrait but rather it's somewhat art). \n\nI do hope I gave enough information I do apologise if What I'm asking is a bit dumb. \n\nAny info or links or videos you know on YouTube literally anything would be very helpful. Personal experience would be even more.\n\n\nI have both a good phone camera (Samsung s21) and DSLR 30x zoom I believe. I don't have a stand at the moment. Computer wise I have a mac book pro 13inch 2017 model. \n\nThank you!", "link": "https://www.reddit.com/r/photography/comments/nxrrrt/how_to_go_about_taking_self_portraits/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "how to go about taking self portraits? /!/ not sure if i'm posting in the right place but i've always wanted to take self portraits. usually when i'm taking photos of my self it's selfies using my phone but the quality is either rubbish or it just looks cheesy. sometimes it's mirror selfie but these are just getting boring. \n\nmy photography skill isn't the worst when it comes to nature and other people. but i'm really unsure how to go about taking portraits of myself. what tools do i need. what techniques. what software. i'd go as far as ask what settings might be good or -----> positions !!!  or how to make it look somewhat interesting (like not just making it obvious to the viewer it's a portrait but rather it's somewhat art). \n\ni do hope i gave enough information i do apologise if what i'm asking is a bit dumb. \n\nany info or links or videos you know on youtube literally anything would be very helpful. personal experience would be even more.\n\n\ni have both a good phone camera (samsung s21) and dslr 30x zoom i believe. i don't have a stand at the moment. computer wise i have a mac book pro 13inch 2017 model. \n\nthank you!", "sortedWord": "None", "identifyer": 14706, "year": "2021"}, {"Unnamed: 0": 124233, "autor": "driver_dylan", "date": 1623425945000, "content": "I could use honest learned advice on what is wrong with my photo CV. /!/ Unfortunately my position as an auto photographer ended at the end of May. This was not through my fault, (the used car market went bad and prices are out of sight so the lot owner decided to close the lot until prices come back down) and I was even given 8 weeks severance to try to hold me over until things get back on track. Unfortunately, I can't take the chance so I am looking for other options. The problem is, although I have lots of applications out there, I never seem to get callbacks for anything. \n\nI have experience with product, wedding, and studio work, and was doing wedding photography before transitioning into auto about four years ago. So I believe my resume isn't the problem, but I am beginning to suspect my sample sheet might be letting me down. I would really appreciate your oppinions on if I'm just being paranoid or is it really that bad. If you are interested in helping a guy out and giving your opinion please privately message me for a link to my Viewbug CV.", "link": "https://www.reddit.com/r/photography/comments/nxiwh6/i_could_use_honest_learned_advice_on_what_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i could use honest learned advice on what is wrong with my photo cv. /!/ unfortunately my -----> position !!!  as an auto photographer ended at the end of may. this was not through my fault, (the used car market went bad and prices are out of sight so the lot owner decided to close the lot until prices come back down) and i was even given 8 weeks severance to try to hold me over until things get back on track. unfortunately, i can't take the chance so i am looking for other options. the problem is, although i have lots of applications out there, i never seem to get callbacks for anything. \n\ni have experience with product, wedding, and studio work, and was doing wedding photography before transitioning into auto about four years ago. so i believe my resume isn't the problem, but i am beginning to suspect my sample sheet might be letting me down. i would really appreciate your oppinions on if i'm just being paranoid or is it really that bad. if you are interested in helping a guy out and giving your opinion please privately message me for a link to my viewbug cv.", "sortedWord": "None", "identifyer": 14728, "year": "2021"}, {"Unnamed: 0": 124455, "autor": "qliwilp", "date": 1625860688000, "content": "How does an aperture operate? The technical motor and sensors and stuff, not f-stops /!/ Sorry if this isn't the right place for this, feel free to point me in a better direction :)\n\n&amp;#x200B;\n\nI've taken apart a Tamron 200-500 to replace the aperture ribbon cable. I know, I know, not advisable, but I got it second hand and the repairs would have cost the same as I bought it for. Also I wanted to have a little fun and learn what's going on in there.\n\nAnyway, I've replaced the cable that was faulty, and put the lens back together - all good! Except now, the aperture motor makes a very unhappy grinding noise - but does still move (Looking through the lens barrel and pressing the DoF preview, you can watch it). I've taken it apart again, and got just the aperture unit on it's own connected to the camera body, to watch the motor moving. Here's what I've noted:\n\n* It closes the aperture no problem - no noises.\n* When it opens it again, it makes the grinding noise.\n* When the motor is disconnected from the aperture gear (so I can see just the barrel of the motor move), I can see it move in both directions. However, when the aperture is set to wide open on the camera (so it shouldn't move the motor at all) it doesn't turn to close the aperture (correct behaviour), but still turns to open it again - despite not having closed it!\n\nI'm pretty sure this is what the grinding noise it - the aperture motor trying to open an already wide open aperture!\n\nThere was another component also attached to the same cable, which I'm guessing is a position sensor, which tells the lens when the aperture is fully open. If that were faulty, it would make sense that it would keep trying to open the aperture right?\n\nAnyway, I was mostly posting this in the vague hope someone has seen something similar, and could confirm that that's what the issue is (or if it's something else - could bad soldering cause these symptoms?). Am I right about a sensor telling the lens when to stop opening the aperture back up? And what would that component be called, to google it.\n\nMany thanks for even reading, and super many thanks if you can help in any way!", "link": "https://www.reddit.com/r/photography/comments/oh3day/how_does_an_aperture_operate_the_technical_motor/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how does an aperture operate? the technical motor and sensors and stuff, not f-stops /!/ sorry if this isn't the right place for this, feel free to point me in a better direction :)\n\n&amp;#x200b;\n\ni've taken apart a tamron 200-500 to replace the aperture ribbon cable. i know, i know, not advisable, but i got it second hand and the repairs would have cost the same as i bought it for. also i wanted to have a little fun and learn what's going on in there.\n\nanyway, i've replaced the cable that was faulty, and put the lens back together - all good! except now, the aperture motor makes a very unhappy grinding noise - but does still move (looking through the lens barrel and pressing the dof preview, you can watch it). i've taken it apart again, and got just the aperture unit on it's own connected to the camera body, to watch the motor moving. here's what i've noted:\n\n* it closes the aperture no problem - no noises.\n* when it opens it again, it makes the grinding noise.\n* when the motor is disconnected from the aperture gear (so i can see just the barrel of the motor move), i can see it move in both directions. however, when the aperture is set to wide open on the camera (so it shouldn't move the motor at all) it doesn't turn to close the aperture (correct behaviour), but still turns to open it again - despite not having closed it!\n\ni'm pretty sure this is what the grinding noise it - the aperture motor trying to open an already wide open aperture!\n\nthere was another component also attached to the same cable, which i'm guessing is a -----> position !!!  sensor, which tells the lens when the aperture is fully open. if that were faulty, it would make sense that it would keep trying to open the aperture right?\n\nanyway, i was mostly posting this in the vague hope someone has seen something similar, and could confirm that that's what the issue is (or if it's something else - could bad soldering cause these symptoms?). am i right about a sensor telling the lens when to stop opening the aperture back up? and what would that component be called, to google it.\n\nmany thanks for even reading, and super many thanks if you can help in any way!", "sortedWord": "None", "identifyer": 14958, "year": "2021"}, {"Unnamed: 0": 125033, "autor": "mojdepsh", "date": 1626771730000, "content": "I started working for a company as a wedding photographer, but they don't want me to keep the photos that I take /!/ I recently got a position at a company where they send me to weddings to shoot. I'm supposed to be using their memory cards and return them at the end of the day. I asked one of the photographers there if it's ok to keep the photos that I take, he said that if I ever do that I'll get fired because it's a privacy thing. I was under the impression that whatever I shoot myself is considered my own intellectual property. I spend the time, provide my own gears, transportation, food, etc but still walk home with zero photos in my card. Does this kinda policy makes sense to a lot of photographers out there? Is this something you'd see often?", "link": "https://www.reddit.com/r/photography/comments/onyde0/i_started_working_for_a_company_as_a_wedding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i started working for a company as a wedding photographer, but they don't want me to keep the photos that i take /!/ i recently got a -----> position !!!  at a company where they send me to weddings to shoot. i'm supposed to be using their memory cards and return them at the end of the day. i asked one of the photographers there if it's ok to keep the photos that i take, he said that if i ever do that i'll get fired because it's a privacy thing. i was under the impression that whatever i shoot myself is considered my own intellectual property. i spend the time, provide my own gears, transportation, food, etc but still walk home with zero photos in my card. does this kinda policy makes sense to a lot of photographers out there? is this something you'd see often?", "sortedWord": "None", "identifyer": 15566, "year": "2021"}, {"Unnamed: 0": 125087, "autor": "AislinnNoir", "date": 1627155487000, "content": "Normal for pro photographer to not discuss pricing until after the shoot? /!/ Hello! \n\nI’m new when it comes to photography. I did a fashion shoot as a model with a pro photographer a few months ago and have been thinking about asking if this is the standard or not, since I really don’t know. \n\nI was told about the photographer from a friend of mine who shot with him and his work looked nice. I paid the photographer for the shoot, he had someone there to do hair and makeup at his studio. The shoot was very fun! Payment for the photos never came up. \n\nI then had to book a follow up appointment where me and the photographer would review the photos and then I’d know the price of everything. It was extremely awkward to pick the photos I wanted and then see the prices after everything. I ended up having to spend over $1500 for the photos, which is not something I was expecting or could really afford. My friend who shot with him previously is very well off, so this explains why she didn’t think it was a big deal. Since I had to go back to the studio to even see the photos, it would have been awkward to refuse and I felt like I was put into a position to buy them or else I’d wasted everyone’s time. \n\nI have not done any more shoots since, because if that’s the usual price, I really can’t afford it. But I also figured pricing would come up way before I was sitting in the review chair? \n\nPlease let me know if I’m totally in the wrong here. I had never modeled before.", "link": "https://www.reddit.com/r/photography/comments/oqwoh2/normal_for_pro_photographer_to_not_discuss/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "normal for pro photographer to not discuss pricing until after the shoot? /!/ hello! \n\ni’m new when it comes to photography. i did a fashion shoot as a model with a pro photographer a few months ago and have been thinking about asking if this is the standard or not, since i really don’t know. \n\ni was told about the photographer from a friend of mine who shot with him and his work looked nice. i paid the photographer for the shoot, he had someone there to do hair and makeup at his studio. the shoot was very fun! payment for the photos never came up. \n\ni then had to book a follow up appointment where me and the photographer would review the photos and then i’d know the price of everything. it was extremely awkward to pick the photos i wanted and then see the prices after everything. i ended up having to spend over $1500 for the photos, which is not something i was expecting or could really afford. my friend who shot with him previously is very well off, so this explains why she didn’t think it was a big deal. since i had to go back to the studio to even see the photos, it would have been awkward to refuse and i felt like i was put into a -----> position !!!  to buy them or else i’d wasted everyone’s time. \n\ni have not done any more shoots since, because if that’s the usual price, i really can’t afford it. but i also figured pricing would come up way before i was sitting in the review chair? \n\nplease let me know if i’m totally in the wrong here. i had never modeled before.", "sortedWord": "None", "identifyer": 15621, "year": "2021"}, {"Unnamed: 0": 125528, "autor": "DeaderThanDead", "date": 1628436613000, "content": "How do you install a Focus Wrench? /!/ My new manual lens came with a Focus Wrench. I have never seen these and cannot find instructions on how to properly install and use it. Does the lens need to be in a specific position before attaching it? How do you properly utilize it? I have searched Google and YouTube and can only come to the conclusion that either I’m an idiot or not many people use these. Any help would be appreciated.", "link": "https://www.reddit.com/r/photography/comments/p0gqak/how_do_you_install_a_focus_wrench/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do you install a focus wrench? /!/ my new manual lens came with a focus wrench. i have never seen these and cannot find instructions on how to properly install and use it. does the lens need to be in a specific -----> position !!!  before attaching it? how do you properly utilize it? i have searched google and youtube and can only come to the conclusion that either i’m an idiot or not many people use these. any help would be appreciated.", "sortedWord": "None", "identifyer": 16090, "year": "2021"}, {"Unnamed: 0": 125583, "autor": "Lagideath2", "date": 1628706085000, "content": "Fujifilm X-T20 screen becomes grey (not the interface though) /!/ I'm having an issue with the screen of my Fujifilm X-T20.\n\nWhen I'm holding the camera at certain angles or press lightly on the screen (Only when it is in its standard position. When I unfold the screen it seems to work normally) the screen becomes grey and sometimes displays static. The UI elements are not affected for some reason, only the displayed image that the lense captures. \n\nIf I take a picture while the screen is grey, the resulting image will not have the grey effect so I don't believe the sensor is the issue. Even lightly pressing down the button that takes the picture (which would usually auto-focus but my lense is manual) makes the static always disappear.\n\nI have a video for some reference, though I couldn't show everything I mentioned since holding the camera and my phone at the same time proved to be rather difficult.\n\nhttp://imgur.com/a/5JDFxGo\n\nI have no idea at all what could be the problem since it's behaving so weirdly with the mentioned exceptions like holding down the shoot button.", "link": "https://www.reddit.com/r/photography/comments/p2iuy3/fujifilm_xt20_screen_becomes_grey_not_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fujifilm x-t20 screen becomes grey (not the interface though) /!/ i'm having an issue with the screen of my fujifilm x-t20.\n\nwhen i'm holding the camera at certain angles or press lightly on the screen (only when it is in its standard -----> position !!! . when i unfold the screen it seems to work normally) the screen becomes grey and sometimes displays static. the ui elements are not affected for some reason, only the displayed image that the lense captures. \n\nif i take a picture while the screen is grey, the resulting image will not have the grey effect so i don't believe the sensor is the issue. even lightly pressing down the button that takes the picture (which would usually auto-focus but my lense is manual) makes the static always disappear.\n\ni have a video for some reference, though i couldn't show everything i mentioned since holding the camera and my phone at the same time proved to be rather difficult.\n\nhttp://imgur.com/a/5jdfxgo\n\ni have no idea at all what could be the problem since it's behaving so weirdly with the mentioned exceptions like holding down the shoot button.", "sortedWord": "None", "identifyer": 16146, "year": "2021"}, {"Unnamed: 0": 125795, "autor": "GoblinGreen_", "date": 1630702489000, "content": "Automated product photography at multiple angles /!/ Hi all,\n\nI'm looking at doing some stop motion style photography of me painting models. Example here. \n\nhttps://vm.tiktok.com/ZMRDo65KJ/\n\nSo currently I paint, put the model in position, take a pic, then continue. What would be cool though is getting more angles. So I place the model, press a button and I can take a photo, something rotates the model 90degrees, takes another photo, another 90 degrees, another photo. That kind of thing. \nI have no idea though what to even search to start looking into this kind of setup. Does anyone in here have any info of where I should start looking into a setup for something like this?", "link": "https://www.reddit.com/r/photography/comments/phdnwx/automated_product_photography_at_multiple_angles/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "automated product photography at multiple angles /!/ hi all,\n\ni'm looking at doing some stop motion style photography of me painting models. example here. \n\nhttps://vm.tiktok.com/zmrdo65kj/\n\nso currently i paint, put the model in -----> position !!! , take a pic, then continue. what would be cool though is getting more angles. so i place the model, press a button and i can take a photo, something rotates the model 90degrees, takes another photo, another 90 degrees, another photo. that kind of thing. \ni have no idea though what to even search to start looking into this kind of setup. does anyone in here have any info of where i should start looking into a setup for something like this?", "sortedWord": "None", "identifyer": 16374, "year": "2021"}, {"Unnamed: 0": 125891, "autor": "sweatersb4pants", "date": 1631295008000, "content": "New photographer here! [Advice] /!/ Hey!\n\nI am starting a photography business, on the side, &amp; I want any &amp; all advice! I've loved taking pictures my whole life &amp; have often been told I have a decent eye (but from people who are just ROUGH with taking pictures) but I've felt I do maybe have some natural ability.\nI'm not in a position to quit my day job &amp; pursue photography full time but I do love doing it &amp; would love to improve to provide my clients with the best I can do!With that being said:\nANY ADVICE???? I love taking pictures but unfortunately not super tech savvy which I know sounds like maybe I should choose something else but I know I can learn it! Just make take a little longer than some!\nSo what would you suggest for providing the best service possible????", "link": "https://www.reddit.com/r/photography/comments/plpn09/new_photographer_here_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new photographer here! [advice] /!/ hey!\n\ni am starting a photography business, on the side, &amp; i want any &amp; all advice! i've loved taking pictures my whole life &amp; have often been told i have a decent eye (but from people who are just rough with taking pictures) but i've felt i do maybe have some natural ability.\ni'm not in a -----> position !!!  to quit my day job &amp; pursue photography full time but i do love doing it &amp; would love to improve to provide my clients with the best i can do!with that being said:\nany advice???? i love taking pictures but unfortunately not super tech savvy which i know sounds like maybe i should choose something else but i know i can learn it! just make take a little longer than some!\nso what would you suggest for providing the best service possible????", "sortedWord": "None", "identifyer": 16473, "year": "2021"}, {"Unnamed: 0": 125988, "autor": "tiktoktic", "date": 1631067775000, "content": "Photos and GPX tracks - interactive viewer? /!/ I’m not sure if something exists (I suspect it doesn’t from my searching). I’m looking for something similar to Relive, but interactive. \n\nEssentially, I have years of geotagged photos, and GPX tracks from vacations. I’d love to be able to see my position through a day from the track, see where I walked and photos along on the map from that day.\n\nI’ve tried the various self-hosted photography apps - looooove Photoprism, and was quite fond of PiGallery2. Whilst they both let you see the GPS tracks on a map, you can’t walk your way through them like a timeline.\n\nAny suggestions?", "link": "https://www.reddit.com/r/photography/comments/pk1jxa/photos_and_gpx_tracks_interactive_viewer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photos and gpx tracks - interactive viewer? /!/ i’m not sure if something exists (i suspect it doesn’t from my searching). i’m looking for something similar to relive, but interactive. \n\nessentially, i have years of geotagged photos, and gpx tracks from vacations. i’d love to be able to see my -----> position !!!  through a day from the track, see where i walked and photos along on the map from that day.\n\ni’ve tried the various self-hosted photography apps - looooove photoprism, and was quite fond of pigallery2. whilst they both let you see the gps tracks on a map, you can’t walk your way through them like a timeline.\n\nany suggestions?", "sortedWord": "None", "identifyer": 16573, "year": "2021"}, {"Unnamed: 0": 125998, "autor": "ph_maneiro", "date": 1631838300000, "content": "Old sony camera with problems, can't afford a new one. /!/ So, photography has been my hobby for the past year or two, and its something that i truly enjoy. Unfortunately, i'm not able to afford a good camera + lenses, its just too expensive in my coutry (i live in brazil, where the taxes to import a camera it's 60% over the product's value, so its not only expensive by itself, tax doesn't help a lot.\n\nI've been using a Sony DSC-H2, that i found at my appartment and its only 4 years younger than me. Its by far not a professional camera, but makes the photography experience much more fun. I don't need lenses, don't need expensive batteries and it suits me very well.\n\nBut recently, it has shown some issues with the opticals motor. (i understand, its an old camera and a probably overcomplicated mechanism) When you turn it on, the lenses 'come out' to shooting position, and when you turn it off, the lenses retract to their usual position. Or at least that's how it should work. But mine, after working 100% fine for a while, when i turn it on, the lenses come out and 'adjust' its position (it didn't use to do it before) and when i turn it off, the lenses retract and come out fully 3x before shutting off completely.\n\nThe camera in itself its working fine, i'm able to take pictures and zoom in and out without problems, but i fear those unecessary movements can be a indicative of future problems.\n\nAny idea on what that can possibly mean and how to avoid future problems?\n\n(im sorry for my grammar, english is not my first language)", "link": "https://www.reddit.com/r/photography/comments/pppjca/old_sony_camera_with_problems_cant_afford_a_new/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "old sony camera with problems, can't afford a new one. /!/ so, photography has been my hobby for the past year or two, and its something that i truly enjoy. unfortunately, i'm not able to afford a good camera + lenses, its just too expensive in my coutry (i live in brazil, where the taxes to import a camera it's 60% over the product's value, so its not only expensive by itself, tax doesn't help a lot.\n\ni've been using a sony dsc-h2, that i found at my appartment and its only 4 years younger than me. its by far not a professional camera, but makes the photography experience much more fun. i don't need lenses, don't need expensive batteries and it suits me very well.\n\nbut recently, it has shown some issues with the opticals motor. (i understand, its an old camera and a probably overcomplicated mechanism) when you turn it on, the lenses 'come out' to shooting -----> position !!! , and when you turn it off, the lenses retract to their usual -----> position !!! . or at least that's how it should work. but mine, after working 100% fine for a while, when i turn it on, the lenses come out and 'adjust' its position (it didn't use to do it before) and when i turn it off, the lenses retract and come out fully 3x before shutting off completely.\n\nthe camera in itself its working fine, i'm able to take pictures and zoom in and out without problems, but i fear those unecessary movements can be a indicative of future problems.\n\nany idea on what that can possibly mean and how to avoid future problems?\n\n(im sorry for my grammar, english is not my first language)", "sortedWord": "None", "identifyer": 16583, "year": "2021"}, {"Unnamed: 0": 126346, "autor": "HammyHavoc", "date": 1632533889000, "content": "Lightroom, Darktable, Digikam, or something else? /!/ Hi all,\n\nMy photo library is a mess, consisting of many external drives, JBODs, several obsoleted NAS, different computers, cloud services et al. Thus I'll be redoing my catalogue(s) from scratch.\n\nI am planning to consolidate it all down to my new server running Unraid, so I can spin up Docker containers, or simply store files on it. Already have Nextcloud installed on it (for whatever that's worth), but that's not what I'm here.\n\nI'm able to use any piece of software available, but somewhat spoiled for choice.\n\nI'm looking at Lightroom, Darktable, and Digikam, but I am most definitely open to other options if people recommend them.\n\nIdeally, the software would be OS-agnostic, or the catalogue files, folder structure would lend itself well to interoperability with other software on other OS. I definitely don't want to use the cloud for storage, and I definitely want to use my server.\n\nSupporting several users concurrently would be a plus-point so that the missus can edit and tweak both my photos and hers.\n\nDoes anybody have any recommendations from having been in a similar position? Any organizational tips?", "link": "https://www.reddit.com/r/photography/comments/pux1ay/lightroom_darktable_digikam_or_something_else/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lightroom, darktable, digikam, or something else? /!/ hi all,\n\nmy photo library is a mess, consisting of many external drives, jbods, several obsoleted nas, different computers, cloud services et al. thus i'll be redoing my catalogue(s) from scratch.\n\ni am planning to consolidate it all down to my new server running unraid, so i can spin up docker containers, or simply store files on it. already have nextcloud installed on it (for whatever that's worth), but that's not what i'm here.\n\ni'm able to use any piece of software available, but somewhat spoiled for choice.\n\ni'm looking at lightroom, darktable, and digikam, but i am most definitely open to other options if people recommend them.\n\nideally, the software would be os-agnostic, or the catalogue files, folder structure would lend itself well to interoperability with other software on other os. i definitely don't want to use the cloud for storage, and i definitely want to use my server.\n\nsupporting several users concurrently would be a plus-point so that the missus can edit and tweak both my photos and hers.\n\ndoes anybody have any recommendations from having been in a similar -----> position !!! ? any organizational tips?", "sortedWord": "None", "identifyer": 16945, "year": "2021"}, {"Unnamed: 0": 126931, "autor": "photothingz", "date": 1629164034000, "content": "I have an interview for a retail photographer position tomorrow and I need advice. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/p5tyrj/i_have_an_interview_for_a_retail_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have an interview for a retail photographer -----> position !!!  tomorrow and i need advice. /!/ [removed]", "sortedWord": "None", "identifyer": 17566, "year": "2021"}, {"Unnamed: 0": 126979, "autor": "roberole", "date": 1629115758000, "content": "Photography and mental health /!/ I have a friend that works as a freelance photographer. His work really is something **special**. His creativity, project management and pure desire to get the best out of everything he does is honestly truly **inspiring**.\n\nYet, no one cares. **No one**. I’ve watched him over the last 10 years push and claw his way up, fighting for every job he can get and **struggling** mentally with the constant rejection he receives. He loves photography, it really is a passion for him. Yet most days I see photographers that really shouldn't be in the positions they are in occupying the roles he should have.\n\nI work as a creative designer and am also the studio lead for my workplace. I give him as much work as possible and every time he does an excellent job. For his level of experience and output he should be one of the most sought after photographers in the country, his portfolio of work speaks for itself.\n\n**So from the many talented professionals in this sub, what can be done?** How can I help him better get noticed and secure work. What can he do differently? He applies for studio jobs, he creates so much work for free to help get noticed and he's constantly contacting people.\n\nI fear a good friend of mine is sinking so much that he may just give up one day and I don't want to lose him.", "link": "https://www.reddit.com/r/photography/comments/p5ersz/photography_and_mental_health/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "photography and mental health /!/ i have a friend that works as a freelance photographer. his work really is something **special**. his creativity, project management and pure desire to get the best out of everything he does is honestly truly **inspiring**.\n\nyet, no one cares. **no one**. i’ve watched him over the last 10 years push and claw his way up, fighting for every job he can get and **struggling** mentally with the constant rejection he receives. he loves photography, it really is a passion for him. yet most days i see photographers that really shouldn't be in the -----> positions !!!  they are in occupying the roles he should have.\n\ni work as a creative designer and am also the studio lead for my workplace. i give him as much work as possible and every time he does an excellent job. for his level of experience and output he should be one of the most sought after photographers in the country, his portfolio of work speaks for itself.\n\n**so from the many talented professionals in this sub, what can be done?** how can i help him better get noticed and secure work. what can he do differently? he applies for studio jobs, he creates so much work for free to help get noticed and he's constantly contacting people.\n\ni fear a good friend of mine is sinking so much that he may just give up one day and i don't want to lose him.", "sortedWord": "None", "identifyer": 17616, "year": "2021"}, {"Unnamed: 0": 127587, "autor": "FightingMeerkat", "date": 1610082678000, "content": "Best camera/system for hardcore outdoor work? /!/ I’m working in a position this summer where i’ll be out on the water a lot and in very bad conditions (small boat SAR). I’d like to upgrade my current kit to be the best it could be for the situation. \n\nMy current kit is:\n- Canon 5D II\n- Canon 7D\n- Canon 24-70 2.8\n- Canon 70-200 4\n\nI need something that is as tough as possible, and will be able to stand up to any conditions I might encounter. Battery life is also very important since we’ll be on the water for long periods at a time. Price is (nearly) no object, since I will most likely be able to write most of it off as an expense.\n\nAny suggestions?", "link": "https://www.reddit.com/r/photography/comments/ksvruc/best_camerasystem_for_hardcore_outdoor_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best camera/system for hardcore outdoor work? /!/ i’m working in a -----> position !!!  this summer where i’ll be out on the water a lot and in very bad conditions (small boat sar). i’d like to upgrade my current kit to be the best it could be for the situation. \n\nmy current kit is:\n- canon 5d ii\n- canon 7d\n- canon 24-70 2.8\n- canon 70-200 4\n\ni need something that is as tough as possible, and will be able to stand up to any conditions i might encounter. battery life is also very important since we’ll be on the water for long periods at a time. price is (nearly) no object, since i will most likely be able to write most of it off as an expense.\n\nany suggestions?", "sortedWord": "None", "identifyer": 18246, "year": "2021"}, {"Unnamed: 0": 127703, "autor": "FLDJF713", "date": 1635183515000, "content": "Advice on how to build relationship with a huge client. (Motorsports photography) /!/ I’ve been freelancing for motorsports photography for five years now and generally, I’ll do alright at a race. A few smaller teams and maybe one or two large teams will buy my photos. \n\nRecently I was hired by a team for a pilot project idea to shoot only their team at a race and it went super well and they were happy. They also agreed to my day rates with no questions asked. \n\nI’m about to invoice them and here’s my question for you all, especially if you happen to work with really large brands or motorsports teams;\n\nI want to keep this project going forward and show it’s effective at other tracks. My pitch to their creative head would be to invoice at a 75% reduced rate in exchange for a written, signed contract for a few races next season with a regular day rate and further mutual planning of this project. Because they deemed it very successful, my argument is to continue it with me specifically to further flesh out ideas and content in the same style, tone. \n\nIm luckily to be a in a position where I get paid extremely well at my desk job and use my photography income only to cover expenses, new gear, etc. \n\nMy concern with this approach is that it may come off the wrong way. But the invoice and talks are with the team’s sole decision maker for content, so it would be a direct yes or no from him. \n\nWhat are your thoughts, especially critical ones?", "link": "https://www.reddit.com/r/photography/comments/qfm0wk/advice_on_how_to_build_relationship_with_a_huge/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice on how to build relationship with a huge client. (motorsports photography) /!/ i’ve been freelancing for motorsports photography for five years now and generally, i’ll do alright at a race. a few smaller teams and maybe one or two large teams will buy my photos. \n\nrecently i was hired by a team for a pilot project idea to shoot only their team at a race and it went super well and they were happy. they also agreed to my day rates with no questions asked. \n\ni’m about to invoice them and here’s my question for you all, especially if you happen to work with really large brands or motorsports teams;\n\ni want to keep this project going forward and show it’s effective at other tracks. my pitch to their creative head would be to invoice at a 75% reduced rate in exchange for a written, signed contract for a few races next season with a regular day rate and further mutual planning of this project. because they deemed it very successful, my argument is to continue it with me specifically to further flesh out ideas and content in the same style, tone. \n\nim luckily to be a in a -----> position !!!  where i get paid extremely well at my desk job and use my photography income only to cover expenses, new gear, etc. \n\nmy concern with this approach is that it may come off the wrong way. but the invoice and talks are with the team’s sole decision maker for content, so it would be a direct yes or no from him. \n\nwhat are your thoughts, especially critical ones?", "sortedWord": "None", "identifyer": 18365, "year": "2021"}, {"Unnamed: 0": 128020, "autor": "Electronic_AK", "date": 1624448430000, "content": "3D printed clock that uses the suns position to display the time", "link": "https://www.reddit.com/r/photography/comments/o6b2h8/3d_printed_clock_that_uses_the_suns_position_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "3d printed clock that uses the suns -----> position !!!  to display the time", "sortedWord": "None", "identifyer": 18701, "year": "2021"}, {"Unnamed: 0": 128239, "autor": "Revolutionary_Town21", "date": 1633332153000, "content": "Help me with camera /!/ Hey guys. I have been saving up for sometime for a camera. Until now, I used my phone, however I am am now in a position to finally upgrade. \nI'm confused which one to buy, DSLR or mirror less. It's also important to inform that I am not professional, just like to take pics as a hobby. \nMy budget is around 70k-80k INR. Would greatly appreciate all suggestions.", "link": "https://www.reddit.com/r/photography/comments/q10lpi/help_me_with_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help me with camera /!/ hey guys. i have been saving up for sometime for a camera. until now, i used my phone, however i am am now in a -----> position !!!  to finally upgrade. \ni'm confused which one to buy, dslr or mirror less. it's also important to inform that i am not professional, just like to take pics as a hobby. \nmy budget is around 70k-80k inr. would greatly appreciate all suggestions.", "sortedWord": "None", "identifyer": 18931, "year": "2021"}], "name": "positionphotography2021"}