{"interestingcomments": [{"Unnamed: 0": 265515, "autor": "laughingfuzz1138", "date": 1521005345000, "content": "Learning from crap \"pros\" in your area. /!/ I think we all have a bit of fun mocking \"pro\" photographers who don't have the skills to back it up. Joe-schmo with a camera and a decent website, but without the skills or portfolio to back it up, but what can we learn from them?\n\nI've had a couple lessons. The first came when I was looking for a wedding photographer. At the time, I didn't think I was good enough to ask people to pay me, but finding the quality of photographer that is able to command decent money for his services convinced me that I was definitely qualified. Additionally, one in particular showed me what happens when you don't consider the fair complection of your subjects when thinking about lighting and color treatment- lots of little kids looking like drowning victims.\n\nAnother was a recent complaint from a friend. She was really looking forward to her daughter's middle-school cheerleading pictures. Turns out, the whole team was seated, and directly facing the camera, in short cheerleading skirts. While photographing a large group of kids is definitely easiest if you have chairs already positioned and just need to tell them to sit down, a picture of her daughter flashing her lolly at the camera isn't something she wants to hang above the mantelpiece. It's not inappropriate- they're all wearing lollies under their skirts specifically because of the risk of this sort of thing during the course of their athletics- it's still enough to make the picture ill-suited to the purpose she had in mind. It's not just about getting a *good* picture, it also needs to fit the use the client has in mind for it.\n\nWhat lessons have you learned from the mistakes of professionals in your area, or that you have intersected with?", "link": "https://www.reddit.com/r/photography/comments/84aznw/learning_from_crap_pros_in_your_area/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "learning from crap \"pros\" in your area. /!/ i think we all have a bit of fun mocking \"pro\" photographers who don't have the skills to back it up. joe-schmo with a camera and a decent website, but without the skills or portfolio to back it up, but what can we learn from them?\n\ni've had a couple lessons. the first came when i was looking for a wedding photographer. at the time, i didn't think i was good enough to ask people to pay me, but finding the quality of photographer that is able to command decent money for his services convinced me that i was definitely qualified. additionally, one in particular showed me what happens when you don't consider the fair complection of your subjects when thinking about lighting and color treatment- lots of little kids looking like drowning victims.\n\nanother was a recent complaint from a friend. she was really looking forward to her daughter's middle-school cheerleading pictures. turns out, the whole team was seated, and directly facing the camera, in short cheerleading skirts. while photographing a large group of kids is definitely easiest if you have chairs already -----> positioned !!!  and just need to tell them to sit down, a picture of her daughter flashing her lolly at the camera isn't something she wants to hang above the mantelpiece. it's not inappropriate- they're all wearing lollies under their skirts specifically because of the risk of this sort of thing during the course of their athletics- it's still enough to make the picture ill-suited to the purpose she had in mind. it's not just about getting a *good* picture, it also needs to fit the use the client has in mind for it.\n\nwhat lessons have you learned from the mistakes of professionals in your area, or that you have intersected with?", "sortedWord": "None", "identifyer": 11115, "year": "2018"}, {"Unnamed: 0": 265667, "autor": "altjx", "date": 1527217043000, "content": "Looking at portrait pics taken in Playback Mode on the Canon 5D Mark IV while the camera is still in portrait position", "link": "https://www.reddit.com/r/photography/comments/8lyi49/looking_at_portrait_pics_taken_in_playback_mode/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking at portrait pics taken in playback mode on the canon 5d mark iv while the camera is still in portrait -----> position !!! ", "sortedWord": "None", "identifyer": 11272, "year": "2018"}, {"Unnamed: 0": 266287, "autor": "puppy_consumption", "date": 1516219113000, "content": "How do you find inspiration or creativity to shoot during your mundane day to day activities? /!/ I work full-time in a marketing/photography position, take care of a house, my kid, and other adult responsibilities. It seems the opportunities to fill my \"creative well\" and push myself photographically are few and far in between.\n\nI especially get frustrated as I scroll through Instagram, seeing these amazing travel photos and wondering how and when people fit time in.\n\nI try and shoot daily, even if it's just on my phone, photos of my commute, or my son. But ultimately I end up deleting all of them. It seems as if it has been years that I've really worked on a project that has brought me passion and joy.\n\nDoes anyone have any advice or has worked through this?", "link": "https://www.reddit.com/r/photography/comments/7r3rnd/how_do_you_find_inspiration_or_creativity_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do you find inspiration or creativity to shoot during your mundane day to day activities? /!/ i work full-time in a marketing/photography -----> position !!! , take care of a house, my kid, and other adult responsibilities. it seems the opportunities to fill my \"creative well\" and push myself photographically are few and far in between.\n\ni especially get frustrated as i scroll through instagram, seeing these amazing travel photos and wondering how and when people fit time in.\n\ni try and shoot daily, even if it's just on my phone, photos of my commute, or my son. but ultimately i end up deleting all of them. it seems as if it has been years that i've really worked on a project that has brought me passion and joy.\n\ndoes anyone have any advice or has worked through this?", "sortedWord": "None", "identifyer": 11915, "year": "2018"}, {"Unnamed: 0": 266630, "autor": "cryptodesign", "date": 1522426060000, "content": "10 Tips To Bring Your Landscape Photography To The Next Level /!/ Albert Dros here again, professional landscape photographer from the Netherlands. I like to write short useful articles and I just came up with this one. This may all sound quite basic but I feel like I need to point this out because I see so much of the same stuff online. I want to encourage people to be creative, even if it’s just for the sake of trying something new or different. \n\nThis article is both for beginners and advanced landscape photographers. I figured I’d list some tips to hopefully give you some inspiration and give you some new options to try out in your landscape photography. With the era of social media I notice a lot of people just copy photos they see on Facebook or Instagram. This happens to me a lot. I always try to be creative and find ‘new’ angles myself. For some people getting creative comes naturally, but others will need a bit of a push. This article will hopefully help :) Here are 10 tips that will hopefully be helpful to get that bit of extra in your shots.\n\n1) Most landscape photos are shot with wide lenses. I love wide lenses myself, but try a telezoom once and experiment with long focal lengths of 100-300+. Try photographing patterns or small details in landscapes. Or try it in the mountains on mountain tops. Once you get the hang of it, you’ll notice a whole new world of landscape photography opens. Seriously, try it.\n\n[Green Hills close up at 300mm](https://i.imgur.com/Tsjk3v5.jpg)\n\n2) Play with motion. Clouds move, water moves. Try to create dynamics in your frame by the use of moving water or clouds. You can do this by using long or short shutter speeds. You can make use of filters to create longer exposures, or create drama with very short exposures. Always experiment with different lengths of exposure with both clouds and water.\n\n[Short exposure to capture drama](https://i.imgur.com/cNqqXYl.jpg)\n\n[Long exposure of the same scene with a different composition to create a totally different mood](https://i.imgur.com/yOh6pLL.jpg)\n\n3) Experiment with a CPL filter. I have done landscape photography without a CPL filter for years. But once you have one, you start to see why it can be so useful in different cases. It can be especially useful to control the amount of sunlight and reflection on reflective surfaces. You simply can’t do this in post production.\n\n[Example of Rotating CPL effect on reflective surface](https://media.giphy.com/media/1o1u6VbxA54uBMCMlc/giphy.gif)\n\n4) When photographing with longer lenses use layers and compression. Landscapes look totally different with long lenses and you can compress foreground and background objects to give a lot of depth in your photo. \n\n[Compressed Road shot at 135mm](https://i.imgur.com/vrRBVGd.jpg)\n\n[Including a person with a long lens shot at 200mm](https://i.imgur.com/OZYvTbU.jpg)\n\n5) Use light to your advantage. Light always changes especially during sunsets and sunrises. Look for details here and isolated objects by light. This happens a lot in the mountains where clouds and light play around peaks go on during the whole day. \n\n[First Morning Light hitting a mountain peak](https://i.imgur.com/yI0maQn.jpg)\n\n6) When shooting with wide angles, get very close to objects to create a lot of depth in your photo. With ‘very close’ I mean VERY close. So close that your lens almost touches the foreground object. This can be a flower, a plant, or anything. You can use focus stacking to get everything in focus, or choose to pick a very wide open aperture to get the foreground completely out of focus/blurry. Both choices offer different looks and can both be used in nice ways.\n\n[Getting very low and close with Out of Focus foreground](https://i.imgur.com/xZQ3bLL.jpg)\n\n[Getting very low with focus stacking](https://i.imgur.com/cq7euyj.jpg)\n\n7) Make use of sunstars in your composition. When shooting directly in to the sun and closing down your aperture to f/16-f/22 you will see that your lens will create a sunstar. Different lenses have different characteristics. Some lenses create beautiful sunstars and you may want to make use of them. Position the sun against an edge, like the horizon or just an object in the frame. By positioning it slightly against an edge, the sunstars will look best. Try and experiment!\n\n[f/22 sunstar with the sun peaking just over the treeline](https://i.imgur.com/T3fxCrA.jpg)\n\n[Sun just touching the edge of an object to create a sunstar](https://i.imgur.com/tb42rPC.jpg)\n\n8) Learn how to shoot with extreme wide angle lenses and fisheye lenses. By extreme wide I mean wider than 14mm (full frame equivalent). Photographing at 10-12mm or wider with fisheye lenses give you a whole new perspective to a landscape. It opens up lots of (creative) possibilities. Learn the ‘defish’ technique also that makes it possible to create an undistorted shot out of a fisheye shot (not going to describe the technique here, but can be found online. I also have a Youtube tutorial about it). This can be extremely useful for photographing very wide landscapes.\n\n[Vertigo shot with 180 degree fisheye and corrupted with lens profile](https://i.imgur.com/TXya83Y.jpg)\n\n\n[Wide scene shot with 12mm fisheye 180 degrees, corrected so no distortion appears](https://i.imgur.com/Uzi8Pjr.jpg)\n\n9) Don’t always immediately take your camera out and look for potential frames. Walk around in nature and use your eyes. Try to visualise how things would look through your camera. I also often use my smartphone, which has an around 20mm field of view. Simply to check framing.\n\n[random spot I found next to the road](https://i.imgur.com/yskqooz.jpg)\n\n10) Last, this may sound very obvious but it’s important to train your eye nonstop. Look around you everywhere and try to see potential compositions in every day life. This may sounds hard and being a landscape photographer can be very tiring because of the nonstop possibilities nature offers. You train your eye by using a wide array of lenses so that you know how things will look through an extreme zoom lens, or how things would look with an extreme wide angle.\n\n[Cold Morning, Just looking around](https://i.imgur.com/DdeHidC.jpg)\n\n\nHope these were useful. Feel free to ask me anything in here!\n\n", "link": "https://www.reddit.com/r/photography/comments/88bguy/10_tips_to_bring_your_landscape_photography_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "10 tips to bring your landscape photography to the next level /!/ albert dros here again, professional landscape photographer from the netherlands. i like to write short useful articles and i just came up with this one. this may all sound quite basic but i feel like i need to point this out because i see so much of the same stuff online. i want to encourage people to be creative, even if it’s just for the sake of trying something new or different. \n\nthis article is both for beginners and advanced landscape photographers. i figured i’d list some tips to hopefully give you some inspiration and give you some new options to try out in your landscape photography. with the era of social media i notice a lot of people just copy photos they see on facebook or instagram. this happens to me a lot. i always try to be creative and find ‘new’ angles myself. for some people getting creative comes naturally, but others will need a bit of a push. this article will hopefully help :) here are 10 tips that will hopefully be helpful to get that bit of extra in your shots.\n\n1) most landscape photos are shot with wide lenses. i love wide lenses myself, but try a telezoom once and experiment with long focal lengths of 100-300+. try photographing patterns or small details in landscapes. or try it in the mountains on mountain tops. once you get the hang of it, you’ll notice a whole new world of landscape photography opens. seriously, try it.\n\n[green hills close up at 300mm](https://i.imgur.com/tsjk3v5.jpg)\n\n2) play with motion. clouds move, water moves. try to create dynamics in your frame by the use of moving water or clouds. you can do this by using long or short shutter speeds. you can make use of filters to create longer exposures, or create drama with very short exposures. always experiment with different lengths of exposure with both clouds and water.\n\n[short exposure to capture drama](https://i.imgur.com/cnqqxyl.jpg)\n\n[long exposure of the same scene with a different composition to create a totally different mood](https://i.imgur.com/yoh6pll.jpg)\n\n3) experiment with a cpl filter. i have done landscape photography without a cpl filter for years. but once you have one, you start to see why it can be so useful in different cases. it can be especially useful to control the amount of sunlight and reflection on reflective surfaces. you simply can’t do this in post production.\n\n[example of rotating cpl effect on reflective surface](https://media.giphy.com/media/1o1u6vbxa54ubmcmlc/giphy.gif)\n\n4) when photographing with longer lenses use layers and compression. landscapes look totally different with long lenses and you can compress foreground and background objects to give a lot of depth in your photo. \n\n[compressed road shot at 135mm](https://i.imgur.com/vrrbvgd.jpg)\n\n[including a person with a long lens shot at 200mm](https://i.imgur.com/ozyvtbu.jpg)\n\n5) use light to your advantage. light always changes especially during sunsets and sunrises. look for details here and isolated objects by light. this happens a lot in the mountains where clouds and light play around peaks go on during the whole day. \n\n[first morning light hitting a mountain peak](https://i.imgur.com/yi0maqn.jpg)\n\n6) when shooting with wide angles, get very close to objects to create a lot of depth in your photo. with ‘very close’ i mean very close. so close that your lens almost touches the foreground object. this can be a flower, a plant, or anything. you can use focus stacking to get everything in focus, or choose to pick a very wide open aperture to get the foreground completely out of focus/blurry. both choices offer different looks and can both be used in nice ways.\n\n[getting very low and close with out of focus foreground](https://i.imgur.com/xzq3bll.jpg)\n\n[getting very low with focus stacking](https://i.imgur.com/cq7euyj.jpg)\n\n7) make use of sunstars in your composition. when shooting directly in to the sun and closing down your aperture to f/16-f/22 you will see that your lens will create a sunstar. different lenses have different characteristics. some lenses create beautiful sunstars and you may want to make use of them. -----> position !!!  the sun against an edge, like the horizon or just an object in the frame. by positioning it slightly against an edge, the sunstars will look best. try and experiment!\n\n[f/22 sunstar with the sun peaking just over the treeline](https://i.imgur.com/t3fxcra.jpg)\n\n[sun just touching the edge of an object to create a sunstar](https://i.imgur.com/tb42rpc.jpg)\n\n8) learn how to shoot with extreme wide angle lenses and fisheye lenses. by extreme wide i mean wider than 14mm (full frame equivalent). photographing at 10-12mm or wider with fisheye lenses give you a whole new perspective to a landscape. it opens up lots of (creative) possibilities. learn the ‘defish’ technique also that makes it possible to create an undistorted shot out of a fisheye shot (not going to describe the technique here, but can be found online. i also have a youtube tutorial about it). this can be extremely useful for photographing very wide landscapes.\n\n[vertigo shot with 180 degree fisheye and corrupted with lens profile](https://i.imgur.com/txya83y.jpg)\n\n\n[wide scene shot with 12mm fisheye 180 degrees, corrected so no distortion appears](https://i.imgur.com/uzi8pjr.jpg)\n\n9) don’t always immediately take your camera out and look for potential frames. walk around in nature and use your eyes. try to visualise how things would look through your camera. i also often use my smartphone, which has an around 20mm field of view. simply to check framing.\n\n[random spot i found next to the road](https://i.imgur.com/yskqooz.jpg)\n\n10) last, this may sound very obvious but it’s important to train your eye nonstop. look around you everywhere and try to see potential compositions in every day life. this may sounds hard and being a landscape photographer can be very tiring because of the nonstop possibilities nature offers. you train your eye by using a wide array of lenses so that you know how things will look through an extreme zoom lens, or how things would look with an extreme wide angle.\n\n[cold morning, just looking around](https://i.imgur.com/ddehidc.jpg)\n\n\nhope these were useful. feel free to ask me anything in here!\n\n", "sortedWord": "None", "identifyer": 12270, "year": "2018"}, {"Unnamed: 0": 266948, "autor": "shibbytomato", "date": 1527181400000, "content": "Lifetouch employees: How is/was your experience with the company? /!/ I applied to a part-time position from June-Aug for $9.50/hr. I'm a student so I feel that will make my perspective differ from other people, probably being more naive to things. ", "link": "https://www.reddit.com/r/photography/comments/8lu9gw/lifetouch_employees_how_iswas_your_experience/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lifetouch employees: how is/was your experience with the company? /!/ i applied to a part-time -----> position !!!  from june-aug for $9.50/hr. i'm a student so i feel that will make my perspective differ from other people, probably being more naive to things. ", "sortedWord": "None", "identifyer": 12601, "year": "2018"}, {"Unnamed: 0": 267781, "autor": "ToxicAcez", "date": 1539697300000, "content": "Need Help With An Interview /!/ Hey Reddit! I recently applied for a part time position at a camera store. I was told to be knowledgeable about photography and current major brand models. I have a good understanding of both of these things, but I was just wondering what I should brush up on before the interview. Any help would be much appreciated.", "link": "https://www.reddit.com/r/photography/comments/9onpzk/need_help_with_an_interview/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help with an interview /!/ hey reddit! i recently applied for a part time -----> position !!!  at a camera store. i was told to be knowledgeable about photography and current major brand models. i have a good understanding of both of these things, but i was just wondering what i should brush up on before the interview. any help would be much appreciated.", "sortedWord": "None", "identifyer": 13459, "year": "2018"}, {"Unnamed: 0": 268113, "autor": "nemofish3", "date": 1546030411000, "content": "Image Stacking? /!/ Hello All, I am having a play with light trails and would like to know what the best method is to get the result I would like.\n\nIf I take a number of pictures with 5 second exposure (example) can I add them all together? All would be taken from exactly the same position so the image would be the same except for the light trails. My aim is to add all of the light trails together.\n\nHope this makes sense. Any advice would be awesome.\n\nMany thanks ", "link": "https://www.reddit.com/r/photography/comments/aae89j/image_stacking/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "image stacking? /!/ hello all, i am having a play with light trails and would like to know what the best method is to get the result i would like.\n\nif i take a number of pictures with 5 second exposure (example) can i add them all together? all would be taken from exactly the same -----> position !!!  so the image would be the same except for the light trails. my aim is to add all of the light trails together.\n\nhope this makes sense. any advice would be awesome.\n\nmany thanks ", "sortedWord": "None", "identifyer": 13808, "year": "2018"}, {"Unnamed: 0": 268627, "autor": "nipubarua", "date": 1523174759000, "content": "Camera Tripod Position and Good Tripod Mount Tips - Pixel321", "link": "https://www.reddit.com/r/photography/comments/8aonp8/camera_tripod_position_and_good_tripod_mount_tips/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera tripod -----> position !!!  and good tripod mount tips - pixel321", "sortedWord": "None", "identifyer": 14342, "year": "2018"}, {"Unnamed: 0": 268744, "autor": "barneyskywalker", "date": 1523851628000, "content": "Doing an 80s style glamour band photo on Thursday - any tips or ideas? /!/ We’re going for that 80s new wave look (bands like Depeche Mode, New Order, Human League, Pet Shop Boys, Tears for Fears); my photographer friend has a nice camera and some flashes but I am wondering what else I’ll need and how we should position the lighting to get results like [this.](https://imgur.com/gallery/dS2d5) Should I use a pastel sheet or would it be better to use a white sheet and mess with it in photoshop? My photoshop skills are limited, but I do own the program. Thanks!", "link": "https://www.reddit.com/r/photography/comments/8ckv1r/doing_an_80s_style_glamour_band_photo_on_thursday/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "doing an 80s style glamour band photo on thursday - any tips or ideas? /!/ we’re going for that 80s new wave look (bands like depeche mode, new order, human league, pet shop boys, tears for fears); my photographer friend has a nice camera and some flashes but i am wondering what else i’ll need and how we should -----> position !!!  the lighting to get results like [this.](https://imgur.com/gallery/ds2d5) should i use a pastel sheet or would it be better to use a white sheet and mess with it in photoshop? my photoshop skills are limited, but i do own the program. thanks!", "sortedWord": "None", "identifyer": 14465, "year": "2018"}, {"Unnamed: 0": 269645, "autor": "inorman", "date": 1527077381000, "content": "PhotoPills just released an update with drone planning, sun angular size, sun position, light direction and a bunch more new features.", "link": "https://www.reddit.com/r/photography/comments/8liu3g/photopills_just_released_an_update_with_drone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photopills just released an update with drone planning, sun angular size, sun -----> position !!! , light direction and a bunch more new features.", "sortedWord": "None", "identifyer": 15402, "year": "2018"}, {"Unnamed: 0": 270096, "autor": "FrogeToge", "date": 1530048079000, "content": "First job worries /!/ Hey guys, I just got an email about a photography job I applied for about a month ago. The position was for an assistant photographer for a decent sized studio. I am an amateur photographer but I decided to send in a resume and a couple sample shots and I ended up getting the job. The problem is, I don't think I'm actually that qualified. The shoot is a weekend in July and I'd be getting paid $900 for a weekend of shooting with travel expenses paid. I sent in a lot of landscape and street photography but the position is for products. Should I just accept the position anyway and use it as experience or should I let the company know that I don't think I am qualified for it.", "link": "https://www.reddit.com/r/photography/comments/8u3tt7/first_job_worries/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "first job worries /!/ hey guys, i just got an email about a photography job i applied for about a month ago. the -----> position !!!  was for an assistant photographer for a decent sized studio. i am an amateur photographer but i decided to send in a resume and a couple sample shots and i ended up getting the job. the problem is, i don't think i'm actually that qualified. the shoot is a weekend in july and i'd be getting paid $900 for a weekend of shooting with travel expenses paid. i sent in a lot of landscape and street photography but the position is for products. should i just accept the position anyway and use it as experience or should i let the company know that i don't think i am qualified for it.", "sortedWord": "None", "identifyer": 15865, "year": "2018"}, {"Unnamed: 0": 270630, "autor": "grandslam7", "date": 1534988135000, "content": "How Retrospectives Help You Grow Faster as a Landscape Photographer /!/ [https://fstoppers.com/education/how-retrospectives-help-you-grow-faster-landscape-photographer-280197](https://fstoppers.com/education/how-retrospectives-help-you-grow-faster-landscape-photographer-280197)\n\nI do this all the time: I look through my photos after a shoot, pick the few that stand out at me, and discard whatever doesn't look like the rest of the photos. \n\nBut I also do this when I'm shooting. I follow the same basic rules I've learned and struggle to mix up my approach (composition, where I position myself, what I look for, etc.). As such, my photos look all the same across several shoots.\n\nI really like the \"retrospective\" approach and am going to give it a try. It seems simple, but I really feel like it's going to help. It has me wondering, is this a common, fundamental practice that all photographers do?", "link": "https://www.reddit.com/r/photography/comments/99j6j0/how_retrospectives_help_you_grow_faster_as_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how retrospectives help you grow faster as a landscape photographer /!/ [https://fstoppers.com/education/how-retrospectives-help-you-grow-faster-landscape-photographer-280197](https://fstoppers.com/education/how-retrospectives-help-you-grow-faster-landscape-photographer-280197)\n\ni do this all the time: i look through my photos after a shoot, pick the few that stand out at me, and discard whatever doesn't look like the rest of the photos. \n\nbut i also do this when i'm shooting. i follow the same basic rules i've learned and struggle to mix up my approach (composition, where i -----> position !!!  myself, what i look for, etc.). as such, my photos look all the same across several shoots.\n\ni really like the \"retrospective\" approach and am going to give it a try. it seems simple, but i really feel like it's going to help. it has me wondering, is this a common, fundamental practice that all photographers do?", "sortedWord": "None", "identifyer": 16413, "year": "2018"}, {"Unnamed: 0": 271190, "autor": "nitsuaztnarf", "date": 1538848806000, "content": "How many of you actually have a full time photography job and how did you land such a position? /!/ There is a newspaper company in a town here in Michigan where I just moved to from seattle. And I’d love to apply for a photographer position but they already have a full time photographer. But the town is growing rapidly. Maybe they could use a second photographer. I’m young and very imaginative and there current photographer seems a bit amateurish. \n\nNot sure how I’d go about asking for a job there. I just really wanna start now on focusing on pursuing my passion. I need some kind of creative job cause I’m sick of construction work. It’s destroying me.", "link": "https://www.reddit.com/r/photography/comments/9lxyzt/how_many_of_you_actually_have_a_full_time/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how many of you actually have a full time photography job and how did you land such a -----> position !!! ? /!/ there is a newspaper company in a town here in michigan where i just moved to from seattle. and i’d love to apply for a photographer position but they already have a full time photographer. but the town is growing rapidly. maybe they could use a second photographer. i’m young and very imaginative and there current photographer seems a bit amateurish. \n\nnot sure how i’d go about asking for a job there. i just really wanna start now on focusing on pursuing my passion. i need some kind of creative job cause i’m sick of construction work. it’s destroying me.", "sortedWord": "None", "identifyer": 16990, "year": "2018"}, {"Unnamed: 0": 271370, "autor": "martinpitonak", "date": 1540473148000, "content": "Still Life Photography of Nail Polish in Whirlpool of Splash /!/ [https://www.youtube.com/watch?v=ykEECI1lVTo](https://www.youtube.com/watch?v=ykEECI1lVTo)\n\n&amp;#x200B;\n\n![img](ca7yap710cu11)\n\n## The Brief\n\nFor this project, I was tasked with creating hero images for a cosmetic brand. They commisioned me to work on several different shots for a range of nail polishes they are looking to market. Again, I was put in charge of coming up with the creative angle and had the freedom to explore and execute the final result. The client was open to any suggestions or ideas, and I had fun putting it all together.\n\nMy vision was to keep the design simple yet unique and deeply orientated towards the brand and product on show. Nail polish bottles are generally a small object and require slightly different treatment than, say, photographing a large carry bag. The bottle needed to be centered and close up enough to capture the logo and brand name. Each bottle was cubed-shaped, with a matt-pastel color, the same as the gel nail polish inside. The lids (bottle tops) were long, frosted-gold colored. This color really illuminates the final image and casts long diagonal lines as the viewer follows it up.\n\n## The Setup and Using Splashes\n\nAs this project is not a single image, but rather a series of images, I tried to create something that flows like a story. After brainstorming and running through different ideas, I found a particular genre of still life photography to be most suitable. Splash is the art of capturing liquid in motion. Splash is a classic genre, and it is popular to take splash templates and use them as backgrounds or additions to your image. It does require some knowledge of Photoshop and other editing software to manipulate. I chose to create a splash specifically for this project, and not take advantage of an existing one from other artists.\n\nI experimented with several different liquids, from organic to synthetic mixtures. The mixture or liquid needed the consistency and fluidity to fit the brand and idea. Eventually, I settled with a classic, white acrylic wall paint. A water-based solution worked best for this project. Pouring the liquid by hand from a raised position into a container below, I hoped to capture interesting patterns. The setup was a standard white background positioned not far behind the table. On the table, I had a container to catch the paint as I poured it from above. I repeated this pouring step multiple times until I found some splashes worth editing and merging with the nail polish bottles. The products were shot individually. This particular project required more post-production editing than usual. Software like Photoshop was used to achieve the final results.\n\n## To End\n\nThe client and I agree that the final results are satisfying. The elegance of the brand complements the creativity and flow of the photograph. The online community expressed an interest in learning more about splash. As well as, praising the final results. Furthermore, the client originally made me withhold the results until they have rolled out the new marketing material.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9ra645/still_life_photography_of_nail_polish_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "still life photography of nail polish in whirlpool of splash /!/ [https://www.youtube.com/watch?v=ykeeci1lvto](https://www.youtube.com/watch?v=ykeeci1lvto)\n\n&amp;#x200b;\n\n![img](ca7yap710cu11)\n\n## the brief\n\nfor this project, i was tasked with creating hero images for a cosmetic brand. they commisioned me to work on several different shots for a range of nail polishes they are looking to market. again, i was put in charge of coming up with the creative angle and had the freedom to explore and execute the final result. the client was open to any suggestions or ideas, and i had fun putting it all together.\n\nmy vision was to keep the design simple yet unique and deeply orientated towards the brand and product on show. nail polish bottles are generally a small object and require slightly different treatment than, say, photographing a large carry bag. the bottle needed to be centered and close up enough to capture the logo and brand name. each bottle was cubed-shaped, with a matt-pastel color, the same as the gel nail polish inside. the lids (bottle tops) were long, frosted-gold colored. this color really illuminates the final image and casts long diagonal lines as the viewer follows it up.\n\n## the setup and using splashes\n\nas this project is not a single image, but rather a series of images, i tried to create something that flows like a story. after brainstorming and running through different ideas, i found a particular genre of still life photography to be most suitable. splash is the art of capturing liquid in motion. splash is a classic genre, and it is popular to take splash templates and use them as backgrounds or additions to your image. it does require some knowledge of photoshop and other editing software to manipulate. i chose to create a splash specifically for this project, and not take advantage of an existing one from other artists.\n\ni experimented with several different liquids, from organic to synthetic mixtures. the mixture or liquid needed the consistency and fluidity to fit the brand and idea. eventually, i settled with a classic, white acrylic wall paint. a water-based solution worked best for this project. pouring the liquid by hand from a raised -----> position !!!  into a container below, i hoped to capture interesting patterns. the setup was a standard white background positioned not far behind the table. on the table, i had a container to catch the paint as i poured it from above. i repeated this pouring step multiple times until i found some splashes worth editing and merging with the nail polish bottles. the products were shot individually. this particular project required more post-production editing than usual. software like photoshop was used to achieve the final results.\n\n## to end\n\nthe client and i agree that the final results are satisfying. the elegance of the brand complements the creativity and flow of the photograph. the online community expressed an interest in learning more about splash. as well as, praising the final results. furthermore, the client originally made me withhold the results until they have rolled out the new marketing material.\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 17171, "year": "2018"}, {"Unnamed: 0": 271946, "autor": "Lipsia", "date": 1543604167000, "content": "Is there a way to find out the camera's exact position by using a photo and Google? /!/ Hello, everyone.\n\n&amp;#x200B;\n\nBecause my camera doesn't have a GPS and I didn't want to keep it connected to my Smartphone all day long I'm adding the position manually using Google Earth + Street View. Of course, I notice that the position I find is only roughly correct. It can be a few meters away, but that's not too bad, because my main goal is to be able to find the position of my shot later in case of doubt. Being there it doesn't matter if it is three steps away or not. \n\n&amp;#x200B;\n\nHowever, I asked myself whether it was possible, with the help of mathmatics and Google or other software, to determine the exact position of my camera when taking a picture using the arrangement and angles of e.g. houses, traffic lights and other fixed objects.\n\n&amp;#x200B;\n\nDo you know more?", "link": "https://www.reddit.com/r/photography/comments/a1vao3/is_there_a_way_to_find_out_the_cameras_exact/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is there a way to find out the camera's exact -----> position !!!  by using a photo and google? /!/ hello, everyone.\n\n&amp;#x200b;\n\nbecause my camera doesn't have a gps and i didn't want to keep it connected to my smartphone all day long i'm adding the position manually using google earth + street view. of course, i notice that the position i find is only roughly correct. it can be a few meters away, but that's not too bad, because my main goal is to be able to find the position of my shot later in case of doubt. being there it doesn't matter if it is three steps away or not. \n\n&amp;#x200b;\n\nhowever, i asked myself whether it was possible, with the help of mathmatics and google or other software, to determine the exact position of my camera when taking a picture using the arrangement and angles of e.g. houses, traffic lights and other fixed objects.\n\n&amp;#x200b;\n\ndo you know more?", "sortedWord": "None", "identifyer": 17765, "year": "2018"}, {"Unnamed: 0": 272703, "autor": "rocafella222", "date": 1517353365000, "content": "What kind of questions should one expect when interviewing for a photographer position at a modelling agency? /!/ I've only been doing photography for a year, after about 5 years in fashion and creative direction. I've gotten pretty good and built my portfolio up fast by doing at least 40 shoots in the last 8 months. I'm specialized in doing mostly art-directed fashion portraits, with natural light, so I'm not too skilled with studio lighting.\n\nAnyway, I have an interview to be a photographer for this large modelling agency and I have no idea what to expect. Any tips? \n\nThank you! ", "link": "https://www.reddit.com/r/photography/comments/7u564b/what_kind_of_questions_should_one_expect_when/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what kind of questions should one expect when interviewing for a photographer -----> position !!!  at a modelling agency? /!/ i've only been doing photography for a year, after about 5 years in fashion and creative direction. i've gotten pretty good and built my portfolio up fast by doing at least 40 shoots in the last 8 months. i'm specialized in doing mostly art-directed fashion portraits, with natural light, so i'm not too skilled with studio lighting.\n\nanyway, i have an interview to be a photographer for this large modelling agency and i have no idea what to expect. any tips? \n\nthank you! ", "sortedWord": "None", "identifyer": 18544, "year": "2018"}, {"Unnamed: 0": 272842, "autor": "LushAnte", "date": 1522710327000, "content": "So I decided to try an invert my manfrotto 055xpro3 and i cant get it back in its normal non flipped position. PLEASE HELP! 😬 The center column wont slide out", "link": "https://www.reddit.com/r/photography/comments/8965s5/so_i_decided_to_try_an_invert_my_manfrotto/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "so i decided to try an invert my manfrotto 055xpro3 and i cant get it back in its normal non flipped -----> position !!! . please help! 😬 the center column wont slide out", "sortedWord": "None", "identifyer": 18687, "year": "2018"}, {"Unnamed: 0": 274162, "autor": "SubjectC", "date": 1525311773000, "content": "Looking for a small tripod thay can handle a pretty heavy camera setup /!/ I need it to have a ball joint/swivel head I can position at any angle. \n\nI'm looking into different ones but figured I'd ask here too, willing to spend a little more for a good one, I use it every day.", "link": "https://www.reddit.com/r/photography/comments/8gmrgo/looking_for_a_small_tripod_thay_can_handle_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for a small tripod thay can handle a pretty heavy camera setup /!/ i need it to have a ball joint/swivel head i can -----> position !!!  at any angle. \n\ni'm looking into different ones but figured i'd ask here too, willing to spend a little more for a good one, i use it every day.", "sortedWord": "None", "identifyer": 20054, "year": "2018"}, {"Unnamed: 0": 274237, "autor": "jaycub84", "date": 1524410693000, "content": "Competing for work /!/ I’m more of a hobbyist photographer than anything, and I mostly shoot for me (or family). Occasionally, I’ve had the opportunity to monetize my work and it’s always nice to have an extra paycheck. \nRecently though, I’ve found myself in a position where my actual job has slowed a bit and I’d like to do more paid shoots. I’ve gotten some work thru word of mouth, but finding new clients on my own has proved to be a challenge. Just the other day a lady posted in a local Facebook group looking for senior photos for her daughter. I saw the post, commented, and sent her a message with what I thought was a fair price quote. Within an hour, my comment was buried under fifty others. Lots of them with cheaper prices because “they just got a camera”. In this day and age where EVERYONE is a “photographer”, how do you compete? ", "link": "https://www.reddit.com/r/photography/comments/8e3wfg/competing_for_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "competing for work /!/ i’m more of a hobbyist photographer than anything, and i mostly shoot for me (or family). occasionally, i’ve had the opportunity to monetize my work and it’s always nice to have an extra paycheck. \nrecently though, i’ve found myself in a -----> position !!!  where my actual job has slowed a bit and i’d like to do more paid shoots. i’ve gotten some work thru word of mouth, but finding new clients on my own has proved to be a challenge. just the other day a lady posted in a local facebook group looking for senior photos for her daughter. i saw the post, commented, and sent her a message with what i thought was a fair price quote. within an hour, my comment was buried under fifty others. lots of them with cheaper prices because “they just got a camera”. in this day and age where everyone is a “photographer”, how do you compete? ", "sortedWord": "None", "identifyer": 20135, "year": "2018"}, {"Unnamed: 0": 274363, "autor": "ReVerthex", "date": 1524642476000, "content": "Precarious Tripods /!/ So let me start off with a disclaimer, DO NOT DO THIS.\nUnless of course you have nerves of steel and the reflexes of a mongoose, it will also help if you don't skimp on a tripod and get a good one capable of these feats.\n\nPlease share pics of your tripod in a terribly unsafe position, here is just two of mine.\n\nhttps://imgur.com/6NirshP\nI remember waving at it when the water washed over the center column but chose to keep my feet dry.\n\nhttps://imgur.com/VmkKBN6\nMy friend couldn't believe I would set my tripod up like this so casually.", "link": "https://www.reddit.com/r/photography/comments/8ertu3/precarious_tripods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "precarious tripods /!/ so let me start off with a disclaimer, do not do this.\nunless of course you have nerves of steel and the reflexes of a mongoose, it will also help if you don't skimp on a tripod and get a good one capable of these feats.\n\nplease share pics of your tripod in a terribly unsafe -----> position !!! , here is just two of mine.\n\nhttps://imgur.com/6nirshp\ni remember waving at it when the water washed over the center column but chose to keep my feet dry.\n\nhttps://imgur.com/vmkkbn6\nmy friend couldn't believe i would set my tripod up like this so casually.", "sortedWord": "None", "identifyer": 20268, "year": "2018"}, {"Unnamed: 0": 275423, "autor": "idkwidd", "date": 1528416619000, "content": "Looking for some advanced help in Milky Way photography. /!/ I posted here last year and got some awesome tips and help, which enables me to get some awesome shots of the Milky Way. Tonight I’m gonna go out again and would like to take them to the next level. I’ve watched some videos on photo stacking and would like to try it. When I get set up do I just continue taking photos after the 15 second exposure is up? I figure once I take two or three a few minutes will have passed and all the stars will be in a different position. How can I fix this?", "link": "https://www.reddit.com/r/photography/comments/8pfbra/looking_for_some_advanced_help_in_milky_way/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for some advanced help in milky way photography. /!/ i posted here last year and got some awesome tips and help, which enables me to get some awesome shots of the milky way. tonight i’m gonna go out again and would like to take them to the next level. i’ve watched some videos on photo stacking and would like to try it. when i get set up do i just continue taking photos after the 15 second exposure is up? i figure once i take two or three a few minutes will have passed and all the stars will be in a different -----> position !!! . how can i fix this?", "sortedWord": "None", "identifyer": 21390, "year": "2018"}, {"Unnamed: 0": 275706, "autor": "leagasa", "date": 1529304300000, "content": "What are some interesting projects to do with your first baby? /!/ Hey guys, we're expecting anytime now and I've been trying to find some photography projects I can work on with my baby. \n\nWe will take the usual photos, but I want to commit to something a little more fun or interesting. I can't seem to find any projects out there to try my self. \n\nMy main one is taking a photo of the baby in the exact same position (as best as possible) everyday and compile it to adult hood.", "link": "https://www.reddit.com/r/photography/comments/8rxfsq/what_are_some_interesting_projects_to_do_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what are some interesting projects to do with your first baby? /!/ hey guys, we're expecting anytime now and i've been trying to find some photography projects i can work on with my baby. \n\nwe will take the usual photos, but i want to commit to something a little more fun or interesting. i can't seem to find any projects out there to try my self. \n\nmy main one is taking a photo of the baby in the exact same -----> position !!!  (as best as possible) everyday and compile it to adult hood.", "sortedWord": "None", "identifyer": 21687, "year": "2018"}, {"Unnamed: 0": 275984, "autor": "BurntTurkey", "date": 1530624544000, "content": "Thank God for wedding photographers, and thank you! /!/ So, I shot/filmed my first wedding video on Saturday and to say I was nervous is a massive understatement (Bare with me, I'm not lost, I know this is r/Photography). \n\nI was on my own, and It was the first time i'd met the lucky couple as the wedding was last minute due to an illness, and I said i'd shoot the whole day for free for them. So, I felt very out of my depth.\n\nBut then, in steps the hero of the day - The Wedding Photographer!\n\nDon't get me wrong, I'd done tonnes of research and watched countless video's on youtube to get an idea of what I'd need to shoot. However having the photographer direct pretty much the whole day made my life so much less stressful. \nControlling a crowd of 70+ to get into position for shots, and when and where to shoot the couple was a lifesaver for me! Especially as I'm quite a shy and reserved person around crowds.\n\nAnyway, I just came here to thank all of you wedding photographers out there, from the bottom of the heart of a noobie wedding videographer! Here's to my next wedding and hopefully a good photographer! XD\nCheers!", "link": "https://www.reddit.com/r/photography/comments/8vs74f/thank_god_for_wedding_photographers_and_thank_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thank god for wedding photographers, and thank you! /!/ so, i shot/filmed my first wedding video on saturday and to say i was nervous is a massive understatement (bare with me, i'm not lost, i know this is r/photography). \n\ni was on my own, and it was the first time i'd met the lucky couple as the wedding was last minute due to an illness, and i said i'd shoot the whole day for free for them. so, i felt very out of my depth.\n\nbut then, in steps the hero of the day - the wedding photographer!\n\ndon't get me wrong, i'd done tonnes of research and watched countless video's on youtube to get an idea of what i'd need to shoot. however having the photographer direct pretty much the whole day made my life so much less stressful. \ncontrolling a crowd of 70+ to get into -----> position !!!  for shots, and when and where to shoot the couple was a lifesaver for me! especially as i'm quite a shy and reserved person around crowds.\n\nanyway, i just came here to thank all of you wedding photographers out there, from the bottom of the heart of a noobie wedding videographer! here's to my next wedding and hopefully a good photographer! xd\ncheers!", "sortedWord": "None", "identifyer": 21974, "year": "2018"}, {"Unnamed: 0": 276349, "autor": "AJWattReviews", "date": 1532854184000, "content": "Photography scam? /!/ Saw this post on Craigslist for a job. Is this a scam or legit? \n\n“What we do\nWe provide the nation's largest home builders with a digital customer engagement platform. At the heart of the platform are weekly home progress photos.\n\nEach week, we visit new home construction sites and document the progress of the construction through digital photos. Through our unique processes and platform, the digital photos are shared with new home buyers, prospects and the builder.\n\nRequirements\nOur photographers operate as independent contractors. As such they are ultimately responsible for setting their own schedule and using their own vehicle. However, the following requirements are needed to successfully perform the services:\n\nMust be dependable - photos are required each week\nMust have good attention to detail - follow our photo quality guidelines and capture every home every week\nShooting new home photography requires a fair amount of walking, including walking up and down stairs - this is a physical job\nReliable transportation - homes will be located in several communities and will require your own transporation to and from each\nGood communication skills - promptly let us know if you run in to any problems in the field and respond to our communications to you\nBasic computer skills - after shooting photos, you'll need to upload photos to us for processing (it's very basic)\nDocumentation - we require the following:\nExecution of a Photography Services Agreement\nProof of Eligibility to work (Driver's license, W-9 form, etc)\nProof of Auto Insurance with appropriate liability limits\nSuccessful completion of a criminal background check\nDirect deposit authorization\nWhat we Provide\nShooting new home photos provides an excellent opportunity to earn extra income. Here's what we will provide:\n\nWe provide camera equipment that is compatible with our platform\nTraining on our photo taking process and photo upload procedures\nCompensation that averages around $20 per hour*\nWhat to Expect\nIf invited to join our team of independent contractors, you can expect:\n\nTo meet in person for an interview for the contract position\nApproximately 1 week of training in the field while we shoot new homes under construction\nWeekly feedback on the quality and timeliness of your photos\nA flat, monthly compensation based on the size of your route\nMost of our photographers shoot the equivalent of 2 to 3 days per week (8 hour work days). Your time per week will depend on your schedule and availability. Routes often change as our customers will finish communities and start new ones. Monthly compensation is adjusted if warranted by these changes.”", "link": "https://www.reddit.com/r/photography/comments/92thkk/photography_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photography scam? /!/ saw this post on craigslist for a job. is this a scam or legit? \n\n“what we do\nwe provide the nation's largest home builders with a digital customer engagement platform. at the heart of the platform are weekly home progress photos.\n\neach week, we visit new home construction sites and document the progress of the construction through digital photos. through our unique processes and platform, the digital photos are shared with new home buyers, prospects and the builder.\n\nrequirements\nour photographers operate as independent contractors. as such they are ultimately responsible for setting their own schedule and using their own vehicle. however, the following requirements are needed to successfully perform the services:\n\nmust be dependable - photos are required each week\nmust have good attention to detail - follow our photo quality guidelines and capture every home every week\nshooting new home photography requires a fair amount of walking, including walking up and down stairs - this is a physical job\nreliable transportation - homes will be located in several communities and will require your own transporation to and from each\ngood communication skills - promptly let us know if you run in to any problems in the field and respond to our communications to you\nbasic computer skills - after shooting photos, you'll need to upload photos to us for processing (it's very basic)\ndocumentation - we require the following:\nexecution of a photography services agreement\nproof of eligibility to work (driver's license, w-9 form, etc)\nproof of auto insurance with appropriate liability limits\nsuccessful completion of a criminal background check\ndirect deposit authorization\nwhat we provide\nshooting new home photos provides an excellent opportunity to earn extra income. here's what we will provide:\n\nwe provide camera equipment that is compatible with our platform\ntraining on our photo taking process and photo upload procedures\ncompensation that averages around $20 per hour*\nwhat to expect\nif invited to join our team of independent contractors, you can expect:\n\nto meet in person for an interview for the contract -----> position !!! \napproximately 1 week of training in the field while we shoot new homes under construction\nweekly feedback on the quality and timeliness of your photos\na flat, monthly compensation based on the size of your route\nmost of our photographers shoot the equivalent of 2 to 3 days per week (8 hour work days). your time per week will depend on your schedule and availability. routes often change as our customers will finish communities and start new ones. monthly compensation is adjusted if warranted by these changes.”", "sortedWord": "None", "identifyer": 22354, "year": "2018"}, {"Unnamed: 0": 276520, "autor": "mastermascovich", "date": 1533842835000, "content": "Is a photography degree worth it? /!/ How valuable is a degree in Photography?  Does it provide any unique or exceptionally high-demand skills?\n\nIt seems like learning how to take and edit photos is something that could be done without a degree.  And even with the degree, it just seems really narrow in focus for the kinds of work and positions available to you.", "link": "https://www.reddit.com/r/photography/comments/95zkxi/is_a_photography_degree_worth_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "is a photography degree worth it? /!/ how valuable is a degree in photography?  does it provide any unique or exceptionally high-demand skills?\n\nit seems like learning how to take and edit photos is something that could be done without a degree.  and even with the degree, it just seems really narrow in focus for the kinds of work and -----> positions !!!  available to you.", "sortedWord": "None", "identifyer": 22531, "year": "2018"}, {"Unnamed: 0": 276559, "autor": "Eelluminati", "date": 1533801006000, "content": "We need some help with product photography /!/ Hi all,\n\nI work a Marketing job at a manufacturer of metal clamping products (hose clamps etc.). For our new website we decided to do the product photography ourselves. We have a product photography table with 3 permanent \"cold\" lights (left, right and above). Lighting and composition of the photos is good, but we are running into an issue.\n\nWe use a macro lens which, as I'm sure you know, is a fixed lens. Our products range from very small (a few millimeters in diameter) to very large (a few 100mm in diameter). We want to keep a steady angle and position with the camera so we use a tripod at a fixed distance. However, this means that the smaller products end up being very small in the picture (we can't zoom), and the larger ones end up being impossible to capture without moving the tripod backwards. \n\nWe want all of our products to leave approximately the same amount of white space in the images, regardless of the real-life size of our products. Currently we can achieve this by scaling the small products so they appear bigger, but this means a loss of image quality and sharpness.\n\nMy question is: do we need a zoom lens? Do \"zoom macro\" lenses exist? Ideally, I would like something that would allow me to zoom in to the smaller products and take the photo. Then, take a product that's a bit larger and zoom out a bit. And continue like that so each product takes up the same amount of area within the picture, without a loss of quality and regardless of their real-life size.\n\nAre we even on the right track? Some help here would be appreciated because I don't want to splurge on expensive equipment we don't need.", "link": "https://www.reddit.com/r/photography/comments/95ufos/we_need_some_help_with_product_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "we need some help with product photography /!/ hi all,\n\ni work a marketing job at a manufacturer of metal clamping products (hose clamps etc.). for our new website we decided to do the product photography ourselves. we have a product photography table with 3 permanent \"cold\" lights (left, right and above). lighting and composition of the photos is good, but we are running into an issue.\n\nwe use a macro lens which, as i'm sure you know, is a fixed lens. our products range from very small (a few millimeters in diameter) to very large (a few 100mm in diameter). we want to keep a steady angle and -----> position !!!  with the camera so we use a tripod at a fixed distance. however, this means that the smaller products end up being very small in the picture (we can't zoom), and the larger ones end up being impossible to capture without moving the tripod backwards. \n\nwe want all of our products to leave approximately the same amount of white space in the images, regardless of the real-life size of our products. currently we can achieve this by scaling the small products so they appear bigger, but this means a loss of image quality and sharpness.\n\nmy question is: do we need a zoom lens? do \"zoom macro\" lenses exist? ideally, i would like something that would allow me to zoom in to the smaller products and take the photo. then, take a product that's a bit larger and zoom out a bit. and continue like that so each product takes up the same amount of area within the picture, without a loss of quality and regardless of their real-life size.\n\nare we even on the right track? some help here would be appreciated because i don't want to splurge on expensive equipment we don't need.", "sortedWord": "None", "identifyer": 22572, "year": "2018"}, {"Unnamed: 0": 276956, "autor": "elantrix", "date": 1534477851000, "content": "Perfect timing and position of sunlight into a carpark", "link": "https://www.reddit.com/r/photography/comments/97z2pr/perfect_timing_and_position_of_sunlight_into_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "perfect timing and -----> position !!!  of sunlight into a carpark", "sortedWord": "None", "identifyer": 22980, "year": "2018"}, {"Unnamed: 0": 276984, "autor": "OlavLewis", "date": 1534886426000, "content": "Camera options button rotation fix /!/ Hello /r/photography, \n\nI am looking for a fix to a small but annoying issue. [Pic](https://imgur.com/a/L3So7VC)\n\nIt is a Samsung ST66 (I know, a cheapo). As you can see, the options button sometimes rotate to a different position, then I should rotate the button back to the normal position. It is not supposed to happen. I refered wiki and some product forums, but I havnt found a fix. Any help appreciated. ", "link": "https://www.reddit.com/r/photography/comments/9975nb/camera_options_button_rotation_fix/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera options button rotation fix /!/ hello /r/photography, \n\ni am looking for a fix to a small but annoying issue. [pic](https://imgur.com/a/l3so7vc)\n\nit is a samsung st66 (i know, a cheapo). as you can see, the options button sometimes rotate to a different -----> position !!! , then i should rotate the button back to the normal -----> position !!! . it is not supposed to happen. i refered wiki and some product forums, but i havnt found a fix. any help appreciated. ", "sortedWord": "None", "identifyer": 23011, "year": "2018"}, {"Unnamed: 0": 277059, "autor": "devnumpty", "date": 1534818103000, "content": "Shoe flash softbox for macro photography /!/ I'm getting back into photography, as I teach my young son. He's showing an interest in macro photography lately, and I'd like to give him a softbox/diffuser for a shoe-mount flash as a present.\n\nWhen I used to shoot handheld macro, I finally settled on a particular type of shoe-mount softbox. It was designed to get the light high above the camera, and as such was designed to be used with the flash pointed straight up; the softbox had a 45-degree-angle mirror (think of a periscope) that'd direct the light forward into the softbox from there. \n\nThis was perfect for shooting handheld macro because I could attach the softbox then lie the flash head forward, positioning the massive light source directly above the lens. I got very good results with this setup; I even started getting sculpted lighting by using black tape as a mask to create multiple light sources from the single rectangular light surface.\n\nI can't find that softbox anywhere now. Does anyone know where something like that is sold today? I see some disc-shaped softboxes which seem to be used with the flash pointed straight up, but I'd like to find one of those rectangular ones. It was perfect for handheld macro. \n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/98z7hw/shoe_flash_softbox_for_macro_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "shoe flash softbox for macro photography /!/ i'm getting back into photography, as i teach my young son. he's showing an interest in macro photography lately, and i'd like to give him a softbox/diffuser for a shoe-mount flash as a present.\n\nwhen i used to shoot handheld macro, i finally settled on a particular type of shoe-mount softbox. it was designed to get the light high above the camera, and as such was designed to be used with the flash pointed straight up; the softbox had a 45-degree-angle mirror (think of a periscope) that'd direct the light forward into the softbox from there. \n\nthis was perfect for shooting handheld macro because i could attach the softbox then lie the flash head forward, -----> positioning !!!  the massive light source directly above the lens. i got very good results with this setup; i even started getting sculpted lighting by using black tape as a mask to create multiple light sources from the single rectangular light surface.\n\ni can't find that softbox anywhere now. does anyone know where something like that is sold today? i see some disc-shaped softboxes which seem to be used with the flash pointed straight up, but i'd like to find one of those rectangular ones. it was perfect for handheld macro. \n\nthanks!", "sortedWord": "None", "identifyer": 23087, "year": "2018"}, {"Unnamed: 0": 277101, "autor": "Slikgtt", "date": 1535358175000, "content": "Just beginning photography and need some help.... /!/ I took some pictures from myself, the camera is in a tripod. I changed positions and want to put all the photos in one picture to get a \"clone\" photo\"  using adobe PS 2018. Search google but I can't find it how to do this....", "link": "https://www.reddit.com/r/photography/comments/9an6q9/just_beginning_photography_and_need_some_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "just beginning photography and need some help.... /!/ i took some pictures from myself, the camera is in a tripod. i changed -----> positions !!!  and want to put all the photos in one picture to get a \"clone\" photo\"  using adobe ps 2018. search google but i can't find it how to do this....", "sortedWord": "None", "identifyer": 23132, "year": "2018"}, {"Unnamed: 0": 277396, "autor": "troutbum", "date": 1536332127000, "content": "When I say \"double exposure\", why does everyone think of a head with mountains or trees in it? /!/ I was browsing through the internet looking for inspiration on double exposures, and literally all you can see are photoshopped pictures of peoples head with mountains or trees coming out of it. It's crazy! This technique allows so much freedom! Yet, I guarantee that hardly any of you have touched the double exposure setting on your camera since getting it out of the box (if at all).\n\nSo I decided to make a post about it.\n\n## How do double exposures work?\n\nThere are two types of double exposures: in-camera and post-production. In-camera double exposures are when you take two photos on a single frame. It started in film photography where you could rewind the film, then shoot over the same frame again. The end result is the literal sum of the two images.\n\nThe digital method involves importing and manipulating the images in Photoshop. This method gives you full control, so the possibilities are endless! \n\nThe trick to double exposures is to understand exactly what an exposure is. The best mental image that I can use to explain double exposures is to imagine each double exposure is like a glass of water. An empty glass is an area of underexposure and the completely full glass is an area of overexposure. Got that in your mind? Great!\n\nIn a 2 shot double exposure, we get two pours to fill the glass. If you underexpose an area of the first image (empty glass), more of the second image will be used to fill the glass. Conversely, overexposing an area of the first image will ensure that there is almost no effect of the second image on the overall composition.\n\n“If you fill your glass on the first pour, there’s no room for more!”\n\n[If your having trouble visualising it there is a demonstration in this video.](https://www.youtube.com/watch?v=mdTj_N5ZPsU)\n\n## Gear for Double Exposure Photography\n\nYou need a camera (digital or film) that allows you to take double exposures (in camera). As far as digital cameras go, I am aware that the following have an inbuilt function:\n\n– Canon EOS 5D Mark III, 1D X and 70D;\n\n– most Nikon DSLRs;\n\n– Fujifilm’s X-T1, X-Pro1 and X100s;\n\n– Olympus OM-D E-M5.\n\nMost higher-end digital cameras have a double exposure option so just check your camera or your manual. You know the thing that is still in plastic, in the box.\n\n# In the film camera world you can check out the following:\n\n– All of the Nikon FM/FE/FA FM\n\n– Canon AE-1\n\n– Konica T3, T3N and T4\n\n– Contax 139 and 159MM\n\n– Minolta XD, XE-1 and XE-7\n\nThere are a lot more but these are some of the more common ones online that you can pick up on eBay rather cheaply.\n\n## Got a camera and I get the glasses of water, how do I do it?\n\nPortraits are the quintessential double exposure. This is because it is easier to control the exposure of background against the subject. You can fairly easily get a decent result. But, remember that (in camera) double exposures are about embracing the irregular and creating beauty through randomness. So start here but then let your mind wander. We'll get to other inspiration below.\n\n### The first image\n\nTake the first of the two photos by aiming the camera directly at your subject. Meter the image from the darkest part of the subject, or put it/them in front of something bright (like the sun). If you are unsure of the metering system then underexpose the image by 1-2 stops. This lessens the probability of you overexposing everything.\n\nYou can do this on a film camera by changing the film speed up one stop (from 100 – 200 or 200 – 400). On a digital camera, you can adjust the exposure compensation to -1. This will put the subject in a slightly underexposed position. The background will be heading towards overexposed (if not completely overexposed).\n\nDrawing this back to our glass analogy, we have the pixels (glasses of water) for the subject around 1/3 full, ready for more information. The surrounding pixels (background glasses of water) should be full or near full. This means that they have little/no capacity to absorb more information. That is what we want.\n\n### The second image\n\nFor the second image, you are looking to find something with a lot of colour and texture. Make sure whatever you are photographing is **well lit**. This goes a long way to making the final image something that will capture your eye. Think things like autumn foliage, flowers, trees, sunsets, cloud patterns, textured wallpaper etc. If the texture isn’t uniform then you need to think about where in the frame your subject was and ensure that it is distributed across this area.\n\nWhen I do this I always try to fill the frame with the textures as evenly as possible. Providing you have taken the first image correctly (with the background heading towards overexposed) you should be fine.\n\n## Earlier you mentioned photoshop?\n\nPhotoshop can be used if you do not have a camera that an inbuilt multiple exposure functions. Or you can use it to create the “perfect” image.\n\nStart with your initial layer as the “subject” photo. Open this image in photoshop. Next, open your texture image as the second layer of the image.\n\nMake sure that both images are highlighted and select “multiply” from the drop-down menu under the layers window.  Now alter the exposure of the image until you get the look that you are after.\n\nAs far as photoshop is concerned there is really no limit. You can create whatever you can dream of. Just imagine any two images and with enough skill and manipulation, you can combine them. I won’t go too much into this as at some point it becomes composite photography – adding parts of different images together into a single image.\n\n## Is that it?\n\nNoooo never! It took me a while to build up this visual analogy of the glass of water in my head. But once you can understand that, you will have a much easier time attempting to blend the images in camera. I find that having some results early in a project like this will spur you on to get more creative. That is why I wrote this tutorial and made this film!\n\nAgain, don’t be afraid to throw the glass of water off the table and experiment. Once you have the basics down, you can get crazy. Here are some more ideas to get you inspired:\n\n– Start experimenting with all different types of textures.\n\n– Think about using different subjects from different perspectives.\n\n– Try blending two completely different images to make a single image that portrays a story.\n\n– Take a close-up shot of your subject, then another shot further away, or at another angle.\n\n– Use different coloured flash gels to take multiple exposures of a subject in different colours.\n\n– Put your camera on a tripod and take an image of yourself or a subject, then have them move and take a second exposure.\n\nHopefully this helps inspire some of you to take up the challenge and shoot some double exposures. It is becoming a long lost art in the world of photography and it really shouldn't be. I know that self promotion is shunned, but I have put some examples that I shot while writing this on [here](https://www.culturedkiwi.com/double-exposure-photography). I just want to see more people in the photography community using this technique creatively!", "link": "https://www.reddit.com/r/photography/comments/9dv3uo/when_i_say_double_exposure_why_does_everyone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "when i say \"double exposure\", why does everyone think of a head with mountains or trees in it? /!/ i was browsing through the internet looking for inspiration on double exposures, and literally all you can see are photoshopped pictures of peoples head with mountains or trees coming out of it. it's crazy! this technique allows so much freedom! yet, i guarantee that hardly any of you have touched the double exposure setting on your camera since getting it out of the box (if at all).\n\nso i decided to make a post about it.\n\n## how do double exposures work?\n\nthere are two types of double exposures: in-camera and post-production. in-camera double exposures are when you take two photos on a single frame. it started in film photography where you could rewind the film, then shoot over the same frame again. the end result is the literal sum of the two images.\n\nthe digital method involves importing and manipulating the images in photoshop. this method gives you full control, so the possibilities are endless! \n\nthe trick to double exposures is to understand exactly what an exposure is. the best mental image that i can use to explain double exposures is to imagine each double exposure is like a glass of water. an empty glass is an area of underexposure and the completely full glass is an area of overexposure. got that in your mind? great!\n\nin a 2 shot double exposure, we get two pours to fill the glass. if you underexpose an area of the first image (empty glass), more of the second image will be used to fill the glass. conversely, overexposing an area of the first image will ensure that there is almost no effect of the second image on the overall composition.\n\n“if you fill your glass on the first pour, there’s no room for more!”\n\n[if your having trouble visualising it there is a demonstration in this video.](https://www.youtube.com/watch?v=mdtj_n5zpsu)\n\n## gear for double exposure photography\n\nyou need a camera (digital or film) that allows you to take double exposures (in camera). as far as digital cameras go, i am aware that the following have an inbuilt function:\n\n– canon eos 5d mark iii, 1d x and 70d;\n\n– most nikon dslrs;\n\n– fujifilm’s x-t1, x-pro1 and x100s;\n\n– olympus om-d e-m5.\n\nmost higher-end digital cameras have a double exposure option so just check your camera or your manual. you know the thing that is still in plastic, in the box.\n\n# in the film camera world you can check out the following:\n\n– all of the nikon fm/fe/fa fm\n\n– canon ae-1\n\n– konica t3, t3n and t4\n\n– contax 139 and 159mm\n\n– minolta xd, xe-1 and xe-7\n\nthere are a lot more but these are some of the more common ones online that you can pick up on ebay rather cheaply.\n\n## got a camera and i get the glasses of water, how do i do it?\n\nportraits are the quintessential double exposure. this is because it is easier to control the exposure of background against the subject. you can fairly easily get a decent result. but, remember that (in camera) double exposures are about embracing the irregular and creating beauty through randomness. so start here but then let your mind wander. we'll get to other inspiration below.\n\n### the first image\n\ntake the first of the two photos by aiming the camera directly at your subject. meter the image from the darkest part of the subject, or put it/them in front of something bright (like the sun). if you are unsure of the metering system then underexpose the image by 1-2 stops. this lessens the probability of you overexposing everything.\n\nyou can do this on a film camera by changing the film speed up one stop (from 100 – 200 or 200 – 400). on a digital camera, you can adjust the exposure compensation to -1. this will put the subject in a slightly underexposed -----> position !!! . the background will be heading towards overexposed (if not completely overexposed).\n\ndrawing this back to our glass analogy, we have the pixels (glasses of water) for the subject around 1/3 full, ready for more information. the surrounding pixels (background glasses of water) should be full or near full. this means that they have little/no capacity to absorb more information. that is what we want.\n\n### the second image\n\nfor the second image, you are looking to find something with a lot of colour and texture. make sure whatever you are photographing is **well lit**. this goes a long way to making the final image something that will capture your eye. think things like autumn foliage, flowers, trees, sunsets, cloud patterns, textured wallpaper etc. if the texture isn’t uniform then you need to think about where in the frame your subject was and ensure that it is distributed across this area.\n\nwhen i do this i always try to fill the frame with the textures as evenly as possible. providing you have taken the first image correctly (with the background heading towards overexposed) you should be fine.\n\n## earlier you mentioned photoshop?\n\nphotoshop can be used if you do not have a camera that an inbuilt multiple exposure functions. or you can use it to create the “perfect” image.\n\nstart with your initial layer as the “subject” photo. open this image in photoshop. next, open your texture image as the second layer of the image.\n\nmake sure that both images are highlighted and select “multiply” from the drop-down menu under the layers window.  now alter the exposure of the image until you get the look that you are after.\n\nas far as photoshop is concerned there is really no limit. you can create whatever you can dream of. just imagine any two images and with enough skill and manipulation, you can combine them. i won’t go too much into this as at some point it becomes composite photography – adding parts of different images together into a single image.\n\n## is that it?\n\nnoooo never! it took me a while to build up this visual analogy of the glass of water in my head. but once you can understand that, you will have a much easier time attempting to blend the images in camera. i find that having some results early in a project like this will spur you on to get more creative. that is why i wrote this tutorial and made this film!\n\nagain, don’t be afraid to throw the glass of water off the table and experiment. once you have the basics down, you can get crazy. here are some more ideas to get you inspired:\n\n– start experimenting with all different types of textures.\n\n– think about using different subjects from different perspectives.\n\n– try blending two completely different images to make a single image that portrays a story.\n\n– take a close-up shot of your subject, then another shot further away, or at another angle.\n\n– use different coloured flash gels to take multiple exposures of a subject in different colours.\n\n– put your camera on a tripod and take an image of yourself or a subject, then have them move and take a second exposure.\n\nhopefully this helps inspire some of you to take up the challenge and shoot some double exposures. it is becoming a long lost art in the world of photography and it really shouldn't be. i know that self promotion is shunned, but i have put some examples that i shot while writing this on [here](https://www.culturedkiwi.com/double-exposure-photography). i just want to see more people in the photography community using this technique creatively!", "sortedWord": "None", "identifyer": 23438, "year": "2018"}, {"Unnamed: 0": 278309, "autor": "Natewest1987", "date": 1540064848000, "content": "High Speed Sync + Non-HSS Strobes? /!/ Hey pals,\n\nI'm trying to get back into photographer after taking a several year hiatus...  and well, I've read mixed conclusions about what I'm trying to accomplish.   I've heard that it isn't possible with the strobes that I have, but I have also seen a youtube video where someone appears to have done this with the Odin System.    I ran this by a someone who works in camera rentals and they said it could potentially damage my equipment.   I'm not super in love with the strobes that I have, they were on sale so I grabbed them up, but also not in a position to grab the next step up right now.\n\nAnyhow, has anyone had any success getting HSS to work with the white lightning x series?   I have the x3200 and the x800.   I do not own a pocket wizard transceiver or the odin series, just basic phottix ones.   I know it's not possible with my current wireless setup, so I'm curious if you have gotten it to work, what would I need to purchase to make that happen?   And is it really at risk of me damaging something, or was that just something I was told by a sales person wanting me to buy things that they actually carry?   Also, I shoot with nikon d800e right now. \n\nThanks for any advice!\n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9px5kp/high_speed_sync_nonhss_strobes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "high speed sync + non-hss strobes? /!/ hey pals,\n\ni'm trying to get back into photographer after taking a several year hiatus...  and well, i've read mixed conclusions about what i'm trying to accomplish.   i've heard that it isn't possible with the strobes that i have, but i have also seen a youtube video where someone appears to have done this with the odin system.    i ran this by a someone who works in camera rentals and they said it could potentially damage my equipment.   i'm not super in love with the strobes that i have, they were on sale so i grabbed them up, but also not in a -----> position !!!  to grab the next step up right now.\n\nanyhow, has anyone had any success getting hss to work with the white lightning x series?   i have the x3200 and the x800.   i do not own a pocket wizard transceiver or the odin series, just basic phottix ones.   i know it's not possible with my current wireless setup, so i'm curious if you have gotten it to work, what would i need to purchase to make that happen?   and is it really at risk of me damaging something, or was that just something i was told by a sales person wanting me to buy things that they actually carry?   also, i shoot with nikon d800e right now. \n\nthanks for any advice!\n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 24376, "year": "2018"}, {"Unnamed: 0": 279070, "autor": "thatsalreadytakennn", "date": 1544220955000, "content": "Any ideas on how I can take pictures of my handmade gloves on myself? /!/  I've got some handmade gloves that I want to sell on Etsy but the taking pictures of them part has got me confused on how to set up everything. Just FYI if it helps to explain things I'm going to be using my Iphone 6s to take the pictures (you can take pictures by tapping the \"take picture\" button on the screen, by pressing the volume up button on the side of the phone, or I could use earbuds with a volume control button on it that is plugged into the phone and use the volume up button on ear buds to take a picture (which would be useful if I was taking a portrait style picture of myself bc I could use it as a remote, and it still might be useful but instead of a portrait, I just want pictures of my arms with the gloves on them from my perspective if I get to be choosy.) I also want a white background (I have a white poster board for that part.) Now the challenging part (for me at least) is to figure out how to get a picture of the gloves (I was hoping from my perspective but I'm not set on that completely that I wouldn't try other ways too) all by myself. I don't want to ask anyone to help bc I'm a major perfectionist and any picture taken by anyone else I'm sure would kind of bug me bc I know something wouldn't be \"right\". I don't have anyone else to model them either at my disposal. Any ideas on how to set the phone (the camera), the poster board, my arms with the gloves on them (the gloves range from fingerless to wrist length... all the way up to past elbows length), myself attached to the arms of course, and anything else I forgot to mention that's needed for the pic all near a window of course for natural light? I'm just not sure how to position everything or hold everything in place like the camera without my arms? Thanks! ", "link": "https://www.reddit.com/r/photography/comments/a44qvn/any_ideas_on_how_i_can_take_pictures_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any ideas on how i can take pictures of my handmade gloves on myself? /!/  i've got some handmade gloves that i want to sell on etsy but the taking pictures of them part has got me confused on how to set up everything. just fyi if it helps to explain things i'm going to be using my iphone 6s to take the pictures (you can take pictures by tapping the \"take picture\" button on the screen, by pressing the volume up button on the side of the phone, or i could use earbuds with a volume control button on it that is plugged into the phone and use the volume up button on ear buds to take a picture (which would be useful if i was taking a portrait style picture of myself bc i could use it as a remote, and it still might be useful but instead of a portrait, i just want pictures of my arms with the gloves on them from my perspective if i get to be choosy.) i also want a white background (i have a white poster board for that part.) now the challenging part (for me at least) is to figure out how to get a picture of the gloves (i was hoping from my perspective but i'm not set on that completely that i wouldn't try other ways too) all by myself. i don't want to ask anyone to help bc i'm a major perfectionist and any picture taken by anyone else i'm sure would kind of bug me bc i know something wouldn't be \"right\". i don't have anyone else to model them either at my disposal. any ideas on how to set the phone (the camera), the poster board, my arms with the gloves on them (the gloves range from fingerless to wrist length... all the way up to past elbows length), myself attached to the arms of course, and anything else i forgot to mention that's needed for the pic all near a window of course for natural light? i'm just not sure how to -----> position !!!  everything or hold everything in place like the camera without my arms? thanks! ", "sortedWord": "None", "identifyer": 25167, "year": "2018"}, {"Unnamed: 0": 279879, "autor": "MIKEnergizer", "date": 1515169072000, "content": "Seeking guidance on how to survive as a freelance photographer. Please help. /!/ Hey everyone, \n\nI have been doing freelance photography for a few months now as my only income and it has been going well. I've been surviving. But the busy season where I am at is coming to an end and I am beginning to stress.\n\nRight now I work for myself, and two other separate photographers who send me work. I mostly shoot events, families, small weddings, portraits, etc. Retail stuff. Looking to broaden my horizon eventually. My goal is continue doing just photography. \n\nThe problems I am facing are as follows: \nNot enough gigs.... That is it. Haha! Of course that implies other things as well.\n\nMy questions:\nWhat are some ways (without spending too much money) I can gain exposure? \nHow might I gain more positions as an associate photographer? The current positions I have are almost solely from referral.\nShould I charge more? (Will link website below)\nWhat have you all done when work is slow and you need money? \n\nLike I said, my goal is to continue doing just photography. It's been working so far I just need a little help. Am I maybe missing some obvious opportunities? \n\nwww.michaeljenningsphotography.com\n\nIG: @michaeljphoto_", "link": "https://www.reddit.com/r/photography/comments/7oc7xp/seeking_guidance_on_how_to_survive_as_a_freelance/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "seeking guidance on how to survive as a freelance photographer. please help. /!/ hey everyone, \n\ni have been doing freelance photography for a few months now as my only income and it has been going well. i've been surviving. but the busy season where i am at is coming to an end and i am beginning to stress.\n\nright now i work for myself, and two other separate photographers who send me work. i mostly shoot events, families, small weddings, portraits, etc. retail stuff. looking to broaden my horizon eventually. my goal is continue doing just photography. \n\nthe problems i am facing are as follows: \nnot enough gigs.... that is it. haha! of course that implies other things as well.\n\nmy questions:\nwhat are some ways (without spending too much money) i can gain exposure? \nhow might i gain more -----> positions !!!  as an associate photographer? the current positions i have are almost solely from referral.\nshould i charge more? (will link website below)\nwhat have you all done when work is slow and you need money? \n\nlike i said, my goal is to continue doing just photography. it's been working so far i just need a little help. am i maybe missing some obvious opportunities? \n\nwww.michaeljenningsphotography.com\n\nig: @michaeljphoto_", "sortedWord": "None", "identifyer": 26003, "year": "2018"}, {"Unnamed: 0": 279930, "autor": "Nikolte", "date": 1515109118000, "content": "Just hope you don't ever have to deal with Nikon customer \"service\" /!/ So I bought a d750 a year ago, and its been ok I guess. I have gotten some good images out of it, and for the most part, its been a good camera. Then I found out about the shutter recall, and sent it in. \n\nNow heres the fucky part: when it came back, none of the focus points would move in the viewfinder, (its not in the locked position, and yes I tried a powercycle and reset) and the camera would not auto focus on faces. These are 2 major problems for me as I shoot for a dance studio and they want video. So I called Nikon and all they could offer was another repair, so they sent a shipping label (2day air) and I sent it in and 4 days later they still haven't even looked at it. \n\nI also asked them for a replacement camera, just another d750, not anything bigger or better, to use in the meantime. They flat out refused. \nMy choice was to a) join NPS and get a loaner that way, or b) just wait for them to fix it. Luckily I have an old d700 that is fully operational, but of course, doesnt shoot video. \n\nThis was insulting to me. I have spent years shooting with Nikon gear, have spent thousands of dollars on their equipment. I sent them a working camera that had an active recall, that was really only inconveniencing me, and they returned it to me in WORSE condition than I sent it to them in, and refuse to compensate me for it. THEY BROKE MY CAMERA AND WONT GIVE ME A LOANER. I really dont think that is too much to ask and I am an inch away from switching to Canon just on how angry I am about this.  \n\nI really can't tell if Im overreacting here, and I may be. So any input here is appreciated, just needed to vent about it.\n\nEdit: If you are all ok being treated this way by a company that is happy to take your money without providing  quality service in return, well, enjoy that shit. We all need to demand more from the people we pay for goods and services or they can and will walk all over you.\n\nEdit 2: I dont qualify for NPS so stop suggesting it. ", "link": "https://www.reddit.com/r/photography/comments/7o6y86/just_hope_you_dont_ever_have_to_deal_with_nikon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just hope you don't ever have to deal with nikon customer \"service\" /!/ so i bought a d750 a year ago, and its been ok i guess. i have gotten some good images out of it, and for the most part, its been a good camera. then i found out about the shutter recall, and sent it in. \n\nnow heres the fucky part: when it came back, none of the focus points would move in the viewfinder, (its not in the locked -----> position !!! , and yes i tried a powercycle and reset) and the camera would not auto focus on faces. these are 2 major problems for me as i shoot for a dance studio and they want video. so i called nikon and all they could offer was another repair, so they sent a shipping label (2day air) and i sent it in and 4 days later they still haven't even looked at it. \n\ni also asked them for a replacement camera, just another d750, not anything bigger or better, to use in the meantime. they flat out refused. \nmy choice was to a) join nps and get a loaner that way, or b) just wait for them to fix it. luckily i have an old d700 that is fully operational, but of course, doesnt shoot video. \n\nthis was insulting to me. i have spent years shooting with nikon gear, have spent thousands of dollars on their equipment. i sent them a working camera that had an active recall, that was really only inconveniencing me, and they returned it to me in worse condition than i sent it to them in, and refuse to compensate me for it. they broke my camera and wont give me a loaner. i really dont think that is too much to ask and i am an inch away from switching to canon just on how angry i am about this.  \n\ni really can't tell if im overreacting here, and i may be. so any input here is appreciated, just needed to vent about it.\n\nedit: if you are all ok being treated this way by a company that is happy to take your money without providing  quality service in return, well, enjoy that shit. we all need to demand more from the people we pay for goods and services or they can and will walk all over you.\n\nedit 2: i dont qualify for nps so stop suggesting it. ", "sortedWord": "None", "identifyer": 26055, "year": "2018"}, {"Unnamed: 0": 281162, "autor": "[deleted]", "date": 1522093198000, "content": "Is Unit Stills (BTS) photography a unionized position?", "link": "https://www.reddit.com/r/photography/comments/87c049/is_unit_stills_bts_photography_a_unionized/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is unit stills (bts) photography a unionized -----> position !!! ?", "sortedWord": "None", "identifyer": 27331, "year": "2018"}, {"Unnamed: 0": 282243, "autor": "haxorious", "date": 1525859227000, "content": "Some funny stories during my photography years, come in and share yours. /!/ Lately, I've noticed that the atmostphere in our subreddit is getting quite heavy with the controversies, and the abundance of gear threads. So let's change things up a little and do some story telling.  \nI've posted this as a comment elsewhere, and I feel like you guys would enjoy this. Disclaimer: I'm a wedding photographer in Asia. The stories contain some crude language, sorry 'bout that.   \nSo first story, typical wedding, everyone was drinking and laughing. Right before the ceremony, groom's dad is already drunk, and made a huge racket. Groom started crying because his special day is ruined... and then started fucking hitting the old man. Yes. He hit his own dad with a wine bottle to the head, clean swing, no hesitation. Police was called and everyone was evacuated. No charges were made, and they did finish the ceremony later on, but I never got the last 30% of payment...  \n  \nSecond story, really sweet couple, quite young and inexperienced. During the ceremony infront of about 200 people, the groom hesitated to kiss the bride out of (seemingly) awkwardness. I mean, kissing in front of 200 people, I would be quite embarassed too. Out of nowhere, bride broke into tears and ran off, I guess she felt insulted? The groom just stood there, frozen in disbelief while guess started throwing things at him. Even glasses and silverware. Yes, I know, my weddings are violent.  \n(Ps: some guy threw flowers at him, which I found hilarious).  \n  \nThird one: Bride danced too hard at the after-party rave and passed out. Groom could not carry her back because she was quite overweight. I'm pretty sure people were either high or shit-faced drunk, because nobody stopped dancing to help the poor lady. Now, you gotta sit back and imagine the scene. Dark, clubby atmosphere with flashing lights and lazers. People dancing around having the time of their lives... around a passed out bride, right in the center of the room. Oh boy what I'd give to have permission to post that photo.  \n  \n4th story. Bride's parents, when asked for a speech, started cursing the couple in the middle of the ceremony. Apparently they didn't approve the marriage but attended anyways. MC did not know this and innocently gave them the mic. This went on for a good 10 minutes or so. You should see the absolutely terrified look on the MC's face. Poor girl was sure she's going to lose her job. The marrying couple was somewhat nonchalant, I guess they expected it to happen... while the MC looks like she's about to cry.  \n  \nAnd lastly, I don't know if I'd label this funny or sad but this couple invited *[a very famous band]* to perform for their wedding. After they've finished their set, the room got visibly empty. Like seriously, half of the guess left. I'm in no position to make statements, but I'm pretty certain most of those people snuck in just for the free performance. Bride and groom laughed it off, at least the wedding photos was grand and extravagant due to the crowd.  \n(That band is the biggest hit in the country right now. Name was omitted for obvious privacy reasons).  ", "link": "https://www.reddit.com/r/photography/comments/8i4pov/some_funny_stories_during_my_photography_years/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "some funny stories during my photography years, come in and share yours. /!/ lately, i've noticed that the atmostphere in our subreddit is getting quite heavy with the controversies, and the abundance of gear threads. so let's change things up a little and do some story telling.  \ni've posted this as a comment elsewhere, and i feel like you guys would enjoy this. disclaimer: i'm a wedding photographer in asia. the stories contain some crude language, sorry 'bout that.   \nso first story, typical wedding, everyone was drinking and laughing. right before the ceremony, groom's dad is already drunk, and made a huge racket. groom started crying because his special day is ruined... and then started fucking hitting the old man. yes. he hit his own dad with a wine bottle to the head, clean swing, no hesitation. police was called and everyone was evacuated. no charges were made, and they did finish the ceremony later on, but i never got the last 30% of payment...  \n  \nsecond story, really sweet couple, quite young and inexperienced. during the ceremony infront of about 200 people, the groom hesitated to kiss the bride out of (seemingly) awkwardness. i mean, kissing in front of 200 people, i would be quite embarassed too. out of nowhere, bride broke into tears and ran off, i guess she felt insulted? the groom just stood there, frozen in disbelief while guess started throwing things at him. even glasses and silverware. yes, i know, my weddings are violent.  \n(ps: some guy threw flowers at him, which i found hilarious).  \n  \nthird one: bride danced too hard at the after-party rave and passed out. groom could not carry her back because she was quite overweight. i'm pretty sure people were either high or shit-faced drunk, because nobody stopped dancing to help the poor lady. now, you gotta sit back and imagine the scene. dark, clubby atmosphere with flashing lights and lazers. people dancing around having the time of their lives... around a passed out bride, right in the center of the room. oh boy what i'd give to have permission to post that photo.  \n  \n4th story. bride's parents, when asked for a speech, started cursing the couple in the middle of the ceremony. apparently they didn't approve the marriage but attended anyways. mc did not know this and innocently gave them the mic. this went on for a good 10 minutes or so. you should see the absolutely terrified look on the mc's face. poor girl was sure she's going to lose her job. the marrying couple was somewhat nonchalant, i guess they expected it to happen... while the mc looks like she's about to cry.  \n  \nand lastly, i don't know if i'd label this funny or sad but this couple invited *[a very famous band]* to perform for their wedding. after they've finished their set, the room got visibly empty. like seriously, half of the guess left. i'm in no -----> position !!!  to make statements, but i'm pretty certain most of those people snuck in just for the free performance. bride and groom laughed it off, at least the wedding photos was grand and extravagant due to the crowd.  \n(that band is the biggest hit in the country right now. name was omitted for obvious privacy reasons).  ", "sortedWord": "None", "identifyer": 28459, "year": "2018"}, {"Unnamed: 0": 282315, "autor": "blamcomacandcheese", "date": 1525763291000, "content": "viewfinder blank - locked shutter? /!/ hello all, new here!!\nso today i received a really great condition mamiya nc1000 from my gma that belonged to my gpa before he passed away. i was checking to make sure everything's in order but there's no picture in the viewfinder and the mirror inside is up, not in position. i've heard this can be because the shutter's been pressed with no film and it's locked it - does anyone know of any way to release it? I own a canon t50 as well and have never had this problem with that camera. would appreciate help!!", "link": "https://www.reddit.com/r/photography/comments/8hurls/viewfinder_blank_locked_shutter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "viewfinder blank - locked shutter? /!/ hello all, new here!!\nso today i received a really great condition mamiya nc1000 from my gma that belonged to my gpa before he passed away. i was checking to make sure everything's in order but there's no picture in the viewfinder and the mirror inside is up, not in -----> position !!! . i've heard this can be because the shutter's been pressed with no film and it's locked it - does anyone know of any way to release it? i own a canon t50 as well and have never had this problem with that camera. would appreciate help!!", "sortedWord": "None", "identifyer": 28535, "year": "2018"}, {"Unnamed: 0": 283089, "autor": "Vestibuleskittle", "date": 1528924457000, "content": "Want to pursue photography, artitistic purposes, develop my ideas and place them before the camera, but is it feasible if I only had an IPhone X ? /!/ Not in the position to buy any expensive equipment. Have taken stunning photos with my 6 Plus, seek to take better photos with next phone.\n\nFeel as if I can’t llegimatelt pursue photography with just a phone camera. \n\nAdvice ? ", "link": "https://www.reddit.com/r/photography/comments/8qw4ek/want_to_pursue_photography_artitistic_purposes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "want to pursue photography, artitistic purposes, develop my ideas and place them before the camera, but is it feasible if i only had an iphone x ? /!/ not in the -----> position !!!  to buy any expensive equipment. have taken stunning photos with my 6 plus, seek to take better photos with next phone.\n\nfeel as if i can’t llegimatelt pursue photography with just a phone camera. \n\nadvice ? ", "sortedWord": "None", "identifyer": 29333, "year": "2018"}, {"Unnamed: 0": 284085, "autor": "Xandolph", "date": 1533055127000, "content": "Finally got my drone into position 40 miles offshore of Long Island, NY. Humpback Whale, Atlantic Ocean", "link": "https://www.reddit.com/r/photography/comments/93g2cv/finally_got_my_drone_into_position_40_miles/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "finally got my drone into -----> position !!!  40 miles offshore of long island, ny. humpback whale, atlantic ocean", "sortedWord": "None", "identifyer": 30369, "year": "2018"}, {"Unnamed: 0": 284160, "autor": "politigraph", "date": 1533960922000, "content": "Transitioning from freelance to a staff position /!/ Anyone out there transitioned from freelancing to a full time staff photo position? I'm currently about to (starting next week) and was curious if anyone had any tips on how to make the transition as smooth as possible. i.e. accounting, current clients, etc", "link": "https://www.reddit.com/r/photography/comments/96dubt/transitioning_from_freelance_to_a_staff_position/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "transitioning from freelance to a staff -----> position !!!  /!/ anyone out there transitioned from freelancing to a full time staff photo position? i'm currently about to (starting next week) and was curious if anyone had any tips on how to make the transition as smooth as possible. i.e. accounting, current clients, etc", "sortedWord": "None", "identifyer": 30448, "year": "2018"}, {"Unnamed: 0": 284412, "autor": "AntinatalistPoet", "date": 1532380969000, "content": "Is this image Faked? /!/ [This one](https://static1.squarespace.com/static/58b356a3f7e0ab0baa0e91f6/58b358f83e00bef9f4450808/59da0212f9a61eab9bbc4a4f/1507459635895/DSCF6263.jpg?format=750w), by SixStreetUnder\n\nLook at the little girl's feet, they seem to be clipping through the floor. Also, the shadow of her hand is different to her hand's real position (her fingers are spread in the shadow but touching irl.)\n\n\nOr maybe there's a step that's hard to perceive so her feet are on a lower level thus appearing cut off. \n\n\nWhat are your thoughts on this? Real or fake?", "link": "https://www.reddit.com/r/photography/comments/91b4k1/is_this_image_faked/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is this image faked? /!/ [this one](https://static1.squarespace.com/static/58b356a3f7e0ab0baa0e91f6/58b358f83e00bef9f4450808/59da0212f9a61eab9bbc4a4f/1507459635895/dscf6263.jpg?format=750w), by sixstreetunder\n\nlook at the little girl's feet, they seem to be clipping through the floor. also, the shadow of her hand is different to her hand's real -----> position !!!  (her fingers are spread in the shadow but touching irl.)\n\n\nor maybe there's a step that's hard to perceive so her feet are on a lower level thus appearing cut off. \n\n\nwhat are your thoughts on this? real or fake?", "sortedWord": "None", "identifyer": 30706, "year": "2018"}, {"Unnamed: 0": 284499, "autor": "andrew_dotdot", "date": 1534663678000, "content": "How to fix your Manfrotto Magic Arm 143 when it starts to crunch or snap /!/ Key takeaway: always store / transport your Manfrotto magic arm in the locked position. This will stop it from developing that crunching/snapping problem when locking and unlocking it.  It happens when a ball bearing in the locking handle jumps out of its place.\n\nHere’s my notes for how to fix this problem.\n\nAlso, if you’ve been crunching for a while, you may need to take the handle completely off and clean out the metal shavings from the three ball bearings re-grease that section of the stack. Also, it takes a little trial and error to get just the right tension I the system. Loosen the lock, tighten / loosen the bolt, re-lock and try again.\n\n[DIY fix your Manfrotto Magic Arm](https://imgur.com/gallery/rn7RWCI)", "link": "https://www.reddit.com/r/photography/comments/98im8e/how_to_fix_your_manfrotto_magic_arm_143_when_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to fix your manfrotto magic arm 143 when it starts to crunch or snap /!/ key takeaway: always store / transport your manfrotto magic arm in the locked -----> position !!! . this will stop it from developing that crunching/snapping problem when locking and unlocking it.  it happens when a ball bearing in the locking handle jumps out of its place.\n\nhere’s my notes for how to fix this problem.\n\nalso, if you’ve been crunching for a while, you may need to take the handle completely off and clean out the metal shavings from the three ball bearings re-grease that section of the stack. also, it takes a little trial and error to get just the right tension i the system. loosen the lock, tighten / loosen the bolt, re-lock and try again.\n\n[diy fix your manfrotto magic arm](https://imgur.com/gallery/rn7rwci)", "sortedWord": "None", "identifyer": 30797, "year": "2018"}, {"Unnamed: 0": 285921, "autor": "photenth", "date": 1539121811000, "content": "EOS R - Canon Fanboy Review /!/ My local camera store got the camera way earlier than expected and they told me: either you buy it right now or it goes to the guy next in line. So like the Canon fanboy that I am, I took it and I have to say, not regretting it AT ALL. Maybe buyer remorse sets in later, but this feels like a solid camera from start to finish (unlike the M5 or 6D). \n\nThe Serial number is really low ;p\n\n^Since ^I ^never ^really ^use ^any ^video ^features ^in ^my ^cameras ^this ^topic ^won't ^be ^covered.\n\nAlso don't expect any sensor oriented review, there are enough websites that do this. I take pictures of real things, not charts ;p\n\n#Ergonomics / Build Quality\n\nArguably the most important aspect of a camera, if you hate using it, you won't use it.\n\nThis camera feels great. The soft touch surfaces are all high quality, especially the grip. The plastic in the grip feels like the M5 but the depth (and it's a really deep grip) makes it comfortable to hold. The grip seems to be even deeper than that of the 1DXII. The rest of the body feels sturdy and much better than that of the M5. This compares to a 5D build quality and less that of the 6D. But the 5D and 1DX use this very coarse surface which makes them feel more rugged. This is more soft and luxury oriented. Also it's not light as a feather which is IMO a good thing most smaller lenses balance perfectly on this, even the 100-400mm seems to work well. I wouldn't take it out into heavy rain though. All the covers are thin and there is barely any room for gaskets. But I'd guess it would survive light rain easily.\n\nThe AF-ON button as most reviewers criticised is IMO not even that badly placed, if you press it with the side of your thumb instead of the tip, it's adequately positioned and you can rest the tip on the wheel at the same time. But even with the tip it's OK.\n\n#Customisation\n\nThis camera is more customizable than my 1DXII, and not just by a bit... Every button (and I mean every, including the display light button for the top display) can have pretty much every function available. I can even set the * button to be the wheel override button, which previously was only possible with the SET button. (This allows the scroll wheel to not adjust Tv or Av but ISO or EV-Comp while it's depressed, I love this feature and use it constantly).\n\nWhat does this mean? I was able to reassign most of the buttons to do what I want. M-Fn button is now my \"eco mode\". The backlight button is now  sleep (display off). The \"AF Selection mode\" button is my Eye focus switch etc. Everything is accessible right there without going into the menus. Not that I ever had this problem with my DSLRs given that they neither need a sleep button nor ECO mode, so this isn't meant as a burn against their DSLRs but a \"good job, Canon\" since they knew, this is a must have feature when there is much more packed into a camera with the same amount of buttons.\n\nCan't talk about the lens wheel, given that I don't have an R lens nor the adapter with it. But the menus reveal, that I can set pretty much any function to it. EV comp, ISO, Av, TV etc.\n\n#Function Bar\n\nFirst things first: It's not that bad. The left/right \"buttons\" are easy and not difficult at all to use. You even get a visual feedback on screen (I set the left button to show the histogram and the right to show electronic level). The scroll function is average. For long scrolling, a wheel just feels better since there is an active feedback. But I set it to change AF modes and because there are only a few of those I can almost scroll through them all in a single swipe.\n\n#Image quality\n\nSame as the 5DIV ;p JPG processor might be a bit different but the sensor is most likely the same. Images further down below.\n\n#AF\n\nIt's quick, surprisingly quick. Easily beats the M5, I would even argue it's up there with the 5DSR if not faster. Since this is highly subjective, try it out before buying!\n\nThe AF modes are pretty much the same as in DSLRs except the tracking mode which either picks up on faces or tracks whatever you select. Since I'm a DSLR shooter, I mainly use the fixed AF points and move them around with the touch screen. It's different, but after a while you're getting used to it. \n\nAs I said before the focus is quick, even with the 85mm f/1.2 II. And anyone who ever used that lens knows, that's an incredibly slow focusing lens. Really astonished how well it works.\n\nSince this is a mirrorless, the AF points go pretty far into the corners, and it seems to be working fine even with lenses that aren't even sharp at the edges. I'm not sure how they managed to do that especially since it doesn't stop down to focus. So either it knows that these lenses aren't sharp or it just tries to find the best possible focusing position. Either way, I'm impressed.\n\nFor those who love to shoot with manual focus lenses (only lenses that have electronic connections). You can set the AF point wherever you want and it will simulate a split prism. Basically two arrows on either side of the AF point and the closer you are to perfect focus, the closer they move together until they meet and light up green. Pretty cool! So anyone who has for example the MP-E 65mm (that weird 1-5x macro lens) it will show you if you are in focus. This is awesome! \n\n#EF Adapter\n\nSince there are currently no R lenses out, I'm \"forced\" to use my EF lenses. Nothing to worry though, they focus well. The adapter is solid and the mount itself is pure metal. I even attached the 500mm f/4.0 and I wasn't worried about holding the full weight of the lens through the grip. Tough little mount. Love it. AF works great with all my lenses, the longer ones might have some hunting when it's completely out of focus BUT I'd argue for large birds in flight and a little bit of getting used to it this could be a reasonable body (except of course the FPS ;p)\n\n#Connectivity\n\nBluetooth works fine. Wifi also quite surprisingly nice, you can set it up so it will upload new pictures whenever it's in the same network as the paired computer. Cool feature, but I can't imagine uploading 64GB of pictures through Wifi... Also I couldn't get it to work manually, it seems like you have to restart the camera, also don't connect anything to the USB port otherwise it won't even start the WiFi.\n\nUSB cable is a different story. They ONLY supply a USB-C to USB-C cable. Who has a USB-C port on their computer unless they bought one in the last two years? Sucks. Adding to that when you use your own USB-A to USB-C cable, it won't connect properly and starts to fuck around. I wasn't able to transfer any pictures... Had to do it all over Wifi... I sure hope this is more a driver issue than anything else.\n\nMost reviewers also said that most USB-C loading cables won't work but surprisingly the Nintendo Switch loading cable is compatible. So no need to buy a $100 + adapter, just get the Switch! But it looks like it only loads when the is camera turned off.\n\n#Overall Impression\n\nGiven that I bought this camera and I adore Canon bodies/lenses, I'm heavily biased. So it's no surprise that I love this camera. It will replace my M5 and 5DSR. It's truly the first good mirrorless by Canon and even though I'd love to have a scroll wheel around the set button since I'm so used to it, I still like it. Awesome little camera, I wish I already had the EF adapter with the scroll wheel, but this will do for now ;p\n\nI know people are hating Canon for how far behind they are with this camera. But beside the few tech shortcomings, this is a solid camera. It just works as advertised.\n\n#Picture Time\n\nSince this is basically the 5DIV sensor, I'd assume the IQ is equal. My editing path since Lightroom is still incapable of opening the RAW files: Photo Professional -&gt; TIFF -&gt; Lightroom. \n\nEditing: 0 sharpening (some soft edges, either from AA filter or the lens, with a bit of sharpening it's not really an issue), 0 noise reduction, no lens correction (neither CA nor distortion), no picture profile. Some highlight/shadow tuning.\n\n[Tinguely Fountain \\#1](https://i.imgur.com/7r5pmDo.jpg) ^[[FullRes](https://i.imgur.com/YqRf7XK.jpg)]\n\nArea focus on the fountain. The AF lit up for the whole arm. It wasn't bothered by the backlight nor by the water spray. (24-70mm f/2.8 II @ 63mm ISO 125) \n\n[Tinguely Fountain \\#2](https://i.imgur.com/skZo7dE.jpg) ^[[FullRes](https://i.imgur.com/YE8p7NV.jpg)]\n\nSome soft edges, Maybe this is OOF or the AA is shining through? hard to say (24-70mm f/2.8 II @ 70mm ISO 200) \n\n[Plastic Flowers](https://i.imgur.com/GVEe0os.jpg) ^[[FullRes](https://i.imgur.com/0lsBZCx.jpg)]\n\nFocused on the stem, job well done  (24-70mm f/2.8 II @ 70mm ISO 250) \n\n[Jag](https://i.imgur.com/WGXHiJ9.jpg) ^[[FullRes](https://i.imgur.com/yjYXWNZ.jpg)]\n\nSome pushed shadows against heavy backlight at ISO 2000 so you can see the banding everyone is talking about. (24-70mm f/2.8 II @ 61mm ISO 2000) Note there is some heavy JPG artifacting going on as well.\n\n[Manual Focus](https://i.imgur.com/vSZ6Gs2.jpg) ^[[FullRes](https://i.imgur.com/7hgVhLU.jpg)]\n\n1.5x Macro, shot at an angle, focus plane should be in the middle, but it seems like it's a bit further down.\n\nTaken with the MP-E6. This lens is really old and not really built for high res sensors of today, also it doesn't have a focus ring. The only way to focus is moving towards or away from the subject. I used the built in AF assist. Focus point is exactly in the middle of the frame, this is a cropped shot. I'd say not bad for hand held. (MP-E65mm f/2.8 @ ISO 1600)\n\n[Cat #1](https://i.imgur.com/SBKU1oy.jpg) ^[[FullRes](https://i.imgur.com/PiNXsB6.jpg)]\n\nFocus point on left eye, dead on focus. This isn't cropped and the AF point could have been a bit further to the edge but at some point the composition would be horrible ;p (85mm f/1.2 @ f/1.2, ISO 10000, 1/250s)\n\n[Cat #2](https://i.imgur.com/y4LStpi.jpg) ^[[FullRes](https://i.imgur.com/ozHUqGz.jpg)]\n\nFocus point right eye (I have a shot with the left, and the AF worked, but the picture looks weird when the dominant eye isn't in focus). (85mm f/1.2 @ f/1.2, ISO 3200, 1/250s)\n\nThe 85mm f/1.2 isn't really that sharp off center wide open, also heavy CA, so take the IQ with a grain of salt. This is purely experimental.\n\n[Cat #3](https://i.imgur.com/YEO4qB2.jpg) ^[[FullRes](https://i.imgur.com/HyQBA4W.jpg)]\n\nAnd here a shot with a flash attached and one of the sharpest Canon lenses. ETTL works fine. (135mm f/2.0 @ f/3.5, ISO 400, 1/200s)\n\nIf there are any questions, feel free to ask.", "link": "https://www.reddit.com/r/photography/comments/9mtfnx/eos_r_canon_fanboy_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "eos r - canon fanboy review /!/ my local camera store got the camera way earlier than expected and they told me: either you buy it right now or it goes to the guy next in line. so like the canon fanboy that i am, i took it and i have to say, not regretting it at all. maybe buyer remorse sets in later, but this feels like a solid camera from start to finish (unlike the m5 or 6d). \n\nthe serial number is really low ;p\n\n^since ^i ^never ^really ^use ^any ^video ^features ^in ^my ^cameras ^this ^topic ^won't ^be ^covered.\n\nalso don't expect any sensor oriented review, there are enough websites that do this. i take pictures of real things, not charts ;p\n\n#ergonomics / build quality\n\narguably the most important aspect of a camera, if you hate using it, you won't use it.\n\nthis camera feels great. the soft touch surfaces are all high quality, especially the grip. the plastic in the grip feels like the m5 but the depth (and it's a really deep grip) makes it comfortable to hold. the grip seems to be even deeper than that of the 1dxii. the rest of the body feels sturdy and much better than that of the m5. this compares to a 5d build quality and less that of the 6d. but the 5d and 1dx use this very coarse surface which makes them feel more rugged. this is more soft and luxury oriented. also it's not light as a feather which is imo a good thing most smaller lenses balance perfectly on this, even the 100-400mm seems to work well. i wouldn't take it out into heavy rain though. all the covers are thin and there is barely any room for gaskets. but i'd guess it would survive light rain easily.\n\nthe af-on button as most reviewers criticised is imo not even that badly placed, if you press it with the side of your thumb instead of the tip, it's adequately -----> positioned !!!  and you can rest the tip on the wheel at the same time. but even with the tip it's ok.\n\n#customisation\n\nthis camera is more customizable than my 1dxii, and not just by a bit... every button (and i mean every, including the display light button for the top display) can have pretty much every function available. i can even set the * button to be the wheel override button, which previously was only possible with the set button. (this allows the scroll wheel to not adjust tv or av but iso or ev-comp while it's depressed, i love this feature and use it constantly).\n\nwhat does this mean? i was able to reassign most of the buttons to do what i want. m-fn button is now my \"eco mode\". the backlight button is now  sleep (display off). the \"af selection mode\" button is my eye focus switch etc. everything is accessible right there without going into the menus. not that i ever had this problem with my dslrs given that they neither need a sleep button nor eco mode, so this isn't meant as a burn against their dslrs but a \"good job, canon\" since they knew, this is a must have feature when there is much more packed into a camera with the same amount of buttons.\n\ncan't talk about the lens wheel, given that i don't have an r lens nor the adapter with it. but the menus reveal, that i can set pretty much any function to it. ev comp, iso, av, tv etc.\n\n#function bar\n\nfirst things first: it's not that bad. the left/right \"buttons\" are easy and not difficult at all to use. you even get a visual feedback on screen (i set the left button to show the histogram and the right to show electronic level). the scroll function is average. for long scrolling, a wheel just feels better since there is an active feedback. but i set it to change af modes and because there are only a few of those i can almost scroll through them all in a single swipe.\n\n#image quality\n\nsame as the 5div ;p jpg processor might be a bit different but the sensor is most likely the same. images further down below.\n\n#af\n\nit's quick, surprisingly quick. easily beats the m5, i would even argue it's up there with the 5dsr if not faster. since this is highly subjective, try it out before buying!\n\nthe af modes are pretty much the same as in dslrs except the tracking mode which either picks up on faces or tracks whatever you select. since i'm a dslr shooter, i mainly use the fixed af points and move them around with the touch screen. it's different, but after a while you're getting used to it. \n\nas i said before the focus is quick, even with the 85mm f/1.2 ii. and anyone who ever used that lens knows, that's an incredibly slow focusing lens. really astonished how well it works.\n\nsince this is a mirrorless, the af points go pretty far into the corners, and it seems to be working fine even with lenses that aren't even sharp at the edges. i'm not sure how they managed to do that especially since it doesn't stop down to focus. so either it knows that these lenses aren't sharp or it just tries to find the best possible focusing position. either way, i'm impressed.\n\nfor those who love to shoot with manual focus lenses (only lenses that have electronic connections). you can set the af point wherever you want and it will simulate a split prism. basically two arrows on either side of the af point and the closer you are to perfect focus, the closer they move together until they meet and light up green. pretty cool! so anyone who has for example the mp-e 65mm (that weird 1-5x macro lens) it will show you if you are in focus. this is awesome! \n\n#ef adapter\n\nsince there are currently no r lenses out, i'm \"forced\" to use my ef lenses. nothing to worry though, they focus well. the adapter is solid and the mount itself is pure metal. i even attached the 500mm f/4.0 and i wasn't worried about holding the full weight of the lens through the grip. tough little mount. love it. af works great with all my lenses, the longer ones might have some hunting when it's completely out of focus but i'd argue for large birds in flight and a little bit of getting used to it this could be a reasonable body (except of course the fps ;p)\n\n#connectivity\n\nbluetooth works fine. wifi also quite surprisingly nice, you can set it up so it will upload new pictures whenever it's in the same network as the paired computer. cool feature, but i can't imagine uploading 64gb of pictures through wifi... also i couldn't get it to work manually, it seems like you have to restart the camera, also don't connect anything to the usb port otherwise it won't even start the wifi.\n\nusb cable is a different story. they only supply a usb-c to usb-c cable. who has a usb-c port on their computer unless they bought one in the last two years? sucks. adding to that when you use your own usb-a to usb-c cable, it won't connect properly and starts to fuck around. i wasn't able to transfer any pictures... had to do it all over wifi... i sure hope this is more a driver issue than anything else.\n\nmost reviewers also said that most usb-c loading cables won't work but surprisingly the nintendo switch loading cable is compatible. so no need to buy a $100 + adapter, just get the switch! but it looks like it only loads when the is camera turned off.\n\n#overall impression\n\ngiven that i bought this camera and i adore canon bodies/lenses, i'm heavily biased. so it's no surprise that i love this camera. it will replace my m5 and 5dsr. it's truly the first good mirrorless by canon and even though i'd love to have a scroll wheel around the set button since i'm so used to it, i still like it. awesome little camera, i wish i already had the ef adapter with the scroll wheel, but this will do for now ;p\n\ni know people are hating canon for how far behind they are with this camera. but beside the few tech shortcomings, this is a solid camera. it just works as advertised.\n\n#picture time\n\nsince this is basically the 5div sensor, i'd assume the iq is equal. my editing path since lightroom is still incapable of opening the raw files: photo professional -&gt; tiff -&gt; lightroom. \n\nediting: 0 sharpening (some soft edges, either from aa filter or the lens, with a bit of sharpening it's not really an issue), 0 noise reduction, no lens correction (neither ca nor distortion), no picture profile. some highlight/shadow tuning.\n\n[tinguely fountain \\#1](https://i.imgur.com/7r5pmdo.jpg) ^[[fullres](https://i.imgur.com/yqrf7xk.jpg)]\n\narea focus on the fountain. the af lit up for the whole arm. it wasn't bothered by the backlight nor by the water spray. (24-70mm f/2.8 ii @ 63mm iso 125) \n\n[tinguely fountain \\#2](https://i.imgur.com/skzo7de.jpg) ^[[fullres](https://i.imgur.com/ye8p7nv.jpg)]\n\nsome soft edges, maybe this is oof or the aa is shining through? hard to say (24-70mm f/2.8 ii @ 70mm iso 200) \n\n[plastic flowers](https://i.imgur.com/gvee0os.jpg) ^[[fullres](https://i.imgur.com/0lsbzcx.jpg)]\n\nfocused on the stem, job well done  (24-70mm f/2.8 ii @ 70mm iso 250) \n\n[jag](https://i.imgur.com/wgxhij9.jpg) ^[[fullres](https://i.imgur.com/yjyxwnz.jpg)]\n\nsome pushed shadows against heavy backlight at iso 2000 so you can see the banding everyone is talking about. (24-70mm f/2.8 ii @ 61mm iso 2000) note there is some heavy jpg artifacting going on as well.\n\n[manual focus](https://i.imgur.com/vsz6gs2.jpg) ^[[fullres](https://i.imgur.com/7hgvhlu.jpg)]\n\n1.5x macro, shot at an angle, focus plane should be in the middle, but it seems like it's a bit further down.\n\ntaken with the mp-e6. this lens is really old and not really built for high res sensors of today, also it doesn't have a focus ring. the only way to focus is moving towards or away from the subject. i used the built in af assist. focus point is exactly in the middle of the frame, this is a cropped shot. i'd say not bad for hand held. (mp-e65mm f/2.8 @ iso 1600)\n\n[cat #1](https://i.imgur.com/sbku1oy.jpg) ^[[fullres](https://i.imgur.com/pinxsb6.jpg)]\n\nfocus point on left eye, dead on focus. this isn't cropped and the af point could have been a bit further to the edge but at some point the composition would be horrible ;p (85mm f/1.2 @ f/1.2, iso 10000, 1/250s)\n\n[cat #2](https://i.imgur.com/y4lstpi.jpg) ^[[fullres](https://i.imgur.com/ozhuqgz.jpg)]\n\nfocus point right eye (i have a shot with the left, and the af worked, but the picture looks weird when the dominant eye isn't in focus). (85mm f/1.2 @ f/1.2, iso 3200, 1/250s)\n\nthe 85mm f/1.2 isn't really that sharp off center wide open, also heavy ca, so take the iq with a grain of salt. this is purely experimental.\n\n[cat #3](https://i.imgur.com/yeo4qb2.jpg) ^[[fullres](https://i.imgur.com/hyqba4w.jpg)]\n\nand here a shot with a flash attached and one of the sharpest canon lenses. ettl works fine. (135mm f/2.0 @ f/3.5, iso 400, 1/200s)\n\nif there are any questions, feel free to ask.", "sortedWord": "None", "identifyer": 32266, "year": "2018"}, {"Unnamed: 0": 285976, "autor": "Its_Obvi_PShopped", "date": 1539075883000, "content": "What would YOU like to see in a tutorial? /!/ Hello r/photography. (Obligatory Sorry mods if this isn't allowed)\n\nI have been a photographer for over 13 years and have worked in just about every facet of photography. From portraits, to weddings, products and fashion, my career has evolved and for the last 6-7 years I've been working as a commercial and advertising photographer for some pretty big brands. \n\nI recently moved to the UK with my family and have kind of hit the reset button a bit. Im continuing to work as a photographer but now I have a bit of freedom to focus on the next biggest thing I love about photography and that's teaching. In this ever flooded sea of youtube tutorials and how to's, I have decided to make the style of tutorial that I would like to see. Slightly different from whats out there because nobody has had the exact career and experiences that I have. \n\nI have been following r/photography for a while and there are a range of people here, from lifelong pros, to new hobbyists but I genuinely believe that everyone can learn a little something new. \n\nI have a list of about 30 different topics to touch on. Some videos being short and to the point photoshop tutorials, to some more in depth walk through type videos. I believe that even if Im touching on a topic that has 1000 other videos about it, perhaps my experience has put me in a position to explain things a little differently and if SOMEONE learns something, then I've accomplished my goal. \n\nIf I were to ask you, r/photography, what you want to see in videos. Whats something you would like to learn that you have yet to find a clear explanation on? I love the idea of a weekly reddit question where I answer in a video and can give a better detailed response with examples. \n\n", "link": "https://www.reddit.com/r/photography/comments/9mnk5z/what_would_you_like_to_see_in_a_tutorial/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what would you like to see in a tutorial? /!/ hello r/photography. (obligatory sorry mods if this isn't allowed)\n\ni have been a photographer for over 13 years and have worked in just about every facet of photography. from portraits, to weddings, products and fashion, my career has evolved and for the last 6-7 years i've been working as a commercial and advertising photographer for some pretty big brands. \n\ni recently moved to the uk with my family and have kind of hit the reset button a bit. im continuing to work as a photographer but now i have a bit of freedom to focus on the next biggest thing i love about photography and that's teaching. in this ever flooded sea of youtube tutorials and how to's, i have decided to make the style of tutorial that i would like to see. slightly different from whats out there because nobody has had the exact career and experiences that i have. \n\ni have been following r/photography for a while and there are a range of people here, from lifelong pros, to new hobbyists but i genuinely believe that everyone can learn a little something new. \n\ni have a list of about 30 different topics to touch on. some videos being short and to the point photoshop tutorials, to some more in depth walk through type videos. i believe that even if im touching on a topic that has 1000 other videos about it, perhaps my experience has put me in a -----> position !!!  to explain things a little differently and if someone learns something, then i've accomplished my goal. \n\nif i were to ask you, r/photography, what you want to see in videos. whats something you would like to learn that you have yet to find a clear explanation on? i love the idea of a weekly reddit question where i answer in a video and can give a better detailed response with examples. \n\n", "sortedWord": "None", "identifyer": 32323, "year": "2018"}, {"Unnamed: 0": 286354, "autor": "Amberstone64", "date": 1539350635000, "content": "Many years after original pic was taken, we had a good friend take updated pics of our sons. Positions swapped in photo, but same head position for each boy. Love these two pics!", "link": "https://www.reddit.com/r/photography/comments/9nk8qo/many_years_after_original_pic_was_taken_we_had_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "many years after original pic was taken, we had a good friend take updated pics of our sons. -----> positions !!!  swapped in photo, but same head position for each boy. love these two pics!", "sortedWord": "None", "identifyer": 32714, "year": "2018"}, {"Unnamed: 0": 286428, "autor": "kieranjackwilson", "date": 1539973728000, "content": "I think I discovered a new technique to emulate a long exposure /!/ A few years back I visited a waterfall in Nebraska in the middle of the fall. The scene was beautiful and begging to be photographed. I pulled out my camera and tripod, but was devastated when I realized I'd left all my filters at home. It was way too bright to shoot a long exposure without an ND, so I went home with a couple nice shots that didn't really show the water's movement.\n\nAbout a year from then, I found a blog post about technique where you substitute multiple stacked images for a single long exposure. [Here's the actual post I am referencing.](https://patdavid.net/2013/09/faking-nd-filter-for-long-exposure.html) The technique was super helpful, and I have used it many times since, however I hadn't shot 40 photographs from the same angle so I was out of luck. It was too little, too late for my waterfall photo.\n\nOr was it?\n\nUsing the Blur, Smudge, and Liquify tools on photoshop, I created around 40 images where the water was edited to be in a slightly different position. I then stacked those images as described in the blog post and was left with this: https://imgur.com/a/hpGjMKO\n\nThe image is solely the result of the process described above. I'm sure I could put more time into the process and add some maskinging and light brush work to further sell the effect, but I think the result is very cool nevertheless.\n\ntl;dr I edited the same photo different way to create motion, then stacked the images to create motion blur", "link": "https://www.reddit.com/r/photography/comments/9pmj8d/i_think_i_discovered_a_new_technique_to_emulate_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think i discovered a new technique to emulate a long exposure /!/ a few years back i visited a waterfall in nebraska in the middle of the fall. the scene was beautiful and begging to be photographed. i pulled out my camera and tripod, but was devastated when i realized i'd left all my filters at home. it was way too bright to shoot a long exposure without an nd, so i went home with a couple nice shots that didn't really show the water's movement.\n\nabout a year from then, i found a blog post about technique where you substitute multiple stacked images for a single long exposure. [here's the actual post i am referencing.](https://patdavid.net/2013/09/faking-nd-filter-for-long-exposure.html) the technique was super helpful, and i have used it many times since, however i hadn't shot 40 photographs from the same angle so i was out of luck. it was too little, too late for my waterfall photo.\n\nor was it?\n\nusing the blur, smudge, and liquify tools on photoshop, i created around 40 images where the water was edited to be in a slightly different -----> position !!! . i then stacked those images as described in the blog post and was left with this: https://imgur.com/a/hpgjmko\n\nthe image is solely the result of the process described above. i'm sure i could put more time into the process and add some maskinging and light brush work to further sell the effect, but i think the result is very cool nevertheless.\n\ntl;dr i edited the same photo different way to create motion, then stacked the images to create motion blur", "sortedWord": "None", "identifyer": 32789, "year": "2018"}, {"Unnamed: 0": 286440, "autor": "Dung3onlord", "date": 1539962671000, "content": "Recommendations portfolio food stylist /!/ Hi everyone i am a professional food photographer/stylist and i am applying for a food styling position at a add agency.\n\nI would like to know how to present my portfolio. Are there tricks, platforms, recommendations to make my portfolio stand out?\n\nI am afraid that just posting the picture of the dishes i styled and photographed would not be enough.\n\n&amp;#x200B;\n\nThanks in advance ", "link": "https://www.reddit.com/r/photography/comments/9pktyu/recommendations_portfolio_food_stylist/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "recommendations portfolio food stylist /!/ hi everyone i am a professional food photographer/stylist and i am applying for a food styling -----> position !!!  at a add agency.\n\ni would like to know how to present my portfolio. are there tricks, platforms, recommendations to make my portfolio stand out?\n\ni am afraid that just posting the picture of the dishes i styled and photographed would not be enough.\n\n&amp;#x200b;\n\nthanks in advance ", "sortedWord": "None", "identifyer": 32801, "year": "2018"}, {"Unnamed: 0": 286448, "autor": "bandiktm", "date": 1539949606000, "content": "D7000 Autofocus problem, help needed /!/ One moment to the other, the autofocus stopped working. Not completely, it turns from one end to the other sometimes, but never to the correct position. This only happens when using normal mode, in live view it funcioning properly. Tried reseting, re-updating firmware, take off the lens, switching the AF-M swtich on the body and the lens.  Any suggestions?", "link": "https://www.reddit.com/r/photography/comments/9pj1yu/d7000_autofocus_problem_help_needed/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d7000 autofocus problem, help needed /!/ one moment to the other, the autofocus stopped working. not completely, it turns from one end to the other sometimes, but never to the correct -----> position !!! . this only happens when using normal mode, in live view it funcioning properly. tried reseting, re-updating firmware, take off the lens, switching the af-m swtich on the body and the lens.  any suggestions?", "sortedWord": "None", "identifyer": 32810, "year": "2018"}, {"Unnamed: 0": 286481, "autor": "burritos-are-life", "date": 1540342476000, "content": "Does anyone know who the photographers are for the new Mojave desktop images? /!/ I just updated my MacBook Pro last night to Mojave and noticed the new dynamic desktop image of the sand dunes, and I realised I may have been there when some of the images were taken. \n\n&amp;#x200B;\n\nI was in Death Valley about six months ago and got up before sunrise one morning to head into the Mesquite Dunes. On the way I ran into a few photographers setting up, told them that I'd closed their car door that they'd left open, and then I continued on. After sunrise I went back and struck up a conversation about what they were up to. The three of them were professional photographers hired by a 'company' but couldn't tell me any more than that, but they had two PhaseOne cameras that they rented and said they had been out there all of yesterday, and were going to be set up there, in the one position, all of that day too.\n\n&amp;#x200B;\n\nOf course I had no idea who they were, or why they were working for, but now that I'm seeing this new desktop I'm REALLY keen to find out who they were.", "link": "https://www.reddit.com/r/photography/comments/9qv020/does_anyone_know_who_the_photographers_are_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "does anyone know who the photographers are for the new mojave desktop images? /!/ i just updated my macbook pro last night to mojave and noticed the new dynamic desktop image of the sand dunes, and i realised i may have been there when some of the images were taken. \n\n&amp;#x200b;\n\ni was in death valley about six months ago and got up before sunrise one morning to head into the mesquite dunes. on the way i ran into a few photographers setting up, told them that i'd closed their car door that they'd left open, and then i continued on. after sunrise i went back and struck up a conversation about what they were up to. the three of them were professional photographers hired by a 'company' but couldn't tell me any more than that, but they had two phaseone cameras that they rented and said they had been out there all of yesterday, and were going to be set up there, in the one -----> position !!! , all of that day too.\n\n&amp;#x200b;\n\nof course i had no idea who they were, or why they were working for, but now that i'm seeing this new desktop i'm really keen to find out who they were.", "sortedWord": "None", "identifyer": 32845, "year": "2018"}, {"Unnamed: 0": 287789, "autor": "trejonw", "date": 1544969388000, "content": "I feel stuck. /!/ I'm sure there are better places to post something like this, but I'm more comfortable sharing with like-minded people.\n\nSo I'm an 18yo photographer, about 6 months out of high school. I'm not going to college and i don't plan to. I currently focus on fashion work but I do lifestyle work, food, event, etc. I'm also a graphic designer. My design portfolio isn't as consistent as my photo one but I've been in the field for about 5 years, so I think it's fair to give myself the title. My currently goals are to get my work published in a fashion magazine (Schon, Dazed, 032c, so on) and host a solo exhibition by next Summer. Long term goal - I want to be creative/art director of a major publication.\n\nMy problem is money. I've been applying to photography/design jobs for the last two months and I'll either get no response or rejected. I'll even follow up on the phone and most of the time some receptionist tells me the person I want to be speaking to is \"in a meeting\". Id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. I try to promote my own photography services but I get no inquiries. Maybe I'm doing it wrong. This industry seems like it's built by and for extroverts and I'm just not that loud. I don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nHas anyone here been in a similar position? How do you stay financially stable while still working toward your photography career? How do you promote yourself? I don't know if I'm allowed to link my website but if someone asks ill be happy to send it over.\n\nI live in Dallas, TX if that helps. Thank you in advance&lt;3\n", "link": "https://www.reddit.com/r/photography/comments/a6p99m/i_feel_stuck/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i feel stuck. /!/ i'm sure there are better places to post something like this, but i'm more comfortable sharing with like-minded people.\n\nso i'm an 18yo photographer, about 6 months out of high school. i'm not going to college and i don't plan to. i currently focus on fashion work but i do lifestyle work, food, event, etc. i'm also a graphic designer. my design portfolio isn't as consistent as my photo one but i've been in the field for about 5 years, so i think it's fair to give myself the title. my currently goals are to get my work published in a fashion magazine (schon, dazed, 032c, so on) and host a solo exhibition by next summer. long term goal - i want to be creative/art director of a major publication.\n\nmy problem is money. i've been applying to photography/design jobs for the last two months and i'll either get no response or rejected. i'll even follow up on the phone and most of the time some receptionist tells me the person i want to be speaking to is \"in a meeting\". id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. i try to promote my own photography services but i get no inquiries. maybe i'm doing it wrong. this industry seems like it's built by and for extroverts and i'm just not that loud. i don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nhas anyone here been in a similar -----> position !!! ? how do you stay financially stable while still working toward your photography career? how do you promote yourself? i don't know if i'm allowed to link my website but if someone asks ill be happy to send it over.\n\ni live in dallas, tx if that helps. thank you in advance&lt;3\n", "sortedWord": "None", "identifyer": 34197, "year": "2018"}, {"Unnamed: 0": 288039, "autor": "Xune531", "date": 1543414277000, "content": "Tips for math behind mat board cutting? /!/ My neighbor just gave me his Logan Mat-cutting board. I'm looking for any tips or suggestions on how to make the math side of cutting easiest. I've been printing with my own printer for about a year now, and I mostly just use the pre-made mats that come with the frames from Michales. I print the photo to a size smaller than whatever the mats window is, and then just sort of wing it. My simplified workflow is usually as follows:  \n\n\n1. In Lightroom, set the crop of the photo to be the same ratio as the paper I would like to print on (2x3, 8.5x11, or 13x19 is usually what I print on).\n2. Export to Canon PrintStudio\n3. Do patterned prints for color and contrast\n4. After selecting settings, select paper size I want to print on and have the photo be \"centered\"\n5. Play around with the border sliders until I get as close to even on all sides as possible while staying under the pre-made mat's window size. \n6. Print\n7. place the photo in the mat, taping the photo to the mat on the back. (I know this might make some of you scream, I'm going to buy photo corners I swear!).\n8. Insert the mat+photo into the frame.\n\n&amp;#x200B;\n\nAs you can see, I'm not really planning out the mat size or the photo size in relation to the mat precisely at all. I sort of just do it and position it in a way that works. I would much rather be planning things out.   \n\n\n&amp;#x200B;\n\nI've found a few online calculators, but it still seems a bit difficult to get the mat right. Is it easier to choose your print crop/size based of the frame, and then make the mat match the frames ratio?", "link": "https://www.reddit.com/r/photography/comments/a16j12/tips_for_math_behind_mat_board_cutting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "tips for math behind mat board cutting? /!/ my neighbor just gave me his logan mat-cutting board. i'm looking for any tips or suggestions on how to make the math side of cutting easiest. i've been printing with my own printer for about a year now, and i mostly just use the pre-made mats that come with the frames from michales. i print the photo to a size smaller than whatever the mats window is, and then just sort of wing it. my simplified workflow is usually as follows:  \n\n\n1. in lightroom, set the crop of the photo to be the same ratio as the paper i would like to print on (2x3, 8.5x11, or 13x19 is usually what i print on).\n2. export to canon printstudio\n3. do patterned prints for color and contrast\n4. after selecting settings, select paper size i want to print on and have the photo be \"centered\"\n5. play around with the border sliders until i get as close to even on all sides as possible while staying under the pre-made mat's window size. \n6. print\n7. place the photo in the mat, taping the photo to the mat on the back. (i know this might make some of you scream, i'm going to buy photo corners i swear!).\n8. insert the mat+photo into the frame.\n\n&amp;#x200b;\n\nas you can see, i'm not really planning out the mat size or the photo size in relation to the mat precisely at all. i sort of just do it and -----> position !!!  it in a way that works. i would much rather be planning things out.   \n\n\n&amp;#x200b;\n\ni've found a few online calculators, but it still seems a bit difficult to get the mat right. is it easier to choose your print crop/size based of the frame, and then make the mat match the frames ratio?", "sortedWord": "None", "identifyer": 34461, "year": "2018"}, {"Unnamed: 0": 288646, "autor": "russellalboroto", "date": 1517951472000, "content": "I interviewed a person who stole my photos /!/ K, long story ahead...\n\n\nA few months ago a girl came in to apply for a social media position at my last job. I was one of three photographers at the company and we had an opening for another photographer position. She mentioned to the HR recruiter that she also does photography. The HR guy comes and grabs me to tell me this and was wondering if I wanted to interview her for the open photographer position as well. So I said, \"Sure, let me see her portfolio.\"\n\n\nTo my f*$#@ing surprise my work was included her \"portfolio\". I was in total shock and told the HR guy that she has stolen work on her portfolio. She had an engagement session and the couples same wedding on her website with very low-res photos. I took a few minutes to compose myself and decided to interview and ask about her work without \"outing\" her. I went into the interview with the HR guy and I asked her about her experience and what kind of gear she uses. She BS'd everything saying, \"I have one of the \"D\" cameras, 7 lenses, a wide, a zoom, and super-zoom. I have it all.\"\n\n\nI even double checked and asked her, \"so you shot all these photos in your portfolio?\" She answered, \"Yeah! Don't they look good? I like them.\" She lied straight to my face.\n\n\nAt this point, I still haven't revealed myself and I didn't plan to. I wish I did though. The HR guy said it would be better if you emailed her or called her. Pretty much the whole company knew what was going on and was shocked about the story. What were the odds? What are the chances of my photo stealer coming to apply for a job and I happened to interview her?\n\n\nA few days later I called her up telling her,\n\n\nMe: \"Hey, we decided not to offer you the position because you have stolen work on your website.\"\n\n\nPhoto thief: \"I don't believe so.\"\n\n\nMe: \"Yeah you do! Those are my f*$#ing photos on my website and you need to take that s$#% down!\"\n\n\nPhoto thief: \"Ok\" (Hangs up)\n\n\nI contacted the couple who were in the stolen photos and apparently she knows the girl. She stole all the photos off their wedding album on Facebook and we all had a good laugh out of it.\n\n\nAnyways, I guess I'm flattered. Those photos weren't even my best work. If she was going to steal some, she should've stolen my best stuff. She took down her website a day later but I do have her social media accounts under close surveillance.\n\n\nEdit: Removed her Instagram link and website photos.", "link": "https://www.reddit.com/r/photography/comments/7vqnb5/i_interviewed_a_person_who_stole_my_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i interviewed a person who stole my photos /!/ k, long story ahead...\n\n\na few months ago a girl came in to apply for a social media -----> position !!!  at my last job. i was one of three photographers at the company and we had an opening for another photographer position. she mentioned to the hr recruiter that she also does photography. the hr guy comes and grabs me to tell me this and was wondering if i wanted to interview her for the open photographer position as well. so i said, \"sure, let me see her portfolio.\"\n\n\nto my f*$#@ing surprise my work was included her \"portfolio\". i was in total shock and told the hr guy that she has stolen work on her portfolio. she had an engagement session and the couples same wedding on her website with very low-res photos. i took a few minutes to compose myself and decided to interview and ask about her work without \"outing\" her. i went into the interview with the hr guy and i asked her about her experience and what kind of gear she uses. she bs'd everything saying, \"i have one of the \"d\" cameras, 7 lenses, a wide, a zoom, and super-zoom. i have it all.\"\n\n\ni even double checked and asked her, \"so you shot all these photos in your portfolio?\" she answered, \"yeah! don't they look good? i like them.\" she lied straight to my face.\n\n\nat this point, i still haven't revealed myself and i didn't plan to. i wish i did though. the hr guy said it would be better if you emailed her or called her. pretty much the whole company knew what was going on and was shocked about the story. what were the odds? what are the chances of my photo stealer coming to apply for a job and i happened to interview her?\n\n\na few days later i called her up telling her,\n\n\nme: \"hey, we decided not to offer you the position because you have stolen work on your website.\"\n\n\nphoto thief: \"i don't believe so.\"\n\n\nme: \"yeah you do! those are my f*$#ing photos on my website and you need to take that s$#% down!\"\n\n\nphoto thief: \"ok\" (hangs up)\n\n\ni contacted the couple who were in the stolen photos and apparently she knows the girl. she stole all the photos off their wedding album on facebook and we all had a good laugh out of it.\n\n\nanyways, i guess i'm flattered. those photos weren't even my best work. if she was going to steal some, she should've stolen my best stuff. she took down her website a day later but i do have her social media accounts under close surveillance.\n\n\nedit: removed her instagram link and website photos.", "sortedWord": "None", "identifyer": 35099, "year": "2018"}, {"Unnamed: 0": 289592, "autor": "gregknudson", "date": 1531965380000, "content": "Seeking recommendations on gear/suspension for jewelry photography /!/ Hello! I have a pretty good grasp on studio lighting, and lighting setups, but I was wondering what some of you would recommend in terms of equipment for jewellery photography - website/catalogue images in particular, so mostly white background\n\nWhat sort of combination of lights, modifiers, and backdrops would you get (extra awesome if they are multi-purpose and work well for portraits also). I am also interested in which mounts and suspensions are used to keep consistent positions of the jewelry items, so they can freeze the the items in place for a perfect side view/front view/etc across multiple images.  \n\n\nThank you for any suggestions!", "link": "https://www.reddit.com/r/photography/comments/901mh6/seeking_recommendations_on_gearsuspension_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "seeking recommendations on gear/suspension for jewelry photography /!/ hello! i have a pretty good grasp on studio lighting, and lighting setups, but i was wondering what some of you would recommend in terms of equipment for jewellery photography - website/catalogue images in particular, so mostly white background\n\nwhat sort of combination of lights, modifiers, and backdrops would you get (extra awesome if they are multi-purpose and work well for portraits also). i am also interested in which mounts and suspensions are used to keep consistent -----> positions !!!  of the jewelry items, so they can freeze the the items in place for a perfect side view/front view/etc across multiple images.  \n\n\nthank you for any suggestions!", "sortedWord": "None", "identifyer": 36077, "year": "2018"}, {"Unnamed: 0": 289647, "autor": "Rickjameswon", "date": 1532301045000, "content": "learn more about photography /!/ i want to learn more about photography. Of course i know the basics of taking a great shot like the light, position, and ect; but i want to know more beyond the basics. i want to know everyone's tips and tricks in their opinion on how they think on  how taking a splendid shot ", "link": "https://www.reddit.com/r/photography/comments/911ylk/learn_more_about_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "learn more about photography /!/ i want to learn more about photography. of course i know the basics of taking a great shot like the light, -----> position !!! , and ect; but i want to know more beyond the basics. i want to know everyone's tips and tricks in their opinion on how they think on  how taking a splendid shot ", "sortedWord": "None", "identifyer": 36137, "year": "2018"}, {"Unnamed: 0": 289693, "autor": "pm_me_ur_photography", "date": 1534366963000, "content": "Are you a socially anxious photographer? Don't just stick to landscapes &amp; street photography, try portraits /!/ (this is my attempt at contributing good content to this subreddit; i've enjoyed the newer more lax rules on what posts are allowed but there's way too many gear posts on the front page) \n\nSo i've seen time and time again, particularly on this subreddit, \"what type of photography do you do\" posts. And, time and time again, I see the [\"I'm antisocial so I stay away from portraits\"](https://www.reddit.com/r/photography/comments/92paod/why_do_you_prefer_your_genre_of_photography_over/e37e3zy/ comment. It makes sense: why put yourself in the position to be social if it's not your forte? But from one photographer who has struggled with social anxiety to another, you'd be surprised at how much it can change your perspective. I've outlined a few benefits for this point to hopefully encourage someone who's afraid to try it:\n\n* **Portrait photography helps you connect with people on a non-superficial level\n\nWhile you're shooting, the nature of creating art with someone offers the chance to have meaningful conversations and connections beyond simple small talk. Some of the most interesting people I've met, I've met by shooting them. Building rapport becomes a lot easier when you're trying to get someone to laugh for a photo. Thanks to portrait photography I've grown to appreciate people's differences and idiosyncrasies a lot more. \n\n* **You control the pace of the engagement**\n\nOne of the scary things for me about social settings is the fear of being put in uncomfortable positions where I'm not sure how to act or respond. With portrait photography, typically the model is looking to you for direction and will frequently match your energy. This is one of the few social opportunities you get where you can dictate the pace and flow of the interaction. If you're looking to learn to get out and be more comfortable with talking to people ,this is the perfect place to practice\n\n* **It's very rewarding**\n\nIf you become good at it, there's few greater feelings than showing someone a photo that allows them to see themselves in a better light than before. The jaw drops and wow's you receive from showing someone an unedited photo on the back of you camera releases a hell of an amount of endorphins, plus earn the respect of those around you. \n\nPortrait photography isn't for everyone, but I'd urge anyone who's staying away from it to try it sometime. True, you may encounter some people who aren't the most pleasant to be around and thus may not get the advantage of some of the things I listed above, but maybe brushing off people you don't like is a valid lesson in itself. I think everyone should try portrait photography to some degree", "link": "https://www.reddit.com/r/photography/comments/97m0tj/are_you_a_socially_anxious_photographer_dont_just/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "are you a socially anxious photographer? don't just stick to landscapes &amp; street photography, try portraits /!/ (this is my attempt at contributing good content to this subreddit; i've enjoyed the newer more lax rules on what posts are allowed but there's way too many gear posts on the front page) \n\nso i've seen time and time again, particularly on this subreddit, \"what type of photography do you do\" posts. and, time and time again, i see the [\"i'm antisocial so i stay away from portraits\"](https://www.reddit.com/r/photography/comments/92paod/why_do_you_prefer_your_genre_of_photography_over/e37e3zy/ comment. it makes sense: why put yourself in the -----> position !!!  to be social if it's not your forte? but from one photographer who has struggled with social anxiety to another, you'd be surprised at how much it can change your perspective. i've outlined a few benefits for this point to hopefully encourage someone who's afraid to try it:\n\n* **portrait photography helps you connect with people on a non-superficial level\n\nwhile you're shooting, the nature of creating art with someone offers the chance to have meaningful conversations and connections beyond simple small talk. some of the most interesting people i've met, i've met by shooting them. building rapport becomes a lot easier when you're trying to get someone to laugh for a photo. thanks to portrait photography i've grown to appreciate people's differences and idiosyncrasies a lot more. \n\n* **you control the pace of the engagement**\n\none of the scary things for me about social settings is the fear of being put in uncomfortable positions where i'm not sure how to act or respond. with portrait photography, typically the model is looking to you for direction and will frequently match your energy. this is one of the few social opportunities you get where you can dictate the pace and flow of the interaction. if you're looking to learn to get out and be more comfortable with talking to people ,this is the perfect place to practice\n\n* **it's very rewarding**\n\nif you become good at it, there's few greater feelings than showing someone a photo that allows them to see themselves in a better light than before. the jaw drops and wow's you receive from showing someone an unedited photo on the back of you camera releases a hell of an amount of endorphins, plus earn the respect of those around you. \n\nportrait photography isn't for everyone, but i'd urge anyone who's staying away from it to try it sometime. true, you may encounter some people who aren't the most pleasant to be around and thus may not get the advantage of some of the things i listed above, but maybe brushing off people you don't like is a valid lesson in itself. i think everyone should try portrait photography to some degree", "sortedWord": "None", "identifyer": 36184, "year": "2018"}, {"Unnamed: 0": 289972, "autor": "Epell8", "date": 1537060363000, "content": "Best Light Box for Food Photography /!/ I am a hobby instagram foodie and want a simple, easy to use light box to keep my photos looking consistent. I am looking for a natural light setting. I've tried to make my own but I am not handy and am in the financial position to purchase one. If anyone has any experience or opinion, please include links.\n\nI'd like it to be portable and mostly one piece. ", "link": "https://www.reddit.com/r/photography/comments/9g6pe2/best_light_box_for_food_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best light box for food photography /!/ i am a hobby instagram foodie and want a simple, easy to use light box to keep my photos looking consistent. i am looking for a natural light setting. i've tried to make my own but i am not handy and am in the financial -----> position !!!  to purchase one. if anyone has any experience or opinion, please include links.\n\ni'd like it to be portable and mostly one piece. ", "sortedWord": "None", "identifyer": 36470, "year": "2018"}, {"Unnamed: 0": 290038, "autor": "bricker_152", "date": 1536157912000, "content": "Advice on repairing a lens - Helios 28 f/2.8 /!/ Hi, I don't know where to post this so I'll just put it here in hopes that someone knows what to do. I have an old lens, Helios 28mm 2.8 (it's an m42 screw mount). The aperture stopped working (the ring spins, but doesn't adjust the iris), so I decided to open it up and try to repair it. I think I figured out the problem. There was a spring loose (see the pictures), that pulls the aperture blades in the closed position as you move the ring. The problem is, I don't know where is that spring supposed to be hooked up. I've searched the internet all over, but haven't found a single useful information. I've attached some photos, to try and show you how the thing works and what I think is the problem. I hope some of you will be able to help me. \n\nThank you!\n\n&amp;#x200B;\n\nphotos: [https://imgur.com/a/r58JCEz](https://imgur.com/a/r58JCEz)", "link": "https://www.reddit.com/r/photography/comments/9d73c6/advice_on_repairing_a_lens_helios_28_f28/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice on repairing a lens - helios 28 f/2.8 /!/ hi, i don't know where to post this so i'll just put it here in hopes that someone knows what to do. i have an old lens, helios 28mm 2.8 (it's an m42 screw mount). the aperture stopped working (the ring spins, but doesn't adjust the iris), so i decided to open it up and try to repair it. i think i figured out the problem. there was a spring loose (see the pictures), that pulls the aperture blades in the closed -----> position !!!  as you move the ring. the problem is, i don't know where is that spring supposed to be hooked up. i've searched the internet all over, but haven't found a single useful information. i've attached some photos, to try and show you how the thing works and what i think is the problem. i hope some of you will be able to help me. \n\nthank you!\n\n&amp;#x200b;\n\nphotos: [https://imgur.com/a/r58jcez](https://imgur.com/a/r58jcez)", "sortedWord": "None", "identifyer": 36540, "year": "2018"}, {"Unnamed: 0": 290260, "autor": "fruchle", "date": 1539048702000, "content": "Camera for video? My requirements are making this difficult. /!/ Gear help! I'm in a position where I need to start looking into getting a camera that takes amazing video.\n\nIt needs to have focus tracking, which means my Canon 5D m3 (which I love and have already invested a lot of glass in), is next to useless. So, I'm looking at selling and starting over. Possibly. Or selling some of it at least.\n\nI've been considering going as small as the Canon G7X m2 (though I hope the m3 is coming out soon?) or Sony RX100 m5A (I'm not a fan of the lens on the m6). (In these instances I could keep my 5D)\n\nOr going full on with a small full-frame to properly replace my 5D. That means a Sony A7R m3, or Nikon Z7. (The Canon EOS R doesn't look anywhere near as good as those two, but I could be wrong?) I've read a lot about these, seen the reviews, but have heard a lot of mixed reports that has made it hard to separate the wheat from the chaff.\n\nA few considerations for me:\n\n* No, I definitely do not want to look at dedicated video systems.\n* Size is a factor - the smaller the better.\n* I need access to both wide angle (16mm-28mm) and macro.\n* I'm an underwater photographer, and that means I'm limited by housings, which means my lens selections are also a bit limited. (Can be hard to impossible to use some 3rd party lenses, for example. Primes usually don't matter, since I won't need zoom or focus controls*.) For some of the latest Cameras housings aren't out yet, but will be soon/eventually.\n\n*as long as I can focus lock\n\nAre there other cameras I've missed? Is something coming out in the coming year I should keep my eye on?", "link": "https://www.reddit.com/r/photography/comments/9mkwgm/camera_for_video_my_requirements_are_making_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera for video? my requirements are making this difficult. /!/ gear help! i'm in a -----> position !!!  where i need to start looking into getting a camera that takes amazing video.\n\nit needs to have focus tracking, which means my canon 5d m3 (which i love and have already invested a lot of glass in), is next to useless. so, i'm looking at selling and starting over. possibly. or selling some of it at least.\n\ni've been considering going as small as the canon g7x m2 (though i hope the m3 is coming out soon?) or sony rx100 m5a (i'm not a fan of the lens on the m6). (in these instances i could keep my 5d)\n\nor going full on with a small full-frame to properly replace my 5d. that means a sony a7r m3, or nikon z7. (the canon eos r doesn't look anywhere near as good as those two, but i could be wrong?) i've read a lot about these, seen the reviews, but have heard a lot of mixed reports that has made it hard to separate the wheat from the chaff.\n\na few considerations for me:\n\n* no, i definitely do not want to look at dedicated video systems.\n* size is a factor - the smaller the better.\n* i need access to both wide angle (16mm-28mm) and macro.\n* i'm an underwater photographer, and that means i'm limited by housings, which means my lens selections are also a bit limited. (can be hard to impossible to use some 3rd party lenses, for example. primes usually don't matter, since i won't need zoom or focus controls*.) for some of the latest cameras housings aren't out yet, but will be soon/eventually.\n\n*as long as i can focus lock\n\nare there other cameras i've missed? is something coming out in the coming year i should keep my eye on?", "sortedWord": "None", "identifyer": 36773, "year": "2018"}, {"Unnamed: 0": 290388, "autor": "Amberstone64", "date": 1539868714000, "content": "Same boys, swapped positions in the newer photo but head position for each son very similar. Purely by accident. A friend of ours took the new ones", "link": "https://www.reddit.com/r/photography/comments/9p96nk/same_boys_swapped_positions_in_the_newer_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "same boys, swapped -----> positions !!!  in the newer photo but head position for each son very similar. purely by accident. a friend of ours took the new ones", "sortedWord": "None", "identifyer": 36910, "year": "2018"}, {"Unnamed: 0": 290514, "autor": "richieinvest", "date": 1540586937000, "content": "What are the apps through which you can hire the best creative professionals, can you give some suggestions? /!/ I’m the Head Designer of an innovative shoe design company that’s been in market for about 3 years and we’ve been doing quite well so far. From time to time, we need to hire new talent for either freelance or full-time positions as we need assistance with our new projects. We normally use platforms such as Wayup or Indeed to find creatives but finding the right candidates for our projects was always not an easy task. When we go for hiring, we normally prefer getting people who already have some level of experience working in a fashion industry since our company is not a large company and the input of every person counts a lot.\n\nThe platforms we have used to find talents were not that effective for our industry and we were aware of that from the beginning. Recently I’ve come across a marketplace called [mixer.app](http://mixer.app/) and I’ve decided to give it a shot. The platform claims to help creative professionals to connect with the right people, recruit talents and even find a job. After using it, we've found that the creative professionals of Mixer on average had a much higher level of professionalism which was incomparable to the other platforms we’ve used previously. The app is not limited to design creatives, you are also able to hire anything going from musicians, film professionals, to arts and fashion professionals. I’m writing this post to see if anyone here has used similar apps or tools and could share their knowledge and experience on that. I would really appreciate hearing from you as I would like to explore other options as well🙌", "link": "https://www.reddit.com/r/photography/comments/9rohpp/what_are_the_apps_through_which_you_can_hire_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "what are the apps through which you can hire the best creative professionals, can you give some suggestions? /!/ i’m the head designer of an innovative shoe design company that’s been in market for about 3 years and we’ve been doing quite well so far. from time to time, we need to hire new talent for either freelance or full-time -----> positions !!!  as we need assistance with our new projects. we normally use platforms such as wayup or indeed to find creatives but finding the right candidates for our projects was always not an easy task. when we go for hiring, we normally prefer getting people who already have some level of experience working in a fashion industry since our company is not a large company and the input of every person counts a lot.\n\nthe platforms we have used to find talents were not that effective for our industry and we were aware of that from the beginning. recently i’ve come across a marketplace called [mixer.app](http://mixer.app/) and i’ve decided to give it a shot. the platform claims to help creative professionals to connect with the right people, recruit talents and even find a job. after using it, we've found that the creative professionals of mixer on average had a much higher level of professionalism which was incomparable to the other platforms we’ve used previously. the app is not limited to design creatives, you are also able to hire anything going from musicians, film professionals, to arts and fashion professionals. i’m writing this post to see if anyone here has used similar apps or tools and could share their knowledge and experience on that. i would really appreciate hearing from you as i would like to explore other options as well🙌", "sortedWord": "None", "identifyer": 37041, "year": "2018"}, {"Unnamed: 0": 291105, "autor": "guitarist89", "date": 1544551639000, "content": "getting back into fashion/portrait photography, anxious and in need of advice. /!/ i'd established myself as a fashion/portrait photographer in my city some years back, but eventually had enough of the industry and had to leave. i still get weekly updates from all the agencies and regularly have magazine editors and brand creative directors ask if i'd shoot for them, but i had no interest up until now. i'm suddenly feeling an influx of inspiration as i used to back when i got excited about my work, so i'm trying to act on it and organize something quickly, but at the same time a horrible anxiety comes over me... thinking what if i'm not the shooter i once used to be? what if i can't shoot at all anymore? what if everyone on set notices i'm rusty? what if, what if, what if... i used to do this professionally full-time at quite a high level... sets with up to 40 people sometimes. and it was that everything-is-riding-on-this attitude of everyone on set that made me hate it. they made this vapid and frivolous thing seem like it meant everything. i used to laugh at the ridiculousness of it sometimes. but now i long to get back into it- only to make nice images, not for anything else which is associated to working in the fashion industry. i don't care about the ritzy events and fake personas. \n\ni used to shoot mainly with nikon, my last one being a d800 which has served me well and still works, though is certainly on its hind legs as i've shot many more frames with it than it's rated for... also shot medium and large format... mamiya r67 pro ii and sinar f1. truthfully, i adore the film aesthetic and don't care what anyone says- there's \\*no\\* way to replicate it in post... but i don't miss the process and heavy gear. so i think i'll just stick to digital for now and likely go with the d850. actually that's what i wanted your advice on: how do you feel a used hasselblad h3d would compare to the d850? people seem too focused on megapixels these days and forget that there's more than that to picture quality. a medium format sensor with 30mp will produce a different image to a 45mp full frame sensor. i'm a single focus point kind of guy so the hassy system would be more than adequate for me. i'm just wondering what to expect from it. the hassy is now several years old and will run the same for a used system as a new d850 with lens would, more or less. \n\nalso, lighting... what are the popular lighting brands now? i don't need battery packs, mono heads are good for me. i tend to prefer big softboxes and octa's, but would like to try a para as well this time around. and have some options for harsh direct lighting. \n\ni'm nervous, but excited. very anxious. it all seems so foreign to me. anyone else been in this position? ", "link": "https://www.reddit.com/r/photography/comments/a599ia/getting_back_into_fashionportrait_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "getting back into fashion/portrait photography, anxious and in need of advice. /!/ i'd established myself as a fashion/portrait photographer in my city some years back, but eventually had enough of the industry and had to leave. i still get weekly updates from all the agencies and regularly have magazine editors and brand creative directors ask if i'd shoot for them, but i had no interest up until now. i'm suddenly feeling an influx of inspiration as i used to back when i got excited about my work, so i'm trying to act on it and organize something quickly, but at the same time a horrible anxiety comes over me... thinking what if i'm not the shooter i once used to be? what if i can't shoot at all anymore? what if everyone on set notices i'm rusty? what if, what if, what if... i used to do this professionally full-time at quite a high level... sets with up to 40 people sometimes. and it was that everything-is-riding-on-this attitude of everyone on set that made me hate it. they made this vapid and frivolous thing seem like it meant everything. i used to laugh at the ridiculousness of it sometimes. but now i long to get back into it- only to make nice images, not for anything else which is associated to working in the fashion industry. i don't care about the ritzy events and fake personas. \n\ni used to shoot mainly with nikon, my last one being a d800 which has served me well and still works, though is certainly on its hind legs as i've shot many more frames with it than it's rated for... also shot medium and large format... mamiya r67 pro ii and sinar f1. truthfully, i adore the film aesthetic and don't care what anyone says- there's \\*no\\* way to replicate it in post... but i don't miss the process and heavy gear. so i think i'll just stick to digital for now and likely go with the d850. actually that's what i wanted your advice on: how do you feel a used hasselblad h3d would compare to the d850? people seem too focused on megapixels these days and forget that there's more than that to picture quality. a medium format sensor with 30mp will produce a different image to a 45mp full frame sensor. i'm a single focus point kind of guy so the hassy system would be more than adequate for me. i'm just wondering what to expect from it. the hassy is now several years old and will run the same for a used system as a new d850 with lens would, more or less. \n\nalso, lighting... what are the popular lighting brands now? i don't need battery packs, mono heads are good for me. i tend to prefer big softboxes and octa's, but would like to try a para as well this time around. and have some options for harsh direct lighting. \n\ni'm nervous, but excited. very anxious. it all seems so foreign to me. anyone else been in this -----> position !!! ? ", "sortedWord": "None", "identifyer": 37648, "year": "2018"}], "name": "positionphotography2018"}