{"interestingcomments": [{"autor": "Sauce_Money", "date": "2020-03-13 12:11:09", "content": "Battery Cases /!/ I 3D printed some battery covers to show if they are full or dead", "link": "https://www.reddit.com/r/photography/comments/fhynpc/battery_cases/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "battery cases /!/ i -----> 3d !!!  -----> printed !!!  some battery covers to show if they are full or dead", "sortedWord": "None", "Identifyer": null, "identifyer": 59136, "year": "2020"}, {"autor": "Sauce_Money", "date": "2020-03-13 03:57:58", "content": "Check out these 3D printed battery cases I made!", "link": "https://www.reddit.com/r/photography/comments/fhto9p/check_out_these_3d_printed_battery_cases_i_made/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "check out these -----> 3d !!!  -----> printed !!!  battery cases i made!", "sortedWord": "None", "Identifyer": null, "identifyer": 59159, "year": "2020"}, {"autor": "Al-Minnich", "date": "2020-05-15 00:54:49", "content": "3D Print", "link": "https://www.reddit.com/r/photography/comments/gjz7ud/3d_print/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> print !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 63530, "year": "2020"}, {"autor": "LookDifferent", "date": "2020-11-12 01:48:28", "content": "Making the quick magnetic snap camera filter | 3D Print", "link": "https://www.reddit.com/r/photography/comments/jsln17/making_the_quick_magnetic_snap_camera_filter_3d/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "making the quick magnetic snap camera filter | -----> 3d !!!  -----> print !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 66007, "year": "2020"}, {"autor": "rthorntn", "date": "2020-05-18 09:50:28", "content": "Repairing Manfrotto tripods /!/ Hi,\n\nI have a 785B it's a nice little tripod, two of the smallest plastic flip locks have snapped, has anyone got a good fix for this, I'd hate to throw a decent tripod in the bin because two of it's twelve locks had snapped, it looks like the fracture is a \"feature\"?\n\nI'm wondering if the lock can be removed and replaced by a 3D printed one, or maybe I could pin just the bottom legs extended and do away with bottom locks?\n\nThanks.\n\nRichard", "link": "https://www.reddit.com/r/photography/comments/glyjl9/repairing_manfrotto_tripods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "repairing manfrotto tripods /!/ hi,\n\ni have a 785b it's a nice little tripod, two of the smallest plastic flip locks have snapped, has anyone got a good fix for this, i'd hate to throw a decent tripod in the bin because two of it's twelve locks had snapped, it looks like the fracture is a \"feature\"?\n\ni'm wondering if the lock can be removed and replaced by a -----> 3d !!!  -----> printed !!!  one, or maybe i could pin just the bottom legs extended and do away with bottom locks?\n\nthanks.\n\nrichard", "sortedWord": "None", "Identifyer": null, "identifyer": 69186, "year": "2020"}, {"autor": "anthemfornostate_pt1", "date": "2020-06-05 20:55:55", "content": "3D Printed/Created a Wireless Trigger for my Mamiya RB67 using an Arduino Uno /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gxcwd6/3d_printedcreated_a_wireless_trigger_for_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!! /created a wireless trigger for my mamiya rb67 using an arduino uno /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 69566, "year": "2020"}, {"autor": "Splaschko", "date": "2020-11-01 09:30:13", "content": "I 3D printed a picture I took", "link": "https://www.reddit.com/r/photography/comments/jlzmcv/i_3d_printed_a_picture_i_took/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i -----> 3d !!!  -----> printed !!!  a picture i took", "sortedWord": "None", "Identifyer": null, "identifyer": 73670, "year": "2020"}, {"autor": "totoagrafie", "date": "2020-05-16 07:01:42", "content": "3D printed photography gadgets /!/ Since 3D printers are becoming more common and less cheap, are there any 3D printed gadgets/accessories you actively use for your photography?", "link": "https://www.reddit.com/r/photography/comments/gkqcvr/3d_printed_photography_gadgets/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  photography gadgets /!/ since 3d printers are becoming more common and less cheap, are there any 3d printed gadgets/accessories you actively use for your photography?", "sortedWord": "None", "Identifyer": null, "identifyer": 79499, "year": "2020"}, {"autor": "gntrr", "date": "2020-05-15 21:15:51", "content": "Have anyone used custom 3d print services to 3d print a grip for your camera? /!/ I have a kind of obscure soviet medium format camera I want to make a grip for but don't have a 3d printer nor do I know how to work a 3d modeling program. Does anyone have any recommendations on people or shops that do work like this?", "link": "https://www.reddit.com/r/photography/comments/gkhp76/have_anyone_used_custom_3d_print_services_to_3d/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "have anyone used custom -----> 3d !!!  -----> print !!!  services to -----> 3d !!!  -----> print !!!  a grip for your camera? /!/ i have a kind of obscure soviet medium format camera i want to make a grip for but don't have a 3d printer nor do i know how to work a 3d modeling program. does anyone have any recommendations on people or shops that do work like this?", "sortedWord": "None", "Identifyer": null, "identifyer": 79536, "year": "2020"}, {"autor": "CertainExposures", "date": "2020-07-14 02:37:04", "content": "I took these photographs on a 3D printed camera without a viewfinder...or an LCD screen. It also doesn't use any batteries. Basically, the perfect apocalypse camera if things go even further south in 2020.", "link": "https://www.reddit.com/r/photography/comments/hqt9xi/i_took_these_photographs_on_a_3d_printed_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i took these photographs on a -----> 3d !!!  -----> printed !!!  camera without a viewfinder...or an lcd screen. it also doesn't use any batteries. basically, the perfect apocalypse camera if things go even further south in 2020.", "sortedWord": "None", "Identifyer": null, "identifyer": 81356, "year": "2020"}, {"autor": "printring", "date": "2020-06-25 12:53:20", "content": "3d printed portrait from photo", "link": "https://www.reddit.com/r/photography/comments/hflkc0/3d_printed_portrait_from_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  portrait from photo", "sortedWord": "None", "Identifyer": null, "identifyer": 81397, "year": "2020"}, {"autor": "taystim", "date": "2020-09-06 22:29:59", "content": "Product Photographers: Show off your favorite stands, risers, and platforms! /!/ Do you 3D print? Have your own woodworking shop for custom shapes like [these](https://mir-s3-cdn-cf.behance.net/project_modules/max_1200/d7795580976487.5cf0a3795da36.jpg)? Cast your own concrete ones? Buy premade? I just bought some funky shapes from [Moodelier](https://www.moodelier.com/shop) and I'm itching for more.\n\nWould love to know how this community approaches all their variable-height display needs!", "link": "https://www.reddit.com/r/photography/comments/invgy6/product_photographers_show_off_your_favorite/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "product photographers: show off your favorite stands, risers, and platforms! /!/ do you -----> 3d !!!  -----> print !!! ? have your own woodworking shop for custom shapes like [these](https://mir-s3-cdn-cf.behance.net/project_modules/max_1200/d7795580976487.5cf0a3795da36.jpg)? cast your own concrete ones? buy premade? i just bought some funky shapes from [moodelier](https://www.moodelier.com/shop) and i'm itching for more.\n\nwould love to know how this community approaches all their variable-height display needs!", "sortedWord": "None", "Identifyer": null, "identifyer": 83155, "year": "2020"}, {"autor": "Whomstevest", "date": "2020-10-12 12:50:06", "content": "3d printed Canon RF to Canon EF Tilt adapter /!/ &amp;#x200B;\n\nhttps://preview.redd.it/k5z9czhcuns51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=40f765b2bd57aa0e170eff593edd2d365b5f7c42\n\n[STLs here](https://www.thingiverse.com/thing:4621718)\n\n[My previous adapters here](https://www.reddit.com/r/photography/comments/f0r089/3d_printed_tilt_adapters/)\n\n[Post with more pictures](https://www.reddit.com/r/functionalprint/comments/j9q2wq/3d_printed_canon_rf_to_ef_tilt_adapter_info_in/)\n\nThis is a fully 3d printed canon RF to canon EF adapter with infinity focus, 7 degrees of tilt and 180 degrees of rotation. Always hold the lens when using it, just in case.\n\nIt was printed with black abs on an UP! mini, with a layer height of 0.2mm and lots of support. Other material should work fine, but it should be black to avoid a color cast.\n\nThe adapter has no electrical connection, so you won't be able to change focus when using a focus by wire lens (If the focus ring doesn't do anything when the camera is turned off, the lens is focus by wire), or change the aperture when using any EF lens. You can set your desired aperture beforehand however, using [this technique,](https://www.youtube.com/watch?v=y1ZuK_dDweg) which will also work using an RF camera with the canon adapter.\n\nLens hoods that aren't circular may crop the corners when the lens is rotated 90 degrees. Some lenses that are rectangular at the back (such as the 24-105 f4L) may also crop corners when rotated 90 degrees\n\n[DOF visualization/calculator for this adapter](https://www.geogebra.org/classic/xs64kyhm) (works best on desktop). This is a tool i made to visualize how tilt affects the depth of field. It is setup by default to show a top down view of a 50mm lens at f2.8, tilted at 7 degrees, focused at 1 meter and on a full frame sensor. Move the sliders around to see how different lenses, apertures and tilt angles change the depth of field. It will also work for other adapters and tilt shift lenses in general but some values may have to be changed.\n\nThe adapter isn't a professional tool, but something to have fun with, so have fun!\n\nFeel free to ask any questions in the comments", "link": "https://www.reddit.com/r/photography/comments/j9qa6m/3d_printed_canon_rf_to_canon_ef_tilt_adapter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  canon rf to canon ef tilt adapter /!/ &amp;#x200b;\n\nhttps://preview.redd.it/k5z9czhcuns51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=40f765b2bd57aa0e170eff593edd2d365b5f7c42\n\n[stls here](https://www.thingiverse.com/thing:4621718)\n\n[my previous adapters here](https://www.reddit.com/r/photography/comments/f0r089/3d_printed_tilt_adapters/)\n\n[post with more pictures](https://www.reddit.com/r/functionalprint/comments/j9q2wq/3d_printed_canon_rf_to_ef_tilt_adapter_info_in/)\n\nthis is a fully 3d printed canon rf to canon ef adapter with infinity focus, 7 degrees of tilt and 180 degrees of rotation. always hold the lens when using it, just in case.\n\nit was printed with black abs on an up! mini, with a layer height of 0.2mm and lots of support. other material should work fine, but it should be black to avoid a color cast.\n\nthe adapter has no electrical connection, so you won't be able to change focus when using a focus by wire lens (if the focus ring doesn't do anything when the camera is turned off, the lens is focus by wire), or change the aperture when using any ef lens. you can set your desired aperture beforehand however, using [this technique,](https://www.youtube.com/watch?v=y1zuk_ddweg) which will also work using an rf camera with the canon adapter.\n\nlens hoods that aren't circular may crop the corners when the lens is rotated 90 degrees. some lenses that are rectangular at the back (such as the 24-105 f4l) may also crop corners when rotated 90 degrees\n\n[dof visualization/calculator for this adapter](https://www.geogebra.org/classic/xs64kyhm) (works best on desktop). this is a tool i made to visualize how tilt affects the depth of field. it is setup by default to show a top down view of a 50mm lens at f2.8, tilted at 7 degrees, focused at 1 meter and on a full frame sensor. move the sliders around to see how different lenses, apertures and tilt angles change the depth of field. it will also work for other adapters and tilt shift lenses in general but some values may have to be changed.\n\nthe adapter isn't a professional tool, but something to have fun with, so have fun!\n\nfeel free to ask any questions in the comments", "sortedWord": "None", "Identifyer": null, "identifyer": 84049, "year": "2020"}, {"autor": "VladTheDismantler", "date": "2020-01-12 15:29:42", "content": "My first experience in photography as a beginner (story, questions, rant, review of Canon M50 and everything in between🙂) /!/ From the beginning of this summer, I really wanted to start to take really nice photos. I never took photos using my phone, so I was a bit afraid that if I buy photo gear it will be collecting dust on my shelf. Another big thing that caught my attention was videography/ cinematography as I always enjoyed school projects that required filming and acting (for example for science or literature classes).\n\nI've spent my whole summer searching and comparing camera models and I finally narrowed my selection down to two cameras: Sony A6300 and Canon M50. I really wanted to buy a mirrorless because they are smaller and they have an EVF. Sony A6000 seemed like a great camera, but no mic-in jack was a huge deal for me. At Black Friday, I bought the Canon M50. Sony A7 MK1 was also at a great price and it was a full-frame camera, but I thought that the lack of 4k and the age of the camera were big problems. Also, it was more expensive (but not too expensive).\n\n# Canon M50: a very short review\n\nJust as a disclaimer, I have no photography expericence, so this the opinion of an beginner photographer. On the other hand, I have fairly high technical knowledge, so from this standpoint I may be more accurate. Also, I used DSLRs and compact cameras before, so the controls, camera settings and theoretical framework are not (very) new things for me.\n\nI chose this camera because I'm a pretty broke High School student and, as I said, I really wanted a mirorless.\n\nEven though I have large hands, the camera fits nicely in my hands and is fairly usable one-handed and it is big enough that you can rest your left hand on it. Buttons are small and few and back button focus is out of question because of comfort concerns. There is ony one scroll wheel but it fells enough, at least for what I use it for. I really think that Canon should have enabled the focus ring to be used as a camera control (shutter speed or ISO), like they do on the R line of cameras. Many people complain about the batery life, but I find it ok for a day of light shooting.\n\nThe image quality is pretty decent up to 800 ISO and even more if you don't zoom in/ crop the photos.\n\nNow, everything I hate about this camera: First of all, it feels like a toy, not like a tool. Even though it is pretty sturdy, it feels plasticky. The buttons are a joke. Small and few. The software is incomplete and lacking. 4K is unusable, not only because of the lack of AF, but because of the huge crop and of the horrendous rolling shutter. There is no log profile for video and the ones that you can download on the internet are just not the same thing. The display swivels on the side, not just up and down and it is very annoying to use at an angle. The kit lens is, well, a kit lens. It is pretty dark and the sensor being a crop one does not improve anything.\n\nDo I hate the camera? NOPE! I still think it is pretty awesome, especially because it packs the same specs as my friends' DSLRs in a super small package. Also, you can adapt various cheapo vintage lenses and get features such as focus peaking and zoom through the EVF using inexpensive metal adapters or 3d printed ones (as I did for a Jupiter-8 Russian lens).\n\n**Also, I've recently bought an 50mm f1.8 STM lens.** I know it is not an awesome lens, but it is the best I could afford for now. The bright(er) aperture makes using this camera a pleasure. I am using a Viltrox adapter which I bought from China because the price of the original Canon ones feels like a bad joke for a \"dumb\"(passive) adapter that isn't more technically advanced than a macro ring.\n\nFocus with this lens is fast but very noisy and hunts a lot on less contrasting surfaces. This made me finally understand why mirorless cameras are not the most popular yet...\n\nWith those in mind, the photos I took turned out really great and I really enjoyed taking them and \"developing\" the RAW files. Photos taken with a phone don't even compare. The depth of field, the sharpness, the ability to fiddle with the final photo, the ergonomics, just everything is on another level and I'm glad I have bought the camera. (I still regret a little not getting the A7, hope somebody will tell me I'm wrong in the comments). I wish I could post some photos, but most of them are portraits and I don't want to post them. Anyway, it made me feel like the discount store version of an event photographer :-) and I really enjoy this feeling, being able to shoot superb photos for my friends and family.\n\n**Now, a question for the more seasoned photographers of this sub:** I think of buying a **Canon 70-200mm f4 L non-IS**. From what I've heard, the quality of the optics is impecable. The biggest problems are: People say this lens suffers from focus slipping. As I plan on buying second hand, is this something very common especially on used ones? Can it be repaired at home? Another big thing is the equivalent focal length of 112-360m. Is this usable? Don't ask me what I will be using this lens for, because I don't really know (yet). I think that maybe outdoor stuff, birds/ wildlife shooting and sports. Maybe you can help me find a general direction as an aspiring photographer.\n\nAll in all thank you in advance for any help, and even more than that, for reading my crappy ranty review-story. Any comment is more than welcome, especially tips. Also, English is not my native language, so sorry if this felt painful to read in any way.", "link": "https://www.reddit.com/r/photography/comments/enore6/my_first_experience_in_photography_as_a_beginner/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "my first experience in photography as a beginner (story, questions, rant, review of canon m50 and everything in between🙂) /!/ from the beginning of this summer, i really wanted to start to take really nice photos. i never took photos using my phone, so i was a bit afraid that if i buy photo gear it will be collecting dust on my shelf. another big thing that caught my attention was videography/ cinematography as i always enjoyed school projects that required filming and acting (for example for science or literature classes).\n\ni've spent my whole summer searching and comparing camera models and i finally narrowed my selection down to two cameras: sony a6300 and canon m50. i really wanted to buy a mirrorless because they are smaller and they have an evf. sony a6000 seemed like a great camera, but no mic-in jack was a huge deal for me. at black friday, i bought the canon m50. sony a7 mk1 was also at a great price and it was a full-frame camera, but i thought that the lack of 4k and the age of the camera were big problems. also, it was more expensive (but not too expensive).\n\n# canon m50: a very short review\n\njust as a disclaimer, i have no photography expericence, so this the opinion of an beginner photographer. on the other hand, i have fairly high technical knowledge, so from this standpoint i may be more accurate. also, i used dslrs and compact cameras before, so the controls, camera settings and theoretical framework are not (very) new things for me.\n\ni chose this camera because i'm a pretty broke high school student and, as i said, i really wanted a mirorless.\n\neven though i have large hands, the camera fits nicely in my hands and is fairly usable one-handed and it is big enough that you can rest your left hand on it. buttons are small and few and back button focus is out of question because of comfort concerns. there is ony one scroll wheel but it fells enough, at least for what i use it for. i really think that canon should have enabled the focus ring to be used as a camera control (shutter speed or iso), like they do on the r line of cameras. many people complain about the batery life, but i find it ok for a day of light shooting.\n\nthe image quality is pretty decent up to 800 iso and even more if you don't zoom in/ crop the photos.\n\nnow, everything i hate about this camera: first of all, it feels like a toy, not like a tool. even though it is pretty sturdy, it feels plasticky. the buttons are a joke. small and few. the software is incomplete and lacking. 4k is unusable, not only because of the lack of af, but because of the huge crop and of the horrendous rolling shutter. there is no log profile for video and the ones that you can download on the internet are just not the same thing. the display swivels on the side, not just up and down and it is very annoying to use at an angle. the kit lens is, well, a kit lens. it is pretty dark and the sensor being a crop one does not improve anything.\n\ndo i hate the camera? nope! i still think it is pretty awesome, especially because it packs the same specs as my friends' dslrs in a super small package. also, you can adapt various cheapo vintage lenses and get features such as focus peaking and zoom through the evf using inexpensive metal adapters or -----> 3d !!!  -----> printed !!!  ones (as i did for a jupiter-8 russian lens).\n\n**also, i've recently bought an 50mm f1.8 stm lens.** i know it is not an awesome lens, but it is the best i could afford for now. the bright(er) aperture makes using this camera a pleasure. i am using a viltrox adapter which i bought from china because the price of the original canon ones feels like a bad joke for a \"dumb\"(passive) adapter that isn't more technically advanced than a macro ring.\n\nfocus with this lens is fast but very noisy and hunts a lot on less contrasting surfaces. this made me finally understand why mirorless cameras are not the most popular yet...\n\nwith those in mind, the photos i took turned out really great and i really enjoyed taking them and \"developing\" the raw files. photos taken with a phone don't even compare. the depth of field, the sharpness, the ability to fiddle with the final photo, the ergonomics, just everything is on another level and i'm glad i have bought the camera. (i still regret a little not getting the a7, hope somebody will tell me i'm wrong in the comments). i wish i could post some photos, but most of them are portraits and i don't want to post them. anyway, it made me feel like the discount store version of an event photographer :-) and i really enjoy this feeling, being able to shoot superb photos for my friends and family.\n\n**now, a question for the more seasoned photographers of this sub:** i think of buying a **canon 70-200mm f4 l non-is**. from what i've heard, the quality of the optics is impecable. the biggest problems are: people say this lens suffers from focus slipping. as i plan on buying second hand, is this something very common especially on used ones? can it be repaired at home? another big thing is the equivalent focal length of 112-360m. is this usable? don't ask me what i will be using this lens for, because i don't really know (yet). i think that maybe outdoor stuff, birds/ wildlife shooting and sports. maybe you can help me find a general direction as an aspiring photographer.\n\nall in all thank you in advance for any help, and even more than that, for reading my crappy ranty review-story. any comment is more than welcome, especially tips. also, english is not my native language, so sorry if this felt painful to read in any way.", "sortedWord": "None", "Identifyer": null, "identifyer": 87892, "year": "2020"}], "name": "printphotography2020"}