{"interestingcomments": [{"Unnamed: 0": 96177, "autor": "frenshprince", "date": 1621161736000, "content": "Picasa perfect replacement /!/ Hi there,\n\nAfter spending a lot of time searching for a perfect replacement for Picasa, which wasn't clunky, hideous, or with too many useless features, I finaly fount it : Phototheca\n\n[Photo management software (lunarship.com)](https://lunarship.com/)\n\nDisclamer : I'm not in any way connected to the developer, or paid to talk about it. I just hope that if this fatastic software become more popular, it will get more feature and support.\n\nEnglish is not my native language, so I will only post my pros and cons.\n\n**PROS :**\n\n\\- Clean UI.   \nI can't stand the windows 95 looks that a lot of DAM/Browser offer.\n\n\\- You have a lot of option for Photo tagging/Metadata.   \nIn Exif, Iptc or XMP, with the abbility to add keywords or fix incorrect infos.\n\n\\- Import/sync folder, with a lot of different presentation.   \n(I like the event and calendar display)\n\n\\- Facial recognition\n\n\\- A lot of browsing and organizing capabilities.   \nLike smart albums, dual views, files type, facial...\n\n\\- It can detect duplication\n\n\\- Allow you to export your photo in many ways.   \nIncluding Google photos or Flickr Albums.\n\n\\- Works with  Raw and Video\n\n\\- It has a buit in photo editor (But I don't use it)\n\n\\- A geo tagging feature is on it's way.   \n[Geotagging photos in Phototheca : Phototheca (lunarship.com)](https://lunarship.com/manual/geotagging/)\n\n\\- Can be used in touch mode\n\n\\- Frequently updated\n\n&amp;#x200B;\n\n**CONS :**\n\n\\- Lack of Keyboard shortcuts\n\n\\- No settings to browse with the mouse wheel\n\n\\- The thumbnails maximum size is not big enough\n\n\\- No loop browsing\n\n\\- No internal video player\n\n\\- Kinda pricey (40$ for the Home Edition)\n\n&amp;#x200B;\n\nConclusion : I love this app.\n\nJust try it !", "link": "https://www.reddit.com/r/photography/comments/ndlne0/picasa_perfect_replacement/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "picasa perfect replacement /!/ hi there,\n\nafter spending a lot of time searching for a perfect replacement for picasa, which wasn't clunky, hideous, or with too many useless features, i finaly fount it : phototheca\n\n[photo management software (lunarship.com)](https://lunarship.com/)\n\ndisclamer : i'm not in any way connected to the developer, or paid to talk about it. i just hope that if this fatastic software become more popular, it will get more feature and support.\n\nenglish is not my native language, so i will only post my pros and cons.\n\n**pros :**\n\n\\- clean ui.   \ni can't stand the windows 95 looks that a lot of dam/browser offer.\n\n\\- you have a lot of option for photo -----> tagging !!! /metadata.   \nin exif, iptc or xmp, with the abbility to add keywords or fix incorrect infos.\n\n\\- import/sync folder, with a lot of different presentation.   \n(i like the event and calendar display)\n\n\\- facial recognition\n\n\\- a lot of browsing and organizing capabilities.   \nlike smart albums, dual views, files type, facial...\n\n\\- it can detect duplication\n\n\\- allow you to export your photo in many ways.   \nincluding google photos or flickr albums.\n\n\\- works with  raw and video\n\n\\- it has a buit in photo editor (but i don't use it)\n\n\\- a geo tagging feature is on it's way.   \n[geotagging photos in phototheca : phototheca (lunarship.com)](https://lunarship.com/manual/geotagging/)\n\n\\- can be used in touch mode\n\n\\- frequently updated\n\n&amp;#x200b;\n\n**cons :**\n\n\\- lack of keyboard shortcuts\n\n\\- no settings to browse with the mouse wheel\n\n\\- the thumbnails maximum size is not big enough\n\n\\- no loop browsing\n\n\\- no internal video player\n\n\\- kinda pricey (40$ for the home edition)\n\n&amp;#x200b;\n\nconclusion : i love this app.\n\njust try it !", "sortedWord": "None", "identifyer": 98764, "year": "2021"}, {"Unnamed: 0": 110326, "autor": "Thewanderingnerd86", "date": 1612411206000, "content": "Tagging clients on Instagram? /!/ I’m stuck in a quandary at the movement. A client asked me if I thought it would be tacky to tag them in all the pictures that I post of them... Now, firstly if I’m using my Instagram to promote myself... not to promote my client. She was a paying client. Not anything for TFP.  I own the rights to my photos (yes she signed a contract stating that) \n\nIt’s really not a big deal to tag her. But, I don’t know, I have very mixed feelings about this. And I’m not sure if I should? I “@“ mentioned her in the first photo I posted from her shoot. \n\nBut I’m also not sure if it’s because she doesn’t want to go looking for the photos to share? Or maybe to use the pictures that she didn’t choose to keep from her gallery? I wouldn’t normally tag my clients in every single photo I post of them, but I also never been asked this question. \n\nShe works for the salon that does that hair and makeup for my shoots. \n\nAny input would be appreciated.", "link": "https://www.reddit.com/r/photography/comments/lc6ydx/tagging_clients_on_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "-----> tagging !!!  clients on instagram? /!/ i’m stuck in a quandary at the movement. a client asked me if i thought it would be tacky to tag them in all the pictures that i post of them... now, firstly if i’m using my instagram to promote myself... not to promote my client. she was a paying client. not anything for tfp.  i own the rights to my photos (yes she signed a contract stating that) \n\nit’s really not a big deal to tag her. but, i don’t know, i have very mixed feelings about this. and i’m not sure if i should? i “@“ mentioned her in the first photo i posted from her shoot. \n\nbut i’m also not sure if it’s because she doesn’t want to go looking for the photos to share? or maybe to use the pictures that she didn’t choose to keep from her gallery? i wouldn’t normally tag my clients in every single photo i post of them, but i also never been asked this question. \n\nshe works for the salon that does that hair and makeup for my shoots. \n\nany input would be appreciated.", "sortedWord": "None", "identifyer": 268, "year": "2021"}, {"Unnamed: 0": 110851, "autor": "SpectrumDT", "date": 1617027075000, "content": "What cloud photo storage app is better than Google Photos? /!/ Hi! I am looking for a cloud photo storage and viewer application. I am currently using Google Photos and I am tired of it. The features I want are: \n\n1. Must have a nice Android app.\n2. Must have good support for categorization/tagging and searching of pictures. For example, I would love to be able to categorize photos as \"animals\" or \"women\" and be able to easily search for them. Preferably also with nested category support. \n3. I want to store some gigabytes of photos, but not hundreds of gigabytes. \n4. I can pay money for it if necessary.\n\nIronically for a company famous for its search engine, Google Photos sucks when it comes to searchability. You can only have a flat list of albums and you can't even search this list; you have to scroll through it.\n\nI already have a bunch of photos on my computer with search words in the file names. Ideally I would like to be able to upload these and have the app keep the filenames so I can search for keywords in file names. \n\nDoes any photo service support this?\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/mfqeiq/what_cloud_photo_storage_app_is_better_than/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "what cloud photo storage app is better than google photos? /!/ hi! i am looking for a cloud photo storage and viewer application. i am currently using google photos and i am tired of it. the features i want are: \n\n1. must have a nice android app.\n2. must have good support for categorization/-----> tagging !!!  and searching of pictures. for example, i would love to be able to categorize photos as \"animals\" or \"women\" and be able to easily search for them. preferably also with nested category support. \n3. i want to store some gigabytes of photos, but not hundreds of gigabytes. \n4. i can pay money for it if necessary.\n\nironically for a company famous for its search engine, google photos sucks when it comes to searchability. you can only have a flat list of albums and you can't even search this list; you have to scroll through it.\n\ni already have a bunch of photos on my computer with search words in the file names. ideally i would like to be able to upload these and have the app keep the filenames so i can search for keywords in file names. \n\ndoes any photo service support this?\n\nthanks in advance!", "sortedWord": "None", "identifyer": 808, "year": "2021"}, {"Unnamed: 0": 111677, "autor": "lihnuz", "date": 1621776641000, "content": "what is the state of photography on linux in 2021? /!/ Hello. \nIm in the process of upgrading my desktop, and looking at ditching windows if possible. Last time 6 years ago, gaming and photography were holding me back. This time gaming on linux looks like a solved problem. But how is photography?\n\nI'm currently using lightroom, so I need some way to export my database from that to some other tool to handle tagging and archiving my photos, and preferably not needing to redo all my existing photos. Is that possible? \n\nI'm also using a fujifilm x pro 3, last time I looked there were issues with raw converters, is that still the case?\n\nSo basically, im wondering if I can convert my adobe workflow to something usable on Linux, and what should I think about when setting up a new workflow on linux? Or are adobe/lightroom still superior to work in/with ?", "link": "https://www.reddit.com/r/photography/comments/nj7syu/what_is_the_state_of_photography_on_linux_in_2021/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "what is the state of photography on linux in 2021? /!/ hello. \nim in the process of upgrading my desktop, and looking at ditching windows if possible. last time 6 years ago, gaming and photography were holding me back. this time gaming on linux looks like a solved problem. but how is photography?\n\ni'm currently using lightroom, so i need some way to export my database from that to some other tool to handle -----> tagging !!!  and archiving my photos, and preferably not needing to redo all my existing photos. is that possible? \n\ni'm also using a fujifilm x pro 3, last time i looked there were issues with raw converters, is that still the case?\n\nso basically, im wondering if i can convert my adobe workflow to something usable on linux, and what should i think about when setting up a new workflow on linux? or are adobe/lightroom still superior to work in/with ?", "sortedWord": "None", "identifyer": 1666, "year": "2021"}, {"Unnamed: 0": 112313, "autor": "zladuric", "date": 1626266487000, "content": "What tags do you usually use for your photography? /!/ I've started putting some order in my photo collection, both the ~10000 photos I've took when I started some \"serious\" photography, and all my previous vacation, phone etc photos. Before I make serious errors, what kind of tag system can I use?\n\nE.g. digiKam's Tag manager suggests subcategories like `Cities/Paris` or `Monument/Notre-Dame`, and has by default People/Unconfirmed and `People/Unknown`.\n\nWhat kind of tagging systems do you use? Do you use multiple tags by default? Which mistakes do you now find hard to work around?\n\nDo you do a pass of selecting \"keepers\" and then tag what you picked, or do you tag it all?\n\nDo you have any useful links on the topics?\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/ok3itv/what_tags_do_you_usually_use_for_your_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "what tags do you usually use for your photography? /!/ i've started putting some order in my photo collection, both the ~10000 photos i've took when i started some \"serious\" photography, and all my previous vacation, phone etc photos. before i make serious errors, what kind of tag system can i use?\n\ne.g. digikam's tag manager suggests subcategories like `cities/paris` or `monument/notre-dame`, and has by default people/unconfirmed and `people/unknown`.\n\nwhat kind of -----> tagging !!!  systems do you use? do you use multiple tags by default? which mistakes do you now find hard to work around?\n\ndo you do a pass of selecting \"keepers\" and then tag what you picked, or do you tag it all?\n\ndo you have any useful links on the topics?\n\nthanks.", "sortedWord": "None", "identifyer": 2322, "year": "2021"}, {"Unnamed: 0": 117817, "autor": "medium0rare", "date": 1625959680000, "content": "How do others deal with Facebook tagging? /!/ People I photograph keep tagging my personal page instead of my business page. Is there any way to prevent this?", "link": "https://www.reddit.com/r/photography/comments/ohtcil/how_do_others_deal_with_facebook_tagging/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "how do others deal with facebook -----> tagging !!! ? /!/ people i photograph keep tagging my personal page instead of my business page. is there any way to prevent this?", "sortedWord": "None", "identifyer": 8033, "year": "2021"}, {"Unnamed: 0": 121298, "autor": "baerrow", "date": 1610385313000, "content": "Seek advise about software to manage photo /!/ Hello.\n\nI am looking for a easy to use software to manage photos (regroup per date, tagging, etc). It's for my mother, who used Picasa when it was sill existing.\n\nI found about [Darktable](https://www.darktable.org/about/) and [PhotoInsight](https://photoinsight.io/), but I have trouble correctly judging them (i don't have any use for this kind of software).\n\n&amp;#x200B;\n\nSo, what software could you advise me? what do you use?\n\nHave a nice day!", "link": "https://www.reddit.com/r/photography/comments/kv72i3/seek_advise_about_software_to_manage_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "seek advise about software to manage photo /!/ hello.\n\ni am looking for a easy to use software to manage photos (regroup per date, -----> tagging !!! , etc). it's for my mother, who used picasa when it was sill existing.\n\ni found about [darktable](https://www.darktable.org/about/) and [photoinsight](https://photoinsight.io/), but i have trouble correctly judging them (i don't have any use for this kind of software).\n\n&amp;#x200b;\n\nso, what software could you advise me? what do you use?\n\nhave a nice day!", "sortedWord": "None", "identifyer": 11662, "year": "2021"}, {"Unnamed: 0": 122847, "autor": "Eldricson93", "date": 1619274723000, "content": "Photo organization and tagging software PC /!/ I have lots of pictures of family and would like to organize them. However is there free software out there that I can tag my pictures with who is in there? Or does windows come with that already?", "link": "https://www.reddit.com/r/photography/comments/mxl45c/photo_organization_and_tagging_software_pc/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "photo organization and -----> tagging !!!  software pc /!/ i have lots of pictures of family and would like to organize them. however is there free software out there that i can tag my pictures with who is in there? or does windows come with that already?", "sortedWord": "None", "identifyer": 13283, "year": "2021"}, {"Unnamed: 0": 124129, "autor": "onnod", "date": 1622844088000, "content": "OneDrive vs Google Drive vs Dropbox for collaborative keywording/tagging /!/ I wanted to crowdsource photo tagging for a long term project (several years, thousands of photos). The idea to host the images on a cloud service and allow people to view and tag the photos in their free time makes sense, but do any of these services allow the web based tags to be applied to .XMP sidecar files or to IPTC? Perhaps there is a third party plugin that does this?", "link": "https://www.reddit.com/r/photography/comments/nsgpl6/onedrive_vs_google_drive_vs_dropbox_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "onedrive vs google drive vs dropbox for collaborative keywording/-----> tagging !!!  /!/ i wanted to crowdsource photo tagging for a long term project (several years, thousands of photos). the idea to host the images on a cloud service and allow people to view and tag the photos in their free time makes sense, but do any of these services allow the web based tags to be applied to .xmp sidecar files or to iptc? perhaps there is a third party plugin that does this?", "sortedWord": "None", "identifyer": 14618, "year": "2021"}, {"Unnamed: 0": 125425, "autor": "FreeiPhones", "date": 1628109586000, "content": "Photo tagging software? /!/ Do any of you tag your photos by category so they're easier to find?  \nI want to be able to categorize my photos without making duplicates. They're already organized by folder, but most of them belong in multiple categories.  \n\n\nFor example, 123456.jpg is tagged with #family, #nature, #'friend's name'  \nThis is so I can search by tags instead of the filename  \n\n\nI use a Windows machine. Does windows have a feature like this by default?  \nI figured this would be the right place to ask", "link": "https://www.reddit.com/r/photography/comments/oy1t7r/photo_tagging_software/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "photo -----> tagging !!!  software? /!/ do any of you tag your photos by category so they're easier to find?  \ni want to be able to categorize my photos without making duplicates. they're already organized by folder, but most of them belong in multiple categories.  \n\n\nfor example, 123456.jpg is tagged with #family, #nature, #'friend's name'  \nthis is so i can search by tags instead of the filename  \n\n\ni use a windows machine. does windows have a feature like this by default?  \ni figured this would be the right place to ask", "sortedWord": "None", "identifyer": 15979, "year": "2021"}, {"Unnamed: 0": 125962, "autor": "imperial_account_III", "date": 1631103289000, "content": "What's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process? /!/ I'm relatively new to photography and quite recently bought my first real camera (a Fuji X-T30). My main purpose is documenting my hikes, which I used to do with my phone, but wanted an upgrade in image quality.\n\nWith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. I also feel like my methods aren't exactly efficient, but I'm not sure what exactly I could improve. So I'd like to collect your preferred processes and learn from them.\n\nFor the record, these are my old and current processes, respectively:\n\n**Old Process (Phone)**\n\n1. Let MS Onedrive back up the pictures from my phone.\n\n2. Create an album for that day/hike/event from the camera reel.\n\n3. Delete the bad or unsuitable pictures from the album.\n\n4. Download the album to my computer and back it up locally.\n\n**New Process**\n\n1. Insert SD Card into card reader on PC.\n\n2. Look through pictures, deleting bad ones and rating really good ones as 4/5 stars within Windows Explorer. See step 4 for relevance of the latter.\n\n3. Be annoyed with Windows 10 because Windows 7 was better and more convenient at literally everything. Be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. Sort by name, manually select the RAW files corresponding to the 4-5 star rated JPEGs, and send them over to a \"Source/RAW\" folder on the hard drive (No use in keeping the mediocre RAWs).\n\n5. Send the remaining JPEGs to the Source folder.\n\n6. At this point, I would use rawtherapee to create optimal PNGs from the RAW files, but I'm still learning how to make those not look shit, so instead at this point, I edit the JPEGs that could be good but need some adjustments.\n\n7. Create an Album folder for that Day/Hike/Event and copy (not move) all the pictures over.\n\n8. Delete the ones I don't want in the Album.\n\n9. Upload the album folder to Onedrive (web, not the windows folder. I hate how that one works) for backup / sharing among family and friends.\n\n10. Optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**Considerations**\n\nI'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. This is not an issue yet, but might become costly in the future.\n\nThe reason I do this is that I find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and I don't trust tags.\n\nWhen I say I don't trust tags, I mean I don't want to go through hours of effort tagging images by content only to find in ten years that my new operating system doesn't know what to do with the tags I created in Windows 10, for example. Themed folders full of copied files seem much more reliable.\n\nThe downside of copy pasting is that if I alter an image later on, be it in name or the image itself, I have to apply those changes everywhere else the image is saved as well.\n\nI think the biggest issue currently is how long steps 1-6 are taking me, and I'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\nI'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\nI've considered having Onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (I'd hate to have to reorganize tens of thousands of pictures the day I stop using Onedrive.)\n\n**What do you do yourself? And what would you change about my approach or recommend to aid me, considering my considerations?** \n\nThanks for your time and have a great day :)", "link": "https://www.reddit.com/r/photography/comments/pk9ah0/whats_your_preferred_import_rating_sorting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "what's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process? /!/ i'm relatively new to photography and quite recently bought my first real camera (a fuji x-t30). my main purpose is documenting my hikes, which i used to do with my phone, but wanted an upgrade in image quality.\n\nwith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. i also feel like my methods aren't exactly efficient, but i'm not sure what exactly i could improve. so i'd like to collect your preferred processes and learn from them.\n\nfor the record, these are my old and current processes, respectively:\n\n**old process (phone)**\n\n1. let ms onedrive back up the pictures from my phone.\n\n2. create an album for that day/hike/event from the camera reel.\n\n3. delete the bad or unsuitable pictures from the album.\n\n4. download the album to my computer and back it up locally.\n\n**new process**\n\n1. insert sd card into card reader on pc.\n\n2. look through pictures, deleting bad ones and rating really good ones as 4/5 stars within windows explorer. see step 4 for relevance of the latter.\n\n3. be annoyed with windows 10 because windows 7 was better and more convenient at literally everything. be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. sort by name, manually select the raw files corresponding to the 4-5 star rated jpegs, and send them over to a \"source/raw\" folder on the hard drive (no use in keeping the mediocre raws).\n\n5. send the remaining jpegs to the source folder.\n\n6. at this point, i would use rawtherapee to create optimal pngs from the raw files, but i'm still learning how to make those not look shit, so instead at this point, i edit the jpegs that could be good but need some adjustments.\n\n7. create an album folder for that day/hike/event and copy (not move) all the pictures over.\n\n8. delete the ones i don't want in the album.\n\n9. upload the album folder to onedrive (web, not the windows folder. i hate how that one works) for backup / sharing among family and friends.\n\n10. optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**considerations**\n\ni'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. this is not an issue yet, but might become costly in the future.\n\nthe reason i do this is that i find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and i don't trust tags.\n\nwhen i say i don't trust tags, i mean i don't want to go through hours of effort -----> tagging !!!  images by content only to find in ten years that my new operating system doesn't know what to do with the tags i created in windows 10, for example. themed folders full of copied files seem much more reliable.\n\nthe downside of copy pasting is that if i alter an image later on, be it in name or the image itself, i have to apply those changes everywhere else the image is saved as well.\n\ni think the biggest issue currently is how long steps 1-6 are taking me, and i'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\ni'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\ni've considered having onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (i'd hate to have to reorganize tens of thousands of pictures the day i stop using onedrive.)\n\n**what do you do yourself? and what would you change about my approach or recommend to aid me, considering my considerations?** \n\nthanks for your time and have a great day :)", "sortedWord": "None", "identifyer": 16545, "year": "2021"}, {"Unnamed: 0": 127687, "autor": "tjm003", "date": 1635197670000, "content": "Best Image Organizing Software/app for 100,000+ image library /!/ I'm looking for a Mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, GIF, mp4 friendly)\n\n[Eagle.cool](https://Eagle.cool) is NEAR perfect for what I need but does not have an autotag/ AI tag feature. Since I have so many photos hand tagging is too tedious - so an AI tag feature is necessary. As well as being able to store GIFs and videos along with photo.\n\nMost services I'm finding or being recommended are a DAM service that is mad expensive, $12,000 annually (Canto LOL) so I'm not sure that is necessary but if anyone had any insight on DAM services that weren't more than $500 annually that would be great too. ( DigiKam, Bynder have tried)\n\nAlso, not needing services that provide photo editing.\n\nLightroom was an option but cannot store GIFs. If anyone has any recommendations that would be great!", "link": "https://www.reddit.com/r/photography/comments/qfr0hm/best_image_organizing_softwareapp_for_100000/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "best image organizing software/app for 100,000+ image library /!/ i'm looking for a mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, gif, mp4 friendly)\n\n[eagle.cool](https://eagle.cool) is near perfect for what i need but does not have an autotag/ ai tag feature. since i have so many photos hand -----> tagging !!!  is too tedious - so an ai tag feature is necessary. as well as being able to store gifs and videos along with photo.\n\nmost services i'm finding or being recommended are a dam service that is mad expensive, $12,000 annually (canto lol) so i'm not sure that is necessary but if anyone had any insight on dam services that weren't more than $500 annually that would be great too. ( digikam, bynder have tried)\n\nalso, not needing services that provide photo editing.\n\nlightroom was an option but cannot store gifs. if anyone has any recommendations that would be great!", "sortedWord": "None", "identifyer": 18349, "year": "2021"}, {"Unnamed: 0": 127688, "autor": "bootsbarley", "date": 1635197284000, "content": "Best Image Organizing Software/app for 100,000+ image library /!/ I'm looking for a Mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, GIF, mp4 friendly) \n\n[Eagle.cool](https://Eagle.cool) is NEAR perfect for what I need but does not have an autotag/ AI tag feature. Since I have so many photos hand tagging is too tedious - so an AI tag feature is necessary. As well as being able to store GIFs and videos along with photo.\n\nMost services I'm finding or being recommended are a DAM service that is mad expensive,  $12,000 annually (Canto LOL) so I'm not sure that is necessary but if anyone had any insight on DAM services that weren't more than $500 annually that would be great too. ( DigiKam, Bynder have tried)\n\nAlso, not needing services that provide photo editing. \n\nLightroom was an option but cannot store GIFs. If anyone has any recommendations that would be great!", "link": "https://www.reddit.com/r/photography/comments/qfqvn1/best_image_organizing_softwareapp_for_100000/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "best image organizing software/app for 100,000+ image library /!/ i'm looking for a mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, gif, mp4 friendly) \n\n[eagle.cool](https://eagle.cool) is near perfect for what i need but does not have an autotag/ ai tag feature. since i have so many photos hand -----> tagging !!!  is too tedious - so an ai tag feature is necessary. as well as being able to store gifs and videos along with photo.\n\nmost services i'm finding or being recommended are a dam service that is mad expensive,  $12,000 annually (canto lol) so i'm not sure that is necessary but if anyone had any insight on dam services that weren't more than $500 annually that would be great too. ( digikam, bynder have tried)\n\nalso, not needing services that provide photo editing. \n\nlightroom was an option but cannot store gifs. if anyone has any recommendations that would be great!", "sortedWord": "None", "identifyer": 18350, "year": "2021"}, {"Unnamed: 0": 128249, "autor": "LastSaskPirate", "date": 1629682372000, "content": "Best Service for Family Photo Library /!/ Hi r/photography.\n\nI have about 15,000 family photos currently on Google Drive backed up. I'm looking for a service, that I'm absolutely willing to pay for, to migrate these to so that I can maintain this library for my family and have them access it/upload to it.\n\nI'm looking for a service that will:\n- host the photos\n- nest albums (i.e. year &gt; event album with photos)\n- ideally alow tagging of people and a search function\n- be accessible on desktop and mobile platforms\n\nI'm at my wit's end, I've tried Google photos, Flikr, Amazon photos, and iCloud and none of them are able to do these. Flikr is closest, but its uploader seems really clunky in that you can't upload folders at a time. Maybe there's a good uploader someone has experience with?\n\nI would be very appreciative if anyone had any suggestions!", "link": "https://www.reddit.com/r/photography/comments/p9pku6/best_service_for_family_photo_library/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "best service for family photo library /!/ hi r/photography.\n\ni have about 15,000 family photos currently on google drive backed up. i'm looking for a service, that i'm absolutely willing to pay for, to migrate these to so that i can maintain this library for my family and have them access it/upload to it.\n\ni'm looking for a service that will:\n- host the photos\n- nest albums (i.e. year &gt; event album with photos)\n- ideally alow -----> tagging !!!  of people and a search function\n- be accessible on desktop and mobile platforms\n\ni'm at my wit's end, i've tried google photos, flikr, amazon photos, and icloud and none of them are able to do these. flikr is closest, but its uploader seems really clunky in that you can't upload folders at a time. maybe there's a good uploader someone has experience with?\n\ni would be very appreciative if anyone had any suggestions!", "sortedWord": "None", "identifyer": 18941, "year": "2021"}], "name": "taggingphotography2021"}