{"interestingcomments": [{"Unnamed: 0": 103280, "autor": "daehruoydeef", "date": 1557597541000, "content": "Add Tags to my JPEG images as Metadata. /!/ Hey I am struggeling to find which tags I need to add to my Image meta data so my library can sort them better. For example if I have a Image of a Dog I would like to label the Image so that a Dog is inside, and later on just search my library for all Images which contain a Dog.\n\nI heard of EXIF Tags and I read that they can contain another form of tagging called IPTC, am I wrong about this? I read the EXIF File Specification but could not wrap my head around which Fields I needed to modify. Could someone please clarify which Fields I need to edit and how I could make this happen in the first place. Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/bney2b/add_tags_to_my_jpeg_images_as_metadata/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "add tags to my jpeg images as metadata. /!/ hey i am struggeling to find which tags i need to add to my image meta data so my library can sort them better. for example if i have a image of a dog i would like to label the image so that a dog is inside, and later on just search my library for all images which contain a dog.\n\ni heard of exif tags and i read that they can contain another form of -----> tagging !!!  called iptc, am i wrong about this? i read the exif file specification but could not wrap my head around which fields i needed to modify. could someone please clarify which fields i need to edit and how i could make this happen in the first place. thanks in advance!", "sortedWord": "None", "identifyer": 6082, "year": "2019"}, {"Unnamed: 0": 319409, "autor": "McRedditerFace", "date": 1571270711000, "content": "DAM Tagging Faces... what *is* a face? /!/ Hey all,  \n\n\nBeen going through my collection of family photos, tagging faces using Digikam.  Digikam, as with many other DAM softwares, includes facial recognition and face tagging.  However it's not exactly 100% accurate, not by a long shot.  \n\n\nAdditionally, a large number of tags were embedded into the meta data by Picassa, and some of those were mistranslated when brought into Digikam, and that required cleaning up.  But others just seem \"off\".  \n\n\nAt the end of the day, what this boils down to is that a large portion of tags weren't generated by Digikam's face-detection alogrithm, and those tags are being used as part of the base set of images which additional tags that are created automagically.  \n\n\nI want to ensure my tags are done right... and I've come up with a really stupid question to something that \\*should\\* be simple... what \\*is\\* a face?  \n\n\nShould a box that encompasses a face include the jawline?  How about the ears?  Is it really just the eyes, nose, and mouth?  \n\n\nShould I  even tag photos that have faces partially obscured, like by someone's arm, or a hat... etc... or does this run the risk of introducing bad data into the dataset the algorithms are pulling from?  \n\n\nWhat if it's a profile view?  How much of a face is still a face?  Two eyes?  One?  What if the eyes are closed?  \n\n\nAnd should I worry about bad tags creating bad data which gets used in the algorithms?  I hadn't initially been worried about this, but what I realized when a number of those tags that were improperly translated into Digikam from Picassa was that the areas they were being \"found\" in other images to detect additional faces.  So if a tag was translated incorrectly and wound up on a specific pattern of fabric, it'd find that kind of pattern all kinds of other places, and find \"faces\", because that was a \"face\" that was already tagged, and the software found similar ones.  The computer's only as smart as the person who programmed it, but it seems AI is only as smart as the dataset it learnt from.", "link": "https://www.reddit.com/r/photography/comments/diy7tn/dam_tagging_faces_what_is_a_face/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "dam -----> tagging !!!  faces... what *is* a face? /!/ hey all,  \n\n\nbeen going through my collection of family photos, tagging faces using digikam.  digikam, as with many other dam softwares, includes facial recognition and face tagging.  however it's not exactly 100% accurate, not by a long shot.  \n\n\nadditionally, a large number of tags were embedded into the meta data by picassa, and some of those were mistranslated when brought into digikam, and that required cleaning up.  but others just seem \"off\".  \n\n\nat the end of the day, what this boils down to is that a large portion of tags weren't generated by digikam's face-detection alogrithm, and those tags are being used as part of the base set of images which additional tags that are created automagically.  \n\n\ni want to ensure my tags are done right... and i've come up with a really stupid question to something that \\*should\\* be simple... what \\*is\\* a face?  \n\n\nshould a box that encompasses a face include the jawline?  how about the ears?  is it really just the eyes, nose, and mouth?  \n\n\nshould i  even tag photos that have faces partially obscured, like by someone's arm, or a hat... etc... or does this run the risk of introducing bad data into the dataset the algorithms are pulling from?  \n\n\nwhat if it's a profile view?  how much of a face is still a face?  two eyes?  one?  what if the eyes are closed?  \n\n\nand should i worry about bad tags creating bad data which gets used in the algorithms?  i hadn't initially been worried about this, but what i realized when a number of those tags that were improperly translated into digikam from picassa was that the areas they were being \"found\" in other images to detect additional faces.  so if a tag was translated incorrectly and wound up on a specific pattern of fabric, it'd find that kind of pattern all kinds of other places, and find \"faces\", because that was a \"face\" that was already tagged, and the software found similar ones.  the computer's only as smart as the person who programmed it, but it seems ai is only as smart as the dataset it learnt from.", "sortedWord": "None", "identifyer": 66607, "year": "2019"}, {"Unnamed: 0": 322246, "autor": "sigint_bn", "date": 1564166981000, "content": "Got all my photos deleted from Flickr; so fair warning to those still on that service. /!/ &gt;Although we prohibit certain activities in these Terms of Use, SmugMug does not make any representation or warranty that the User Content you may encounter through your use of the Services complies with these acceptable use provisions or the Terms of Use. YOUR USE OF THE SERVICES IS SOLELY AT YOUR OWN RISK. These Terms of Use do not create any private right of action on the part of any third party or any reasonable expectation that the Services will not contain any content that is prohibited by these acceptable use provisions.  \n&gt;  \n&gt;SmugMug reserves the right (but is not obligated) to (i) review or screen any User Content submitted to the Site or otherwise submitted through the Services; (ii) edit any User Content posted on the Services; and/or (iii) **remove any User Content from the Services for any reason, at any time, without prior notice, at our sole discretion.** SmugMug will have no liability or responsibility to users of the Services or any other person or entity for performance or nonperformance of such activities. SmugMug’s enforcement of the acceptable use provisions set forth in these Terms of Use with respect to User Content in some instances does not constitute a waiver of our right to enforce such provisions in other instances involving similar User Content.\n\n&amp;#x200B;\n\n&gt;User Content that is obscene, pornographic, indecent, lewd, sexually suggestive, including without limitation photos, videos or other User Content containing nudity, unless you have restricted access to such User Content with an appropriate content filter setting that will restrict viewing by minors;\n\nEmphasis mine.\n\nProbably less and less old man penises, dudes in dresses, dry aged lady bits now on Flickr, but at least back then, they don't delete your shit, and tell you to put it under Restricted. Get it reviewed, and if its a-ok, you're back in.\n\n&amp;#x200B;\n\n&gt; Hello,  \n  \n&gt;  \n&gt;Thank you for contacting Flickr.  \n  \n&gt;  \n&gt;We have reviewed your account and found that it has been terminated for violating our Terms of Service. You are no longer permitted to use Flickr services and we will not be providing you with any content that you previously uploaded to Flickr.  \n  \n&gt;  \n&gt;Future attempts to use Flickr will result in the termination of the account.  \n  \n&gt;  \n&gt;Best regards,  \n  \n&gt;  \n&gt;\\---------- --------------------  \nFlickr Trust &amp; Safety \n\nThe last time before SmugMug took over, I had my account reviewed, and of course, following their review recommendations, I made certain photos restricted or private, and had it back up again. Following the buy out I don't think I've mass unrestricted my photos, so I'm scratching my head on that one. I think my jab at their practices made them delete my stuff. This is what I sent:\n\n&gt;The only reason I kept renewing my monthly subscription is to allow myself time to cull out the photos I want gone, and go down to the 1000 photos limit. Now it seems you have done it for me. It'd be easier to cull the photos if Organizr wasn't a piece of s\\*\\*\\*, so I was hoping the geniuses at SmugMug to come up with a much better solution to search within photos, and allow file operation, tagging, etc what ever, that's supposed be your cure all for Flickr's ineptitude, along with the Organizr. I kept up the subscription thinking you lot would come up with better organizing software, nope, until now nada, so what are the SmugMug people supposed to bring to the table? Frankly, if you can't do something to replace the godawful Organizr, I don't think it's worth spending the extra dollars ON TOP of the Flickr Pro price previously if this is your direction. So, I'll want the extra monthly subscription I paid reimbursed back to my card. Until you've come up with something better, better not PRE-EMPTIVELY RAISE the annual subscription just because your name is SmugMug.", "link": "https://www.reddit.com/r/photography/comments/ci6thc/got_all_my_photos_deleted_from_flickr_so_fair/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "got all my photos deleted from flickr; so fair warning to those still on that service. /!/ &gt;although we prohibit certain activities in these terms of use, smugmug does not make any representation or warranty that the user content you may encounter through your use of the services complies with these acceptable use provisions or the terms of use. your use of the services is solely at your own risk. these terms of use do not create any private right of action on the part of any third party or any reasonable expectation that the services will not contain any content that is prohibited by these acceptable use provisions.  \n&gt;  \n&gt;smugmug reserves the right (but is not obligated) to (i) review or screen any user content submitted to the site or otherwise submitted through the services; (ii) edit any user content posted on the services; and/or (iii) **remove any user content from the services for any reason, at any time, without prior notice, at our sole discretion.** smugmug will have no liability or responsibility to users of the services or any other person or entity for performance or nonperformance of such activities. smugmug’s enforcement of the acceptable use provisions set forth in these terms of use with respect to user content in some instances does not constitute a waiver of our right to enforce such provisions in other instances involving similar user content.\n\n&amp;#x200b;\n\n&gt;user content that is obscene, pornographic, indecent, lewd, sexually suggestive, including without limitation photos, videos or other user content containing nudity, unless you have restricted access to such user content with an appropriate content filter setting that will restrict viewing by minors;\n\nemphasis mine.\n\nprobably less and less old man penises, dudes in dresses, dry aged lady bits now on flickr, but at least back then, they don't delete your shit, and tell you to put it under restricted. get it reviewed, and if its a-ok, you're back in.\n\n&amp;#x200b;\n\n&gt; hello,  \n  \n&gt;  \n&gt;thank you for contacting flickr.  \n  \n&gt;  \n&gt;we have reviewed your account and found that it has been terminated for violating our terms of service. you are no longer permitted to use flickr services and we will not be providing you with any content that you previously uploaded to flickr.  \n  \n&gt;  \n&gt;future attempts to use flickr will result in the termination of the account.  \n  \n&gt;  \n&gt;best regards,  \n  \n&gt;  \n&gt;\\---------- --------------------  \nflickr trust &amp; safety \n\nthe last time before smugmug took over, i had my account reviewed, and of course, following their review recommendations, i made certain photos restricted or private, and had it back up again. following the buy out i don't think i've mass unrestricted my photos, so i'm scratching my head on that one. i think my jab at their practices made them delete my stuff. this is what i sent:\n\n&gt;the only reason i kept renewing my monthly subscription is to allow myself time to cull out the photos i want gone, and go down to the 1000 photos limit. now it seems you have done it for me. it'd be easier to cull the photos if organizr wasn't a piece of s\\*\\*\\*, so i was hoping the geniuses at smugmug to come up with a much better solution to search within photos, and allow file operation, -----> tagging !!! , etc what ever, that's supposed be your cure all for flickr's ineptitude, along with the organizr. i kept up the subscription thinking you lot would come up with better organizing software, nope, until now nada, so what are the smugmug people supposed to bring to the table? frankly, if you can't do something to replace the godawful organizr, i don't think it's worth spending the extra dollars on top of the flickr pro price previously if this is your direction. so, i'll want the extra monthly subscription i paid reimbursed back to my card. until you've come up with something better, better not pre-emptively raise the annual subscription just because your name is smugmug.", "sortedWord": "None", "identifyer": 69551, "year": "2019"}, {"Unnamed: 0": 324695, "autor": "mdchachi", "date": 1549733092000, "content": "Request: tips &amp; tricks for photo tagging conventions /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/aoucqm/request_tips_tricks_for_photo_tagging_conventions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "request: tips &amp; tricks for photo -----> tagging !!!  conventions /!/ [removed]", "sortedWord": "None", "identifyer": 72108, "year": "2019"}, {"Unnamed: 0": 325237, "autor": "fransnordstedt", "date": 1551505096000, "content": "Photomanagement tool that can use folder structure \"as tags\" and also drag and drop directly from chrome? /!/ hello, so im not a photographer but im trying to become a conceptual designer for games and movies, meaning ill need to have a massive library of reference images.  I need a photomanager that can show all pictures inside a folder (including the pictures inside its sub folders), and be able to do that with multiple folders, so basically like a hierarchical tagging system but with folders. I cant work with tags because many of the images i get from google and such already have a bunch of tags. Also its a pain in the ass to work with tags ....adding them, changing  them and such,just easier with folders.\n\nalso, being able to import images into the photomanager by dragging and dropping images directly from the browser would be nice. (for some reason, none of the photomanagers ive tried so far can do that, which is strange, cause its such a simple feature)\n\n&amp;#x200B;\n\nAny of you guys know such software?\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/awefud/photomanagement_tool_that_can_use_folder/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "photomanagement tool that can use folder structure \"as tags\" and also drag and drop directly from chrome? /!/ hello, so im not a photographer but im trying to become a conceptual designer for games and movies, meaning ill need to have a massive library of reference images.  i need a photomanager that can show all pictures inside a folder (including the pictures inside its sub folders), and be able to do that with multiple folders, so basically like a hierarchical -----> tagging !!!  system but with folders. i cant work with tags because many of the images i get from google and such already have a bunch of tags. also its a pain in the ass to work with tags ....adding them, changing  them and such,just easier with folders.\n\nalso, being able to import images into the photomanager by dragging and dropping images directly from the browser would be nice. (for some reason, none of the photomanagers ive tried so far can do that, which is strange, cause its such a simple feature)\n\n&amp;#x200b;\n\nany of you guys know such software?\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 72666, "year": "2019"}, {"Unnamed: 0": 336730, "autor": "kyotogirlsclub", "date": 1560000645000, "content": "Model took photo I took of her &amp; painted on it &amp; is now being featured in a gallery as her work with no credit to me or notification that this was happening. /!/ I'm a film photographer who often collaborates with a girl I'm friends with. We're not super close but have an easy relationship where we have a lot of fun when we do shoot which is every month or two. I was just scrolling through Insta &amp; saw a post where she was letting her followers know she's being featured as an artist in a gallery in the next couple weeks. It's all being presented as if it's her art from the ground up &amp; how incredible it is to collab with this other artist (he basically gave her studio space, helped her paint) &amp; it's been really amazing. I notice that she's blown up one of my photos of her, made it black &amp; white, &amp; then painted her hair &amp; sunglasses while then adding some painted squiggles in the background. This painting is featured the in the majority of this multi-photo Insta post. It's the same for other photos from various photographers she's worked with featured in the background of this post: they are all blown up images of herself from these photographers &amp; then painted on a bit. There is absolutely no mention of the photographers, of adding onto anyone's work, no credit, nothing. I also had no idea this was happening with this photo of mine. \n\nNow I would have had no problem with this if she had asked me - I actually would have been quite honored but it bothered me there was no heads up and then on top of that no credit &amp; that she is being featured as an artist in a gallery &amp; it's all being presented like it's all her own work with again... no acknowledgement to the photographers who gave her the foundation of her paintings which are still the main focus &amp; point even with the added paint/designs. I dm-ed her and was super congratulatory &amp; nice &amp; said I was so happy for her and how awesome this was. I said I'd love to be at the show to support her and said I didn't realize she was using one of my photos but I added in that she had obviously transformed it into her own beautiful art. I asked if she could please credit me at the show and when she posted. I then turned the convo to something else totally different &amp; ended on a really happy note. She responded back later &amp; only says \"no I definitely let you know in DMs or text I was doing this I was like heyyyyyyy I wanna paint this let's do it\" then follows up with \"but either way we can definitely shout you out whenever\" &amp; then \"however the best way to do that\". \n\nI obviously went back in our very limited text &amp; DM convos &amp; in less than a minute was able to see she 100% never gave a heads up or mentioned it in any shape, form, or fashion - so she's lying about that. The thing that got me the most though is that this girl is not dumb or ignorant when it comes to crediting. She's modeled tons of times &amp; always has been great at tagging photographers &amp; their photos. To word it as if they are throwing me a bone by \"shouting me out\" &amp; she doesn't' know the best way to do that is such a load of BS. You literally go \"photography by: so &amp; so\" \"art by: so &amp; so\". When you post pics of it you maybe tag the photographers in the photos? You maybe add in to the post talking about your art show or future posts talking about it that it's been so fun to add onto the portraits of herself by other photographers &amp; how it's so great to be able to build off of that or collab with artists in that way, etc etc. This is the most basic thing in the world. The fact that if I hadn't of seen that post my photo would have been in an art gallery with some squiggles painted on it &amp; the hair &amp; sunglasses painted &amp; being passed off as original work with no mention of me or my photography at all without me knowing is so wild to me? &amp; also these will potentially be sold! I of course understand legally she has transformed this in nature so it's now her art work totally &amp; she doesn't need to credit me, alert me, pay me, whatever - but morally this is pretty shitty? or am I just overreacting? This is someone I considered a friend &amp; who is normally really respectful &amp; great. It sucks because I just did a shoot with her the other day &amp; have 2 rolls of film to edit of her &amp; now have no idea what pic is gonna be used without notice &amp; without credit?", "link": "https://www.reddit.com/r/photography/comments/by7zn5/model_took_photo_i_took_of_her_painted_on_it_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "model took photo i took of her &amp; painted on it &amp; is now being featured in a gallery as her work with no credit to me or notification that this was happening. /!/ i'm a film photographer who often collaborates with a girl i'm friends with. we're not super close but have an easy relationship where we have a lot of fun when we do shoot which is every month or two. i was just scrolling through insta &amp; saw a post where she was letting her followers know she's being featured as an artist in a gallery in the next couple weeks. it's all being presented as if it's her art from the ground up &amp; how incredible it is to collab with this other artist (he basically gave her studio space, helped her paint) &amp; it's been really amazing. i notice that she's blown up one of my photos of her, made it black &amp; white, &amp; then painted her hair &amp; sunglasses while then adding some painted squiggles in the background. this painting is featured the in the majority of this multi-photo insta post. it's the same for other photos from various photographers she's worked with featured in the background of this post: they are all blown up images of herself from these photographers &amp; then painted on a bit. there is absolutely no mention of the photographers, of adding onto anyone's work, no credit, nothing. i also had no idea this was happening with this photo of mine. \n\nnow i would have had no problem with this if she had asked me - i actually would have been quite honored but it bothered me there was no heads up and then on top of that no credit &amp; that she is being featured as an artist in a gallery &amp; it's all being presented like it's all her own work with again... no acknowledgement to the photographers who gave her the foundation of her paintings which are still the main focus &amp; point even with the added paint/designs. i dm-ed her and was super congratulatory &amp; nice &amp; said i was so happy for her and how awesome this was. i said i'd love to be at the show to support her and said i didn't realize she was using one of my photos but i added in that she had obviously transformed it into her own beautiful art. i asked if she could please credit me at the show and when she posted. i then turned the convo to something else totally different &amp; ended on a really happy note. she responded back later &amp; only says \"no i definitely let you know in dms or text i was doing this i was like heyyyyyyy i wanna paint this let's do it\" then follows up with \"but either way we can definitely shout you out whenever\" &amp; then \"however the best way to do that\". \n\ni obviously went back in our very limited text &amp; dm convos &amp; in less than a minute was able to see she 100% never gave a heads up or mentioned it in any shape, form, or fashion - so she's lying about that. the thing that got me the most though is that this girl is not dumb or ignorant when it comes to crediting. she's modeled tons of times &amp; always has been great at -----> tagging !!!  photographers &amp; their photos. to word it as if they are throwing me a bone by \"shouting me out\" &amp; she doesn't' know the best way to do that is such a load of bs. you literally go \"photography by: so &amp; so\" \"art by: so &amp; so\". when you post pics of it you maybe tag the photographers in the photos? you maybe add in to the post talking about your art show or future posts talking about it that it's been so fun to add onto the portraits of herself by other photographers &amp; how it's so great to be able to build off of that or collab with artists in that way, etc etc. this is the most basic thing in the world. the fact that if i hadn't of seen that post my photo would have been in an art gallery with some squiggles painted on it &amp; the hair &amp; sunglasses painted &amp; being passed off as original work with no mention of me or my photography at all without me knowing is so wild to me? &amp; also these will potentially be sold! i of course understand legally she has transformed this in nature so it's now her art work totally &amp; she doesn't need to credit me, alert me, pay me, whatever - but morally this is pretty shitty? or am i just overreacting? this is someone i considered a friend &amp; who is normally really respectful &amp; great. it sucks because i just did a shoot with her the other day &amp; have 2 rolls of film to edit of her &amp; now have no idea what pic is gonna be used without notice &amp; without credit?", "sortedWord": "None", "identifyer": 84631, "year": "2019"}, {"Unnamed: 0": 337708, "autor": "greenbay20", "date": 1558033860000, "content": "App for rating, tagging and filtering photos /!/ I want to organize better my 100s of photos. I want to rate them so I can easily find my best photos and erase the worst ones. I also want to tag them so I can easily find a type of photo. \n\nAny existing apps out there? Does anyone else find value in something like this?", "link": "https://www.reddit.com/r/photography/comments/bpgp71/app_for_rating_tagging_and_filtering_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "app for rating, -----> tagging !!!  and filtering photos /!/ i want to organize better my 100s of photos. i want to rate them so i can easily find my best photos and erase the worst ones. i also want to tag them so i can easily find a type of photo. \n\nany existing apps out there? does anyone else find value in something like this?", "sortedWord": "None", "identifyer": 85697, "year": "2019"}], "name": "taggingphotography2019"}