{"interestingcomments": [{"Unnamed: 0": 269958, "autor": "potyike1990", "date": 1529428905000, "content": "Racers BIB Number Tagging /!/ Hello fellow photographers. Me and my team shoot a lot of sports (Marathons, bike races etc). Not long ago it came to our head that to make our services more professional we are looking into some race number tagging software. Do you guys have any info on this. We are willing to pay good money for it, if it works like we think it should. ", "link": "https://www.reddit.com/r/photography/comments/8sao2d/racers_bib_number_tagging/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "racers bib number -----> tagging !!!  /!/ hello fellow photographers. me and my team shoot a lot of sports (marathons, bike races etc). not long ago it came to our head that to make our services more professional we are looking into some race number tagging software. do you guys have any info on this. we are willing to pay good money for it, if it works like we think it should. ", "sortedWord": "None", "identifyer": 15723, "year": "2018"}, {"Unnamed: 0": 274970, "autor": "Digifenix", "date": 1526668654000, "content": "Promoting yourself online - share your experience /!/ I've been actively trying to increase my visibility using 3/4 sites and wanted to share my experience / hear yours:\n\n1. 500px \\- It's probably my biggest / most active site with about 1000 followers. I get good interaction on most posts \\(likes \\+ the occasional comments\\) which seems genuine \\(unlike the instagram bots\\). In recent years it's been getting more financially motivated with certain features \\(like the quests\\) requiring to be a paid member and the sales that never seem to work \\(to anyone I know\\). \n2. Instagram \\- The one platform I'm completely failing to understand. 90&amp;#37; of the interactions seems to be bots. I seem to lose followers almost as fast as I gain them and I'm forced to upload my photos via mobile which drives me crazy. I try to remain active here, but have very little faith / hope I'll ever catch on\n3. EyeEm \\- A really nice site that offered both the chance to get good visibility and the option to sell your photos \\- what's not to like. It feels like an odd combination of a microstock site and 500px. Bulk image upload works, but tagging \\(required for selling images\\) won't read meta data \\(making it useless to microstock photographer\\) while the level of interactions I get on my photos is very \\(very\\) limited with my last image getting 3 likes vs 93 in 500px.\n4. 1x \\- I used to love [1x.com](https://1x.com) and visit it quite regularly for inspiration but in the last 1\\-2 years it seems to have lost some of its popularity and a lot of the featured photos are just not as good as they used to be. I've also tried selling prints through them and had some mixed experience seeing my photos popping up at some rather odd places.\n\nI'd love to hear your experience and maybe even try to get some people from said sites to answer some questions?", "link": "https://www.reddit.com/r/photography/comments/8kfgc7/promoting_yourself_online_share_your_experience/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "promoting yourself online - share your experience /!/ i've been actively trying to increase my visibility using 3/4 sites and wanted to share my experience / hear yours:\n\n1. 500px \\- it's probably my biggest / most active site with about 1000 followers. i get good interaction on most posts \\(likes \\+ the occasional comments\\) which seems genuine \\(unlike the instagram bots\\). in recent years it's been getting more financially motivated with certain features \\(like the quests\\) requiring to be a paid member and the sales that never seem to work \\(to anyone i know\\). \n2. instagram \\- the one platform i'm completely failing to understand. 90&amp;#37; of the interactions seems to be bots. i seem to lose followers almost as fast as i gain them and i'm forced to upload my photos via mobile which drives me crazy. i try to remain active here, but have very little faith / hope i'll ever catch on\n3. eyeem \\- a really nice site that offered both the chance to get good visibility and the option to sell your photos \\- what's not to like. it feels like an odd combination of a microstock site and 500px. bulk image upload works, but -----> tagging !!!  \\(required for selling images\\) won't read meta data \\(making it useless to microstock photographer\\) while the level of interactions i get on my photos is very \\(very\\) limited with my last image getting 3 likes vs 93 in 500px.\n4. 1x \\- i used to love [1x.com](https://1x.com) and visit it quite regularly for inspiration but in the last 1\\-2 years it seems to have lost some of its popularity and a lot of the featured photos are just not as good as they used to be. i've also tried selling prints through them and had some mixed experience seeing my photos popping up at some rather odd places.\n\ni'd love to hear your experience and maybe even try to get some people from said sites to answer some questions?", "sortedWord": "None", "identifyer": 20913, "year": "2018"}, {"Unnamed: 0": 276376, "autor": "ZoidbergRage", "date": 1532818783000, "content": "I worked as a photographer at a sports camp for two weeks and this is what I learned /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\n**My Gear:**\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\n**How to Capture Sports 101:**\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and AI Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. Some famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance. Get to know the campers as well because then it makes them feel more comfortable around you. Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.\n\n**Workflow:**\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**Final Thoughts:\n**\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/", "link": "https://www.reddit.com/r/photography/comments/92q9i0/i_worked_as_a_photographer_at_a_sports_camp_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i worked as a photographer at a sports camp for two weeks and this is what i learned /!/ hello everyone, i just got back from working at the national ultimate training camp as a photographer for the past two weeks. i learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nto start things off this is not my first time shooting sports. i have a lots of experience working as a photographer for my college newspaper where i documented pretty much all the sports teams over four years. so coming into working this camp i was definitely in my element. secondly i know the sport of ultimate frisbee very well. i have been playing the sport for over a decade (i will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[some of my best shots](https://imgur.com/a/pcl8c10)\n\n**my gear:**\n\ncanon 6d / canon 5d mk ii\n\ntamron 24-70 f/2.8\n\ntamron 150-600 f/5-6.3 g2\n\nyongnuo 85 1.8\n\nusa gear double camera harness\n\ndell inspiron i7, 16gb ram, 250gb ssd laptop\n\nkingston multi card reader usb 3.0\n\nnew balance running shoes\n\nmy gear was pretty standard for long form documentation of any sporting event. one body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6d + 150-600). i used a double camera harness off amazon and in retrospect it’s pretty bad. i should have dropped the money to get the black rapid harness because the one i used was slightly uncomfortable and needed to be readjusted on a regular basis. while it was bad, it got the job done so i can’t really complain. my laptop is no beast but i could process all my photos with little to no slowdown. also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\n**how to capture sports 101:**\n\nthe most important part of shooting sports is understanding the game. with my experience with ultimate frisbee, i knew how the game flowed so i could accurately predict what kind of plays were about to happen. this helped with my positioning around the field as well. i would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. each approach helped me achieve certain types of photos. the long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. as a “one man band” i couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nwhen it came to focal length, shooting at the farthest was the most ideal. with the tamron 150-600 i stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where i could crop tighter if need be. most of the time i shoot on shutter priority at 1/1000th with auto iso. this guaranteed that i could freeze any motion and seeing as though it was very bright out my iso never moved past 800. the exception was that once a week the camp had a night game where i moved down to 1/800 so i could get a little more light and ease up on the iso. burst mode and ai servo mode for af were a necessity for this kind of shooting. back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. for the more detailed and close up shots i would have my 24-70 at my hip mostly locked at 24mm. this was important because if two kids were having a laugh or the counselors were giving advice to a camper i could quickly pull up my wide angle and snap a few shots before the moment went away. i would mostly keep this at 2.8 and a relatively high shutter speed. some famous photographer said that if your photos suck you probably aren’t close enough. this is possibly the one thing i would want people to get out of this post. with my wide angle shots i was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. also with the long telephoto the closer i could get physically to the action, the less compression i got and that would lead to less flat photos. don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. with that being said, prepare for the work that you will be doing later. i would delete any photo that i thought would not be a keeper. missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. instead of having to go through hundreds of photos at the end of the night, i would have a few dozen of photos that i knew were good enough. i did a lot of “chimping” while out at the fields so i could save time in processing later.\n\nmy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” sometimes the best plays or highlights don’t show what the camp is actually like. i would take a lot of photos of just the kids laughing or all around being happy. focus on the fun moments and also the exciting moments for a good balance. get to know the campers as well because then it makes them feel more comfortable around you. find the personal moments because those are the ones that really show what the camp atmosphere is all about. one aspect of the photography that i tried to focus on was keep the photos aesthetically simple. the background is just as important as the foreground. even an out of focus cluttered background will make a good shot look bad. search out clean and simple backgrounds for your photos because it makes the subject standout.\n\n**workflow:**\n\nsince it was my job to not just document the action on the field but to capture off field activities as well, i was working pretty much all day with little time for breaks. the most important piece of advice from me in this regard would be to shoot jpeg. not only did it save me a lot of time importing and processing, i could focus on getting the exposure correct in camera so i wouldn’t need to spend lots of time correcting lazy mistakes after the fact. also canon jpeg have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. whenever i was not obligated to be somewhere taking photos i would be ingesting all my photos onto my laptop to be processed. if i had time i would process the photos and the importance of getting the exposure right in camera was that all i really had to do was crop most of the keepers. learning lightroom’s shortcuts will make your processing so much faster. cropping, -----> tagging !!! , and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**final thoughts:\n**\nthis was probably the most fun i have ever had working a job. they say if you like what you do that you’ll never work a day in your life. while the hours were long and the constant work stressed me out, i had a smile on my face the whole time. i recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something i’ll remember for a long time. at the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. please feel free to ask questions in the comments because i for sure did not cover everything. thanks for reading and feel free to check out my other work on my website or follow me on my street photography instagram.\n\nnutc website: http://nutc.net/\n\nmy website: http://www.aleczabrecky.com\n\nmy instagram: www.instagram.com/zabreklz/", "sortedWord": "None", "identifyer": 22381, "year": "2018"}, {"Unnamed: 0": 276601, "autor": "finerrecliner", "date": 1534183775000, "content": "How to outsource photo tagging/keywords? /!/ One way to make your photos easy to find on portfolio sites (flickr, 500px, etc), and stock sites (adobe, shutterstock, etc) is to include a lot of tags/keywords with each photo. For me, this isn't a challenging task, but it is a very time consuming task. Especially if you have a lot of images to tag. Has anyone tried to outsource this task to others for a small payment? Maybe on Fiverr, Amazon's Mechanical Turk, or elsewhere?", "link": "https://www.reddit.com/r/photography/comments/970njv/how_to_outsource_photo_taggingkeywords/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "how to outsource photo -----> tagging !!! /keywords? /!/ one way to make your photos easy to find on portfolio sites (flickr, 500px, etc), and stock sites (adobe, shutterstock, etc) is to include a lot of tags/keywords with each photo. for me, this isn't a challenging task, but it is a very time consuming task. especially if you have a lot of images to tag. has anyone tried to outsource this task to others for a small payment? maybe on fiverr, amazon's mechanical turk, or elsewhere?", "sortedWord": "None", "identifyer": 22615, "year": "2018"}, {"Unnamed: 0": 278874, "autor": "heymadisonn", "date": 1542297505000, "content": "Is there a way to keyword in Bridge that can be visable/searchable for non-Bridge users? /!/ Hi everyone, \n\nSorry if this is the wrong sub, just seemed like the best place to ask. \n\nI work at a small company that is in the process of organizing our digital asset library. As a management tool, we on the marketing team have decided Bridge has everything we need and you can't beat the price of free. The option to keyword photos is the biggest benefit because it'll help us from having to duplicate photos into appropriate folders (we're a catering company, so for example: A photo we've acquired of a wedding entree at one of our exclusive venues would be useful to find when we're promoting the venue **or** showing the entree to another client, so we currently have the same photo copied into the venue folder **and** a comprehensive food folder. Tagging eliminates these differences). \n\n&amp;#x200B;\n\nHowever, there are many people who work at the company (specifically in sales/event planning departments) who use our photo library as well, just searching through folders on our server. Trying to teach everyone how to use Bridge and search via keywords isn't ideal, so we're trying to figure out a way that the rest of the team can simply search for the photo *tags* using their PC file browser. It looks like keywords that are written to JPG metadata within Bridge don't automatically write to the file as tags, unfortunately. Does anyone know of a way to allow Bridge-assigned keywords to be viewable/searchable without using Bridge? Thank you! \n\n&amp;#x200B;\n\ntl;dr - Marketing team uses Bridge, but doesn't want to make everyone else cranky by forcing them to leave the comfort of their PC file browser and switch over to Bridge. How can we make Bridge-assigned keywords translate over to the actual file in a way that is searchable (or filter-able) on a generic PC file browser?", "link": "https://www.reddit.com/r/photography/comments/9xcer4/is_there_a_way_to_keyword_in_bridge_that_can_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "is there a way to keyword in bridge that can be visable/searchable for non-bridge users? /!/ hi everyone, \n\nsorry if this is the wrong sub, just seemed like the best place to ask. \n\ni work at a small company that is in the process of organizing our digital asset library. as a management tool, we on the marketing team have decided bridge has everything we need and you can't beat the price of free. the option to keyword photos is the biggest benefit because it'll help us from having to duplicate photos into appropriate folders (we're a catering company, so for example: a photo we've acquired of a wedding entree at one of our exclusive venues would be useful to find when we're promoting the venue **or** showing the entree to another client, so we currently have the same photo copied into the venue folder **and** a comprehensive food folder. -----> tagging !!!  eliminates these differences). \n\n&amp;#x200b;\n\nhowever, there are many people who work at the company (specifically in sales/event planning departments) who use our photo library as well, just searching through folders on our server. trying to teach everyone how to use bridge and search via keywords isn't ideal, so we're trying to figure out a way that the rest of the team can simply search for the photo *tags* using their pc file browser. it looks like keywords that are written to jpg metadata within bridge don't automatically write to the file as tags, unfortunately. does anyone know of a way to allow bridge-assigned keywords to be viewable/searchable without using bridge? thank you! \n\n&amp;#x200b;\n\ntl;dr - marketing team uses bridge, but doesn't want to make everyone else cranky by forcing them to leave the comfort of their pc file browser and switch over to bridge. how can we make bridge-assigned keywords translate over to the actual file in a way that is searchable (or filter-able) on a generic pc file browser?", "sortedWord": "None", "identifyer": 24964, "year": "2018"}, {"Unnamed: 0": 283845, "autor": "ZoidbergRage", "date": 1532801433000, "content": "I worked as a photographer for a sports camp for two weeks and this is what I learned /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\nMy Gear:\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\nHow to Capture Sports 101:\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and AI Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. Some famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance. Get to know the campers as well because then it makes them feel more comfortable around you. Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.\n\nWorkflow:\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\nFinal Thoughts:\n\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/", "link": "https://www.reddit.com/r/photography/comments/92o582/i_worked_as_a_photographer_for_a_sports_camp_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i worked as a photographer for a sports camp for two weeks and this is what i learned /!/ hello everyone, i just got back from working at the national ultimate training camp as a photographer for the past two weeks. i learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nto start things off this is not my first time shooting sports. i have a lots of experience working as a photographer for my college newspaper where i documented pretty much all the sports teams over four years. so coming into working this camp i was definitely in my element. secondly i know the sport of ultimate frisbee very well. i have been playing the sport for over a decade (i will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[some of my best shots](https://imgur.com/a/pcl8c10)\n\nmy gear:\n\ncanon 6d / canon 5d mk ii\n\ntamron 24-70 f/2.8\n\ntamron 150-600 f/5-6.3 g2\n\nyongnuo 85 1.8\n\nusa gear double camera harness\n\ndell inspiron i7, 16gb ram, 250gb ssd laptop\n\nkingston multi card reader usb 3.0\n\nnew balance running shoes\n\nmy gear was pretty standard for long form documentation of any sporting event. one body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6d + 150-600). i used a double camera harness off amazon and in retrospect it’s pretty bad. i should have dropped the money to get the black rapid harness because the one i used was slightly uncomfortable and needed to be readjusted on a regular basis. while it was bad, it got the job done so i can’t really complain. my laptop is no beast but i could process all my photos with little to no slowdown. also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\nhow to capture sports 101:\n\nthe most important part of shooting sports is understanding the game. with my experience with ultimate frisbee, i knew how the game flowed so i could accurately predict what kind of plays were about to happen. this helped with my positioning around the field as well. i would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. each approach helped me achieve certain types of photos. the long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. as a “one man band” i couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nwhen it came to focal length, shooting at the farthest was the most ideal. with the tamron 150-600 i stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where i could crop tighter if need be. most of the time i shoot on shutter priority at 1/1000th with auto iso. this guaranteed that i could freeze any motion and seeing as though it was very bright out my iso never moved past 800. the exception was that once a week the camp had a night game where i moved down to 1/800 so i could get a little more light and ease up on the iso. burst mode and ai servo mode for af were a necessity for this kind of shooting. back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. for the more detailed and close up shots i would have my 24-70 at my hip mostly locked at 24mm. this was important because if two kids were having a laugh or the counselors were giving advice to a camper i could quickly pull up my wide angle and snap a few shots before the moment went away. i would mostly keep this at 2.8 and a relatively high shutter speed. some famous photographer said that if your photos suck you probably aren’t close enough. this is possibly the one thing i would want people to get out of this post. with my wide angle shots i was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. also with the long telephoto the closer i could get physically to the action, the less compression i got and that would lead to less flat photos. don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. with that being said, prepare for the work that you will be doing later. i would delete any photo that i thought would not be a keeper. missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. instead of having to go through hundreds of photos at the end of the night, i would have a few dozen of photos that i knew were good enough. i did a lot of “chimping” while out at the fields so i could save time in processing later.\n\nmy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” sometimes the best plays or highlights don’t show what the camp is actually like. i would take a lot of photos of just the kids laughing or all around being happy. focus on the fun moments and also the exciting moments for a good balance. get to know the campers as well because then it makes them feel more comfortable around you. find the personal moments because those are the ones that really show what the camp atmosphere is all about. one aspect of the photography that i tried to focus on was keep the photos aesthetically simple. the background is just as important as the foreground. even an out of focus cluttered background will make a good shot look bad. search out clean and simple backgrounds for your photos because it makes the subject standout.\n\nworkflow:\n\nsince it was my job to not just document the action on the field but to capture off field activities as well, i was working pretty much all day with little time for breaks. the most important piece of advice from me in this regard would be to shoot jpeg. not only did it save me a lot of time importing and processing, i could focus on getting the exposure correct in camera so i wouldn’t need to spend lots of time correcting lazy mistakes after the fact. also canon jpeg have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. whenever i was not obligated to be somewhere taking photos i would be ingesting all my photos onto my laptop to be processed. if i had time i would process the photos and the importance of getting the exposure right in camera was that all i really had to do was crop most of the keepers. learning lightroom’s shortcuts will make your processing so much faster. cropping, -----> tagging !!! , and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\nfinal thoughts:\n\nthis was probably the most fun i have ever had working a job. they say if you like what you do that you’ll never work a day in your life. while the hours were long and the constant work stressed me out, i had a smile on my face the whole time. i recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something i’ll remember for a long time. at the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. please feel free to ask questions in the comments because i for sure did not cover everything. thanks for reading and feel free to check out my other work on my website or follow me on my street photography instagram.\n\nnutc website: http://nutc.net/\n\nmy website: http://www.aleczabrecky.com\n\nmy instagram: www.instagram.com/zabreklz/", "sortedWord": "None", "identifyer": 30125, "year": "2018"}, {"Unnamed: 0": 283846, "autor": "ZoidbergRage", "date": 1532801362000, "content": "New Post /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\n**My Gear:**\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet. \n\n**How to Capture Sports 101:**\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and AI Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. \nSome famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance.  Get to know the campers as well because then it makes them feel more comfortable around you.  Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.  \n\n**Workflow:**\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**Final Thoughts:**\n\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/\n\n", "link": "https://www.reddit.com/r/photography/comments/92o4vj/new_post/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "new post /!/ hello everyone, i just got back from working at the national ultimate training camp as a photographer for the past two weeks. i learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nto start things off this is not my first time shooting sports. i have a lots of experience working as a photographer for my college newspaper where i documented pretty much all the sports teams over four years. so coming into working this camp i was definitely in my element. secondly i know the sport of ultimate frisbee very well. i have been playing the sport for over a decade (i will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[some of my best shots](https://imgur.com/a/pcl8c10)\n\n**my gear:**\n\ncanon 6d / canon 5d mk ii\n\ntamron 24-70 f/2.8\n\ntamron 150-600 f/5-6.3 g2\n\nyongnuo 85 1.8\n\nusa gear double camera harness\n\ndell inspiron i7, 16gb ram, 250gb ssd laptop\n\nkingston multi card reader usb 3.0\n\nnew balance running shoes\n\n\nmy gear was pretty standard for long form documentation of any sporting event. one body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6d + 150-600). i used a double camera harness off amazon and in retrospect it’s pretty bad. i should have dropped the money to get the black rapid harness because the one i used was slightly uncomfortable and needed to be readjusted on a regular basis. while it was bad, it got the job done so i can’t really complain. my laptop is no beast but i could process all my photos with little to no slowdown. also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet. \n\n**how to capture sports 101:**\n\nthe most important part of shooting sports is understanding the game. with my experience with ultimate frisbee, i knew how the game flowed so i could accurately predict what kind of plays were about to happen. this helped with my positioning around the field as well. i would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. each approach helped me achieve certain types of photos. the long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. as a “one man band” i couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nwhen it came to focal length, shooting at the farthest was the most ideal. with the tamron 150-600 i stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where i could crop tighter if need be. most of the time i shoot on shutter priority at 1/1000th with auto iso. this guaranteed that i could freeze any motion and seeing as though it was very bright out my iso never moved past 800. the exception was that once a week the camp had a night game where i moved down to 1/800 so i could get a little more light and ease up on the iso. burst mode and ai servo mode for af were a necessity for this kind of shooting. back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. for the more detailed and close up shots i would have my 24-70 at my hip mostly locked at 24mm. this was important because if two kids were having a laugh or the counselors were giving advice to a camper i could quickly pull up my wide angle and snap a few shots before the moment went away. i would mostly keep this at 2.8 and a relatively high shutter speed. \nsome famous photographer said that if your photos suck you probably aren’t close enough. this is possibly the one thing i would want people to get out of this post. with my wide angle shots i was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. also with the long telephoto the closer i could get physically to the action, the less compression i got and that would lead to less flat photos. don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. with that being said, prepare for the work that you will be doing later. i would delete any photo that i thought would not be a keeper. missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. instead of having to go through hundreds of photos at the end of the night, i would have a few dozen of photos that i knew were good enough. i did a lot of “chimping” while out at the fields so i could save time in processing later.\n\nmy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” sometimes the best plays or highlights don’t show what the camp is actually like. i would take a lot of photos of just the kids laughing or all around being happy. focus on the fun moments and also the exciting moments for a good balance.  get to know the campers as well because then it makes them feel more comfortable around you.  find the personal moments because those are the ones that really show what the camp atmosphere is all about. one aspect of the photography that i tried to focus on was keep the photos aesthetically simple. the background is just as important as the foreground. even an out of focus cluttered background will make a good shot look bad. search out clean and simple backgrounds for your photos because it makes the subject standout.  \n\n**workflow:**\n\nsince it was my job to not just document the action on the field but to capture off field activities as well, i was working pretty much all day with little time for breaks. the most important piece of advice from me in this regard would be to shoot jpeg. not only did it save me a lot of time importing and processing, i could focus on getting the exposure correct in camera so i wouldn’t need to spend lots of time correcting lazy mistakes after the fact. also canon jpeg have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. whenever i was not obligated to be somewhere taking photos i would be ingesting all my photos onto my laptop to be processed. if i had time i would process the photos and the importance of getting the exposure right in camera was that all i really had to do was crop most of the keepers. learning lightroom’s shortcuts will make your processing so much faster. cropping, -----> tagging !!! , and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**final thoughts:**\n\nthis was probably the most fun i have ever had working a job. they say if you like what you do that you’ll never work a day in your life. while the hours were long and the constant work stressed me out, i had a smile on my face the whole time. i recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something i’ll remember for a long time. at the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. please feel free to ask questions in the comments because i for sure did not cover everything. thanks for reading and feel free to check out my other work on my website or follow me on my street photography instagram.\n\nnutc website: http://nutc.net/\n\nmy website: http://www.aleczabrecky.com\n\nmy instagram: www.instagram.com/zabreklz/\n\n", "sortedWord": "None", "identifyer": 30126, "year": "2018"}], "name": "taggingphotography2018"}