{"interestingcomments": [{"Unnamed: 0": 265673, "autor": "CWHats", "date": 1527210239000, "content": "Super Amateur Needs Help with Planning a Soot /!/ I hppe you guys can help.\n\nI have been tagged by my company to arrange and shoot pictures for our ad materials. We have no money so we are going in house. My problem is trying to organize a sort of checklist or guide that will wrangle 10 people in various types of clothes and posing with different people and with different props. Anything I have tried to make just becomes an unwieldy mess in MS Word. Arg!\n\nIs there a document you guys use to help organize a shoot? Thanks in advance.", "link": "https://www.reddit.com/r/photography/comments/8lxtiq/super_amateur_needs_help_with_planning_a_soot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "super amateur needs help with planning a soot /!/ i hppe you guys can help.\n\ni have been -----> tagged !!!  by my company to arrange and shoot pictures for our ad materials. we have no money so we are going in house. my problem is trying to organize a sort of checklist or guide that will wrangle 10 people in various types of clothes and posing with different people and with different props. anything i have tried to make just becomes an unwieldy mess in ms word. arg!\n\nis there a document you guys use to help organize a shoot? thanks in advance.", "sortedWord": "None", "identifyer": 11278, "year": "2018"}, {"Unnamed: 0": 265793, "autor": "No1JN", "date": 1533575041000, "content": "Friend took some photos for me /!/ I paid him for some photos and he asked me to tag him.\n\nI had already wrote his name in the comments.\n\nHes being sensitive. I paid him generously for photos.\n\nWhat is the general protocol for something like this?", "link": "https://www.reddit.com/r/photography/comments/95325t/friend_took_some_photos_for_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "friend took some photos for me /!/ i paid him for some photos and he asked me to -----> tag !!!  him.\n\ni had already wrote his name in the comments.\n\nhes being sensitive. i paid him generously for photos.\n\nwhat is the general protocol for something like this?", "sortedWord": "None", "identifyer": 11399, "year": "2018"}, {"Unnamed: 0": 266767, "autor": "BrokenMasterpiece", "date": 1525654885000, "content": "Instagram Tags /!/ I noticed a few months ago that Instagram tags are doing very little to get my work out to people who aren't on my feed. I'm getting 10x less likes on my photos compared to what I used to. Any tips on using tags on IG?", "link": "https://www.reddit.com/r/photography/comments/8hjqua/instagram_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "instagram -----> tags !!!  /!/ i noticed a few months ago that instagram tags are doing very little to get my work out to people who aren't on my feed. i'm getting 10x less likes on my photos compared to what i used to. any tips on using tags on ig?", "sortedWord": "None", "identifyer": 12413, "year": "2018"}, {"Unnamed: 0": 267002, "autor": "MayIServeYouWell", "date": 1527128660000, "content": "I wish all paper name tags were made with a neutral white or gray. /!/ It would make white balance so much easier when doing candid photos of people at a conference, etc. As it is, they're all a bit different, usually a bit bluish it seems. ", "link": "https://www.reddit.com/r/photography/comments/8lp5pe/i_wish_all_paper_name_tags_were_made_with_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i wish all paper name -----> tags !!!  were made with a neutral white or gray. /!/ it would make white balance so much easier when doing candid photos of people at a conference, etc. as it is, they're all a bit different, usually a bit bluish it seems. ", "sortedWord": "None", "identifyer": 12655, "year": "2018"}, {"Unnamed: 0": 267098, "autor": "MickCJ", "date": 1528724188000, "content": "Web Presence. /!/ At this point in my photography I just want to sell enough product to fund my photography hobby at least partially. I mainly focus on landscape photography. \n\nA big part of gaining funding is social media and search engine visibility. Unfortunately, in my opinion, I'm lacking in both of these. \n\nI have a hair over 200 followers on my Facebook page. \n\nMy website only shows up on Google when I search my first and last name (unique last name). It's the 4th link down behind LinkedIn results, White Pages, and Image results (not of my photos). \n\nHere's what I'm doing to try and gain more visibility but I want to know what I might be doing wrong or can do better. \n\n**Facebook**\n\nInstead of just sharing with friends I'm searching for active, relevant Groups, and sharing my photos there with an anecdote, etc.  about the photo. \n\nPaying to boost posts. It's not something I do a lot but I will a few times a year. \n\nThat's about all I have for gaining more followers on Facebook. \n\n**Web Traffic &amp; Google**\n\nI recently made adjustments to my Smugmug based website. I've had my own domain since the beginning. However, I went through every picture and added key words/tags to each one. I also updated general keywords/tags for my entire site. \n\nAfter this I went to Google Webmaster Tools and requested google to fetch &amp; re-crawl my site. Searches still show up the same. Image search results don't result in my photos. In fact, they'll result in one or two photos from Facebook but that's it. The rest are just pictures of other people. \n\nMonths ago, in the, \"About,\" section I added stuff about family, home, etc. I've read that Google likes this sort of stuff. \n\nGranted, some of these changes were made only a week ago. I had Google crawl my site on 6/3 and again today. \n\nWhat am I doing wrong, what can I do better, or what do I need to be doing? ", "link": "https://www.reddit.com/r/photography/comments/8q9ksk/web_presence/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "web presence. /!/ at this point in my photography i just want to sell enough product to fund my photography hobby at least partially. i mainly focus on landscape photography. \n\na big part of gaining funding is social media and search engine visibility. unfortunately, in my opinion, i'm lacking in both of these. \n\ni have a hair over 200 followers on my facebook page. \n\nmy website only shows up on google when i search my first and last name (unique last name). it's the 4th link down behind linkedin results, white pages, and image results (not of my photos). \n\nhere's what i'm doing to try and gain more visibility but i want to know what i might be doing wrong or can do better. \n\n**facebook**\n\ninstead of just sharing with friends i'm searching for active, relevant groups, and sharing my photos there with an anecdote, etc.  about the photo. \n\npaying to boost posts. it's not something i do a lot but i will a few times a year. \n\nthat's about all i have for gaining more followers on facebook. \n\n**web traffic &amp; google**\n\ni recently made adjustments to my smugmug based website. i've had my own domain since the beginning. however, i went through every picture and added key words/-----> tags !!!  to each one. i also updated general keywords/tags for my entire site. \n\nafter this i went to google webmaster tools and requested google to fetch &amp; re-crawl my site. searches still show up the same. image search results don't result in my photos. in fact, they'll result in one or two photos from facebook but that's it. the rest are just pictures of other people. \n\nmonths ago, in the, \"about,\" section i added stuff about family, home, etc. i've read that google likes this sort of stuff. \n\ngranted, some of these changes were made only a week ago. i had google crawl my site on 6/3 and again today. \n\nwhat am i doing wrong, what can i do better, or what do i need to be doing? ", "sortedWord": "None", "identifyer": 12752, "year": "2018"}, {"Unnamed: 0": 267105, "autor": "bustyLaserCannon", "date": 1528718132000, "content": "Good hashtag generator that isn’t Focalmark or displaypurposes? /!/ Finding that the tags don’t usually match and abstract away quite a bit from the search terms.\n\nAnyone have a good source for hashtags for social media or another app to recommend?\n\nSpecially I’m looking for Instagram tags", "link": "https://www.reddit.com/r/photography/comments/8q8xt9/good_hashtag_generator_that_isnt_focalmark_or/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "good hashtag generator that isn’t focalmark or displaypurposes? /!/ finding that the -----> tags !!!  don’t usually match and abstract away quite a bit from the search terms.\n\nanyone have a good source for hashtags for social media or another app to recommend?\n\nspecially i’m looking for instagram tags", "sortedWord": "None", "identifyer": 12759, "year": "2018"}, {"Unnamed: 0": 267366, "autor": "ICanSeeYou7867", "date": 1533412815000, "content": "I am lost... Looking for a travel friendly camera /!/ My wife is pseudo in photography and we are going to greece at the end of September.  She has been talking about getting better with photography and how it would be cool to have a better camera than our cell phones.\n\nTurns out her birthday is around the same time.  I wanted to surprise her with an early birthday present, however I have a few criteria...\n\n* Fairly Compact (Traveling after all!  Unfortunately it looks like DSLRs wont fit this bill)\n* Under $500.00\n* Overall good camera (low light, daytime, stability, features, etc...)\n\nI am sure their is a great camera out there that fits all of these with a higher price tag.  But I was curious to get some expert opinions if possible!\n\nHere is what I have found so far:\n\n* SONY RX100\n* Sony a5100\n* Canon PowerShot G7 X Mark II\n\nI like the mirrorless technology, however I am wary of the A5100.  It seems to be lacking features at the cost of giving you the mirrorless tecnology.\n\nThe Canon G7 X so far seems to be one of the better \"all around\" cameras.  Thanks for reading! Looking forward to whatever guidance I can get :D", "link": "https://www.reddit.com/r/photography/comments/94lysw/i_am_lost_looking_for_a_travel_friendly_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i am lost... looking for a travel friendly camera /!/ my wife is pseudo in photography and we are going to greece at the end of september.  she has been talking about getting better with photography and how it would be cool to have a better camera than our cell phones.\n\nturns out her birthday is around the same time.  i wanted to surprise her with an early birthday present, however i have a few criteria...\n\n* fairly compact (traveling after all!  unfortunately it looks like dslrs wont fit this bill)\n* under $500.00\n* overall good camera (low light, daytime, stability, features, etc...)\n\ni am sure their is a great camera out there that fits all of these with a higher price -----> tag !!! .  but i was curious to get some expert opinions if possible!\n\nhere is what i have found so far:\n\n* sony rx100\n* sony a5100\n* canon powershot g7 x mark ii\n\ni like the mirrorless technology, however i am wary of the a5100.  it seems to be lacking features at the cost of giving you the mirrorless tecnology.\n\nthe canon g7 x so far seems to be one of the better \"all around\" cameras.  thanks for reading! looking forward to whatever guidance i can get :d", "sortedWord": "None", "identifyer": 13027, "year": "2018"}, {"Unnamed: 0": 267544, "autor": "wetphotos", "date": 1536604432000, "content": "Inkjet of a collodion hanging at a major art museum. Is that the standard? /!/ I was in an art museum for American art over the weekend and geeked out when I saw some giant collodions from across the gallery. As soon as I got close I could tell something was off about them, then reading the tag they were listed as Inkjet prints of a collodion photograph.  \n\nI get it. Collodion makes a one-off piece and then you can only sell it once. But my gut reaction was disappointment. It seemed like a cheap way out for a proper museum.  They were hung next to some original Edward Sheriff Curtis photogravures which highlighted the difference.\n\nOn one hand, the nature of modern photography includes reproducibility. If it wasn’t reproduced then I likely wouldn’t have seen the work at all.\n\nOn the other hand, this was reproduced into a whole different medium which degraded the quality. You would never see a reproduction print of a painting on the wall of a museum.\n\nWas my gut response an overreaction? Is this standard practice elsewhere? What are your thoughts?\n\n", "link": "https://www.reddit.com/r/photography/comments/9eprvn/inkjet_of_a_collodion_hanging_at_a_major_art/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "inkjet of a collodion hanging at a major art museum. is that the standard? /!/ i was in an art museum for american art over the weekend and geeked out when i saw some giant collodions from across the gallery. as soon as i got close i could tell something was off about them, then reading the -----> tag !!!  they were listed as inkjet prints of a collodion photograph.  \n\ni get it. collodion makes a one-off piece and then you can only sell it once. but my gut reaction was disappointment. it seemed like a cheap way out for a proper museum.  they were hung next to some original edward sheriff curtis photogravures which highlighted the difference.\n\non one hand, the nature of modern photography includes reproducibility. if it wasn’t reproduced then i likely wouldn’t have seen the work at all.\n\non the other hand, this was reproduced into a whole different medium which degraded the quality. you would never see a reproduction print of a painting on the wall of a museum.\n\nwas my gut response an overreaction? is this standard practice elsewhere? what are your thoughts?\n\n", "sortedWord": "None", "identifyer": 13211, "year": "2018"}, {"Unnamed: 0": 267976, "autor": "raijinirish", "date": 1542808200000, "content": "Posting after a falling out /!/ I recently had a falling out with a “model” who was a friend of a friend because how they treated the mutual friend. I was supposed to post the pictures we took but not till after they posted them to their social media. Since then the falling out occurred and they haven’t posted them and ignored my messages about posting the pictures.I was wondering what the sub thought about just posting the pictures and tagging the person.", "link": "https://www.reddit.com/r/photography/comments/9z3d6w/posting_after_a_falling_out/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "posting after a falling out /!/ i recently had a falling out with a “model” who was a friend of a friend because how they treated the mutual friend. i was supposed to post the pictures we took but not till after they posted them to their social media. since then the falling out occurred and they haven’t posted them and ignored my messages about posting the pictures.i was wondering what the sub thought about just posting the pictures and -----> tagging !!!  the person.", "sortedWord": "None", "identifyer": 13665, "year": "2018"}, {"Unnamed: 0": 268239, "autor": "BroDoc22", "date": 1515382305000, "content": "Contacted by a brand through instagram, how should I proceed? /!/ I posted a picture earlier today on instagram and tagged a company the jacket was made by. I just got an email from the marketing time asking if they could repost it and would give me credit. Is this enough? Do I have a right to charge or would this be a good opportunity to ask to collaborate on future posts? \n\nSorry if this seems like a stupid question, I'm totally new to this and want to make sure I do this right, thanks everyone! ", "link": "https://www.reddit.com/r/photography/comments/7ovrg2/contacted_by_a_brand_through_instagram_how_should/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "contacted by a brand through instagram, how should i proceed? /!/ i posted a picture earlier today on instagram and -----> tagged !!!  a company the jacket was made by. i just got an email from the marketing time asking if they could repost it and would give me credit. is this enough? do i have a right to charge or would this be a good opportunity to ask to collaborate on future posts? \n\nsorry if this seems like a stupid question, i'm totally new to this and want to make sure i do this right, thanks everyone! ", "sortedWord": "None", "identifyer": 13942, "year": "2018"}, {"Unnamed: 0": 268271, "autor": "B33fington", "date": 1515347786000, "content": "Introducing r/Digital /!/ Edit: I'm willing to see how things go with mobile phone images. I was trying to form a non-casual type of digital photography community for image sharing, discussion and critique but blanket banning mobile phone images was the wrong way to go about it.\n\n--------------------------------------------------------\n\nHi Everyone! \n\nI was recently given sole mod access to /r/Digital. My hope is to make it into a digital equivalent to r/Analog where photographers can share their own photos, have a discussion and give/receive critique. Some simple rules are in place: ~~no mobile phone images,~~ camera and lens (if applicable) in the title, nsfw must be tagged as such, etc. \n\nI've given the sub a very basic makeover in terms of css. It's still a work in progress but comments are welcome. :D\n\nPlease come by and post some of your work.", "link": "https://www.reddit.com/r/photography/comments/7os2h6/introducing_rdigital/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "introducing r/digital /!/ edit: i'm willing to see how things go with mobile phone images. i was trying to form a non-casual type of digital photography community for image sharing, discussion and critique but blanket banning mobile phone images was the wrong way to go about it.\n\n--------------------------------------------------------\n\nhi everyone! \n\ni was recently given sole mod access to /r/digital. my hope is to make it into a digital equivalent to r/analog where photographers can share their own photos, have a discussion and give/receive critique. some simple rules are in place: ~~no mobile phone images,~~ camera and lens (if applicable) in the title, nsfw must be -----> tagged !!!  as such, etc. \n\ni've given the sub a very basic makeover in terms of css. it's still a work in progress but comments are welcome. :d\n\nplease come by and post some of your work.", "sortedWord": "None", "identifyer": 13974, "year": "2018"}, {"Unnamed: 0": 268890, "autor": "[deleted]", "date": 1522375821000, "content": "Someone post my image in their own Instagram account and tagged me.", "link": "https://www.reddit.com/r/photography/comments/886zyv/someone_post_my_image_in_their_own_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "someone post my image in their own instagram account and -----> tagged !!!  me.", "sortedWord": "None", "identifyer": 14615, "year": "2018"}, {"Unnamed: 0": 268999, "autor": "Stompya", "date": 1520025854000, "content": "Lightroom Synonyms - cool tip /!/ I just learned this today and I am just really impressed with this feature! \n\nIn the Library &gt; Keyword List, you can edit keyword tags by right-clicking on them. (I was editing the capitalization because I am a huge nerd.)  When you edit the tag, it lets you add synonyms — so you can essentially link keywords that are similar in your library!\n\nFor example  “nature” and “outdoors” and “scenic” are similar keywords so the search results could show all of that if you just looked up “nature”. \n\nAnyway thought I would share.  Hope it helps someone!", "link": "https://www.reddit.com/r/photography/comments/81ifyq/lightroom_synonyms_cool_tip/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "lightroom synonyms - cool tip /!/ i just learned this today and i am just really impressed with this feature! \n\nin the library &gt; keyword list, you can edit keyword -----> tags !!!  by right-clicking on them. (i was editing the capitalization because i am a huge nerd.)  when you edit the tag, it lets you add synonyms — so you can essentially link keywords that are similar in your library!\n\nfor example  “nature” and “outdoors” and “scenic” are similar keywords so the search results could show all of that if you just looked up “nature”. \n\nanyway thought i would share.  hope it helps someone!", "sortedWord": "None", "identifyer": 14726, "year": "2018"}, {"Unnamed: 0": 269462, "autor": "bookopp", "date": 1519265019000, "content": "Instagram \"Featured Accounts\": Thoughts and Effects on Photography /!/ **TL; DR: An IG Account used my photo without permission, were incredibly rude about it, and refused to take it down so I contacted IG and IG removed it. Is this the new normal? Thoughts?**\n\nI am curious what this community's thoughts are on Instagram \"Feature Accounts\"; those accounts that repost other people's photography in a curated way.\n\nBackground: I am a semi-professional photographer, I make enough money off of my photography to finance my photography, which is a dream come true. So I am by no means a professional.\n\nTheoretically, I hate the idea of featured accounts. People getting followers and, potentially, making money off of other people's creative work without paying a cent to the original creator is complete bullshit. BUT, I also live in the real world and realize that for me, someone without much of an internet following, an account that provides an outlet to reach thousands or sometimes even tens of thousands of followers is good for me so I am willing to play the game. Also, some of these accounts actually foster creative collaboration or are run by seriously talented people, I'm all for those.\n\nBut this is all with a few caveats... I only want to be featured if I use \"your\" hashtag (I am using \"your\" loosely here because no one can copyright a hashtag), tag your account, or you ask before posting. If you don't abide by those rules and you repost my content BUT you clearly label it as my photography and link to my account...well then whatever, I may even turn a blind eye to that because there are bigger issues in the world. But if I didn't use your hashtag, you didn't ask me first, and you didn't clearly credit me... FUCK YOU, PAY ME.\n\nWHAT HAPPENED: I bring all this up because an account did exactly as I described. [**SEE SCREENSHOTS**](https://imgur.com/a/yJNYe). They posted my photo without permission and credited me at the very bottom of the comment (not at all in the caption, mind you). I messaged them politely asking them to delete the post. They were super rude. I didn't respond, blocked them (after posting screenshots to my IG Story and asking for feedback), and then contacted IG, and they took down the post.\n\nOthers seem to be happy by this account's reposts (some people they are reposting even have 20k+ followers and still seem to be happy with the feature). Is it just me? Why are so many extremely talented people okay with their intellectual property being stollen?\n\nAm I going overboard? How does this effect photography as a career? Like, actually making real money to pay for your kid's daycare.\n\nI'd love any insight you guys have. Thank you!\n\n(I hid their name as \"no personal attacks of any kind\" are allowed on this subreddit. I didn't hide mine because you can find my name throughout my reddit post history, so no point.)", "link": "https://www.reddit.com/r/photography/comments/7zb895/instagram_featured_accounts_thoughts_and_effects/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "instagram \"featured accounts\": thoughts and effects on photography /!/ **tl; dr: an ig account used my photo without permission, were incredibly rude about it, and refused to take it down so i contacted ig and ig removed it. is this the new normal? thoughts?**\n\ni am curious what this community's thoughts are on instagram \"feature accounts\"; those accounts that repost other people's photography in a curated way.\n\nbackground: i am a semi-professional photographer, i make enough money off of my photography to finance my photography, which is a dream come true. so i am by no means a professional.\n\ntheoretically, i hate the idea of featured accounts. people getting followers and, potentially, making money off of other people's creative work without paying a cent to the original creator is complete bullshit. but, i also live in the real world and realize that for me, someone without much of an internet following, an account that provides an outlet to reach thousands or sometimes even tens of thousands of followers is good for me so i am willing to play the game. also, some of these accounts actually foster creative collaboration or are run by seriously talented people, i'm all for those.\n\nbut this is all with a few caveats... i only want to be featured if i use \"your\" hashtag (i am using \"your\" loosely here because no one can copyright a hashtag), -----> tag !!!  your account, or you ask before posting. if you don't abide by those rules and you repost my content but you clearly label it as my photography and link to my account...well then whatever, i may even turn a blind eye to that because there are bigger issues in the world. but if i didn't use your hashtag, you didn't ask me first, and you didn't clearly credit me... fuck you, pay me.\n\nwhat happened: i bring all this up because an account did exactly as i described. [**see screenshots**](https://imgur.com/a/yjnye). they posted my photo without permission and credited me at the very bottom of the comment (not at all in the caption, mind you). i messaged them politely asking them to delete the post. they were super rude. i didn't respond, blocked them (after posting screenshots to my ig story and asking for feedback), and then contacted ig, and they took down the post.\n\nothers seem to be happy by this account's reposts (some people they are reposting even have 20k+ followers and still seem to be happy with the feature). is it just me? why are so many extremely talented people okay with their intellectual property being stollen?\n\nam i going overboard? how does this effect photography as a career? like, actually making real money to pay for your kid's daycare.\n\ni'd love any insight you guys have. thank you!\n\n(i hid their name as \"no personal attacks of any kind\" are allowed on this subreddit. i didn't hide mine because you can find my name throughout my reddit post history, so no point.)", "sortedWord": "None", "identifyer": 15210, "year": "2018"}, {"Unnamed: 0": 269974, "autor": "TimberTheDog", "date": 1529419027000, "content": "Where should I watermark pictures? /!/ So I have an art show I’m hosting and a bunch of artists sent me photos I’ll be displaying on a projector. I want to put their names on the photos, but I wanted to know if anyone had any good advice as to where. Right now I’ve been doing a semi transparent tag in the bottom left. Any rules to follow? ", "link": "https://www.reddit.com/r/photography/comments/8s9csf/where_should_i_watermark_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "where should i watermark pictures? /!/ so i have an art show i’m hosting and a bunch of artists sent me photos i’ll be displaying on a projector. i want to put their names on the photos, but i wanted to know if anyone had any good advice as to where. right now i’ve been doing a semi transparent -----> tag !!!  in the bottom left. any rules to follow? ", "sortedWord": "None", "identifyer": 15740, "year": "2018"}, {"Unnamed: 0": 270306, "autor": "MrFluffytheLion", "date": 1531747692000, "content": "Buying my first DSLR Camera /!/ Hey r/photography, I'm looking to get into photography after taking a basic course and watching a billion Peter McKinnon videos. My ideal camera is one that produces crisp images for a reasonable price tag. Right now I'm looking at the Canon 80D and the Rebel series. What camera and lens do you recommend for beginners?", "link": "https://www.reddit.com/r/photography/comments/8zawmf/buying_my_first_dslr_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "buying my first dslr camera /!/ hey r/photography, i'm looking to get into photography after taking a basic course and watching a billion peter mckinnon videos. my ideal camera is one that produces crisp images for a reasonable price -----> tag !!! . right now i'm looking at the canon 80d and the rebel series. what camera and lens do you recommend for beginners?", "sortedWord": "None", "identifyer": 16080, "year": "2018"}, {"Unnamed: 0": 270774, "autor": "haxorious", "date": 1535723398000, "content": "ChangeMyView: \"Gear doesn't matter\" is a terrible concept, it's misleading, childish, and generally unhelpful. We should stop using this phrase immediately. /!/ To keep up with the current trend of thought-provoking posts on our beloved subreddit, I've decided to have a discussion here instead of on r/CMV. I hope that we can have a polite and insightful discussion with eachother on this matter. I think it's nice to have something different than the usual \"Brand X just released Product Y, click to see review\" posts.\n\nSo before anybody totally dismiss me, I must make myself clear first. Saying *\"gear doesn't matter\"* sometime means *\"it's the skills of the photographer that's valuable\"*. Of course, that's absolutely and obviously true, I can't deny that. No one can! It's...common sense. However, it doesn't make the phrase any more accurate. Gear ALWAYS matter.\n\nPeople always give out the most short-sighted arguments on this matter. \"But Ansel Adams used film cameras\". \"Check out pro-photog-cheap-camera challenges on Youtube\", \"this \\[some particular photo\\] was captured on a \\[some particular cheap camera\\]\". Well... correlation does not equal causation. **Just because** a cheap camera captured a great phot**os, doesn't **mean cheap cameras can always make great photos (of course nobody actually says that, but it's the general idea).\n\n *I'd love to see a \"gear-doesn't-matter\" camera try out low-light, sport, wild life or astrophotography.* \n\nAny photographer, or anyone with some knowledge on this matter, will understand that it's a case-by-case matter. Obviously there are physical limitations that can only be overcome by having specialized (and therefore, expensive) equipment. Like a telephoto lens. It's obvious...to *us.*\n\nBut that can't be guaranteed for aspiring or interested people. They'll joyfully step into the photography world with the belief that they can create (or re-create) great photos with their $300 shoddy camera. And they will be disappointed, maybe even quit. OR, they could headlessly buy whatever comes up first on Amazon when they search \"camera\", and be done with it...because...gear doesn't matter, right? \n\nI think you see what I'm getting at. I recently saw many, many stunning photographs on r/all. **They were all NatGeo-tier quality**. And there I behold, everytime someone asks about the camera, chains and chains of \"gear doesn't matter\" comments will always follow. \n\nI must ask. Why? Is it to encourage more people to engage in photography? To make it sound less intimidating and costly? If so, then you're really not thinking this through. Hooking a person up, just for them to be absolutely devestated after seeing the price tag on most camera gear. Not to mention, what does that phrase paint us as photographer? On one hand, we're swiping credit cards buying thousands in gear. On the other hand, we're leaving comments saying \"gear doesn't matter\". Think about it. Technology has gone through so much, working day and night, striving to create better equipment for us. And then they get hit with a \"gear doesn't matter\" thread...\n\n&amp;#x200B;\n\nI must say again, I fully understand the merit behind that concept. What I'm trying to say is, the underlying effects of it are minimal, and the tiny tiny Terms and Condition atterisk is often overlooked by most eager beginners. I invite you all to discuss more on this. How do you approach in this aspect? If an eager person is looking to step into a field of photography that you KNOW will be expensive, how do you give them advice without absolutely crushing their dreams? \n\nPs: Don't even get me started on lighting equipment...", "link": "https://www.reddit.com/r/photography/comments/9btrpq/changemyview_gear_doesnt_matter_is_a_terrible/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "changemyview: \"gear doesn't matter\" is a terrible concept, it's misleading, childish, and generally unhelpful. we should stop using this phrase immediately. /!/ to keep up with the current trend of thought-provoking posts on our beloved subreddit, i've decided to have a discussion here instead of on r/cmv. i hope that we can have a polite and insightful discussion with eachother on this matter. i think it's nice to have something different than the usual \"brand x just released product y, click to see review\" posts.\n\nso before anybody totally dismiss me, i must make myself clear first. saying *\"gear doesn't matter\"* sometime means *\"it's the skills of the photographer that's valuable\"*. of course, that's absolutely and obviously true, i can't deny that. no one can! it's...common sense. however, it doesn't make the phrase any more accurate. gear always matter.\n\npeople always give out the most short-sighted arguments on this matter. \"but ansel adams used film cameras\". \"check out pro-photog-cheap-camera challenges on youtube\", \"this \\[some particular photo\\] was captured on a \\[some particular cheap camera\\]\". well... correlation does not equal causation. **just because** a cheap camera captured a great phot**os, doesn't **mean cheap cameras can always make great photos (of course nobody actually says that, but it's the general idea).\n\n *i'd love to see a \"gear-doesn't-matter\" camera try out low-light, sport, wild life or astrophotography.* \n\nany photographer, or anyone with some knowledge on this matter, will understand that it's a case-by-case matter. obviously there are physical limitations that can only be overcome by having specialized (and therefore, expensive) equipment. like a telephoto lens. it's obvious...to *us.*\n\nbut that can't be guaranteed for aspiring or interested people. they'll joyfully step into the photography world with the belief that they can create (or re-create) great photos with their $300 shoddy camera. and they will be disappointed, maybe even quit. or, they could headlessly buy whatever comes up first on amazon when they search \"camera\", and be done with it...because...gear doesn't matter, right? \n\ni think you see what i'm getting at. i recently saw many, many stunning photographs on r/all. **they were all natgeo-tier quality**. and there i behold, everytime someone asks about the camera, chains and chains of \"gear doesn't matter\" comments will always follow. \n\ni must ask. why? is it to encourage more people to engage in photography? to make it sound less intimidating and costly? if so, then you're really not thinking this through. hooking a person up, just for them to be absolutely devestated after seeing the price -----> tag !!!  on most camera gear. not to mention, what does that phrase paint us as photographer? on one hand, we're swiping credit cards buying thousands in gear. on the other hand, we're leaving comments saying \"gear doesn't matter\". think about it. technology has gone through so much, working day and night, striving to create better equipment for us. and then they get hit with a \"gear doesn't matter\" thread...\n\n&amp;#x200b;\n\ni must say again, i fully understand the merit behind that concept. what i'm trying to say is, the underlying effects of it are minimal, and the tiny tiny terms and condition atterisk is often overlooked by most eager beginners. i invite you all to discuss more on this. how do you approach in this aspect? if an eager person is looking to step into a field of photography that you know will be expensive, how do you give them advice without absolutely crushing their dreams? \n\nps: don't even get me started on lighting equipment...", "sortedWord": "None", "identifyer": 16558, "year": "2018"}, {"Unnamed: 0": 271214, "autor": "aThoughtLost", "date": 1539635062000, "content": "Camera recommendations under $500 /!/ Hello me and my Fiance decided we wanted to start doing some photography and record some videos. I'm looking for recommendations of different cameras around the $500 tag and for the lens and equipment that go with it. I'm currently trying to decide between the Nikon D3400 and the D5300.. Thank you for any input.", "link": "https://www.reddit.com/r/photography/comments/9ogfvf/camera_recommendations_under_500/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "camera recommendations under $500 /!/ hello me and my fiance decided we wanted to start doing some photography and record some videos. i'm looking for recommendations of different cameras around the $500 -----> tag !!!  and for the lens and equipment that go with it. i'm currently trying to decide between the nikon d3400 and the d5300.. thank you for any input.", "sortedWord": "None", "identifyer": 17014, "year": "2018"}, {"Unnamed: 0": 271268, "autor": "didykong", "date": 1539605334000, "content": "Lightroom CC Mobile 4.0 release /!/ What does it add ? These features will probably be released in the desktop version (Lightroom CC) but they will probably announce them during Adobe Max :\n\n* People view : face recognition to find people quickly\n* Search improvement : search box gives you suggestions as you type such as camera, lense, ISO, shutter speed, tags, locations and more\n* Improve rendering of low light high ISO photos\n* More album sharing option : option to only share photos of an album that meet a particular criteria (star and/or flagged)\n", "link": "https://www.reddit.com/r/photography/comments/9oc3dp/lightroom_cc_mobile_40_release/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "lightroom cc mobile 4.0 release /!/ what does it add ? these features will probably be released in the desktop version (lightroom cc) but they will probably announce them during adobe max :\n\n* people view : face recognition to find people quickly\n* search improvement : search box gives you suggestions as you type such as camera, lense, iso, shutter speed, -----> tags !!! , locations and more\n* improve rendering of low light high iso photos\n* more album sharing option : option to only share photos of an album that meet a particular criteria (star and/or flagged)\n", "sortedWord": "None", "identifyer": 17068, "year": "2018"}, {"Unnamed: 0": 273787, "autor": "toratheexplorer", "date": 1519865660000, "content": "Help! Photographer won't send me copies! /!/ Hey everyone! So I am a freelance model and some of my best work has been with photographers who won't send me copies of the pictures. (These photoshoots weren't paid but beneficial to both parties and I was told I could use the photos to build my portfolio.) I've emailed, texted, messaged. It's so frustrating because they will post the pictures on Instagram, tag me in them, but never send me copies. It's also been 1-2 years since some of the photoshoots. And I have screen shot the pictures from Instagram but the quality isn't good enough for portfolio prints.  Any advice? ", "link": "https://www.reddit.com/r/photography/comments/811aal/help_photographer_wont_send_me_copies/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "help! photographer won't send me copies! /!/ hey everyone! so i am a freelance model and some of my best work has been with photographers who won't send me copies of the pictures. (these photoshoots weren't paid but beneficial to both parties and i was told i could use the photos to build my portfolio.) i've emailed, texted, messaged. it's so frustrating because they will post the pictures on instagram, -----> tag !!!  me in them, but never send me copies. it's also been 1-2 years since some of the photoshoots. and i have screen shot the pictures from instagram but the quality isn't good enough for portfolio prints.  any advice? ", "sortedWord": "None", "identifyer": 19664, "year": "2018"}, {"Unnamed: 0": 274044, "autor": "Nmasse", "date": 1525099789000, "content": "Best travel camera under $1000? /!/ Hi, all...Looking for a decent travel camera under $1000...Obviously I have looked at the sony RX100 V and the lumix zs200 etc..but wondering if at this price point I should go mirrorless. I guess my question would be, are the two above cameras worth the price tag over an iPhone or should I just go mirrorless?Any other suggestions would be great. Of note, I do have a gopro hero 5 so 4k video is not a must on the camera.", "link": "https://www.reddit.com/r/photography/comments/8fzzv8/best_travel_camera_under_1000/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best travel camera under $1000? /!/ hi, all...looking for a decent travel camera under $1000...obviously i have looked at the sony rx100 v and the lumix zs200 etc..but wondering if at this price point i should go mirrorless. i guess my question would be, are the two above cameras worth the price -----> tag !!!  over an iphone or should i just go mirrorless?any other suggestions would be great. of note, i do have a gopro hero 5 so 4k video is not a must on the camera.", "sortedWord": "None", "identifyer": 19930, "year": "2018"}, {"Unnamed: 0": 274187, "autor": "milkfleet", "date": 1525286661000, "content": "Did Instagram just get worse? /!/ In the last month engagement is down even more! I know it went down dramatically last year with the nonsense algorithm but it seems something's changed again. \n\nI was wondering if anyone else has noticed this? It seems the tag search page is now split into top and the rest and i'm wondering if that's the cause? Either way it's getting to the point where you gotta ask is it even worth it? ", "link": "https://www.reddit.com/r/photography/comments/8gjswj/did_instagram_just_get_worse/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "did instagram just get worse? /!/ in the last month engagement is down even more! i know it went down dramatically last year with the nonsense algorithm but it seems something's changed again. \n\ni was wondering if anyone else has noticed this? it seems the -----> tag !!!  search page is now split into top and the rest and i'm wondering if that's the cause? either way it's getting to the point where you gotta ask is it even worth it? ", "sortedWord": "None", "identifyer": 20080, "year": "2018"}, {"Unnamed: 0": 275669, "autor": "bam849", "date": 1529333356000, "content": "Horrible Customer Service Experience (Adorama) /!/ I apologize in advance for the long post and any typos. \n\n\\-----\n\nI have never been so disappointed by a company in my life. This is quite the saga, unfortunately, but I really feel the need to share my story. I will be sharing it on any site I can find, and as horrible as it sounds, I truly hope that Adorama loses customers because of me.\n\nMy story starts on Friday June 8th. Earlier that week, I had contacted a few camera companies about trading in some of my gear. I wanted to trade in my Canon 6D and my Canon 100-400 lens and buy up to a 5D Mark III. I got quotes from B&amp;H, MPB, and Adorama. The B&amp;H quote was disappointing, as they tend to be. But MPB and Adorama were reasonable values. MPB offered $1180, and Adorama offered $1200 with the option for more if I trade in for something else (which I was planning to do).\n\nI have previous trade-in experience with MPB, and I love them. Their customer service is fantastic, and I was never been disappointed in the product I received. But as far as I know, MPB doesn’t offer additional money for trade-ins. So I decided to go with Adorama.\n\nThis brings us to Friday the 8th. This past weekend (the 15th through the 17th), I was on an astrophotography trip with my boyfriend. It’s something we’ve been planning for months. I really wanted to have my new camera in time for this trip; I thought it would be a great learning experience and I would get some great photos out of it. \n\nSo I called Adorama on the 8th and asked them flat out – if I send in my 6D and lens, will I get the 5D in time for my trip (no later than the 14th). I was repeatedly assured that there would be no issue getting the camera to me in time as long as I shipped my trade-ins on the 8th (I live in MD, so shipping is always really fast from NYC). The customer service rep was very nice and understanding and made multiple reassurances that everything would work out. They said to call on Monday after my package arrived at their facility and ask for expedited processing, and then everything would work out. \n\nSo, excited for my new camera, I shipped out my gear and waited.\n\nMonday morning (the 11th) arrives, and I check on the package. It was delivered, but I waited until the afternoon to call, since I figured it would take some time to get all of their packages unpacked. I called and was told that the package had been received and that it would be unpacked and checked in on Tuesday. Okay. That’s not what I was told before, but I was still assured that everything would work out. They would check it in on Tuesday, do their evaluation, and it would ship out on Wednesday. I live close enough to NYC that I get standard next-day shipping, so it would still arrive on time. Fine, that works.\n\nBy Tuesday afternoon, I still haven’t heard anything. So I call, and I’m told that my package still hasn’t been unpacked. But that it will definitely get done no later than Wednesday morning and it should still be shipped out on Wednesday. Frankly, I’m starting to get stressed. Every time I call, the story changes a little bit. And each little change is adding up and now I’m at risk of not getting my camera in time.\n\nBut fine. It sounds like this will still work out. So I wait.\n\nWednesday afternoon, I call again. I am told yet again that my package has not been unpacked yet. WHAT? How is this happening? I am beyond frustrated and I’m actually starting to get an attitude with the customer service rep (if you know me, this is a very rare thing). She assures me that the package will go out on Thursday and will arrive Friday morning in time for my trip (we were leaving at 3pm that day).\n\nFine. Whatever. This is ridiculous, but it’s still working out.\n\nThe weird thing is, after hanging up with the customer service rep, I get an email saying that my trade-ins have been evaluated and they want me to call to discuss my options. This is an obvious sign of how messed up their system is since I literally just got off the phone with someone who said that they hadn’t even opened the box yet. But fine. Their system is messed up, but at least it was somewhat working in my favor. So I call.\n\nThey offer me $700 for my camera and lens.\n\nYou see, what I didn’t realize is that when Adorama sends you a quote, they are sending you the resale value of the goods. Not the trade-in value. Or so it was explained to me. So the $1200 value they emailed me the week before was a blatant lie, and they can really just offer whatever crappy value they want after they’ve ‘evaluated’ your gear. I’m told that there are a couple problems – the viewpiece of the camera is dirty, and the lens has some haze in it. I also forgot to include the tripod mount for the lens, and they said that they’d pay me for it separately if I ship it in.\n\nBut $700??? THAT’S A $500 CUT FROM THE ORIGINAL OFFER. Unacceptable. But at this point, I’m so desperate to get my new camera in time for my trip that I just accept it. Jack tells me that I’m essentially paying roughly $530 for the 5D after my trade-ins. I’m told that it’s a VERY GOOD model with roughly 51K shutter count. Okay. Fine. Send it. I gave him my credit card number and he processed the transaction. He said that the $530 included the $100 that they were going to give me for sending in the tripod mount, and I asked for guaranteed next-day shipping so that I could get the new camera on Thursday. He agreed, and the total went up to roughly $670. Fine. We hung up.\n\nThat phone call took place around 3pm on Wednesday.\n\nAt 5am on Thursday (the day I’m supposed to be getting my new camera), I get an email saying that my transaction was declined.\n\nIt was declined. And I heard about it over 12 hours later via an automatic email???? \n\nSo I look up the order and find that they entered the expiration date incorrectly. I know this without a doubt, because I am very careful when I share my credit card information. I spoke slowly and clearly, and I have absolutely no doubt that I said “APRIL,” which sounds absolutely nothing like “NOVEMBER.”\n\nAh, but customer service doesn’t open until 9am. So I sit around and seethe for a few hours, waiting until I can call and complain.\n\n9am rolls around and I’m on the phone. It takes all of 30 seconds to fix the typo and get the transaction approved. I am assured that the package will go out on Thursday and I will have it no later than noon on Friday. The customer service agent is very apologetic, and I just kind of accept that this has all been a horrible stroke of bad luck. But at least I’ll get my camera in time for the trip.\n\nFriday morning comes. I check my order online, and it says that my order is still preparing for shipment. Huh. Seems strange. But perhaps their online system just doesn’t update quickly. There’s no reason why it should still be preparing for shipment when it should be at my door in a few hours. So I wait. Noon comes and goes, and no package.\n\nTime to call Adorama. \n\nSo the shipping department is VERY SORRY, but my package somehow didn’t go out on Friday. It was never even tagged to ship. WHAT. THE. HELL. I’m seeing red. I’m yelling and bitching and complaining. (Side note: I realize that none of this was the customer rep’s fault, and I repeatedly apologized to him for the fact that he was on the receiving end of my anger. But seriously.)\n\nI raised hell. I was so upset that I was crying and yelling. There is no excuse for such horrible service. There is no excuse for the fact that I did far beyond due diligence to get my package in time and it STILL WASN’T HERE. \n\nThey offered me a $50 gift card as an apology.\n\nI swear, I practically deflated. Why should I be surprised? This company that had caused me misery and stress over the last week thought that everything could be made whole with $50. They even said that they'd include next-day shipping for free (which wasn't true -- I'd already paid for it). Resigned, I said it was fine. Give me the $50 and ship my camera. It would arrive on Monday.\n\nI would already be home from my trip by then.\n\nThe customer service rep offered to change the shipping address and have it sent to where I was vacationing. But the thing about astrophotography is that it kind of requires being out in the middle of nowhere. No cell service. No internet. No next-day UPS deliveries. In tears, I called my boyfriend. He was furious and called Adorama back on my behalf. They increased the gift card to $100. They made it sound like some sort of charity. He asked if the $100 could be applied towards this purchase. No, they said. It has to be on a new order.\n\nOf course. Because customer retention, right? \n\nNo. We will spend that $100 and then I absolutely guarantee that Adorama will never see another penny from us.\n\nBut alas. That was the end of it. I wouldn’t have my camera in time for my trip.\n\nI still went. My boyfriend and I had fun. We looked at the stars and admired the milky way. I didn’t take any pictures.\n\nToday is Monday. I received my new (used) camera. It is not in very good condition. It is so badly scratched at the corners that it’s white instead of black. The eyepiece is completely missing. I don’t even have the energy to by angry. After all, this is what I should expect from Adorama. \n\nI regret not using MPB. I would have had my new camera in time for my trip. I would have saved myself a week of misery and stress. I would be sitting here, holding my new camera, excited to start practicing with it.\n\nInstead, I’m writing this review. Unhappy. I don’t even want to touch that camera. It’s just a bad experience waiting to continue.\n\nI am going to call Adorama yet again. I’m going to ask to undo everything that’s been done. I want my 6D back. I want my lens. And I’m going to sell them to MPB. And when I get my new 5D Mark III, I bet it will be amazing. It will be everything I ever wanted, and it will be everything that was advertised. And, if there’s anything wrong with it, I have no doubt that I will experience fantastic customer service. Because I won’t be using Adorama anymore.\n\n\\-----\n\nTDLR; I traded in gear with Adorama and had the worst customer service experience of my life. Lesson learned: ALWAYS USE MPB.", "link": "https://www.reddit.com/r/photography/comments/8s02tp/horrible_customer_service_experience_adorama/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "horrible customer service experience (adorama) /!/ i apologize in advance for the long post and any typos. \n\n\\-----\n\ni have never been so disappointed by a company in my life. this is quite the saga, unfortunately, but i really feel the need to share my story. i will be sharing it on any site i can find, and as horrible as it sounds, i truly hope that adorama loses customers because of me.\n\nmy story starts on friday june 8th. earlier that week, i had contacted a few camera companies about trading in some of my gear. i wanted to trade in my canon 6d and my canon 100-400 lens and buy up to a 5d mark iii. i got quotes from b&amp;h, mpb, and adorama. the b&amp;h quote was disappointing, as they tend to be. but mpb and adorama were reasonable values. mpb offered $1180, and adorama offered $1200 with the option for more if i trade in for something else (which i was planning to do).\n\ni have previous trade-in experience with mpb, and i love them. their customer service is fantastic, and i was never been disappointed in the product i received. but as far as i know, mpb doesn’t offer additional money for trade-ins. so i decided to go with adorama.\n\nthis brings us to friday the 8th. this past weekend (the 15th through the 17th), i was on an astrophotography trip with my boyfriend. it’s something we’ve been planning for months. i really wanted to have my new camera in time for this trip; i thought it would be a great learning experience and i would get some great photos out of it. \n\nso i called adorama on the 8th and asked them flat out – if i send in my 6d and lens, will i get the 5d in time for my trip (no later than the 14th). i was repeatedly assured that there would be no issue getting the camera to me in time as long as i shipped my trade-ins on the 8th (i live in md, so shipping is always really fast from nyc). the customer service rep was very nice and understanding and made multiple reassurances that everything would work out. they said to call on monday after my package arrived at their facility and ask for expedited processing, and then everything would work out. \n\nso, excited for my new camera, i shipped out my gear and waited.\n\nmonday morning (the 11th) arrives, and i check on the package. it was delivered, but i waited until the afternoon to call, since i figured it would take some time to get all of their packages unpacked. i called and was told that the package had been received and that it would be unpacked and checked in on tuesday. okay. that’s not what i was told before, but i was still assured that everything would work out. they would check it in on tuesday, do their evaluation, and it would ship out on wednesday. i live close enough to nyc that i get standard next-day shipping, so it would still arrive on time. fine, that works.\n\nby tuesday afternoon, i still haven’t heard anything. so i call, and i’m told that my package still hasn’t been unpacked. but that it will definitely get done no later than wednesday morning and it should still be shipped out on wednesday. frankly, i’m starting to get stressed. every time i call, the story changes a little bit. and each little change is adding up and now i’m at risk of not getting my camera in time.\n\nbut fine. it sounds like this will still work out. so i wait.\n\nwednesday afternoon, i call again. i am told yet again that my package has not been unpacked yet. what? how is this happening? i am beyond frustrated and i’m actually starting to get an attitude with the customer service rep (if you know me, this is a very rare thing). she assures me that the package will go out on thursday and will arrive friday morning in time for my trip (we were leaving at 3pm that day).\n\nfine. whatever. this is ridiculous, but it’s still working out.\n\nthe weird thing is, after hanging up with the customer service rep, i get an email saying that my trade-ins have been evaluated and they want me to call to discuss my options. this is an obvious sign of how messed up their system is since i literally just got off the phone with someone who said that they hadn’t even opened the box yet. but fine. their system is messed up, but at least it was somewhat working in my favor. so i call.\n\nthey offer me $700 for my camera and lens.\n\nyou see, what i didn’t realize is that when adorama sends you a quote, they are sending you the resale value of the goods. not the trade-in value. or so it was explained to me. so the $1200 value they emailed me the week before was a blatant lie, and they can really just offer whatever crappy value they want after they’ve ‘evaluated’ your gear. i’m told that there are a couple problems – the viewpiece of the camera is dirty, and the lens has some haze in it. i also forgot to include the tripod mount for the lens, and they said that they’d pay me for it separately if i ship it in.\n\nbut $700??? that’s a $500 cut from the original offer. unacceptable. but at this point, i’m so desperate to get my new camera in time for my trip that i just accept it. jack tells me that i’m essentially paying roughly $530 for the 5d after my trade-ins. i’m told that it’s a very good model with roughly 51k shutter count. okay. fine. send it. i gave him my credit card number and he processed the transaction. he said that the $530 included the $100 that they were going to give me for sending in the tripod mount, and i asked for guaranteed next-day shipping so that i could get the new camera on thursday. he agreed, and the total went up to roughly $670. fine. we hung up.\n\nthat phone call took place around 3pm on wednesday.\n\nat 5am on thursday (the day i’m supposed to be getting my new camera), i get an email saying that my transaction was declined.\n\nit was declined. and i heard about it over 12 hours later via an automatic email???? \n\nso i look up the order and find that they entered the expiration date incorrectly. i know this without a doubt, because i am very careful when i share my credit card information. i spoke slowly and clearly, and i have absolutely no doubt that i said “april,” which sounds absolutely nothing like “november.”\n\nah, but customer service doesn’t open until 9am. so i sit around and seethe for a few hours, waiting until i can call and complain.\n\n9am rolls around and i’m on the phone. it takes all of 30 seconds to fix the typo and get the transaction approved. i am assured that the package will go out on thursday and i will have it no later than noon on friday. the customer service agent is very apologetic, and i just kind of accept that this has all been a horrible stroke of bad luck. but at least i’ll get my camera in time for the trip.\n\nfriday morning comes. i check my order online, and it says that my order is still preparing for shipment. huh. seems strange. but perhaps their online system just doesn’t update quickly. there’s no reason why it should still be preparing for shipment when it should be at my door in a few hours. so i wait. noon comes and goes, and no package.\n\ntime to call adorama. \n\nso the shipping department is very sorry, but my package somehow didn’t go out on friday. it was never even -----> tagged !!!  to ship. what. the. hell. i’m seeing red. i’m yelling and bitching and complaining. (side note: i realize that none of this was the customer rep’s fault, and i repeatedly apologized to him for the fact that he was on the receiving end of my anger. but seriously.)\n\ni raised hell. i was so upset that i was crying and yelling. there is no excuse for such horrible service. there is no excuse for the fact that i did far beyond due diligence to get my package in time and it still wasn’t here. \n\nthey offered me a $50 gift card as an apology.\n\ni swear, i practically deflated. why should i be surprised? this company that had caused me misery and stress over the last week thought that everything could be made whole with $50. they even said that they'd include next-day shipping for free (which wasn't true -- i'd already paid for it). resigned, i said it was fine. give me the $50 and ship my camera. it would arrive on monday.\n\ni would already be home from my trip by then.\n\nthe customer service rep offered to change the shipping address and have it sent to where i was vacationing. but the thing about astrophotography is that it kind of requires being out in the middle of nowhere. no cell service. no internet. no next-day ups deliveries. in tears, i called my boyfriend. he was furious and called adorama back on my behalf. they increased the gift card to $100. they made it sound like some sort of charity. he asked if the $100 could be applied towards this purchase. no, they said. it has to be on a new order.\n\nof course. because customer retention, right? \n\nno. we will spend that $100 and then i absolutely guarantee that adorama will never see another penny from us.\n\nbut alas. that was the end of it. i wouldn’t have my camera in time for my trip.\n\ni still went. my boyfriend and i had fun. we looked at the stars and admired the milky way. i didn’t take any pictures.\n\ntoday is monday. i received my new (used) camera. it is not in very good condition. it is so badly scratched at the corners that it’s white instead of black. the eyepiece is completely missing. i don’t even have the energy to by angry. after all, this is what i should expect from adorama. \n\ni regret not using mpb. i would have had my new camera in time for my trip. i would have saved myself a week of misery and stress. i would be sitting here, holding my new camera, excited to start practicing with it.\n\ninstead, i’m writing this review. unhappy. i don’t even want to touch that camera. it’s just a bad experience waiting to continue.\n\ni am going to call adorama yet again. i’m going to ask to undo everything that’s been done. i want my 6d back. i want my lens. and i’m going to sell them to mpb. and when i get my new 5d mark iii, i bet it will be amazing. it will be everything i ever wanted, and it will be everything that was advertised. and, if there’s anything wrong with it, i have no doubt that i will experience fantastic customer service. because i won’t be using adorama anymore.\n\n\\-----\n\ntdlr; i traded in gear with adorama and had the worst customer service experience of my life. lesson learned: always use mpb.", "sortedWord": "None", "identifyer": 21647, "year": "2018"}, {"Unnamed: 0": 276241, "autor": "Minewolf20", "date": 1531387496000, "content": "Looking for a camera &lt;1000€ for mixed usage (taking photos and filming) /!/ I'd like to buy my first camera that isn't on a cell phone nor a sports camera. I have decent editing skills (used to have an active [gaming YouTube channel](https://www.youtube.com/c/mysteriouswolf), that turned out to be an utter waste of time, I edit videos for [Pylo](https://www.youtube.com/user/PyloGroup) and some other spare time productions) and I would like to expand my knowledge and improve myself in filming as well.\n\nNow I have no idea which company makes the best cameras (does that even exist? 🤔) or which technology works best when (well I know that DLSR should in theorybe better in the darkness than SLR due to the way they work, but let's ignore that), all I know is a few basic terms such as exposure, apeture, optical/digital zoom, SLR, DLSR, pixel density, resolution, pixel amount etc. but with only the knowledge of technical terms, and even if I knew what they mean, without practical experience, I can't judge a camera's performance by numbers.\n\nWhy do I want a new camera?\nI'm tired of editing shaky, low-quality footage from my GoPro and my phone. Also the results of taking an image with an actual camera tend to impress me way better than the other two. I have previously worked with (t.i. held in hand and took some photos more for testing than actual usage) an SLR (afaik. these are the ones where viewfinder stays on since there are no moving lenses) and a DLSR, but for some reason I preffered the look of DLSR since it produced brighter (even sharper in some cases) photos on simmilar settings.\n\nWhat would I use it for?\nI'd use it 65% for taking photos and 35% for filming. A friend of mine has a steady (DJI Ronin I think) that he could lend me to film more stable footage.\n\nWhat resolution of the video would I like to record?\nI don't know much about recording on cameras, but I'd love to be able to get 4k60fps footage out of it. That'd be amazing, however I don't want to sacrifise photo quality of the camera for video quality in case if those two are inversely proportional.\n\nFor the price tag, as I am a beginner and probably need to learn some things before upgrading hardware, the lower the price tag, the better. I set the limit to around 1000€, but if I could get a good one for under that I'd be more than happy. That probably means that I am looking for a best value for the money camera.", "link": "https://www.reddit.com/r/photography/comments/8y871o/looking_for_a_camera_1000_for_mixed_usage_taking/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for a camera &lt;1000€ for mixed usage (taking photos and filming) /!/ i'd like to buy my first camera that isn't on a cell phone nor a sports camera. i have decent editing skills (used to have an active [gaming youtube channel](https://www.youtube.com/c/mysteriouswolf), that turned out to be an utter waste of time, i edit videos for [pylo](https://www.youtube.com/user/pylogroup) and some other spare time productions) and i would like to expand my knowledge and improve myself in filming as well.\n\nnow i have no idea which company makes the best cameras (does that even exist? 🤔) or which technology works best when (well i know that dlsr should in theorybe better in the darkness than slr due to the way they work, but let's ignore that), all i know is a few basic terms such as exposure, apeture, optical/digital zoom, slr, dlsr, pixel density, resolution, pixel amount etc. but with only the knowledge of technical terms, and even if i knew what they mean, without practical experience, i can't judge a camera's performance by numbers.\n\nwhy do i want a new camera?\ni'm tired of editing shaky, low-quality footage from my gopro and my phone. also the results of taking an image with an actual camera tend to impress me way better than the other two. i have previously worked with (t.i. held in hand and took some photos more for testing than actual usage) an slr (afaik. these are the ones where viewfinder stays on since there are no moving lenses) and a dlsr, but for some reason i preffered the look of dlsr since it produced brighter (even sharper in some cases) photos on simmilar settings.\n\nwhat would i use it for?\ni'd use it 65% for taking photos and 35% for filming. a friend of mine has a steady (dji ronin i think) that he could lend me to film more stable footage.\n\nwhat resolution of the video would i like to record?\ni don't know much about recording on cameras, but i'd love to be able to get 4k60fps footage out of it. that'd be amazing, however i don't want to sacrifise photo quality of the camera for video quality in case if those two are inversely proportional.\n\nfor the price -----> tag !!! , as i am a beginner and probably need to learn some things before upgrading hardware, the lower the price -----> tag !!! , the better. i set the limit to around 1000€, but if i could get a good one for under that i'd be more than happy. that probably means that i am looking for a best value for the money camera.", "sortedWord": "None", "identifyer": 22239, "year": "2018"}, {"Unnamed: 0": 276987, "autor": "CommanderPirx", "date": 1534882526000, "content": "Help me improve my workflow (culling mostly) /!/ I was wondering if there is a tool to improve my workflow. Right now it looks like this:\n\n\\- shoot. A lot of images.\n\n\\- download everything to 4 different places for backup. Each shoot has its own folder.\n\n\\- select best images for post production (a.k.a. culling)\n\n\\- edit selected images.\n\nWhere I need help is the culling. Right now I go through all the images using Google Picasa (yep, I still have that) because it's the fastest damn thing out there. If I like the image - I would write down the file name on a piece of paper. If I like it a lot - I would underline or put an exclamation mark next to it. Then I would edit images from the written list. I get 20 - 30 images from some large shoots and with each image taking anywhere from 30 minutes to a couple of hours to edit (for me). Given that photography is a hobby for me it may take a few days, sometimes a couple of weeks to go through whole list.\n\nThe way I see this improvement working is that I get rid of paper altogether. I'd like to browse though images, tagging them (for lack of better word) as good/great/awesome. 3 levels is really enough. \n\nI would prefer the tagging to be a one key operation - like hit \"space\" once to select \"good\", twice - \"great\", three times - \"awesome\". Arrows to move around the images (left/right - previous/next, up/down - zoom in or out).\n\nAt the end either sort them by this tag (show me the list in descending order) or get a list of file names with each tag.\n\nSometimes I go back a few years and edit additional images (as my retouching skills get better) so it makes sense to keep those lists somewhere.\n\nAny ideas would be greatly appreciated.", "link": "https://www.reddit.com/r/photography/comments/996lia/help_me_improve_my_workflow_culling_mostly/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "help me improve my workflow (culling mostly) /!/ i was wondering if there is a tool to improve my workflow. right now it looks like this:\n\n\\- shoot. a lot of images.\n\n\\- download everything to 4 different places for backup. each shoot has its own folder.\n\n\\- select best images for post production (a.k.a. culling)\n\n\\- edit selected images.\n\nwhere i need help is the culling. right now i go through all the images using google picasa (yep, i still have that) because it's the fastest damn thing out there. if i like the image - i would write down the file name on a piece of paper. if i like it a lot - i would underline or put an exclamation mark next to it. then i would edit images from the written list. i get 20 - 30 images from some large shoots and with each image taking anywhere from 30 minutes to a couple of hours to edit (for me). given that photography is a hobby for me it may take a few days, sometimes a couple of weeks to go through whole list.\n\nthe way i see this improvement working is that i get rid of paper altogether. i'd like to browse though images, -----> tagging !!!  them (for lack of better word) as good/great/awesome. 3 levels is really enough. \n\ni would prefer the tagging to be a one key operation - like hit \"space\" once to select \"good\", twice - \"great\", three times - \"awesome\". arrows to move around the images (left/right - previous/next, up/down - zoom in or out).\n\nat the end either sort them by this tag (show me the list in descending order) or get a list of file names with each tag.\n\nsometimes i go back a few years and edit additional images (as my retouching skills get better) so it makes sense to keep those lists somewhere.\n\nany ideas would be greatly appreciated.", "sortedWord": "None", "identifyer": 23014, "year": "2018"}, {"Unnamed: 0": 277027, "autor": "zeexik", "date": 1534854856000, "content": "Is it wrong to \"want\" validation for your work through Instagram? /!/ I'm really big on authenticity and gaining followers organically. For a while I didn't even caption or tag my photos because I wanted the photography to speak for itself. \n\nBut I look at my follower count and I get sad. I look at how many people like my posts and I get sad. \n\nBut then I get confused! I think \"Am I doing this for likes and followers? No. I'm doing this because I enjoy nice pictures and visuals and edits and I want to create them and share them.\" But the lack of activity and interaction makes me believe that my work isn't good enough or just sucks outright. \n\nFriends will come up to me in person and tell me how much they love my work. But I feel like they're biased because they're my friends. \n\nI've noticed people who have a big following because of their personality and real life network will often post lower quality pictures, but because they're well known and popular outside of instagram, they'll receive tons of support. \n\nShould I succumb to the stupid Instagram craze and start following SEO procedures, hashtags, data based scheduling of posts and all that jazz? Or should I just keep doing what I'm doing (which is just posting images that I like that I created) and not worry about it at all? \n\nI've been doing this for 7 years and although I've gotten better, I don't feel like my stuff is good enough yet because of the lack of attention it receives. I don't know if it's because I've been shooting with a crop sensor this entire time? I don't know if it's because my angles suck, composition sucks, editing sucks, or what?\n\nBut shouldn't it be that is an interpretation of what I want it to be? It is my version of photography after all. It is MY art. \n\nI just really wish I knew where I stood in terms of photography and where I could improve, how I can improve my outlook on it, and what I should be doing to grow my art in general. But the lack of eyes on it makes me thing that it's just unnoticed garbage. ", "link": "https://www.reddit.com/r/photography/comments/992r6l/is_it_wrong_to_want_validation_for_your_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is it wrong to \"want\" validation for your work through instagram? /!/ i'm really big on authenticity and gaining followers organically. for a while i didn't even caption or -----> tag !!!  my photos because i wanted the photography to speak for itself. \n\nbut i look at my follower count and i get sad. i look at how many people like my posts and i get sad. \n\nbut then i get confused! i think \"am i doing this for likes and followers? no. i'm doing this because i enjoy nice pictures and visuals and edits and i want to create them and share them.\" but the lack of activity and interaction makes me believe that my work isn't good enough or just sucks outright. \n\nfriends will come up to me in person and tell me how much they love my work. but i feel like they're biased because they're my friends. \n\ni've noticed people who have a big following because of their personality and real life network will often post lower quality pictures, but because they're well known and popular outside of instagram, they'll receive tons of support. \n\nshould i succumb to the stupid instagram craze and start following seo procedures, hashtags, data based scheduling of posts and all that jazz? or should i just keep doing what i'm doing (which is just posting images that i like that i created) and not worry about it at all? \n\ni've been doing this for 7 years and although i've gotten better, i don't feel like my stuff is good enough yet because of the lack of attention it receives. i don't know if it's because i've been shooting with a crop sensor this entire time? i don't know if it's because my angles suck, composition sucks, editing sucks, or what?\n\nbut shouldn't it be that is an interpretation of what i want it to be? it is my version of photography after all. it is my art. \n\ni just really wish i knew where i stood in terms of photography and where i could improve, how i can improve my outlook on it, and what i should be doing to grow my art in general. but the lack of eyes on it makes me thing that it's just unnoticed garbage. ", "sortedWord": "None", "identifyer": 23055, "year": "2018"}, {"Unnamed: 0": 277141, "autor": "yologr", "date": 1535309910000, "content": "Popular tags /!/ Hello. I am thinking about uploading some of my work to Instagram and from what I know it is important to tag your photos. Do you know what tags are necessary apart from location or how can I find what suits my needs? Thanks for your time!", "link": "https://www.reddit.com/r/photography/comments/9ahzlz/popular_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "popular -----> tags !!!  /!/ hello. i am thinking about uploading some of my work to instagram and from what i know it is important to tag your photos. do you know what tags are necessary apart from location or how can i find what suits my needs? thanks for your time!", "sortedWord": "None", "identifyer": 23176, "year": "2018"}, {"Unnamed: 0": 277363, "autor": "dunesidebee", "date": 1536355749000, "content": "Photo Sharing for Groups /!/ I'm teaching a group about photography. I'd like to issue a daily/weekly challenge and have them upload their pictures and tag them with the challenge. What site would you use to do this? Most of the group have their own phones but not all. I'm ok with a solution that is mobile camera's only.", "link": "https://www.reddit.com/r/photography/comments/9dyqxd/photo_sharing_for_groups/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "photo sharing for groups /!/ i'm teaching a group about photography. i'd like to issue a daily/weekly challenge and have them upload their pictures and -----> tag !!!  them with the challenge. what site would you use to do this? most of the group have their own phones but not all. i'm ok with a solution that is mobile camera's only.", "sortedWord": "None", "identifyer": 23404, "year": "2018"}, {"Unnamed: 0": 277551, "autor": "Andy444444", "date": 1537311318000, "content": "Looking for an online photo storage platform that will let me date photos with approximate dates or years, or as \"unknown date\" rather than forcing me to choose a specific date. /!/ I am embarking on a process of scanning in all of my family's very old photo albums, and I would like to store the images online. I am looking for a platform that will allow me to assign both specific and approximate dates (i.e., \"about 1955\" or \"May 1938\" or just \"unknown date\") to each photo.\n\nSo far, Shutterfly, Flickr, and Google photos all require me to choose a specific date in XX/XX/XXXX format.\n\nIdeally, I'd also like the platform to allow me to assign tags to photos, so that I can search through them by subject or names of the people pictured.\n\n&amp;#x200B;\n\nAny suggestions or information is very much appreciated! I am very new to this.", "link": "https://www.reddit.com/r/photography/comments/9gzoou/looking_for_an_online_photo_storage_platform_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "looking for an online photo storage platform that will let me date photos with approximate dates or years, or as \"unknown date\" rather than forcing me to choose a specific date. /!/ i am embarking on a process of scanning in all of my family's very old photo albums, and i would like to store the images online. i am looking for a platform that will allow me to assign both specific and approximate dates (i.e., \"about 1955\" or \"may 1938\" or just \"unknown date\") to each photo.\n\nso far, shutterfly, flickr, and google photos all require me to choose a specific date in xx/xx/xxxx format.\n\nideally, i'd also like the platform to allow me to assign -----> tags !!!  to photos, so that i can search through them by subject or names of the people pictured.\n\n&amp;#x200b;\n\nany suggestions or information is very much appreciated! i am very new to this.", "sortedWord": "None", "identifyer": 23599, "year": "2018"}, {"Unnamed: 0": 277801, "autor": "A_12ft_200lb_Puma", "date": 1537660429000, "content": "Yongnuo 50mm 1.8 /!/ I decided on buying a Yongnuo 50mm 1.8 and I was wondering what you guys thought of it. I obviously got it for the price tag,  but I have extremely mixed feelings on it. I feel like it’s imaged just aren’t crisp, and it autofocuses really quite poorly. Anyone else have thoughts on those lenses? ", "link": "https://www.reddit.com/r/photography/comments/9i483b/yongnuo_50mm_18/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "yongnuo 50mm 1.8 /!/ i decided on buying a yongnuo 50mm 1.8 and i was wondering what you guys thought of it. i obviously got it for the price -----> tag !!! ,  but i have extremely mixed feelings on it. i feel like it’s imaged just aren’t crisp, and it autofocuses really quite poorly. anyone else have thoughts on those lenses? ", "sortedWord": "None", "identifyer": 23858, "year": "2018"}, {"Unnamed: 0": 277905, "autor": "twistedhobbs", "date": 1538465071000, "content": "Nothing makes me more upset than when I give a client his photos and I get tagged in them on Instagram and there is a shitty filter on them. /!/ It’s not like I spent hours of time into them on post making them look ideal. It’s ways some shitty sepia filter with the vignette cranked up all the way. Does anyone else have this problem? ", "link": "https://www.reddit.com/r/photography/comments/9kolkd/nothing_makes_me_more_upset_than_when_i_give_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "nothing makes me more upset than when i give a client his photos and i get -----> tagged !!!  in them on instagram and there is a shitty filter on them. /!/ it’s not like i spent hours of time into them on post making them look ideal. it’s ways some shitty sepia filter with the vignette cranked up all the way. does anyone else have this problem? ", "sortedWord": "None", "identifyer": 23965, "year": "2018"}, {"Unnamed: 0": 277941, "autor": "shiftbutton", "date": 1538837207000, "content": "Most Effective Photo Organization Software /!/ If you ever have found yourself in charge of managing tens of thousands of your company’s photographs, you'l understand how frustrating this can be. \n\nIn the past, managers of such collections had to take special care to organize each photo meticulously, tagging it by the date, location, event at which that the image was captured or using whatever tag they find useful. \n\nThese stress can however be minimized with the use of a good picture organization software. The photo organization software can be installed on your computer or cloud based. With improvement in recent technology, focus is however beginning to shift to cloud based systems. For us, we have found [DBGallery](http://dbgallery.com) very useful.\n\n \n\nDBGallery is a photo management database system enabling everyone in an organization to quickly access its digital photo assets. It operates in a shared multi-user environment. \n\nIs there anyone else who has had an experience with it?", "link": "https://www.reddit.com/r/photography/comments/9lwgpn/most_effective_photo_organization_software/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "most effective photo organization software /!/ if you ever have found yourself in charge of managing tens of thousands of your company’s photographs, you'l understand how frustrating this can be. \n\nin the past, managers of such collections had to take special care to organize each photo meticulously, -----> tagging !!!  it by the date, location, event at which that the image was captured or using whatever tag they find useful. \n\nthese stress can however be minimized with the use of a good picture organization software. the photo organization software can be installed on your computer or cloud based. with improvement in recent technology, focus is however beginning to shift to cloud based systems. for us, we have found [dbgallery](http://dbgallery.com) very useful.\n\n \n\ndbgallery is a photo management database system enabling everyone in an organization to quickly access its digital photo assets. it operates in a shared multi-user environment. \n\nis there anyone else who has had an experience with it?", "sortedWord": "None", "identifyer": 24001, "year": "2018"}, {"Unnamed: 0": 278243, "autor": "RomanRiesen", "date": 1540136563000, "content": "Lightroom photo management alternative for linux /!/ As the title implies I am searching for a photo management software that is comperatively as powerful as lightroom, because the manual management with folders seems really restrictive and is wasting vast amounts of my time when it comes to creating photobooks etc.\n\n&amp;#x200B;\n\nFeatures I would love: Tags, filesystem abstraction (not just searching/sorting in one folder), search by camera (or even better: any exif attributes).\n\n&amp;#x200B;\n\nThings I've tried so far: Nomacs and darktable.", "link": "https://www.reddit.com/r/photography/comments/9q4h4e/lightroom_photo_management_alternative_for_linux/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "lightroom photo management alternative for linux /!/ as the title implies i am searching for a photo management software that is comperatively as powerful as lightroom, because the manual management with folders seems really restrictive and is wasting vast amounts of my time when it comes to creating photobooks etc.\n\n&amp;#x200b;\n\nfeatures i would love: -----> tags !!! , filesystem abstraction (not just searching/sorting in one folder), search by camera (or even better: any exif attributes).\n\n&amp;#x200b;\n\nthings i've tried so far: nomacs and darktable.", "sortedWord": "None", "identifyer": 24307, "year": "2018"}, {"Unnamed: 0": 278344, "autor": "dviewb", "date": 1540427679000, "content": "Photo tag (name) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9r5efa/photo_tag_name/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "photo -----> tag !!!  (name) /!/ [removed]", "sortedWord": "None", "identifyer": 24413, "year": "2018"}, {"Unnamed: 0": 278665, "autor": "anonymoooooooose", "date": 1541597901000, "content": "---BLACK FRIDAY SALE MEGATHREAD--- /!/ It's almost that time of year again, soon we'll be buried in Black Friday sale postings. As usual we'll consolidate everything into this thread.\n\nOur Automod spam filter is very efficient, please remove any referral tags from your links, or Automod will eat your post!\n\n---\nIf you have questions about what to buy, don't post here but rather in our stickied Question Thread.\n\n---\nWondering what you should buy?\n\n[What should I keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3F)\n\n[Last year's holiday buying guide](https://www.reddit.com/r/photography/comments/7gmkql/2017_gift_suggestion_thread/)\n\nUnfortunately Reddit only allows 2 posts to be stickied, we will post a new \"buyer's guide\" thread after this Black Friday thread runs it's course.", "link": "https://www.reddit.com/r/photography/comments/9uzhft/black_friday_sale_megathread/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "---black friday sale megathread--- /!/ it's almost that time of year again, soon we'll be buried in black friday sale postings. as usual we'll consolidate everything into this thread.\n\nour automod spam filter is very efficient, please remove any referral -----> tags !!!  from your links, or automod will eat your post!\n\n---\nif you have questions about what to buy, don't post here but rather in our stickied question thread.\n\n---\nwondering what you should buy?\n\n[what should i keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3f)\n\n[last year's holiday buying guide](https://www.reddit.com/r/photography/comments/7gmkql/2017_gift_suggestion_thread/)\n\nunfortunately reddit only allows 2 posts to be stickied, we will post a new \"buyer's guide\" thread after this black friday thread runs it's course.", "sortedWord": "None", "identifyer": 24749, "year": "2018"}, {"Unnamed: 0": 279233, "autor": "satisfyingcut", "date": 1542640163000, "content": "Lightroom tags/flag to digikam /!/ Hi all! Wondering if anyone could help me out here. I've been using Lightroom for quite some time now and decided to move out of Adobe ecosystem due to several reasons, but that's not the topic here.\n\nI'm trying to migrate my lightroom catalog to DigiKam, as I heard it's good for that purpose. But I'm having trouble trying to get my lightroom flags to Digikam as well, is that possible? \n\nWhat I've been doing:\n\n* Reading DNGs straight from my lightroom catalog.\n* Have \"Automatically write changes into XMP\" ticked on in Lightroom, but there's no XMP with DNG so there's nothing there.\n\nDigikam is reading all the keywords as tags, which is great, but it's not reading in the color labels and flags I have set. Somehow I doubt Lightroom is writing those in metadata since Adobe Bridge is not reading them as well. \n\nAny help is appreciated, thanks!", "link": "https://www.reddit.com/r/photography/comments/9yhk95/lightroom_tagsflag_to_digikam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "lightroom -----> tags !!! /flag to digikam /!/ hi all! wondering if anyone could help me out here. i've been using lightroom for quite some time now and decided to move out of adobe ecosystem due to several reasons, but that's not the topic here.\n\ni'm trying to migrate my lightroom catalog to digikam, as i heard it's good for that purpose. but i'm having trouble trying to get my lightroom flags to digikam as well, is that possible? \n\nwhat i've been doing:\n\n* reading dngs straight from my lightroom catalog.\n* have \"automatically write changes into xmp\" ticked on in lightroom, but there's no xmp with dng so there's nothing there.\n\ndigikam is reading all the keywords as tags, which is great, but it's not reading in the color labels and flags i have set. somehow i doubt lightroom is writing those in metadata since adobe bridge is not reading them as well. \n\nany help is appreciated, thanks!", "sortedWord": "None", "identifyer": 25334, "year": "2018"}, {"Unnamed: 0": 279745, "autor": "Ldawg1984", "date": 1545812952000, "content": "RT WWEStats: Notable WWE Superstars whose championship reigns began on their birthday: – Dec. 25, 2018: RusevBUL (US Title) – Jan. 20, 2018: WWESheamus (Raw Tag) – Aug. 17, 2014: RealPaigeWWE (Divas) – Feb. 8, 2010: WWETheBigShow (Unified Tag) #RusevDay #SDLive /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/a9mxdz/rt_wwestats_notable_wwe_superstars_whose/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "rt wwestats: notable wwe superstars whose championship reigns began on their birthday: – dec. 25, 2018: rusevbul (us title) – jan. 20, 2018: wwesheamus (raw -----> tag !!! ) – aug. 17, 2014: realpaigewwe (divas) – feb. 8, 2010: wwethebigshow (unified -----> tag !!! ) #rusevday #sdlive /!/ [removed]", "sortedWord": "None", "identifyer": 25867, "year": "2018"}, {"Unnamed: 0": 280094, "autor": "ronniemason", "date": 1516978369000, "content": "Need Advice: Organizing and Tagging 100,000+ Photos /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7t4zgv/need_advice_organizing_and_tagging_100000_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "need advice: organizing and -----> tagging !!!  100,000+ photos /!/ [removed]", "sortedWord": "None", "identifyer": 26223, "year": "2018"}, {"Unnamed: 0": 282066, "autor": "shian243", "date": 1518297215000, "content": "Photographers who had their gear stolen/robbed before, what's your story, and did you recover it? /!/ Well, there's always that unfortunate someone who gets their gear stolen.\n\nin 2015, I had made the plan to visit Europe. With the money I saved from the army, I headed to Sweden, with my objective being Northern lights. \n\nMet a friend and had coffee in a cafe in Stockholm Central Station. While having coffee, I had a false sense of security and decided to put my backpack right beside me instead of on my lap. Coming from Singapore, its safe af, so it was my fault that I got relax about my personal security.\n\nI placed my jacket on top of it, and sometime while chatting, a lady from behind told me that my jacket fell on the floor. It took me 10 to 15 seconds to register the fact that my bag was stolen, and even then, I would had thought that at least they'll steal my camera, not my whole bag + flash + lens and money for the trip. \n\nBy the time I knew what happened, it was too late. Inside was my hard disk, 1000 euros, canon 6D, my flash. I decided to file a police report, but it felt somewhat like a lost cause. And all this happened right before I was going to head North to meet my friends to chase the northern lights. I was depressed af, and just lost. The police weren't of much help, and they refused to show any CCTV footage. \n\n3 days later, when I was back to the police to check on any updates, some lady came in with my backpack. I felt this small spark of hope I could still have all my items, but the only thing left was my hard disk, everything else was gone. She said she found it in the toilet of the station, but still I was unable to get any footage even though there was one. I had registered my camera serial code with nearby pawn shops, and also used the stolen camera finder site, but nothing ever turns up.\n\nI seriously wanted to shoot the Northern lights, and I was just thinking if I should rent or buy another, but the final decision was that its more logical to buy one. So I asked my Dad if he could help me, and he did, and he sent it over with my friends. \n\nAfter the travel and going home, I went back to claim Insurance, but apparently camera insurance don't exist in Singapore, and they could only give a max payout of 500 bucks, regardless of the value of the item, and excluding the money stolen, since I could had lied about the value. In the end the payout was only able to cover the Insurance but not the gear.\n\nAfterwards, I've gotten more paranoid about my gear when I travel, if my bag is on the floor of a crowded place, I put my foot through the bag strap, so if anyone tries to steal it, they'll be pulling me, I use a rain cover everytime I am outdoor, so if someone wants to grab something they'll have to get pass the rain cover which is pretty noisy when fiddled with. But the fact that camera insurances don't exist means that there is always a fear of the worst case scenario when I am overseas. I've seriously considered getting a GPS tag that could keep track in the event that happens, but I don't know if its a good idea.", "link": "https://www.reddit.com/r/photography/comments/7wo9he/photographers_who_had_their_gear_stolenrobbed/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "photographers who had their gear stolen/robbed before, what's your story, and did you recover it? /!/ well, there's always that unfortunate someone who gets their gear stolen.\n\nin 2015, i had made the plan to visit europe. with the money i saved from the army, i headed to sweden, with my objective being northern lights. \n\nmet a friend and had coffee in a cafe in stockholm central station. while having coffee, i had a false sense of security and decided to put my backpack right beside me instead of on my lap. coming from singapore, its safe af, so it was my fault that i got relax about my personal security.\n\ni placed my jacket on top of it, and sometime while chatting, a lady from behind told me that my jacket fell on the floor. it took me 10 to 15 seconds to register the fact that my bag was stolen, and even then, i would had thought that at least they'll steal my camera, not my whole bag + flash + lens and money for the trip. \n\nby the time i knew what happened, it was too late. inside was my hard disk, 1000 euros, canon 6d, my flash. i decided to file a police report, but it felt somewhat like a lost cause. and all this happened right before i was going to head north to meet my friends to chase the northern lights. i was depressed af, and just lost. the police weren't of much help, and they refused to show any cctv footage. \n\n3 days later, when i was back to the police to check on any updates, some lady came in with my backpack. i felt this small spark of hope i could still have all my items, but the only thing left was my hard disk, everything else was gone. she said she found it in the toilet of the station, but still i was unable to get any footage even though there was one. i had registered my camera serial code with nearby pawn shops, and also used the stolen camera finder site, but nothing ever turns up.\n\ni seriously wanted to shoot the northern lights, and i was just thinking if i should rent or buy another, but the final decision was that its more logical to buy one. so i asked my dad if he could help me, and he did, and he sent it over with my friends. \n\nafter the travel and going home, i went back to claim insurance, but apparently camera insurance don't exist in singapore, and they could only give a max payout of 500 bucks, regardless of the value of the item, and excluding the money stolen, since i could had lied about the value. in the end the payout was only able to cover the insurance but not the gear.\n\nafterwards, i've gotten more paranoid about my gear when i travel, if my bag is on the floor of a crowded place, i put my foot through the bag strap, so if anyone tries to steal it, they'll be pulling me, i use a rain cover everytime i am outdoor, so if someone wants to grab something they'll have to get pass the rain cover which is pretty noisy when fiddled with. but the fact that camera insurances don't exist means that there is always a fear of the worst case scenario when i am overseas. i've seriously considered getting a gps -----> tag !!!  that could keep track in the event that happens, but i don't know if its a good idea.", "sortedWord": "None", "identifyer": 28279, "year": "2018"}, {"Unnamed: 0": 282276, "autor": "jfriedland206", "date": 1525813787000, "content": "Is the Nikon D850 worth 3 grand /!/ I am looking to purchase a **New DSLR**, and I am not sure if the Nikon d850 is worth the money. I mostly want the DSLR for stills however the 4k video feature would be nice. Not looking to shoot any very high speed action either. Let me know if it is worth the 3300 dollar price tag? This would involve a lot of saving up for me.\n\n[https://www.dpreview.com/reviews/nikon\\-d850/6](https://www.dpreview.com/reviews/nikon-d850/6)", "link": "https://www.reddit.com/r/photography/comments/8i0c72/is_the_nikon_d850_worth_3_grand/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is the nikon d850 worth 3 grand /!/ i am looking to purchase a **new dslr**, and i am not sure if the nikon d850 is worth the money. i mostly want the dslr for stills however the 4k video feature would be nice. not looking to shoot any very high speed action either. let me know if it is worth the 3300 dollar price -----> tag !!! ? this would involve a lot of saving up for me.\n\n[https://www.dpreview.com/reviews/nikon\\-d850/6](https://www.dpreview.com/reviews/nikon-d850/6)", "sortedWord": "None", "identifyer": 28495, "year": "2018"}, {"Unnamed: 0": 282736, "autor": "DarkHoleAngel", "date": 1528120814000, "content": "Is there a program that auto detects or deletes images that are out of focus or blurry? /!/ I find that at least 60&amp;#37; \\(if not more\\) of all the images I take, which are a ton, are bad immediately bcs they're out of focus or blurry. This mentally burdens me, causing me to push off post\\-processing my photos and sharing them. Is there a program that can auto tag or delete photos that are out of focus or blurry, with sensitivity adjustment by the user?", "link": "https://www.reddit.com/r/photography/comments/8ohh02/is_there_a_program_that_auto_detects_or_deletes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there a program that auto detects or deletes images that are out of focus or blurry? /!/ i find that at least 60&amp;#37; \\(if not more\\) of all the images i take, which are a ton, are bad immediately bcs they're out of focus or blurry. this mentally burdens me, causing me to push off post\\-processing my photos and sharing them. is there a program that can auto -----> tag !!!  or delete photos that are out of focus or blurry, with sensitivity adjustment by the user?", "sortedWord": "None", "identifyer": 28963, "year": "2018"}, {"Unnamed: 0": 283474, "autor": "Ol0O01100lO1O1O1", "date": 1530575369000, "content": "Anybody know of software that will automatically tag bib numbers from race photos?", "link": "https://www.reddit.com/r/photography/comments/8vnh3e/anybody_know_of_software_that_will_automatically/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "anybody know of software that will automatically -----> tag !!!  bib numbers from race photos?", "sortedWord": "None", "identifyer": 29733, "year": "2018"}, {"Unnamed: 0": 283547, "autor": "gamzabi", "date": 1530496170000, "content": "Photo/File/Note Organizer with Tags, Calendars - SlipStack Mac App", "link": "https://www.reddit.com/r/photography/comments/8vewus/photofilenote_organizer_with_tags_calendars/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "photo/file/note organizer with -----> tags !!! , calendars - slipstack mac app", "sortedWord": "None", "identifyer": 29812, "year": "2018"}, {"Unnamed: 0": 283578, "autor": "Razzle3", "date": 1530874651000, "content": "HK based minimalist brand looking for photos for Instagram strategy. Grow with us! /!/ Hey Guys and Gals,\n\nRyan here from Sleep.io, Hong Kong's first legitimate capsule hotel. We are in the very near future going to be diving into a new Instagram strategy and are calling all travel, business and minimalist lifestyle influencers for images to use.\n\nIn short, this is a free share, no strings attached!\n\nWe will be using all images either stand-alone (if they are really great) or as backgrounds for quotes etc. All you have to do is shoot us your image along with your Insta handle so we can tag you using the google form below!\n\nCheck our Insta here: [https://www.instagram.com/wesleeep/](https://www.instagram.com/wesleeep/)\n\nIf you are interested please submit photos here… [https://goo.gl/forms/UrTew7aOjvlIfFc42](https://goo.gl/forms/UrTew7aOjvlIfFc42)\n\nSleeep well!", "link": "https://www.reddit.com/r/photography/comments/8wj5dc/hk_based_minimalist_brand_looking_for_photos_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hk based minimalist brand looking for photos for instagram strategy. grow with us! /!/ hey guys and gals,\n\nryan here from sleep.io, hong kong's first legitimate capsule hotel. we are in the very near future going to be diving into a new instagram strategy and are calling all travel, business and minimalist lifestyle influencers for images to use.\n\nin short, this is a free share, no strings attached!\n\nwe will be using all images either stand-alone (if they are really great) or as backgrounds for quotes etc. all you have to do is shoot us your image along with your insta handle so we can -----> tag !!!  you using the google form below!\n\ncheck our insta here: [https://www.instagram.com/wesleeep/](https://www.instagram.com/wesleeep/)\n\nif you are interested please submit photos here… [https://goo.gl/forms/urtew7aojvliffc42](https://goo.gl/forms/urtew7aojvliffc42)\n\nsleeep well!", "sortedWord": "None", "identifyer": 29844, "year": "2018"}, {"Unnamed: 0": 284640, "autor": "Photography1234", "date": 1534378889000, "content": "Looking for people down to make a Instagram DM group to grow and boost engagement, leave insta tag below /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/97njjp/looking_for_people_down_to_make_a_instagram_dm/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for people down to make a instagram dm group to grow and boost engagement, leave insta -----> tag !!!  below /!/ [removed]", "sortedWord": "None", "identifyer": 30942, "year": "2018"}, {"Unnamed: 0": 286005, "autor": "detectivejetpack", "date": 1538625212000, "content": "Boudoir Photoshoot /!/ So I think my friend got screwed.\n\nTLDR; A mostly wedding photographer does Boudoir shoots on the side. Theres a long story of him being a dick and giving poor customer service, but basically she paid $3,200 for 14 photos in a little photo book (10in x 7in I think. Ish.) and he liked, didn't edit, and posted &amp; tagged her mostly negative photos on his social media against her express wishes. Help?\n\nI introduced her to him because I had met him at a Street Fest and talked about the possibility of my partner and I doing a shoot for around $1,000 or $1,200.\n\nI've since gotten through his website and has seen that he charges $3000 for weddings of 150 people or less, so he's charging her more than having to go off location lasting a lot longer.\n\nHe states in his website that all editing and photoshopping is included in cost and done in house, but he was unable to slightly smooth a crease in her neck she found unflattering and to remove a small piece of hair splayed at the wrong angle on a solid colored pillow. He tried to charge them $75 to Outsource the work (???) and sent all the pictures off to the printer in the middle of this conversation without telling them until after anyway so nothing was fixed.\n\nAfter he said he was incapable of photoshopping, my friend said 'In that case that I've taken a Photoshop class A few years ago and was pretty decent and would like to do it herself that night. He said he had no way of sending those photos. He sent the photos later that night after he'd sent them to be printed.\n\nHe also posted some of the most risque photos on his Instagram after she explicitly stated that she wants to review what pictures he picked BEFORE he posted. We have text proof.\n\nHe also AFTER ALL THIS cajoled and asked repeatedly if she would make a video praising his work and recommending him to others. She had to tell him 3 times \"No, being on video makes me extremely uncomfortable.\"\n\nBasically, we are picking up the photo book this Sunday and I want to know if she's been messed with, overcharged, or is this is standard practice for the industry.", "link": "https://www.reddit.com/r/photography/comments/9l8hft/boudoir_photoshoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "boudoir photoshoot /!/ so i think my friend got screwed.\n\ntldr; a mostly wedding photographer does boudoir shoots on the side. theres a long story of him being a dick and giving poor customer service, but basically she paid $3,200 for 14 photos in a little photo book (10in x 7in i think. ish.) and he liked, didn't edit, and posted &amp; -----> tagged !!!  her mostly negative photos on his social media against her express wishes. help?\n\ni introduced her to him because i had met him at a street fest and talked about the possibility of my partner and i doing a shoot for around $1,000 or $1,200.\n\ni've since gotten through his website and has seen that he charges $3000 for weddings of 150 people or less, so he's charging her more than having to go off location lasting a lot longer.\n\nhe states in his website that all editing and photoshopping is included in cost and done in house, but he was unable to slightly smooth a crease in her neck she found unflattering and to remove a small piece of hair splayed at the wrong angle on a solid colored pillow. he tried to charge them $75 to outsource the work (???) and sent all the pictures off to the printer in the middle of this conversation without telling them until after anyway so nothing was fixed.\n\nafter he said he was incapable of photoshopping, my friend said 'in that case that i've taken a photoshop class a few years ago and was pretty decent and would like to do it herself that night. he said he had no way of sending those photos. he sent the photos later that night after he'd sent them to be printed.\n\nhe also posted some of the most risque photos on his instagram after she explicitly stated that she wants to review what pictures he picked before he posted. we have text proof.\n\nhe also after all this cajoled and asked repeatedly if she would make a video praising his work and recommending him to others. she had to tell him 3 times \"no, being on video makes me extremely uncomfortable.\"\n\nbasically, we are picking up the photo book this sunday and i want to know if she's been messed with, overcharged, or is this is standard practice for the industry.", "sortedWord": "None", "identifyer": 32354, "year": "2018"}, {"Unnamed: 0": 286323, "autor": "Hallelujah289", "date": 1539390997000, "content": "Under $300 desktop? Or laptop/large monitor combo? /!/ Bought an old Nikon D90 but found I couldn’t really use it for the purposes I wanted because my laptop screen was all washed out. My laptop is from 2009 and failing badly. I inherited an Apple iPhone 6 and have been using it as a camera/computer combo and I like the screen but can’t really afford Apple price tags on my own. Hoping that in the last decade desktops have improved to the extent where I can have a nice screen within budget, and perhaps locally. Haven’t had one for years. Also inherited my brother’s 32” monitor for a week and liked the format, but that too is about ten years old and I’ll actually be giving it away today (because it’s so burnt out). I’ve tried looking into laptop/monitor combos but apparently I can’t expect high resolution monitor image from a low resolution laptop so in the end desktop might be simpler for me. Unless you can suggest a pairing. \n\nThanks. ", "link": "https://www.reddit.com/r/photography/comments/9nppai/under_300_desktop_or_laptoplarge_monitor_combo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "under $300 desktop? or laptop/large monitor combo? /!/ bought an old nikon d90 but found i couldn’t really use it for the purposes i wanted because my laptop screen was all washed out. my laptop is from 2009 and failing badly. i inherited an apple iphone 6 and have been using it as a camera/computer combo and i like the screen but can’t really afford apple price -----> tags !!!  on my own. hoping that in the last decade desktops have improved to the extent where i can have a nice screen within budget, and perhaps locally. haven’t had one for years. also inherited my brother’s 32” monitor for a week and liked the format, but that too is about ten years old and i’ll actually be giving it away today (because it’s so burnt out). i’ve tried looking into laptop/monitor combos but apparently i can’t expect high resolution monitor image from a low resolution laptop so in the end desktop might be simpler for me. unless you can suggest a pairing. \n\nthanks. ", "sortedWord": "None", "identifyer": 32683, "year": "2018"}, {"Unnamed: 0": 286357, "autor": "tzippy84", "date": 1539348633000, "content": "Mac App to geotag Photos based on reference photos taken with another camera /!/ Hello!\n\nI hope you can help me.\n\nI am using macOS [Photos.app](https://Photos.app) for sorting my photos. I have done a couple of trips with my DSLR (no GPS) and iPhone.\n\nNow I want to copy the GPS tags from the iPhone photos to the DSLR photos based on closest timestamp. For new photos I am using a script in combination with exiftools, before I import the DSLR photos into the library.\n\nBut now I want to do the same with photos that are in the library already. \n\nSo far, I came only across HoudahGeo, but thats 35€. I was looking for an open source solution that's also using the [Photos.app](https://Photos.app) library.\n\nI hope someone can help me!\n\n Thank you in advance!", "link": "https://www.reddit.com/r/photography/comments/9njzr6/mac_app_to_geotag_photos_based_on_reference/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "mac app to geotag photos based on reference photos taken with another camera /!/ hello!\n\ni hope you can help me.\n\ni am using macos [photos.app](https://photos.app) for sorting my photos. i have done a couple of trips with my dslr (no gps) and iphone.\n\nnow i want to copy the gps -----> tags !!!  from the iphone photos to the dslr photos based on closest timestamp. for new photos i am using a script in combination with exiftools, before i import the dslr photos into the library.\n\nbut now i want to do the same with photos that are in the library already. \n\nso far, i came only across houdahgeo, but thats 35€. i was looking for an open source solution that's also using the [photos.app](https://photos.app) library.\n\ni hope someone can help me!\n\n thank you in advance!", "sortedWord": "None", "identifyer": 32717, "year": "2018"}, {"Unnamed: 0": 286446, "autor": "MightyTeaRex", "date": 1539952587000, "content": "Looking for feedback on a Photography Portfolio design /!/ Hi!  \n\n\nI'm working on a photography related portfolio design that I was originally going to use myself personally, but I don't know anything about developing at all. So if you're interested in collaborating on creating this into wordpress, send me a pm!  \n\n\nSo the idea behind the design is that it's focusing mainly on photography. And it's super minimal. The whole point is to go straight to the point of what I personally think a photography portfolio should be; the work. This minimal design focus on showing the work as the first thing you see when visiting. If there's one thing I hate about portfolios, especially photography ones, is a lot of unecessary information and stuff that is of no interest to potential clients.\n\n&amp;#x200B;\n\n**Landing (optional):** [**https://i.imgur.com/4kwZ1Uq.png**](https://i.imgur.com/4kwZ1Uq.png)\n\nI have seen a few photography portfolios up the years, and noticed some had a primary landing page, with next to no text and just showing the latest images in a automatic and smooth slider, and perhaps a tag line in very few words. Of course, this would be optional as loads of people don't like these.\n\n&amp;#x200B;\n\n**Mainpage:** [**https://i.imgur.com/8TY7fWT.png**](https://i.imgur.com/8TY7fWT.png)\n\nThe mainpage is where it would normally start. I see a lot of portfolios showing the latest work here. The idea here to list the different categories that the photographer might have, so anything from music to portraits to landscape etc. When it comes to photography portfolios, I personally like when they are fullscreen the whole time, without vertical scrolling, which is why I opted for the horizontal scrolling on this one.\n\n&amp;#x200B;\n\n**Innerpage:** [**https://i.imgur.com/Xf38dFy.png**](https://i.imgur.com/Xf38dFy.png)\n\nThis is where I struggle a little. Like I said in the last sentence under \"Mainpage\" is that I don't really like vertical scrolling if you have say 50 photos within one category. So this page is still under construction which would have 3 options. Either a masonry style, this vertical one or a horizontal one (like the mainpage). Any ideas here are welcome.\n\n&amp;#x200B;\n\n**Fullscreen:** [**https://i.imgur.com/7kLWYNH.png**](https://i.imgur.com/7kLWYNH.png)\n\nThis is the page that appears when clicking on an image, giving you a more fullscreen view with larger images and next to no other content. This is to purely focus on showing the work in a less \"distracting\" page.\n\n&amp;#x200B;\n\nOther pages like the 'About' page is something I haven''t gotten to yet.\n\n&amp;#x200B;\n\nEverything here is still under construction. That's why I'm making this post, to gather feedback from other photographers on what you think about it, and what you might think is missing or you'd like to see.\n\n&amp;#x200B;\n\nCheers!", "link": "https://www.reddit.com/r/photography/comments/9pjeln/looking_for_feedback_on_a_photography_portfolio/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for feedback on a photography portfolio design /!/ hi!  \n\n\ni'm working on a photography related portfolio design that i was originally going to use myself personally, but i don't know anything about developing at all. so if you're interested in collaborating on creating this into wordpress, send me a pm!  \n\n\nso the idea behind the design is that it's focusing mainly on photography. and it's super minimal. the whole point is to go straight to the point of what i personally think a photography portfolio should be; the work. this minimal design focus on showing the work as the first thing you see when visiting. if there's one thing i hate about portfolios, especially photography ones, is a lot of unecessary information and stuff that is of no interest to potential clients.\n\n&amp;#x200b;\n\n**landing (optional):** [**https://i.imgur.com/4kwz1uq.png**](https://i.imgur.com/4kwz1uq.png)\n\ni have seen a few photography portfolios up the years, and noticed some had a primary landing page, with next to no text and just showing the latest images in a automatic and smooth slider, and perhaps a -----> tag !!!  line in very few words. of course, this would be optional as loads of people don't like these.\n\n&amp;#x200b;\n\n**mainpage:** [**https://i.imgur.com/8ty7fwt.png**](https://i.imgur.com/8ty7fwt.png)\n\nthe mainpage is where it would normally start. i see a lot of portfolios showing the latest work here. the idea here to list the different categories that the photographer might have, so anything from music to portraits to landscape etc. when it comes to photography portfolios, i personally like when they are fullscreen the whole time, without vertical scrolling, which is why i opted for the horizontal scrolling on this one.\n\n&amp;#x200b;\n\n**innerpage:** [**https://i.imgur.com/xf38dfy.png**](https://i.imgur.com/xf38dfy.png)\n\nthis is where i struggle a little. like i said in the last sentence under \"mainpage\" is that i don't really like vertical scrolling if you have say 50 photos within one category. so this page is still under construction which would have 3 options. either a masonry style, this vertical one or a horizontal one (like the mainpage). any ideas here are welcome.\n\n&amp;#x200b;\n\n**fullscreen:** [**https://i.imgur.com/7klwynh.png**](https://i.imgur.com/7klwynh.png)\n\nthis is the page that appears when clicking on an image, giving you a more fullscreen view with larger images and next to no other content. this is to purely focus on showing the work in a less \"distracting\" page.\n\n&amp;#x200b;\n\nother pages like the 'about' page is something i haven''t gotten to yet.\n\n&amp;#x200b;\n\neverything here is still under construction. that's why i'm making this post, to gather feedback from other photographers on what you think about it, and what you might think is missing or you'd like to see.\n\n&amp;#x200b;\n\ncheers!", "sortedWord": "None", "identifyer": 32808, "year": "2018"}, {"Unnamed: 0": 287083, "autor": "Dogrules23", "date": 1542228315000, "content": "Halide Camera App /!/ Is the Halide camera app worth the $5.99 price tag? I love photography and want to be able to do more with my iPhone XR in terms of picture quality. ", "link": "https://www.reddit.com/r/photography/comments/9x3xyg/halide_camera_app/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "halide camera app /!/ is the halide camera app worth the $5.99 price -----> tag !!! ? i love photography and want to be able to do more with my iphone xr in terms of picture quality. ", "sortedWord": "None", "identifyer": 33469, "year": "2018"}, {"Unnamed: 0": 287761, "autor": "paulkem", "date": 1545003072000, "content": "Tool to determine if photo was edited? /!/ I hope this is the appropriate place to ask this question.\n\nI am trying to tag and organize 15 years worth of digital pictures...snapshots primarily.  I hope to utilize folders for only date organization (really, just to break up into smaller pieces), and use tags for all other organization, as this allows for multiple attributes for searching.  \n\nOne of the attributes I would like to include is \"Edited\" and \"Unedited\".  Some of the files are quite obvious, but others not so much. Is there a tool out there that can scan the file and determine whether it was edited, preferably batch so I do not have to check each file individually? The vast majority of the edits would have taken place in Google Picasa.\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/a6u5b7/tool_to_determine_if_photo_was_edited/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "tool to determine if photo was edited? /!/ i hope this is the appropriate place to ask this question.\n\ni am trying to -----> tag !!!  and organize 15 years worth of digital pictures...snapshots primarily.  i hope to utilize folders for only date organization (really, just to break up into smaller pieces), and use tags for all other organization, as this allows for multiple attributes for searching.  \n\none of the attributes i would like to include is \"edited\" and \"unedited\".  some of the files are quite obvious, but others not so much. is there a tool out there that can scan the file and determine whether it was edited, preferably batch so i do not have to check each file individually? the vast majority of the edits would have taken place in google picasa.\n\nthanks.", "sortedWord": "None", "identifyer": 34169, "year": "2018"}, {"Unnamed: 0": 288761, "autor": "thehavensgrey", "date": 1525970075000, "content": "Granting image use rights to a local tourism board. /!/ I'm an amateur photographer, active in a lot of local hub accounts. Recently, I've started getting more attention from local tourism boards for my pictures (usually because I tag them) and sometimes they re-share or ask to use my content in other media campaigns.\n\nTypically they want me to OK an agreement to share my work w/ credit but w/o compensation. Something like: \"irrevocable, worldwide, royalty-free, unrestricted, perpetual sub-licensable (through multiple tiers) and transferable right and license to use, copy, transmit, publish or otherwise distribute, modify, create derivative works based upon, incorporate into other works, publicly perform and display the content or any portion thereof, in or through any medium, whether now known or hereafter created\". As to how they'd give credit: the tourism board \"shall exercise reasonable efforts to include credit to you when using the content, provided that the details such as your name and/or social media identity (i.e., Twitter handle) are contextually appropriate and are included by you.\"\n\nI realize I'm giving a lot up here, but the reality is that the likelihood of me being able to sell this work by myself right now is incredibly low. I don't have a website, I've never made prints and sold at a local art fair/coffeeshop, etc. So, giving up these rights to a single image of mine is probably worth it for the free exposure, right? Those things are possibilities in the near future, but hey this isn't my day job and likely never will be. I do it for fun, making a name and selling some prints would just be a bonus.\n\nCurious for how I SHOULD approach this as I don't have much experience and would love to get my name out there if it means giving up rights to a few photos. For what it's worth, these inquiries are usually not even for images that are important to me, just ones that are notable for highlighting a local tourist spot. \n\nThanks for the input.", "link": "https://www.reddit.com/r/photography/comments/8ig9ss/granting_image_use_rights_to_a_local_tourism_board/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "granting image use rights to a local tourism board. /!/ i'm an amateur photographer, active in a lot of local hub accounts. recently, i've started getting more attention from local tourism boards for my pictures (usually because i -----> tag !!!  them) and sometimes they re-share or ask to use my content in other media campaigns.\n\ntypically they want me to ok an agreement to share my work w/ credit but w/o compensation. something like: \"irrevocable, worldwide, royalty-free, unrestricted, perpetual sub-licensable (through multiple tiers) and transferable right and license to use, copy, transmit, publish or otherwise distribute, modify, create derivative works based upon, incorporate into other works, publicly perform and display the content or any portion thereof, in or through any medium, whether now known or hereafter created\". as to how they'd give credit: the tourism board \"shall exercise reasonable efforts to include credit to you when using the content, provided that the details such as your name and/or social media identity (i.e., twitter handle) are contextually appropriate and are included by you.\"\n\ni realize i'm giving a lot up here, but the reality is that the likelihood of me being able to sell this work by myself right now is incredibly low. i don't have a website, i've never made prints and sold at a local art fair/coffeeshop, etc. so, giving up these rights to a single image of mine is probably worth it for the free exposure, right? those things are possibilities in the near future, but hey this isn't my day job and likely never will be. i do it for fun, making a name and selling some prints would just be a bonus.\n\ncurious for how i should approach this as i don't have much experience and would love to get my name out there if it means giving up rights to a few photos. for what it's worth, these inquiries are usually not even for images that are important to me, just ones that are notable for highlighting a local tourist spot. \n\nthanks for the input.", "sortedWord": "None", "identifyer": 35219, "year": "2018"}, {"Unnamed: 0": 288861, "autor": "OverThoughtName", "date": 1526712208000, "content": "The Profoto A1 is so good it makes me angry. /!/ I just finished working an event for another photographer. He had rented two profoto A1s and let me use one. I usually use either my Nikon SB 700 or SB 800. The quality of light from the Profoto A1 absolutely blew my gear out of the water. I was really hoping I wouldn’t like it so much, given its exorbitant price tag, but the difference is real. I’m angry because now I have to convince myself my speedlights are fine, and I don’t need to drop $1,000 on a new one. ...I wonder what the rental rate is.", "link": "https://www.reddit.com/r/photography/comments/8kjml0/the_profoto_a1_is_so_good_it_makes_me_angry/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "the profoto a1 is so good it makes me angry. /!/ i just finished working an event for another photographer. he had rented two profoto a1s and let me use one. i usually use either my nikon sb 700 or sb 800. the quality of light from the profoto a1 absolutely blew my gear out of the water. i was really hoping i wouldn’t like it so much, given its exorbitant price -----> tag !!! , but the difference is real. i’m angry because now i have to convince myself my speedlights are fine, and i don’t need to drop $1,000 on a new one. ...i wonder what the rental rate is.", "sortedWord": "None", "identifyer": 35326, "year": "2018"}, {"Unnamed: 0": 289277, "autor": "shakirthow", "date": 1531171532000, "content": "How to curate/tag stock photos properly? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8xgfou/how_to_curatetag_stock_photos_properly/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how to curate/-----> tag !!!  stock photos properly? /!/ [removed]", "sortedWord": "None", "identifyer": 35752, "year": "2018"}, {"Unnamed: 0": 290317, "autor": "Ruckus55", "date": 1539279713000, "content": "Need direction on what to buy - Canon 5D got in a fight with gravity, and lost. /!/ As the title says I have a 5D original that got in a fight with gravity. It did not survive. That being said I would like to get a new body and no idea where to go. I've got a 17-40 and a 70-200 so I'll be sticking with a Canon body.\n\nThat being said, I really enjoyed having a full frame camera but it's not a dead set requirement. I would love the latest 5D but the price tag is quite steep for me. I think 2k maybe 2500 would be my upper limit. I enjoy shooting a little bit of everything. Any recommendations on what to go with or stay away from would be appreciated.\n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/9nc4dn/need_direction_on_what_to_buy_canon_5d_got_in_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "need direction on what to buy - canon 5d got in a fight with gravity, and lost. /!/ as the title says i have a 5d original that got in a fight with gravity. it did not survive. that being said i would like to get a new body and no idea where to go. i've got a 17-40 and a 70-200 so i'll be sticking with a canon body.\n\nthat being said, i really enjoyed having a full frame camera but it's not a dead set requirement. i would love the latest 5d but the price -----> tag !!!  is quite steep for me. i think 2k maybe 2500 would be my upper limit. i enjoy shooting a little bit of everything. any recommendations on what to go with or stay away from would be appreciated.\n\nthanks in advance.", "sortedWord": "None", "identifyer": 36831, "year": "2018"}, {"Unnamed: 0": 291219, "autor": "aydin_h", "date": 1543304144000, "content": "Does anybody know of an app to manage stock image accounts? /!/ Does something exist to connect multiple stock image accounts so that uploads/descriptions/tags etc can just be written once and pushed to the connected accounts?\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/a0so97/does_anybody_know_of_an_app_to_manage_stock_image/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "does anybody know of an app to manage stock image accounts? /!/ does something exist to connect multiple stock image accounts so that uploads/descriptions/-----> tags !!!  etc can just be written once and pushed to the connected accounts?\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 37765, "year": "2018"}], "name": "tagphotography2018"}