{"interestingcomments": [{"Unnamed: 0": 58326, "autor": "btond32", "date": 1599802411000, "content": "Ownership of Photos Help! /!/ #advice \n\nI need serious guidance. I am a Part Time Content Strategist for a Bridal Boutique. My main role is In House Photographer. We did a high end photo shoot that another outside photographer offered to help with FOR FREE so she could help build her portfolio. \n\nThe shoot went great we posted her photos and tagged her on our Bridal Account, she got lots of great engagement on the photos she posted and one of her photos even got published on Style Me Pretty, so an overall win for her! \n\nI posted two of the photos I took during the shoot on my freelance photography instagram account as I was told when I was hired I had the rights to all my own photos and I also use all my own camera equipment, computer, editing software, etc. I was told I was not allowed to promote my side business obviously at work or on any of our work accounts.\nThe designer of the gowns that were photographed used my images on their instagram and tagged the outside photographer on accident and not me. I kindly asked them to change the tag and they did. However before they changed it the outside photographer posted their post of MY image to her story acting as if it was hers since she was tagged in it. \n\nAfter they changed the tag she DM'd us acting confused as to whose photos these were and thought I was only taking video. Now my marketing director and owner of the company are asking me to remove the photos I took even though those are the ones being recognized and helping promote our store and our dresses. \nThey are claiming the outside photographer feels like this is causing a confusion and hurting the integrity of her business since people are mixing up out photos? \nDo I have the right to these photos since I took them on my camera, and have never once signed over the rights to them to my company that I work for? I also am only part time and they were very aware I had a freelancing business and a business instagram when I was hired?? I do not know what to do and I feel like they are taking the side of an outside photographer versus their own loyal employee?? HELP!", "link": "https://www.reddit.com/r/photography/comments/iqknwl/ownership_of_photos_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "ownership of photos help! /!/ #advice \n\ni need serious guidance. i am a part time content strategist for a bridal boutique. my main role is in house photographer. we did a high end photo shoot that another outside photographer offered to help with for free so she could help build her portfolio. \n\nthe shoot went great we posted her photos and -----> tagged !!!  her on our bridal account, she got lots of great engagement on the photos she posted and one of her photos even got published on style me pretty, so an overall win for her! \n\ni posted two of the photos i took during the shoot on my freelance photography instagram account as i was told when i was hired i had the rights to all my own photos and i also use all my own camera equipment, computer, editing software, etc. i was told i was not allowed to promote my side business obviously at work or on any of our work accounts.\nthe designer of the gowns that were photographed used my images on their instagram and tagged the outside photographer on accident and not me. i kindly asked them to change the tag and they did. however before they changed it the outside photographer posted their post of my image to her story acting as if it was hers since she was tagged in it. \n\nafter they changed the tag she dm'd us acting confused as to whose photos these were and thought i was only taking video. now my marketing director and owner of the company are asking me to remove the photos i took even though those are the ones being recognized and helping promote our store and our dresses. \nthey are claiming the outside photographer feels like this is causing a confusion and hurting the integrity of her business since people are mixing up out photos? \ndo i have the right to these photos since i took them on my camera, and have never once signed over the rights to them to my company that i work for? i also am only part time and they were very aware i had a freelancing business and a business instagram when i was hired?? i do not know what to do and i feel like they are taking the side of an outside photographer versus their own loyal employee?? help!", "sortedWord": "None", "identifyer": 59749, "year": "2020"}, {"Unnamed: 0": 58568, "autor": "elegantmushroom", "date": 1609211100000, "content": "Is Tumblr still a good place to build an audience for my photographs? What other platforms have you had the most success on (besides Instagram)? /!/ I've recently decided to start selling prints of my work in order to generate a bit of extra income. Building up a following on social media seems like a good way to find people who might be interested in buying my photos. I've been posting on Instagram for years, but have had trouble getting many people to see my posts (despite using tags, trying to be active on the platform, etc.). This problem seems to have gotten worse over the last year or two, so I'm wanting to move someplace else. Tumblr used to be a great place for photographers and other artists to get their work out there, so I'm wondering if this is still the case. It seems a bit dead now, but maybe I'm not looking in the right places? Have you had any success on Tumblr recently? Any advice on how to do well there? Alternatively, what other platforms have you gotten traction on? \n\nThanks if anyone answers. \n\n(Mods: Hopefully this post falls under \"interesting discussion/questions\" and doesn't veer into \"social media rants\". Feel free to delete if I'm wrong.)", "link": "https://www.reddit.com/r/photography/comments/km5ng6/is_tumblr_still_a_good_place_to_build_an_audience/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "is tumblr still a good place to build an audience for my photographs? what other platforms have you had the most success on (besides instagram)? /!/ i've recently decided to start selling prints of my work in order to generate a bit of extra income. building up a following on social media seems like a good way to find people who might be interested in buying my photos. i've been posting on instagram for years, but have had trouble getting many people to see my posts (despite using -----> tags !!! , trying to be active on the platform, etc.). this problem seems to have gotten worse over the last year or two, so i'm wanting to move someplace else. tumblr used to be a great place for photographers and other artists to get their work out there, so i'm wondering if this is still the case. it seems a bit dead now, but maybe i'm not looking in the right places? have you had any success on tumblr recently? any advice on how to do well there? alternatively, what other platforms have you gotten traction on? \n\nthanks if anyone answers. \n\n(mods: hopefully this post falls under \"interesting discussion/questions\" and doesn't veer into \"social media rants\". feel free to delete if i'm wrong.)", "sortedWord": "None", "identifyer": 59994, "year": "2020"}, {"Unnamed: 0": 58620, "autor": "CompleteDatabase", "date": 1606095848000, "content": "looking for a gimbal /!/ Hi guys, just a very quick question, I'm considering a purchase of either DJI OM3 or DJI OM4, which one do you think is better?. Do you guys think OM4 is worth the price tag? OM3 is on a pretty big sale at this time, so, if OM4 doesn't really have anything else other than the magnetic clamp I'll just go with that one.", "link": "https://www.reddit.com/r/photography/comments/jz8b1p/looking_for_a_gimbal/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for a gimbal /!/ hi guys, just a very quick question, i'm considering a purchase of either dji om3 or dji om4, which one do you think is better?. do you guys think om4 is worth the price -----> tag !!! ? om3 is on a pretty big sale at this time, so, if om4 doesn't really have anything else other than the magnetic clamp i'll just go with that one.", "sortedWord": "None", "identifyer": 60048, "year": "2020"}, {"Unnamed: 0": 59143, "autor": "watts2988", "date": 1579282312000, "content": "Have to rant a little bit about photography gatekeepers /!/ There are quite a few elitists out there who latch onto the nature preservation movement under that guise when in reality they feel that it is okay for them to see neat places, but for others it is bad because they will destroy the environment. The most obvious is when Instagram people won’t tag their locations or even share when asked by someone. I believe that there are some people genuinely concerned, but I believe many people just want to be a special snowflake and keep the places to themselves and this gives them a good cover. After all if it’s okay for you to visit a place in a responsible way, others can do the same. It’s totally cool to promote leave no trace in nature. \n\nNow most people are content to just hide their own locations and withhold info from those asking as they tell them they don’t want others to go and ruin the place. Okay you do you. But today I had someone take it to a new level and actually commented on my picture and told me to remove my geotag and that by having it tagged I was contributing to the environment getting wrecked. This was a waterfall FYI. When I kindly told him no he proceeded to go off on me in an angry rant before I told him to get f*cked. \n\nI absolutely love getting into nature as often as possible but I don’t see where these people get off on telling others that they can go somewhere but it’s bad for others to do so. There are so many of these pompous assholes it is mind blowing. I’m sure one may even show up on this post. Have any of you seen or encountered this new type of elitism?", "link": "https://www.reddit.com/r/photography/comments/eq3i38/have_to_rant_a_little_bit_about_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "have to rant a little bit about photography gatekeepers /!/ there are quite a few elitists out there who latch onto the nature preservation movement under that guise when in reality they feel that it is okay for them to see neat places, but for others it is bad because they will destroy the environment. the most obvious is when instagram people won’t -----> tag !!!  their locations or even share when asked by someone. i believe that there are some people genuinely concerned, but i believe many people just want to be a special snowflake and keep the places to themselves and this gives them a good cover. after all if it’s okay for you to visit a place in a responsible way, others can do the same. it’s totally cool to promote leave no trace in nature. \n\nnow most people are content to just hide their own locations and withhold info from those asking as they tell them they don’t want others to go and ruin the place. okay you do you. but today i had someone take it to a new level and actually commented on my picture and told me to remove my geotag and that by having it tagged i was contributing to the environment getting wrecked. this was a waterfall fyi. when i kindly told him no he proceeded to go off on me in an angry rant before i told him to get f*cked. \n\ni absolutely love getting into nature as often as possible but i don’t see where these people get off on telling others that they can go somewhere but it’s bad for others to do so. there are so many of these pompous assholes it is mind blowing. i’m sure one may even show up on this post. have any of you seen or encountered this new type of elitism?", "sortedWord": "None", "identifyer": 60583, "year": "2020"}, {"Unnamed: 0": 59347, "autor": "[deleted]", "date": 1588728364000, "content": "Can anyone figure out this tag? /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/geamet/can_anyone_figure_out_this_tag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "can anyone figure out this -----> tag !!! ? /!/ [deleted]", "sortedWord": "None", "identifyer": 60790, "year": "2020"}, {"Unnamed: 0": 59918, "autor": "Kai_Sachs", "date": 1599686149000, "content": "Instagram Tags /!/ Recently I've really been working a lot on my Instagram account. Personally I love the way it looks but I know that this alone won't attract new followers. The best way to bring attention to my account is probably to use hashtags but I don't want to spam my posts. So what tags do you use and recommend? Also if you want you're welcome to critique my photos, stories and or whole account (kai_sachs). Would like to hear opinions", "link": "https://www.reddit.com/r/photography/comments/ippd64/instagram_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "instagram -----> tags !!!  /!/ recently i've really been working a lot on my instagram account. personally i love the way it looks but i know that this alone won't attract new followers. the best way to bring attention to my account is probably to use hashtags but i don't want to spam my posts. so what tags do you use and recommend? also if you want you're welcome to critique my photos, stories and or whole account (kai_sachs). would like to hear opinions", "sortedWord": "None", "identifyer": 61376, "year": "2020"}, {"Unnamed: 0": 59937, "autor": "roykeane_16", "date": 1599668571000, "content": "Question about long exposures /!/ I see a lot of photographs tagged as long exposures in which there is no sky, no water, and no crowd considerations involved in choosing long exposure. And I'm wondering what, if any, benefit there is to a long exposure in a case like this? Are there other benefits beyond those 3 factors?\n\nI guess what I'm asking is, what's the point of long exposure for the sake of doing long exposure?", "link": "https://www.reddit.com/r/photography/comments/ipj606/question_about_long_exposures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "question about long exposures /!/ i see a lot of photographs -----> tagged !!!  as long exposures in which there is no sky, no water, and no crowd considerations involved in choosing long exposure. and i'm wondering what, if any, benefit there is to a long exposure in a case like this? are there other benefits beyond those 3 factors?\n\ni guess what i'm asking is, what's the point of long exposure for the sake of doing long exposure?", "sortedWord": "None", "identifyer": 61395, "year": "2020"}, {"Unnamed: 0": 60077, "autor": "salilramani", "date": 1596566399000, "content": "Photography Buddy : Hamilton, Ontario, CA /!/ Hi, \n\nI'm new to photography and I'm looking for somebody to tag along in Ontario so that I can learn and improve.\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/i3p08h/photography_buddy_hamilton_ontario_ca/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "photography buddy : hamilton, ontario, ca /!/ hi, \n\ni'm new to photography and i'm looking for somebody to -----> tag !!!  along in ontario so that i can learn and improve.\n\nthanks", "sortedWord": "None", "identifyer": 61539, "year": "2020"}, {"Unnamed: 0": 60193, "autor": "musicmoose27", "date": 1602813914000, "content": "ADVICE NEEDED: PL-E8 Battery /!/ I have a Canon Rebel t3i and am looking to buy a second battery. The price tag of a Canon PL-E8 is understandable, but I would rather buy a cheaper, other brand so long as it doesn't ruin my camera and can hold a charge. Any suggestions? TIA!", "link": "https://www.reddit.com/r/photography/comments/jc14zg/advice_needed_ple8_battery/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "advice needed: pl-e8 battery /!/ i have a canon rebel t3i and am looking to buy a second battery. the price -----> tag !!!  of a canon pl-e8 is understandable, but i would rather buy a cheaper, other brand so long as it doesn't ruin my camera and can hold a charge. any suggestions? tia!", "sortedWord": "None", "identifyer": 61656, "year": "2020"}, {"Unnamed: 0": 60607, "autor": "qan7", "date": 1605982334000, "content": "Photo Reference /!/ Hi guys,\n\nI’m an artist and pretty small just started and I used this photographer’s photo as a reference and I thought I was being nice and put it as my second photo on my Instagram post just to show the inspiration (even though it ended up quite different) and I tagged him but he got really upset about credit. \n\nI’m new to this and probably next time I won’t post the reference photo but is this normal? \n\nI took it down immediately and just reported my art. But it’s gotten me questioning if I’m even allowed to paint other people photo.", "link": "https://www.reddit.com/r/photography/comments/jyfgww/photo_reference/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "photo reference /!/ hi guys,\n\ni’m an artist and pretty small just started and i used this photographer’s photo as a reference and i thought i was being nice and put it as my second photo on my instagram post just to show the inspiration (even though it ended up quite different) and i -----> tagged !!!  him but he got really upset about credit. \n\ni’m new to this and probably next time i won’t post the reference photo but is this normal? \n\ni took it down immediately and just reported my art. but it’s gotten me questioning if i’m even allowed to paint other people photo.", "sortedWord": "None", "identifyer": 62078, "year": "2020"}, {"Unnamed: 0": 60975, "autor": "joey-hager", "date": 1583877464000, "content": "Differentiating different film stocks in Google Photos /!/ I downloaded the Lenstagger extension into Lightroom so that I could batch mark which film stock I used, but it looks like the only thing that transferred once I uploaded to Google Photos was the ISO. Is there a program I can use to do this properly, or is there a way to tag photos in GP that I'm not seeing? Ideally I would like to be able to search through my photos by stock (searching \"portra 160\" or the like); I'm still new to 35mm, so being able to compare results quickly would be ideal. Thank you!", "link": "https://www.reddit.com/r/photography/comments/fglx76/differentiating_different_film_stocks_in_google/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "differentiating different film stocks in google photos /!/ i downloaded the lenstagger extension into lightroom so that i could batch mark which film stock i used, but it looks like the only thing that transferred once i uploaded to google photos was the iso. is there a program i can use to do this properly, or is there a way to -----> tag !!!  photos in gp that i'm not seeing? ideally i would like to be able to search through my photos by stock (searching \"portra 160\" or the like); i'm still new to 35mm, so being able to compare results quickly would be ideal. thank you!", "sortedWord": "None", "identifyer": 62461, "year": "2020"}, {"Unnamed: 0": 61609, "autor": "Joldroyd", "date": 1579130624000, "content": "Question about tagging/mentioning on Instagram /!/ Hey kind of a weird question,\n\nI recently took a photograph that I'm pretty happy with and was inspired by a particular photographer on instagram. This photographer doesn't have a MASSIVE following (about 13k) but I love their style none the less and wanted to show my appreciation for it.\n\nIs it inappropriate to mention someone in the post by using something like \"@photographer\" inspired shot? \n\nOr would is be more considerate to use a hashtag of their account instead? \n\nI just don't want to be annoying.\n\nAny help is greatly appreciated.", "link": "https://www.reddit.com/r/photography/comments/epaeb2/question_about_taggingmentioning_on_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "question about -----> tagging !!! /mentioning on instagram /!/ hey kind of a weird question,\n\ni recently took a photograph that i'm pretty happy with and was inspired by a particular photographer on instagram. this photographer doesn't have a massive following (about 13k) but i love their style none the less and wanted to show my appreciation for it.\n\nis it inappropriate to mention someone in the post by using something like \"@photographer\" inspired shot? \n\nor would is be more considerate to use a hashtag of their account instead? \n\ni just don't want to be annoying.\n\nany help is greatly appreciated.", "sortedWord": "None", "identifyer": 63113, "year": "2020"}, {"Unnamed: 0": 61901, "autor": "8636396", "date": 1587913460000, "content": "A couple years ago, a family member of mine gifted me one of his old SLR cameras. I havent touched it much since, but with all this free time now I think I'd like to order some film and give it a go, but I had a few questions first. /!/ It's an old Yashica L Electro X. Now, I'm aware that using these things isnt as easy as point and shoot (one of my ex's did photography in school, I tagged along for most of her photography expeditions). I have a vague understanding of different things to take into account (like exposure), but it's not like I took the class or anything.\n\nMostly what I planned on doing was setting everything to a neutral setting, then taking notes on what changes I made for each picture, then comparing them whenever I got the roll developed. Is this a reasonable approach? \n\nWhen I first received the camera, I took it into a camera shop to get it looked at, and the guy told me it had a light leak issue and would cost about $200 to fix. I declined, wasnt in my budget, but I did a little reading on lightleak and saw that it could be anywhere from a minor part of the film getting exposed or it could completely expose the film and ruin any chance of getting pictures at all. I still want to move forward with trying this, but it is just totally not worth it?\n\nLastly, can I just buy any old film on the internet? There are some multi packs on amazon going for about twenty five bucks and I was probably going to get one of those.\n\nI'm really just winging this out of boredom, not expecting any professional shots or anything. Just thought it'd be fun. After I post this I'm going to go check out the FAQ and the What I Wish I'd Known Megathreads. Thanks for reading!", "link": "https://www.reddit.com/r/photography/comments/g8ftrk/a_couple_years_ago_a_family_member_of_mine_gifted/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "a couple years ago, a family member of mine gifted me one of his old slr cameras. i havent touched it much since, but with all this free time now i think i'd like to order some film and give it a go, but i had a few questions first. /!/ it's an old yashica l electro x. now, i'm aware that using these things isnt as easy as point and shoot (one of my ex's did photography in school, i -----> tagged !!!  along for most of her photography expeditions). i have a vague understanding of different things to take into account (like exposure), but it's not like i took the class or anything.\n\nmostly what i planned on doing was setting everything to a neutral setting, then taking notes on what changes i made for each picture, then comparing them whenever i got the roll developed. is this a reasonable approach? \n\nwhen i first received the camera, i took it into a camera shop to get it looked at, and the guy told me it had a light leak issue and would cost about $200 to fix. i declined, wasnt in my budget, but i did a little reading on lightleak and saw that it could be anywhere from a minor part of the film getting exposed or it could completely expose the film and ruin any chance of getting pictures at all. i still want to move forward with trying this, but it is just totally not worth it?\n\nlastly, can i just buy any old film on the internet? there are some multi packs on amazon going for about twenty five bucks and i was probably going to get one of those.\n\ni'm really just winging this out of boredom, not expecting any professional shots or anything. just thought it'd be fun. after i post this i'm going to go check out the faq and the what i wish i'd known megathreads. thanks for reading!", "sortedWord": "None", "identifyer": 63411, "year": "2020"}, {"Unnamed: 0": 62117, "autor": "avrahta", "date": 1590235512000, "content": "One person posted about film photography tags for Instagram. Can anyone do something similar for digital photography as well please? /!/ I've been struggling with the same old tags since a long time, never to get noticed.\n\nI need all the good tags, unlike #photography #instagood and stuff. Please help! Thank you.", "link": "https://www.reddit.com/r/photography/comments/gp3shw/one_person_posted_about_film_photography_tags_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "one person posted about film photography -----> tags !!!  for instagram. can anyone do something similar for digital photography as well please? /!/ i've been struggling with the same old tags since a long time, never to get noticed.\n\ni need all the good tags, unlike #photography #instagood and stuff. please help! thank you.", "sortedWord": "None", "identifyer": 63631, "year": "2020"}, {"Unnamed: 0": 62656, "autor": "Diffrentiaali", "date": 1594908239000, "content": "Any good Ai photo organizers? /!/ Hello! I have tens of thousands of photos in my external hard drive and some of them in my PC. (win 10)  I realized that It's very huge job to find the one I am looking for.  \n   \nSo I figured out that to find the photo I am looking for, I would need to have some sort of an artificial intelligent tool that will tag all the photos automatically for me based on what's in the photo.   \n\n\nHowever, there is only few of those and I have no idea what would actually be good. I bet some of you have experiences of those, so please, if you can help me, it would be very helpful! :)", "link": "https://www.reddit.com/r/photography/comments/hsa7b3/any_good_ai_photo_organizers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "any good ai photo organizers? /!/ hello! i have tens of thousands of photos in my external hard drive and some of them in my pc. (win 10)  i realized that it's very huge job to find the one i am looking for.  \n   \nso i figured out that to find the photo i am looking for, i would need to have some sort of an artificial intelligent tool that will -----> tag !!!  all the photos automatically for me based on what's in the photo.   \n\n\nhowever, there is only few of those and i have no idea what would actually be good. i bet some of you have experiences of those, so please, if you can help me, it would be very helpful! :)", "sortedWord": "None", "identifyer": 64186, "year": "2020"}, {"Unnamed: 0": 62660, "autor": "cant_have_a_cat", "date": 1594905911000, "content": "What do you read? /!/ Hello, I'm trying to find quality reading material but it has been a real struggle. Everything is either filled with gear spam or lazy single paragraph articles with video attachments. \n\nI've made a whole feed from \"top\" by my rss reader (feedly) of #photography tag including: iso1200, photofocus, fstoppers etc. The only good recommendation I got and frequently visit is The Atlantic's photography category.\n\nWhere do you get quality text articles? Is there some paid source that's worth time in your opinion?", "link": "https://www.reddit.com/r/photography/comments/hs9lf5/what_do_you_read/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what do you read? /!/ hello, i'm trying to find quality reading material but it has been a real struggle. everything is either filled with gear spam or lazy single paragraph articles with video attachments. \n\ni've made a whole feed from \"top\" by my rss reader (feedly) of #photography -----> tag !!!  including: iso1200, photofocus, fstoppers etc. the only good recommendation i got and frequently visit is the atlantic's photography category.\n\nwhere do you get quality text articles? is there some paid source that's worth time in your opinion?", "sortedWord": "None", "identifyer": 64190, "year": "2020"}, {"Unnamed: 0": 62742, "autor": "aditya_patnaik_", "date": 1594196966000, "content": "A question /!/ Hey guys,\nSo I recently did pictures for a Go Kart track for a race event they had, I got my payment and everything. But another photographer was given the pictures clicked by me as the pictures are meant for everyone to use. That photographer has now started posting those pictures after slightly editing them. And now he is getting more jobs than me as they think that he clicked those pictures. When I asked him to give me credit he just tagged me once in the picture (along with 10 others) and no mention of me clicking them. He has a right to post the pictures, he got permission from the owner. But I've got a relatively small profile and the other guy is much bigger than me. What he is doing is legally right but ethically wrong I feel. That is the reason I'm afraid to ask him to give me proper credit. Now everyone thinks he clicked those pictures and is getting praise for it. I don't wanna seem like an attention seeker but everyone needs growth. I've been puzzled about this for a while. Any Suggestions?", "link": "https://www.reddit.com/r/photography/comments/hndca8/a_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "a question /!/ hey guys,\nso i recently did pictures for a go kart track for a race event they had, i got my payment and everything. but another photographer was given the pictures clicked by me as the pictures are meant for everyone to use. that photographer has now started posting those pictures after slightly editing them. and now he is getting more jobs than me as they think that he clicked those pictures. when i asked him to give me credit he just -----> tagged !!!  me once in the picture (along with 10 others) and no mention of me clicking them. he has a right to post the pictures, he got permission from the owner. but i've got a relatively small profile and the other guy is much bigger than me. what he is doing is legally right but ethically wrong i feel. that is the reason i'm afraid to ask him to give me proper credit. now everyone thinks he clicked those pictures and is getting praise for it. i don't wanna seem like an attention seeker but everyone needs growth. i've been puzzled about this for a while. any suggestions?", "sortedWord": "None", "identifyer": 64273, "year": "2020"}, {"Unnamed: 0": 62933, "autor": "mensur", "date": 1598057841000, "content": "1M follower insta used my photo without tag or permission /!/ My photo of a model with a pretty hair dye job. The 1m insta is hair based, they tagged only the stylist only. I would have been happy if they simply tagged the model and I too in the photo, all three of us commented asking to be tagged and they did not respond. Now I'm feeling dicky, do I send them a DMCA takedown? An invoice?  What are my options?", "link": "https://www.reddit.com/r/photography/comments/ie96yz/1m_follower_insta_used_my_photo_without_tag_or/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1m follower insta used my photo without -----> tag !!!  or permission /!/ my photo of a model with a pretty hair dye job. the 1m insta is hair based, they tagged only the stylist only. i would have been happy if they simply tagged the model and i too in the photo, all three of us commented asking to be tagged and they did not respond. now i'm feeling dicky, do i send them a dmca takedown? an invoice?  what are my options?", "sortedWord": "None", "identifyer": 64467, "year": "2020"}, {"Unnamed: 0": 62934, "autor": "mensur", "date": 1598057732000, "content": "1M follower insta used my photo with tag or permission /!/ My photo, of a model with a pretty hair dye job.  The 1m insta is hair based, they tagged only the stylist.  I would have been happy if they simply tagged the model and I in the photo, all three of us commented asking to be tagged and they did not respond.  Now I'm feeling dicky, do I send them a DMCA takedown?  An invoice?", "link": "https://www.reddit.com/r/photography/comments/ie961z/1m_follower_insta_used_my_photo_with_tag_or/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1m follower insta used my photo with -----> tag !!!  or permission /!/ my photo, of a model with a pretty hair dye job.  the 1m insta is hair based, they tagged only the stylist.  i would have been happy if they simply tagged the model and i in the photo, all three of us commented asking to be tagged and they did not respond.  now i'm feeling dicky, do i send them a dmca takedown?  an invoice?", "sortedWord": "None", "identifyer": 64468, "year": "2020"}, {"Unnamed: 0": 62978, "autor": "securitywyrm", "date": 1598940203000, "content": "Question about creating a unique photography rig /!/ Greetings! I'm looking to get back into photography as a hobby, particularly at comic and anime conventions. What I want to create is a system where I can take some pictures of a person, push a button, and print out a label with a URL of where that batch of photos will be uploaded.\n\nI know how to do this in Microsoft Access with visual basic, but that's not exactly a 'stable platform.' I'm hoping that there's some image management programs out there with powerful enough macros and features to do the following sequence\n\n1. I take a bunch of photos\n2. I push 'the button,' probably a usb number pad.\n3. The system takes all pictures taken since the last time 'the button' was pushed and puts them into a new sequential folder, like 234654.\n4. The label printer prints a tag of \"Your (count of files) pictures will be available (tomorrow's date) at website/FolderNumber.\"\n5. When I get home, I FTP upload all the folders to the site. \n\nThis would allow me to freely roam a convention, taking pictures and handing people a card with where they can get them the next day, ensuring no interruption in the fun. I'm not looking to do \"high art professional\" photography; it just has to be better than a selfie thanks to a good camera and properly bounced/softened flash.\n\nAny suggestions on where I should start looking? My total budget is $2000.", "link": "https://www.reddit.com/r/photography/comments/ikeyi3/question_about_creating_a_unique_photography_rig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "question about creating a unique photography rig /!/ greetings! i'm looking to get back into photography as a hobby, particularly at comic and anime conventions. what i want to create is a system where i can take some pictures of a person, push a button, and print out a label with a url of where that batch of photos will be uploaded.\n\ni know how to do this in microsoft access with visual basic, but that's not exactly a 'stable platform.' i'm hoping that there's some image management programs out there with powerful enough macros and features to do the following sequence\n\n1. i take a bunch of photos\n2. i push 'the button,' probably a usb number pad.\n3. the system takes all pictures taken since the last time 'the button' was pushed and puts them into a new sequential folder, like 234654.\n4. the label printer prints a -----> tag !!!  of \"your (count of files) pictures will be available (tomorrow's date) at website/foldernumber.\"\n5. when i get home, i ftp upload all the folders to the site. \n\nthis would allow me to freely roam a convention, taking pictures and handing people a card with where they can get them the next day, ensuring no interruption in the fun. i'm not looking to do \"high art professional\" photography; it just has to be better than a selfie thanks to a good camera and properly bounced/softened flash.\n\nany suggestions on where i should start looking? my total budget is $2000.", "sortedWord": "None", "identifyer": 64514, "year": "2020"}, {"Unnamed: 0": 63889, "autor": "anaoceanus", "date": 1607564087000, "content": "How do I increase my following on my photography page? (Need tips) /!/ I was just wondering what some people did to increase their following on their photography pages (instagram) and how long it took? I mean I just started relatively not long ago and I was on hiatus for a while (school) but I’ve been trying to add tags and stuff but idk. Looking for advice", "link": "https://www.reddit.com/r/photography/comments/ka5lug/how_do_i_increase_my_following_on_my_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "how do i increase my following on my photography page? (need tips) /!/ i was just wondering what some people did to increase their following on their photography pages (instagram) and how long it took? i mean i just started relatively not long ago and i was on hiatus for a while (school) but i’ve been trying to add -----> tags !!!  and stuff but idk. looking for advice", "sortedWord": "None", "identifyer": 65452, "year": "2020"}, {"Unnamed: 0": 64774, "autor": "Nicolello_iiiii", "date": 1581964029000, "content": "Sorry for the low quality but I didn't have enough time to take the microscope. This is interesting because I didn't thought ladybugs had such little feets and a head like that. Shot on a Huawei nova 5t with the 12MP 2x optical zoom and a 4€ 60x macro zoom lenses. If you take this please tag me", "link": "https://www.reddit.com/r/photography/comments/f5d42z/sorry_for_the_low_quality_but_i_didnt_have_enough/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sorry for the low quality but i didn't have enough time to take the microscope. this is interesting because i didn't thought ladybugs had such little feets and a head like that. shot on a huawei nova 5t with the 12mp 2x optical zoom and a 4€ 60x macro zoom lenses. if you take this please -----> tag !!!  me", "sortedWord": "None", "identifyer": 66359, "year": "2020"}, {"Unnamed: 0": 65005, "autor": "AnnieRipley89", "date": 1582705313000, "content": "Do you add the signature to your photos? /!/ I thought about adding the signature first when my photo was taken by a local internet community and people were asking about the photographer. Now my friend who is also a photographer started to add his signature because he is never tagged when his photos are posted by the models and he wants people to recognize his works. Do you feel the same?", "link": "https://www.reddit.com/r/photography/comments/f9q58g/do_you_add_the_signature_to_your_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "do you add the signature to your photos? /!/ i thought about adding the signature first when my photo was taken by a local internet community and people were asking about the photographer. now my friend who is also a photographer started to add his signature because he is never -----> tagged !!!  when his photos are posted by the models and he wants people to recognize his works. do you feel the same?", "sortedWord": "None", "identifyer": 66599, "year": "2020"}, {"Unnamed: 0": 65379, "autor": "SirMrBlacklist", "date": 1584343276000, "content": "Best way to preview photos on a mac? /!/ Camera: Sony A7iii\n\nAnyone know good ways to preview photos on a mac when plugging in the memory card? Memory card contains RAW and JPEG and I wanna check the JPEGs and then tag the raw ones of the JPEGS (they have the same name)  I like so I can edit those raws (The JPEG is just for preview). Usually I change to gallery view and then sort the photos by extension, then find the first jpeg and use arrow keys to move right. If I find one I like, I tag it and then continue. After I sort by name again and then tag the raws next to the JPEGs that were tagged.  \n\n\n&amp;#x200B;\n\nAnyone have a better solution where I can view the RAWS and JPEGS without taking it so long for finder to render the RAW?", "link": "https://www.reddit.com/r/photography/comments/fjgzxl/best_way_to_preview_photos_on_a_mac/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best way to preview photos on a mac? /!/ camera: sony a7iii\n\nanyone know good ways to preview photos on a mac when plugging in the memory card? memory card contains raw and jpeg and i wanna check the jpegs and then -----> tag !!!  the raw ones of the jpegs (they have the same name)  i like so i can edit those raws (the jpeg is just for preview). usually i change to gallery view and then sort the photos by extension, then find the first jpeg and use arrow keys to move right. if i find one i like, i tag it and then continue. after i sort by name again and then tag the raws next to the jpegs that were tagged.  \n\n\n&amp;#x200b;\n\nanyone have a better solution where i can view the raws and jpegs without taking it so long for finder to render the raw?", "sortedWord": "None", "identifyer": 66989, "year": "2020"}, {"Unnamed: 0": 65404, "autor": "estella_acapella", "date": 1584733552000, "content": "I may have misunderstood the Fair Use doctrine, and am now in a bit of trouble. /!/ Until recently, I ran an Instagram blog where I (mostly) edited and reposted other people's photos, always with credit, and wherever possible a link to the original, in addition to tagging the copyright owner and including their name in the post's hashtags. Latterly, after being contacted by a photographer (who was fine with me using their work, but informed me of something I was entirely unaware of), I added the disclaimer that all photos were edited by me. \n\nI believed I could do this under the Fair Use law, because I had seen countless other people do it with impunity, but I've recently been informed that this may not be the case. Furthermore, I appreciate how stupid this may sound, but I was entirely unaware how my actions could potentially damage photographers' reputations. I believed it self evident that my reposts were edited.  Please understand I am very sorry for these mistakes, and that it was never my intention to harm anyone. \n\nI have since deleted all but my original posts on the blog, ceased posting altogether, and have apologized profusely to the parties involved. However, some are not very forgiving. Ignorance may not be an excuse, but my mistakes were innocent. Had I been aware that I was doing something wrong, and potentially losing people business, I would not have reposted any edited image without express consent. \n\nIs there anything I can do to rectify matters, save for deleting the blog? Is it possible for me to be sued retrospectively, despite having deleted the unauthorized reposts?", "link": "https://www.reddit.com/r/photography/comments/fm1dmi/i_may_have_misunderstood_the_fair_use_doctrine/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "i may have misunderstood the fair use doctrine, and am now in a bit of trouble. /!/ until recently, i ran an instagram blog where i (mostly) edited and reposted other people's photos, always with credit, and wherever possible a link to the original, in addition to -----> tagging !!!  the copyright owner and including their name in the post's hashtags. latterly, after being contacted by a photographer (who was fine with me using their work, but informed me of something i was entirely unaware of), i added the disclaimer that all photos were edited by me. \n\ni believed i could do this under the fair use law, because i had seen countless other people do it with impunity, but i've recently been informed that this may not be the case. furthermore, i appreciate how stupid this may sound, but i was entirely unaware how my actions could potentially damage photographers' reputations. i believed it self evident that my reposts were edited.  please understand i am very sorry for these mistakes, and that it was never my intention to harm anyone. \n\ni have since deleted all but my original posts on the blog, ceased posting altogether, and have apologized profusely to the parties involved. however, some are not very forgiving. ignorance may not be an excuse, but my mistakes were innocent. had i been aware that i was doing something wrong, and potentially losing people business, i would not have reposted any edited image without express consent. \n\nis there anything i can do to rectify matters, save for deleting the blog? is it possible for me to be sued retrospectively, despite having deleted the unauthorized reposts?", "sortedWord": "None", "identifyer": 67014, "year": "2020"}, {"Unnamed: 0": 65545, "autor": "anpanmant", "date": 1585125113000, "content": "Is there any cloud storage that can auto-tag photos based on an excel (vlookup file name and add tags)? /!/ Hi all,\n\nI am currently looking for cloud storage/software that can allows me to achieve the following:\n\nI have lots of photos of a miniature car collections and I would like to import them somewhere to organize. Is there any way to upload photos and at the same time automatically create tags to them based on its file name? For example, let say I have an excel like below where there are 4 columns. 1st column is file name and the remaining columns are just different tags.\n\nA.jpg &lt;Nissan&gt; &lt;2011&gt; &lt;Altima&gt;\n\nB.jpg &lt;Nissan&gt; &lt;1997&gt; &lt;GTR&gt;\n\nI have over thousands of photos of them and thought maybe there is a quicker way to create tags instead of doing it manually. Any insights would be helpful!", "link": "https://www.reddit.com/r/photography/comments/fomtpd/is_there_any_cloud_storage_that_can_autotag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there any cloud storage that can auto------> tag !!!  photos based on an excel (vlookup file name and add tags)? /!/ hi all,\n\ni am currently looking for cloud storage/software that can allows me to achieve the following:\n\ni have lots of photos of a miniature car collections and i would like to import them somewhere to organize. is there any way to upload photos and at the same time automatically create tags to them based on its file name? for example, let say i have an excel like below where there are 4 columns. 1st column is file name and the remaining columns are just different tags.\n\na.jpg &lt;nissan&gt; &lt;2011&gt; &lt;altima&gt;\n\nb.jpg &lt;nissan&gt; &lt;1997&gt; &lt;gtr&gt;\n\ni have over thousands of photos of them and thought maybe there is a quicker way to create tags instead of doing it manually. any insights would be helpful!", "sortedWord": "None", "identifyer": 67158, "year": "2020"}, {"Unnamed: 0": 66079, "autor": "benky911", "date": 1578046472000, "content": "Best way to organize photos, face detection, tags /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ejdjli/best_way_to_organize_photos_face_detection_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "best way to organize photos, face detection, -----> tags !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 67708, "year": "2020"}, {"Unnamed: 0": 66838, "autor": "symmetrygear", "date": 1580644920000, "content": "Does Adobe Spark Graphics source images from Unsplash? /!/ I was tagged earlier in a post which featured one of my images, one I'd offered for free through unsplash. I got in touch with them just to make sure that was how they found it, and they surprised me by telling me it had been included in some Adobe Sparks package, which is a paid product.\n\nI was wondering whether anyone knows if Adobe is able to include free graphics and images in their paid products, and what my best course of action would be?\n\nThanks!\nS", "link": "https://www.reddit.com/r/photography/comments/exnhgo/does_adobe_spark_graphics_source_images_from/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "does adobe spark graphics source images from unsplash? /!/ i was -----> tagged !!!  earlier in a post which featured one of my images, one i'd offered for free through unsplash. i got in touch with them just to make sure that was how they found it, and they surprised me by telling me it had been included in some adobe sparks package, which is a paid product.\n\ni was wondering whether anyone knows if adobe is able to include free graphics and images in their paid products, and what my best course of action would be?\n\nthanks!\ns", "sortedWord": "None", "identifyer": 68489, "year": "2020"}, {"Unnamed: 0": 67541, "autor": "colornize", "date": 1590151969000, "content": "Share any colorful photo. Tag us or send it to shine@colornize.com. We can also feature it on our website. Have a colorful day! :)", "link": "https://www.reddit.com/r/photography/comments/goisqy/share_any_colorful_photo_tag_us_or_send_it_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "share any colorful photo. -----> tag !!!  us or send it to shine@colornize.com. we can also feature it on our website. have a colorful day! :)", "sortedWord": "None", "identifyer": 69215, "year": "2020"}, {"Unnamed: 0": 68473, "autor": "Suvip", "date": 1594840694000, "content": "What “photographers” are misunderstanding and toxic community /!/ Hi,\n\nSorry for the (very) long post.\n\nTo not lose anyone’s time, the purpose of this thread is to have a discussion about current photography community, problematics and flame wars (hardware), as well as point out some toxic behaviors while (trying to) be as impartial as possible, hopefully would lead to a nice discussion by listening to (respectful) opposing views from new angle.\n\nNow that the purpose is explained, if you’re still reading, a bit about myself: Enthusiast photographer from Japan, have been shooting since kid, for nearly 35 years, did some paid gigs but try to keep it as my main hobby.\nI organize couple large communities of photography “walks”, where we lead Japanese and foreigners alike for walks in/around Tokyo and surrounding, day or night, to share the love of photography, events and socializing, regardless if one is a pro or a complete amateur with just a smartphone.\n\nThese communities are excellent for people to socialize, and also talk/teach each other’s about techniques and evolve together.\n\nI’ve been lurking here for years, but never posted here or any western community. One main reason is, sadly, that photography communities get really toxic. Especially during specs talks, when those who consider cameras as just a pure “still” photography tool, and look down upon people who want “gimmicks” like videos. Or towards “*less worthy*” smartphones snappers.\n\nIt’s understandable to have this behavior in a videogame forum, because of the age range, But IMO, older photographers should behave more respectfully and welcome anyone to enjoy the “art” of photography, including advances and change in usage and new trends.\n\nIMO, a person “snapping” tons of photos on their phone doesn’t mean they don’t have a genuine love for photography, and that some of their shots aren’t taken with great care and love that any photographer would do.\n\nSo instead of shunning them, why not be more welcoming and teaching techniques. After all, the known mantra is “gear doesn’t matter”, no?\n\n.\n\nAnyway, I am using the recent announce of the Canon R5/6, with some arguments that I see repeated every camera generation in the past years, to provide some counter arguments:\n\n1. “**I don’t use X feature, so no one should need it**”\n\nWhen people complain about the lack of a certain feature, it means the camera isn’t good enough to answer for their needs, as in, it won’t sell as good.\n\nIf sales are low, companies have less money to invest in next versions and enhance their R&amp;D, leading to outdated specs, or the company going bankrupt completely (here in Japan, most old companies and camera shops completely disappeared, even Canon/Nikon are in the red, and rumored to not withstand couple other years before leaving the photo business and focus on other fields like the medical one).\n\nSo please, be open minded that other people’s needs, that if answered, not only won’t harm you, but would make everyone happy when sales follow.\n\n2. “**Who needs video? This is a still camera**”\n\nThis comes back often. And the answer is simple: Since smartphones came to the market, DSLR lost more than 86% of their market (2009~2019), while compacts lost nearly 90%. Meanwhile, the smartphones audience increased tremendously, with the feature number one being the camera in both photo and video mode. At the same time, vLogging and photos/videos apps exploded in popularity. We’ve even seen a new market for action cameras.\n\nSo, I guess there are people who need videos, and, outside of those choosing low budget phones, they might have been on DSLR if companies understood user needs and did better marketing.\n\n3. “**4K uncropped/8K/better codecs/etc.?, A camera is made for stills, buy the cinema version if you want better videos**”\n\nI understand that for some people just being able to shoot photos is enough, the same as for some people phones should just be able to do call. But times change, technology advances and people’s need evolve.\n\nFirst, the audience for a non-studio, professional video camera is extremely small. It’s too expensive for even serious enthusiasts, and it’s too underwhelming for large studios who need a support for all the production pipeline.\n\nSo it doesn’t make sense to “protect” a small audience cinema line by making a potentially larger selling camera unattractive.\n\nSecond, we shouldn’t ignore the market these cameras are competing in: for years, almost all sub 500$ smartphones shoot stabilized 4K 60p in HDR without any major problem, while taking excellent photos, especially when we include the new **computational photography** to enhance quality, resolution and even some effects (portrait modes, etc).\n\nWe also have the new action cameras, that for 500$ish price tag offer video capture in 360° stabilized 4K+ at high framerate and extreme weather.\n\nSo, when we have a new generation of flagship DSLR, lasting few years before the next upgrade, that’s over 3000$ body only ... people are (IMHO) entitled to at least criticize the lack of these, especially for a device that does only photos/videos, and that should be future proof as people aren’t changing cameras yearly.\n\n4. “**Bluetooth, GPS, etc. are just gimmicks, no use to be present on a camera**”\n\nAgain, if we see the market the cameras are competing against, smartphones offer the extreme high advantage of **connectivity**, and being able to edit photos and share them **instantly** with everyone (over the internet, or just wirelessly in a social setting).\n\nCameras, while they’re maybe not ergonomic to embed, say, an Android OS, with apps on camera. They should at least have enough connectivity to share quickly with multiple devices.\n\nJust looking at action cameras, power banks, people with multiple phones, etc. some people would be willing to transport multiple devices, even buying a cheaper phone and a good camera if the workflow was better.\n\n.\n\nThese are the major points I wanted to address without my post becoming a rant article. Please share your thoughts.\n\nTo summarize, the points of view I’d like some people to consider are:\n\n- Don’t forget the market the cameras are competing against when you see rants. If the price tag is multiple times other platforms, specs should follow or even be better.\n\n- Other users aren’t the enemy. In fact, if more people are satisfied and come back to the camera market, it will survive and thrive. Else, it will be doomed and disappear soon.\n\n- Let’s not berate and demean people who don’t use specific gear by classifying them as less worthy. All the younger generation starts with smartphones nowadays, and they’ll move to cameras when they reach the limit of their gear. But they’ll be alienated if faced with toxicity and demeaning.\n\nThank you for reading, and sorry for the long text.", "link": "https://www.reddit.com/r/photography/comments/hru0y5/what_photographers_are_misunderstanding_and_toxic/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what “photographers” are misunderstanding and toxic community /!/ hi,\n\nsorry for the (very) long post.\n\nto not lose anyone’s time, the purpose of this thread is to have a discussion about current photography community, problematics and flame wars (hardware), as well as point out some toxic behaviors while (trying to) be as impartial as possible, hopefully would lead to a nice discussion by listening to (respectful) opposing views from new angle.\n\nnow that the purpose is explained, if you’re still reading, a bit about myself: enthusiast photographer from japan, have been shooting since kid, for nearly 35 years, did some paid gigs but try to keep it as my main hobby.\ni organize couple large communities of photography “walks”, where we lead japanese and foreigners alike for walks in/around tokyo and surrounding, day or night, to share the love of photography, events and socializing, regardless if one is a pro or a complete amateur with just a smartphone.\n\nthese communities are excellent for people to socialize, and also talk/teach each other’s about techniques and evolve together.\n\ni’ve been lurking here for years, but never posted here or any western community. one main reason is, sadly, that photography communities get really toxic. especially during specs talks, when those who consider cameras as just a pure “still” photography tool, and look down upon people who want “gimmicks” like videos. or towards “*less worthy*” smartphones snappers.\n\nit’s understandable to have this behavior in a videogame forum, because of the age range, but imo, older photographers should behave more respectfully and welcome anyone to enjoy the “art” of photography, including advances and change in usage and new trends.\n\nimo, a person “snapping” tons of photos on their phone doesn’t mean they don’t have a genuine love for photography, and that some of their shots aren’t taken with great care and love that any photographer would do.\n\nso instead of shunning them, why not be more welcoming and teaching techniques. after all, the known mantra is “gear doesn’t matter”, no?\n\n.\n\nanyway, i am using the recent announce of the canon r5/6, with some arguments that i see repeated every camera generation in the past years, to provide some counter arguments:\n\n1. “**i don’t use x feature, so no one should need it**”\n\nwhen people complain about the lack of a certain feature, it means the camera isn’t good enough to answer for their needs, as in, it won’t sell as good.\n\nif sales are low, companies have less money to invest in next versions and enhance their r&amp;d, leading to outdated specs, or the company going bankrupt completely (here in japan, most old companies and camera shops completely disappeared, even canon/nikon are in the red, and rumored to not withstand couple other years before leaving the photo business and focus on other fields like the medical one).\n\nso please, be open minded that other people’s needs, that if answered, not only won’t harm you, but would make everyone happy when sales follow.\n\n2. “**who needs video? this is a still camera**”\n\nthis comes back often. and the answer is simple: since smartphones came to the market, dslr lost more than 86% of their market (2009~2019), while compacts lost nearly 90%. meanwhile, the smartphones audience increased tremendously, with the feature number one being the camera in both photo and video mode. at the same time, vlogging and photos/videos apps exploded in popularity. we’ve even seen a new market for action cameras.\n\nso, i guess there are people who need videos, and, outside of those choosing low budget phones, they might have been on dslr if companies understood user needs and did better marketing.\n\n3. “**4k uncropped/8k/better codecs/etc.?, a camera is made for stills, buy the cinema version if you want better videos**”\n\ni understand that for some people just being able to shoot photos is enough, the same as for some people phones should just be able to do call. but times change, technology advances and people’s need evolve.\n\nfirst, the audience for a non-studio, professional video camera is extremely small. it’s too expensive for even serious enthusiasts, and it’s too underwhelming for large studios who need a support for all the production pipeline.\n\nso it doesn’t make sense to “protect” a small audience cinema line by making a potentially larger selling camera unattractive.\n\nsecond, we shouldn’t ignore the market these cameras are competing in: for years, almost all sub 500$ smartphones shoot stabilized 4k 60p in hdr without any major problem, while taking excellent photos, especially when we include the new **computational photography** to enhance quality, resolution and even some effects (portrait modes, etc).\n\nwe also have the new action cameras, that for 500$ish price -----> tag !!!  offer video capture in 360° stabilized 4k+ at high framerate and extreme weather.\n\nso, when we have a new generation of flagship dslr, lasting few years before the next upgrade, that’s over 3000$ body only ... people are (imho) entitled to at least criticize the lack of these, especially for a device that does only photos/videos, and that should be future proof as people aren’t changing cameras yearly.\n\n4. “**bluetooth, gps, etc. are just gimmicks, no use to be present on a camera**”\n\nagain, if we see the market the cameras are competing against, smartphones offer the extreme high advantage of **connectivity**, and being able to edit photos and share them **instantly** with everyone (over the internet, or just wirelessly in a social setting).\n\ncameras, while they’re maybe not ergonomic to embed, say, an android os, with apps on camera. they should at least have enough connectivity to share quickly with multiple devices.\n\njust looking at action cameras, power banks, people with multiple phones, etc. some people would be willing to transport multiple devices, even buying a cheaper phone and a good camera if the workflow was better.\n\n.\n\nthese are the major points i wanted to address without my post becoming a rant article. please share your thoughts.\n\nto summarize, the points of view i’d like some people to consider are:\n\n- don’t forget the market the cameras are competing against when you see rants. if the price tag is multiple times other platforms, specs should follow or even be better.\n\n- other users aren’t the enemy. in fact, if more people are satisfied and come back to the camera market, it will survive and thrive. else, it will be doomed and disappear soon.\n\n- let’s not berate and demean people who don’t use specific gear by classifying them as less worthy. all the younger generation starts with smartphones nowadays, and they’ll move to cameras when they reach the limit of their gear. but they’ll be alienated if faced with toxicity and demeaning.\n\nthank you for reading, and sorry for the long text.", "sortedWord": "None", "identifyer": 70171, "year": "2020"}, {"Unnamed: 0": 69046, "autor": "ThatsYourHomeBall", "date": 1594112421000, "content": "Is there anything as good as Google Photos Facial Recognition AI to replace it with? /!/ I use google photos a lot for the facial recognition feature and other AI features of automatically recognising photo types.\n\n&amp;#x200B;\n\nIs there anything as good i can replace it with? It needs to be online ideally so I can see my photos from anywhere and i know they are backed up\n\n&amp;#x200B;\n\nSo i want to tag someone's face then click on a picture of that persons face and it bring up all the photos of the person.\n\n  \nAny help appreciated please!", "link": "https://www.reddit.com/r/photography/comments/hmr19g/is_there_anything_as_good_as_google_photos_facial/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there anything as good as google photos facial recognition ai to replace it with? /!/ i use google photos a lot for the facial recognition feature and other ai features of automatically recognising photo types.\n\n&amp;#x200b;\n\nis there anything as good i can replace it with? it needs to be online ideally so i can see my photos from anywhere and i know they are backed up\n\n&amp;#x200b;\n\nso i want to -----> tag !!!  someone's face then click on a picture of that persons face and it bring up all the photos of the person.\n\n  \nany help appreciated please!", "sortedWord": "None", "identifyer": 70764, "year": "2020"}, {"Unnamed: 0": 69339, "autor": "HumidToku", "date": 1598793871000, "content": "What’s Everyone’s Opinion on Watermarks? /!/ \nPersonally I hate them and find them unnecessary 99.9% of the time. I tend to see good photos ruined by a large and invasive watermark or less polished photos that don’t have any business needing a watermark having them. Previews for clients are the only time I can see watermarks being necessary\n\n1. If someone wanted to get rid of your generic cursive watermark to steal your photo they could easily photoshop most of them out.\n\n2. If you are afraid people won’t find your work you can ask clients to give you credit (I usually make it a requirement I’m tagged in the photo and am mentioned in the first sentence of any caption. I am a portrait and event photographer btw)\n\nThrow those opinions at me. I’m pretty curious how other people feel about it.", "link": "https://www.reddit.com/r/photography/comments/ijcmhn/whats_everyones_opinion_on_watermarks/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "what’s everyone’s opinion on watermarks? /!/ \npersonally i hate them and find them unnecessary 99.9% of the time. i tend to see good photos ruined by a large and invasive watermark or less polished photos that don’t have any business needing a watermark having them. previews for clients are the only time i can see watermarks being necessary\n\n1. if someone wanted to get rid of your generic cursive watermark to steal your photo they could easily photoshop most of them out.\n\n2. if you are afraid people won’t find your work you can ask clients to give you credit (i usually make it a requirement i’m -----> tagged !!!  in the photo and am mentioned in the first sentence of any caption. i am a portrait and event photographer btw)\n\nthrow those opinions at me. i’m pretty curious how other people feel about it.", "sortedWord": "None", "identifyer": 71065, "year": "2020"}, {"Unnamed: 0": 69748, "autor": "[deleted]", "date": 1600049760000, "content": "I need help taking the blur from the badge and name tag. I need to know who this really is so that I can contact him and let him know someone is trying to impersonate him. Someone please help me /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/isbz60/i_need_help_taking_the_blur_from_the_badge_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i need help taking the blur from the badge and name -----> tag !!! . i need to know who this really is so that i can contact him and let him know someone is trying to impersonate him. someone please help me /!/ [deleted]", "sortedWord": "None", "identifyer": 71488, "year": "2020"}, {"Unnamed: 0": 70228, "autor": "This_Is_The_End", "date": 1596011948000, "content": "Using Darktable to develop Nikon Z7 raw images stored on a NAS with 10gb network /!/ This is a relative short documentation on the search whether to use Capture One or Darktable on NAS stored raw images of a Z7\n\nThe question of using Capture One or using Darktable is not that easy since both software packages have focus on different features and are both are using a database. \n\n### 1. Databases\n\nI don't like databases in such software very much, when they are storing the results of the workflow and can be corrupted. RawTherapy is based on sidecar files, which I prefer. Anyway, Capture One and Darktable are based on file based databases. When someone wants to store raw images and the results on a NAS, he has to live with it. \n\nPart of the idea for my project was to store the database file on the NAS, which isn't that easy. \n\n### 2. Speed comparison while working on an image\n\nBoth software packages are using OpenCL so that graphics card are accelerating the processing. I have two NVidia 1080ti in my system. My guess is, neither Darktable nor Capture One is using both of them. \n\nI don't care that much about the processing time when exporting images for presentation, but I care about the processing speed when working on images. \n\nHere was Darktable the clear winner. The images of the Z7 with uncompressed pixel data are quite large and it took Capture One 1s-3s before the image became visible again after a zoom or a new processing step. Darktable need less than one second. My guess is something between 0.2s to 0.5s\n\nThe import of images in Darktable is faster as well, but this not of importance to me. \n\nThe result is dependent on OpenCL and I didn't care about CPU only processing. \n\n### 3. Processing\n\nDarktable is basically made for a workflow without any presets. My settings give an initially flat image. Capture One puts out an saturated image when loading the image the first time. \n\nCapture One's  processing tools are easy to use and focused on color manipulation and there are no doubts, it makes a fast workflow possible. Darktable's features are more focused on a lot of professional tools which are partially redundant, to suit the needs of different photographers. The Filmic tool to compress dynamics of an image for web or print is really great. Darktable has it all, but demands a lot of work to get used to the masses of tools. The results are comparable, but Capture One is clearly easier to handle in the first days. \n\n### 4. Masking\n\nHere is where Darktable is glorious. While Capture one is based on a pixel based mask, Darktable is offering parametric and drawn masks for channels. A parametric mask makes it much easier to get a good mask for sky or water in just seconds. \n\nWhile Capture One is offering layers to combine various masks, Darktable is working with tool instances, which means a tool like Contrast has to be instantiated by clicking a button and then used with a new mask.  In the history the new instantiated tool becomes a new name. Both layering workflows are quite comparable. \n\nBoth software packages have blending modifiers. \n\n### 5. Denoising\n\nCapture One denoising tool is similar to that of Lightroom. It's easy to use. When wrong used halos or washed out details are included. \n\nThe same can be said about Darktable, but Darktable has profiled denoising (camera dependent denoising) which delivers almost perfect results with out changing too much. Halos or washed out details are not that easy to achieve. I prefer Darktables denoising. \n\n### 6. Lens correction\n\nThose who are buying brand new lenses can't use Darktable or they have to provide images for the developement of lens parameters in the lensfun library. It takes up to 1 one year before a lens is arriving in Darktable via lenfun. I don't have the buildings to provide such images and had to wait over 6 months before the 24mm-70mm/2.8 Z mount lens arrived in Darktable. \n\nOther than that, the lens correction is working very well, even with older lenses like the 180mm/2.8 F mount lens, with a lot of chromatic aberations. \n\n### 7. Storing Workflow Parameters\n\nDarktable as well as Capture One is storing history in a database as well in a sidecar file, which is quite important in the case the database is getting lost. Both software packages store the database in a more ore less hidden space.\n\n### 8. Tagging\n\nDarktable is providing hierarchical tagging. So it's possible to tag an image with Location-&gt;City-&gt;London. \n\n### 9. Choice\n\nMy favorite became Darktable because of the processing speed in the workflow. Here is Capture One in a disadvantage.\n\n### 10. Storing images on a NAS\n\nI build myself a NAS (64GB ram, Ryzen CPU) with a ZFS Z2 raid and 10Gb Ethernet network on the base of Open Media Vault, which is based on Debian. My choice for such a solution was driven by being able to run docker containers with load. Since I'm used to work with Debian systems, I don't wanted FreeNas which is BSD based. \n\nThe used database engine is SQLITE, which is on the network quite dependent on the used file system. Using the usual SMB (Windows) based file sharing isn't working well over network for the database. I had to use NFS. Open Media Vault makes it quite easy configure shares. I moved images as well as the database to the NAS and replaced the files and directories with softlinks pointing to the NAS. This allows to change the NAS while the stored paths in the database are remaining the same. \n\nAnother way to solve the problem of changing paths to an image directory is simply to change a row in the database, with a Firefox addon. It was my solution to adapt to a changed image directory. \n\nThe raid system is a lot faster than a SATA SSD with 600mb/s and even the access of the database on the NAS doesn't delay the system. Importing images is faster than ever. I need for the import of of 30 images on the light table not more than 1s. \n\nMy UPS was connected to the NAS . In the case of a power outage  the system is powering down automatically. \n\n### 11. Caveats\n\n- I'm using Linux on my personal PC because it's faster. But using Windows shouldn't be a problem as well. But in any case mounting the shares of the NAS statically into the PC can be a challenge for some. \n\n- A NAS is not a backup and backup is expensive\n\n- A UPS is needed otherwise ZFS is going to be destroyed when a power outage occurs. \n\n- My case for the NAS is not that good. There is nothing on the market supporting cooling of hard disks with low noise fans. I had to close ventilation holes with tape to force air over the hard disks. If you have a special room for a noisy server get one from EBay. The 8 hard disks are producing more than 100W of heat, which is quite a heating source for my room. \n\n### 12. Conclusion \n\nI'm quite satisfied with the solution especially Darktable. The speed is fantastic. I've never experience such a fast system before. \n\nA substitution of the NAS with a NVME SSD is possible, but image data hase to be stored somewhere and I produced this summer over 150GB of raw image data. The NVME solution is not cheaper. \n\nA graphics card with 6GB RAM should be sufficient to accelerate Darktable.", "link": "https://www.reddit.com/r/photography/comments/hzx51b/using_darktable_to_develop_nikon_z7_raw_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "using darktable to develop nikon z7 raw images stored on a nas with 10gb network /!/ this is a relative short documentation on the search whether to use capture one or darktable on nas stored raw images of a z7\n\nthe question of using capture one or using darktable is not that easy since both software packages have focus on different features and are both are using a database. \n\n### 1. databases\n\ni don't like databases in such software very much, when they are storing the results of the workflow and can be corrupted. rawtherapy is based on sidecar files, which i prefer. anyway, capture one and darktable are based on file based databases. when someone wants to store raw images and the results on a nas, he has to live with it. \n\npart of the idea for my project was to store the database file on the nas, which isn't that easy. \n\n### 2. speed comparison while working on an image\n\nboth software packages are using opencl so that graphics card are accelerating the processing. i have two nvidia 1080ti in my system. my guess is, neither darktable nor capture one is using both of them. \n\ni don't care that much about the processing time when exporting images for presentation, but i care about the processing speed when working on images. \n\nhere was darktable the clear winner. the images of the z7 with uncompressed pixel data are quite large and it took capture one 1s-3s before the image became visible again after a zoom or a new processing step. darktable need less than one second. my guess is something between 0.2s to 0.5s\n\nthe import of images in darktable is faster as well, but this not of importance to me. \n\nthe result is dependent on opencl and i didn't care about cpu only processing. \n\n### 3. processing\n\ndarktable is basically made for a workflow without any presets. my settings give an initially flat image. capture one puts out an saturated image when loading the image the first time. \n\ncapture one's  processing tools are easy to use and focused on color manipulation and there are no doubts, it makes a fast workflow possible. darktable's features are more focused on a lot of professional tools which are partially redundant, to suit the needs of different photographers. the filmic tool to compress dynamics of an image for web or print is really great. darktable has it all, but demands a lot of work to get used to the masses of tools. the results are comparable, but capture one is clearly easier to handle in the first days. \n\n### 4. masking\n\nhere is where darktable is glorious. while capture one is based on a pixel based mask, darktable is offering parametric and drawn masks for channels. a parametric mask makes it much easier to get a good mask for sky or water in just seconds. \n\nwhile capture one is offering layers to combine various masks, darktable is working with tool instances, which means a tool like contrast has to be instantiated by clicking a button and then used with a new mask.  in the history the new instantiated tool becomes a new name. both layering workflows are quite comparable. \n\nboth software packages have blending modifiers. \n\n### 5. denoising\n\ncapture one denoising tool is similar to that of lightroom. it's easy to use. when wrong used halos or washed out details are included. \n\nthe same can be said about darktable, but darktable has profiled denoising (camera dependent denoising) which delivers almost perfect results with out changing too much. halos or washed out details are not that easy to achieve. i prefer darktables denoising. \n\n### 6. lens correction\n\nthose who are buying brand new lenses can't use darktable or they have to provide images for the developement of lens parameters in the lensfun library. it takes up to 1 one year before a lens is arriving in darktable via lenfun. i don't have the buildings to provide such images and had to wait over 6 months before the 24mm-70mm/2.8 z mount lens arrived in darktable. \n\nother than that, the lens correction is working very well, even with older lenses like the 180mm/2.8 f mount lens, with a lot of chromatic aberations. \n\n### 7. storing workflow parameters\n\ndarktable as well as capture one is storing history in a database as well in a sidecar file, which is quite important in the case the database is getting lost. both software packages store the database in a more ore less hidden space.\n\n### 8. -----> tagging !!! \n\ndarktable is providing hierarchical -----> tagging !!! . so it's possible to tag an image with location-&gt;city-&gt;london. \n\n### 9. choice\n\nmy favorite became darktable because of the processing speed in the workflow. here is capture one in a disadvantage.\n\n### 10. storing images on a nas\n\ni build myself a nas (64gb ram, ryzen cpu) with a zfs z2 raid and 10gb ethernet network on the base of open media vault, which is based on debian. my choice for such a solution was driven by being able to run docker containers with load. since i'm used to work with debian systems, i don't wanted freenas which is bsd based. \n\nthe used database engine is sqlite, which is on the network quite dependent on the used file system. using the usual smb (windows) based file sharing isn't working well over network for the database. i had to use nfs. open media vault makes it quite easy configure shares. i moved images as well as the database to the nas and replaced the files and directories with softlinks pointing to the nas. this allows to change the nas while the stored paths in the database are remaining the same. \n\nanother way to solve the problem of changing paths to an image directory is simply to change a row in the database, with a firefox addon. it was my solution to adapt to a changed image directory. \n\nthe raid system is a lot faster than a sata ssd with 600mb/s and even the access of the database on the nas doesn't delay the system. importing images is faster than ever. i need for the import of of 30 images on the light table not more than 1s. \n\nmy ups was connected to the nas . in the case of a power outage  the system is powering down automatically. \n\n### 11. caveats\n\n- i'm using linux on my personal pc because it's faster. but using windows shouldn't be a problem as well. but in any case mounting the shares of the nas statically into the pc can be a challenge for some. \n\n- a nas is not a backup and backup is expensive\n\n- a ups is needed otherwise zfs is going to be destroyed when a power outage occurs. \n\n- my case for the nas is not that good. there is nothing on the market supporting cooling of hard disks with low noise fans. i had to close ventilation holes with tape to force air over the hard disks. if you have a special room for a noisy server get one from ebay. the 8 hard disks are producing more than 100w of heat, which is quite a heating source for my room. \n\n### 12. conclusion \n\ni'm quite satisfied with the solution especially darktable. the speed is fantastic. i've never experience such a fast system before. \n\na substitution of the nas with a nvme ssd is possible, but image data hase to be stored somewhere and i produced this summer over 150gb of raw image data. the nvme solution is not cheaper. \n\na graphics card with 6gb ram should be sufficient to accelerate darktable.", "sortedWord": "None", "identifyer": 71986, "year": "2020"}, {"Unnamed: 0": 70345, "autor": "shrimpynut", "date": 1596268810000, "content": "Stumbled upon this photo on a Instagram tag did the dude photoshop himself in? Looks a little bit photoshopped but at the same time doesn’t. Thoughts?", "link": "https://www.reddit.com/r/photography/comments/i1olwe/stumbled_upon_this_photo_on_a_instagram_tag_did/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "stumbled upon this photo on a instagram -----> tag !!!  did the dude photoshop himself in? looks a little bit photoshopped but at the same time doesn’t. thoughts?", "sortedWord": "None", "identifyer": 72108, "year": "2020"}, {"Unnamed: 0": 71112, "autor": "mxmphotos", "date": 1607455815000, "content": "Selling Photos?? /!/ alright need opinions.\n\nI'm looking to sell photos for my local sports league, I sell photos of our high school sports teams to parents with prepaid deals for the season. and I'm looking for a website with watermark protection. but what I see with a lot of places are high commission fees. \n\nI don't need anything fancy, would prefer a monthly rate with no fees on sales. I just want somewhere I can upload an album with the Team A vs Team B title, all the photos with watermarks. no titles on photos, no tags no anything, just somewhere I can put photos and tell parents where to buy at. any suggestions? \n\nthanks!", "link": "https://www.reddit.com/r/photography/comments/k9b3py/selling_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "selling photos?? /!/ alright need opinions.\n\ni'm looking to sell photos for my local sports league, i sell photos of our high school sports teams to parents with prepaid deals for the season. and i'm looking for a website with watermark protection. but what i see with a lot of places are high commission fees. \n\ni don't need anything fancy, would prefer a monthly rate with no fees on sales. i just want somewhere i can upload an album with the team a vs team b title, all the photos with watermarks. no titles on photos, no -----> tags !!!  no anything, just somewhere i can put photos and tell parents where to buy at. any suggestions? \n\nthanks!", "sortedWord": "None", "identifyer": 72899, "year": "2020"}, {"Unnamed: 0": 71158, "autor": "Railionn", "date": 1607956104000, "content": "How come the 3 main zoom lenses all lack something /!/ SIGMA 24-70MM F/2.8, **slower AF** 1200 eur.\n\nTAMRON 28-75MM F/2.8 DI III RXD, **Horrible bokeh** 800 eur.\n\nSony FE 24-70mm f/2.8 GM, **Expensive** 2100 eur.\n\nI just bought the A7III. Have been looking around for ages to find a suitable first lens.. I own 2 sony fs5's so I would like a lens that I can use for video as well, because the A7III will be used as a B/C cam.\n\nEither way, that's not the main point right now. I really like the Tamron, but the bokeh just doesn't seem great at all. Way to busy. \nSigma's bokeh is better, but still has some onion rings present.\n\nSony is the allround winner but the price tag isn't gonna cut it for me right now.\n\nSomeone, help me out. \n\nMy best bet would be to go for the tamron and use it as a landscape lens, while for portrait or bokeh i'll buy the SONY FE 85MM F/1.8..", "link": "https://www.reddit.com/r/photography/comments/kcymhn/how_come_the_3_main_zoom_lenses_all_lack_something/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how come the 3 main zoom lenses all lack something /!/ sigma 24-70mm f/2.8, **slower af** 1200 eur.\n\ntamron 28-75mm f/2.8 di iii rxd, **horrible bokeh** 800 eur.\n\nsony fe 24-70mm f/2.8 gm, **expensive** 2100 eur.\n\ni just bought the a7iii. have been looking around for ages to find a suitable first lens.. i own 2 sony fs5's so i would like a lens that i can use for video as well, because the a7iii will be used as a b/c cam.\n\neither way, that's not the main point right now. i really like the tamron, but the bokeh just doesn't seem great at all. way to busy. \nsigma's bokeh is better, but still has some onion rings present.\n\nsony is the allround winner but the price -----> tag !!!  isn't gonna cut it for me right now.\n\nsomeone, help me out. \n\nmy best bet would be to go for the tamron and use it as a landscape lens, while for portrait or bokeh i'll buy the sony fe 85mm f/1.8..", "sortedWord": "None", "identifyer": 72946, "year": "2020"}, {"Unnamed: 0": 71699, "autor": "ThoughtsToMyself", "date": 1603867247000, "content": "Looking for some photographers who might be interested in letting me use their photos for my instagram poetry page I am starting. /!/ Sorry if this is against the rules, I could not see anything specifically against it.\n\nI write poetry, and I am starting an Instagram page to share it on to hopefully reach a wider audience. If you are interested in sharing your photography with me, I will of course tag whatever you want (your insta, your reddit, your personal website,  name, etc,) in it and credit you. \n\nAnyway, comment here or dm me if you are interested. I will let you know what scene I am looking for, or what emotion I want behind the photo whenever we talk more.\n\nAlso, I am not trying to self promote at all, but if you would like to know what kind of poetry I write to know if you are interested or not, I have a few up on my reddit page right now.\n\nTagged as art, because that is what I am hoping to create.", "link": "https://www.reddit.com/r/photography/comments/jjivy9/looking_for_some_photographers_who_might_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for some photographers who might be interested in letting me use their photos for my instagram poetry page i am starting. /!/ sorry if this is against the rules, i could not see anything specifically against it.\n\ni write poetry, and i am starting an instagram page to share it on to hopefully reach a wider audience. if you are interested in sharing your photography with me, i will of course -----> tag !!!  whatever you want (your insta, your reddit, your personal website,  name, etc,) in it and credit you. \n\nanyway, comment here or dm me if you are interested. i will let you know what scene i am looking for, or what emotion i want behind the photo whenever we talk more.\n\nalso, i am not trying to self promote at all, but if you would like to know what kind of poetry i write to know if you are interested or not, i have a few up on my reddit page right now.\n\ntagged as art, because that is what i am hoping to create.", "sortedWord": "None", "identifyer": 73509, "year": "2020"}, {"Unnamed: 0": 71810, "autor": "Spirit-S65", "date": 1604280496000, "content": "How Does One Become An Assistant or Second Shooter? /!/ I'm interested in working with oh photographers and getting my feet wet in the industry, I met another photographer while out from voting and he's done some portrait work and I was thinking of sending him an email if he needs an assistant. I don't have a portfolio or anything yet, but for being an assistant I wouldn't know if that would matter.\n\nThere is also a local photojournalist that does work that I ,oved that I'd love to tag with, is it worth asking hi m if he would want a second shooter? He shoots a completely different camera system ( Fuji, I use Canon ).  And face paced work for Getty and other organizations doesn't seem like the place for someone at my skill level. Doesn't seem like a good idea. \n\nDo I simply look up local photographers and ask them if they'd want an assistant? Just ask around in my area?", "link": "https://www.reddit.com/r/photography/comments/jmeeca/how_does_one_become_an_assistant_or_second_shooter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how does one become an assistant or second shooter? /!/ i'm interested in working with oh photographers and getting my feet wet in the industry, i met another photographer while out from voting and he's done some portrait work and i was thinking of sending him an email if he needs an assistant. i don't have a portfolio or anything yet, but for being an assistant i wouldn't know if that would matter.\n\nthere is also a local photojournalist that does work that i ,oved that i'd love to -----> tag !!!  with, is it worth asking hi m if he would want a second shooter? he shoots a completely different camera system ( fuji, i use canon ).  and face paced work for getty and other organizations doesn't seem like the place for someone at my skill level. doesn't seem like a good idea. \n\ndo i simply look up local photographers and ask them if they'd want an assistant? just ask around in my area?", "sortedWord": "None", "identifyer": 73621, "year": "2020"}, {"Unnamed: 0": 72220, "autor": "goekhanpolat", "date": 1605819104000, "content": "Who are the tagged girls?", "link": "https://www.reddit.com/r/photography/comments/jxb0cv/who_are_the_tagged_girls/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "who are the -----> tagged !!!  girls?", "sortedWord": "None", "identifyer": 74049, "year": "2020"}, {"Unnamed: 0": 73319, "autor": "thelifehypnotic", "date": 1582820427000, "content": "Seeking Opinions: Is it okay to share a photo without permission if you credit the photographer? /!/ Back story: I follow hashtags on IG for my city. Lots of people come and take photos but aren’t from here, so they usually don’t think to post the photo on a local subreddit for the city.\n\nI saw the photo. Thought it was cool. I took screenshot, posted to my local subreddit, cretics the artist, and linked his IG account. I thought that would be fair. I never want to report art without crediting who did it.\n\nLater, I saw the photographer (same handle, same person) post on the local subreddit. I messaged them, said I like their photos, so much so that I posted one of their photos online, tagged them, and that everyone on the subreddit loved it.\n\nThey messaged me back saying (this is shortened and paraphrased): Yeah, I saw that you posted it. You shouldn’t post other people’s pictures without their expressed consent though.\n\nThey expressed their opinion and I respect that. I won’t post their photos again without permission. But I also find that a bit cumbersome (and slightly awkward) so I likely won’t post their photos again.\n\nI want to respect photographers for the effort they put in. Is it disrespectful to post someone’s photo without their permission even if you credit them?\n\nI hadn’t ever heard that, but if that’s true I don’t want to do it anymore. Thanks in advance for the thoughts.", "link": "https://www.reddit.com/r/photography/comments/faehv7/seeking_opinions_is_it_okay_to_share_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "seeking opinions: is it okay to share a photo without permission if you credit the photographer? /!/ back story: i follow hashtags on ig for my city. lots of people come and take photos but aren’t from here, so they usually don’t think to post the photo on a local subreddit for the city.\n\ni saw the photo. thought it was cool. i took screenshot, posted to my local subreddit, cretics the artist, and linked his ig account. i thought that would be fair. i never want to report art without crediting who did it.\n\nlater, i saw the photographer (same handle, same person) post on the local subreddit. i messaged them, said i like their photos, so much so that i posted one of their photos online, -----> tagged !!!  them, and that everyone on the subreddit loved it.\n\nthey messaged me back saying (this is shortened and paraphrased): yeah, i saw that you posted it. you shouldn’t post other people’s pictures without their expressed consent though.\n\nthey expressed their opinion and i respect that. i won’t post their photos again without permission. but i also find that a bit cumbersome (and slightly awkward) so i likely won’t post their photos again.\n\ni want to respect photographers for the effort they put in. is it disrespectful to post someone’s photo without their permission even if you credit them?\n\ni hadn’t ever heard that, but if that’s true i don’t want to do it anymore. thanks in advance for the thoughts.", "sortedWord": "None", "identifyer": 75193, "year": "2020"}, {"Unnamed: 0": 76115, "autor": "Calamity_Armor", "date": 1580477488000, "content": "About to quit photography /!/ Hello people,\n\nSince I was little I had an attraction for art, drawing and photography especially.\n\nAlmost 2 years ago I started getting into professional photography. Bought a professional camera, blitz, one lens and a couple of filters. It all started as a hobby and it was for a while. \n\nBut like most things in like, I wanted to monetize this hobby like most of us do. The problem was that everyone but everyone was looking for me but none paid. I was showcased in one public event, in the middle of my city were hanging a couple of my pictures, some big instagram pages reposted some of my photos, friends of friends were looking for me but I am actually embarrassed to say how little I made from photography, almost nothing.\n\nI'm realistic, I'm not that great, I'm somewhere in the middle, but still there are middle-class photographers that still make a living out of it. I'm even a bit angry at this point, it's frustrating to see people come to you and hit you with \"hey, so can you like to come and take some photos of me and my boyfriend? I saw your photos and they are really great, we will tag you in our post, what do you think?\"\n\nI just, lost all my appetite for taking pictures, not worth it, people expect you to be privileged to take pictures of them for free.\n\nI'm sure some of you would like to see some of my work so I will leave a link below just for reference.\n\n[https://imgur.com/a/InO6OPI](https://imgur.com/a/InO6OPI)", "link": "https://www.reddit.com/r/photography/comments/ewoi2o/about_to_quit_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "about to quit photography /!/ hello people,\n\nsince i was little i had an attraction for art, drawing and photography especially.\n\nalmost 2 years ago i started getting into professional photography. bought a professional camera, blitz, one lens and a couple of filters. it all started as a hobby and it was for a while. \n\nbut like most things in like, i wanted to monetize this hobby like most of us do. the problem was that everyone but everyone was looking for me but none paid. i was showcased in one public event, in the middle of my city were hanging a couple of my pictures, some big instagram pages reposted some of my photos, friends of friends were looking for me but i am actually embarrassed to say how little i made from photography, almost nothing.\n\ni'm realistic, i'm not that great, i'm somewhere in the middle, but still there are middle-class photographers that still make a living out of it. i'm even a bit angry at this point, it's frustrating to see people come to you and hit you with \"hey, so can you like to come and take some photos of me and my boyfriend? i saw your photos and they are really great, we will -----> tag !!!  you in our post, what do you think?\"\n\ni just, lost all my appetite for taking pictures, not worth it, people expect you to be privileged to take pictures of them for free.\n\ni'm sure some of you would like to see some of my work so i will leave a link below just for reference.\n\n[https://imgur.com/a/ino6opi](https://imgur.com/a/ino6opi)", "sortedWord": "None", "identifyer": 78081, "year": "2020"}, {"Unnamed: 0": 76427, "autor": "thatsudhirguy", "date": 1587778086000, "content": "Converting a zoom P &amp; S to a fixed lens /!/ Hi all,\n\nPlease forgive me if I'm using the incorrect tag/flair for this!  If so, please advise if anyone knows where camera hardware/modding should be posted.\n\nI've got an old Canon ELPH 180 , and I'd heard of such a camera being converted into a manual fixed lens digital camera instead.  \n\nI'm wondering if anyone in the community would be able to verify that:\n\n(A) this can be done;\n(B) outside of possible flange distance calculations would it be possible by simply removing the zoom lens and gluing on a new thread/adapter to match the small, manual prime lens to be screwed in and editing the system options in the firmware to disable zoom and autofocus?\n\nI thought that it would be really neat if I could get a cheap manual lens that I could replace the existing (busted) zoom lens and create something new.\n\nI tried to find some info online, but I couldn't find anything useful.  If any of you would know more about this then I'd appreciate it 🙂\n\nThanks for your time!", "link": "https://www.reddit.com/r/photography/comments/g7kxgd/converting_a_zoom_p_s_to_a_fixed_lens/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "converting a zoom p &amp; s to a fixed lens /!/ hi all,\n\nplease forgive me if i'm using the incorrect -----> tag !!! /flair for this!  if so, please advise if anyone knows where camera hardware/modding should be posted.\n\ni've got an old canon elph 180 , and i'd heard of such a camera being converted into a manual fixed lens digital camera instead.  \n\ni'm wondering if anyone in the community would be able to verify that:\n\n(a) this can be done;\n(b) outside of possible flange distance calculations would it be possible by simply removing the zoom lens and gluing on a new thread/adapter to match the small, manual prime lens to be screwed in and editing the system options in the firmware to disable zoom and autofocus?\n\ni thought that it would be really neat if i could get a cheap manual lens that i could replace the existing (busted) zoom lens and create something new.\n\ni tried to find some info online, but i couldn't find anything useful.  if any of you would know more about this then i'd appreciate it 🙂\n\nthanks for your time!", "sortedWord": "None", "identifyer": 78403, "year": "2020"}, {"Unnamed: 0": 76541, "autor": "BofLub", "date": 1587322996000, "content": "Advice about a promotion /!/ Over the past year, I have been growing an Instagram for my photography. It has been going pretty well and I've been so happy to see my work get appreciated so much! Earlier today, I got an offer from a page that wanted to collaborate with me. I take quite a lot of photos of my dog, because she's really cute and I can use her as a model whenever, and a brand that makes clothes and accessories for dogs wanted to collaborate with me. The idea was to send me a free item from their store, for me to take a photo of my dog playing wifh it/ wearing it and they'd post it on their page and on their site, crediting me. I'd also get an affiliate link that offers my fans a good discount code (35%) and I get 10% of any purchase using that code.\n\nThat all sounded amazing, until they told me more. I would have to buy one of their items first, and would get a free item with it. I'm aware of scams like this and their page has just over 2k followers, so isn't huge. Is it worth putting my own money on the line (especially considering how expensive their stuff is) to do this? I'd also have to deal with import duties and VAT, which would make it even more costly. \n\nI'm just not sure about the whole thing. For all I know, they scam 40 dog lovers a week, and make money that way. And my page isn't really big enough for them to care about. I have around 250 followers, who have a fairly low engagement tbh, and get most of my likes from hash tags (normally 300-600 after a week). What do you all think?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/g4dag6/advice_about_a_promotion/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "advice about a promotion /!/ over the past year, i have been growing an instagram for my photography. it has been going pretty well and i've been so happy to see my work get appreciated so much! earlier today, i got an offer from a page that wanted to collaborate with me. i take quite a lot of photos of my dog, because she's really cute and i can use her as a model whenever, and a brand that makes clothes and accessories for dogs wanted to collaborate with me. the idea was to send me a free item from their store, for me to take a photo of my dog playing wifh it/ wearing it and they'd post it on their page and on their site, crediting me. i'd also get an affiliate link that offers my fans a good discount code (35%) and i get 10% of any purchase using that code.\n\nthat all sounded amazing, until they told me more. i would have to buy one of their items first, and would get a free item with it. i'm aware of scams like this and their page has just over 2k followers, so isn't huge. is it worth putting my own money on the line (especially considering how expensive their stuff is) to do this? i'd also have to deal with import duties and vat, which would make it even more costly. \n\ni'm just not sure about the whole thing. for all i know, they scam 40 dog lovers a week, and make money that way. and my page isn't really big enough for them to care about. i have around 250 followers, who have a fairly low engagement tbh, and get most of my likes from hash -----> tags !!!  (normally 300-600 after a week). what do you all think?\n\nthanks!", "sortedWord": "None", "identifyer": 78526, "year": "2020"}, {"Unnamed: 0": 77295, "autor": "akbanx", "date": 1589213389000, "content": "A Guide to Film Photography Feature Accounts on Instagram (originally posted on Analog Community) /!/ Hey r/photography! This is a guide I wrote to analog feature accounts on Instagram. I know there are a lot of useless hashtags out there, and I wanted to highlight some feature accounts that might be a good start for film photographers who are interesting in finding inspiring work and sharing their own with the IG community. \n\nThis list is in no way meant to be exhaustive, as that would be impossible, but for those of you who are starting out with film photography and wondering how to share your work, there are a number of accounts that have their own hashtags, and mostly feature photos that are tagged with those hashtags. There are so many of these accounts that it’s sometimes hard to tell them apart, so part of why I wanted to write this is to help demystify their differences.\n\nSome of these accounts are legitimate print outlets, though some of them just exist on Instagram. Some of them – particularly the larger accounts – may not rely on hashtags for discovering work at all, even though it seems like they do. Your mileage may vary, and to be honest, it’s sometimes a popularity contest, especially with accounts that have more than 200k followers. But other photographers may follow these hashtags and discover your work as a result.\n\nThere’s a lot of crossover with these accounts. You’ll see certain photos and photographers that are featured on multiple accounts, which is I guess the film photography version of going viral. You know the kind of photos I’m talking about – the kind that are peppered throughout Instagram’s “explore” section, or the ones that hit the top of [r/analog](https://www.reddit.com/r/analog/). The kind that win contests. The ones that make you wish that you too were a master of nailing exposure and stumbling across (or creating) scenes that take your breath away.\n\nAnyways, here’s a rough guide to curated feature accounts, sorted by the size of their follower-base. Instagram pages are linked. As a disclaimer, I think that curation is more important than popularity, and some of the smaller ones are run by people who are more involved in the analog community. Most of them are focused on film photography, but they’re not all exclusively analog. Some featured photos just have a film “vibe” or aesthetic, which may annoy some people here. Lastly, these are just my opinions. This is a subjective guide. I'm not an expert -- I'm just a fan.\n\nOne thing I want to say is that you should **NEVER PAY FOR FEATURES**. I know it's tempting, everybody wants to get their work seen, but these accounts are popular because of other people's work. If anything, they should pay YOU for the use of your photography. I haven't mentioned certain accounts here because of this.\n\nAnyways...\n\n**\\~ \\~ A LIST OF FILM PHOTOGRAPHY FEATURE ACCOUNTS \\~ \\~**\n\n[**Somewhere Magazine**](https://www.instagram.com/somewheremagazine/) **(#somewheremagazine) (861k followers)**\n\nSomewhere Magazine is one of the larger accounts out there. There’s a nice mixture of cinematic scenes and more abstract lens-based art on this page, and it lives up to its claim of being a “mood board”.\n\n[**Film Wave**](https://www.instagram.com/film.wave/) **(#filmwave) (275k)**\n\nThis account has a tendency to post photos that are in some ways related to the act of analog photography in a meta kind of way. You’ll find analog self portraits, photos of cameras, etc. on here. There’s obviously more to their curation than that, as it is a large account with a large fanbase, but if you have a beautifully shot gear pic, this might be the account for you to tag.\n\n[**Nowhere Diary**](https://www.instagram.com/nowherediary/) **(#nowherediary) (257k)**\n\nLots of night scenes and foggy, moody photography. Lots of beautiful, empty scenes with no people in them, though some photos do feature people. What I like about this account is their tendency to pair some of their posts with lengthy written blurbs about photography. They have a series of Nowhere Diary Legend posts where they introduce their audience to famous photographers, which is a cool way to find out about significant photographers if you’re new to photography and/or less plugged in to the historical side of things.\n\n[**Film Photographic**](https://www.instagram.com/filmphotographic/) **(#filmphotographic) (204k)**\n\nOne of the founders and curators is Jason Lee, which is cool. Also a gallery and book publisher. There’s an emphasis on more rural scenes here and landscapes. Many of the photos are people-less, which I like. I’m not sure how active it is, but it’s maybe worth checking out.\n\n[**If You Leave**](https://www.instagram.com/ifyouleavestagram/) **(#ifyouleave) (152k)**\n\nBig M O O D. Cinematic pics out the wazoo. Even the name is dramatic. This account has been around since 2009, before certain film cameras started costing more than cars. I like their curation.\n\n[**Film Photo Mag**](https://www.instagram.com/filmphotomag/) **(#filmphotomag) (137k)**\n\nThere seems to be an emphasis on grainy photos on this page, some of which are underexposed (but who cares!). Moody stuff. Lots of cities, lots of silhouettes. That kind of thing.\n\n[**Tainted Magazine**](https://www.instagram.com/taintedmag/) **(#taintedmag) (9k)**\n\nLots of fine art portraiture, sometimes of famous people. The curation seems to favor innovative poses and composition that wouldn’t be out of place in a fancy MFA program. Think Ryan McGinley, or someone whose work is more abstract than that. The photos here look like they could be in NY Mag or the NYT magazine. Or a museum, really.\n\n[**Film Shooters Collective**](https://www.instagram.com/filmshooterscollective/) **(#heyfsc) (80k)**\n\nThis account has been around for quite some time, and you’ll notice that some of their curation highlights photos that embrace the imperfections of film. By this, I mean photos shot on expired film, or photos with light leaks. If you like double exposures, this might be a good hashtag for you to use.\n\n[**Photo Filmy**](https://www.instagram.com/photo.filmy/) **(#photofilmy) (74k)**\n\nThere tends to be a focus on geometrically-pleasing images here. Lots of beautiful old buildings, some Americana-influenced stuff. There’s an interesting mix of curation here, and a number of the photos are densely layered.\n\n[**Ain't–Bad**](https://www.instagram.com/aintbad/) **(#aintbad) (70k)**\n\nThis is less of a feature account and more of a real-assed magazine/publisher. There’s more of an emphasis here on body of work (photo essays, photo books) than singles, which I really like because a cohesive body of work is what eventually sets you apart from the kind of photographers who just take pretty pictures.\n\n*NOTE: I found out after writing this that there are some* ***serious underlying issues with Ain’t Bad***\\*, which you can find out about on Instagram. Notably, they have failed to support people of color and lack diversity in their programming. There are also accusations of sexual assault that have been brought up against people involved with Ain’t Bad. It’s\\* ***really*** *disappointing and disheartening to read about because I’ve found some great photographers through their site. Consider not using this hashtag.*\n\n[**Back 2 the Base**](https://www.instagram.com/back2thebase/) **(#back2thebase) (44k)**\n\nA mixture of Ian Howorth-esque emptiness, portraiture, and street photography. Quite artsy. I like their logo.\n\n[**Drive By Film**](https://www.instagram.com/drivebyfilm/) **(#drivebyfilm) (31k)**\n\nSpoiler alert: there are a lot of beautiful cars on this account’s page, along with some gas stations, and a little bit of night work. It seems to be very focused on American scenes, though to be fair, so are many other accounts.\n\n[**Restore from Backup**](https://www.instagram.com/restorefrombackup/) **(#restorefrombackup) (31k)**\n\nI’m biased in my love for this account because they’ve shared my photography on multiple occasions (and more than other feature accounts have), but they place a really high value on community-building, and in that way it’s like a mixture of [r/analog](https://www.reddit.com/r/analog/) and [r/analogcommunity](https://www.reddit.com/r/analogcommunity/). From what I can tell it’s run by good people who don’t have a superiority complex about photography. They also do a nice job of showcasing work from smaller accounts.\n\n[**Burbs on Film**](https://www.instagram.com/burbsonfilm/) **(#burbsonfilm) (26k)**\n\nThere are plenty of photos of suburbs on this page, but they’re not exclusively shot in suburban settings. A number of these photographs subvert traditional stereotypes of the United States, though some are pretty straightforward in their scope. Lots of these photos feel like they’re from another era.\n\n[**Make Me See Mag**](https://www.instagram.com/makemeseemag/) **(#makemeseemag) (24k)**\n\nWhat I’ve noticed with the photos that this account features is that they mostly feature photographs that have a dynamic subject that your eye zeroes in on immediately. There’s a little bit of flash photography thrown into the mix, which is nice. The curation is pretty varied and some of the photos are shot in quite innovative ways. It’s a great account that deserves a larger following.\n\n[**The Film Stead**](https://www.instagram.com/thefilmstead/) **(#thefilmstead) (11k)**\n\nSoothing, beautiful photography with a focus on architecture and landscapes. In a world where so many photographs are moody and dark, it’s nice to see photos that have a happier, more positive vibe.\n\n\\-----\n\n**Accounts with less than 10k followers that might be worth your time:**\n\n[**Every Day Rural America**](https://www.instagram.com/everydayruralamerica/) **(#everydayruralamerica) (6k)**\n\n[**Rural Exposures**](https://www.instagram.com/ruralexposures/) **(#ruralexposures) (6k)**\n\n[**The Film Renaissance**](https://www.instagram.com/thefilmrenaissance/) **(#thefilmrenaissance) (5k)**\n\n[**Film Leaders**](https://www.instagram.com/filmleaders/) **(#filmleaders) (4k)**\n\n[**Observation Magazine**](https://www.instagram.com/observationmag/) **(#observationmag) (3k)**\n\n[**Seasoned Film**](https://www.instagram.com/seasonedfilm/) **(#seasonedfilm) (2k)**\n\n[**Analog Drive**](https://www.instagram.com/analogdrive/) **(#analogdrivemag) (1.5k)**\n\nFeel free to post more accounts that you like in the comments, or share your thoughts on these accounts.\n\nFull disclosure: I am not involved with running any of these accounts. I’m just a person who loves photography of all kinds, and wanted to share my thoughts on feature accounts with new (and established) photographers.\n\nAnyways, thanks for reading.", "link": "https://www.reddit.com/r/photography/comments/ghqhgn/a_guide_to_film_photography_feature_accounts_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "a guide to film photography feature accounts on instagram (originally posted on analog community) /!/ hey r/photography! this is a guide i wrote to analog feature accounts on instagram. i know there are a lot of useless hashtags out there, and i wanted to highlight some feature accounts that might be a good start for film photographers who are interesting in finding inspiring work and sharing their own with the ig community. \n\nthis list is in no way meant to be exhaustive, as that would be impossible, but for those of you who are starting out with film photography and wondering how to share your work, there are a number of accounts that have their own hashtags, and mostly feature photos that are -----> tagged !!!  with those hashtags. there are so many of these accounts that it’s sometimes hard to tell them apart, so part of why i wanted to write this is to help demystify their differences.\n\nsome of these accounts are legitimate print outlets, though some of them just exist on instagram. some of them – particularly the larger accounts – may not rely on hashtags for discovering work at all, even though it seems like they do. your mileage may vary, and to be honest, it’s sometimes a popularity contest, especially with accounts that have more than 200k followers. but other photographers may follow these hashtags and discover your work as a result.\n\nthere’s a lot of crossover with these accounts. you’ll see certain photos and photographers that are featured on multiple accounts, which is i guess the film photography version of going viral. you know the kind of photos i’m talking about – the kind that are peppered throughout instagram’s “explore” section, or the ones that hit the top of [r/analog](https://www.reddit.com/r/analog/). the kind that win contests. the ones that make you wish that you too were a master of nailing exposure and stumbling across (or creating) scenes that take your breath away.\n\nanyways, here’s a rough guide to curated feature accounts, sorted by the size of their follower-base. instagram pages are linked. as a disclaimer, i think that curation is more important than popularity, and some of the smaller ones are run by people who are more involved in the analog community. most of them are focused on film photography, but they’re not all exclusively analog. some featured photos just have a film “vibe” or aesthetic, which may annoy some people here. lastly, these are just my opinions. this is a subjective guide. i'm not an expert -- i'm just a fan.\n\none thing i want to say is that you should **never pay for features**. i know it's tempting, everybody wants to get their work seen, but these accounts are popular because of other people's work. if anything, they should pay you for the use of your photography. i haven't mentioned certain accounts here because of this.\n\nanyways...\n\n**\\~ \\~ a list of film photography feature accounts \\~ \\~**\n\n[**somewhere magazine**](https://www.instagram.com/somewheremagazine/) **(#somewheremagazine) (861k followers)**\n\nsomewhere magazine is one of the larger accounts out there. there’s a nice mixture of cinematic scenes and more abstract lens-based art on this page, and it lives up to its claim of being a “mood board”.\n\n[**film wave**](https://www.instagram.com/film.wave/) **(#filmwave) (275k)**\n\nthis account has a tendency to post photos that are in some ways related to the act of analog photography in a meta kind of way. you’ll find analog self portraits, photos of cameras, etc. on here. there’s obviously more to their curation than that, as it is a large account with a large fanbase, but if you have a beautifully shot gear pic, this might be the account for you to tag.\n\n[**nowhere diary**](https://www.instagram.com/nowherediary/) **(#nowherediary) (257k)**\n\nlots of night scenes and foggy, moody photography. lots of beautiful, empty scenes with no people in them, though some photos do feature people. what i like about this account is their tendency to pair some of their posts with lengthy written blurbs about photography. they have a series of nowhere diary legend posts where they introduce their audience to famous photographers, which is a cool way to find out about significant photographers if you’re new to photography and/or less plugged in to the historical side of things.\n\n[**film photographic**](https://www.instagram.com/filmphotographic/) **(#filmphotographic) (204k)**\n\none of the founders and curators is jason lee, which is cool. also a gallery and book publisher. there’s an emphasis on more rural scenes here and landscapes. many of the photos are people-less, which i like. i’m not sure how active it is, but it’s maybe worth checking out.\n\n[**if you leave**](https://www.instagram.com/ifyouleavestagram/) **(#ifyouleave) (152k)**\n\nbig m o o d. cinematic pics out the wazoo. even the name is dramatic. this account has been around since 2009, before certain film cameras started costing more than cars. i like their curation.\n\n[**film photo mag**](https://www.instagram.com/filmphotomag/) **(#filmphotomag) (137k)**\n\nthere seems to be an emphasis on grainy photos on this page, some of which are underexposed (but who cares!). moody stuff. lots of cities, lots of silhouettes. that kind of thing.\n\n[**tainted magazine**](https://www.instagram.com/taintedmag/) **(#taintedmag) (9k)**\n\nlots of fine art portraiture, sometimes of famous people. the curation seems to favor innovative poses and composition that wouldn’t be out of place in a fancy mfa program. think ryan mcginley, or someone whose work is more abstract than that. the photos here look like they could be in ny mag or the nyt magazine. or a museum, really.\n\n[**film shooters collective**](https://www.instagram.com/filmshooterscollective/) **(#heyfsc) (80k)**\n\nthis account has been around for quite some time, and you’ll notice that some of their curation highlights photos that embrace the imperfections of film. by this, i mean photos shot on expired film, or photos with light leaks. if you like double exposures, this might be a good hashtag for you to use.\n\n[**photo filmy**](https://www.instagram.com/photo.filmy/) **(#photofilmy) (74k)**\n\nthere tends to be a focus on geometrically-pleasing images here. lots of beautiful old buildings, some americana-influenced stuff. there’s an interesting mix of curation here, and a number of the photos are densely layered.\n\n[**ain't–bad**](https://www.instagram.com/aintbad/) **(#aintbad) (70k)**\n\nthis is less of a feature account and more of a real-assed magazine/publisher. there’s more of an emphasis here on body of work (photo essays, photo books) than singles, which i really like because a cohesive body of work is what eventually sets you apart from the kind of photographers who just take pretty pictures.\n\n*note: i found out after writing this that there are some* ***serious underlying issues with ain’t bad***\\*, which you can find out about on instagram. notably, they have failed to support people of color and lack diversity in their programming. there are also accusations of sexual assault that have been brought up against people involved with ain’t bad. it’s\\* ***really*** *disappointing and disheartening to read about because i’ve found some great photographers through their site. consider not using this hashtag.*\n\n[**back 2 the base**](https://www.instagram.com/back2thebase/) **(#back2thebase) (44k)**\n\na mixture of ian howorth-esque emptiness, portraiture, and street photography. quite artsy. i like their logo.\n\n[**drive by film**](https://www.instagram.com/drivebyfilm/) **(#drivebyfilm) (31k)**\n\nspoiler alert: there are a lot of beautiful cars on this account’s page, along with some gas stations, and a little bit of night work. it seems to be very focused on american scenes, though to be fair, so are many other accounts.\n\n[**restore from backup**](https://www.instagram.com/restorefrombackup/) **(#restorefrombackup) (31k)**\n\ni’m biased in my love for this account because they’ve shared my photography on multiple occasions (and more than other feature accounts have), but they place a really high value on community-building, and in that way it’s like a mixture of [r/analog](https://www.reddit.com/r/analog/) and [r/analogcommunity](https://www.reddit.com/r/analogcommunity/). from what i can tell it’s run by good people who don’t have a superiority complex about photography. they also do a nice job of showcasing work from smaller accounts.\n\n[**burbs on film**](https://www.instagram.com/burbsonfilm/) **(#burbsonfilm) (26k)**\n\nthere are plenty of photos of suburbs on this page, but they’re not exclusively shot in suburban settings. a number of these photographs subvert traditional stereotypes of the united states, though some are pretty straightforward in their scope. lots of these photos feel like they’re from another era.\n\n[**make me see mag**](https://www.instagram.com/makemeseemag/) **(#makemeseemag) (24k)**\n\nwhat i’ve noticed with the photos that this account features is that they mostly feature photographs that have a dynamic subject that your eye zeroes in on immediately. there’s a little bit of flash photography thrown into the mix, which is nice. the curation is pretty varied and some of the photos are shot in quite innovative ways. it’s a great account that deserves a larger following.\n\n[**the film stead**](https://www.instagram.com/thefilmstead/) **(#thefilmstead) (11k)**\n\nsoothing, beautiful photography with a focus on architecture and landscapes. in a world where so many photographs are moody and dark, it’s nice to see photos that have a happier, more positive vibe.\n\n\\-----\n\n**accounts with less than 10k followers that might be worth your time:**\n\n[**every day rural america**](https://www.instagram.com/everydayruralamerica/) **(#everydayruralamerica) (6k)**\n\n[**rural exposures**](https://www.instagram.com/ruralexposures/) **(#ruralexposures) (6k)**\n\n[**the film renaissance**](https://www.instagram.com/thefilmrenaissance/) **(#thefilmrenaissance) (5k)**\n\n[**film leaders**](https://www.instagram.com/filmleaders/) **(#filmleaders) (4k)**\n\n[**observation magazine**](https://www.instagram.com/observationmag/) **(#observationmag) (3k)**\n\n[**seasoned film**](https://www.instagram.com/seasonedfilm/) **(#seasonedfilm) (2k)**\n\n[**analog drive**](https://www.instagram.com/analogdrive/) **(#analogdrivemag) (1.5k)**\n\nfeel free to post more accounts that you like in the comments, or share your thoughts on these accounts.\n\nfull disclosure: i am not involved with running any of these accounts. i’m just a person who loves photography of all kinds, and wanted to share my thoughts on feature accounts with new (and established) photographers.\n\nanyways, thanks for reading.", "sortedWord": "None", "identifyer": 79312, "year": "2020"}, {"Unnamed: 0": 78634, "autor": "gazer315", "date": 1592086162000, "content": "Red tag camera: is it a scam?", "link": "https://www.reddit.com/r/photography/comments/h8h1i0/red_tag_camera_is_it_a_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "red -----> tag !!!  camera: is it a scam?", "sortedWord": "None", "identifyer": 80712, "year": "2020"}, {"Unnamed: 0": 78647, "autor": "finox831", "date": 1592078810000, "content": "Following My Passion and Starting a Media Company /!/ Hi guys,\n\nI'm looking to start a local media company for small businesses and I'm seeking advice/guidance. \n\nBackground:  \nI've been photographing for roughly 10 years on and off and have six years working in Marketing roles with big and small companies throughout Silicon Valley. In the last year, I really got into videography after helping my dad with recipe and cooking videos (he sells high-end kitchen supply products) that we later published on social to drive brand awareness. I managed all of my dad's social from creating the content to publishing to reporting for both paid and organic. Long story short, since shelter-in-place, we pivoted to Facebook Live and have averaged 15k\\~ in sales monthly. We're doing live cooking videos 2x a week, an hour each, and doing giveaways/mass texting our client list to get people to join. \n\nWhy:  \nI'll like to combine everything I love: photography, videography, social, marketing, and helping small businesses and make a business out of it. \n\nService:  \nI want to help small businesses increase their brand awareness by creating social content for them and managing their social channels. I would go and shoot at their place 1-2x a month eg: coffee shop, restaurant, etc, and build out an organic social content strategy that consists of scheduling posts and managing their reporting  - they can also go into paid if that's something they may want too. The way people are communicating and engaging is through social so it's important for brands to have an authentic identity online driven by high-quality and engaging content. Through this content, you increase brand awareness and stay top of mind; build a connection with your customer, and gain trust. \n\nStarting:   \nI need to build out a portfolio with imagery/video smaller businesses can find relevant and see themselves having for their own business. I did mention I've been photographing on/off for 10 years but I feel that imagery doesn't align as I did mostly portraits and street so I'm not sure if it's something I want to show as my portfolio. In order to build relationships with smaller businesses and build out a relevant portfolio, I'll like to start off by offering free images/video for social and asking to just be credited via a tagged post so their followers can hear about me. This will also allow me to have content to publish on my own social and showcase my work + build out my portfolio. \n\nHow will I find people?  \n I plan to start off by DMing local businesses giving them a short background of what I'm looking to do and if they would be interested in what I'm offering for FREE. I would also highlight the benefits of what I'm doing. I definitely see this working but in the case that it doesn't, I'll have to run paid social ads locally.\n\nHow much to charge:  \nI'll like to come up with some sort of package that includes \\~10 posts a month consisting of 8-12 pictures and 2 videos (1 long (1min\\~) and 1 short form (15-30s), reporting, and consultancy. Unless we measure conversions via a coupon, unfortunately, branding is not quantifiable and as a result, I'm not sure if smaller businesses will see a benefit to my service - resulting in devaluing the work I'm doing. \n\nFor those interested, my equipment:  \nCamera: XT4  \nlens: XF 16-55 2.8   \ngimbal: Ronin S-C \n\nThank you for reading.", "link": "https://www.reddit.com/r/photography/comments/h8eppr/following_my_passion_and_starting_a_media_company/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "following my passion and starting a media company /!/ hi guys,\n\ni'm looking to start a local media company for small businesses and i'm seeking advice/guidance. \n\nbackground:  \ni've been photographing for roughly 10 years on and off and have six years working in marketing roles with big and small companies throughout silicon valley. in the last year, i really got into videography after helping my dad with recipe and cooking videos (he sells high-end kitchen supply products) that we later published on social to drive brand awareness. i managed all of my dad's social from creating the content to publishing to reporting for both paid and organic. long story short, since shelter-in-place, we pivoted to facebook live and have averaged 15k\\~ in sales monthly. we're doing live cooking videos 2x a week, an hour each, and doing giveaways/mass texting our client list to get people to join. \n\nwhy:  \ni'll like to combine everything i love: photography, videography, social, marketing, and helping small businesses and make a business out of it. \n\nservice:  \ni want to help small businesses increase their brand awareness by creating social content for them and managing their social channels. i would go and shoot at their place 1-2x a month eg: coffee shop, restaurant, etc, and build out an organic social content strategy that consists of scheduling posts and managing their reporting  - they can also go into paid if that's something they may want too. the way people are communicating and engaging is through social so it's important for brands to have an authentic identity online driven by high-quality and engaging content. through this content, you increase brand awareness and stay top of mind; build a connection with your customer, and gain trust. \n\nstarting:   \ni need to build out a portfolio with imagery/video smaller businesses can find relevant and see themselves having for their own business. i did mention i've been photographing on/off for 10 years but i feel that imagery doesn't align as i did mostly portraits and street so i'm not sure if it's something i want to show as my portfolio. in order to build relationships with smaller businesses and build out a relevant portfolio, i'll like to start off by offering free images/video for social and asking to just be credited via a -----> tagged !!!  post so their followers can hear about me. this will also allow me to have content to publish on my own social and showcase my work + build out my portfolio. \n\nhow will i find people?  \n i plan to start off by dming local businesses giving them a short background of what i'm looking to do and if they would be interested in what i'm offering for free. i would also highlight the benefits of what i'm doing. i definitely see this working but in the case that it doesn't, i'll have to run paid social ads locally.\n\nhow much to charge:  \ni'll like to come up with some sort of package that includes \\~10 posts a month consisting of 8-12 pictures and 2 videos (1 long (1min\\~) and 1 short form (15-30s), reporting, and consultancy. unless we measure conversions via a coupon, unfortunately, branding is not quantifiable and as a result, i'm not sure if smaller businesses will see a benefit to my service - resulting in devaluing the work i'm doing. \n\nfor those interested, my equipment:  \ncamera: xt4  \nlens: xf 16-55 2.8   \ngimbal: ronin s-c \n\nthank you for reading.", "sortedWord": "None", "identifyer": 80725, "year": "2020"}, {"Unnamed: 0": 79133, "autor": "NoeticIntelligence", "date": 1594600217000, "content": "What is a tool that you use to classify your photographs? Like recognize people pets /!/ I would like to start a discussion on different ways to auto categorize photos\n\nFacebook explicitly does this to one degree with all photos and you can turn on a feature to see what the Facebook robot thinks it is seeing.  \n\nIs there a photo management program that can detect all dog pictures?\n\nI am looking for software that can go through about 12000 photos and categorize. \n\nI want it to pick out all dog pictures and preferably recognize different dogs. \n\nRecognize people is good to. Especially different people and offering guesses for picture of the same person and categorizing it. \n\nI know I can accomplish this if I spend enough time to teach a matrix how to do it with lots of samples to start off with but I am hoping someone has already done so and perfected it.  \n\nPrimarily I work on a Mac and mostly use capture or. And photoshop. Photo mechanic also for some jobs. I have Lightroom as well.   If I can do it in one of them great. \n\nIf I need to buy something else that is fine (dependent on cost). \n\nIt would be important that this tags the meta information of the photos in some ways so it is easy to use inside CaptureOne or Lightroom afterwards.", "link": "https://www.reddit.com/r/photography/comments/hq5dhj/what_is_a_tool_that_you_use_to_classify_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "what is a tool that you use to classify your photographs? like recognize people pets /!/ i would like to start a discussion on different ways to auto categorize photos\n\nfacebook explicitly does this to one degree with all photos and you can turn on a feature to see what the facebook robot thinks it is seeing.  \n\nis there a photo management program that can detect all dog pictures?\n\ni am looking for software that can go through about 12000 photos and categorize. \n\ni want it to pick out all dog pictures and preferably recognize different dogs. \n\nrecognize people is good to. especially different people and offering guesses for picture of the same person and categorizing it. \n\ni know i can accomplish this if i spend enough time to teach a matrix how to do it with lots of samples to start off with but i am hoping someone has already done so and perfected it.  \n\nprimarily i work on a mac and mostly use capture or. and photoshop. photo mechanic also for some jobs. i have lightroom as well.   if i can do it in one of them great. \n\nif i need to buy something else that is fine (dependent on cost). \n\nit would be important that this -----> tags !!!  the meta information of the photos in some ways so it is easy to use inside captureone or lightroom afterwards.", "sortedWord": "None", "identifyer": 81238, "year": "2020"}, {"Unnamed: 0": 79152, "autor": "NoeticIntelligence", "date": 1594584462000, "content": "Is there a photo management program that can detect all dog pictures? /!/ I am looking for software that can go through about 12000 photos and categorize. \n\nI want it to pick out all dog pictures and preferably recognize different dogs. \n\nRecognize people is good to. Especially different people and offering guesses for picture of the same person and categorizing it. \n\nI know I can accomplish this if I spend enough time to teach a matrix how to do it with lots of samples to start off with but I am hoping someone has already done so and perfected it.  \n\nPrimarily I work on a Mac and mostly use capture or. And photoshop. Photo mechanic also for some jobs. I have Lightroom as well.   If I can do it in one of them great. \n\nIf I need to buy something else that is fine (dependent on cost). \n\nIt would be important that this tags the meta information of the photos in some ways so it is easy to use inside CaptureOne or Lightroom afterwards.", "link": "https://www.reddit.com/r/photography/comments/hq11o6/is_there_a_photo_management_program_that_can/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "is there a photo management program that can detect all dog pictures? /!/ i am looking for software that can go through about 12000 photos and categorize. \n\ni want it to pick out all dog pictures and preferably recognize different dogs. \n\nrecognize people is good to. especially different people and offering guesses for picture of the same person and categorizing it. \n\ni know i can accomplish this if i spend enough time to teach a matrix how to do it with lots of samples to start off with but i am hoping someone has already done so and perfected it.  \n\nprimarily i work on a mac and mostly use capture or. and photoshop. photo mechanic also for some jobs. i have lightroom as well.   if i can do it in one of them great. \n\nif i need to buy something else that is fine (dependent on cost). \n\nit would be important that this -----> tags !!!  the meta information of the photos in some ways so it is easy to use inside captureone or lightroom afterwards.", "sortedWord": "None", "identifyer": 81257, "year": "2020"}, {"Unnamed: 0": 79662, "autor": "photoexperts", "date": 1597173562000, "content": "Graphic 45 Tag Album, Regular, Black", "link": "https://www.reddit.com/r/photography/comments/i7y4pk/graphic_45_tag_album_regular_black/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "graphic 45 -----> tag !!!  album, regular, black", "sortedWord": "None", "identifyer": 81781, "year": "2020"}, {"Unnamed: 0": 80991, "autor": "IamMorphNZ", "date": 1599426515000, "content": "Shiny anodized aluminum pet tags. /!/ Hey all,  Amature here... I've been trying for the past two weeks to find a way to take photos of laser pet tags I made for my store. I've tried a lightbox, natural light, different angles, warm &amp; cool light with no luck. It's either shiny on one side of the tag and dark on the other or completely dark on the wrong angle. \n\nDoes anyone have any tricks or tips that may overcome this? Thanks all.", "link": "https://www.reddit.com/r/photography/comments/inu1aj/shiny_anodized_aluminum_pet_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "shiny anodized aluminum pet -----> tags !!! . /!/ hey all,  amature here... i've been trying for the past two weeks to find a way to take photos of laser pet tags i made for my store. i've tried a lightbox, natural light, different angles, warm &amp; cool light with no luck. it's either shiny on one side of the tag and dark on the other or completely dark on the wrong angle. \n\ndoes anyone have any tricks or tips that may overcome this? thanks all.", "sortedWord": "None", "identifyer": 83160, "year": "2020"}, {"Unnamed: 0": 81825, "autor": "mediocre-madman", "date": 1602527931000, "content": "The subreddit doesn’t have good question regulation /!/ I keep on seeing posts asking specific questions that stay up even though they should be in questions thread. My posts keep on getting taken down even though I’m looking for a discussion and tagging them as such. This rule is obviously either not clear or not well moderated.", "link": "https://www.reddit.com/r/photography/comments/j9wp7w/the_subreddit_doesnt_have_good_question_regulation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "the subreddit doesn’t have good question regulation /!/ i keep on seeing posts asking specific questions that stay up even though they should be in questions thread. my posts keep on getting taken down even though i’m looking for a discussion and -----> tagging !!!  them as such. this rule is obviously either not clear or not well moderated.", "sortedWord": "None", "identifyer": 84030, "year": "2020"}, {"Unnamed: 0": 81979, "autor": "unwoundnegative", "date": 1606198263000, "content": "2020 Black Friday Sales: Part Two /!/ The first Black Friday post has descended back a few pages, so we’re going to do part two!\n\n[Here’s the first Black Friday 2020 post.](https://www.reddit.com/r/photography/comments/jvx5qy/2020_black_friday_sales/)\n\n**If you see a sale that would be of interest to our readers, please post a comment here!**\n\nOur Automod spam filter is very efficient, please remove any referral tags or shortlinks from your posts, or Automod will eat your post.\n___\nIf you have questions about what to buy, don't post here but rather in our stickied Question Thread.\n___\nWondering what you should buy?\n\n[What should I keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3F)\n\n___\n**[This year's on-going Gift Suggestion Megathread](https://redd.it/jv94s1)**", "link": "https://www.reddit.com/r/photography/comments/jzzk8j/2020_black_friday_sales_part_two/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "2020 black friday sales: part two /!/ the first black friday post has descended back a few pages, so we’re going to do part two!\n\n[here’s the first black friday 2020 post.](https://www.reddit.com/r/photography/comments/jvx5qy/2020_black_friday_sales/)\n\n**if you see a sale that would be of interest to our readers, please post a comment here!**\n\nour automod spam filter is very efficient, please remove any referral -----> tags !!!  or shortlinks from your posts, or automod will eat your post.\n___\nif you have questions about what to buy, don't post here but rather in our stickied question thread.\n___\nwondering what you should buy?\n\n[what should i keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3f)\n\n___\n**[this year's on-going gift suggestion megathread](https://redd.it/jv94s1)**", "sortedWord": "None", "identifyer": 84193, "year": "2020"}, {"Unnamed: 0": 81980, "autor": "unwoundnegative", "date": 1606198208000, "content": "292 Black Friday Sales: Part Two /!/ The first Black Friday post has descended back a few pages, so we’re going to do part two!\n\n[Here’s the first Black Friday 2020 post.](https://www.reddit.com/r/photography/comments/jvx5qy/2020_black_friday_sales/)\n\n**If you see a sale that would be of interest to our readers, please post a comment here!**\n\nOur Automod spam filter is very efficient, please remove any referral tags or shortlinks from your posts, or Automod will eat your post.\n___\nIf you have questions about what to buy, don't post here but rather in our stickied Question Thread.\n___\nWondering what you should buy?\n\n[What should I keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3F)\n\n___\n**[This year's on-going Gift Suggestion Megathread](https://redd.it/jv94s1)**", "link": "https://www.reddit.com/r/photography/comments/jzzjsg/292_black_friday_sales_part_two/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "292 black friday sales: part two /!/ the first black friday post has descended back a few pages, so we’re going to do part two!\n\n[here’s the first black friday 2020 post.](https://www.reddit.com/r/photography/comments/jvx5qy/2020_black_friday_sales/)\n\n**if you see a sale that would be of interest to our readers, please post a comment here!**\n\nour automod spam filter is very efficient, please remove any referral -----> tags !!!  or shortlinks from your posts, or automod will eat your post.\n___\nif you have questions about what to buy, don't post here but rather in our stickied question thread.\n___\nwondering what you should buy?\n\n[what should i keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3f)\n\n___\n**[this year's on-going gift suggestion megathread](https://redd.it/jv94s1)**", "sortedWord": "None", "identifyer": 84194, "year": "2020"}, {"Unnamed: 0": 82103, "autor": "okcstreetwear", "date": 1606267781000, "content": "Your shitty editing makes MY work look bad. /!/ I am a fairly amateur photographer. I’m not the best, and I’m not the worst. That being said, my friends own a sneaker store and wanted me to shoot a special sale day for them. They pulled out all the stops, food, drinks, discounts, exclusive merch, etc. I said what the hell I need the practice and so I told them I’d do it. There was no form of payment involved whatsoever, I even bought my own tee shirt. This is not the issue. I shot the sale, EDITED the pics and sent them their way as they requested.\n\nA few days later, they post them to their stores Instagram and tag me. I hop on to see which ones they picked out of the 80 I sent and low and behold they edited the pictures ON TOP OF MY EDITS. This would be fine if it was a touch up on exposure or maybe a little more vignetting but no they butchered my pictures. This wouldn’t be a huge deal if they didn’t look so blatantly over edited. They don’t even look close to my original pictures. So now anyone who sees those pictures on their Instagram will associated these nuked photos with me. This is not a reflection of my work at all! It makes me look like an idiot who doesn’t know what he’s doing when in reality they took my -0.30 exposure adjustment and turned it to +3.00. I am beyond irritated that people will see these pictures and associate their shittiness with me.\n\nI’m sorry this sounds long and spoiled but I’m beyond frustrated that my work looks like something from r/nukedmemes\n\nThank you to any who read.", "link": "https://www.reddit.com/r/photography/comments/k0idyk/your_shitty_editing_makes_my_work_look_bad/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "your shitty editing makes my work look bad. /!/ i am a fairly amateur photographer. i’m not the best, and i’m not the worst. that being said, my friends own a sneaker store and wanted me to shoot a special sale day for them. they pulled out all the stops, food, drinks, discounts, exclusive merch, etc. i said what the hell i need the practice and so i told them i’d do it. there was no form of payment involved whatsoever, i even bought my own tee shirt. this is not the issue. i shot the sale, edited the pics and sent them their way as they requested.\n\na few days later, they post them to their stores instagram and -----> tag !!!  me. i hop on to see which ones they picked out of the 80 i sent and low and behold they edited the pictures on top of my edits. this would be fine if it was a touch up on exposure or maybe a little more vignetting but no they butchered my pictures. this wouldn’t be a huge deal if they didn’t look so blatantly over edited. they don’t even look close to my original pictures. so now anyone who sees those pictures on their instagram will associated these nuked photos with me. this is not a reflection of my work at all! it makes me look like an idiot who doesn’t know what he’s doing when in reality they took my -0.30 exposure adjustment and turned it to +3.00. i am beyond irritated that people will see these pictures and associate their shittiness with me.\n\ni’m sorry this sounds long and spoiled but i’m beyond frustrated that my work looks like something from r/nukedmemes\n\nthank you to any who read.", "sortedWord": "None", "identifyer": 84329, "year": "2020"}, {"Unnamed: 0": 82123, "autor": "guessimfine", "date": 1601456823000, "content": "For the film photographers out there, Filmtober! Anyone keen for a challenge? /!/ Inspired by Inktober and after chatting with the folks over at r/AnalogCommunity, I'm starting a wee creative challenge for film photographers called Filmtober! It's purely a community initiative, to get us out there taking photos more and celebrating film and analog photography when most of us run on digital.\n\nI'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **Take and post a photo every day —** Take a photo every day during October, and post a photo taken during the last 2 weeks. That means during the first half of October you can use photos you took in September. *Half marathon option:* Take and post a photo every 2nd day, using photos from the last month.\n* **Tag and share —** Obviously you can post them here or r/analog, but if you're posting to IG or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. \n* **Use themes for inspo —** I've come up with some weekly(ish) themes for inspiration, outlined below. Don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge.\n\nAnd there's only one rule — photos must be taken on film. All formats are fair game, as long as it's analog.\n\n**Themes**\n\n* Light (1st - 11th Oct)\n* People (12th - 18th Oct)\n* Minimalism (19th - 25th Oct)\n* Open theme (26th - 31st Oct)\n\nThat's it! Let me know what you think, and if you're keen to play along. This is a last minute passion project, but hey it's never too late to take on a creative challenge. I'll definitely be doing it in any case.\n\nI'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0ekgu0h39q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=be80bd8bb5080bffdd72c558b3bce1cae81d6947", "link": "https://www.reddit.com/r/photography/comments/j2ipq4/for_the_film_photographers_out_there_filmtober/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "for the film photographers out there, filmtober! anyone keen for a challenge? /!/ inspired by inktober and after chatting with the folks over at r/analogcommunity, i'm starting a wee creative challenge for film photographers called filmtober! it's purely a community initiative, to get us out there taking photos more and celebrating film and analog photography when most of us run on digital.\n\ni'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **take and post a photo every day —** take a photo every day during october, and post a photo taken during the last 2 weeks. that means during the first half of october you can use photos you took in september. *half marathon option:* take and post a photo every 2nd day, using photos from the last month.\n* **-----> tag !!!  and share —** obviously you can post them here or r/analog, but if you're posting to ig or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. \n* **use themes for inspo —** i've come up with some weekly(ish) themes for inspiration, outlined below. don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge.\n\nand there's only one rule — photos must be taken on film. all formats are fair game, as long as it's analog.\n\n**themes**\n\n* light (1st - 11th oct)\n* people (12th - 18th oct)\n* minimalism (19th - 25th oct)\n* open theme (26th - 31st oct)\n\nthat's it! let me know what you think, and if you're keen to play along. this is a last minute passion project, but hey it's never too late to take on a creative challenge. i'll definitely be doing it in any case.\n\ni'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y0ekgu0h39q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=be80bd8bb5080bffdd72c558b3bce1cae81d6947", "sortedWord": "None", "identifyer": 84350, "year": "2020"}, {"Unnamed: 0": 82949, "autor": "ReminiscentSnake", "date": 1607828331000, "content": "service to inventory/ digitalize photos /!/ I have just come into possession of my grandfather's photo (and video) collection. He was a big hobbyist and photography was one of his hobbies. He has taken photos nearly every day since he obtained a camera. I would estimate he has close to 1 million physical photos. I am trying to see if there's some sort of cloud service that allows you to keep track of photos with reference tags (such as IMG-468282029) and include location information and dates. Also a feature such as how google photos allows you to search \"dog\" and photos of dogs come up would be helpful. I don't have a price range but I'd be willing to pay for something like this. Is there any good service for this?", "link": "https://www.reddit.com/r/photography/comments/kc2uxk/service_to_inventory_digitalize_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "service to inventory/ digitalize photos /!/ i have just come into possession of my grandfather's photo (and video) collection. he was a big hobbyist and photography was one of his hobbies. he has taken photos nearly every day since he obtained a camera. i would estimate he has close to 1 million physical photos. i am trying to see if there's some sort of cloud service that allows you to keep track of photos with reference -----> tags !!!  (such as img-468282029) and include location information and dates. also a feature such as how google photos allows you to search \"dog\" and photos of dogs come up would be helpful. i don't have a price range but i'd be willing to pay for something like this. is there any good service for this?", "sortedWord": "None", "identifyer": 85208, "year": "2020"}, {"Unnamed: 0": 83105, "autor": "ddisbetterthankk", "date": 1607717350000, "content": "NOT the average condensation question /!/ Guten Tag r/photography,\n\nPlease bear with me because this isn't a \"Camera go cold to hot, durrr why it wet\" question. I know my way around a camera and how to shoot solid long exposures and star trails, but I'm facing something that I've never encountered and need advice from someone with more experience. I have already looked through the internet and this and other subreddits but the answer does not seem to be anywhere. Thanks in advance for your time.\n\nI typically shoot in tropical temperatures and don't need to worry about condensation, and for two nights now I've had the opportunity to get some star trails in what is typically a disappointing Bortle 4 as almost a Bortle 3. The issue, presumably, is that it's a bit chilly out.\n\n\\--\n\n\\-Sony A6000, Samyang 12mm f/2\n\n\\-**First night**\\--ISO 250, 15s exposures for \\~4hrs (f/2.8), temperature is low 40s degrees fahrenheit (6-8 degrees celsius), humidity isn't bad. A bit of moisture developed on the front center of the lens and ruined the second half of the shoot. Totally understandable, as the sensor is presumably getting warm and the low 40s is pushing its operating parameters. So...\n\n\\-**Second night**\\--ISO 320, 13s exposures for \\~4hrs (f/4), BUT the temperature is up to around 50 degrees fahrenheit (9-11 degrees celsius) now, though humidity is 100%. Here I was surprised to find moisture on the center of the lens again, and even some on the side. I was even able to quickly clean the lens during the shot without messing it up, which I did every 100 frames or so, but in reviewing the images I'm seeing that the smudge would form sometimes after only a couple of minutes afterward.\n\n**My question--** Is 50 degrees fahrenheit *really* too cold for this??\n\nOn both nights, the first moisture would not form for at least an hour and a half, so I was thinking that would preclude humidity as the cause.", "link": "https://www.reddit.com/r/photography/comments/kba94h/not_the_average_condensation_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "not the average condensation question /!/ guten -----> tag !!!  r/photography,\n\nplease bear with me because this isn't a \"camera go cold to hot, durrr why it wet\" question. i know my way around a camera and how to shoot solid long exposures and star trails, but i'm facing something that i've never encountered and need advice from someone with more experience. i have already looked through the internet and this and other subreddits but the answer does not seem to be anywhere. thanks in advance for your time.\n\ni typically shoot in tropical temperatures and don't need to worry about condensation, and for two nights now i've had the opportunity to get some star trails in what is typically a disappointing bortle 4 as almost a bortle 3. the issue, presumably, is that it's a bit chilly out.\n\n\\--\n\n\\-sony a6000, samyang 12mm f/2\n\n\\-**first night**\\--iso 250, 15s exposures for \\~4hrs (f/2.8), temperature is low 40s degrees fahrenheit (6-8 degrees celsius), humidity isn't bad. a bit of moisture developed on the front center of the lens and ruined the second half of the shoot. totally understandable, as the sensor is presumably getting warm and the low 40s is pushing its operating parameters. so...\n\n\\-**second night**\\--iso 320, 13s exposures for \\~4hrs (f/4), but the temperature is up to around 50 degrees fahrenheit (9-11 degrees celsius) now, though humidity is 100%. here i was surprised to find moisture on the center of the lens again, and even some on the side. i was even able to quickly clean the lens during the shot without messing it up, which i did every 100 frames or so, but in reviewing the images i'm seeing that the smudge would form sometimes after only a couple of minutes afterward.\n\n**my question--** is 50 degrees fahrenheit *really* too cold for this??\n\non both nights, the first moisture would not form for at least an hour and a half, so i was thinking that would preclude humidity as the cause.", "sortedWord": "None", "identifyer": 85372, "year": "2020"}, {"Unnamed: 0": 83483, "autor": "nature_film", "date": 1608117464000, "content": "Image Usage Help /!/ Hey all! \n\nA mid-sized (150m/yr) company in the outdoor industry I would like to work with in the future reached out to me about using an image I posted to social media. This image was a passion project and featured their product, though it was not the sole focus. I tagged them in the image to get their attention.\n\nThey commented on the image asking to share it on socials, which I of course agreed to. \n\nThey then DM’d me and said:\n\n“Hi ___, thank you so much for allowing us to repost your image! We would also love to print it in our internal catalog, is this something you would be okay with?” \n\nI am a professional in the industry and while I allow spec work to be shared for free on social media, I do not feel it should be used for any further ad or print usage without a licensing fee or contract. \n\nI want to use this first exposure/communications to leverage a relationship that will lead to paid projects and not burn a bridge by immediately asking for money for this one image. \n\nHow should I go about this? Ask for an email to further lay out the usage rights? Say “sure” and move on?", "link": "https://www.reddit.com/r/photography/comments/ke7f5e/image_usage_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "image usage help /!/ hey all! \n\na mid-sized (150m/yr) company in the outdoor industry i would like to work with in the future reached out to me about using an image i posted to social media. this image was a passion project and featured their product, though it was not the sole focus. i -----> tagged !!!  them in the image to get their attention.\n\nthey commented on the image asking to share it on socials, which i of course agreed to. \n\nthey then dm’d me and said:\n\n“hi ___, thank you so much for allowing us to repost your image! we would also love to print it in our internal catalog, is this something you would be okay with?” \n\ni am a professional in the industry and while i allow spec work to be shared for free on social media, i do not feel it should be used for any further ad or print usage without a licensing fee or contract. \n\ni want to use this first exposure/communications to leverage a relationship that will lead to paid projects and not burn a bridge by immediately asking for money for this one image. \n\nhow should i go about this? ask for an email to further lay out the usage rights? say “sure” and move on?", "sortedWord": "None", "identifyer": 85777, "year": "2020"}, {"Unnamed: 0": 84321, "autor": "unwoundnegative", "date": 1605634066000, "content": "2020 Black Friday Sales /!/ It's almost that time of year again, soon we'll be buried in Black Friday sale postings. As usual we'll consolidate these sale postings into this thread.\n\n**If you see a sale that would be of interest to our readers, please post a comment here!**\n\nOur Automod spam filter is very efficient, please remove any referral tags or shortlinks from your posts, or Automod will eat your post.\n___\nIf you have questions about what to buy, don't post here but rather in our stickied Question Thread.\n___\nWondering what you should buy?\n\n[What should I keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3F)\n\n___\n**[This year's on-going Gift Suggestion Megathread](https://redd.it/jv94s1)**", "link": "https://www.reddit.com/r/photography/comments/jvx5qy/2020_black_friday_sales/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "2020 black friday sales /!/ it's almost that time of year again, soon we'll be buried in black friday sale postings. as usual we'll consolidate these sale postings into this thread.\n\n**if you see a sale that would be of interest to our readers, please post a comment here!**\n\nour automod spam filter is very efficient, please remove any referral -----> tags !!!  or shortlinks from your posts, or automod will eat your post.\n___\nif you have questions about what to buy, don't post here but rather in our stickied question thread.\n___\nwondering what you should buy?\n\n[what should i keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3f)\n\n___\n**[this year's on-going gift suggestion megathread](https://redd.it/jv94s1)**", "sortedWord": "None", "identifyer": 86639, "year": "2020"}, {"Unnamed: 0": 84487, "autor": "rodfantana", "date": 1605664713000, "content": "Looking for software to tag photos in a large family photo collection. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/jw6thl/looking_for_software_to_tag_photos_in_a_large/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for software to -----> tag !!!  photos in a large family photo collection. /!/ [removed]", "sortedWord": "None", "identifyer": 86815, "year": "2020"}, {"Unnamed: 0": 85515, "autor": "fhurfah", "date": 1578848725000, "content": "Photos you post vs get tagged in", "link": "https://www.reddit.com/r/photography/comments/enq0rg/photos_you_post_vs_get_tagged_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "photos you post vs get -----> tagged !!!  in", "sortedWord": "None", "identifyer": 87881, "year": "2020"}, {"Unnamed: 0": 85539, "autor": "Syscrush", "date": 1578938003000, "content": "My experience looking for an online photo storage solution that meets my very simple requirements... /!/ Hey all. I'm sure that this is an oft-discussed issue - I worry that this is the equivalent to starting an oil thread on a motorcycle forum... But I also think that I can't be the only person stuck on this.\n\nFor context, I'm strictly a hobby photographer, and will stay that way. All of the photos I take and share are related to friends &amp; family, or my hobbies.\n\nI use Backblaze for online backup of my raw images, Lightroom catalog, and exported post-processed images, so this isn't really about backup. I also use a combination of Google Photos, Flickr, and Facebook to share those post-processed images. It basically breaks down to: Facebook for sharing stuff of my family &amp; friends where it's appropriate; Google Photos to share stuff with very specific people (like photos of my kids with friends' kids on a playdate - I'll send an album link to a Google Photos album to the parents but not post their kids on FB); and Flickr for hobby-related stuff that I want to easily share on online forums (I like the BBCode and multiple-sizes support built in to Flickr).\n\nBut I'd like to have a single point of access for review and sharing of everything I've completed processing &amp; exported.\n\nWhat I'd really like to do seems simple:\n\n1. Automatically upload everything in my top-level Exports folder to online storage that's accessible by Web and mobile app. By default those photos should not be visible to the public. Google Backup &amp; Sync and the Flickr Uploadr both do this (although I've had infuriating unexplained failures with Flickr Uploadr).\n2. Maintain the information from the folder structure within that Exports folder (like tags or albums). Flickr does this, Google Photos (amazingly) does not.\n3. Integrate with Chromecast and Apple TV for showing photos from a given album or tag in a slideshow *from my Android device*. Google Photos works very well with Chromecast, and apparently has some absolute shit screen mirroring support for Apple TV. Flickr just ignores this basic feature, it's been languishing on a wishlist for years now. Chromecast is more important than Apple TV, because that's what my Mom and I both use, but my godson's parents use Apple TV, so it would be nice to have a solution for that, too.\n\nI don't mind paying for a solution to this. It is absolutely shocking to me that Google just totally discards the folder info when uploading, and equally surprising that Flickr can't cast slideshows. These three requirements seem so basic as to be effectively universal.\n\nHunting around a bit, I found that SmugMug has the notion of folders, and the 3rd-party PicBackMan will do auto-upload to SmugMug (and other services) and preserve the folder structure from the source, and make those backed-up folders private by default. So, that covers items 1 and 2. I'm not clear about 3. My attempts to find out about the features of the SmugMug Android app have been kind of depressing.\n\nCan the SmugMug Android app cast to a Chromecast device? Can it make a slideshow from a selected folder? If so, that might be my choice.\n\nDoes anyone have an automated solution that covers the above 3 requirements? What do you use and how do you use it?", "link": "https://www.reddit.com/r/photography/comments/eo7l31/my_experience_looking_for_an_online_photo_storage/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "my experience looking for an online photo storage solution that meets my very simple requirements... /!/ hey all. i'm sure that this is an oft-discussed issue - i worry that this is the equivalent to starting an oil thread on a motorcycle forum... but i also think that i can't be the only person stuck on this.\n\nfor context, i'm strictly a hobby photographer, and will stay that way. all of the photos i take and share are related to friends &amp; family, or my hobbies.\n\ni use backblaze for online backup of my raw images, lightroom catalog, and exported post-processed images, so this isn't really about backup. i also use a combination of google photos, flickr, and facebook to share those post-processed images. it basically breaks down to: facebook for sharing stuff of my family &amp; friends where it's appropriate; google photos to share stuff with very specific people (like photos of my kids with friends' kids on a playdate - i'll send an album link to a google photos album to the parents but not post their kids on fb); and flickr for hobby-related stuff that i want to easily share on online forums (i like the bbcode and multiple-sizes support built in to flickr).\n\nbut i'd like to have a single point of access for review and sharing of everything i've completed processing &amp; exported.\n\nwhat i'd really like to do seems simple:\n\n1. automatically upload everything in my top-level exports folder to online storage that's accessible by web and mobile app. by default those photos should not be visible to the public. google backup &amp; sync and the flickr uploadr both do this (although i've had infuriating unexplained failures with flickr uploadr).\n2. maintain the information from the folder structure within that exports folder (like -----> tags !!!  or albums). flickr does this, google photos (amazingly) does not.\n3. integrate with chromecast and apple tv for showing photos from a given album or tag in a slideshow *from my android device*. google photos works very well with chromecast, and apparently has some absolute shit screen mirroring support for apple tv. flickr just ignores this basic feature, it's been languishing on a wishlist for years now. chromecast is more important than apple tv, because that's what my mom and i both use, but my godson's parents use apple tv, so it would be nice to have a solution for that, too.\n\ni don't mind paying for a solution to this. it is absolutely shocking to me that google just totally discards the folder info when uploading, and equally surprising that flickr can't cast slideshows. these three requirements seem so basic as to be effectively universal.\n\nhunting around a bit, i found that smugmug has the notion of folders, and the 3rd-party picbackman will do auto-upload to smugmug (and other services) and preserve the folder structure from the source, and make those backed-up folders private by default. so, that covers items 1 and 2. i'm not clear about 3. my attempts to find out about the features of the smugmug android app have been kind of depressing.\n\ncan the smugmug android app cast to a chromecast device? can it make a slideshow from a selected folder? if so, that might be my choice.\n\ndoes anyone have an automated solution that covers the above 3 requirements? what do you use and how do you use it?", "sortedWord": "None", "identifyer": 87906, "year": "2020"}, {"Unnamed: 0": 86744, "autor": "headbanginhersh", "date": 1596759910000, "content": "Some help with Pricing pics for a band please... /!/ So unfortunately a huge setback to this damn pandemic is the lack of concerts. Before the pandemic, I was going to any and every show I could at local venues that were ok with DSLR's, working on my concert photography (yeah, I know there isn't much money in Concert Photography nowadays but thats besides the point).\n\nLast night I was contacted by a small band whom I had taken pictures of at a show last year (I've included a screenshot of what they sent since I feel the wording is important). \n\nThey're a small band from out of state. 6000 followers on Facebook. 1000 on Instagram. They got wind of my pictures because I tagged them when I shared them online. \n\nThey want to buy my photos to use for promotional purposes. They say they want to buy the rights buuuuut I'm not going to do that. Lol. They can buy a license to use my photos but no, I'm not selling and handing over the copyright. \n\nMy question: What is a fair price to charge an up and coming band who wants to use photos you took, watermark removed, for promotional purposes? \n\nThey obviously aren't a band signed to a big label or anything like that but since they first mentioned it, I dont want to let a business opportunity slip. \n\nIf I'm asking for suggestions and help its kind of obvious Business is not my strong point. I've sold individual prints (non concert) I've taken but a band wanting to buy my images for promotional use? Thats a first for me. \n\nANY help is appreciated. \n\nI blocked out the bands name just to keep this strictly Business related. They've seen 9 of the photos I took at the show which I shared online but in reality I have another 10 \"great' shots. \n\nWhat's the best way around this? Sell them all the shots? Let them pick and chose individual shots? Price suggestions?\n\nPhoto Request https://imgur.com/gallery/8Ct7sQP", "link": "https://www.reddit.com/r/photography/comments/i53pu0/some_help_with_pricing_pics_for_a_band_please/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "some help with pricing pics for a band please... /!/ so unfortunately a huge setback to this damn pandemic is the lack of concerts. before the pandemic, i was going to any and every show i could at local venues that were ok with dslr's, working on my concert photography (yeah, i know there isn't much money in concert photography nowadays but thats besides the point).\n\nlast night i was contacted by a small band whom i had taken pictures of at a show last year (i've included a screenshot of what they sent since i feel the wording is important). \n\nthey're a small band from out of state. 6000 followers on facebook. 1000 on instagram. they got wind of my pictures because i -----> tagged !!!  them when i shared them online. \n\nthey want to buy my photos to use for promotional purposes. they say they want to buy the rights buuuuut i'm not going to do that. lol. they can buy a license to use my photos but no, i'm not selling and handing over the copyright. \n\nmy question: what is a fair price to charge an up and coming band who wants to use photos you took, watermark removed, for promotional purposes? \n\nthey obviously aren't a band signed to a big label or anything like that but since they first mentioned it, i dont want to let a business opportunity slip. \n\nif i'm asking for suggestions and help its kind of obvious business is not my strong point. i've sold individual prints (non concert) i've taken but a band wanting to buy my images for promotional use? thats a first for me. \n\nany help is appreciated. \n\ni blocked out the bands name just to keep this strictly business related. they've seen 9 of the photos i took at the show which i shared online but in reality i have another 10 \"great' shots. \n\nwhat's the best way around this? sell them all the shots? let them pick and chose individual shots? price suggestions?\n\nphoto request https://imgur.com/gallery/8ct7sqp", "sortedWord": "None", "identifyer": 89157, "year": "2020"}, {"Unnamed: 0": 87025, "autor": "AlaskanOverlord", "date": 1597789879000, "content": "Looking for small/ new \"magazines\" on instagram to submit photos to /!/ Most of the magazine tags I use are for mags that have over 5,000 followers and sometimes hundreds of thousands of tagged photos on the hashtag. I don't feel that it is likely that I will get featured by any of these.  I'm looking for small magazines with &lt;1000 tagged photos who might actually see the photos I tag them on. Anyone have any good ones? \n\nTwo that I have found today are  @ 514mag and @ Darkshine mag. I'm looking for more like this!", "link": "https://www.reddit.com/r/photography/comments/icbb69/looking_for_small_new_magazines_on_instagram_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "looking for small/ new \"magazines\" on instagram to submit photos to /!/ most of the magazine -----> tags !!!  i use are for mags that have over 5,000 followers and sometimes hundreds of thousands of tagged photos on the hashtag. i don't feel that it is likely that i will get featured by any of these.  i'm looking for small magazines with &lt;1000 tagged photos who might actually see the photos i tag them on. anyone have any good ones? \n\ntwo that i have found today are  @ 514mag and @ darkshine mag. i'm looking for more like this!", "sortedWord": "None", "identifyer": 89445, "year": "2020"}, {"Unnamed: 0": 87378, "autor": "rebeccazone", "date": 1599862572000, "content": "I didn't tag my friend in a photo they took of me and they got mad /!/ I posted a good photo of me and some artwork I made on Instagram and my friend who considers herself a \"great photographer\" but is also amateur got really mad that I didn't tag her and credit her.\n\n&amp;#x200B;\n\nThoughts?", "link": "https://www.reddit.com/r/photography/comments/ir0j4b/i_didnt_tag_my_friend_in_a_photo_they_took_of_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i didn't -----> tag !!!  my friend in a photo they took of me and they got mad /!/ i posted a good photo of me and some artwork i made on instagram and my friend who considers herself a \"great photographer\" but is also amateur got really mad that i didn't tag her and credit her.\n\n&amp;#x200b;\n\nthoughts?", "sortedWord": "None", "identifyer": 89812, "year": "2020"}, {"Unnamed: 0": 87787, "autor": "unituned", "date": 1606172299000, "content": "Photographer uploaded our photos for public download, and posted on social media without our consent. Is this a common practice as photographers? /!/ So last month my fiancee and I decided to hire a well known photographer to shoot our engagement photos. All went well during the photoshoot, and we really enjoyed it. \n\nJust this past weekend we were sent the photos, and wanted to wait a few weeks before sharing, but for unknown reasons a few makeup artist that my fiancee worked with had already posted and tagged the photos of our engagement on social media without our consent. We had no idea how they got the photos until we realized that our photos were uploaded publically for all to see and download.\n\nI was pretty pissed at the fact that we paid the photographer to shoot and to have these photos available to download publically. We already contacted the photographer about this and we're still waiting for the changes to appear. I dont know if we're blowing this out of proportion, but I just find it a bit strange, lazy, and unprofessional.", "link": "https://www.reddit.com/r/photography/comments/jzsodu/photographer_uploaded_our_photos_for_public/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "photographer uploaded our photos for public download, and posted on social media without our consent. is this a common practice as photographers? /!/ so last month my fiancee and i decided to hire a well known photographer to shoot our engagement photos. all went well during the photoshoot, and we really enjoyed it. \n\njust this past weekend we were sent the photos, and wanted to wait a few weeks before sharing, but for unknown reasons a few makeup artist that my fiancee worked with had already posted and -----> tagged !!!  the photos of our engagement on social media without our consent. we had no idea how they got the photos until we realized that our photos were uploaded publically for all to see and download.\n\ni was pretty pissed at the fact that we paid the photographer to shoot and to have these photos available to download publically. we already contacted the photographer about this and we're still waiting for the changes to appear. i dont know if we're blowing this out of proportion, but i just find it a bit strange, lazy, and unprofessional.", "sortedWord": "None", "identifyer": 90232, "year": "2020"}, {"Unnamed: 0": 88119, "autor": "SomeCallMeMrBean", "date": 1608805208000, "content": "Darktable 3.4 has been released! /!/ As the title suggests, the Christmas edition of the free and open source Darktable raw organizing and editing software has been released. Visit [the github repository](https://github.com/darktable-org/darktable/releases/tag/release-3.4.0) for downloading. The downloadlink at darktable.org is still the older version at this moment. A nice Christmas gift from the developers of Darktable!", "link": "https://www.reddit.com/r/photography/comments/kjd3qz/darktable_34_has_been_released/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "darktable 3.4 has been released! /!/ as the title suggests, the christmas edition of the free and open source darktable raw organizing and editing software has been released. visit [the github repository](https://github.com/darktable-org/darktable/releases/-----> tag !!! /release-3.4.0) for downloading. the downloadlink at darktable.org is still the older version at this moment. a nice christmas gift from the developers of darktable!", "sortedWord": "None", "identifyer": 90580, "year": "2020"}], "name": "tagphotography2020"}