{"interestingcomments": [{"autor": "taylakiss", "date": "2020-06-11 06:49:28", "content": "Hey guys, I have to come up with a photo essay idea and I'm having a little trouble finding inspiration, would anyone like to comment ones they've done in the past? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/h0tybq/hey_guys_i_have_to_come_up_with_a_photo_essay/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hey guys, i have to -----> come !!!  -----> up !!!  -----> with !!!  a photo essay idea and i'm having a little trouble finding inspiration, would anyone like to comment ones they've done in the past? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60998, "year": "2020"}, {"autor": "MLellePhotography", "date": "2020-02-13 22:25:42", "content": "Artist slump /!/ Hello, \n\nI am a photographer who was recently accepted into a local gallery! The problem is, they would like me to start coming up with a project idea for a series of works for a show in the fall, and I’m in a creative rut at the moment. How do you find inspiration for projects? Do you have any ideas for projects that you always wanted to see done? Thanks for any and all feedback!", "link": "https://www.reddit.com/r/photography/comments/f3i3m6/artist_slump/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "artist slump /!/ hello, \n\ni am a photographer who was recently accepted into a local gallery! the problem is, they would like me to start -----> coming !!!  -----> up !!!  -----> with !!!  a project idea for a series of works for a show in the fall, and i’m in a creative rut at the moment. how do you find inspiration for projects? do you have any ideas for projects that you always wanted to see done? thanks for any and all feedback!", "sortedWord": "None", "Identifyer": null, "identifyer": 62170, "year": "2020"}, {"autor": "Five10Fiftyfold", "date": "2020-11-02 22:52:16", "content": "I just came up with a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. Thoughts? /!/ Looking at the market there seem to be two approaches, the MASP selection and fuji's dedicated dials each featuring an A option. Both having some advantages as some disadvantages.\n\nThere also 3 distinct setting scenarios.  \n   The full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.   \n   Full manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.   \n   Having most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. This also means that camera would preferably have to control only one parameter at a time.\n\nThe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. So it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nWith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. The answer is simple.   \nInstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. While obviously still retaining the option of full manual and auto.\n\nFuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. You have to rotate the first one from A all the way to the preferred value and then rotate the other all the way to A, which is a slow two step process. As is with the regular mode selection where you had to go from Av with set iso, to Manual with auto iso. \n\nOne real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. In the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. Then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem. \n\nI would like to know your thoughts on that.", "link": "https://www.reddit.com/r/photography/comments/jmya22/i_just_came_up_with_a_better_and_more_logical/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i just -----> came !!!  -----> up !!!  -----> with !!!  a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. thoughts? /!/ looking at the market there seem to be two approaches, the masp selection and fuji's dedicated dials each featuring an a option. both having some advantages as some disadvantages.\n\nthere also 3 distinct setting scenarios.  \n   the full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.   \n   full manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.   \n   having most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. this also means that camera would preferably have to control only one parameter at a time.\n\nthe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. so it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nwith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. the answer is simple.   \ninstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. while obviously still retaining the option of full manual and auto.\n\nfuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. you have to rotate the first one from a all the way to the preferred value and then rotate the other all the way to a, which is a slow two step process. as is with the regular mode selection where you had to go from av with set iso, to manual with auto iso. \n\none real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. in the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem. \n\ni would like to know your thoughts on that.", "sortedWord": "None", "Identifyer": null, "identifyer": 65851, "year": "2020"}, {"autor": "zon03", "date": "2020-11-12 12:35:16", "content": "Island photography, getting creative? /!/ I am going to the Island of Gran Canaria soon, an amazing place that I absolutely fell in love with on my last trip there. The thing is I have already photographed all the most famous spots and am struggling to come up with too many new and creative ideas. \n\nIt is an island full of natural rock pools, secluded beaches, Sahara-like sand dunes and beautiful mountainous landscapes. I photograph mostly landscapes and portraits of my wife, and am not shy to get super creative with things like HDR, long exposures, or even levitation photography, or other fantasy scenes. It will also be a new moon while I am there so am definitely planning to astrophotography.\n\nI know this is a pretty vague request, but does anyone have any suggestions to help inspire me?", "link": "https://www.reddit.com/r/photography/comments/jstun9/island_photography_getting_creative/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "island photography, getting creative? /!/ i am going to the island of gran canaria soon, an amazing place that i absolutely fell in love with on my last trip there. the thing is i have already photographed all the most famous spots and am struggling to -----> come !!!  -----> up !!!  -----> with !!!  too many new and creative ideas. \n\nit is an island full of natural rock pools, secluded beaches, sahara-like sand dunes and beautiful mountainous landscapes. i photograph mostly landscapes and portraits of my wife, and am not shy to get super creative with things like hdr, long exposures, or even levitation photography, or other fantasy scenes. it will also be a new moon while i am there so am definitely planning to astrophotography.\n\ni know this is a pretty vague request, but does anyone have any suggestions to help inspire me?", "sortedWord": "None", "Identifyer": null, "identifyer": 65975, "year": "2020"}, {"autor": "shacker23", "date": "2020-11-21 07:00:11", "content": "Cycling and photography /!/ Not sure whether to post there here in the cycling subreddit, but here goes. I've been a road cyclist for a long time, but had never considered riding with anything but a phone for photography. A while back I got a Fuji X100F and fell in love (and later an X-T3 as well). A while ago I decided take on the extra weight and start riding with the X100F and am loving the results - so great to be in all these beautiful places and not constrained to my phone for pics! \n\nThe dilemma is in figuring out the best way to travel with it. I added a handlebar bag and have been keeping it there for the most part, but that's a pain - every time I see a pic I need to stop, unzip, turn it on, etc. Do-able but not very fluid. Feels awkward compared to whipping a phone out of my jersey pocket.\n\nI've also tried just riding with it on a short neck strap. Looks dorky but I'm old enough to not care :) That feels a bit vulnerable and in-the-way though. It swings, my knees hit it sometimes (could get a shorter strap).\n\nThe other thing I've considered is riding with a light backpack and adding something like the [Peak backpack camera clip](https://www.peakdesign.com/products/capture). But that's mostly designed for cameras with long/heavy lenses, not the light fixed pancake lens  on the X100F. \n\nAnother option would be a bag that hangs from the top tube - but again I'd want something with easy/quick access.\n\nAnyway, I know this is probably a rare question, but thought I'd asked if anyone had done bike touring or longer day rides (50+ miles) with a camera, and if so, what carrying solutions did you come up with? Specific brands or product recommendations welcome.", "link": "https://www.reddit.com/r/photography/comments/jy6ie8/cycling_and_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "cycling and photography /!/ not sure whether to post there here in the cycling subreddit, but here goes. i've been a road cyclist for a long time, but had never considered riding with anything but a phone for photography. a while back i got a fuji x100f and fell in love (and later an x-t3 as well). a while ago i decided take on the extra weight and start riding with the x100f and am loving the results - so great to be in all these beautiful places and not constrained to my phone for pics! \n\nthe dilemma is in figuring out the best way to travel with it. i added a handlebar bag and have been keeping it there for the most part, but that's a pain - every time i see a pic i need to stop, unzip, turn it on, etc. do-able but not very fluid. feels awkward compared to whipping a phone out of my jersey pocket.\n\ni've also tried just riding with it on a short neck strap. looks dorky but i'm old enough to not care :) that feels a bit vulnerable and in-the-way though. it swings, my knees hit it sometimes (could get a shorter strap).\n\nthe other thing i've considered is riding with a light backpack and adding something like the [peak backpack camera clip](https://www.peakdesign.com/products/capture). but that's mostly designed for cameras with long/heavy lenses, not the light fixed pancake lens  on the x100f. \n\nanother option would be a bag that hangs from the top tube - but again i'd want something with easy/quick access.\n\nanyway, i know this is probably a rare question, but thought i'd asked if anyone had done bike touring or longer day rides (50+ miles) -----> with !!!  a camera, and if so, what carrying solutions did you -----> come !!!  -----> up !!!  -----> with !!! ? specific brands or product recommendations welcome.", "sortedWord": "None", "Identifyer": null, "identifyer": 66019, "year": "2020"}, {"autor": "jbuyske", "date": "2020-02-26 21:25:10", "content": "Backdrops /!/ Unanswered (again) question from a previous megathread\n\nAuthor u/jbuyske - (Permalink)\n\nBackdrops Question\n\nI was asked to take pictures for one of the local high school's proms this year, and I was wondering about backdrops.  Basically, it will just be kids who want to capture the moment coming over, I'll snap a few pictures with and without props, and send them the images after editing.  Their theme is \"Paris Nights\" so I am trying to come up with something that wouldn't look too cheesy and also wouldn't break the bank.  There are Paris-themed backdrops you can purchase, but I'm not sure how I feel about that.  I was thinking some LED lighting on a black or gray backdrop would look pretty good, but I'd appreciate any input from the community.", "link": "https://www.reddit.com/r/photography/comments/fa0kdj/backdrops/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "backdrops /!/ unanswered (again) question from a previous megathread\n\nauthor u/jbuyske - (permalink)\n\nbackdrops question\n\ni was asked to take pictures for one of the local high school's proms this year, and i was wondering about backdrops.  basically, it will just be kids who want to capture the moment coming over, i'll snap a few pictures with and without props, and send them the images after editing.  their theme is \"paris nights\" so i am trying to -----> come !!!  -----> up !!!  -----> with !!!  something that wouldn't look too cheesy and also wouldn't break the bank.  there are paris-themed backdrops you can purchase, but i'm not sure how i feel about that.  i was thinking some led lighting on a black or gray backdrop would look pretty good, but i'd appreciate any input from the community.", "sortedWord": "None", "Identifyer": null, "identifyer": 66553, "year": "2020"}, {"autor": "gabbyrenataa", "date": "2020-01-03 13:03:45", "content": "I'm so confused? What a switch. /!/ A photographer agreed to shoot with me he asked me to come up with some ideas and find a stylist so I did. I set up a detailed moodboard and he loved it. I also found a great stylist they both knew each other and when I messaged them separately  they were super responsive. I put them in a group chat to discuss the dates of the shoot and nobody answered. It's frustrating when you set something up and put time into it only to be ignored. I messaged the stylist separately and he says that he is too busy with school even though before he had a lot of availability and then I messaged the photographer and he says something like , \" I'm off good luck \" . Like wtf? I did nothing wrong and everything was fine and to give such a response. I literally did nothing and wasn't badgering them for anything. I know I should get over it but I'm like wtf?how did it go from super enthusiastic to just nothing. Just to add I'm not a bad model, I've shot with many photographers and have been professionally modelling for over 5 years now and I'm very kind hence why this is bothering me a little.\n\nEdit: Thank you so much to all the photographer's /models who messaged me or gave me advice in the comments. Knowing it's a common thing is both reassuring and frustrating. I think it got to me a bit more because I am a sensitive person and  I put a lot of time into it and just expected some polite behaviour back . I appreciate it a lot . Just got to get the fuck over it haha.", "link": "https://www.reddit.com/r/photography/comments/ejf51z/im_so_confused_what_a_switch/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm so confused? what a switch. /!/ a photographer agreed to shoot -----> with !!!  me he asked me to -----> come !!!  -----> up !!!  -----> with !!!  some ideas and find a stylist so i did. i set up a detailed moodboard and he loved it. i also found a great stylist they both knew each other and when i messaged them separately  they were super responsive. i put them in a group chat to discuss the dates of the shoot and nobody answered. it's frustrating when you set something up and put time into it only to be ignored. i messaged the stylist separately and he says that he is too busy with school even though before he had a lot of availability and then i messaged the photographer and he says something like , \" i'm off good luck \" . like wtf? i did nothing wrong and everything was fine and to give such a response. i literally did nothing and wasn't badgering them for anything. i know i should get over it but i'm like wtf?how did it go from super enthusiastic to just nothing. just to add i'm not a bad model, i've shot with many photographers and have been professionally modelling for over 5 years now and i'm very kind hence why this is bothering me a little.\n\nedit: thank you so much to all the photographer's /models who messaged me or gave me advice in the comments. knowing it's a common thing is both reassuring and frustrating. i think it got to me a bit more because i am a sensitive person and  i put a lot of time into it and just expected some polite behaviour back . i appreciate it a lot . just got to get the fuck over it haha.", "sortedWord": "None", "Identifyer": null, "identifyer": 67699, "year": "2020"}, {"autor": "lukdboss", "date": "2020-01-11 18:24:53", "content": "Help needed coming up with a new name for my photography business /!/ In march of last year my business parter started a photography business out of Denver, CO. He takes people on hikes and basically does a photoshoot with them during the hike itself. The name to his business is \"\\*his name\\* photo co.\" We need a new name that includes hiking and photography. For example I thought of High Altitude Photography Co. but that was already taken by someone else in Denver. If you  have any thoughts on the name please drop them below. I'd like to hear what you guys can come up with!", "link": "https://www.reddit.com/r/photography/comments/enb1ra/help_needed_coming_up_with_a_new_name_for_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "help needed -----> coming !!!  -----> up !!!  -----> with !!!  a new name for my photography business /!/ in march of last year my business parter started a photography business out of denver, co. he takes people on hikes and basically does a photoshoot with them during the hike itself. the name to his business is \"\\*his name\\* photo co.\" we need a new name that includes hiking and photography. for example i thought of high altitude photography co. but that was already taken by someone else in denver. if you  have any thoughts on the name please drop them below. i'd like to hear what you guys can come up with!", "sortedWord": "None", "Identifyer": null, "identifyer": 67971, "year": "2020"}, {"autor": "VeprUA", "date": "2020-08-09 15:46:13", "content": "What is everyone using to manage drafts and final versions for the clients? /!/ I ran into a situation where I’d like to send photos to my clients but come up with couple frustrations.\n\n1. Showing draft version of my photos and hoping the client wont just run away with them.\n2. Sending the client final versions with ease. I know email is common, but i think it has a size limits on the attachments. I also used google photos, which was good for me but required the client to get google photos on their phone. Heh which ended up syncing their photos to the cloud and maxing out their cloud storage. 🤦‍♂️ \n\n\nDoes anyone have any good services or platform they can recommend? If so, is there anything that you wish they could better?\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/i6lh5v/what_is_everyone_using_to_manage_drafts_and_final/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what is everyone using to manage drafts and final versions for the clients? /!/ i ran into a situation where i’d like to send photos to my clients but -----> come !!!  -----> up !!!  -----> with !!!  couple frustrations.\n\n1. showing draft version of my photos and hoping the client wont just run away with them.\n2. sending the client final versions with ease. i know email is common, but i think it has a size limits on the attachments. i also used google photos, which was good for me but required the client to get google photos on their phone. heh which ended up syncing their photos to the cloud and maxing out their cloud storage. 🤦‍♂️ \n\n\ndoes anyone have any good services or platform they can recommend? if so, is there anything that you wish they could better?\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 70227, "year": "2020"}, {"autor": "TellurideTeddy", "date": "2020-08-30 00:50:22", "content": "Cloud Workflow Advice - Video + Photos + Multiple Computers + Multiple Locations? /!/ Been struggling with this for years, I'm really wanting to finally come up with a \"best\" solution for my situation.\n\nI split my living time between different locations so I sometimes work for a few months on my Macbook before getting back to my hardcore editing rig. I have photos and videos coming in from Canon DSLRs, underwater camera rigs, iPhones, drones, 3D cameras, all the usual suspects. I also create heavy loads of AI and PSD graphic assets but Creative Cloud storage has mostly solved that for me. \n\nWhat I'm looking for is a Git-like solution where after a shoot I can upload all of my images or videos to the cloud, and then \"check out\" whatever files I'm going to be working on for a while before checking them back in with their most current state. At the moment I really struggle with ensuring that all of my assets are even accessibly from one place and knowing that I'm not at risk of misplacing or forgetting about something, as well as ending up with multiple versions of files and later not knowing which ones are \"current.\"\n\nI've heard there's a way to mount a Google Drive folder to your local machine and then using Adobe Bridge to browse it for both photos and videos, I'm wondering if that might be the ticket. But I'm also hoping there's a more elegant solution out there, sort of a DAM-lite?\n\nAny advice would be greatly appreciated!", "link": "https://www.reddit.com/r/photography/comments/ij3s0s/cloud_workflow_advice_video_photos_multiple/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "cloud workflow advice - video + photos + multiple computers + multiple locations? /!/ been struggling -----> with !!!  this for years, i'm really wanting to finally -----> come !!!  -----> up !!!  -----> with !!!  a \"best\" solution for my situation.\n\ni split my living time between different locations so i sometimes work for a few months on my macbook before getting back to my hardcore editing rig. i have photos and videos coming in from canon dslrs, underwater camera rigs, iphones, drones, 3d cameras, all the usual suspects. i also create heavy loads of ai and psd graphic assets but creative cloud storage has mostly solved that for me. \n\nwhat i'm looking for is a git-like solution where after a shoot i can upload all of my images or videos to the cloud, and then \"check out\" whatever files i'm going to be working on for a while before checking them back in with their most current state. at the moment i really struggle with ensuring that all of my assets are even accessibly from one place and knowing that i'm not at risk of misplacing or forgetting about something, as well as ending up with multiple versions of files and later not knowing which ones are \"current.\"\n\ni've heard there's a way to mount a google drive folder to your local machine and then using adobe bridge to browse it for both photos and videos, i'm wondering if that might be the ticket. but i'm also hoping there's a more elegant solution out there, sort of a dam-lite?\n\nany advice would be greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 71090, "year": "2020"}, {"autor": "LastSonofKunLun", "date": "2020-10-09 17:53:42", "content": "What do you all do for liability insurance? /!/ I'm just starting out, still in process of building a small home studio, so right now location shoots are all that's open to me. Therefore, I need some kind of liability insurance. But the process so far has been impenetrable and I keep getting blocked at every turn.\n\nI spoke to my regular insurance agent, and she suggested a place online. Well, that place and every other place wants my business name... except I'm not a business. I'm just a guy.\n\nThe page my agent suggested, I don't know if their website is faulty, but it kept routing me to a workman's comp insurance. I called her back and let her know, so today she's investigating on her own to see what she can come up with.\n\nI got a call from the place she suggested (she must have submitted a form for a quote) and they wanted to ask a few questions, so I said sure. The second question was, \"Do you use a drone?\" Well, not much, but yes, I do. And that shut down the conversation. They will not insure with a done involved, and even if I somehow got the plan, if the underwriters see any aerial disagree or shots associated with me, they will straight up cancel it. In fact, even if I promise not to use the drone in conjunction with my \"business\" it's now a flat no from this company. The door is closed, do not pass go, the end.\n\nSo, WTF are my options now? Trying to do things the right and honest way, and every path I take keeps getting closed off to me.", "link": "https://www.reddit.com/r/photography/comments/j83sok/what_do_you_all_do_for_liability_insurance/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what do you all do for liability insurance? /!/ i'm just starting out, still in process of building a small home studio, so right now location shoots are all that's open to me. therefore, i need some kind of liability insurance. but the process so far has been impenetrable and i keep getting blocked at every turn.\n\ni spoke to my regular insurance agent, and she suggested a place online. well, that place and every other place wants my business name... except i'm not a business. i'm just a guy.\n\nthe page my agent suggested, i don't know if their website is faulty, but it kept routing me to a workman's comp insurance. i called her back and let her know, so today she's investigating on her own to see what she can -----> come !!!  -----> up !!!  -----> with !!! .\n\ni got a call from the place she suggested (she must have submitted a form for a quote) and they wanted to ask a few questions, so i said sure. the second question was, \"do you use a drone?\" well, not much, but yes, i do. and that shut down the conversation. they will not insure with a done involved, and even if i somehow got the plan, if the underwriters see any aerial disagree or shots associated with me, they will straight up cancel it. in fact, even if i promise not to use the drone in conjunction with my \"business\" it's now a flat no from this company. the door is closed, do not pass go, the end.\n\nso, wtf are my options now? trying to do things the right and honest way, and every path i take keeps getting closed off to me.", "sortedWord": "None", "Identifyer": null, "identifyer": 72356, "year": "2020"}, {"autor": "flyrby", "date": "2020-10-13 21:50:05", "content": "Discussion - finding a particular photo /!/ I'm a writer and I just came up with my newest idea but it's based around an image I saw once and can no longer find, hoping someone here can help! I'm pretty sure it's a photo but I may be mistaken; it's a woman in a silver dress with her head in the top right hand corner and the dress kind of flowing behind her. She's wearing a tiara and I think she's holding something. It's either in black and white or with a muted palette. There's stars everywhere, including on her tiara I think but I can't find the image. If anyone could help that would be amazing please!", "link": "https://www.reddit.com/r/photography/comments/janbrb/discussion_finding_a_particular_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "discussion - finding a particular photo /!/ i'm a writer and i just -----> came !!!  -----> up !!!  -----> with !!!  my newest idea but it's based around an image i saw once and can no longer find, hoping someone here can help! i'm pretty sure it's a photo but i may be mistaken; it's a woman in a silver dress with her head in the top right hand corner and the dress kind of flowing behind her. she's wearing a tiara and i think she's holding something. it's either in black and white or with a muted palette. there's stars everywhere, including on her tiara i think but i can't find the image. if anyone could help that would be amazing please!", "sortedWord": "None", "Identifyer": null, "identifyer": 72434, "year": "2020"}, {"autor": "N7_Prototype", "date": "2020-11-30 02:22:06", "content": "Can't decide between two lenses /!/ Just to preface, I'm shooting with a Nikon D3200, eyeing a D7200 upgrade once I get some more glass and some more time under my belt. I've been shooting mostly with a Nikkor 35mm f/1.8 prime, I wanted something with a wider angle with a decently wide aperture without breaking the bank.\n\nI came up with two options. [Option 1](https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-dx-nikkor-10-24mm-f3.5-4.5g-ed.html#)(10-24mm F3.5-4.5G) and [Option 2](https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-dx-zoom-nikkor-12-24mm-f%252f4g-if-ed.html#tab-ProductDetail-ProductTabs-Overview)( 12-24mm f/4G). Wasn't sure which was \"better\" or really what the difference they would provide. They both seemed pretty similar.", "link": "https://www.reddit.com/r/photography/comments/k3mtjj/cant_decide_between_two_lenses/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "can't decide between two lenses /!/ just to preface, i'm shooting with a nikon d3200, eyeing a d7200 upgrade once i get some more glass and some more time under my belt. i've been shooting mostly with a nikkor 35mm f/1.8 prime, i wanted something with a wider angle with a decently wide aperture without breaking the bank.\n\ni -----> came !!!  -----> up !!!  -----> with !!!  two options. [option 1](https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-dx-nikkor-10-24mm-f3.5-4.5g-ed.html#)(10-24mm f3.5-4.5g) and [option 2](https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-dx-zoom-nikkor-12-24mm-f%252f4g-if-ed.html#tab-productdetail-producttabs-overview)( 12-24mm f/4g). wasn't sure which was \"better\" or really what the difference they would provide. they both seemed pretty similar.", "sortedWord": "None", "Identifyer": null, "identifyer": 72696, "year": "2020"}, {"autor": "mikelostcause", "date": "2020-10-20 18:32:38", "content": "How to keep from buying stolen goods? /!/ Saw a post for a D700 and lens on FB Marketplace, no charger and a dead battery. I asked many questions before agreeing to purchase the camera for roughly what a broken D700 goes for as I didn't have a way to test it. The individual told me it was his daughter's camera for art photography in school, she's now in college and wasn't interested in using the camera any longer. He said the family was moving and clearing out extra items and his daughter didn't know where the charger was or care what happened to the camera. I had checked his FB sales profile and he indeed had old furniture and other odds and ends you would get rid of during a move also listed for sale. Every question I asked, he had a quick and logical response to.\n\nWhen I met him, I ran the serial number through a stolen item online database and it came up with no hits. Agreed to the purchase and took the camera home. Once I was able to get a battery and charger for the camera, the included memory card had corporate marketing photos from just a few months prior. I spent a few hours going through photos and figuring out who took them, contacted the photographer and the camera was indeed stolen from their car. I'll be meeting the photographer shortly to return the camera to it's rightful owner, leaving me without the camera or the money I spent to purchase it.\n\nWhat else could I have done to cover my bases? \n\ntldr: asked questions, checked serial numbers, still got screwed.", "link": "https://www.reddit.com/r/photography/comments/jevkmp/how_to_keep_from_buying_stolen_goods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "how to keep from buying stolen goods? /!/ saw a post for a d700 and lens on fb marketplace, no charger and a dead battery. i asked many questions before agreeing to purchase the camera for roughly what a broken d700 goes for as i didn't have a way to test it. the individual told me it was his daughter's camera for art photography in school, she's now in college and wasn't interested in using the camera any longer. he said the family was moving and clearing out extra items and his daughter didn't know where the charger was or care what happened to the camera. i had checked his fb sales profile and he indeed had old furniture and other odds and ends you would get rid of during a move also listed for sale. every question i asked, he had a quick and logical response to.\n\nwhen i met him, i ran the serial number through a stolen item online database and it -----> came !!!  -----> up !!!  -----> with !!!  no hits. agreed to the purchase and took the camera home. once i was able to get a battery and charger for the camera, the included memory card had corporate marketing photos from just a few months prior. i spent a few hours going through photos and figuring out who took them, contacted the photographer and the camera was indeed stolen from their car. i'll be meeting the photographer shortly to return the camera to it's rightful owner, leaving me without the camera or the money i spent to purchase it.\n\nwhat else could i have done to cover my bases? \n\ntldr: asked questions, checked serial numbers, still got screwed.", "sortedWord": "None", "Identifyer": null, "identifyer": 73373, "year": "2020"}, {"autor": "TinselHave", "date": "2020-11-19 23:07:45", "content": "Is it normal for a Wedding Video to take 3 months to get back, when promised it would be done in a month, and paid for already? /!/ My wedding was on August 28, 2020 and I paid the videographer (my friend since highschool) for his services already. He swore up and down that he would have it done within 4 weeks and keeps coming up with excuses as to why I still do not have it. Im very frustrated and just trying to figure out if this is normal and/ or how long it typically takes to get a wedding video back. If this is not normal, any advice as to what I do next?? Thank you!", "link": "https://www.reddit.com/r/photography/comments/jxdif0/is_it_normal_for_a_wedding_video_to_take_3_months/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "is it normal for a wedding video to take 3 months to get back, when promised it would be done in a month, and paid for already? /!/ my wedding was on august 28, 2020 and i paid the videographer (my friend since highschool) for his services already. he swore -----> up !!!  and down that he would have it done within 4 weeks and keeps -----> coming !!!  -----> up !!!  -----> with !!!  excuses as to why i still do not have it. im very frustrated and just trying to figure out if this is normal and/ or how long it typically takes to get a wedding video back. if this is not normal, any advice as to what i do next?? thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 74034, "year": "2020"}, {"autor": "scaenaobscaena", "date": "2020-03-27 00:05:22", "content": "Do you guys ever come up with original ideas to bypass censorship? I really enjoy doing it ;)", "link": "https://www.reddit.com/r/photography/comments/fpmr5c/do_you_guys_ever_come_up_with_original_ideas_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "do you guys ever -----> come !!!  -----> up !!!  -----> with !!!  original ideas to bypass censorship? i really enjoy doing it ;)", "sortedWord": "None", "Identifyer": null, "identifyer": 75999, "year": "2020"}, {"autor": "SquareCurvesStudio", "date": "2020-04-04 05:40:50", "content": "How do yall categorize your photography blog? /!/ Having some trouble coming up with the categories for my blogs. So I started off with a generic \"Photography\" category. Since I also have other categories around relationship stuff, and announcements.\n\nI was thinking I'd have one for \"food photography\" and then \"travel photography.\" But thinking about it more, I feel like there will be a lot of food photography in the travel photography posts, so I was thinking I'd merge those into the travel one. \n\nDo some of you just have one blanket \"photography\" category that encompasses all your posts? \n\nIf so, do yall preface some of the topics of those photography posts by having something like a \"flair\" in the title? Like having \"FOOD: \" or \"TRAVEL: \" or \"PORTRAIT: \" as a part of the title of the post to show your readers what it's more-or-less about?\n\nJust curious as to how some of yall organize/categorize different photography posts on your blog. Especially if you kind of want to have that flexibility in being able to have multiple categories to encompass specific topics that might be in a sense \"sub-categories\" in and of itself.\n\nI might just be overthinking this lol. What's the best for SEO, if it matters?", "link": "https://www.reddit.com/r/photography/comments/fuo8eq/how_do_yall_categorize_your_photography_blog/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "how do yall categorize your photography blog? /!/ having some trouble -----> coming !!!  -----> up !!!  -----> with !!!  the categories for my blogs. so i started off with a generic \"photography\" category. since i also have other categories around relationship stuff, and announcements.\n\ni was thinking i'd have one for \"food photography\" and then \"travel photography.\" but thinking about it more, i feel like there will be a lot of food photography in the travel photography posts, so i was thinking i'd merge those into the travel one. \n\ndo some of you just have one blanket \"photography\" category that encompasses all your posts? \n\nif so, do yall preface some of the topics of those photography posts by having something like a \"flair\" in the title? like having \"food: \" or \"travel: \" or \"portrait: \" as a part of the title of the post to show your readers what it's more-or-less about?\n\njust curious as to how some of yall organize/categorize different photography posts on your blog. especially if you kind of want to have that flexibility in being able to have multiple categories to encompass specific topics that might be in a sense \"sub-categories\" in and of itself.\n\ni might just be overthinking this lol. what's the best for seo, if it matters?", "sortedWord": "None", "Identifyer": null, "identifyer": 76477, "year": "2020"}, {"autor": "Aunkster", "date": "2020-01-14 14:07:21", "content": "smugmug /!/ Been placing my post processed photos in smugmug for about 14 years,,i need to find another place to store them just in case smugmug ends up in trouble.\n\ntrying to do research i dont come up with much ..Any ideas ?", "link": "https://www.reddit.com/r/photography/comments/eolpht/smugmug/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "smugmug /!/ been placing my post processed photos in smugmug for about 14 years,,i need to find another place to store them just in case smugmug ends up in trouble.\n\ntrying to do research i dont -----> come !!!  -----> up !!!  -----> with !!!  much ..any ideas ?", "sortedWord": "None", "Identifyer": null, "identifyer": 77512, "year": "2020"}, {"autor": "4AcidRayne", "date": "2020-05-31 09:46:53", "content": "My first stab at Astro. /!/ (I apologize in advance for the length. Little bit excited right now.) \n\nI know y'all don't know me very well, but I'm a daytime shooter. I've shot thousands of bird images, some of which I am incredibly proud of along with a few touristy type shots. Thanks to the efforts of a member of this SR ( u/junon ) I figured I ought to just find out if my kit could maybe do something outside the bland. Sad to admit, but most nature photography, birds and wildlife, you've got three basic setups; bright sunny, overcast, and dusk. Once you learn those parameters, not a lot of moving around in the sets; you can take 500 images without touching the setup. \n\nI can say that in 10 years of active photography, I've never felt more \"outside the comfort zone\" and \"at the learning tree\" than I was from 1:00AM to 1:30AM, 5/31/20, a couple hours ago. Wow. Whole new game, nothing I'm accustomed to, nothing I'm used to. Felt zero comfort. Oh, and I need to file a police report; one of the bugs I encountered while out, I think he was carrying a switchblade or a silent power drill. Yipes.  \n\nBefore I drop the links to the only \"salvageable\" shots of the endeavor, gotta warn you; I did not drive a thousand miles to big sky country for a test run. I went to a spot in my yard with a window of sky among all my trees. I live in an incredibly rural area and on satellite photos, you gotta zoom way in to see there's even a structure here; we got trees galore. So, I knew going in that I wasn't going to be getting an enormous FOV horizon to horizon. This aint Montana, and tonight was merely a test-run. A \"Is this even slightly possible, and if so, is it doable enough to go somewhere with a bigger window of open sky?\" test. \n\n  [https://imgur.com/a/7A5d4NM](https://imgur.com/a/7A5d4NM) \n\nWow. That's the freakin' Milky Way...well, the edge of it anyways. Having DL'ed Stellarium and also made use of the web version, I'm a bit smarter about it all, and I can confirm those smokey red tingers are not from the local stoners; that's the haze of the Milky Way with guest appearances by Kaus Australis and other cast members of the [Sagittarius](https://en.wikipedia.org/wiki/Sagittarius_(constellation)) constellation. \n\nSo, what did I learn? \n\nFirst...it's super not useful to try to use the viewfinder. I'm a traditional \"hold it up to your face like a noob\" shooter. It's the method I've used for all prior photography efforts and thousands of bird pictures. So, to be robbed of that tool is frustrating to a high degree. You're essentially working blind. I found a semi-workable method. Pull focus on a bright star through the view if you can (made difficult by the screen being right below your eye glaring for you), then go on the screen and just be careful not to touch the zoom or focus ring. AF was 100% unsupportive of my efforts, so I used manual. With so little light, the camera was basically warning me \"Hey, stupid head, I'm not going to take an image of the inside of the lens cap. You'll not make me look bad at what I do best. No thank you. Add light or I won't participate.\"\n\nSecond, there are few feelings as helpless as waiting on a 30 second exposure when you don't even know what the framing is like. It's legitimately like being ten feet underground on the screen because you're working blind. First couple shots, if I'd gotten an image of a Jackson Pollock painting I wouldn't have been surprised. You're working blind and that makes a 30 second exposure seem like a weekend waiting to see what each shot is going to turn out like. \"Did I bump the tripod and accidentally point it right at this towering oak tree? Am I framed? Did I bork a setting? All good? Hello? Anybody in there???\"   \n\nThird, I need better glass...probably a better camera to put behind it too. At ISO3200 I was getting pretty substantial noise, but it's a start. This is a (sh\\*\\*ty) kit lens, and for about 99% of what the average person (and myself) would do with this camera, it's sufficient. For Astro...I admit I'm trying to punch well above my weight class. It's a small sensor behind a cheapo lens. It has limits, obviously. I'm fairly sure there are cell phone cameras that could output higher quality than the two \"best\" from my outing. So be it; this is the gear I have. I'm scrimping for a nifty fifty but even it will be scraping the bottom of the barrel because I don't have the cash to drop on a $5,000 camera or a $200 piece of glass. End of Day, ISO3200 is going to be noisy on this camera, but it's what I've got to work with.  My SL1 is not a state of the art rig anymore and I know it. In this, I recognize that my gear is handcuffing me. Have to think the folks who came up with the EOS100 never figured some flatbilly from Tennessee would be trying to take a picture of something 150 Light-Years away from the sensor. So...kinda have to live with the fact that my gear isn't set up for this, and the budget isn't going to be capable of fixing that. This aint the rig for a pixel-peeper, not by a long shot. \n\nFourth, it's fun. More than I expected. It's much like fishing and I love fishing; when I push down the button and wait for the two-second delay (I used 2S to minimize shake) I'm casting the lure and asking a question; do I get something good, or nothing? Is there something here for me on this cast? Each press of the shutter is me asking a question and I'll admit it's a thrill to get an answer that, on the screen, is sort of what I expected. Very gratifying to get it on the desktop monitor in fully noisy-garbled glory. \n\nFifth, I've been doing myself a disservice not shooting raw. I've been toying with the idea of shooting raw for a while and I should have been doing it since day one, minute one. So much more power and control. My best bird to date would look soooo much better if I'd shot it raw and had the control over it. It's a hassle and my dino-saur junky computer struggles through the process, but man, so much control. To those who think \"Well, it doesn't matter, I'm just going to output as a JPG with an 800x600 size anyways, why go to the trouble?\" you're wrong. So much control over so many aspects. Tons of control, tons of options. While raw control matters more in images like the Astro ones, I can now see that it is a powerful tool I shouldn't have waited this long to learn and use. \n\nSixth, I'm gonna get some bug spray. The big jug. Like I said, I think one pulled a knife on me, or was drilling for blood from a deeper source. \n\nSeventh, a few basic parameters helps; Learning from u/junon that I'm just going to have to crank the ISO and live with the noise, it's helpful. To know that it's a long exposure at high ISO, shooting wide open, it's good to have a basic starting point. I did start playing with the settings a bit, but it's always nice to have a starting point of reference to go off of. Some have this instinctively, and for daylight images I do, but for this kind of shooting I was in the weeds and out of my element. I've done a very small amount of shooting where I'm dialing in a \"kill me with noise, daddy\" ISO and running with it. \n\nEighth and finally, I can improve. Not only am I relearning the basics in terms of how to photograph a unique subject, I'm also learning the basics of how to edit raw, how to clean massive noise, how to work with raw images. RawTherapee is a powerful tool and it's on me learn how to make it work for me to the max. Astrophotography is new for me, and it's on me to learn how to do it well within my constraints. \n\nBut it is doable. It is possible. I'd just about bet most everyone reading this might have a camera that could give it a stab. It's not a \"Oh, I must have a 1DX or better, gotta have at least a Hasselblad X1D II to have any success. All beneath that is futile.\" Nah. SL1 Reb with the lousiest kit lens that I refer to lovingly as my \"sh\\*\\*ty kitty\" lens, and go do it. \n\nThe future holds many things of great depth, and I'm lucky to have started with such lousy results; I can only improve!", "link": "https://www.reddit.com/r/photography/comments/gtwa9t/my_first_stab_at_astro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "my first stab at astro. /!/ (i apologize in advance for the length. little bit excited right now.) \n\ni know y'all don't know me very well, but i'm a daytime shooter. i've shot thousands of bird images, some of which i am incredibly proud of along with a few touristy type shots. thanks to the efforts of a member of this sr ( u/junon ) i figured i ought to just find out if my kit could maybe do something outside the bland. sad to admit, but most nature photography, birds and wildlife, you've got three basic setups; bright sunny, overcast, and dusk. once you learn those parameters, not a lot of moving around in the sets; you can take 500 images without touching the setup. \n\ni can say that in 10 years of active photography, i've never felt more \"outside the comfort zone\" and \"at the learning tree\" than i was from 1:00am to 1:30am, 5/31/20, a couple hours ago. wow. whole new game, nothing i'm accustomed to, nothing i'm used to. felt zero comfort. oh, and i need to file a police report; one of the bugs i encountered while out, i think he was carrying a switchblade or a silent power drill. yipes.  \n\nbefore i drop the links to the only \"salvageable\" shots of the endeavor, gotta warn you; i did not drive a thousand miles to big sky country for a test run. i went to a spot in my yard with a window of sky among all my trees. i live in an incredibly rural area and on satellite photos, you gotta zoom way in to see there's even a structure here; we got trees galore. so, i knew going in that i wasn't going to be getting an enormous fov horizon to horizon. this aint montana, and tonight was merely a test-run. a \"is this even slightly possible, and if so, is it doable enough to go somewhere with a bigger window of open sky?\" test. \n\n  [https://imgur.com/a/7a5d4nm](https://imgur.com/a/7a5d4nm) \n\nwow. that's the freakin' milky way...well, the edge of it anyways. having dl'ed stellarium and also made use of the web version, i'm a bit smarter about it all, and i can confirm those smokey red tingers are not from the local stoners; that's the haze of the milky way with guest appearances by kaus australis and other cast members of the [sagittarius](https://en.wikipedia.org/wiki/sagittarius_(constellation)) constellation. \n\nso, what did i learn? \n\nfirst...it's super not useful to try to use the viewfinder. i'm a traditional \"hold it up to your face like a noob\" shooter. it's the method i've used for all prior photography efforts and thousands of bird pictures. so, to be robbed of that tool is frustrating to a high degree. you're essentially working blind. i found a semi-workable method. pull focus on a bright star through the view if you can (made difficult by the screen being right below your eye glaring for you), then go on the screen and just be careful not to touch the zoom or focus ring. af was 100% unsupportive of my efforts, so i used manual. with so little light, the camera was basically warning me \"hey, stupid head, i'm not going to take an image of the inside of the lens cap. you'll not make me look bad at what i do best. no thank you. add light or i won't participate.\"\n\nsecond, there are few feelings as helpless as waiting on a 30 second exposure when you don't even know what the framing is like. it's legitimately like being ten feet underground on the screen because you're working blind. first couple shots, if i'd gotten an image of a jackson pollock painting i wouldn't have been surprised. you're working blind and that makes a 30 second exposure seem like a weekend waiting to see what each shot is going to turn out like. \"did i bump the tripod and accidentally point it right at this towering oak tree? am i framed? did i bork a setting? all good? hello? anybody in there???\"   \n\nthird, i need better glass...probably a better camera to put behind it too. at iso3200 i was getting pretty substantial noise, but it's a start. this is a (sh\\*\\*ty) kit lens, and for about 99% of what the average person (and myself) would do with this camera, it's sufficient. for astro...i admit i'm trying to punch well above my weight class. it's a small sensor behind a cheapo lens. it has limits, obviously. i'm fairly sure there are cell phone cameras that could output higher quality than the two \"best\" from my outing. so be it; this is the gear i have. i'm scrimping for a nifty fifty but even it will be scraping the bottom of the barrel because i don't have the cash to drop on a $5,000 camera or a $200 piece of glass. end of day, iso3200 is going to be noisy on this camera, but it's what i've got to work with.  my sl1 is not a state of the art rig anymore and i know it. in this, i recognize that my gear is handcuffing me. have to think the folks who -----> came !!!  -----> up !!!  -----> with !!!  the eos100 never figured some flatbilly from tennessee would be trying to take a picture of something 150 light-years away from the sensor. so...kinda have to live with the fact that my gear isn't set up for this, and the budget isn't going to be capable of fixing that. this aint the rig for a pixel-peeper, not by a long shot. \n\nfourth, it's fun. more than i expected. it's much like fishing and i love fishing; when i push down the button and wait for the two-second delay (i used 2s to minimize shake) i'm casting the lure and asking a question; do i get something good, or nothing? is there something here for me on this cast? each press of the shutter is me asking a question and i'll admit it's a thrill to get an answer that, on the screen, is sort of what i expected. very gratifying to get it on the desktop monitor in fully noisy-garbled glory. \n\nfifth, i've been doing myself a disservice not shooting raw. i've been toying with the idea of shooting raw for a while and i should have been doing it since day one, minute one. so much more power and control. my best bird to date would look soooo much better if i'd shot it raw and had the control over it. it's a hassle and my dino-saur junky computer struggles through the process, but man, so much control. to those who think \"well, it doesn't matter, i'm just going to output as a jpg with an 800x600 size anyways, why go to the trouble?\" you're wrong. so much control over so many aspects. tons of control, tons of options. while raw control matters more in images like the astro ones, i can now see that it is a powerful tool i shouldn't have waited this long to learn and use. \n\nsixth, i'm gonna get some bug spray. the big jug. like i said, i think one pulled a knife on me, or was drilling for blood from a deeper source. \n\nseventh, a few basic parameters helps; learning from u/junon that i'm just going to have to crank the iso and live with the noise, it's helpful. to know that it's a long exposure at high iso, shooting wide open, it's good to have a basic starting point. i did start playing with the settings a bit, but it's always nice to have a starting point of reference to go off of. some have this instinctively, and for daylight images i do, but for this kind of shooting i was in the weeds and out of my element. i've done a very small amount of shooting where i'm dialing in a \"kill me with noise, daddy\" iso and running with it. \n\neighth and finally, i can improve. not only am i relearning the basics in terms of how to photograph a unique subject, i'm also learning the basics of how to edit raw, how to clean massive noise, how to work with raw images. rawtherapee is a powerful tool and it's on me learn how to make it work for me to the max. astrophotography is new for me, and it's on me to learn how to do it well within my constraints. \n\nbut it is doable. it is possible. i'd just about bet most everyone reading this might have a camera that could give it a stab. it's not a \"oh, i must have a 1dx or better, gotta have at least a hasselblad x1d ii to have any success. all beneath that is futile.\" nah. sl1 reb with the lousiest kit lens that i refer to lovingly as my \"sh\\*\\*ty kitty\" lens, and go do it. \n\nthe future holds many things of great depth, and i'm lucky to have started with such lousy results; i can only improve!", "sortedWord": "None", "Identifyer": null, "identifyer": 80440, "year": "2020"}, {"autor": "Extriker", "date": "2020-07-13 17:20:39", "content": "Question for portrait photographers, how to come up with poses on the spot? /!/ I'm a beginner in portrait photography and have mostly done shoots with friends. What I usually do to come up with poses manually is to save some portrait poses and ideas from other photographers (on like Instagram or something) and make small changes to the idea. I'm wondering how you all come up with poses on the spot?", "link": "https://www.reddit.com/r/photography/comments/hqji2s/question_for_portrait_photographers_how_to_come/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "question for portrait photographers, how to -----> come !!!  -----> up !!!  -----> with !!!  poses on the spot? /!/ i'm a beginner in portrait photography and have mostly done shoots with friends. what i usually do to come up with poses manually is to save some portrait poses and ideas from other photographers (on like instagram or something) and make small changes to the idea. i'm wondering how you all come up with poses on the spot?", "sortedWord": "None", "Identifyer": null, "identifyer": 81177, "year": "2020"}, {"autor": "ParalyzeTheAnalysis", "date": "2020-08-08 14:54:30", "content": "Photo Sharing And Storage Options - Long Term (What happens when I die?) /!/ Hi Everyone!\n\nI've struggled over the years to find the best long term, bulletproof method by which I store (and share) photos for personal and business use cases. I've landed on a system that mostly works for my day-to-day operations and my year-to-year storage / archiving (I'll outline that in a bit).  Lately, I've been worrying primarily about what happens to my photos should something happen to me. My wife's been on me to come up with a plan and I truly want to make it easy for her (primary goal) and family members (secondary goal) to access my digital self (in an organized fashion) should I get hit by a bus (or throw away my computer and permanently move to a remote tropical island).\n\nI've researched a lot of these options out there individually, but haven't run into any firsthand experiences that match up with my goals. Most discussions revolve around the use I assume I can't be the only one in this situation!\n\n**Current Setup**:\n\n* Drobo - RAID setup for long term archiving of photos. I think I'm approaching about 3TB and have more drives to combine into this (I need to buy more internal drives!)\n* External HD - Cloning for Drobo offsite backup of Drobo via Carbon Copy Cloner (future state for me)\n* iCloud - I share albums with family members / friends who have iPhones. Of my 75k+ camera roll, I'd probably want to selectively designate about 30% of images to be available to others in whatever long term solution I decide to use.\n* Dropbox - Client sharing (I share a Dropbox folder with clients to deliver final files) \n* SmugMug - Website backend (I do not do any client delivery or eCommerce here - It's really just a website builder for me)\n* Various External Drives - I use these for active / semi-active project files as it is quicker than my Drobo. Might include my year-to-year working files that I eventually archive to my Drobo.\n* Instagram - Of course I share here, but it's photo-by-photo and not a scalable solution (also not full resolution). It's fine for sharing a photo here and there.\n\n**Tools I DON'T use but have looked into**:\n\n* Google - I've not adopted Google for photos - Just email / Google Voice. This is probably a front runner for me right now.\n* AWS - I've looked at it, but never adopted. I do not get the sense that this is right for me, but I'm open to it. \n* Facebook - No, I hate Facebook. But, the \"legacy\" feature is nice in that I can designate someone as being in charge of my account should I die. Also, I don't believe full res photos will be an option.\n* AEM - Probably too expensive and excessive for my needs, but I've thought about using as a CMS as it has great permission control and publishing abilities. Probably akin to killing a fly with a nuke, though.\n\n**Goals**:\n\n* Publish MANY select images that are accessible by family and friends (in the \"cloud\")\n* Upload speeds - I'd love to be able to find something that isn't throttled down too far (as with iCloud - Despite my great upload speeds, I think iCloud throttles what it can receive...)\n* Password protected - Only those I designate should be able to access the files\n* Permission management abilities - I might not want to share certain galleries with one side of the family that were meant for another. For instance, my in laws probably don't care about photos that were taken at my Aunt and Uncle's Thanksgiving, just as my Aunt and Uncle probably don't care about photos published of my Niece-in-law's first birthday. \n* Full resolution photos published with the ability to download by users\n* Organizability - Should be easy to organize into logical albums and groupings of files that are easily interpreted and browsed by end users\n* File types - Photos are my primary objective here, but this could include videos, and could even include a PDF or other type of document here and there.\n* Capacity - This should be able to exceed a couple of terabytes and scale with my needs.\n* Longevity and survivability - Needs uptime and to be with a company / solution that will be around for a while (no fly by night solutions that I can't trust to outlive me).\n* Security - I am a very private person and wish to have these files be very private as well. This has been my hesitation with moving forward on \n* Billing - Able to designate an alternative billing contact to keep the storage going if I am no longer in the picture.\n* Cost - I don't want to pay an arm and a leg for this (but I will if it's the right solution) and would prefer to not be billed by the GB but by the TB - Some kind of plan where it is 1TB, 2TB, 5TB, etc... (this is more mental for me - I don't want to *feel* the money leaving my wallet as I upload the next 500 photos).\n* App-based access by end users - This is a nice to have, but I'd love for my family members to be able to access an app that cleanly displays folders/albums in a logical method (defined by me). This could be a website or a mobile app that offers a gallery-type browsing ability.\n\nI've tossed around using Google Photos. I've thought about just dumping everything into SmugMug. I've thought about iCloud shared albums. I'm just a bit balled up with where to jump from here. I've researched a lot of these individually but would love to hear of your experiences if you've been in a similar situation! I might be missing something incredibly simple as I've been deep diving too much and can't quite see the forest through the trees. I am having a tough time putting it all together in my head and appreciate ANY input that you share!", "link": "https://www.reddit.com/r/photography/comments/i60exi/photo_sharing_and_storage_options_long_term_what/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "photo sharing and storage options - long term (what happens when i die?) /!/ hi everyone!\n\ni've struggled over the years to find the best long term, bulletproof method by which i store (and share) photos for personal and business use cases. i've landed on a system that mostly works for my day-to-day operations and my year-to-year storage / archiving (i'll outline that in a bit).  lately, i've been worrying primarily about what happens to my photos should something happen to me. my wife's been on me to -----> come !!!  -----> up !!!  -----> with !!!  a plan and i truly want to make it easy for her (primary goal) and family members (secondary goal) to access my digital self (in an organized fashion) should i get hit by a bus (or throw away my computer and permanently move to a remote tropical island).\n\ni've researched a lot of these options out there individually, but haven't run into any firsthand experiences that match up with my goals. most discussions revolve around the use i assume i can't be the only one in this situation!\n\n**current setup**:\n\n* drobo - raid setup for long term archiving of photos. i think i'm approaching about 3tb and have more drives to combine into this (i need to buy more internal drives!)\n* external hd - cloning for drobo offsite backup of drobo via carbon copy cloner (future state for me)\n* icloud - i share albums with family members / friends who have iphones. of my 75k+ camera roll, i'd probably want to selectively designate about 30% of images to be available to others in whatever long term solution i decide to use.\n* dropbox - client sharing (i share a dropbox folder with clients to deliver final files) \n* smugmug - website backend (i do not do any client delivery or ecommerce here - it's really just a website builder for me)\n* various external drives - i use these for active / semi-active project files as it is quicker than my drobo. might include my year-to-year working files that i eventually archive to my drobo.\n* instagram - of course i share here, but it's photo-by-photo and not a scalable solution (also not full resolution). it's fine for sharing a photo here and there.\n\n**tools i don't use but have looked into**:\n\n* google - i've not adopted google for photos - just email / google voice. this is probably a front runner for me right now.\n* aws - i've looked at it, but never adopted. i do not get the sense that this is right for me, but i'm open to it. \n* facebook - no, i hate facebook. but, the \"legacy\" feature is nice in that i can designate someone as being in charge of my account should i die. also, i don't believe full res photos will be an option.\n* aem - probably too expensive and excessive for my needs, but i've thought about using as a cms as it has great permission control and publishing abilities. probably akin to killing a fly with a nuke, though.\n\n**goals**:\n\n* publish many select images that are accessible by family and friends (in the \"cloud\")\n* upload speeds - i'd love to be able to find something that isn't throttled down too far (as with icloud - despite my great upload speeds, i think icloud throttles what it can receive...)\n* password protected - only those i designate should be able to access the files\n* permission management abilities - i might not want to share certain galleries with one side of the family that were meant for another. for instance, my in laws probably don't care about photos that were taken at my aunt and uncle's thanksgiving, just as my aunt and uncle probably don't care about photos published of my niece-in-law's first birthday. \n* full resolution photos published with the ability to download by users\n* organizability - should be easy to organize into logical albums and groupings of files that are easily interpreted and browsed by end users\n* file types - photos are my primary objective here, but this could include videos, and could even include a pdf or other type of document here and there.\n* capacity - this should be able to exceed a couple of terabytes and scale with my needs.\n* longevity and survivability - needs uptime and to be with a company / solution that will be around for a while (no fly by night solutions that i can't trust to outlive me).\n* security - i am a very private person and wish to have these files be very private as well. this has been my hesitation with moving forward on \n* billing - able to designate an alternative billing contact to keep the storage going if i am no longer in the picture.\n* cost - i don't want to pay an arm and a leg for this (but i will if it's the right solution) and would prefer to not be billed by the gb but by the tb - some kind of plan where it is 1tb, 2tb, 5tb, etc... (this is more mental for me - i don't want to *feel* the money leaving my wallet as i upload the next 500 photos).\n* app-based access by end users - this is a nice to have, but i'd love for my family members to be able to access an app that cleanly displays folders/albums in a logical method (defined by me). this could be a website or a mobile app that offers a gallery-type browsing ability.\n\ni've tossed around using google photos. i've thought about just dumping everything into smugmug. i've thought about icloud shared albums. i'm just a bit balled up with where to jump from here. i've researched a lot of these individually but would love to hear of your experiences if you've been in a similar situation! i might be missing something incredibly simple as i've been deep diving too much and can't quite see the forest through the trees. i am having a tough time putting it all together in my head and appreciate any input that you share!", "sortedWord": "None", "Identifyer": null, "identifyer": 81470, "year": "2020"}, {"autor": "filton02", "date": "2020-07-10 03:02:10", "content": "Worried about my camera's LCD overheating in the sun. Came up with this solution.", "link": "https://www.reddit.com/r/photography/comments/hoh9m1/worried_about_my_cameras_lcd_overheating_in_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "worried about my camera's lcd overheating in the sun. -----> came !!!  -----> up !!!  -----> with !!!  this solution.", "sortedWord": "None", "Identifyer": null, "identifyer": 81581, "year": "2020"}, {"autor": "Neznezu", "date": "2020-07-09 12:21:20", "content": "Pricing for letting Natgeo use a person’s photo (deadline) /!/ Hey! So I’m asking this question on behalf of another person (because that person doesn’t have reddit, long story) who got approached by Natgeo with the question if they could licence a photo for an upcoming educational program, World Link: Developing Language Fluency. It’s not yet known how many copies will be made and if it is going to be published in a digital version or not. \nSo again my question: does anyone know a range for the pricing for these sort of things or have any tips or certain term to come up with a price? The person does have to answer quite quickly so if you know something, feel free to say something!", "link": "https://www.reddit.com/r/photography/comments/ho244j/pricing_for_letting_natgeo_use_a_persons_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pricing for letting natgeo use a person’s photo (deadline) /!/ hey! so i’m asking this question on behalf of another person (because that person doesn’t have reddit, long story) who got approached by natgeo with the question if they could licence a photo for an upcoming educational program, world link: developing language fluency. it’s not yet known how many copies will be made and if it is going to be published in a digital version or not. \nso again my question: does anyone know a range for the pricing for these sort of things or have any tips or certain term to -----> come !!!  -----> up !!!  -----> with !!!  a price? the person does have to answer quite quickly so if you know something, feel free to say something!", "sortedWord": "None", "Identifyer": null, "identifyer": 81645, "year": "2020"}, {"autor": "silent_winter", "date": "2020-08-19 16:19:54", "content": "Is photography an \"old dream\"? /!/ I was watching a video by a Youtuber known as TechLead -- a former software engineer -- where he talked about his experience with making timelapses of various landscapes. He wanted to see if he could do it professionally, so he'd go to some beautiful location like Iceland, make timelapses, and put them out there. However, he found that the market was already fairly saturated by the time he was doing it (a few years ago), and only the first few people to do it had a shot at becoming well known for it and being able to make a career of it. So, he felt like it was too late for that, and he was trying to chase an \"old dream\".   \n\n\nThis got me thinking about the landscape photography field today. Of course there will always be a need for portrait, wedding, product, and real estate photographers. But, landscape photography is different. You sell your prints, or you teach. In either case, you need to be a renowned artist, not just some local photographer. Your competition is every hiker with a camera in the world.   \n\n\n**Given how saturated that market is, is landscape photography also an \"old dream\"? Can there ever be another Dan Kordan, Marc Adamus, or Max Rive?**   \n\n\nYou could of course be only a \"good\" artist, but make quality content on Youtube, ie Thomas Heaton, but Youtube is also so saturated now that it might not be possible to break through the noise.   \n\n\nThis likely applies not just to landscape photography, but to any \"fine art\" photography where the goal is to make art rather than create consumer goods.   \n\n\nI do realize that, in any form of art, new artists continue to emerge. An artform doesn't just die. Perhaps it's just the pathways to success that change, and you simply must do something entirely new rather than replicate Dan Kordan or Max Rive. This does leave one wondering, \"well, how else CAN you photograph a mountain?\" But perhaps a talented artist would come up with an answer. \n\n  \nI don't know enough about the history of modern art to say, so I wanted to start a discussion and see what others think.", "link": "https://www.reddit.com/r/photography/comments/icqrzu/is_photography_an_old_dream/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "is photography an \"old dream\"? /!/ i was watching a video by a youtuber known as techlead -- a former software engineer -- where he talked about his experience with making timelapses of various landscapes. he wanted to see if he could do it professionally, so he'd go to some beautiful location like iceland, make timelapses, and put them out there. however, he found that the market was already fairly saturated by the time he was doing it (a few years ago), and only the first few people to do it had a shot at becoming well known for it and being able to make a career of it. so, he felt like it was too late for that, and he was trying to chase an \"old dream\".   \n\n\nthis got me thinking about the landscape photography field today. of course there will always be a need for portrait, wedding, product, and real estate photographers. but, landscape photography is different. you sell your prints, or you teach. in either case, you need to be a renowned artist, not just some local photographer. your competition is every hiker with a camera in the world.   \n\n\n**given how saturated that market is, is landscape photography also an \"old dream\"? can there ever be another dan kordan, marc adamus, or max rive?**   \n\n\nyou could of course be only a \"good\" artist, but make quality content on youtube, ie thomas heaton, but youtube is also so saturated now that it might not be possible to break through the noise.   \n\n\nthis likely applies not just to landscape photography, but to any \"fine art\" photography where the goal is to make art rather than create consumer goods.   \n\n\ni do realize that, in any form of art, new artists continue to emerge. an artform doesn't just die. perhaps it's just the pathways to success that change, and you simply must do something entirely new rather than replicate dan kordan or max rive. this does leave one wondering, \"well, how else can you photograph a mountain?\" but perhaps a talented artist would -----> come !!!  -----> up !!!  -----> with !!!  an answer. \n\n  \ni don't know enough about the history of modern art to say, so i wanted to start a discussion and see what others think.", "sortedWord": "None", "Identifyer": null, "identifyer": 82303, "year": "2020"}, {"autor": "DreamerEnd", "date": "2020-08-01 01:11:51", "content": "I was inspired by the Honey Bees so here is an idea I came up with🐝", "link": "https://www.reddit.com/r/photography/comments/i1jjxd/i_was_inspired_by_the_honey_bees_so_here_is_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i was inspired by the honey bees so here is an idea i -----> came !!!  -----> up !!!  -----> with !!! 🐝", "sortedWord": "None", "Identifyer": null, "identifyer": 83836, "year": "2020"}, {"autor": "cryptodesign", "date": "2020-10-12 10:27:23", "content": "10 tips for photographing little mushrooms in the forest! /!/ Hi Everyone,\n\nBack here with some new inspiration :) As I am a professional photographer and known mainly for my images with wide angle lenses, here is something new. It's raining here for weeks already with not the greatest conditions for landscape photography, so I took out my macro lens to photograph some mushrooms in the forest. The great thing about this is that you can do this with any kind of light at any moment of the day. \n\nThe mushrooms are (in NL at least) literally everywhere and you can find them especially on wet trees that fell down in forests. Now this was actually the first time I went out to photograph these mushrooms, and I immediately got addicted! So I can recommend this to anyone who loves this style of photography :) I planned to only go to the forest for about an hour, but I stayed the whole day with so much muscle pain as a result (had to lower myself all the time to shoot the tiny mushrooms on the forest floor). Here are some images and tips that I came up with:\n\n\\- Get very low. The prettiest mushrooms are often the tiniest. Sometimes you don't even see them immediately. They can be on fallen trees or directly on the forest floor. You don't want to photograph them at an angle, but from the same height as were they are. So get low.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kbo1fxui4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=f21a086012729652e7fe83751e70474ca3317f62\n\n\\- The background is more important than the subject. This was what I found most important when photographing these little guys. By moving the camera just a few mm, the composition and background completely changes. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/s9rnctrk4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=99b49009e4eecb73797a1d55a32ce40f0d4809f0\n\n\\- Use foreground bokeh. By getting low with your camera and having some leaves or grass in front of your lens, you'll have both dreamy foreground blur AND background blur. You can also use red leaves and put them in front of your lens a bit to create that autumn feeling. This way you create more depth.\n\n&amp;#x200B;\n\n[A red leaf in the foreground gives that extra depth](https://preview.redd.it/zrrqu95m4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=d17929506f305565f15a1af58b566d4551b48629)\n\n\\- Use a macro lens or extension tubes. All of these images were made with a 90mm macro. Its my favourite focal length to shoot these kind of shots. You can also get extension tubes for your lens to be able to focus closer to do macro shots.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/12z39wnw4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=b0b0a90465b4661cb4cb60371470623978330d73\n\n\\- Use a wide open aperture for extremely dreamy look. I almost always use my macro lens wide open at f/2.8. This way the depth of field is very tiny, and it allows me to create these very dreamy shots.\n\n\\- Find single little mushrooms. There are often big packs of mushrooms that can be very tempting to photograph. But the most beautiful ones are often the very tiny single ones. Because you can make beautiful framing of a single little mushroom with the dreamy background.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jbieldxr4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=24fdf83ece48b63473a558e37a38e4bd81322ec9\n\n\\- Photograph them slightly from below so you can see the texture inside. This is something I only noticed later. As a newbie mushroom photographer, I had to 'learn' that they looked so beautiful from the inside. They're often very tiny and low on the ground, so getting below them can be tricky. It gets easier when they're on a tree. By getting lower and photographing them from below, you'll see the beautiful textures in the mushrooms.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tj76n8rt4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=ac0558aaa8cf5f7ba5bf9cd0e2798909c1a842ea\n\n\\- A flip screen is super handy. If you don't have a flip screen you basically need to lie on the ground to see what you're doing. I was able to take all these shots by crouching down and looking at my flip screen. Makes things a little bit easier\n\n\\- Use hand held. Some people might disagree with this tip. But I shot all of these images hand held. By using the camera hand held I was able to very quickly switch up my angles and composition. Focusing is HARD though, and the forest is often dark. So most of these images are taken at ISO 400-500. If you're shooting on a tripod, you'll want to shoot with your center column upside down so that you can place your camera very low to the ground.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zlujc4cv4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=2b2c06612f84b268ba5a9fecd366125c80d440a6\n\n\\- Bring something to sit on. Now as I was saying, I crouched for almost all of these shots. As a result of hours doing this, I have so much muscle pain today :D Next time I'll bring a cloth to sit on, it makes things so much easier!\n\nNow I don't consider myself a pro at macro photography, so feel free to give me any tips as well :) I really enjoyed photographing these mushrooms and it's almost like an entire new tiny world. I'll go back soon to shoot more. You can find more of my work on my [website](https://www.albertdros.com) or [instagram](https://www.instagram.com/albertdrosphotography). And if you have any questions, feel free to ask!\n\nCheers!\n\nAlbert", "link": "https://www.reddit.com/r/photography/comments/j9ogr9/10_tips_for_photographing_little_mushrooms_in_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "10 tips for photographing little mushrooms in the forest! /!/ hi everyone,\n\nback here with some new inspiration :) as i am a professional photographer and known mainly for my images with wide angle lenses, here is something new. it's raining here for weeks already with not the greatest conditions for landscape photography, so i took out my macro lens to photograph some mushrooms in the forest. the great thing about this is that you can do this with any kind of light at any moment of the day. \n\nthe mushrooms are (in nl at least) literally everywhere and you can find them especially on wet trees that fell down in forests. now this was actually the first time i went out to photograph these mushrooms, and i immediately got addicted! so i can recommend this to anyone who loves this style of photography :) i planned to only go to the forest for about an hour, but i stayed the whole day with so much muscle pain as a result (had to lower myself all the time to shoot the tiny mushrooms on the forest floor). here are some images and tips that i -----> came !!!  -----> up !!!  -----> with !!! :\n\n\\- get very low. the prettiest mushrooms are often the tiniest. sometimes you don't even see them immediately. they can be on fallen trees or directly on the forest floor. you don't want to photograph them at an angle, but from the same height as were they are. so get low.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/kbo1fxui4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=f21a086012729652e7fe83751e70474ca3317f62\n\n\\- the background is more important than the subject. this was what i found most important when photographing these little guys. by moving the camera just a few mm, the composition and background completely changes. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/s9rnctrk4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=99b49009e4eecb73797a1d55a32ce40f0d4809f0\n\n\\- use foreground bokeh. by getting low with your camera and having some leaves or grass in front of your lens, you'll have both dreamy foreground blur and background blur. you can also use red leaves and put them in front of your lens a bit to create that autumn feeling. this way you create more depth.\n\n&amp;#x200b;\n\n[a red leaf in the foreground gives that extra depth](https://preview.redd.it/zrrqu95m4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=d17929506f305565f15a1af58b566d4551b48629)\n\n\\- use a macro lens or extension tubes. all of these images were made with a 90mm macro. its my favourite focal length to shoot these kind of shots. you can also get extension tubes for your lens to be able to focus closer to do macro shots.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/12z39wnw4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=b0b0a90465b4661cb4cb60371470623978330d73\n\n\\- use a wide open aperture for extremely dreamy look. i almost always use my macro lens wide open at f/2.8. this way the depth of field is very tiny, and it allows me to create these very dreamy shots.\n\n\\- find single little mushrooms. there are often big packs of mushrooms that can be very tempting to photograph. but the most beautiful ones are often the very tiny single ones. because you can make beautiful framing of a single little mushroom with the dreamy background.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/jbieldxr4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=24fdf83ece48b63473a558e37a38e4bd81322ec9\n\n\\- photograph them slightly from below so you can see the texture inside. this is something i only noticed later. as a newbie mushroom photographer, i had to 'learn' that they looked so beautiful from the inside. they're often very tiny and low on the ground, so getting below them can be tricky. it gets easier when they're on a tree. by getting lower and photographing them from below, you'll see the beautiful textures in the mushrooms.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/tj76n8rt4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=ac0558aaa8cf5f7ba5bf9cd0e2798909c1a842ea\n\n\\- a flip screen is super handy. if you don't have a flip screen you basically need to lie on the ground to see what you're doing. i was able to take all these shots by crouching down and looking at my flip screen. makes things a little bit easier\n\n\\- use hand held. some people might disagree with this tip. but i shot all of these images hand held. by using the camera hand held i was able to very quickly switch up my angles and composition. focusing is hard though, and the forest is often dark. so most of these images are taken at iso 400-500. if you're shooting on a tripod, you'll want to shoot with your center column upside down so that you can place your camera very low to the ground.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/zlujc4cv4ns51.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=2b2c06612f84b268ba5a9fecd366125c80d440a6\n\n\\- bring something to sit on. now as i was saying, i crouched for almost all of these shots. as a result of hours doing this, i have so much muscle pain today :d next time i'll bring a cloth to sit on, it makes things so much easier!\n\nnow i don't consider myself a pro at macro photography, so feel free to give me any tips as well :) i really enjoyed photographing these mushrooms and it's almost like an entire new tiny world. i'll go back soon to shoot more. you can find more of my work on my [website](https://www.albertdros.com) or [instagram](https://www.instagram.com/albertdrosphotography). and if you have any questions, feel free to ask!\n\ncheers!\n\nalbert", "sortedWord": "None", "Identifyer": null, "identifyer": 84056, "year": "2020"}, {"autor": "fabelmay", "date": "2020-11-26 03:20:01", "content": "Coming up with concepts for broad themes /!/ Hi everyone, \nFor one of my classes we are having a little mock photography competition (it’s not a photography class). I am very much an amateur photographer but would like to enter a photo. The theme is kindness. I usually shoot things like landscapes and surfers, very occasionally I will shoot portraits but they are usually for the purpose of showing an area or fashion etc \nHow do people come up with ideas for shoots like this? I would really love to hear the process of more seasoned photographers for coming up with ideas for very specific concept shoots. \nThank you in advance!", "link": "https://www.reddit.com/r/photography/comments/k17bcy/coming_up_with_concepts_for_broad_themes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "-----> coming !!!  -----> up !!!  -----> with !!!  concepts for broad themes /!/ hi everyone, \nfor one of my classes we are having a little mock photography competition (it’s not a photography class). i am very much an amateur photographer but would like to enter a photo. the theme is kindness. i usually shoot things like landscapes and surfers, very occasionally i will shoot portraits but they are usually for the purpose of showing an area or fashion etc \nhow do people come up with ideas for shoots like this? i would really love to hear the process of more seasoned photographers for coming up with ideas for very specific concept shoots. \nthank you in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 84243, "year": "2020"}, {"autor": "guessimfine", "date": "2020-09-30 09:07:03", "content": "For the film photographers out there, Filmtober! Anyone keen for a challenge? /!/ Inspired by Inktober and after chatting with the folks over at r/AnalogCommunity, I'm starting a wee creative challenge for film photographers called Filmtober! It's purely a community initiative, to get us out there taking photos more and celebrating film and analog photography when most of us run on digital.\n\nI'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **Take and post a photo every day —** Take a photo every day during October, and post a photo taken during the last 2 weeks. That means during the first half of October you can use photos you took in September. *Half marathon option:* Take and post a photo every 2nd day, using photos from the last month.\n* **Tag and share —** Obviously you can post them here or r/analog, but if you're posting to IG or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. \n* **Use themes for inspo —** I've come up with some weekly(ish) themes for inspiration, outlined below. Don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge.\n\nAnd there's only one rule — photos must be taken on film. All formats are fair game, as long as it's analog.\n\n**Themes**\n\n* Light (1st - 11th Oct)\n* People (12th - 18th Oct)\n* Minimalism (19th - 25th Oct)\n* Open theme (26th - 31st Oct)\n\nThat's it! Let me know what you think, and if you're keen to play along. This is a last minute passion project, but hey it's never too late to take on a creative challenge. I'll definitely be doing it in any case.\n\nI'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0ekgu0h39q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=be80bd8bb5080bffdd72c558b3bce1cae81d6947", "link": "https://www.reddit.com/r/photography/comments/j2ipq4/for_the_film_photographers_out_there_filmtober/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "for the film photographers out there, filmtober! anyone keen for a challenge? /!/ inspired by inktober and after chatting with the folks over at r/analogcommunity, i'm starting a wee creative challenge for film photographers called filmtober! it's purely a community initiative, to get us out there taking photos more and celebrating film and analog photography when most of us run on digital.\n\ni'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **take and post a photo every day —** take a photo every day during october, and post a photo taken during the last 2 weeks. that means during the first half of october you can use photos you took in september. *half marathon option:* take and post a photo every 2nd day, using photos from the last month.\n* **tag and share —** obviously you can post them here or r/analog, but if you're posting to ig or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. \n* **use themes for inspo —** i've -----> come !!!  -----> up !!!  -----> with !!!  some weekly(ish) themes for inspiration, outlined below. don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge.\n\nand there's only one rule — photos must be taken on film. all formats are fair game, as long as it's analog.\n\n**themes**\n\n* light (1st - 11th oct)\n* people (12th - 18th oct)\n* minimalism (19th - 25th oct)\n* open theme (26th - 31st oct)\n\nthat's it! let me know what you think, and if you're keen to play along. this is a last minute passion project, but hey it's never too late to take on a creative challenge. i'll definitely be doing it in any case.\n\ni'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y0ekgu0h39q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=be80bd8bb5080bffdd72c558b3bce1cae81d6947", "sortedWord": "None", "Identifyer": null, "identifyer": 84350, "year": "2020"}, {"autor": "WillThereBeCake", "date": "2020-11-29 14:06:05", "content": "What types of photography should be on a definitive list of genres? . . . /!/ Sure Google comes up with everything from a short list to one with 50 types. Some of the latter overlap, i.e. B/W.  What specific types, with descriptions please, are on your list?  What type of shooter are you?", "link": "https://www.reddit.com/r/photography/comments/k39wpa/what_types_of_photography_should_be_on_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "what types of photography should be on a definitive list of genres? . . . /!/ sure google -----> comes !!!  -----> up !!!  -----> with !!!  everything from a short list to one -----> with !!!  50 types. some of the latter overlap, i.e. b/w.  what specific types, with descriptions please, are on your list?  what type of shooter are you?", "sortedWord": "None", "Identifyer": null, "identifyer": 84668, "year": "2020"}, {"autor": "tommikar", "date": "2020-11-29 10:43:57", "content": "Do you build sets for your shoots? /!/ A few months ago I got access to a studio space shared by a few other photographers. I feel it's opened up a ton of possibilities that previously weren't available to me, at least not at such convenience. It's a very typical studio: six background rolls on the ceiling with ample space for lights and a good selection of lighting modifiers available. I really like it.\n\nBut sometimes the backdrops just don't feel like enough of an environment. Full length portraits of people especially easily start to feel strange because there is no environment around them. I realised that the studio has enough room to host a small set the size of an elevator cabin, jail cell (3-wall set) or a bedroom (2-wall set).\n\nI've come up with a few photo ideas (personal projects, so there's no deadline) that would benefit from constructing a set like this, and certainly wouldn't work with just a simple backdrop.\n\nI'd like to hear from other photographers who have at least tried some set building. Is it worth the hassle? Did you build flats that follow the way movie flats are constructed ([wooden frame and luon sheet](https://www.diyphotography.net/building-a-set-101/)) or did you go with something more lightweight (e.g. [insulation foam](https://petapixel.com/2019/12/07/how-to-build-a-low-budget-photography-set/))? What materials do you prefer and why? Any other tips?", "link": "https://www.reddit.com/r/photography/comments/k37fxy/do_you_build_sets_for_your_shoots/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "do you build sets for your shoots? /!/ a few months ago i got access to a studio space shared by a few other photographers. i feel it's opened up a ton of possibilities that previously weren't available to me, at least not at such convenience. it's a very typical studio: six background rolls on the ceiling with ample space for lights and a good selection of lighting modifiers available. i really like it.\n\nbut sometimes the backdrops just don't feel like enough of an environment. full length portraits of people especially easily start to feel strange because there is no environment around them. i realised that the studio has enough room to host a small set the size of an elevator cabin, jail cell (3-wall set) or a bedroom (2-wall set).\n\ni've -----> come !!!  -----> up !!!  -----> with !!!  a few photo ideas (personal projects, so there's no deadline) that would benefit from constructing a set like this, and certainly wouldn't work -----> with !!!  just a simple backdrop.\n\ni'd like to hear from other photographers who have at least tried some set building. is it worth the hassle? did you build flats that follow the way movie flats are constructed ([wooden frame and luon sheet](https://www.diyphotography.net/building-a-set-101/)) or did you go with something more lightweight (e.g. [insulation foam](https://petapixel.com/2019/12/07/how-to-build-a-low-budget-photography-set/))? what materials do you prefer and why? any other tips?", "sortedWord": "None", "Identifyer": null, "identifyer": 84677, "year": "2020"}, {"autor": "Mesapholis", "date": "2020-12-13 17:30:22", "content": "Professional Photographers during Covid /!/ Hi I haven't seen a similar post to this, but if I missed it, I will gladly remove my post as not to spam the sub\n\nI am a freelance photographer on the side to my everyday job (Software dev) and I don't rely completely on my creative income during the pandemic. Nevertheless I have tried to come up with ideas to keep working, as photography still is a fulfilling part in my life and I couldn't bear without trying to work at least even during times like this.\n\nSo I came up with the idea of a small photoshoot-package, it is really not much but simply a Tinder-package. I thought of this, because people are very isolated at home, on their phones and it is hard enough to get to know people. So maybe having a small shoot with 3 well composed portrait pictures of themselves can at least help them 'up' their online dating game.\n\nFor me the combination of a 1h shoot at a location close to me (for me it was the entire inner city of Munich, as we have great public transport) and 3 edited portrait pictures as a package deal for 45€ worked. And I offered additional pictures for 8€ per piece on top of that. Usually people take 1-2 pictures on top of the package and as a small business of just me, it is completely value-added-tax-free (that is a thing in Germany - maybe this doesn't apply everywhere).  \nI review the photos in safe distance on my laptop with them and they tell me their top pics and edit them on the way home already. Payment on the spot or before sending the final photos without watermarks.\n\nIt has been quite successful in my city and I have landed a few jobs with it here and there, I would be happy if someone else finds my idea useful and can adapt and use it for themselves or share their own ideas which could help other creatives to get through this difficult times.  \nI also had great experience with my clients who were happy to organise something like this for themselves and they were really happy to receive help on posing and getting natural pictures for their social media", "link": "https://www.reddit.com/r/photography/comments/kcemsg/professional_photographers_during_covid/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "professional photographers during covid /!/ hi i haven't seen a similar post to this, but if i missed it, i will gladly remove my post as not to spam the sub\n\ni am a freelance photographer on the side to my everyday job (software dev) and i don't rely completely on my creative income during the pandemic. nevertheless i have tried to -----> come !!!  -----> up !!!  -----> with !!!  ideas to keep working, as photography still is a fulfilling part in my life and i couldn't bear without trying to work at least even during times like this.\n\nso i came up with the idea of a small photoshoot-package, it is really not much but simply a tinder-package. i thought of this, because people are very isolated at home, on their phones and it is hard enough to get to know people. so maybe having a small shoot with 3 well composed portrait pictures of themselves can at least help them 'up' their online dating game.\n\nfor me the combination of a 1h shoot at a location close to me (for me it was the entire inner city of munich, as we have great public transport) and 3 edited portrait pictures as a package deal for 45€ worked. and i offered additional pictures for 8€ per piece on top of that. usually people take 1-2 pictures on top of the package and as a small business of just me, it is completely value-added-tax-free (that is a thing in germany - maybe this doesn't apply everywhere).  \ni review the photos in safe distance on my laptop with them and they tell me their top pics and edit them on the way home already. payment on the spot or before sending the final photos without watermarks.\n\nit has been quite successful in my city and i have landed a few jobs with it here and there, i would be happy if someone else finds my idea useful and can adapt and use it for themselves or share their own ideas which could help other creatives to get through this difficult times.  \ni also had great experience with my clients who were happy to organise something like this for themselves and they were really happy to receive help on posing and getting natural pictures for their social media", "sortedWord": "None", "Identifyer": null, "identifyer": 85143, "year": "2020"}, {"autor": "MachPointZero", "date": "2020-12-15 22:18:47", "content": "Had the best shoot of my career only to be told that I can't use the images on Instagram due to her partner being jealous (long) /!/ Well damn it, feeling crushed! TL/DR at the bottom for those not wanting to wade through the fiasco.\n\nQuick backstory. I have a full time day job where I shoot video and stills for a company. I shoot fine art, fashion, editorial images outside of that job as a hobby. This was one of my for-fun, hobby shoots. At the end of the day, I'm more passionate about my hobby work as it's a much purer form of self-expression than my day job. \n\nOnward. \n\nI reached out to a contact that I've worked with previously on a commercial shoot, asking if she'd like to work together soon. Got a reply back right away with her being super stoked, said she'd been meaning to reach out to me and then sent along a bunch of creative inspirational images to get our gears turning. Included in those shots were some stunning fine art, abstract nude poses in nature, on rocks, in the woods, etc. We're fortunate to live in Sonoma County, so access to redwoods and big coastal rock formations is here at our finger tips. \n\nWe set our shoot date, continued to plan out the details and this last Sunday we both drove out to the coast and shot together for over four hours. Oh boy, we both pushed ourselves creatively too, working in the rain, cold, bugs, wet gear, soggy clothing, slippery rocks, hiking - all while really observing the landscape and features seeing how we could work her poses into what mother nature presented. I'm sure that sounds cheesy, but our creative wave lengths were in sync the entire time. She was often the one pulling the shots too, with my being there to make her vision to come to life. \n\nSunset came and went, blue hour set in and we headed back to our cars and the day was over. It was one of those shoots were you felt exhausted by the work and also completely energized by how smoothly it all went. There's so much less negative struggle involved when you find compatible, creative people that just get it and are helping to drive a shoot forward. \n\nThe images are stunning and I was STOKED to share. This is some of my best work, and I've been shooting people/models for about 15-years. Nothing about this shoot felt cheap, no shortcuts were taken and my hope was that these images would inspire future work by attracting other like-minded people to want to work with me. Hopes were REALLY high at this point. \n\nThis morning I fired off the gallery link to the model and got a reply back a few hours later. She explained how she loved the images, showed them to her partner who then went on a big rant about how he wasn't comfortable with the world seeing her nude, even censored. They got into a huge fight, and in the end she buckled to his fears to save the peace and agreed that they'd never see the light of day. \n\nGuess it's been a rough couple of days for her since the shoot, and it's not my place to say how two people should be together in a relationship. While on our shoot we were both chatting about how great it was to have supportive partners that each give us the trust to express ourselves creatively, but she said this shoot took him past some breaking point. From what I gather, they're already going through a rocky period and this shoot just really upset the apple cart. By the end of our chat, it was clear he has a lot of growing to do (in her own words). It was less about the images themselves and more to do with spending the day nude, with another man, with his viewpoint being that it's simply impossible that the experience wasn't somehow sexual and that the images won't be interpreted as being sexual. If he were to stumble onto these images, it would \"hit a sore spot\" so it's better to not post them at all.\n\nObviously I can't share the images, but if you look at [David Hanagan's IG feed](https://www.instagram.com/davidhanagan/), you can get a sense of what we shot, but with less of that faded IG look and even more dramatic surroundings. \n\nSome of the shots were with her in bodysuit and many had all her private areas completely hidden with the pose and/or with the landscape. Honestly, she has more revealing photos of herself in bikinis \"out on the lake\" or while hiking on her feed. Again, not the images but more to do with his insecurities. I feel like this shoot put the two of them at a pretty big crossroads, and that they were already headed in that direction anyway... \n\nSo what could I have done differently? Ah, some of you are probably already foaming at the mouth wanting to type, \"So idiot, this is why you have had her sign a release.\" I hear ya, but I'm not the kind of person that would leverage a release or contract over another person's head in this type of circumstance. Doing that would be a total dick move, it would make her situation worse and I'd ruin a few connected friendships in the process. \n\nIn the end she rightfully has taken complete responsibility for how this all turned out. She completely misjudged how her partner would react and in the end that relationship is more important than the images and my time. I get that. Could she have offered some money to make up for my time? Sure! However she didn't offer and through our LONG ass chats, it's clear she's going through some shit right now and I'm not really in need of any extra cash. Again, we've got some close mutual friends and keeping the peace is my #1 priority at this point. \n\nShe's now offering to let me use some of the images on my website, un-credited, so there's a small win.  \n\nAnyone else experience anything like this? Feels good to get this out in writing. \n\nTL/DR - Model sets up a shoot, comes up with the idea for a nude-based \"forms in nature\" style shoot, Images turn out GREAT, I'm beyond stoked, can't wait to share. Model loves them, causes big issues with sig-other, now I can't use the images on IG because he's an immature man-child who can't see nudity as being non-sexual. If you think I should have used a contract, please read the full story.", "link": "https://www.reddit.com/r/photography/comments/kdvx3q/had_the_best_shoot_of_my_career_only_to_be_told/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "had the best shoot of my career only to be told that i can't use the images on instagram due to her partner being jealous (long) /!/ well damn it, feeling crushed! tl/dr at the bottom for those not wanting to wade through the fiasco.\n\nquick backstory. i have a full time day job where i shoot video and stills for a company. i shoot fine art, fashion, editorial images outside of that job as a hobby. this was one of my for-fun, hobby shoots. at the end of the day, i'm more passionate about my hobby work as it's a much purer form of self-expression than my day job. \n\nonward. \n\ni reached out to a contact that i've worked with previously on a commercial shoot, asking if she'd like to work together soon. got a reply back right away with her being super stoked, said she'd been meaning to reach out to me and then sent along a bunch of creative inspirational images to get our gears turning. included in those shots were some stunning fine art, abstract nude poses in nature, on rocks, in the woods, etc. we're fortunate to live in sonoma county, so access to redwoods and big coastal rock formations is here at our finger tips. \n\nwe set our shoot date, continued to plan out the details and this last sunday we both drove out to the coast and shot together for over four hours. oh boy, we both pushed ourselves creatively too, working in the rain, cold, bugs, wet gear, soggy clothing, slippery rocks, hiking - all while really observing the landscape and features seeing how we could work her poses into what mother nature presented. i'm sure that sounds cheesy, but our creative wave lengths were in sync the entire time. she was often the one pulling the shots too, with my being there to make her vision to come to life. \n\nsunset came and went, blue hour set in and we headed back to our cars and the day was over. it was one of those shoots were you felt exhausted by the work and also completely energized by how smoothly it all went. there's so much less negative struggle involved when you find compatible, creative people that just get it and are helping to drive a shoot forward. \n\nthe images are stunning and i was stoked to share. this is some of my best work, and i've been shooting people/models for about 15-years. nothing about this shoot felt cheap, no shortcuts were taken and my hope was that these images would inspire future work by attracting other like-minded people to want to work with me. hopes were really high at this point. \n\nthis morning i fired off the gallery link to the model and got a reply back a few hours later. she explained how she loved the images, showed them to her partner who then went on a big rant about how he wasn't comfortable with the world seeing her nude, even censored. they got into a huge fight, and in the end she buckled to his fears to save the peace and agreed that they'd never see the light of day. \n\nguess it's been a rough couple of days for her since the shoot, and it's not my place to say how two people should be together in a relationship. while on our shoot we were both chatting about how great it was to have supportive partners that each give us the trust to express ourselves creatively, but she said this shoot took him past some breaking point. from what i gather, they're already going through a rocky period and this shoot just really upset the apple cart. by the end of our chat, it was clear he has a lot of growing to do (in her own words). it was less about the images themselves and more to do with spending the day nude, with another man, with his viewpoint being that it's simply impossible that the experience wasn't somehow sexual and that the images won't be interpreted as being sexual. if he were to stumble onto these images, it would \"hit a sore spot\" so it's better to not post them at all.\n\nobviously i can't share the images, but if you look at [david hanagan's ig feed](https://www.instagram.com/davidhanagan/), you can get a sense of what we shot, but with less of that faded ig look and even more dramatic surroundings. \n\nsome of the shots were with her in bodysuit and many had all her private areas completely hidden with the pose and/or with the landscape. honestly, she has more revealing photos of herself in bikinis \"out on the lake\" or while hiking on her feed. again, not the images but more to do with his insecurities. i feel like this shoot put the two of them at a pretty big crossroads, and that they were already headed in that direction anyway... \n\nso what could i have done differently? ah, some of you are probably already foaming at the mouth wanting to type, \"so idiot, this is why you have had her sign a release.\" i hear ya, but i'm not the kind of person that would leverage a release or contract over another person's head in this type of circumstance. doing that would be a total dick move, it would make her situation worse and i'd ruin a few connected friendships in the process. \n\nin the end she rightfully has taken complete responsibility for how this all turned out. she completely misjudged how her partner would react and in the end that relationship is more important than the images and my time. i get that. could she have offered some money to make up for my time? sure! however she didn't offer and through our long ass chats, it's clear she's going through some shit right now and i'm not really in need of any extra cash. again, we've got some close mutual friends and keeping the peace is my #1 priority at this point. \n\nshe's now offering to let me use some of the images on my website, un-credited, so there's a small win.  \n\nanyone else experience anything like this? feels good to get this out in writing. \n\ntl/dr - model sets -----> up !!!  a shoot, -----> comes !!!  -----> up !!!  -----> with !!!  the idea for a nude-based \"forms in nature\" style shoot, images turn out great, i'm beyond stoked, can't wait to share. model loves them, causes big issues with sig-other, now i can't use the images on ig because he's an immature man-child who can't see nudity as being non-sexual. if you think i should have used a contract, please read the full story.", "sortedWord": "None", "Identifyer": null, "identifyer": 85227, "year": "2020"}, {"autor": "vedant_r_devil", "date": "2020-02-10 04:45:23", "content": "Best Instant Cameras in the 50-70$ range /!/ Here's the list I've come up with so far, do let me know your opinion.\n\n\\- The Fuji Mini 70 (50$): It's better than the Mini 9 at the same price and is so far what I'm leaning towards. The price per picture is about 70 cents.\n\n\\-  The Kodak Printomatic (50$): Contains a rechargeable battery, MicroSD slot, and more importantly takes larger pictures (50x74mm) than the Fuji (46x64mm). Don't know about the image quality for this camera though. The price per picture is about 50 cents. \n\n\\- Fujifilm Instax Mini 7S (35$):  Basically the older model of the Mini 9. The only feature it lacks is the recommended exposure setting. \n\n\\- Polaroid One Step 2 (70$)\n\n\\- Polaroid 600: Originals are for sale on Esty for about 30-40$. The price per picture is more expensive, about 2$.", "link": "https://www.reddit.com/r/photography/comments/f1l9et/best_instant_cameras_in_the_5070_range/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "best instant cameras in the 50-70$ range /!/ here's the list i've -----> come !!!  -----> up !!!  -----> with !!!  so far, do let me know your opinion.\n\n\\- the fuji mini 70 (50$): it's better than the mini 9 at the same price and is so far what i'm leaning towards. the price per picture is about 70 cents.\n\n\\-  the kodak printomatic (50$): contains a rechargeable battery, microsd slot, and more importantly takes larger pictures (50x74mm) than the fuji (46x64mm). don't know about the image quality for this camera though. the price per picture is about 50 cents. \n\n\\- fujifilm instax mini 7s (35$):  basically the older model of the mini 9. the only feature it lacks is the recommended exposure setting. \n\n\\- polaroid one step 2 (70$)\n\n\\- polaroid 600: originals are for sale on esty for about 30-40$. the price per picture is more expensive, about 2$.", "sortedWord": "None", "Identifyer": null, "identifyer": 86868, "year": "2020"}, {"autor": "BabeVigodas", "date": "2020-02-06 13:37:16", "content": "25 guitars /!/ I’m working on a personal project, I want to get a portrait of my father with his guitar collection. There are about 25 guitars. Hoping to come up with some interesting way to display them. He is hesitant to load them all up and go somewhere (I was originally thinking an outdoor amphitheater or something with staggered tiers to place the guitars around him.)  We will most likely be working in his home. I’m considering possibly hanging some them from fishing line with others on stands on the ground. Any one have a brilliant idea that won’t require a huge amount of work or permanent alterations to a wall 😂?", "link": "https://www.reddit.com/r/photography/comments/ezsgrl/25_guitars/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "25 guitars /!/ i’m working on a personal project, i want to get a portrait of my father with his guitar collection. there are about 25 guitars. hoping to -----> come !!!  -----> up !!!  -----> with !!!  some interesting way to display them. he is hesitant to load them all up and go somewhere (i was originally thinking an outdoor amphitheater or something with staggered tiers to place the guitars around him.)  we will most likely be working in his home. i’m considering possibly hanging some them from fishing line with others on stands on the ground. any one have a brilliant idea that won’t require a huge amount of work or permanent alterations to a wall 😂?", "sortedWord": "None", "Identifyer": null, "identifyer": 86894, "year": "2020"}, {"autor": "artful_alien", "date": "2020-03-17 10:56:10", "content": "Non-contact Camera Club activity ideas /!/ Hi everyone,\n\nI’m on the committee of my local camera club, and we have had to cancel all upcoming meetings and excursions due to the dreaded ‘c’ word!\n\nI’m trying to come up with some ideas for ways to virtually connect in the weeks and months to come, so I thought I’d canvas for ideas - there would be thousands of clubs worldwide in the same position right now!\n\nWe have an active Facebook group and monthly competitions (theme images etc) which will keep going - but I want to do something extra to really build more of an online presence, and a real community presence.\n\nI’ll note that we are not (yet) under lockdown so we are allowed out of the house - but are recommended to stay away from gatherings etc.\n\nSome ideas:\n- editing challenges (one image shared for members to edit as they wish)\n- more frequent theme challenges\n- ‘synchronized sunset’ or similar shoot (everyone shooting from their own location)\n- a Facebook ‘watch party’ to watch a tutorial or documentary together on Facebook and discuss \n- ‘what is this’ or ‘where in the world is this’ (members submit abstract or macros and members have to guess what / where it is)\n- virtual club meetings (I’m trying to find software that is easy and cheap / free - grateful for suggestions)\n- enter some photography competitions (I’d love any suggestions for group competitions particularly)\n\nPlease help me add to this list! I’d love to hear your activities / challenges / online portal ideas!!", "link": "https://www.reddit.com/r/photography/comments/fk3a7b/noncontact_camera_club_activity_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "non-contact camera club activity ideas /!/ hi everyone,\n\ni’m on the committee of my local camera club, and we have had to cancel all upcoming meetings and excursions due to the dreaded ‘c’ word!\n\ni’m trying to -----> come !!!  -----> up !!!  -----> with !!!  some ideas for ways to virtually connect in the weeks and months to -----> come !!! , so i thought i’d canvas for ideas - there would be thousands of clubs worldwide in the same position right now!\n\nwe have an active facebook group and monthly competitions (theme images etc) which will keep going - but i want to do something extra to really build more of an online presence, and a real community presence.\n\ni’ll note that we are not (yet) under lockdown so we are allowed out of the house - but are recommended to stay away from gatherings etc.\n\nsome ideas:\n- editing challenges (one image shared for members to edit as they wish)\n- more frequent theme challenges\n- ‘synchronized sunset’ or similar shoot (everyone shooting from their own location)\n- a facebook ‘watch party’ to watch a tutorial or documentary together on facebook and discuss \n- ‘what is this’ or ‘where in the world is this’ (members submit abstract or macros and members have to guess what / where it is)\n- virtual club meetings (i’m trying to find software that is easy and cheap / free - grateful for suggestions)\n- enter some photography competitions (i’d love any suggestions for group competitions particularly)\n\nplease help me add to this list! i’d love to hear your activities / challenges / online portal ideas!!", "sortedWord": "None", "Identifyer": null, "identifyer": 87235, "year": "2020"}, {"autor": "kaylahzoe", "date": "2020-03-25 22:06:52", "content": "Wanted to experiment a bit more with some portrait photos I took earlier this year and came up with this, what do you guys think??", "link": "https://www.reddit.com/r/photography/comments/fozbb7/wanted_to_experiment_a_bit_more_with_some/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "wanted to experiment a bit more -----> with !!!  some portrait photos i took earlier this year and -----> came !!!  -----> up !!!  -----> with !!!  this, what do you guys think??", "sortedWord": "None", "Identifyer": null, "identifyer": 87367, "year": "2020"}, {"autor": "blitzkrieg9", "date": "2020-01-22 23:11:24", "content": "Hello! I know just enough about photography to make a funny post about photography elsewhere. Please help me understand/ interpret what my brain came up with! /!/ So, this is what I posted:  \n\n\"Agree 100%.  That looks like a Nikon P-3100b macro enhanced lens.  Don't get me wrong, it's a great lens. But it's best used in low light conditions from a tripod. Unless he preadjusted his O and T levels, that shot is probably going to be severely overexposed resulting in \"grayscale\".  Not to mention the rapid motion and \"kneepod\" shooting position.  \n\nAlso, I just made all that up and dont know shit about photography.\"  \n\n\nI was responding to a NSFW post about a creepy cameraman.  I can post link here if allowed. Anyway, there is a grain of truth in my statements, but I don't know how I know. \n\n1) That lens sounds legit, right?  Don't cameras and lenses have alphanumeric names for some reason?\n\n2) cameras have an adjustable \"level\", yes?  I want to say O level is correct, but I can't imagine what that would stand for. I think it has something to do with light or exposure. L level? E level?  What am I thinking of?\n\n3) overexposed I'm certain is a term. Right?  I was going to say something about contrast, but I switched to \"grayscale\" instead. But, I was thinking \"whiteout\".  Is that a  term?  Or whiteness?  Or white level?  \n\n4) i think i invented/  coined \"kneepod\".  But now I'm thinking that is prob already a term. Is it?  Is that a thing?\n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/esjz3m/hello_i_know_just_enough_about_photography_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "hello! i know just enough about photography to make a funny post about photography elsewhere. please help me understand/ interpret what my brain -----> came !!!  -----> up !!!  -----> with !!! ! /!/ so, this is what i posted:  \n\n\"agree 100%.  that looks like a nikon p-3100b macro enhanced lens.  don't get me wrong, it's a great lens. but it's best used in low light conditions from a tripod. unless he preadjusted his o and t levels, that shot is probably going to be severely overexposed resulting in \"grayscale\".  not to mention the rapid motion and \"kneepod\" shooting position.  \n\nalso, i just made all that up and dont know shit about photography.\"  \n\n\ni was responding to a nsfw post about a creepy cameraman.  i can post link here if allowed. anyway, there is a grain of truth in my statements, but i don't know how i know. \n\n1) that lens sounds legit, right?  don't cameras and lenses have alphanumeric names for some reason?\n\n2) cameras have an adjustable \"level\", yes?  i want to say o level is correct, but i can't imagine what that would stand for. i think it has something to do with light or exposure. l level? e level?  what am i thinking of?\n\n3) overexposed i'm certain is a term. right?  i was going to say something about contrast, but i switched to \"grayscale\" instead. but, i was thinking \"whiteout\".  is that a  term?  or whiteness?  or white level?  \n\n4) i think i invented/  coined \"kneepod\".  but now i'm thinking that is prob already a term. is it?  is that a thing?\n\nthanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 87916, "year": "2020"}, {"autor": "cryptodesign", "date": "2020-01-30 15:38:06", "content": "10 Tips on photographing 'Abstract Landscapes' /!/ As a landscape photographer I’m a big fan of grand vistas and photographing with wide angle lenses. But sometimes the smaller things can be just as impressive. In this little article I’ll be I am giving some tips to you Redditers to hopefully give you some inspiration when photographing abstracts. And when you start to see them, you can’t stop photographing them. It’s very addicting!\n\n&amp;#x200B;\n\n1. Look down.\n\nWe tend to look forward and see the bigger picture. But beauty is often just at our feet. Go low to the ground and look down occasionally. You’ll find all kinds of interesting things. Think of textures on stones, lines little plants, patterns, contrast. Lots of interesting abstract shapes can be found on the ground.\n\n&amp;#x200B;\n\n[A simple mud cracks pattern](https://preview.redd.it/ke5i10j4qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=cf445712636425af84d3357796a4dd5d3b1dc678)\n\n[Autumn vegetation on the ground](https://preview.redd.it/6wb7k3q6qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=1c0b7c9371ff213fab85e668a53f3b446da78d1e)\n\n2. You don't need a macro lens.\n\nAbstract landscapes can be shot with any kind of lens. I usually shoot them with a 24-70 (close focus is a pre) or sometimes a longer lens to capture patterns in the distance.\n\n[Black sand ripples caused by the tide in Iceland](https://preview.redd.it/ygm7yhf9qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=b266d6823541a0b3f913124267ee8b5f4f4784d0)\n\n3. Look at lines\n\nWhen looking at subjects, find lines and try to balance them in your frame. Lines going from a corner into the frame often work well. Flowing lines also give a nice feel to an image.\n\n&amp;#x200B;\n\n[Interesting lines and textures on a hill in Iceland](https://preview.redd.it/1sgv7aibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=ff7b15c14aa0cf728ffae3329cfbd2918da011d6)\n\n[Grassy hills in Kyrgyzstan](https://preview.redd.it/av1g1bibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=973d3f010894ea66be98a24a63ea65bd116c8a31)\n\n[Lines on a piece of ice going from bright to dark](https://preview.redd.it/da3krbibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7076b84a57688758ef1ab1407e2ceeeaeb57147e)\n\n4. Look at color contrast\n\nA combination of 2 Colors or dark and bright tones often work well in abstracts.\n\n&amp;#x200B;\n\n[A combination of colour contrast and lines on a close up of a house in Burano, Venice.](https://preview.redd.it/uln6oufmqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7be064e264cbc6d811a8f9442a6df97878aa54f0)\n\n[Little sand bumps hit by the sun turn to gold. The dark and bright works well here.](https://preview.redd.it/mw6526foqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=d1f55ee4c2b6bb2373cd00b75d1782b9ebb5e247)\n\n5. Lose perspective and scale. This has to do with looking at the smaller things in the ‘bigger’ picture again. When photographing abstracts its important to not show the surrounding. This way the viewer has no idea about the scale and perspective. When you photograph a sand texture the right way for example, it can look like a desert from above. It’s fun to trick the viewer and let them think about your photo.\n\n[This could be an image of a desert shot from a plane, but its actually just a shot of some sand ripples shot with a 24-70 lens.](https://preview.redd.it/t0hlbi3qqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7a4a67771d18590308c15f486b137935ee1aec4d)\n\n6. Find single objects in negative space\n\n&amp;#x200B;\n\n[Showing a lot of emptiness in the frame with a small subject gives a nice abstract look.](https://preview.redd.it/7zqcsirrqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=fd3676dbd6119b370420b226718cca62b8c290d4)\n\nhttps://preview.redd.it/jd0g2h5tqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=f0eec8ede35df559dd5f189f1ca89327037b88ea\n\n7. Go to the beach! The beach often has lots of sand textures. Especially when the tide is low you can find patterns in the sand everywhere. They sometimes look like aerials and completely let the viewer lose perspective.\n\n&amp;#x200B;\n\n[A sand texture hit from the side by sunlight.](https://preview.redd.it/0fq32u4vqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7552178819c8ba2a8498241ab0b66e8bc2f688ed)\n\n&amp;#x200B;\n\n8. Water. Water by itself is just incredible. Think of falling water from a waterfall or just the tap at home! Falling water in different strengths creates beautiful pattern. When photograph falling water, use an extremely fast shutter speed (1/1000 or faster) and just shoot away. You’ll see you come up with lots of interesting shots! But not only falling water. Also ripples in the sea can create interesting photos depending on how the waves are and how the light hits. And then there is frozen water. Frozen water creates cracks and interesting ice textures.\n\n&amp;#x200B;\n\n[Dropping water from a waterfall](https://preview.redd.it/jirtikiyqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9ed3cc5f934c7d1ed57e4c77901ecbd2c578de50)\n\n&amp;#x200B;\n\n[Waves](https://preview.redd.it/qbt9w6uzqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=6c9df7d66b1dcd725c47865fd099667162e200fe)\n\n[A frozen piece of ice from up close looks like a hallucination pattern](https://preview.redd.it/nrtsh9mwqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7ead1a46e24dbd28a1bb8a12dd71b5dc2a7a27ff)\n\n[Shapes in a frozen puddle](https://preview.redd.it/7dazc9t0rxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=4c11e44d2a7cb2fc77fd9899d5d9e5845523e6ab)\n\n9. Harsh light and shadows.\n\nHarsh light during the day is often not great for landscape photography. But for abstracts it can be great. By playing with shapes and lines in harsh shadows you can sometimes create interesting abstract looks.\n\n&amp;#x200B;\n\n*Processing img fhz6we44rxd41...*\n\n10 Look up close. Abstract landscapes are everywhere. You just have to learn to see them. Textures in stones, lines in plants, clouds. The trick is to look closely. Look closer to everything you see in daily life and you’ll be surprised how much interesting things you see. But be-careful, its very addicting! :)", "link": "https://www.reddit.com/r/photography/comments/ew772j/10_tips_on_photographing_abstract_landscapes/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "10 tips on photographing 'abstract landscapes' /!/ as a landscape photographer i’m a big fan of grand vistas and photographing with wide angle lenses. but sometimes the smaller things can be just as impressive. in this little article i’ll be i am giving some tips to you redditers to hopefully give you some inspiration when photographing abstracts. and when you start to see them, you can’t stop photographing them. it’s very addicting!\n\n&amp;#x200b;\n\n1. look down.\n\nwe tend to look forward and see the bigger picture. but beauty is often just at our feet. go low to the ground and look down occasionally. you’ll find all kinds of interesting things. think of textures on stones, lines little plants, patterns, contrast. lots of interesting abstract shapes can be found on the ground.\n\n&amp;#x200b;\n\n[a simple mud cracks pattern](https://preview.redd.it/ke5i10j4qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=cf445712636425af84d3357796a4dd5d3b1dc678)\n\n[autumn vegetation on the ground](https://preview.redd.it/6wb7k3q6qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=1c0b7c9371ff213fab85e668a53f3b446da78d1e)\n\n2. you don't need a macro lens.\n\nabstract landscapes can be shot with any kind of lens. i usually shoot them with a 24-70 (close focus is a pre) or sometimes a longer lens to capture patterns in the distance.\n\n[black sand ripples caused by the tide in iceland](https://preview.redd.it/ygm7yhf9qxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=b266d6823541a0b3f913124267ee8b5f4f4784d0)\n\n3. look at lines\n\nwhen looking at subjects, find lines and try to balance them in your frame. lines going from a corner into the frame often work well. flowing lines also give a nice feel to an image.\n\n&amp;#x200b;\n\n[interesting lines and textures on a hill in iceland](https://preview.redd.it/1sgv7aibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=ff7b15c14aa0cf728ffae3329cfbd2918da011d6)\n\n[grassy hills in kyrgyzstan](https://preview.redd.it/av1g1bibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=973d3f010894ea66be98a24a63ea65bd116c8a31)\n\n[lines on a piece of ice going from bright to dark](https://preview.redd.it/da3krbibqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7076b84a57688758ef1ab1407e2ceeeaeb57147e)\n\n4. look at color contrast\n\na combination of 2 colors or dark and bright tones often work well in abstracts.\n\n&amp;#x200b;\n\n[a combination of colour contrast and lines on a close up of a house in burano, venice.](https://preview.redd.it/uln6oufmqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7be064e264cbc6d811a8f9442a6df97878aa54f0)\n\n[little sand bumps hit by the sun turn to gold. the dark and bright works well here.](https://preview.redd.it/mw6526foqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=d1f55ee4c2b6bb2373cd00b75d1782b9ebb5e247)\n\n5. lose perspective and scale. this has to do with looking at the smaller things in the ‘bigger’ picture again. when photographing abstracts its important to not show the surrounding. this way the viewer has no idea about the scale and perspective. when you photograph a sand texture the right way for example, it can look like a desert from above. it’s fun to trick the viewer and let them think about your photo.\n\n[this could be an image of a desert shot from a plane, but its actually just a shot of some sand ripples shot with a 24-70 lens.](https://preview.redd.it/t0hlbi3qqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7a4a67771d18590308c15f486b137935ee1aec4d)\n\n6. find single objects in negative space\n\n&amp;#x200b;\n\n[showing a lot of emptiness in the frame with a small subject gives a nice abstract look.](https://preview.redd.it/7zqcsirrqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=fd3676dbd6119b370420b226718cca62b8c290d4)\n\nhttps://preview.redd.it/jd0g2h5tqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=f0eec8ede35df559dd5f189f1ca89327037b88ea\n\n7. go to the beach! the beach often has lots of sand textures. especially when the tide is low you can find patterns in the sand everywhere. they sometimes look like aerials and completely let the viewer lose perspective.\n\n&amp;#x200b;\n\n[a sand texture hit from the side by sunlight.](https://preview.redd.it/0fq32u4vqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7552178819c8ba2a8498241ab0b66e8bc2f688ed)\n\n&amp;#x200b;\n\n8. water. water by itself is just incredible. think of falling water from a waterfall or just the tap at home! falling water in different strengths creates beautiful pattern. when photograph falling water, use an extremely fast shutter speed (1/1000 or faster) and just shoot away. you’ll see you -----> come !!!  -----> up !!!  -----> with !!!  lots of interesting shots! but not only falling water. also ripples in the sea can create interesting photos depending on how the waves are and how the light hits. and then there is frozen water. frozen water creates cracks and interesting ice textures.\n\n&amp;#x200b;\n\n[dropping water from a waterfall](https://preview.redd.it/jirtikiyqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9ed3cc5f934c7d1ed57e4c77901ecbd2c578de50)\n\n&amp;#x200b;\n\n[waves](https://preview.redd.it/qbt9w6uzqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=6c9df7d66b1dcd725c47865fd099667162e200fe)\n\n[a frozen piece of ice from up close looks like a hallucination pattern](https://preview.redd.it/nrtsh9mwqxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=7ead1a46e24dbd28a1bb8a12dd71b5dc2a7a27ff)\n\n[shapes in a frozen puddle](https://preview.redd.it/7dazc9t0rxd41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=4c11e44d2a7cb2fc77fd9899d5d9e5845523e6ab)\n\n9. harsh light and shadows.\n\nharsh light during the day is often not great for landscape photography. but for abstracts it can be great. by playing with shapes and lines in harsh shadows you can sometimes create interesting abstract looks.\n\n&amp;#x200b;\n\n*processing img fhz6we44rxd41...*\n\n10 look up close. abstract landscapes are everywhere. you just have to learn to see them. textures in stones, lines in plants, clouds. the trick is to look closely. look closer to everything you see in daily life and you’ll be surprised how much interesting things you see. but be-careful, its very addicting! :)", "sortedWord": "None", "Identifyer": null, "identifyer": 88045, "year": "2020"}, {"autor": "neoofmatrix", "date": "2020-07-12 18:11:29", "content": "Affinity Photo – A simple review and some comments after a brief use /!/ Around May I saw some chatter around Affinity Photo being on sale. Even though I do not use pixel editors much, and did not have enough time to trial, I just bought it and kept it aside to see if it can help me. After using for a few weeks, I felt it will be good to share a user review.\n\n**Elephant in the room:**\n\nBefore I begin, I do not use any Adobe products and hence there will be no comparisons. While I will discuss some aspects with regards to other tools, I want to be sure you may feel free to add any corrections towards any reference without prejudice.\n\n\n**RAW Editor vs Pixel Editor:**\n\nI have been pretty much using RAW editors for a long time and my Go-To tools are Capture NX-D, darktable, RawTherapee, DXO and recently Capture One Express. As you can see, I do not stick to one tool and I like to play around tools. \ndarktable is my primary Raw editor and most of the pixel level edits can be simply done within dt. But for anything more, I use Gimp for layers, a bit of masking and that is about it. So my experience with pixel editors is extremely limited. However, I have used Photoshop when I was in school and the good thing about using darktable is you learn a lot of underlying logic, rather than one button/slider that does things for you. So, I cannot rate myself a beginner but more an intermediate user of Affinity right off the bat.\n\n**What I like:**\n\nThis tool is fast and almost makes me feel like everything I used is slow.\nIt feels like one of those new age tools that are built in this millennium. You open a brush and hover over, it will show a real-time preview. If you open a curves layer, you can go back and adjust which layer it will impact and how much opacity you need, or even turn off background layers to better see what result will look good. All this while still having the curves adjustment layer open and ready to take changes.\nYou can plan around and make almost all changes non-destructive within the file. Want to apply blur and then reduce it later, possible. Want to double the sharpening and then reduce it by 75%, simple. Changed your mind and want to localize sharpening again. There is no concept of smart objects, just change the adjustment layers and it is all done.\nBy default, all adjustment layers are full opacity mask layers, so saves a lot of time if you want any further adjustments.\nHandling of tif and jpeg colors is nice. I know this is a strange thing to say, but coming from Raw editors, it is a high bar for pixel editors, and I like colors from AFP quite a lot. (It is not the same for Raw files)\nThe selection tool is just to the point and very good and the in-paining tool (similar but not as powerful as content aware in PS) is a nifty tool that saves a lot of clicks. Gradient tool is easy to use again, you can make it editable via fx options.\n\n\n**What I do not like:**\n\nThe brush preview sometimes could be delayed, which means you will brush on areas that are not intended as the effect will appear later.\nThe RAW editor is sub-par. It is not even user friendly. Perhaps a dead give-away that Affinity will come up with a Lightroom competitor and want to keep the Raw editor rather limited. This is not a deal breaker for me as I have plenty of Raw editors, and as I play around, I realize it is capable.\n\n**In Summary:**\n\nI paid the 50% discount price and I am yet to wrap my head around the fact, people are not jumping over this tool for full price. I prefer an open source workflow and I did not need it when I bought it, but I can see this becoming my primary editing tool simply because it makes my work a lot faster.", "link": "https://www.reddit.com/r/photography/comments/hpyz4l/affinity_photo_a_simple_review_and_some_comments/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "affinity photo – a simple review and some comments after a brief use /!/ around may i saw some chatter around affinity photo being on sale. even though i do not use pixel editors much, and did not have enough time to trial, i just bought it and kept it aside to see if it can help me. after using for a few weeks, i felt it will be good to share a user review.\n\n**elephant in the room:**\n\nbefore i begin, i do not use any adobe products and hence there will be no comparisons. while i will discuss some aspects with regards to other tools, i want to be sure you may feel free to add any corrections towards any reference without prejudice.\n\n\n**raw editor vs pixel editor:**\n\ni have been pretty much using raw editors for a long time and my go-to tools are capture nx-d, darktable, rawtherapee, dxo and recently capture one express. as you can see, i do not stick to one tool and i like to play around tools. \ndarktable is my primary raw editor and most of the pixel level edits can be simply done within dt. but for anything more, i use gimp for layers, a bit of masking and that is about it. so my experience with pixel editors is extremely limited. however, i have used photoshop when i was in school and the good thing about using darktable is you learn a lot of underlying logic, rather than one button/slider that does things for you. so, i cannot rate myself a beginner but more an intermediate user of affinity right off the bat.\n\n**what i like:**\n\nthis tool is fast and almost makes me feel like everything i used is slow.\nit feels like one of those new age tools that are built in this millennium. you open a brush and hover over, it will show a real-time preview. if you open a curves layer, you can go back and adjust which layer it will impact and how much opacity you need, or even turn off background layers to better see what result will look good. all this while still having the curves adjustment layer open and ready to take changes.\nyou can plan around and make almost all changes non-destructive within the file. want to apply blur and then reduce it later, possible. want to double the sharpening and then reduce it by 75%, simple. changed your mind and want to localize sharpening again. there is no concept of smart objects, just change the adjustment layers and it is all done.\nby default, all adjustment layers are full opacity mask layers, so saves a lot of time if you want any further adjustments.\nhandling of tif and jpeg colors is nice. i know this is a strange thing to say, but coming from raw editors, it is a high bar for pixel editors, and i like colors from afp quite a lot. (it is not the same for raw files)\nthe selection tool is just to the point and very good and the in-paining tool (similar but not as powerful as content aware in ps) is a nifty tool that saves a lot of clicks. gradient tool is easy to use again, you can make it editable via fx options.\n\n\n**what i do not like:**\n\nthe brush preview sometimes could be delayed, which means you will brush on areas that are not intended as the effect will appear later.\nthe raw editor is sub-par. it is not even user friendly. perhaps a dead give-away that affinity will -----> come !!!  -----> up !!!  -----> with !!!  a lightroom competitor and want to keep the raw editor rather limited. this is not a deal breaker for me as i have plenty of raw editors, and as i play around, i realize it is capable.\n\n**in summary:**\n\ni paid the 50% discount price and i am yet to wrap my head around the fact, people are not jumping over this tool for full price. i prefer an open source workflow and i did not need it when i bought it, but i can see this becoming my primary editing tool simply because it makes my work a lot faster.", "sortedWord": "None", "Identifyer": null, "identifyer": 89022, "year": "2020"}], "name": "withphotography2020"}