{"interestingcomments": [{"autor": "awgong", "date": "2019-08-09 00:57:26", "content": "How to organize an one hour photoshoot for a group of 7? /!/ I have a shoot coming in 3 weeks, and it's a party of 7 girls.\n\nI have shot a lot of single, couple or family photoshoot, but I have never done a group of 7 before, and I don't how should I organize it.\n\nLike where should I take them? How can I come up with different poses for a group 7 people?", "link": "https://www.reddit.com/r/photography/comments/cnuxvm/how_to_organize_an_one_hour_photoshoot_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to organize an one hour photoshoot for a group of 7? /!/ i have a shoot coming in 3 weeks, and it's a party of 7 girls.\n\ni have shot a lot of single, couple or family photoshoot, but i have never done a group of 7 before, and i don't how should i organize it.\n\nlike where should i take them? how can i -----> come !!!  -----> up !!!  -----> with !!!  different poses for a group 7 people?", "sortedWord": "None", "Identifyer": null, "identifyer": 1044, "year": "2019"}, {"autor": "awgong", "date": "2019-08-09 00:54:13", "content": "How to organize an group photoshoot? /!/ I have a shoot coming in 3 weeks, and it's a party of 7 girls. \n\nI have shot a lot of single, couple or family photoshoot, but I have never done a group of 7 before, and I don't how should I organize it. \n\nLike where should I take them? How can I come up with different poses for a group 7 people? \n\n&amp;#x200B;\n\nNeed advice", "link": "https://www.reddit.com/r/photography/comments/cnuwht/how_to_organize_an_group_photoshoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to organize an group photoshoot? /!/ i have a shoot coming in 3 weeks, and it's a party of 7 girls. \n\ni have shot a lot of single, couple or family photoshoot, but i have never done a group of 7 before, and i don't how should i organize it. \n\nlike where should i take them? how can i -----> come !!!  -----> up !!!  -----> with !!!  different poses for a group 7 people? \n\n&amp;#x200b;\n\nneed advice", "sortedWord": "None", "Identifyer": null, "identifyer": 1045, "year": "2019"}, {"autor": "here_coz_of_WC", "date": "2019-09-03 17:01:11", "content": "Feel like I am facing a creativity block and unable to come up with original ideas or develop a style. How do I change this? /!/ I started photography about 6 months back and bought a Mirrorless camera about 4 months back. Initially started with street and landscape and after doing it for 3 or a bit more months I started doing portraits for a number of reasons. I feel I like it much more (the story may be a post in itself and not really relevant to the discussion) and would like to get really good in this field (I know it must take a lot of time). I must say that I have a day job so photography isn't something I depend on for money and that is why I think I have full freedom to explore this area without caring about the monetary side of things.\n\nSo far I am just taking pics of pretty girls. And without sounding cheesy, cliched or a pervert I would say that my idea is to capture female beauty since it really fascinates me. Some photographers that inspire me are Dubnistkiy, Ana Dias, Haris Nukem. \n\nAfter shooting portraits for about 2 months (all outdoor shoots in my city) I feel like every shoot of mine is now getting repetitive. Repetitive in the sense that I end up having less and less variety in my pics with each shoot. I especially realized this in the last shoot when I was just standing not sure of what to do. Moreover, I feel that I am unable to come up with something unique and my pics end up looking like so many others on Instagram. I have posted my pics on other subreddits (with a different account) here and some have got a lot of appreciation so I don't think I am necessarily taking bad pics. \n\nBut I feel that I am not able to come up with something unique or develop a style. Constrained by my sorroundings I am also not able to do lots of things that I would like to do. For example, I live in a big city so my themes so far have been all urban in nature. There are some parks here but parks seem artificial and I would like shooting in more natural locations say a farm, near the sea or something else. When I travel I would do those things but at the moment what I am unable to fix is a lack of creativity.\n\nI don't want to just be a guy with a camera who is taking pics of pretty girls since so many are doing that. I would really like to be good at this and develop a style and inspire others since I feel I have the resources and time and money to fully follow my passion. But I am not sure what to do next. Right now my photography gear consists of a Mirrorless camera and a prime lens 85mm F1.8 (and 2 kit lenses which I don't use now).\n\nSo what should I do next?\n\n1. Buy more gear? Like lighting equipment etc? \n2. Try to come up with new ideas? If yes then how? Travelling to new locations? Looking at the works of more photographers? Or something else.\n3. Spend time trying to build a style. I am not sure if I can choose it, maybe it would develop with time.\n4. Or just keep shooting and try to get better. I will keep shooting but at the same time, I want to improve at a faster rate and to escape this creative block.\n\nWould really appreciate any advice. Here are some of my pics [https://imgur.com/a/uiYquwy](https://imgur.com/a/uiYquwy)", "link": "https://www.reddit.com/r/photography/comments/cz7ljm/feel_like_i_am_facing_a_creativity_block_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "feel like i am facing a creativity block and unable to -----> come !!!  -----> up !!!  -----> with !!!  original ideas or develop a style. how do i change this? /!/ i started photography about 6 months back and bought a mirrorless camera about 4 months back. initially started with street and landscape and after doing it for 3 or a bit more months i started doing portraits for a number of reasons. i feel i like it much more (the story may be a post in itself and not really relevant to the discussion) and would like to get really good in this field (i know it must take a lot of time). i must say that i have a day job so photography isn't something i depend on for money and that is why i think i have full freedom to explore this area without caring about the monetary side of things.\n\nso far i am just taking pics of pretty girls. and without sounding cheesy, cliched or a pervert i would say that my idea is to capture female beauty since it really fascinates me. some photographers that inspire me are dubnistkiy, ana dias, haris nukem. \n\nafter shooting portraits for about 2 months (all outdoor shoots in my city) i feel like every shoot of mine is now getting repetitive. repetitive in the sense that i end up having less and less variety in my pics with each shoot. i especially realized this in the last shoot when i was just standing not sure of what to do. moreover, i feel that i am unable to come up with something unique and my pics end up looking like so many others on instagram. i have posted my pics on other subreddits (with a different account) here and some have got a lot of appreciation so i don't think i am necessarily taking bad pics. \n\nbut i feel that i am not able to come up with something unique or develop a style. constrained by my sorroundings i am also not able to do lots of things that i would like to do. for example, i live in a big city so my themes so far have been all urban in nature. there are some parks here but parks seem artificial and i would like shooting in more natural locations say a farm, near the sea or something else. when i travel i would do those things but at the moment what i am unable to fix is a lack of creativity.\n\ni don't want to just be a guy with a camera who is taking pics of pretty girls since so many are doing that. i would really like to be good at this and develop a style and inspire others since i feel i have the resources and time and money to fully follow my passion. but i am not sure what to do next. right now my photography gear consists of a mirrorless camera and a prime lens 85mm f1.8 (and 2 kit lenses which i don't use now).\n\nso what should i do next?\n\n1. buy more gear? like lighting equipment etc? \n2. try to come up with new ideas? if yes then how? travelling to new locations? looking at the works of more photographers? or something else.\n3. spend time trying to build a style. i am not sure if i can choose it, maybe it would develop with time.\n4. or just keep shooting and try to get better. i will keep shooting but at the same time, i want to improve at a faster rate and to escape this creative block.\n\nwould really appreciate any advice. here are some of my pics [https://imgur.com/a/uiyquwy](https://imgur.com/a/uiyquwy)", "sortedWord": "None", "Identifyer": null, "identifyer": 1953, "year": "2019"}, {"autor": "andrervizu", "date": "2019-03-07 22:07:43", "content": "How to you come up with a title for photography submissions? /!/ I’m submitting for a magazine for the first time buy how do I come up with a title for my work?", "link": "https://www.reddit.com/r/photography/comments/ayie7h/how_to_you_come_up_with_a_title_for_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to you -----> come !!!  -----> up !!!  -----> with !!!  a title for photography submissions? /!/ i’m submitting for a magazine for the first time buy how do i come up with a title for my work?", "sortedWord": "None", "Identifyer": null, "identifyer": 4882, "year": "2019"}, {"autor": "adokool", "date": "2019-06-13 12:59:20", "content": "Creative Plateaus - how to come up with new ideas /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/c05ihn/creative_plateaus_how_to_come_up_with_new_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "creative plateaus - how to -----> come !!!  -----> up !!!  -----> with !!!  new ideas /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 5646, "year": "2019"}, {"autor": "Millytull", "date": "2019-05-15 23:45:13", "content": "Please help me come up with a midterm photoshop concept! /!/ Hi everyone, my prof assigned us the task of creating a 5-10 minute presentation on an aspect of photoshop to present to the class.  For example, time lapse photography, high and low frequency retouching, how to use liquify, working with water reflections, HDR, etc (I cannot use these examples as other classmates have already selected them). \n\nI’m having some trouble with ideas, my prof recommended checking out petapixel and that’s the plan when I get home from work, but I wanted to see if any of you had ideas!  We need to use only our own photography (the exception being galaxy photos by NASA or using other people’s photos as reference when explaining photoshop mistakes) and I am only able to shoot at night.  If anyone has any suggestions of concepts or places to look I would greatly appreciate it!  If this is not the correct sub please let me know as well.  Have a great day!", "link": "https://www.reddit.com/r/photography/comments/bp5fgs/please_help_me_come_up_with_a_midterm_photoshop/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "please help me -----> come !!!  -----> up !!!  -----> with !!!  a midterm photoshop concept! /!/ hi everyone, my prof assigned us the task of creating a 5-10 minute presentation on an aspect of photoshop to present to the class.  for example, time lapse photography, high and low frequency retouching, how to use liquify, working with water reflections, hdr, etc (i cannot use these examples as other classmates have already selected them). \n\ni’m having some trouble with ideas, my prof recommended checking out petapixel and that’s the plan when i get home from work, but i wanted to see if any of you had ideas!  we need to use only our own photography (the exception being galaxy photos by nasa or using other people’s photos as reference when explaining photoshop mistakes) and i am only able to shoot at night.  if anyone has any suggestions of concepts or places to look i would greatly appreciate it!  if this is not the correct sub please let me know as well.  have a great day!", "sortedWord": "None", "Identifyer": null, "identifyer": 5915, "year": "2019"}, {"autor": "BazingaUA", "date": "2019-08-27 18:37:21", "content": "This \"game\" brought me back to photography /!/ It's been almost a year since I went out to take some pictures. It was something that I was enjoying a lot - I would go out for hours and just take photos, after that I would spend even more time editing. But then something clicked and just didn't see anything through my lens. Everything became SO BORING. I tried a lot of things, but every time I would end up taking some cheesy photos that I didn't like and never even transferred them to my computer.\n\nSome time ago I found a huge collection of old photos of Toronto and came up with an idea (I know that people have done that in the past) of creating a collection of before/afters - and so [#OldNewTO](https://www.instagram.com/explore/tags/oldnewto/) was born.\n\nTaking photos is finally fun for me! I spend a lot of time (sometimes because these places changed quite a bit, I was looking for that [nice roof](https://www.instagram.com/p/B1WSVO1gz3s/) and couldn't figure out where it is :) ) walking around the city to find the places from old photos and try to match them as close as possible - angles, focal distance etc.\n\nAnd the best part about this - I'm not just taking photos of before/afters for this collection, while walking around the city I found a lot of great places and took some interesting photos. It also helped me have a new look on this city and learn lots of streets' names :)\n\nWere you ever in the situation where photography became boring and you just couldn't squeeze any creativity from yourself? What are methods of getting out of these creativity blocks? \n\nHere are some examples of before/afters that I've made: \n* [Bathurst and Queen, September 23, 1928](https://www.instagram.com/p/B1WSVO1gz3s/)\n\n* [St. Mary's Roman Catholic Church, Bathurst and Adelaide. Aug 26, 1956](https://www.instagram.com/p/B1RNrdoA4Qr/)\n\n* [King and Portland, between 1980 and 1998](https://www.instagram.com/p/B1Op6qAgUCl/)\n\n* [Front and Portland 1910](https://www.instagram.com/p/B1MtcpDAvlQ/)\n\n* [Massey-Harris buildings on Strachan looking north from Wellington, 1980s](https://www.instagram.com/p/B1bnP89FpuQ/)\n\n* [Queen Street West and Gore Vale Road, 1983](https://www.instagram.com/p/B1eFVBzA0gB/)\n\n* [Liberty and Dufferin, 1915](https://www.instagram.com/p/B1omtKCA7Ie/)\n\n* [Wellington and Portland, 1980s](https://www.instagram.com/p/B1mHrWxAwyS/)", "link": "https://www.reddit.com/r/photography/comments/cw8k52/this_game_brought_me_back_to_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "this \"game\" brought me back to photography /!/ it's been almost a year since i went out to take some pictures. it was something that i was enjoying a lot - i would go out for hours and just take photos, after that i would spend even more time editing. but then something clicked and just didn't see anything through my lens. everything became so boring. i tried a lot of things, but every time i would end up taking some cheesy photos that i didn't like and never even transferred them to my computer.\n\nsome time ago i found a huge collection of old photos of toronto and -----> came !!!  -----> up !!!  -----> with !!!  an idea (i know that people have done that in the past) of creating a collection of before/afters - and so [#oldnewto](https://www.instagram.com/explore/tags/oldnewto/) was born.\n\ntaking photos is finally fun for me! i spend a lot of time (sometimes because these places changed quite a bit, i was looking for that [nice roof](https://www.instagram.com/p/b1wsvo1gz3s/) and couldn't figure out where it is :) ) walking around the city to find the places from old photos and try to match them as close as possible - angles, focal distance etc.\n\nand the best part about this - i'm not just taking photos of before/afters for this collection, while walking around the city i found a lot of great places and took some interesting photos. it also helped me have a new look on this city and learn lots of streets' names :)\n\nwere you ever in the situation where photography became boring and you just couldn't squeeze any creativity from yourself? what are methods of getting out of these creativity blocks? \n\nhere are some examples of before/afters that i've made: \n* [bathurst and queen, september 23, 1928](https://www.instagram.com/p/b1wsvo1gz3s/)\n\n* [st. mary's roman catholic church, bathurst and adelaide. aug 26, 1956](https://www.instagram.com/p/b1rnrdoa4qr/)\n\n* [king and portland, between 1980 and 1998](https://www.instagram.com/p/b1op6qagucl/)\n\n* [front and portland 1910](https://www.instagram.com/p/b1mtcpdavlq/)\n\n* [massey-harris buildings on strachan looking north from wellington, 1980s](https://www.instagram.com/p/b1bnp89fpuq/)\n\n* [queen street west and gore vale road, 1983](https://www.instagram.com/p/b1efvbza0gb/)\n\n* [liberty and dufferin, 1915](https://www.instagram.com/p/b1omtkca7ie/)\n\n* [wellington and portland, 1980s](https://www.instagram.com/p/b1mhrwxawys/)", "sortedWord": "None", "Identifyer": null, "identifyer": 7257, "year": "2019"}, {"autor": "RTGP", "date": "2019-12-11 16:39:15", "content": "I am interviewing for a potential residency at an artists co-op near me and I was wondering if anyone would be willing to share their experience with these kinds of things? /!/ Like I said, a local co-op posted an ad for a free residency at a small studio around the corner from my house and I applied and am interviewing tomorrow. \n\nI have been a photographer for 8 years, 5 professionally, doing all sorts of different Shoots trying to find a niche for myself.  \n\nI have done everything from photojournalism to weddings to architecture and real estate and even professional portraits. Basically I don’t know how to settle on just one.\n\n So when I’m asked what kind of photography I do it is difficult to give an answer and sound competent.  Working in so many areas for so many clients is draining creatively and it has been a long time since I have come up with a personal creative project, I am terrified that I won’t have any ideas to present to them tomorrow and that I will be rejected\n\nMy hope for this is that I can go in and do some research and collaborate with other creatives so that I can become inspired to start a project of my own, but I am worried that the co-op will want a more definitive project before I begin.\n\nDoes anyone have experience working in a co-op or residency like this? \n\nI would love to know what your plan was going in, what people who run something like this expect and what your overall experience was like. \n\nSorry for mobile formatting and thanks in advance to anyone who reads and responds!", "link": "https://www.reddit.com/r/photography/comments/e99etz/i_am_interviewing_for_a_potential_residency_at_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i am interviewing for a potential residency at an artists co-op near me and i was wondering if anyone would be willing to share their experience with these kinds of things? /!/ like i said, a local co-op posted an ad for a free residency at a small studio around the corner from my house and i applied and am interviewing tomorrow. \n\ni have been a photographer for 8 years, 5 professionally, doing all sorts of different shoots trying to find a niche for myself.  \n\ni have done everything from photojournalism to weddings to architecture and real estate and even professional portraits. basically i don’t know how to settle on just one.\n\n so when i’m asked what kind of photography i do it is difficult to give an answer and sound competent.  working in so many areas for so many clients is draining creatively and it has been a long time since i have -----> come !!!  -----> up !!!  -----> with !!!  a personal creative project, i am terrified that i won’t have any ideas to present to them tomorrow and that i will be rejected\n\nmy hope for this is that i can go in and do some research and collaborate -----> with !!!  other creatives so that i can become inspired to start a project of my own, but i am worried that the co-op will want a more definitive project before i begin.\n\ndoes anyone have experience working in a co-op or residency like this? \n\ni would love to know what your plan was going in, what people who run something like this expect and what your overall experience was like. \n\nsorry for mobile formatting and thanks in advance to anyone who reads and responds!", "sortedWord": "None", "Identifyer": null, "identifyer": 8187, "year": "2019"}, {"autor": "clemsonwebdesign", "date": "2019-12-06 14:46:13", "content": "Adapt Horizonal Post to Tripod? /!/ Anyone have any ideas to cheaply mount a Nikon 5300 horizontally to a tripod? The intent is to take direct overhead shots of small items. My light table is 34\" x 34\". My tripod is a vintage aluminum dawia with a standard 1/4\" screw cap head.  It just doesnt spread enough to get a direct overhead shot.   \n\n\nI'm trying to do this without spending $65+ on a horizontal arm setup.   \n\n\nSo far I've come up with a few choices;  \n\n\nI could just use something like [this flex arm on a light stand](https://www.amazon.com/Neewer-Flexible-Lights-Photography-Accessories/dp/B018LQGL8O/ref=sr_1_6?keywords=tripod+flex+arm&amp;qid=1575642783&amp;sr=8-6) , very simple and straight forward. I'll loose a light tho as I'll have to repurpose a light stand.   \n\n\nAnother alternative is something [like this flex arm](https://www.amazon.com/Neewer-11-8inch-Aluminum-Articulating-Mounting/dp/B01FFMWYMO/ref=sr_1_13?keywords=tripod+flex+arm+shoe+mount&amp;qid=1575642887&amp;sr=8-13), I could just mount it directly to my tripod and mount my Nikon to the end of it. That would give me 11\" of external reach.    \n\n\nAnother option is to get a [shoe mount adapter](https://www.amazon.com/Updated-Anwenk-Adapter-Panasonic-Speedlite/dp/B07MZJRTH4/ref=sr_1_1_sspa?keywords=tripod+flex+arm+shoe+mount&amp;qid=1575643054&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyQjVBTllHTkdVM01PJmVuY3J5cHRlZElkPUEwOTA5OTIxNzVBSVdHVTBKOFM0JmVuY3J5cHRlZEFkSWQ9QTA3NTIwODZTUEpQUFczVzk2TE8md2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl), hook that to my tripod, then a shoe mount [horizontal arm to that](https://www.amazon.com/Adjustable-Friction-Articulating-Tripod-Monitor/dp/B07MHK9CB9/ref=sr_1_2?keywords=tripod+horizontal+arm&amp;qid=1575643395&amp;sr=8-2).   \n\n\nAny ideas or any better suggestions for a cheap horizontal solution?", "link": "https://www.reddit.com/r/photography/comments/e6zngd/adapt_horizonal_post_to_tripod/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "adapt horizonal post to tripod? /!/ anyone have any ideas to cheaply mount a nikon 5300 horizontally to a tripod? the intent is to take direct overhead shots of small items. my light table is 34\" x 34\". my tripod is a vintage aluminum dawia with a standard 1/4\" screw cap head.  it just doesnt spread enough to get a direct overhead shot.   \n\n\ni'm trying to do this without spending $65+ on a horizontal arm setup.   \n\n\nso far i've -----> come !!!  -----> up !!!  -----> with !!!  a few choices;  \n\n\ni could just use something like [this flex arm on a light stand](https://www.amazon.com/neewer-flexible-lights-photography-accessories/dp/b018lqgl8o/ref=sr_1_6?keywords=tripod+flex+arm&amp;qid=1575642783&amp;sr=8-6) , very simple and straight forward. i'll loose a light tho as i'll have to repurpose a light stand.   \n\n\nanother alternative is something [like this flex arm](https://www.amazon.com/neewer-11-8inch-aluminum-articulating-mounting/dp/b01ffmwymo/ref=sr_1_13?keywords=tripod+flex+arm+shoe+mount&amp;qid=1575642887&amp;sr=8-13), i could just mount it directly to my tripod and mount my nikon to the end of it. that would give me 11\" of external reach.    \n\n\nanother option is to get a [shoe mount adapter](https://www.amazon.com/updated-anwenk-adapter-panasonic-speedlite/dp/b07mzjrth4/ref=sr_1_1_sspa?keywords=tripod+flex+arm+shoe+mount&amp;qid=1575643054&amp;sr=8-1-spons&amp;psc=1&amp;spla=zw5jcnlwdgvkuxvhbglmawvypueyqjvbtllhtkdvm01pjmvuy3j5chrlzelkpuewota5otixnzvbsvdhvtbkofm0jmvuy3j5chrlzefkswq9qta3ntiwodztuepqufczvzk2te8md2lkz2v0tmftzt1zcf9hdgymywn0aw9upwnsawnrumvkaxjly3qmzg9ob3rmb2ddbgljaz10cnvl), hook that to my tripod, then a shoe mount [horizontal arm to that](https://www.amazon.com/adjustable-friction-articulating-tripod-monitor/dp/b07mhk9cb9/ref=sr_1_2?keywords=tripod+horizontal+arm&amp;qid=1575643395&amp;sr=8-2).   \n\n\nany ideas or any better suggestions for a cheap horizontal solution?", "sortedWord": "None", "Identifyer": null, "identifyer": 8257, "year": "2019"}, {"autor": "Sluupii", "date": "2019-11-23 14:30:45", "content": "How to manage boss' expectations? /!/ Hi,\n\nRecently I got a job as photographer/social media manager for a michelin restaurant chain. In total there are 12 restaurants and I have to take pictures of each one and post them on IG and FB. Who was previously in charge of this did not give me any pictures to begin with to post while I take new ones, so I start from scratch.\n\nI have to say I am not a professional photographer. I am an amateur with a Canon EOS 550D and a 50mm lens. This makes it especially difficult to photograph interiors. Also, due to short winter daylight times, the restaurant opening times, and school I have only a 1-2 hour margin to take pictures of the restaurants. I do not have any lighting equipment which renders me basically useless once natural light is gone. Not to mention choosing the photos, editing them, coming up with captions and all that blabla SoMe stuff.\n\nSo, my boss complained that I cannot take pictures fast enough, does not provide me with any equipment and already threatened to fire me and/or cut my salary in half (which is also not so good since they give me nothing to work with). I have been able to come up with pictures for 4 restaurants only in 2 weeks and has been exhausting me. He suggested \"just use your phone\" but at the same time keep the high standard of professional photography, as well as saying \"it's your problem how you take the pictures, I just want stuff posted\".\n\nMy questions are: Is this worth working? Should I quit and return once I am more equipped? How do I make my boss understand that all this takes a lot of time?", "link": "https://www.reddit.com/r/photography/comments/e0ik1b/how_to_manage_boss_expectations/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "how to manage boss' expectations? /!/ hi,\n\nrecently i got a job as photographer/social media manager for a michelin restaurant chain. in total there are 12 restaurants and i have to take pictures of each one and post them on ig and fb. who was previously in charge of this did not give me any pictures to begin with to post while i take new ones, so i start from scratch.\n\ni have to say i am not a professional photographer. i am an amateur with a canon eos 550d and a 50mm lens. this makes it especially difficult to photograph interiors. also, due to short winter daylight times, the restaurant opening times, and school i have only a 1-2 hour margin to take pictures of the restaurants. i do not have any lighting equipment which renders me basically useless once natural light is gone. not to mention choosing the photos, editing them, -----> coming !!!  -----> up !!!  -----> with !!!  captions and all that blabla some stuff.\n\nso, my boss complained that i cannot take pictures fast enough, does not provide me with any equipment and already threatened to fire me and/or cut my salary in half (which is also not so good since they give me nothing to work with). i have been able to come up with pictures for 4 restaurants only in 2 weeks and has been exhausting me. he suggested \"just use your phone\" but at the same time keep the high standard of professional photography, as well as saying \"it's your problem how you take the pictures, i just want stuff posted\".\n\nmy questions are: is this worth working? should i quit and return once i am more equipped? how do i make my boss understand that all this takes a lot of time?", "sortedWord": "None", "Identifyer": null, "identifyer": 65108, "year": "2019"}, {"autor": "Ezelryb", "date": "2019-12-29 15:42:51", "content": "I found my creativity again /!/ Hey guys, I have started photography about five or six years ago, when I was still in school. It quickly became one of my greatest hobbies and I really enjoyed it. Now I am in college, and in the last two years, I neglected my camera more and more. In the beginning I really didn't have the time -- new city, new people, new hobbies and an awful lot of studying. But eventually I realized I somehow lost the spirit. I really couldn't come up with something I really wanted to shoot.\n\nA few days ago YouTube recommended me one of these *How to not lose your inspiration*-videos, I watched it. One tip was to keep a sketchbook with you to sketch some ideas you have while daydreaming down. I must admit my drawing skills are really nothing to write home about, but guess who is now booking a studio. And after this project I have already scheduled the next shoot with a cosplaying friend.\n\nI'm getting back. And this is no new-years thing I will have forgotten about in three weeks, screw new year. I just managed to get creative and motivate myself again.", "link": "https://www.reddit.com/r/photography/comments/eh7alz/i_found_my_creativity_again/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i found my creativity again /!/ hey guys, i have started photography about five or six years ago, when i was still in school. it quickly became one of my greatest hobbies and i really enjoyed it. now i am in college, and in the last two years, i neglected my camera more and more. in the beginning i really didn't have the time -- new city, new people, new hobbies and an awful lot of studying. but eventually i realized i somehow lost the spirit. i really couldn't -----> come !!!  -----> up !!!  -----> with !!!  something i really wanted to shoot.\n\na few days ago youtube recommended me one of these *how to not lose your inspiration*-videos, i watched it. one tip was to keep a sketchbook with you to sketch some ideas you have while daydreaming down. i must admit my drawing skills are really nothing to write home about, but guess who is now booking a studio. and after this project i have already scheduled the next shoot with a cosplaying friend.\n\ni'm getting back. and this is no new-years thing i will have forgotten about in three weeks, screw new year. i just managed to get creative and motivate myself again.", "sortedWord": "None", "Identifyer": null, "identifyer": 65249, "year": "2019"}, {"autor": "clickyclaws", "date": "2019-07-18 03:37:05", "content": "Friend wanted to buy my camera but has been \"borrowing\" it for almost 2 years. /!/ A friend who has the same camera as me once asked to borrow mine around September 2017 so he could shoot a wedding with two cameras. He also borrowed my lenses. I asked in November of 2017 if he'd like to buy it from me since I was thinking of upgrading (and he hadn't mentioned returning it yet). He said it would be awesome especially since he'd be saving about $500 rather than buying it new.\n\nWell, he keeps saying he doesn't have the money but every time I get the camera back, he asks for it like a week later and says it's for an important job. And he's actually my significant other's friend first so this makes the situation weird.\n\nI've gotten the camera back about four times since and it's the same story every time. I was about to sell the camera this past January but my s/o said to give him another chance to come up with the money. He's not mentioned it at all and has still had it since. Since then, the used value of the camera has dropped another $500-$700.\n\nI know this isn't a legal advice subreddit, but I was wondering if anyone has any advice on what to do. I have this gut feeling if he does come up with the cash, he's gonna wanna buy it for the current used value rather than the original price I offered. I really just wanna make him pay me $500 for the time he's used it to make up for the loss of value.\n\n(For privacy reasons--in case he reads this--I do not wish to discuss my actual gear, please and thank you.)", "link": "https://www.reddit.com/r/photography/comments/cen90g/friend_wanted_to_buy_my_camera_but_has_been/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "friend wanted to buy my camera but has been \"borrowing\" it for almost 2 years. /!/ a friend who has the same camera as me once asked to borrow mine around september 2017 so he could shoot a wedding with two cameras. he also borrowed my lenses. i asked in november of 2017 if he'd like to buy it from me since i was thinking of upgrading (and he hadn't mentioned returning it yet). he said it would be awesome especially since he'd be saving about $500 rather than buying it new.\n\nwell, he keeps saying he doesn't have the money but every time i get the camera back, he asks for it like a week later and says it's for an important job. and he's actually my significant other's friend first so this makes the situation weird.\n\ni've gotten the camera back about four times since and it's the same story every time. i was about to sell the camera this past january but my s/o said to give him another chance to -----> come !!!  -----> up !!!  -----> with !!!  the money. he's not mentioned it at all and has still had it since. since then, the used value of the camera has dropped another $500-$700.\n\ni know this isn't a legal advice subreddit, but i was wondering if anyone has any advice on what to do. i have this gut feeling if he does come up with the cash, he's gonna wanna buy it for the current used value rather than the original price i offered. i really just wanna make him pay me $500 for the time he's used it to make up for the loss of value.\n\n(for privacy reasons--in case he reads this--i do not wish to discuss my actual gear, please and thank you.)", "sortedWord": "None", "Identifyer": null, "identifyer": 66398, "year": "2019"}, {"autor": "ccurzio", "date": "2019-08-05 13:23:40", "content": "/r/photographs Top Post [July 2019]: /u/johnmwu - \"A photo of Mt. Fuji with Sakura\" /!/ Each month, we feature the most upvoted post of /r/photographs along with an introduction to the photographer. \n___\n**[July 2019's top post](https://www.reddit.com/r/photographs/comments/cghour/a_photo_of_mt_fuji_with_sakura/?context=10) is from /u/johnmwu.**\n\n[\"A photo of Mt. Fuji with Sakura\"](https://i.redd.it/cu9yjf3nnwb31.jpg)\n\nFrom the photographer:\n\n&gt; I shot this at Chureito Pagoda near Mt Fuji during peak cherry blossom season. It was an adventure getting from Shinjuku, Tokyo to this Pagoda. After the first failed attempt (we left too late), it took us another day, two trains, and three hours to finally be able to see the mountain. I wanted to incorporate all the sakura with Mt Fuji and I came up with this.\n&gt; Shot with Lumix G85\n\nCongratulations to /u/johnmwu. \n___\nFor your chance to be featured here on /r/photography or if you just want to share your photos with the community, please feel free to submit your work over at /r/photographs.", "link": "https://www.reddit.com/r/photography/comments/cmaxe3/rphotographs_top_post_july_2019_ujohnmwu_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "/r/photographs top post [july 2019]: /u/johnmwu - \"a photo of mt. fuji with sakura\" /!/ each month, we feature the most upvoted post of /r/photographs along with an introduction to the photographer. \n___\n**[july 2019's top post](https://www.reddit.com/r/photographs/comments/cghour/a_photo_of_mt_fuji_with_sakura/?context=10) is from /u/johnmwu.**\n\n[\"a photo of mt. fuji with sakura\"](https://i.redd.it/cu9yjf3nnwb31.jpg)\n\nfrom the photographer:\n\n&gt; i shot this at chureito pagoda near mt fuji during peak cherry blossom season. it was an adventure getting from shinjuku, tokyo to this pagoda. after the first failed attempt (we left too late), it took us another day, two trains, and three hours to finally be able to see the mountain. i wanted to incorporate all the sakura -----> with !!!  mt fuji and i -----> came !!!  -----> up !!!  -----> with !!!  this.\n&gt; shot with lumix g85\n\ncongratulations to /u/johnmwu. \n___\nfor your chance to be featured here on /r/photography or if you just want to share your photos with the community, please feel free to submit your work over at /r/photographs.", "sortedWord": "None", "Identifyer": null, "identifyer": 66431, "year": "2019"}, {"autor": "McRedditerFace", "date": "2019-10-17 00:05:11", "content": "DAM Tagging Faces... what *is* a face? /!/ Hey all,  \n\n\nBeen going through my collection of family photos, tagging faces using Digikam.  Digikam, as with many other DAM softwares, includes facial recognition and face tagging.  However it's not exactly 100% accurate, not by a long shot.  \n\n\nAdditionally, a large number of tags were embedded into the meta data by Picassa, and some of those were mistranslated when brought into Digikam, and that required cleaning up.  But others just seem \"off\".  \n\n\nAt the end of the day, what this boils down to is that a large portion of tags weren't generated by Digikam's face-detection alogrithm, and those tags are being used as part of the base set of images which additional tags that are created automagically.  \n\n\nI want to ensure my tags are done right... and I've come up with a really stupid question to something that \\*should\\* be simple... what \\*is\\* a face?  \n\n\nShould a box that encompasses a face include the jawline?  How about the ears?  Is it really just the eyes, nose, and mouth?  \n\n\nShould I  even tag photos that have faces partially obscured, like by someone's arm, or a hat... etc... or does this run the risk of introducing bad data into the dataset the algorithms are pulling from?  \n\n\nWhat if it's a profile view?  How much of a face is still a face?  Two eyes?  One?  What if the eyes are closed?  \n\n\nAnd should I worry about bad tags creating bad data which gets used in the algorithms?  I hadn't initially been worried about this, but what I realized when a number of those tags that were improperly translated into Digikam from Picassa was that the areas they were being \"found\" in other images to detect additional faces.  So if a tag was translated incorrectly and wound up on a specific pattern of fabric, it'd find that kind of pattern all kinds of other places, and find \"faces\", because that was a \"face\" that was already tagged, and the software found similar ones.  The computer's only as smart as the person who programmed it, but it seems AI is only as smart as the dataset it learnt from.", "link": "https://www.reddit.com/r/photography/comments/diy7tn/dam_tagging_faces_what_is_a_face/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "dam tagging faces... what *is* a face? /!/ hey all,  \n\n\nbeen going through my collection of family photos, tagging faces using digikam.  digikam, as with many other dam softwares, includes facial recognition and face tagging.  however it's not exactly 100% accurate, not by a long shot.  \n\n\nadditionally, a large number of tags were embedded into the meta data by picassa, and some of those were mistranslated when brought into digikam, and that required cleaning up.  but others just seem \"off\".  \n\n\nat the end of the day, what this boils down to is that a large portion of tags weren't generated by digikam's face-detection alogrithm, and those tags are being used as part of the base set of images which additional tags that are created automagically.  \n\n\ni want to ensure my tags are done right... and i've -----> come !!!  -----> up !!!  -----> with !!!  a really stupid question to something that \\*should\\* be simple... what \\*is\\* a face?  \n\n\nshould a box that encompasses a face include the jawline?  how about the ears?  is it really just the eyes, nose, and mouth?  \n\n\nshould i  even tag photos that have faces partially obscured, like by someone's arm, or a hat... etc... or does this run the risk of introducing bad data into the dataset the algorithms are pulling from?  \n\n\nwhat if it's a profile view?  how much of a face is still a face?  two eyes?  one?  what if the eyes are closed?  \n\n\nand should i worry about bad tags creating bad data which gets used in the algorithms?  i hadn't initially been worried about this, but what i realized when a number of those tags that were improperly translated into digikam from picassa was that the areas they were being \"found\" in other images to detect additional faces.  so if a tag was translated incorrectly and wound up on a specific pattern of fabric, it'd find that kind of pattern all kinds of other places, and find \"faces\", because that was a \"face\" that was already tagged, and the software found similar ones.  the computer's only as smart as the person who programmed it, but it seems ai is only as smart as the dataset it learnt from.", "sortedWord": "None", "Identifyer": null, "identifyer": 66607, "year": "2019"}, {"autor": "tylerlovesapples", "date": "2019-11-03 18:43:01", "content": "Lightroom Organization Theory /!/ Hi,\n\nI've been shooting for several years now, averaging about 11k photos per year. Sometimes I can't locate particular photos I'm looking for, sadly organizational-structure of my LR catalog isn't working so well anymore. \n\nI currently do this:\n\n folder\\[**Year**\\] → folder\\[**Month**\\] → folder\\[**Event** ex: \"River Rafting\"\\] → **photos**\n\nI've been trying to think of solutions that would allow me to find photos I'm looking for quickly. I decided that the upper level(s) should be geographical because I always know **where** I was, but not always **when** it was.\n\nHere's what I came up with: \n\nfolder\\[**country**\\] → folder\\[**general area** ex: \"The East Coast\"\\] → folder\\[**specific area** ex: \"Sam's house\"\\] → folder\\[**year+month** ex: 2019-11\\] → **photos**.\n\nThinking about this issue got me wondering what other solutions have people come up with. I would love to know what works for you and if there's anything you would change about my set up. I travel the world a little (I want to more) and I'm trying to future proof my methodology so I don't have to worry about changing it down the road. \n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/dr4nrl/lightroom_organization_theory/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "lightroom organization theory /!/ hi,\n\ni've been shooting for several years now, averaging about 11k photos per year. sometimes i can't locate particular photos i'm looking for, sadly organizational-structure of my lr catalog isn't working so well anymore. \n\ni currently do this:\n\n folder\\[**year**\\] → folder\\[**month**\\] → folder\\[**event** ex: \"river rafting\"\\] → **photos**\n\ni've been trying to think of solutions that would allow me to find photos i'm looking for quickly. i decided that the upper level(s) should be geographical because i always know **where** i was, but not always **when** it was.\n\nhere's what i -----> came !!!  -----> up !!!  -----> with !!! : \n\nfolder\\[**country**\\] → folder\\[**general area** ex: \"the east coast\"\\] → folder\\[**specific area** ex: \"sam's house\"\\] → folder\\[**year+month** ex: 2019-11\\] → **photos**.\n\nthinking about this issue got me wondering what other solutions have people come -----> up !!!  -----> with !!! . i would love to know what works for you and if there's anything you would change about my set up. i travel the world a little (i want to more) and i'm trying to future proof my methodology so i don't have to worry about changing it down the road. \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 66995, "year": "2019"}, {"autor": "capitanphil", "date": "2019-11-21 19:31:12", "content": "Printing on Falconboard /!/ &amp;#x200B;\n\n[example of a falconboard print](https://preview.redd.it/jgyy3eoxc3041.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=fd73b775447c123c29554cbf9a11e252ccdf846d)\n\nI've got a photo show coming up with a local snowboarding shop and I am considering doing all my printing on 1/4\" falcon board for a couple of reasons, the results seem nice, there's no framing required, and the raw look matches the aesthetic of the brand.\n\nFolks with falcon board experience, is there anything I'm overlooking here?", "link": "https://www.reddit.com/r/photography/comments/dzohfp/printing_on_falconboard/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "printing on falconboard /!/ &amp;#x200b;\n\n[example of a falconboard print](https://preview.redd.it/jgyy3eoxc3041.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=fd73b775447c123c29554cbf9a11e252ccdf846d)\n\ni've got a photo show -----> coming !!!  -----> up !!!  -----> with !!!  a local snowboarding shop and i am considering doing all my printing on 1/4\" falcon board for a couple of reasons, the results seem nice, there's no framing required, and the raw look matches the aesthetic of the brand.\n\nfolks with falcon board experience, is there anything i'm overlooking here?", "sortedWord": "None", "Identifyer": null, "identifyer": 67047, "year": "2019"}, {"autor": "paraworldblue", "date": "2019-03-03 23:14:11", "content": "I wrote a fictional origin story for the infamous not-technically-a-scam-but-basically, Kodakit. If you're one of the many struggling photographers who have been exploited by them, you might get a kick out of this. /!/ Several years ago, there was a board meeting at Kodak to try and devise strategies to save the company from its slow decline into irrelevance. Two hours into the meeting, nobody had come up with anything good, and everyone was getting exasperated and hopeless. One board member, known for his dry, sarcastic sense of humor, jokingly suggested they cash in all their public respect and trust and just start using desperate photographers to trick clueless restaurant owners into giving them small amounts of money. Most people understood the irony of his joke - turning a once industry-leading company into a small-time grift - but a few people didn't. Those people had a meeting of their own several days later. \n\n&amp;#x200B;\n\nFast forward to October 2018. Another board meeting has been called to address the rapid decline in public opinion and outright hatred from professional photographers. The heads of each department took turns explaining what they were doing and why they couldn't be the ones causing the backlash. Disposable Cameras reported an increase in popularity from capitalizing on nostalgia. Film reported the success of their vintage film reissues among art photographers. Several other departments reported meager successes from partnerships with Instagram and digital camera companies. Then it came time for a new department to speak - one which few people in the room had even heard of - headed by someone who had barely been seen around the office in years. The man was sweating profusely as he slowly stood up and introduced himself as the head of a new subsidiary called Kodakit. ", "link": "https://www.reddit.com/r/photography/comments/awzxbz/i_wrote_a_fictional_origin_story_for_the_infamous/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i wrote a fictional origin story for the infamous not-technically-a-scam-but-basically, kodakit. if you're one of the many struggling photographers who have been exploited by them, you might get a kick out of this. /!/ several years ago, there was a board meeting at kodak to try and devise strategies to save the company from its slow decline into irrelevance. two hours into the meeting, nobody had -----> come !!!  -----> up !!!  -----> with !!!  anything good, and everyone was getting exasperated and hopeless. one board member, known for his dry, sarcastic sense of humor, jokingly suggested they cash in all their public respect and trust and just start using desperate photographers to trick clueless restaurant owners into giving them small amounts of money. most people understood the irony of his joke - turning a once industry-leading company into a small-time grift - but a few people didn't. those people had a meeting of their own several days later. \n\n&amp;#x200b;\n\nfast forward to october 2018. another board meeting has been called to address the rapid decline in public opinion and outright hatred from professional photographers. the heads of each department took turns explaining what they were doing and why they couldn't be the ones causing the backlash. disposable cameras reported an increase in popularity from capitalizing on nostalgia. film reported the success of their vintage film reissues among art photographers. several other departments reported meager successes from partnerships with instagram and digital camera companies. then it came time for a new department to speak - one which few people in the room had even heard of - headed by someone who had barely been seen around the office in years. the man was sweating profusely as he slowly stood up and introduced himself as the head of a new subsidiary called kodakit. ", "sortedWord": "None", "Identifyer": null, "identifyer": 67913, "year": "2019"}, {"autor": "oauth20", "date": "2019-03-11 13:08:17", "content": "How to come up with a unique/signature look and color grading/editing for Portraits ? /!/ I am hobbyist Photographer and have recently been taking Portraits of my friends and family, I do Retouching as well but have been struggling to create a signature look, currently I try to imitate Photographers I follow which makes my photography/editing better but leaves me with pictures looking like someone else took them, do you guys have any suggestions on how to approach Photography/Retouching in a way which could help develop my own signature look. Any references or suggestions would be highly appreciated!", "link": "https://www.reddit.com/r/photography/comments/azt97r/how_to_come_up_with_a_uniquesignature_look_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to -----> come !!!  -----> up !!!  -----> with !!!  a unique/signature look and color grading/editing for portraits ? /!/ i am hobbyist photographer and have recently been taking portraits of my friends and family, i do retouching as well but have been struggling to create a signature look, currently i try to imitate photographers i follow which makes my photography/editing better but leaves me with pictures looking like someone else took them, do you guys have any suggestions on how to approach photography/retouching in a way which could help develop my own signature look. any references or suggestions would be highly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 68094, "year": "2019"}, {"autor": "dreamchasers1337", "date": "2019-02-03 17:36:04", "content": "take photos of myself at home with limite space /!/ Hey this is a bit OT\n\ni got some decent photos but id like to have 1 or 2 more, so i have 4 nice pictures for my tinder profile.\n\nthe problem is i have no place at my home to take pictures (small appartement, no nice mirrors, my mirrors also show my entire room and it just doesnt look pleasing, not that its a mess, its just uncool imo, i also dont wanna take selfies cuz this looks silly imo.\n\nwhat are some possibilities to do @home?\n\ni already got a tripod with a bluetooth thingy to take photos from my phone, i just need something as a background.´\n\nlike a greenscreen but in white, im brainstorming with some friends for some days but we cannot come up with something that would look legit and not weird.\n\ncuz if its weird its a no\n\nits currently snowing outside and freezing cold, so taking pictures somewhere outside is not really an option, taking pics indoor is more like hit or miss, lightning and so on, and we are not that ballsy to take 20 pics to have a good one.\n\ni just want to show off my style cuz im intro streetwear, one or two additional pics would be nice, i need some\n\na e s t h e t i c s\n\nplease help :)", "link": "https://www.reddit.com/r/photography/comments/amrriq/take_photos_of_myself_at_home_with_limite_space/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "take photos of myself at home with limite space /!/ hey this is a bit ot\n\ni got some decent photos but id like to have 1 or 2 more, so i have 4 nice pictures for my tinder profile.\n\nthe problem is i have no place at my home to take pictures (small appartement, no nice mirrors, my mirrors also show my entire room and it just doesnt look pleasing, not that its a mess, its just uncool imo, i also dont wanna take selfies cuz this looks silly imo.\n\nwhat are some possibilities to do @home?\n\ni already got a tripod with a bluetooth thingy to take photos from my phone, i just need something as a background.´\n\nlike a greenscreen but in white, im brainstorming -----> with !!!  some friends for some days but we cannot -----> come !!!  -----> up !!!  -----> with !!!  something that would look legit and not weird.\n\ncuz if its weird its a no\n\nits currently snowing outside and freezing cold, so taking pictures somewhere outside is not really an option, taking pics indoor is more like hit or miss, lightning and so on, and we are not that ballsy to take 20 pics to have a good one.\n\ni just want to show off my style cuz im intro streetwear, one or two additional pics would be nice, i need some\n\na e s t h e t i c s\n\nplease help :)", "sortedWord": "None", "Identifyer": null, "identifyer": 68449, "year": "2019"}, {"autor": "Blue_Congo", "date": "2019-06-10 11:51:30", "content": "Adobe's customer service is like playing chess with pigeons. /!/ I was looking what kind of options Adobe has for cloud storage and I couldn't find the price for 10 TB storage, so I decided to ask from the customer service (chat).  They came up with some sort of price, but there was some weird things.  Now after 1,5 hours of waiting for different \"specialists\", I have no real answers.   \n\n&amp;#x200B;\n\n**These are my questions:** \n\n***Why is the 10tb cloud storage more expensive for the whole CC and cheaper for the photography plan? You know, It still is the same 10tb.***  \n\n***Why does the payment method (different card) affect to amount of the tax?***  \n\n***In which country the this tax is paid to?  (I'm from EU)***  \n\n&amp;#x200B;\n\nThe style of answers that I get from these different specialists:\n\n\"So as I checked it in your subscription you have CC all app  so in this you only get 100 of storage and if you get 10tb than it is the storage which is more chargable for that.\"\n\n*\"*I would like to inform that you have creative cloud all apps plan , for the first year, the price is for promotional price or discounted price and once the tenure is over, there is standard price.\"\n\n&amp;#x200B;\n\nCan reddit help me with these questions?", "link": "https://www.reddit.com/r/photography/comments/bywwj0/adobes_customer_service_is_like_playing_chess/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "adobe's customer service is like playing chess with pigeons. /!/ i was looking what kind of options adobe has for cloud storage and i couldn't find the price for 10 tb storage, so i decided to ask from the customer service (chat).  they -----> came !!!  -----> up !!!  -----> with !!!  some sort of price, but there was some weird things.  now after 1,5 hours of waiting for different \"specialists\", i have no real answers.   \n\n&amp;#x200b;\n\n**these are my questions:** \n\n***why is the 10tb cloud storage more expensive for the whole cc and cheaper for the photography plan? you know, it still is the same 10tb.***  \n\n***why does the payment method (different card) affect to amount of the tax?***  \n\n***in which country the this tax is paid to?  (i'm from eu)***  \n\n&amp;#x200b;\n\nthe style of answers that i get from these different specialists:\n\n\"so as i checked it in your subscription you have cc all app  so in this you only get 100 of storage and if you get 10tb than it is the storage which is more chargable for that.\"\n\n*\"*i would like to inform that you have creative cloud all apps plan , for the first year, the price is for promotional price or discounted price and once the tenure is over, there is standard price.\"\n\n&amp;#x200b;\n\ncan reddit help me with these questions?", "sortedWord": "None", "Identifyer": null, "identifyer": 68892, "year": "2019"}, {"autor": "AdobiWanKenobi", "date": "2019-06-10 10:11:52", "content": "Camera choice based on my situation? /!/ Hi.\n\nSo I would say I’m an intermediate photographer. I have the eye, but haven’t started to properly learn photo editing, Lightroom etc.\n\nI’m on the look out for a mirrorless camera with interchangeable lenses, and ability to shoot video as well. I’m happy to drop  ~£1000 (including the kit lens, or starter lens). I’ve come up with what seems to be the best option for me which is a Sony a6400. However I’m still not fully sure, my dad has been in photography for a long time, he owns a Nikon D70 and D8xx (can’t remember the number), a 50mm a 70-200mm and something else. He also has Sony RX100 MK3,4,5 . \n\nSo I’m not sure if it’s best for me to go Sony or Nikon (I’ve seen that the Z6 is decent), or perhaps even Canon.", "link": "https://www.reddit.com/r/photography/comments/byw2pu/camera_choice_based_on_my_situation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "camera choice based on my situation? /!/ hi.\n\nso i would say i’m an intermediate photographer. i have the eye, but haven’t started to properly learn photo editing, lightroom etc.\n\ni’m on the look out for a mirrorless camera with interchangeable lenses, and ability to shoot video as well. i’m happy to drop  ~£1000 (including the kit lens, or starter lens). i’ve -----> come !!!  -----> up !!!  -----> with !!!  what seems to be the best option for me which is a sony a6400. however i’m still not fully sure, my dad has been in photography for a long time, he owns a nikon d70 and d8xx (can’t remember the number), a 50mm a 70-200mm and something else. he also has sony rx100 mk3,4,5 . \n\nso i’m not sure if it’s best for me to go sony or nikon (i’ve seen that the z6 is decent), or perhaps even canon.", "sortedWord": "None", "Identifyer": null, "identifyer": 68899, "year": "2019"}, {"autor": "Scottboarding", "date": "2019-09-28 01:22:04", "content": "Goodbye Nikon; next time care about your customers /!/ TL;DR - Nikon sells me a faulty camera, fights tooth-and-nail to get out of repairing it for free, charges me $316 to repair it.\n\nI bought a refurbished Nikon D750 back in March form BHPhotoVideo. I noticed an issue with it recently on my vacation and realized this issue has been present the entire time I've had it, I just didn't notice. I have an image from the first time I shot with the camera that shows this issue. Turns out there have been three separate recalls for this exact issue, but my serial number was not one of the ones recalled. I contacted them asking if they could do the repair free of charge considering they have repaired thousands of them already for this exact issue free of charge. They told me that because my serial number wasn't affected, I would have to pay. \n\nI called their support team and asked for a manager to talk to see if I could get somewhere with them. After a conversation they gave me a prepaid label for the repair center and told me to send them the repair invoice number once it arrives and they would see what they could do. Great! Finally getting somewhere. \n\nThe camera arrives and I sent the manager the number. Then for the past three weeks I have been arguing back and forth about this. They would give me something along the lines of \"well this photo is shot with a Zeiss lens, so we can't do anything about it\". So I sent them an image taken with a Nikon lens that showed the same issue. They responded with \"the JPEG is doesn't have enough Metadata for us\" so I sent three .NEF files all shot with Nikon lenses showing the issue. They responded \"we don't see any issues\" so I sent crops that clearly show the issue to which they respond \"the image is too low quality\". They insisted that there hasn't been any service advisories for this despite they fact that their own website says it and there are countless articles online about it. Every time I sent something they made an excuse, and then when I countered that, they came up with a new excuse. \n\nSo I just authorized a payment of $316 for a camera that has a manufacturing defect that has been widely reported and repaired for free thousands of times. This was an issue right out of the box but because I was a few days late on the 6 month warranty, I'm screwed. Over the past three weeks they fought as hard as they could to get out of repairing it free of charge, and finally they won. \n\nNikon puts in far more effort to get out of liability than they do taking care of their customers. If anyone's considering switching to the Nikon system; don't. They don't care about you.", "link": "https://www.reddit.com/r/photography/comments/da9kf3/goodbye_nikon_next_time_care_about_your_customers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "goodbye nikon; next time care about your customers /!/ tl;dr - nikon sells me a faulty camera, fights tooth-and-nail to get out of repairing it for free, charges me $316 to repair it.\n\ni bought a refurbished nikon d750 back in march form bhphotovideo. i noticed an issue with it recently on my vacation and realized this issue has been present the entire time i've had it, i just didn't notice. i have an image from the first time i shot with the camera that shows this issue. turns out there have been three separate recalls for this exact issue, but my serial number was not one of the ones recalled. i contacted them asking if they could do the repair free of charge considering they have repaired thousands of them already for this exact issue free of charge. they told me that because my serial number wasn't affected, i would have to pay. \n\ni called their support team and asked for a manager to talk to see if i could get somewhere with them. after a conversation they gave me a prepaid label for the repair center and told me to send them the repair invoice number once it arrives and they would see what they could do. great! finally getting somewhere. \n\nthe camera arrives and i sent the manager the number. then for the past three weeks i have been arguing back and forth about this. they would give me something along the lines of \"well this photo is shot with a zeiss lens, so we can't do anything about it\". so i sent them an image taken with a nikon lens that showed the same issue. they responded with \"the jpeg is doesn't have enough metadata for us\" so i sent three .nef files all shot with nikon lenses showing the issue. they responded \"we don't see any issues\" so i sent crops that clearly show the issue to which they respond \"the image is too low quality\". they insisted that there hasn't been any service advisories for this despite they fact that their own website says it and there are countless articles online about it. every time i sent something they made an excuse, and then when i countered that, they -----> came !!!  -----> up !!!  -----> with !!!  a new excuse. \n\nso i just authorized a payment of $316 for a camera that has a manufacturing defect that has been widely reported and repaired for free thousands of times. this was an issue right out of the box but because i was a few days late on the 6 month warranty, i'm screwed. over the past three weeks they fought as hard as they could to get out of repairing it free of charge, and finally they won. \n\nnikon puts in far more effort to get out of liability than they do taking care of their customers. if anyone's considering switching to the nikon system; don't. they don't care about you.", "sortedWord": "None", "Identifyer": null, "identifyer": 69813, "year": "2019"}, {"autor": "jsweeny123", "date": "2019-09-27 15:54:29", "content": "She returns /!/ I went into the woods with some beautiful ladies and this is what we came up with.", "link": "https://www.reddit.com/r/photography/comments/da2daz/she_returns/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "she returns /!/ i went into the woods -----> with !!!  some beautiful ladies and this is what we -----> came !!!  -----> up !!!  -----> with !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 69848, "year": "2019"}, {"autor": "Csgirlthrowie", "date": "2019-02-13 09:58:22", "content": "Aspiring model here. Why do so many photographers on Instagram do the following? /!/ I have been using IG to try to get in touch with local photographers in my area to do collabs. It is honestly really hard to find one though that wants to shoot (with me). Usually these end up happening:\n\n* I get no response, but I can see they are active (due to the \"Seen\" feature, or because they post stories even if the \"Seen\" is not there)\n\n* They respond for a couple of exchanges, then totally ghost me (this is the worst...do not get my hopes up!!)\n\n* They say they will reach out if they ever come up with a concept \"I would work in\" (then they never reach out again)\n\n* They say they are not doing any collabs/TFP, only paid shoots, but find out later another freelancing friend of mine did do a collab with them (and their profiles will even say \"DM me for collabs\").\n\nIt is honestly really discouraging, and it is really wearing me down. Out of around 20, only 3 said yes. Is this normal when starting out?", "link": "https://www.reddit.com/r/photography/comments/aq50t6/aspiring_model_here_why_do_so_many_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "aspiring model here. why do so many photographers on instagram do the following? /!/ i have been using ig to try to get in touch with local photographers in my area to do collabs. it is honestly really hard to find one though that wants to shoot (with me). usually these end up happening:\n\n* i get no response, but i can see they are active (due to the \"seen\" feature, or because they post stories even if the \"seen\" is not there)\n\n* they respond for a couple of exchanges, then totally ghost me (this is the worst...do not get my hopes up!!)\n\n* they say they will reach out if they ever -----> come !!!  -----> up !!!  -----> with !!!  a concept \"i would work in\" (then they never reach out again)\n\n* they say they are not doing any collabs/tfp, only paid shoots, but find out later another freelancing friend of mine did do a collab -----> with !!!  them (and their profiles will even say \"dm me for collabs\").\n\nit is honestly really discouraging, and it is really wearing me down. out of around 20, only 3 said yes. is this normal when starting out?", "sortedWord": "None", "Identifyer": null, "identifyer": 72205, "year": "2019"}, {"autor": "SookieLou", "date": "2019-01-15 15:09:01", "content": "Who is the Photographer? /!/ My son is currently taking a digital journalism class and is tasked with finding the photographer of this picture of  Toru Iwatani.  We tried using google image search and TinEye but haven't been able to come up with anything.  As a previous pro photographer it makes me sad that finding the photographer of a photo is so difficult to do.  I told my son that if anyone could find the answer, they would be on Reddit.  :)    Thank you!", "link": "https://www.reddit.com/r/photography/comments/ag9f3t/who_is_the_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "who is the photographer? /!/ my son is currently taking a digital journalism class and is tasked with finding the photographer of this picture of  toru iwatani.  we tried using google image search and tineye but haven't been able to -----> come !!!  -----> up !!!  -----> with !!!  anything.  as a previous pro photographer it makes me sad that finding the photographer of a photo is so difficult to do.  i told my son that if anyone could find the answer, they would be on reddit.  :)    thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 73267, "year": "2019"}, {"autor": "Zoeh91", "date": "2019-06-09 11:08:28", "content": "How do you think of new photography projects? /!/ Hi all\nI'm an amateur photographer based near Manchester, UK and I've been trying to think of a creative project to occupy myself with. My favourite subjects to photograph are macro nature shots such as insects and flowers, or architecture shots such as cityscape or trying to show a quietness of a building. \nA lot of projects I've seen feature people in some capacity and that's what I'm most uncomfortable with so...\nHow do you come up with your photography projects? Also, hit me up with any links to non-people orientated photography projects, just because I'm nosy and love looking at them!\nThanks\nZoe", "link": "https://www.reddit.com/r/photography/comments/byj5z6/how_do_you_think_of_new_photography_projects/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how do you think of new photography projects? /!/ hi all\ni'm an amateur photographer based near manchester, uk and i've been trying to think of a creative project to occupy myself with. my favourite subjects to photograph are macro nature shots such as insects and flowers, or architecture shots such as cityscape or trying to show a quietness of a building. \na lot of projects i've seen feature people in some capacity and that's what i'm most uncomfortable -----> with !!!  so...\nhow do you -----> come !!!  -----> up !!!  -----> with !!!  your photography projects? also, hit me up with any links to non-people orientated photography projects, just because i'm nosy and love looking at them!\nthanks\nzoe", "sortedWord": "None", "Identifyer": null, "identifyer": 74485, "year": "2019"}, {"autor": "chrispn", "date": "2019-07-12 07:49:33", "content": "Clearest glass cup/container/vessel you can get for macro photography of liquids? /!/ I did a search on this and came up with no leads, using glass and clear in a search engine always shows you lens glass results. \n\nDoes anyone have any recommendations for a glass container for  a litre or less of liquid with good clarity for macro photography.  I've tried this with household cups and pyrex containers but the distortion and blur is too much. \n\nAny ideas you have of items you could purchase from Canada would be appreciated. Thanks.", "link": "https://www.reddit.com/r/photography/comments/cc7vuc/clearest_glass_cupcontainervessel_you_can_get_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "clearest glass cup/container/vessel you can get for macro photography of liquids? /!/ i did a search on this and -----> came !!!  -----> up !!!  -----> with !!!  no leads, using glass and clear in a search engine always shows you lens glass results. \n\ndoes anyone have any recommendations for a glass container for  a litre or less of liquid with good clarity for macro photography.  i've tried this with household cups and pyrex containers but the distortion and blur is too much. \n\nany ideas you have of items you could purchase from canada would be appreciated. thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 75563, "year": "2019"}, {"autor": "aanecdochee", "date": "2019-07-30 19:14:03", "content": "How much should I charge? /!/ I need help with figuring out a good price to charge for an upcoming wedding. But here’s where I’m struggling on coming up with a price:\n\n1. It’s my cousin’s wedding, so it’s pretty close family.\n2. I’m an amateur photographer, still in high school. So not the greatest, but definitely not the worst.\n3. I’ve never shot a wedding before (but I’ve always wanted to!)\n4. My cousin and her fiancé don’t have very wealthy incomes to put it, and I would feel bad if I charged them a lot. That’s a big reason they want me to shoot their wedding because it would be cheaper (and my cousin has always been really into my photos).", "link": "https://www.reddit.com/r/photography/comments/cjwjkj/how_much_should_i_charge/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "how much should i charge? /!/ i need help with figuring out a good price to charge for an upcoming wedding. but here’s where i’m struggling on -----> coming !!!  -----> up !!!  -----> with !!!  a price:\n\n1. it’s my cousin’s wedding, so it’s pretty close family.\n2. i’m an amateur photographer, still in high school. so not the greatest, but definitely not the worst.\n3. i’ve never shot a wedding before (but i’ve always wanted to!)\n4. my cousin and her fiancé don’t have very wealthy incomes to put it, and i would feel bad if i charged them a lot. that’s a big reason they want me to shoot their wedding because it would be cheaper (and my cousin has always been really into my photos).", "sortedWord": "None", "Identifyer": null, "identifyer": 75931, "year": "2019"}, {"autor": "nuckshell", "date": "2019-09-18 02:22:30", "content": "Product photographers, how do you setup pricing and deal with products that need to be shipped? /!/ I have worked in the e-commerce space for 5-years now. I own a small agency that does web design, web development, and produces content for online stores. Currently I am the lead developer but it's not something I am super passionate about - I want to start offering photography and video services. I have always dreamed of being a professional filmmaker or photographer, and I am passionate about e-commerce, now that I am hiring other developers I feel like it's the right opportunity.\n\nI would like to offer the following:\n- Product photography\n- Product GIFs\n- 360 images\n- 3D product renderings for AR (when browser support picks up)\n\nGood product images &amp; interactive experiences increases conversion. I have a lot of pre-existing clients who would be interested. I'm not too worried about selling the service - but I'm not sure _how_ to sell it.\nHere are some questions I have:\n\n1. I am based in Canada. Most clients are based in US. Most clients have dozens (if not hundreds) of products. Shipping would be a nightmare - are these bad candidates to promote my services toward? Or is there some sort of solution that I am missing? I have zero local clients, so local would require building from the ground up.\n\n2. Pricing. No matter which way I run the numbers - it sounds like this service will cost a lot. Now, I am used to quoting large sums of money to build an e-commerce site, however that always seemed like \"boring\" and \"necessary\" work so the money made sense! Whereas I am passionate about photography and it seems \"fun\" and \"extra\"  - and because of that I'm having a hard time coming up with a price.\n\nHere's how I _think_ I would promote the service:\n\n1. Offer pre-existing clients a \"Free Package\". This package would be for one product, and would include: Cover photo (high-res, white background, and can rotate 360 degrees), 3-4 secondary photography shots (backdrops, props, editing, etc), and one GIF-style video.\n\n2. If the client likes the service, they can provide a collection (most online vendors have 'collections' of similar product types) and I could provide a quote based on the collection.\n\nNow the concern is, that \"Free Package\" would be valued at $500 minimum. Would take a couple hours to shoot images, edit, create 360, edit video, source backdrops &amp; props, etc. And I would need to include the price of shipping/returns, purchasing props, hiring model, etc.\n\nOf course, that Price Per Product could be reduced if I did an entire collection, since I could develop a workflow and could use similar props/models/edits. But still, $300-500 per product, that would mean $3,000-$5,000 per collection (~10 products).\n\nWould people be willing to pay that? Might be a harder sell than I considered? Over am I over estimating the amount of work here? Or... Undervaluing what these services are worth?\n\nJust looking for some guidance. Would really like to do this, but I'm stuck on the business plan / marketing of it all.", "link": "https://www.reddit.com/r/photography/comments/d5r8cn/product_photographers_how_do_you_setup_pricing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "product photographers, how do you setup pricing and deal with products that need to be shipped? /!/ i have worked in the e-commerce space for 5-years now. i own a small agency that does web design, web development, and produces content for online stores. currently i am the lead developer but it's not something i am super passionate about - i want to start offering photography and video services. i have always dreamed of being a professional filmmaker or photographer, and i am passionate about e-commerce, now that i am hiring other developers i feel like it's the right opportunity.\n\ni would like to offer the following:\n- product photography\n- product gifs\n- 360 images\n- 3d product renderings for ar (when browser support picks up)\n\ngood product images &amp; interactive experiences increases conversion. i have a lot of pre-existing clients who would be interested. i'm not too worried about selling the service - but i'm not sure _how_ to sell it.\nhere are some questions i have:\n\n1. i am based in canada. most clients are based in us. most clients have dozens (if not hundreds) of products. shipping would be a nightmare - are these bad candidates to promote my services toward? or is there some sort of solution that i am missing? i have zero local clients, so local would require building from the ground up.\n\n2. pricing. no matter which way i run the numbers - it sounds like this service will cost a lot. now, i am used to quoting large sums of money to build an e-commerce site, however that always seemed like \"boring\" and \"necessary\" work so the money made sense! whereas i am passionate about photography and it seems \"fun\" and \"extra\"  - and because of that i'm having a hard time -----> coming !!!  -----> up !!!  -----> with !!!  a price.\n\nhere's how i _think_ i would promote the service:\n\n1. offer pre-existing clients a \"free package\". this package would be for one product, and would include: cover photo (high-res, white background, and can rotate 360 degrees), 3-4 secondary photography shots (backdrops, props, editing, etc), and one gif-style video.\n\n2. if the client likes the service, they can provide a collection (most online vendors have 'collections' of similar product types) and i could provide a quote based on the collection.\n\nnow the concern is, that \"free package\" would be valued at $500 minimum. would take a couple hours to shoot images, edit, create 360, edit video, source backdrops &amp; props, etc. and i would need to include the price of shipping/returns, purchasing props, hiring model, etc.\n\nof course, that price per product could be reduced if i did an entire collection, since i could develop a workflow and could use similar props/models/edits. but still, $300-500 per product, that would mean $3,000-$5,000 per collection (~10 products).\n\nwould people be willing to pay that? might be a harder sell than i considered? over am i over estimating the amount of work here? or... undervaluing what these services are worth?\n\njust looking for some guidance. would really like to do this, but i'm stuck on the business plan / marketing of it all.", "sortedWord": "None", "Identifyer": null, "identifyer": 76284, "year": "2019"}, {"autor": "ivanmalvin", "date": "2019-09-26 03:16:25", "content": "Uncommon aspect ratios when posting your work on social media (Instagram) - how do YOU format the photos? /!/ Most of my photos don't conform to instagram's square, 4:5, or 1.91:1 aspect ratios. When possible I do re-crop them to fit those ratios when posting to Instagram. However very often that makes for a bad result. Awkward framing, bodies cut off at awkward places, or just photos that were edited and cropped already, without those ratios in mind.\n\n I'm curious what solutions other people have come up with for this. The most obvious solution would seem to be a black or white background to fill in the blank space needed to match one of the ratios. Downside is I feel that almost always looks very unprofessional, like a horribly matted photo in a frame. It also ruins the grid layout of your profile/wall.\n\nWhat do you do for these types of photos?", "link": "https://www.reddit.com/r/photography/comments/d9dypg/uncommon_aspect_ratios_when_posting_your_work_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "uncommon aspect ratios when posting your work on social media (instagram) - how do you format the photos? /!/ most of my photos don't conform to instagram's square, 4:5, or 1.91:1 aspect ratios. when possible i do re-crop them to fit those ratios when posting to instagram. however very often that makes for a bad result. awkward framing, bodies cut off at awkward places, or just photos that were edited and cropped already, without those ratios in mind.\n\n i'm curious what solutions other people have -----> come !!!  -----> up !!!  -----> with !!!  for this. the most obvious solution would seem to be a black or white background to fill in the blank space needed to match one of the ratios. downside is i feel that almost always looks very unprofessional, like a horribly matted photo in a frame. it also ruins the grid layout of your profile/wall.\n\nwhat do you do for these types of photos?", "sortedWord": "None", "Identifyer": null, "identifyer": 76457, "year": "2019"}, {"autor": "Frantichamster", "date": "2019-10-06 11:54:42", "content": "Using phone camera instead of G7 X II advice - do I keep HDR setting on all the time etc? Which is more realistic? /!/ Hi all, I'm by no means a decent photographer but I enjoy using my Canon G7 X II and have learnt the basics enough to come up with some ok pictures.\n\nI have never had a decent smartphone and my friends kept bugging me to stop carrying around my camera and buy a good camera phone as they claimed they are \"just as good, if not better\".\n\nI took their advice and got a pixel 3 which I just took away with me on holiday. I tried to use only the phone as a tester and to see how happy i'd be with the results. I was a bit disappointed.\n\nLandscapes seemed quite good but maybe a little fake. \n\nIt was set up strangely to start and automatically has face softener on which makes you look like you've got make up on.... turned that off as soon as I realised.\n\nBut what should I do about HDR?\nIt is set automatically to be on all the time which is how I kept it. I am not actually sure what this setting is for however. Does it mean you are getting a more realistic photo because it is high definition or is it a really manipulating a picture using software? \nPictures and selfies of  people seemed far less flattering than my actual camera as blemishes, lines and wrinkles seem really pronounced and they make the subjects look older and more haggered. \n\nIs this showing a truer representation of the subject or is HDR enhancing the flaws?\n\nI would have thought my canon G7 X II would be a good representation of reality but people's features seem softer and less obvious on that. \n\nWhich is the truer picture?\n\nAnd lastly, would you keep HDR on for most landscape and subject pictures or turn it off?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/de29ks/using_phone_camera_instead_of_g7_x_ii_advice_do_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "using phone camera instead of g7 x ii advice - do i keep hdr setting on all the time etc? which is more realistic? /!/ hi all, i'm by no means a decent photographer but i enjoy using my canon g7 x ii and have learnt the basics enough to -----> come !!!  -----> up !!!  -----> with !!!  some ok pictures.\n\ni have never had a decent smartphone and my friends kept bugging me to stop carrying around my camera and buy a good camera phone as they claimed they are \"just as good, if not better\".\n\ni took their advice and got a pixel 3 which i just took away with me on holiday. i tried to use only the phone as a tester and to see how happy i'd be with the results. i was a bit disappointed.\n\nlandscapes seemed quite good but maybe a little fake. \n\nit was set up strangely to start and automatically has face softener on which makes you look like you've got make up on.... turned that off as soon as i realised.\n\nbut what should i do about hdr?\nit is set automatically to be on all the time which is how i kept it. i am not actually sure what this setting is for however. does it mean you are getting a more realistic photo because it is high definition or is it a really manipulating a picture using software? \npictures and selfies of  people seemed far less flattering than my actual camera as blemishes, lines and wrinkles seem really pronounced and they make the subjects look older and more haggered. \n\nis this showing a truer representation of the subject or is hdr enhancing the flaws?\n\ni would have thought my canon g7 x ii would be a good representation of reality but people's features seem softer and less obvious on that. \n\nwhich is the truer picture?\n\nand lastly, would you keep hdr on for most landscape and subject pictures or turn it off?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 76605, "year": "2019"}, {"autor": "mrskebs", "date": "2019-08-17 14:51:56", "content": "Photographer ruined my memories of my wedding with these pictures /!/ These are the pictures that I waited anxiously for a month to receive. Up until this point, I had seen 4 pictures. They looked pretty good, I didn't have any worries that the rest wouldn't. But this is what over half of my pictures look like. Grainy, dull, washed out, shadowed so our faces are dark. These are supposedly \"professional level quality.\" Yes, I paid less than other photographers, but its still a LOT of money. Also, I have a total of SIX pictures of just Nick and I. She gave no direction, we were completely on our own to come up with poses and know what would look good. \nBesides the quality of the pictures, the overall experience with this girl was just terrible. She left my wedding 2.5 hours earlier than we agreed to. Apparently she had to work early the next day. She would say I'd get pictures a certain day and then a week later she still hadn't sent them.\nI hired her because a facebook friend recommended her on a post that I put up asking for recommendations. \nIf anyone has any recommendations on someone who can edit these, please let me know.\nAlso, the last picture is one my mom took on her iPhone, just to compare what the colors actually looked like.", "link": "https://www.reddit.com/r/photography/comments/crn232/photographer_ruined_my_memories_of_my_wedding/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "photographer ruined my memories of my wedding with these pictures /!/ these are the pictures that i waited anxiously for a month to receive. up until this point, i had seen 4 pictures. they looked pretty good, i didn't have any worries that the rest wouldn't. but this is what over half of my pictures look like. grainy, dull, washed out, shadowed so our faces are dark. these are supposedly \"professional level quality.\" yes, i paid less than other photographers, but its still a lot of money. also, i have a total of six pictures of just nick and i. she gave no direction, we were completely on our own to -----> come !!!  -----> up !!!  -----> with !!!  poses and know what would look good. \nbesides the quality of the pictures, the overall experience with this girl was just terrible. she left my wedding 2.5 hours earlier than we agreed to. apparently she had to work early the next day. she would say i'd get pictures a certain day and then a week later she still hadn't sent them.\ni hired her because a facebook friend recommended her on a post that i put up asking for recommendations. \nif anyone has any recommendations on someone who can edit these, please let me know.\nalso, the last picture is one my mom took on her iphone, just to compare what the colors actually looked like.", "sortedWord": "None", "Identifyer": null, "identifyer": 77161, "year": "2019"}, {"autor": "itstrueallofit96", "date": "2019-10-21 14:03:46", "content": "Do bands know personaly kow about the Concert Photography Contracts or is it only their management? /!/ Sorry if this is a repeat or a sore subject around here, but I just went down a rabbit hole learning about the past few years of discussions about these contracts bands and artists are giving out to photographers shooting their concerts and the copyright controversy from artists like Taylor Swift, Lady Gaga, and Foo Fighters. \n\nMy question is, are the bands/artists themselves making up these rules or are even aware of them at all? I'm pretty sure Taylor Swift personally became aware leading to her contract to photographers being changed but is it something that they even think about or is it just their management companies that come up with these decisions and rules. \n\nOne of my dream gigs was to actually photograph a Foo Fighters show, and when I saw the contract controversy, it kind of hurt. They're a really important band to me and their music has helped me through a lot of tough times through the start of my photography career out of college. When I saw this last night, it really hit me. but it just sounded really off that musical artists, especially ones who fight their own copyright battles with their music labels, would personally allow this. I even saw one list have Tom Petty's name on their (though I couldn't find any other article listing him at all like some of the others so who knows how true that is) and that really seemed off because of how well documented Petty was fighting for copyright rights. \n\nSo to anyone that either photographs concerts or has talked about this with people in the know, do bands actually know that this is happening or is it just something that their management does to \"protect the artists' likeness\" as they like to say? Also, a lot of the artists listed as having these contracts are ones that I love. Is it wrong to listen to their work and support them or is it not really them thats causing this, but shitty managers?\n\nAgain, sorry if this has been brought up to death, but as someone who's dream it is to photograph some of my favorite bands in concert like Foo Fighters, I just would like to be more informed on this issue with people who probably know a good deal about it!", "link": "https://www.reddit.com/r/photography/comments/dl10ot/do_bands_know_personaly_kow_about_the_concert/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "do bands know personaly kow about the concert photography contracts or is it only their management? /!/ sorry if this is a repeat or a sore subject around here, but i just went down a rabbit hole learning about the past few years of discussions about these contracts bands and artists are giving out to photographers shooting their concerts and the copyright controversy from artists like taylor swift, lady gaga, and foo fighters. \n\nmy question is, are the bands/artists themselves making up these rules or are even aware of them at all? i'm pretty sure taylor swift personally became aware leading to her contract to photographers being changed but is it something that they even think about or is it just their management companies that -----> come !!!  -----> up !!!  -----> with !!!  these decisions and rules. \n\none of my dream gigs was to actually photograph a foo fighters show, and when i saw the contract controversy, it kind of hurt. they're a really important band to me and their music has helped me through a lot of tough times through the start of my photography career out of college. when i saw this last night, it really hit me. but it just sounded really off that musical artists, especially ones who fight their own copyright battles with their music labels, would personally allow this. i even saw one list have tom petty's name on their (though i couldn't find any other article listing him at all like some of the others so who knows how true that is) and that really seemed off because of how well documented petty was fighting for copyright rights. \n\nso to anyone that either photographs concerts or has talked about this with people in the know, do bands actually know that this is happening or is it just something that their management does to \"protect the artists' likeness\" as they like to say? also, a lot of the artists listed as having these contracts are ones that i love. is it wrong to listen to their work and support them or is it not really them thats causing this, but shitty managers?\n\nagain, sorry if this has been brought up to death, but as someone who's dream it is to photograph some of my favorite bands in concert like foo fighters, i just would like to be more informed on this issue with people who probably know a good deal about it!", "sortedWord": "None", "Identifyer": null, "identifyer": 77715, "year": "2019"}, {"autor": "TravelingBurger", "date": "2019-10-24 16:46:59", "content": "Has anyone else here been using the iPhone 11 Pro for shooting and editing? /!/ I’ve been using the iPhone 11 Pro the last few days for both of my shooting and editing just to see what I could come up with. I have to say that I am incredibly impressed with the results. \n\nI tested out Night Mode to see how that actually effected night time shots and I’m blown away. I was skeptical about how clear hand held long exposure shots would turn out but they turn out amazing. Not sure how Apple is doing their computational photography but I wish camera manufactures would follow suit. I can do a 5-10 second exposure hand held with no blur. \n\nThe wide angle is very impressive. In low light you can start to tell it gets much more soft compared to the wide and telephoto, but it’s pretty great to have. Portrait mode I can tell has been improved. I find it to be much better on inanimate objects. \n\nI’ve never really experimented with editing on my phone beyond what is in the default photos app but I downloaded Lightroom to see what I could do. It is pretty much a desktop photo editor at this point. You can really do some detailed editing on it, which is great.\n\nAll in all I’m very impressed with both shooting and editing on the iPhone 11 Pro. It’s nice to have an all in one device for on the go. Has anyone else here used it for shooting or editing? What are your thoughts on the features I talked about on the phone?", "link": "https://www.reddit.com/r/photography/comments/dmj3rq/has_anyone_else_here_been_using_the_iphone_11_pro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "has anyone else here been using the iphone 11 pro for shooting and editing? /!/ i’ve been using the iphone 11 pro the last few days for both of my shooting and editing just to see what i could -----> come !!!  -----> up !!!  -----> with !!! . i have to say that i am incredibly impressed with the results. \n\ni tested out night mode to see how that actually effected night time shots and i’m blown away. i was skeptical about how clear hand held long exposure shots would turn out but they turn out amazing. not sure how apple is doing their computational photography but i wish camera manufactures would follow suit. i can do a 5-10 second exposure hand held with no blur. \n\nthe wide angle is very impressive. in low light you can start to tell it gets much more soft compared to the wide and telephoto, but it’s pretty great to have. portrait mode i can tell has been improved. i find it to be much better on inanimate objects. \n\ni’ve never really experimented with editing on my phone beyond what is in the default photos app but i downloaded lightroom to see what i could do. it is pretty much a desktop photo editor at this point. you can really do some detailed editing on it, which is great.\n\nall in all i’m very impressed with both shooting and editing on the iphone 11 pro. it’s nice to have an all in one device for on the go. has anyone else here used it for shooting or editing? what are your thoughts on the features i talked about on the phone?", "sortedWord": "None", "Identifyer": null, "identifyer": 77836, "year": "2019"}, {"autor": "Juulmo", "date": "2019-10-29 07:36:49", "content": "Would you be interested in a Patreon based editing service? /!/ The idea for this came to me on our last couple shoots. My friends and i go out regularly for all kinds of photography but i noticed that they almost never post to social media.  \n\n\nWhile discussing this topic with them i found out that some of them just are burned out with editing, others don't have the time due to work etc and some just don't like spending their time in front of a pc instead of going out and shoot more.  \n\n\nSo the idea was born and now i just take their sd cards after the shoot and give them a basic edit along side mine.  \nI'd like to extend that offer to other photographers around the globe and here's what i came up with:  \n\n\nIt's Patreon based so for a fixed sum every month you can send me a certain number of raws and depending on the amount contributed different edits will be made  \n\n\nfor example:  \n\n\n* basic color correction (exposure, wb, contrast, shadows, highlights)\n* creative color correction\n* crop/straighten\n* b+w\n* retouching\n* creative editing (adding textures, borders, etc. crazy stuff)  \n\n\nFor higher tiers or longer cooperations i thought of creating a preset with the photographer so their prefered style of editing is applied to every photo they send me  \n\n\nIs this something you would use?  \nHow much would you invest in a service like that?  \nWhat other services would you wish for?  \n\n\nThank you for spending your time reading, i know it's a long one", "link": "https://www.reddit.com/r/photography/comments/domi8q/would_you_be_interested_in_a_patreon_based/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "would you be interested in a patreon based editing service? /!/ the idea for this came to me on our last couple shoots. my friends and i go out regularly for all kinds of photography but i noticed that they almost never post to social media.  \n\n\nwhile discussing this topic with them i found out that some of them just are burned out with editing, others don't have the time due to work etc and some just don't like spending their time in front of a pc instead of going out and shoot more.  \n\n\nso the idea was born and now i just take their sd cards after the shoot and give them a basic edit along side mine.  \ni'd like to extend that offer to other photographers around the globe and here's what i -----> came !!!  -----> up !!!  -----> with !!! :  \n\n\nit's patreon based so for a fixed sum every month you can send me a certain number of raws and depending on the amount contributed different edits will be made  \n\n\nfor example:  \n\n\n* basic color correction (exposure, wb, contrast, shadows, highlights)\n* creative color correction\n* crop/straighten\n* b+w\n* retouching\n* creative editing (adding textures, borders, etc. crazy stuff)  \n\n\nfor higher tiers or longer cooperations i thought of creating a preset -----> with !!!  the photographer so their prefered style of editing is applied to every photo they send me  \n\n\nis this something you would use?  \nhow much would you invest in a service like that?  \nwhat other services would you wish for?  \n\n\nthank you for spending your time reading, i know it's a long one", "sortedWord": "None", "Identifyer": null, "identifyer": 77947, "year": "2019"}, {"autor": "avatarstany", "date": "2019-11-02 03:04:04", "content": "Need someone to consult \"Photography Rates\" for a Creative Agency /!/ Hello, I'm Stany. I recently started working for a startup creative agency which I have no experience as a Manager/Photographer. A couple of days ago my CEO asked me to come up with the Rates/Price list which will be shared among our clients. I do not know how to approach it and the due for the submission is on Monday. If anyone can help me out by having a small chat and clear some doubts I have would be much appreciated!.", "link": "https://www.reddit.com/r/photography/comments/dqeqoh/need_someone_to_consult_photography_rates_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "need someone to consult \"photography rates\" for a creative agency /!/ hello, i'm stany. i recently started working for a startup creative agency which i have no experience as a manager/photographer. a couple of days ago my ceo asked me to -----> come !!!  -----> up !!!  -----> with !!!  the rates/price list which will be shared among our clients. i do not know how to approach it and the due for the submission is on monday. if anyone can help me out by having a small chat and clear some doubts i have would be much appreciated!.", "sortedWord": "None", "Identifyer": null, "identifyer": 78014, "year": "2019"}, {"autor": "Cam_kitt", "date": "2019-12-14 13:45:21", "content": "Wedding shoot contract /!/ Hi all! My first posting in this sub but I need a little advice from all you shutter bugs. \n\nI’m doing my very first wedding shoot in March and am coming up with my contract for the couple. I already have several points for the contract but I need to know what I should add to cover my work as well as any other things I need to include to make sure the whole ordeal is painless. \nAny advice given will be greatly appreciated. I just want to do my best for this job and am very excited so don’t want to overlook anything. \nThanks!", "link": "https://www.reddit.com/r/photography/comments/eajvl6/wedding_shoot_contract/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "wedding shoot contract /!/ hi all! my first posting in this sub but i need a little advice from all you shutter bugs. \n\ni’m doing my very first wedding shoot in march and am -----> coming !!!  -----> up !!!  -----> with !!!  my contract for the couple. i already have several points for the contract but i need to know what i should add to cover my work as well as any other things i need to include to make sure the whole ordeal is painless. \nany advice given will be greatly appreciated. i just want to do my best for this job and am very excited so don’t want to overlook anything. \nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 78909, "year": "2019"}, {"autor": "sarbea7", "date": "2019-12-08 18:11:22", "content": "Dramatic/discouraging friend/model... /!/ I just moved to a new city with one of my friends and I really am wanting to grow my photography portfolio and social media. I bought a new camera yesterday and was dying to try it out. I’ve always asked to take photos of him and he would come up with an excuses that he’s busy. But finally last night he agreed to let me take photos of him. I was just getting use to the settings and he was basically yelling at me that Im horrible and I don’t know what I’m doing. Well I jumped from a common rebel T5 to a cannon RP and I haven’t done night light photography in awhile to boot. So yes, I was struggling a moment just figuring out settings. I finally got it set right and took some good photos. Well he said he didn’t like them because I didn’t make him look skinny and I can’t post them anywhere. It’s not like I can change the way he looks by my camera. I think it comes down to his self image issues but how can I overcome this photography wise? Just throw the photos away and never take photos of him again? I don’t want to put pressure in our friendship of just posting them, but I felt like I just stood out in 15* weather for 3 hours for nothing.", "link": "https://www.reddit.com/r/photography/comments/e7x3cj/dramaticdiscouraging_friendmodel/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "dramatic/discouraging friend/model... /!/ i just moved to a new city with one of my friends and i really am wanting to grow my photography portfolio and social media. i bought a new camera yesterday and was dying to try it out. i’ve always asked to take photos of him and he would -----> come !!!  -----> up !!!  -----> with !!!  an excuses that he’s busy. but finally last night he agreed to let me take photos of him. i was just getting use to the settings and he was basically yelling at me that im horrible and i don’t know what i’m doing. well i jumped from a common rebel t5 to a cannon rp and i haven’t done night light photography in awhile to boot. so yes, i was struggling a moment just figuring out settings. i finally got it set right and took some good photos. well he said he didn’t like them because i didn’t make him look skinny and i can’t post them anywhere. it’s not like i can change the way he looks by my camera. i think it comes down to his self image issues but how can i overcome this photography wise? just throw the photos away and never take photos of him again? i don’t want to put pressure in our friendship of just posting them, but i felt like i just stood out in 15* weather for 3 hours for nothing.", "sortedWord": "None", "Identifyer": null, "identifyer": 79249, "year": "2019"}, {"autor": "_star_lord", "date": "2019-04-15 14:38:50", "content": "I just released my first book! /!/ Hello Reddit! I just released my first book and I just wanna get the word out on it. A couple years ago I came up with an idea to shoot 100 portraits, write 100 poems and come up with 100 sketches all for a sort of coffee table book. I also ended up painting all over the pages with splatter, brush strokes what have you. It's all very abstract, the portraits are separate from the poems, the poems are separate from the sketches and so on but together it makes the whole piece. Each page contains one poem, one portrait, one sketch and it's all been painted on. I am splitting the book into two parts cause 100 of all that was just overwhelming for one book, but anyway, I linked the Amazon page! Thank you!\n\n&amp;#x200B;\n\n[https://www.amazon.com/dp/109251533X?ref\\_=pe\\_3052080\\_397514860](https://www.amazon.com/dp/109251533X?ref_=pe_3052080_397514860)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://i.redd.it/1tp2ccqmvfs21.jpg", "link": "https://www.reddit.com/r/photography/comments/bdgq4k/i_just_released_my_first_book/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i just released my first book! /!/ hello reddit! i just released my first book and i just wanna get the word out on it. a couple years ago i -----> came !!!  -----> up !!!  -----> with !!!  an idea to shoot 100 portraits, write 100 poems and come -----> up !!!  -----> with !!!  100 sketches all for a sort of coffee table book. i also ended up painting all over the pages with splatter, brush strokes what have you. it's all very abstract, the portraits are separate from the poems, the poems are separate from the sketches and so on but together it makes the whole piece. each page contains one poem, one portrait, one sketch and it's all been painted on. i am splitting the book into two parts cause 100 of all that was just overwhelming for one book, but anyway, i linked the amazon page! thank you!\n\n&amp;#x200b;\n\n[https://www.amazon.com/dp/109251533x?ref\\_=pe\\_3052080\\_397514860](https://www.amazon.com/dp/109251533x?ref_=pe_3052080_397514860)\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nhttps://i.redd.it/1tp2ccqmvfs21.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 79848, "year": "2019"}, {"autor": "nasedova5", "date": "2019-04-02 13:47:11", "content": "5 Reasons to use magnets for a photographer📸 /!/  \n\n1. It's profitable💰.   \nYes, for a good picture people are willing to pay! But they are willing to pay 2-3 times more for a souvenir with his picture. Put the photo and framed photo next, and what will you choose?\n\n2. You do not need complex equipment and knowledge🤓 to print on a t-shirt or on a mug. You just need to print the photo on the printer, crop and paste it into the frame.\n\n3. You don't have enough ideas🤔  \nDon't need to come up with anything, you just choose the right frame for your eventt🚴‍♀️👩‍❤️‍💋‍👨⛹️‍♂️. It's okay if the magnets are not sold, you can easily replace the photo and use it on another event.\n\n4. You have to surprise your customers😲.   \nThen they will talk about you and advise their friends. I bet not many of your competitors use magnets. Be the first to get ahead of the competition.\n\n5. Don't try, you won't know! Magnets is only 1 way how to pass it only you know how to pass it. Surely you already have a couple of ideas on how to apply them. Am I right?😉\n\nI chose several popular models to start \n\n✨M size - 3.2x2.3 inch with stand, the magnet can not only be hung on the refrigerator or iron cabinet but also put on the table, there is a stand on the back side!  \n[https://www.amazon.com/dp/B07K6PXM6Z](https://www.amazon.com/dp/B07K6PXM6Z?fbclid=IwAR2xg8UlcYfpn1j7bNYFTD56AxweimUcKveuKx6PQ39tposqZ9CGX3B7Doo)\n\n✨L size-4x2.5 inch rectangular magnet with large photo field, classic size.  \n[https://www.amazon.com/dp/B07DBRNV3L](https://www.amazon.com/dp/B07DBRNV3L?fbclid=IwAR3Y7lhNa9DOsJzsgPMr9oTjNi-Mu-iINqSQFJCX3vATFfoytNUyOjGe8ho)\n\n✨XL size is 4x4 inch square, good size for big photo is the most demanded format.  \n[https://www.amazon.com/dp/B079YQJCBB](https://www.amazon.com/dp/B079YQJCBB?fbclid=IwAR2IWAJSgby9BLueqpHtDCpsNv6e81V68QAH4znP4FiHKQaAA4xJFYtwh0k)\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/b8jfs1/5_reasons_to_use_magnets_for_a_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "5 reasons to use magnets for a photographer📸 /!/  \n\n1. it's profitable💰.   \nyes, for a good picture people are willing to pay! but they are willing to pay 2-3 times more for a souvenir with his picture. put the photo and framed photo next, and what will you choose?\n\n2. you do not need complex equipment and knowledge🤓 to print on a t-shirt or on a mug. you just need to print the photo on the printer, crop and paste it into the frame.\n\n3. you don't have enough ideas🤔  \ndon't need to -----> come !!!  -----> up !!!  -----> with !!!  anything, you just choose the right frame for your eventt🚴‍♀️👩‍❤️‍💋‍👨⛹️‍♂️. it's okay if the magnets are not sold, you can easily replace the photo and use it on another event.\n\n4. you have to surprise your customers😲.   \nthen they will talk about you and advise their friends. i bet not many of your competitors use magnets. be the first to get ahead of the competition.\n\n5. don't try, you won't know! magnets is only 1 way how to pass it only you know how to pass it. surely you already have a couple of ideas on how to apply them. am i right?😉\n\ni chose several popular models to start \n\n✨m size - 3.2x2.3 inch with stand, the magnet can not only be hung on the refrigerator or iron cabinet but also put on the table, there is a stand on the back side!  \n[https://www.amazon.com/dp/b07k6pxm6z](https://www.amazon.com/dp/b07k6pxm6z?fbclid=iwar2xg8ulcyfpn1j7bnyftd56axweimuckveukx6pq39tposqz9cgx3b7doo)\n\n✨l size-4x2.5 inch rectangular magnet with large photo field, classic size.  \n[https://www.amazon.com/dp/b07dbrnv3l](https://www.amazon.com/dp/b07dbrnv3l?fbclid=iwar3y7lhna9dosjzsgpmr9otjni-mu-iinqsqfjcx3vatffoytnuyojge8ho)\n\n✨xl size is 4x4 inch square, good size for big photo is the most demanded format.  \n[https://www.amazon.com/dp/b079yqjcbb](https://www.amazon.com/dp/b079yqjcbb?fbclid=iwar2iwajsgby9blueqphtdcpsnv6e81v68qah4znp4fihkqaaa4xjfytwh0k)\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 80081, "year": "2019"}, {"autor": "PabloJan", "date": "2019-02-06 16:04:24", "content": "I did an experimental fashion shoot with a friend and a projector /!/ A friend of mine asked me to do a shoot with him as he is an aspiring model but, he didn't have much of an idea beyond just doing a shoot. I thought that I may as well try something fun or different and decided to try to use strobes combined with a projector to see what kind of effect I could get. I set up a background, found a simple pattern online to project and went for it! It was a bit of a challenge balancing the strobes with the projector as the projector was not very powerful but here is what I came up with.\n\nhttps://i.redd.it/a7rk7bmo0ze21.jpg", "link": "https://www.reddit.com/r/photography/comments/ans66z/i_did_an_experimental_fashion_shoot_with_a_friend/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i did an experimental fashion shoot with a friend and a projector /!/ a friend of mine asked me to do a shoot with him as he is an aspiring model but, he didn't have much of an idea beyond just doing a shoot. i thought that i may as well try something fun or different and decided to try to use strobes combined with a projector to see what kind of effect i could get. i set up a background, found a simple pattern online to project and went for it! it was a bit of a challenge balancing the strobes -----> with !!!  the projector as the projector was not very powerful but here is what i -----> came !!!  -----> up !!!  -----> with !!! .\n\nhttps://i.redd.it/a7rk7bmo0ze21.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 80590, "year": "2019"}, {"autor": "SlimtheMidgetKiller", "date": "2019-02-28 18:22:10", "content": "Requests for suggestions and ideas for a suicide awareness shoot. /!/ Doing a shoot with a model in a couple weeks and the theme or idea of the shoot is to bring awareness to suicide. The model recently had a suicide attempt and this is a way for her to work through that experience (in her words) we’ve come up with ideas to reenact some common suicide themes while having words written on her body that people feel or experience when they are depressed or suicidal. Would love some input on any ideas you guys may have for the shoot. ", "link": "https://www.reddit.com/r/photography/comments/avubs9/requests_for_suggestions_and_ideas_for_a_suicide/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "requests for suggestions and ideas for a suicide awareness shoot. /!/ doing a shoot with a model in a couple weeks and the theme or idea of the shoot is to bring awareness to suicide. the model recently had a suicide attempt and this is a way for her to work through that experience (in her words) we’ve -----> come !!!  -----> up !!!  -----> with !!!  ideas to reenact some common suicide themes while having words written on her body that people feel or experience when they are depressed or suicidal. would love some input on any ideas you guys may have for the shoot. ", "sortedWord": "None", "Identifyer": null, "identifyer": 81666, "year": "2019"}, {"autor": "vikingceg4", "date": "2019-01-03 05:29:44", "content": "Photo Inspiration /!/ I am trying to take and post one photo a day for 2019. \n\nDoes anyone have tips about not being too repetitive and how to come up with ideas about what to shoot?\n\nThanks! :)", "link": "https://www.reddit.com/r/photography/comments/ac2fyi/photo_inspiration/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "photo inspiration /!/ i am trying to take and post one photo a day for 2019. \n\ndoes anyone have tips about not being too repetitive and how to -----> come !!!  -----> up !!!  -----> with !!!  ideas about what to shoot?\n\nthanks! :)", "sortedWord": "None", "Identifyer": null, "identifyer": 82240, "year": "2019"}, {"autor": "awesometographer", "date": "2019-04-21 16:45:50", "content": "Budget-friendly set tip: ask flooring companies for damaged boxes of flooring for set building. /!/ I'll keep this brief and quick. I've got a friend who needs some simple marketing stuff for yoga / fitness / etc kinds of clothes, and I'm helping out with the photo side of things, images, network, etc.\n\nSets make a fair bit of difference in images, and she wanted a set that somewhat fit the theme. So I came up with the idea of a modular set that could be set up again and again in different locations.\n\nWe wanted a distressed, aged looking floor, so I went to a flooring store nearby and asked \"Y'all got any boxes of damaged flooring?\" cause of course they do. If you've ever put in floating, click type vinyl flooring, the locking mechanism is fairly fragile.\n\nDude said if I bought 1 box of new flooring, he'd toss in 2 boxes of damaged. Since I don't need it to be perfect, and will eventually screw everything down onto some plywood, somewhat broken is fine. And 3 boxes is perfect for 8'x6' base which is a fair set size.\n\n[So we were able to do the flooring for the project for $23.00](https://i.imgur.com/fXDOx1Y.jpg)", "link": "https://www.reddit.com/r/photography/comments/bfqs9i/budgetfriendly_set_tip_ask_flooring_companies_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "budget-friendly set tip: ask flooring companies for damaged boxes of flooring for set building. /!/ i'll keep this brief and quick. i've got a friend who needs some simple marketing stuff for yoga / fitness / etc kinds of clothes, and i'm helping out with the photo side of things, images, network, etc.\n\nsets make a fair bit of difference in images, and she wanted a set that somewhat fit the theme. so i -----> came !!!  -----> up !!!  -----> with !!!  the idea of a modular set that could be set -----> up !!!  again and again in different locations.\n\nwe wanted a distressed, aged looking floor, so i went to a flooring store nearby and asked \"y'all got any boxes of damaged flooring?\" cause of course they do. if you've ever put in floating, click type vinyl flooring, the locking mechanism is fairly fragile.\n\ndude said if i bought 1 box of new flooring, he'd toss in 2 boxes of damaged. since i don't need it to be perfect, and will eventually screw everything down onto some plywood, somewhat broken is fine. and 3 boxes is perfect for 8'x6' base which is a fair set size.\n\n[so we were able to do the flooring for the project for $23.00](https://i.imgur.com/fxdox1y.jpg)", "sortedWord": "None", "Identifyer": null, "identifyer": 84127, "year": "2019"}, {"autor": "afdlips", "date": "2019-06-26 01:22:03", "content": "Has anyone used Frame it Easy for frames? /!/ I have two gallery showings this month and they want big prints (30\" x 45\"). I can't afford custom frames, hell I can hardly afford frameiteasy.com frames. I have to buy 5 prints at this size among a bunch of 20x30's and 12x18's. All in all, I need to come up with 20 frames and prints.", "link": "https://www.reddit.com/r/photography/comments/c5iwc6/has_anyone_used_frame_it_easy_for_frames/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "has anyone used frame it easy for frames? /!/ i have two gallery showings this month and they want big prints (30\" x 45\"). i can't afford custom frames, hell i can hardly afford frameiteasy.com frames. i have to buy 5 prints at this size among a bunch of 20x30's and 12x18's. all in all, i need to -----> come !!!  -----> up !!!  -----> with !!!  20 frames and prints.", "sortedWord": "None", "Identifyer": null, "identifyer": 85535, "year": "2019"}, {"autor": "OptionNate", "date": "2019-07-01 22:28:43", "content": "Need a Catch Phrase For New Photography Company! /!/ Hi Everyone, a buddy of mine and I are starting our own photography side gig, going legit making the LLC, and I am just about finished with a simple site\nhttp://www.digital-image-guys.com ( let me know what you think )\n\nWas Curious if you guys could help me out come up with a good catch phrase to put on the site / biz cards... The Obvious Anagram of the name is DIG so maybe something with that? \n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/c814g0/need_a_catch_phrase_for_new_photography_company/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "need a catch phrase for new photography company! /!/ hi everyone, a buddy of mine and i are starting our own photography side gig, going legit making the llc, and i am just about finished -----> with !!!  a simple site\nhttp://www.digital-image-guys.com ( let me know what you think )\n\nwas curious if you guys could help me out -----> come !!!  -----> up !!!  -----> with !!!  a good catch phrase to put on the site / biz cards... the obvious anagram of the name is dig so maybe something with that? \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 85926, "year": "2019"}, {"autor": "Q12-00006", "date": "2019-07-20 02:16:28", "content": "Anyone else have a haunted camera? /!/ About some time ago, I bought a camera from a guy at a local fair. It was an Olympus E-400, and I thought it was a bargain. I was drawn to this camera initially because of the letter E which I thought of as *Equality,* but you might think of *Excellent* and that would be a good guess. The 400 also piqued my interest because it is of course a square number, very prevalent in the photograph theory involving squares. But enough about me.\n\nThe guy who sold it to me was old and scary like a demon with a beard, and when he breathed in, it caused a vacuum in the air as if he had sucked up all of the Earth's atmosphere - the exact kind of guy you expect to meet at a local fair. He said he didn't want any of my money for the camera; he just asked me to take a photo for him some time and made me promise him. Seems easy enough. What's the catch, I thought? \n\nAnd then I forgot all about this demon man with vacuum breath of fire for eyes. I was really excited because photographs are sort of art in a way, and if you shake the camera a bit, the images can even look like a real painting.\n\nBut soon enough (immediately pretty much) I started to see things in the pictures I was taking. Then they became more obvious and more ominous. Ever since that fateful day, which had started much like any other, I have been cursed with haunted pics, no matter what I do most of the time. It's Hell. \n\nThe effects of the Poltergeist are varied. Lots of the pictures I take of people just look like ghostly apparitions - like normal people but floating about looking blurred, as if the ghost is manipulating reality towards the shadow realm, or maybe even the photons themselves are being warped by the presence of a spectre in the lens.\n\nSome photos are just blackness and at least 2 have just been pictures of the ground. That could be my fault though. One one trip, the Poltergeist even moved the CF card from the camera into my card reader and I didn't realise until I got home and I didn't have the photographs of any of the women I saw. That ghostly taunting message popping up on the screen made so much more sense now. \n\nThe next day, I put the CF card in, and it still came up with the same taunting message about the battery being low. I did the hack where you take the power block out and recharge it and it fixed it for a while but I have to do it pretty much all the time after any late night session with spiders in my house. But enough about me.\n\nThe final straw when I knew my ghost had taken things too far was when it photoshopped pictures of my amazing best friend and my girlfriend having sex. I can tell you, I certainly gave that ghost a piece of my mind for treating my best friend like an animal in that way and my girlfriend too. I remember my girlfriend sort of looked really sad at the time, in so many different ways. Probably because understood the pain I go through.\n\nBut enough about me, I don't want me to come across as arrogant or some sort of drama queen, but I came to find out based on multiple possibilities and my own experience that the mysterious camera guy was the Devil, and he had most likely given me a cursed camera for some sort of malevolent purpose, or maybe just a hellish prank?\n\nHe's not asked me to take that photo for him yet, but I'm not worried because I don't think he will. It is like when you give a kid a skateboard and you tell him to show you a trick some day and he never does.\n\nI have tried to get rid of the camera but I just can't. I've been to about ten different spots deep in the woods and tried to bury it so it's out of my life for good, but every single time I go back the next day to see if it's been taken and every single time it's in the exact same spot I left it. It's a curse!\n\nMy back has hurt a lot more lately. I don't know if it's related?\n\nAnyway, I Just wondered if anybody else had any experience with a haunted camera, video-recorder, or any haunted electronics really. My great uncle always swore that his 303 was haunted, but one night I heard those riffs bubbling out the attic at 4am and knew that no way on Earth could a haunted synth sound that good. He also died of a meth overdose so he talked a lot of shit. My last digital camera was haunted with many of the same symptoms, but by a different ghost /low-level demon.\n\nI think it is worth mentioning, I took a picture of a dead beetle once so the beetle's spirit might have inhabited my camera, but I since deleted the picture because I didn't want any backlash if it got leaked to the media. It's probably not related, but I hope by deleting the Image, I am deleting the Spirit.", "link": "https://www.reddit.com/r/photography/comments/cfgjvm/anyone_else_have_a_haunted_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "anyone else have a haunted camera? /!/ about some time ago, i bought a camera from a guy at a local fair. it was an olympus e-400, and i thought it was a bargain. i was drawn to this camera initially because of the letter e which i thought of as *equality,* but you might think of *excellent* and that would be a good guess. the 400 also piqued my interest because it is of course a square number, very prevalent in the photograph theory involving squares. but enough about me.\n\nthe guy who sold it to me was old and scary like a demon with a beard, and when he breathed in, it caused a vacuum in the air as if he had sucked up all of the earth's atmosphere - the exact kind of guy you expect to meet at a local fair. he said he didn't want any of my money for the camera; he just asked me to take a photo for him some time and made me promise him. seems easy enough. what's the catch, i thought? \n\nand then i forgot all about this demon man with vacuum breath of fire for eyes. i was really excited because photographs are sort of art in a way, and if you shake the camera a bit, the images can even look like a real painting.\n\nbut soon enough (immediately pretty much) i started to see things in the pictures i was taking. then they became more obvious and more ominous. ever since that fateful day, which had started much like any other, i have been cursed with haunted pics, no matter what i do most of the time. it's hell. \n\nthe effects of the poltergeist are varied. lots of the pictures i take of people just look like ghostly apparitions - like normal people but floating about looking blurred, as if the ghost is manipulating reality towards the shadow realm, or maybe even the photons themselves are being warped by the presence of a spectre in the lens.\n\nsome photos are just blackness and at least 2 have just been pictures of the ground. that could be my fault though. one one trip, the poltergeist even moved the cf card from the camera into my card reader and i didn't realise until i got home and i didn't have the photographs of any of the women i saw. that ghostly taunting message popping up on the screen made so much more sense now. \n\nthe next day, i put the cf card in, and it still -----> came !!!  -----> up !!!  -----> with !!!  the same taunting message about the battery being low. i did the hack where you take the power block out and recharge it and it fixed it for a while but i have to do it pretty much all the time after any late night session with spiders in my house. but enough about me.\n\nthe final straw when i knew my ghost had taken things too far was when it photoshopped pictures of my amazing best friend and my girlfriend having sex. i can tell you, i certainly gave that ghost a piece of my mind for treating my best friend like an animal in that way and my girlfriend too. i remember my girlfriend sort of looked really sad at the time, in so many different ways. probably because understood the pain i go through.\n\nbut enough about me, i don't want me to come across as arrogant or some sort of drama queen, but i came to find out based on multiple possibilities and my own experience that the mysterious camera guy was the devil, and he had most likely given me a cursed camera for some sort of malevolent purpose, or maybe just a hellish prank?\n\nhe's not asked me to take that photo for him yet, but i'm not worried because i don't think he will. it is like when you give a kid a skateboard and you tell him to show you a trick some day and he never does.\n\ni have tried to get rid of the camera but i just can't. i've been to about ten different spots deep in the woods and tried to bury it so it's out of my life for good, but every single time i go back the next day to see if it's been taken and every single time it's in the exact same spot i left it. it's a curse!\n\nmy back has hurt a lot more lately. i don't know if it's related?\n\nanyway, i just wondered if anybody else had any experience with a haunted camera, video-recorder, or any haunted electronics really. my great uncle always swore that his 303 was haunted, but one night i heard those riffs bubbling out the attic at 4am and knew that no way on earth could a haunted synth sound that good. he also died of a meth overdose so he talked a lot of shit. my last digital camera was haunted with many of the same symptoms, but by a different ghost /low-level demon.\n\ni think it is worth mentioning, i took a picture of a dead beetle once so the beetle's spirit might have inhabited my camera, but i since deleted the picture because i didn't want any backlash if it got leaked to the media. it's probably not related, but i hope by deleting the image, i am deleting the spirit.", "sortedWord": "None", "Identifyer": null, "identifyer": 86650, "year": "2019"}, {"autor": "Vienaragis90", "date": "2019-07-23 16:54:05", "content": "Has anyone participated in The Print Swap before (not the one from this sub) /!/ https://www.theprintswap.com/\n\nThey reached out to me on Instagram a while back asking me to participate with a specific photo. I almost did it, but I've head some bad stories about competitions owning all rights to your photo after. I did some digging to see if I could find any red flags and didn't come up with much. Any thoughts or experience with these guys? I've been tempted to participate a few times but my gut instinct is to stay away. Might just be paranoid though.", "link": "https://www.reddit.com/r/photography/comments/cgv6ct/has_anyone_participated_in_the_print_swap_before/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "has anyone participated in the print swap before (not the one from this sub) /!/ https://www.theprintswap.com/\n\nthey reached out to me on instagram a while back asking me to participate with a specific photo. i almost did it, but i've head some bad stories about competitions owning all rights to your photo after. i did some digging to see if i could find any red flags and didn't -----> come !!!  -----> up !!!  -----> with !!!  much. any thoughts or experience with these guys? i've been tempted to participate a few times but my gut instinct is to stay away. might just be paranoid though.", "sortedWord": "None", "Identifyer": null, "identifyer": 86752, "year": "2019"}], "name": "withphotography2019"}