{"interestingcomments": [{"autor": "esit", "date": "2021-06-01 20:46:37", "content": "Is there a resource to browse (canon EF) lens by weight? /!/ Is there a table that'd list all (recent, say released within 20 years) lens for Canon EF mount, by weight?\n\nI am trying to come up with a light weight set up that i can bring on outdoor actives more easily. I currently have 80D and 6D, so i'm interested in seeing both crop and full frame lens. \n\nSearching individual ones are kinda exhausting, so i wonder if there's a table that list them all, that also includes sigma, tamron, samyang, and whatever brands as long as it's EF mount. Thanks!", "link": "https://www.reddit.com/r/photography/comments/nq45wj/is_there_a_resource_to_browse_canon_ef_lens_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "is there a resource to browse (canon ef) lens by weight? /!/ is there a table that'd list all (recent, say released within 20 years) lens for canon ef mount, by weight?\n\ni am trying to -----> come !!!  -----> up !!!  -----> with !!!  a light weight set -----> up !!!  that i can bring on outdoor actives more easily. i currently have 80d and 6d, so i'm interested in seeing both crop and full frame lens. \n\nsearching individual ones are kinda exhausting, so i wonder if there's a table that list them all, that also includes sigma, tamron, samyang, and whatever brands as long as it's ef mount. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 97322, "year": "2021"}, {"autor": "Bad_Neighbor2", "date": "2021-10-31 13:27:28", "content": "Photography in the off-season: What can I take pictures of during nasty winter months? /!/ I don't know where you live, but here in the American south-east it's starting to get miserable outside. From November through March it will be cold and wet, and daylight savings time ends so it will be dark when going to and getting off work. In Tennessee we do get some snow. You who live in northern states are probably used to it and love the cold, but we southerners shut down and stay inside. I'm bummed. I'm relatively new to photography and mostly shoot landscapes, waterfalls, hiking trails and wildlife but am open to more variety in my portfolio. I know some of you would say to photograph these things in winter, but where I live, winter doesn't look appealing as it would in say Canada. It's an ugly, slushy winter. Winter here is nothing anyone wants to see a picture of. Congratulations to all of you in Australia!\n\nWhat can I photograph indoors this winter? I considered food in restaurants but I'm not a food blogger or anything. Maybe a museum or something idk I'm having a hard time coming up with ideas. What are some niches that are created indoors? What do you like to photograph when it's nasty outside? I'd love to know your experiences!", "link": "https://www.reddit.com/r/photography/comments/qjphms/photography_in_the_offseason_what_can_i_take/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "photography in the off-season: what can i take pictures of during nasty winter months? /!/ i don't know where you live, but here in the american south-east it's starting to get miserable outside. from november through march it will be cold and wet, and daylight savings time ends so it will be dark when going to and getting off work. in tennessee we do get some snow. you who live in northern states are probably used to it and love the cold, but we southerners shut down and stay inside. i'm bummed. i'm relatively new to photography and mostly shoot landscapes, waterfalls, hiking trails and wildlife but am open to more variety in my portfolio. i know some of you would say to photograph these things in winter, but where i live, winter doesn't look appealing as it would in say canada. it's an ugly, slushy winter. winter here is nothing anyone wants to see a picture of. congratulations to all of you in australia!\n\nwhat can i photograph indoors this winter? i considered food in restaurants but i'm not a food blogger or anything. maybe a museum or something idk i'm having a hard time -----> coming !!!  -----> up !!!  -----> with !!!  ideas. what are some niches that are created indoors? what do you like to photograph when it's nasty outside? i'd love to know your experiences!", "sortedWord": "None", "Identifyer": null, "identifyer": 97836, "year": "2021"}, {"autor": "farmerjuls", "date": "2021-10-30 18:27:37", "content": "how do i fix this? /!/ So uh i have a canon 4000d and i took it out to take some pictures with me and cattle i had to for college anyway it started to piss down rain as it always does when u go out to do something and the camera got wet and the lens but the lens is fine its the top mirror in the camera thats all misty and comes up with an error when the lens is on when u take a picture \n\nHow or what would i do to fix this?", "link": "https://www.reddit.com/r/photography/comments/qj7fxh/how_do_i_fix_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "how do i fix this? /!/ so uh i have a canon 4000d and i took it out to take some pictures with me and cattle i had to for college anyway it started to piss down rain as it always does when u go out to do something and the camera got wet and the lens but the lens is fine its the top mirror in the camera thats all misty and -----> comes !!!  -----> up !!!  -----> with !!!  an error when the lens is on when u take a picture \n\nhow or what would i do to fix this?", "sortedWord": "None", "Identifyer": null, "identifyer": 97884, "year": "2021"}, {"autor": "gordovondoom", "date": "2021-02-13 04:21:54", "content": "starting photography again /!/ i used to do photography a lot, but i quit when my camera broke... that was a few years ago...\nnow thanks to circumstances (thx corona), i got a lot of time and i am somehow in a pretty creative bubble right now (design and music), that should usually stay that way if i continue being creative...\n\nso i thought about taking photography up again, but what i wonder about: where do i publish/upload them? i am by no means a professional, though i also wasnt that bad at it and i would just like to publish them somewhere and see what happens...\n\nwhat are the options here at the moment? still insta, imgur, blogging (which i dont want to do, pictures only is fine, but no text)? thats at least the only thing google is coming up with... \n\nthx in advanve", "link": "https://www.reddit.com/r/photography/comments/lit1mw/starting_photography_again/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "starting photography again /!/ i used to do photography a lot, but i quit when my camera broke... that was a few years ago...\nnow thanks to circumstances (thx corona), i got a lot of time and i am somehow in a pretty creative bubble right now (design and music), that should usually stay that way if i continue being creative...\n\nso i thought about taking photography up again, but what i wonder about: where do i publish/upload them? i am by no means a professional, though i also wasnt that bad at it and i would just like to publish them somewhere and see what happens...\n\nwhat are the options here at the moment? still insta, imgur, blogging (which i dont want to do, pictures only is fine, but no text)? thats at least the only thing google is -----> coming !!!  -----> up !!!  -----> with !!! ... \n\nthx in advanve", "sortedWord": "None", "Identifyer": null, "identifyer": 98146, "year": "2021"}, {"autor": "userunknown26", "date": "2021-05-30 13:07:44", "content": "Having Adobe Lightroom Classic issues with color import.... /!/ Please refer me to the best board if this isn't it. As an FYI, I have the most downloaded and current version of LrC, I have a canon R, and shoot with EF lenses. I have also calibrated my mac several times and have my photos imported to JPG from raw with sRGB settings (on import page). \n\nBut my lightroom is importing my photos and almost coming up with a more yellow/green hue on my other computers and iPhone when I go to open. It's like my MAC is not calibrated correctly because my mac is showing them just fine and exactly how they're edited in lightroom.. Anyone else have this issue and can help troubleshoot? I've tried everything on the internet that I've found helpful.", "link": "https://www.reddit.com/r/photography/comments/noaum6/having_adobe_lightroom_classic_issues_with_color/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "having adobe lightroom classic issues with color import.... /!/ please refer me to the best board if this isn't it. as an fyi, i have the most downloaded and current version of lrc, i have a canon r, and shoot with ef lenses. i have also calibrated my mac several times and have my photos imported to jpg from raw with srgb settings (on import page). \n\nbut my lightroom is importing my photos and almost -----> coming !!!  -----> up !!!  -----> with !!!  a more yellow/green hue on my other computers and iphone when i go to open. it's like my mac is not calibrated correctly because my mac is showing them just fine and exactly how they're edited in lightroom.. anyone else have this issue and can help troubleshoot? i've tried everything on the internet that i've found helpful.", "sortedWord": "None", "Identifyer": null, "identifyer": 98907, "year": "2021"}, {"autor": "GhostofHacker", "date": "2021-07-15 17:54:46", "content": "Couldn't decide between cameras /!/ Hi, I am a complete beginner in photography and thought this subreddit is the right place to write on.\n\nLast summer I had this urge to buy a camera and decided to buy a film camera but I couldn't agree with the guy who was selling it and then I didn't buy it.\n\nThis summer I saved money, did some search on cameras, and came up with a few options. However, I couldn't pick one.\n\nNikon D5300 | Sony A6000 | Canon EOS M50\n\nMy main concerns are D5300 and A6000 are old cameras and I don't know if they will perform well for the next few years. Another one is that is M50 a vlogger camera? I'm not sure if it is or not but my purpose is to shoot photos. \n\nI don't know what type of photography I will do. I won't proceed with it as a career it is rather will be a hobby. I guess I'll be using the camera for landscape, street photography, macro photography, and low light situations.\n\nI am really not sure which one to pick. It would be great to hear some advice.", "link": "https://www.reddit.com/r/photography/comments/oky4bu/couldnt_decide_between_cameras/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "couldn't decide between cameras /!/ hi, i am a complete beginner in photography and thought this subreddit is the right place to write on.\n\nlast summer i had this urge to buy a camera and decided to buy a film camera but i couldn't agree with the guy who was selling it and then i didn't buy it.\n\nthis summer i saved money, did some search on cameras, and -----> came !!!  -----> up !!!  -----> with !!!  a few options. however, i couldn't pick one.\n\nnikon d5300 | sony a6000 | canon eos m50\n\nmy main concerns are d5300 and a6000 are old cameras and i don't know if they will perform well for the next few years. another one is that is m50 a vlogger camera? i'm not sure if it is or not but my purpose is to shoot photos. \n\ni don't know what type of photography i will do. i won't proceed with it as a career it is rather will be a hobby. i guess i'll be using the camera for landscape, street photography, macro photography, and low light situations.\n\ni am really not sure which one to pick. it would be great to hear some advice.", "sortedWord": "None", "Identifyer": null, "identifyer": 99200, "year": "2021"}, {"autor": "heavymetaqueen", "date": "2021-10-29 23:37:28", "content": "How to price prints on handmade paper? /!/ I’m a hobbyist film photographer &amp; recently started experimenting with making my own handmade paper &amp; printing some of my pictures on them. A handful of people have reached out to me about buying prints which I didn’t expect at all! A padded envelope from USPS is $9.30 to ship, I’m just not sure how to factor in everything else to come up with a price.", "link": "https://www.reddit.com/r/photography/comments/qip7ra/how_to_price_prints_on_handmade_paper/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to price prints on handmade paper? /!/ i’m a hobbyist film photographer &amp; recently started experimenting with making my own handmade paper &amp; printing some of my pictures on them. a handful of people have reached out to me about buying prints which i didn’t expect at all! a padded envelope from usps is $9.30 to ship, i’m just not sure how to factor in everything else to -----> come !!!  -----> up !!!  -----> with !!!  a price.", "sortedWord": "None", "Identifyer": null, "identifyer": 99844, "year": "2021"}, {"autor": "Bruno_Alyami", "date": "2021-07-07 22:34:02", "content": "I'm a dark photographer and I came up with the CCOLEST Instagram username... @darknessence :) :) /!/ &amp;#x200B;\n\nhttps://preview.redd.it/2qagnenzav971.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=b3f89d006068494c94a7f7a51ab2f9a84055e8c5", "link": "https://www.reddit.com/r/photography/comments/oftths/im_a_dark_photographer_and_i_came_up_with_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i'm a dark photographer and i -----> came !!!  -----> up !!!  -----> with !!!  the ccolest instagram username... @darknessence :) :) /!/ &amp;#x200b;\n\nhttps://preview.redd.it/2qagnenzav971.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=b3f89d006068494c94a7f7a51ab2f9a84055e8c5", "sortedWord": "None", "Identifyer": null, "identifyer": 2145, "year": "2021"}, {"autor": "Tubo_Mengmeng", "date": "2021-08-22 21:28:23", "content": "2 q's: Pointers to guides or advice on 'streetscape' / 'townscape' photography + photog recc's for inspiration /!/ **TL:DR** \\- actually the title fits as this, feel free to skip the ramble below (links posted for e.g.s for what I'm looking for though)\n\nHi, I have just bought a camera and am looking to get back into taking pictures after flirting with it for a bit around 10 years ago. \n\nMy main interest and what I'm motivated to try and captured as my subject is the city and, for want of a better phrase, urban landscapes (which sounds kinda clunky to me tbh)\n\nI've tried searching online for tips/guides/advice etc about how to shoot the way I want to shoot but all I ever get back with for results are for 'street photography' proper - which is not what I'm interested in, assuming (and it seeming) that that is associated with on the fly captures of 'people within their environment' (i.e. the street).\n\nOr searching other terms I come up with pages on tips pages about architecture and buildings either in the main as \\*the\\* subject or their details abstracted or skylines and cityscapes etc.\n\nAll good but I'm not interested in any of that, what I'm interested in are landscapes of sorts, what I think best is described as streetscapes or townscapes, photos of \\*places\\* which feature people in them (note the switch in order of where 'people' and 'place' / 'environment' are mentioned compared to my description of what I understand street photography to be). \n\nIdk if this is sounding pretentious but I want to try a capture a deep sense of 'place,' (again, for want of a better phrase) - there's a certain aesthetic/style of the kinds of shots that I'm thinking of that resonates and draws me in - where the places captured have a sense of mystery and sometimes loneliness, but also capturing something that stirs the imagination about all the activity and strand's of drama and little stories of individual's lives that buildings and spaces in a city's or town's streetscape and townscape hosts - how 'places are a frame to individual's lives' kinda thing\n\nSo first off, I am asking if anyone has any guides or sites or resources or technical tips etc. that could help me understand what to do to try and capture what I'm after (or themselves able to post any tips). I'd be very grateful for any given my fruitless search to date (inc. searching on this sub which didn't pull up anything of relevance)\n\nSecond, I don't know so much about photography (have been reading about the technical side re: exposure etc. last couple of weeks) nor photographers so am completely out the loop re: them and am wondering if anyone can recommend any who might fit what I describe above for inspiration\n\nI've checked out a few that were recommended in generic 'recommend me photographers to check out' threads here and one who has a few shots of the kind of atmosphere that's similar to what I'd like to try and capture are these from Stephen Shore:\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=5&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=5&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=8&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=8&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=10&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=10&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=13&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=13&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=14&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=14&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=20&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=20&amp;menu=photographs)\n\n(I know they're not all urban landscapes but the tone/atmosphere is still pretty bang on with the sense of place, the mystery and the little people within (or indeed their absence from) some of them).\n\nIf any of the photographer recommendations shoot or have work done in 35mm film even better, as that's what I'll be shooting. \n\nThe following are a few shots that I have as a reference that capture what I'm looking to go for somewhat - shot 10 years ago on my digital compact (coming across these pictures after years forgetting about them is what sparked the desire to try it again) but they're a handful out of the 100s of shots I took during that time so I ask for tips/advice to try and improve consistency given I won't be able to be so trigger happy on film as on digital:\n\n[https://www.flickr.com/photos/193529133@N05/51337671446/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@N05/51337671446/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@N05/51336942837/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@N05/51336942837/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@N05/51336942907/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@N05/51336942907/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@N05/51337670941/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@N05/51337670941/in/album-72157719605874547/)\n\nAppreciate this is a v long post so if you've made it this far thank you for sticking with it and would be v grateful for any input!", "link": "https://www.reddit.com/r/photography/comments/p9ldqv/2_qs_pointers_to_guides_or_advice_on_streetscape/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "2 q's: pointers to guides or advice on 'streetscape' / 'townscape' photography + photog recc's for inspiration /!/ **tl:dr** \\- actually the title fits as this, feel free to skip the ramble below (links posted for e.g.s for what i'm looking for though)\n\nhi, i have just bought a camera and am looking to get back into taking pictures after flirting with it for a bit around 10 years ago. \n\nmy main interest and what i'm motivated to try and captured as my subject is the city and, for want of a better phrase, urban landscapes (which sounds kinda clunky to me tbh)\n\ni've tried searching online for tips/guides/advice etc about how to shoot the way i want to shoot but all i ever get back with for results are for 'street photography' proper - which is not what i'm interested in, assuming (and it seeming) that that is associated with on the fly captures of 'people within their environment' (i.e. the street).\n\nor searching other terms i -----> come !!!  -----> up !!!  -----> with !!!  pages on tips pages about architecture and buildings either in the main as \\*the\\* subject or their details abstracted or skylines and cityscapes etc.\n\nall good but i'm not interested in any of that, what i'm interested in are landscapes of sorts, what i think best is described as streetscapes or townscapes, photos of \\*places\\* which feature people in them (note the switch in order of where 'people' and 'place' / 'environment' are mentioned compared to my description of what i understand street photography to be). \n\nidk if this is sounding pretentious but i want to try a capture a deep sense of 'place,' (again, for want of a better phrase) - there's a certain aesthetic/style of the kinds of shots that i'm thinking of that resonates and draws me in - where the places captured have a sense of mystery and sometimes loneliness, but also capturing something that stirs the imagination about all the activity and strand's of drama and little stories of individual's lives that buildings and spaces in a city's or town's streetscape and townscape hosts - how 'places are a frame to individual's lives' kinda thing\n\nso first off, i am asking if anyone has any guides or sites or resources or technical tips etc. that could help me understand what to do to try and capture what i'm after (or themselves able to post any tips). i'd be very grateful for any given my fruitless search to date (inc. searching on this sub which didn't pull up anything of relevance)\n\nsecond, i don't know so much about photography (have been reading about the technical side re: exposure etc. last couple of weeks) nor photographers so am completely out the loop re: them and am wondering if anyone can recommend any who might fit what i describe above for inspiration\n\ni've checked out a few that were recommended in generic 'recommend me photographers to check out' threads here and one who has a few shots of the kind of atmosphere that's similar to what i'd like to try and capture are these from stephen shore:\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=5&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=5&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=8&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=8&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=10&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=10&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=13&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=13&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=14&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=14&amp;menu=photographs)\n\n[http://stephenshore.net/photographs/uncommon/index.php?page=20&amp;menu=photographs](http://stephenshore.net/photographs/uncommon/index.php?page=20&amp;menu=photographs)\n\n(i know they're not all urban landscapes but the tone/atmosphere is still pretty bang on with the sense of place, the mystery and the little people within (or indeed their absence from) some of them).\n\nif any of the photographer recommendations shoot or have work done in 35mm film even better, as that's what i'll be shooting. \n\nthe following are a few shots that i have as a reference that capture what i'm looking to go for somewhat - shot 10 years ago on my digital compact (coming across these pictures after years forgetting about them is what sparked the desire to try it again) but they're a handful out of the 100s of shots i took during that time so i ask for tips/advice to try and improve consistency given i won't be able to be so trigger happy on film as on digital:\n\n[https://www.flickr.com/photos/193529133@n05/51337671446/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@n05/51337671446/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@n05/51336942837/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@n05/51336942837/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@n05/51336942907/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@n05/51336942907/in/album-72157719605874547/)\n\n[https://www.flickr.com/photos/193529133@n05/51337670941/in/album-72157719605874547/](https://www.flickr.com/photos/193529133@n05/51337670941/in/album-72157719605874547/)\n\nappreciate this is a v long post so if you've made it this far thank you for sticking with it and would be v grateful for any input!", "sortedWord": "None", "Identifyer": null, "identifyer": 3565, "year": "2021"}, {"autor": "jcook54", "date": "2021-10-28 17:50:16", "content": "Camera while backpacking? /!/ I am the proud Father of a budding young photographer.  She's had basic lessons and 2 years of photography class at her School.  I'm trying to support this interest and recently asked Her what 'luxury' camera related item She would like for Christmas.  Her reply was \"A camera bag that I could use while backpacking.\"  Well, since she carries a backpack when we are backpacking, this eliminates a camera backpack from the running (I think?).  I am not a photographer but the best solutions I've been able to come up with via online research is a camera clip or possible a small camera sling.  \n\nAm I looking at the right item?  Is there something that I'm overlooking?  Do any of you have a tried and true solution for taking a DSLR camera with you when you're backpacking?  Right now she keeps Her camera in her regular bag that she then places inside the backpack and it makes taking pictures a bit of a chore when we're on the trail", "link": "https://www.reddit.com/r/photography/comments/qhsi9p/camera_while_backpacking/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "camera while backpacking? /!/ i am the proud father of a budding young photographer.  she's had basic lessons and 2 years of photography class at her school.  i'm trying to support this interest and recently asked her what 'luxury' camera related item she would like for christmas.  her reply was \"a camera bag that i could use while backpacking.\"  well, since she carries a backpack when we are backpacking, this eliminates a camera backpack from the running (i think?).  i am not a photographer but the best solutions i've been able to -----> come !!!  -----> up !!!  -----> with !!!  via online research is a camera clip or possible a small camera sling.  \n\nam i looking at the right item?  is there something that i'm overlooking?  do any of you have a tried and true solution for taking a dslr camera with you when you're backpacking?  right now she keeps her camera in her regular bag that she then places inside the backpack and it makes taking pictures a bit of a chore when we're on the trail", "sortedWord": "None", "Identifyer": null, "identifyer": 3774, "year": "2021"}, {"autor": "mmmoctopie", "date": "2021-10-28 03:02:34", "content": "I'm a lazy photographer. Is there a way to automate posting to blogs, stock sites, instagram from an archive? Or outsource? /!/ I like taking photos, but hate the admin. I think there's some good stuff in my archive but I just can't be bothered investing time to post it. Coming up with taglines, hashtags, ugh. The worst.\n\nHas anyone developed like an auto posting tool yet!? Or how about outsourcing it to someone? Any experience there?", "link": "https://www.reddit.com/r/photography/comments/qhdfme/im_a_lazy_photographer_is_there_a_way_to_automate/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "i'm a lazy photographer. is there a way to automate posting to blogs, stock sites, instagram from an archive? or outsource? /!/ i like taking photos, but hate the admin. i think there's some good stuff in my archive but i just can't be bothered investing time to post it. -----> coming !!!  -----> up !!!  -----> with !!!  taglines, hashtags, ugh. the worst.\n\nhas anyone developed like an auto posting tool yet!? or how about outsourcing it to someone? any experience there?", "sortedWord": "None", "Identifyer": null, "identifyer": 3831, "year": "2021"}, {"autor": "No-Assignment9510", "date": "2021-01-03 16:54:25", "content": "Something new for photographers and videographers /!/ I am also a photographer I have seen my friends enrolling in so many agencies, and lastly they came across Snappr. They all have the same complaints which is the money that they get paid doesn't equals the time that they put in to shoot. One thing that these platforms or agencies don't understand is that  photography is an art, you cannot tell Pablo Picasso that you have $59 for his work that would be an insult. Well to cut a long story short, I came up with the platform that will benefit both, clients and pros. Please take a look and let me know what you think.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n![video](ftu1vldzc5961 \"SeempleShot.com\")", "link": "https://www.reddit.com/r/photography/comments/kpnysl/something_new_for_photographers_and_videographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "something new for photographers and videographers /!/ i am also a photographer i have seen my friends enrolling in so many agencies, and lastly they came across snappr. they all have the same complaints which is the money that they get paid doesn't equals the time that they put in to shoot. one thing that these platforms or agencies don't understand is that  photography is an art, you cannot tell pablo picasso that you have $59 for his work that would be an insult. well to cut a long story short, i -----> came !!!  -----> up !!!  -----> with !!!  the platform that will benefit both, clients and pros. please take a look and let me know what you think.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n![video](ftu1vldzc5961 \"seempleshot.com\")", "sortedWord": "None", "Identifyer": null, "identifyer": 3967, "year": "2021"}, {"autor": "TWEEDELBUM", "date": "2021-01-27 20:38:06", "content": "Do you feel about photography the same way? /!/ Everytime I do photography and I come up with a new idea or observe something I always get so elated that I feel guilty to be that elated it feels illegal. Do you ever experience something similar?", "link": "https://www.reddit.com/r/photography/comments/l6dtxk/do_you_feel_about_photography_the_same_way/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "do you feel about photography the same way? /!/ everytime i do photography and i -----> come !!!  -----> up !!!  -----> with !!!  a new idea or observe something i always get so elated that i feel guilty to be that elated it feels illegal. do you ever experience something similar?", "sortedWord": "None", "Identifyer": null, "identifyer": 4761, "year": "2021"}, {"autor": "Dooby1409", "date": "2021-04-19 06:25:58", "content": "Fair Estimate? /!/ Hello everyone! I’m sorry if this is not the appropriate sub to ask this in but I was wondering if I could get some insight from other photographers. My girlfriend is going to be finishing her Master’s in a few weeks now and has been inquiring about the cost for a quick 30 minute—1 hour photo shoot. One of our friends has taken up photography the past year and quoted her $300. I’d like to support a friend but can’t help but feel like it might not be a totally fair price? He said that’s the “friend’s” price and that he only requires her to choose the location as well as come up with her own poses, as well as require us to cover his transportation. So my question is, does the price sound fair or average to what others may charge? Trying to gauge if we’d be overpaying or if it’s a good deal. Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/mtun1h/fair_estimate/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "fair estimate? /!/ hello everyone! i’m sorry if this is not the appropriate sub to ask this in but i was wondering if i could get some insight from other photographers. my girlfriend is going to be finishing her master’s in a few weeks now and has been inquiring about the cost for a quick 30 minute—1 hour photo shoot. one of our friends has taken up photography the past year and quoted her $300. i’d like to support a friend but can’t help but feel like it might not be a totally fair price? he said that’s the “friend’s” price and that he only requires her to choose the location as well as -----> come !!!  -----> up !!!  -----> with !!!  her own poses, as well as require us to cover his transportation. so my question is, does the price sound fair or average to what others may charge? trying to gauge if we’d be overpaying or if it’s a good deal. thanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 6105, "year": "2021"}, {"autor": "[deleted]", "date": "2021-06-03 20:04:46", "content": "If a person has left photography for 6 months and want to start over and could not come up with ideas how to start again?", "link": "https://www.reddit.com/r/photography/comments/nrml39/if_a_person_has_left_photography_for_6_months_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "if a person has left photography for 6 months and want to start over and could not -----> come !!!  -----> up !!!  -----> with !!!  ideas how to start again?", "sortedWord": "None", "Identifyer": null, "identifyer": 7173, "year": "2021"}, {"autor": "anysky", "date": "2021-05-28 16:40:43", "content": "After a lot of planning I finally came up with a backup process I like /!/ Just wanted to share this with you since it might be interesting for someone else. \n\nI always kinda sucked at backing up my pictures and even lost a few at some point because of a stupid user error. So I sat down and compared a lot of options and came up with this process: \n\n&amp;#x200B;\n\n1. Have all my pictures in one main folder structure\n2. Use Carbon copy cloner to mirror this folder onto another hard drive (it also helps with accidentally deleting pictures) \n3. Use Duplicacy to back up the original folder to the cloud (Arq is a good alterative)\n\n&amp;#x200B;\n\nLet me know what you think and where you see room for improvement.\n\nI also made a [video](https://youtu.be/Ba37qBBepPY) about this a while ago no one was ever interested in:) - you can check it out if you want and see the process in action", "link": "https://www.reddit.com/r/photography/comments/nn1vzi/after_a_lot_of_planning_i_finally_came_up_with_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "after a lot of planning i finally -----> came !!!  -----> up !!!  -----> with !!!  a backup process i like /!/ just wanted to share this -----> with !!!  you since it might be interesting for someone else. \n\ni always kinda sucked at backing up my pictures and even lost a few at some point because of a stupid user error. so i sat down and compared a lot of options and came up with this process: \n\n&amp;#x200b;\n\n1. have all my pictures in one main folder structure\n2. use carbon copy cloner to mirror this folder onto another hard drive (it also helps with accidentally deleting pictures) \n3. use duplicacy to back up the original folder to the cloud (arq is a good alterative)\n\n&amp;#x200b;\n\nlet me know what you think and where you see room for improvement.\n\ni also made a [video](https://youtu.be/ba37qbbeppy) about this a while ago no one was ever interested in:) - you can check it out if you want and see the process in action", "sortedWord": "None", "Identifyer": null, "identifyer": 7235, "year": "2021"}, {"autor": "EyJungee", "date": "2021-06-10 10:47:14", "content": "A few questions i hope you could answer for my University project /!/ So, i have a few questions i hoped to get some answers for. This is for a University project about UI design and we have to come up with an app idea and design. You of course don't have to answer all the questions. But a few answers to every questions would be fantastic!\n\n&amp;#x200B;\n\n1. What photography apps do you currently use and why?\n2. Is photography your hobby or job?\n3. Are you connected with other photographers?\n4. What app functions would be the most important to you?\n5. Would you share / recommend your favorite spots with other photographers?\n\n&amp;#x200B;\n\nThanks for reading and/or answering a question of two.   \nHave a nice day!", "link": "https://www.reddit.com/r/photography/comments/nwkjks/a_few_questions_i_hope_you_could_answer_for_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "a few questions i hope you could answer for my university project /!/ so, i have a few questions i hoped to get some answers for. this is for a university project about ui design and we have to -----> come !!!  -----> up !!!  -----> with !!!  an app idea and design. you of course don't have to answer all the questions. but a few answers to every questions would be fantastic!\n\n&amp;#x200b;\n\n1. what photography apps do you currently use and why?\n2. is photography your hobby or job?\n3. are you connected with other photographers?\n4. what app functions would be the most important to you?\n5. would you share / recommend your favorite spots with other photographers?\n\n&amp;#x200b;\n\nthanks for reading and/or answering a question of two.   \nhave a nice day!", "sortedWord": "None", "Identifyer": null, "identifyer": 7382, "year": "2021"}, {"autor": "hopeoverture88", "date": "2021-06-28 09:23:13", "content": "Getting more clients /!/ I’m sure this is a problem for any photographer who is just starting a business: figuring out how to get more clients (or any). I have been trying to think of how to get my business out there in a way that makes people want to try out a photo session with me. I have been taking photos for a while now but I just started my actual business. At the risk of sounding full of myself, I feel like my knowledge of photography and editing is fairly up to par, if not better than most photographers starting out in my area. I’ve been trying to think how to advertise to get paid clients. One of the things I’ve come up with is doing “risk-free” sessions. This is when I offer x amount of digital photographs for free, and the client can decide if they want to pay for the rest (and get access to them). Is this a good idea? If so, what should “x” be? Should I just be doing free sessions instead? I don’t have a lot of photographs in my portfolio, at least not of clients (they are of my family and friends). I’m struggling to find the line between getting a business started and getting taken advantage of. Everyone always says your time is worth money, but my instinct still tells me that I need to sacrifice more of it in order to get more clients.", "link": "https://www.reddit.com/r/photography/comments/o9gown/getting_more_clients/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "getting more clients /!/ i’m sure this is a problem for any photographer who is just starting a business: figuring out how to get more clients (or any). i have been trying to think of how to get my business out there in a way that makes people want to try out a photo session with me. i have been taking photos for a while now but i just started my actual business. at the risk of sounding full of myself, i feel like my knowledge of photography and editing is fairly up to par, if not better than most photographers starting out in my area. i’ve been trying to think how to advertise to get paid clients. one of the things i’ve -----> come !!!  -----> up !!!  -----> with !!!  is doing “risk-free” sessions. this is when i offer x amount of digital photographs for free, and the client can decide if they want to pay for the rest (and get access to them). is this a good idea? if so, what should “x” be? should i just be doing free sessions instead? i don’t have a lot of photographs in my portfolio, at least not of clients (they are of my family and friends). i’m struggling to find the line between getting a business started and getting taken advantage of. everyone always says your time is worth money, but my instinct still tells me that i need to sacrifice more of it in order to get more clients.", "sortedWord": "None", "Identifyer": null, "identifyer": 8113, "year": "2021"}, {"autor": "cheloniac", "date": "2021-06-28 01:14:56", "content": "concert photography contract advice for accidental damage /!/ I'm looking for assistance in coming up with a proper live music photography contract. I'm specifically wanting protection in my contract for venues that do *not* have a photo pit. I want verbiage in my contract that will protect me against accidental equipment damage from crowds (mosh pits), etc. Any advice would be helpful! Thank you!", "link": "https://www.reddit.com/r/photography/comments/o99xdj/concert_photography_contract_advice_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "concert photography contract advice for accidental damage /!/ i'm looking for assistance in -----> coming !!!  -----> up !!!  -----> with !!!  a proper live music photography contract. i'm specifically wanting protection in my contract for venues that do *not* have a photo pit. i want verbiage in my contract that will protect me against accidental equipment damage from crowds (mosh pits), etc. any advice would be helpful! thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 8141, "year": "2021"}, {"autor": "Zorb-in-a-Zorb", "date": "2021-07-28 11:55:25", "content": "I am in a bit of a predicament /!/ I’m in high school, and photography is my favourite subject. This year I chose a difficult topic for my portfolio, I chose the topic of misinformation, such as misinformation in the media. Now as much as I love photography, I am not a great artist as I have Aspergers, and creativity is not my strongpoint. Currently I am struggling to come up with any ideas for photos to take surrounding the idea of misinformation and if I’m being honest I’m getting a bit desperate. Any help would be appreciated, cheers!", "link": "https://www.reddit.com/r/photography/comments/ot8dy2/i_am_in_a_bit_of_a_predicament/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i am in a bit of a predicament /!/ i’m in high school, and photography is my favourite subject. this year i chose a difficult topic for my portfolio, i chose the topic of misinformation, such as misinformation in the media. now as much as i love photography, i am not a great artist as i have aspergers, and creativity is not my strongpoint. currently i am struggling to -----> come !!!  -----> up !!!  -----> with !!!  any ideas for photos to take surrounding the idea of misinformation and if i’m being honest i’m getting a bit desperate. any help would be appreciated, cheers!", "sortedWord": "None", "Identifyer": null, "identifyer": 8827, "year": "2021"}, {"autor": "SexualizedZucchini", "date": "2021-09-05 00:18:30", "content": "What are your favorite manual focus lenses? /!/ [Figured this warranted a discussion post because it's not specifically a gear request]\n\nSo I finally got a mirrorless camera and have been opening up to the world of manual focus rangefinder lenses. I've been messing around with a Wollensak enlarger lens converted to tilt-shift by mounting it to a sock, a 7artisans 28mm, and some really shitty old screw-mount lenses. Been looking at getting a Helios 44 and something with a square aperture. I've also been thinking about trying out some old anamorphic projector lenses. \n\nSo what are some interesting or obscure old lenses you all have come up with?", "link": "https://www.reddit.com/r/photography/comments/pi2suc/what_are_your_favorite_manual_focus_lenses/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what are your favorite manual focus lenses? /!/ [figured this warranted a discussion post because it's not specifically a gear request]\n\nso i finally got a mirrorless camera and have been opening up to the world of manual focus rangefinder lenses. i've been messing around with a wollensak enlarger lens converted to tilt-shift by mounting it to a sock, a 7artisans 28mm, and some really shitty old screw-mount lenses. been looking at getting a helios 44 and something with a square aperture. i've also been thinking about trying out some old anamorphic projector lenses. \n\nso what are some interesting or obscure old lenses you all have -----> come !!!  -----> up !!!  -----> with !!! ?", "sortedWord": "None", "Identifyer": null, "identifyer": 9493, "year": "2021"}, {"autor": "Reagan_stevenso890", "date": "2021-09-12 23:38:08", "content": "hey guys I need an essential question for my ap photography portfolio and I wanna shoot pictures like this I need help coming up with an essential question", "link": "https://www.reddit.com/r/photography/comments/pn3snl/hey_guys_i_need_an_essential_question_for_my_ap/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "hey guys i need an essential question for my ap photography portfolio and i wanna shoot pictures like this i need help -----> coming !!!  -----> up !!!  -----> with !!!  an essential question", "sortedWord": "None", "Identifyer": null, "identifyer": 9629, "year": "2021"}, {"autor": "Reagan_stevenso890", "date": "2021-09-12 23:28:25", "content": "hey guys I need an essential question for my ap photography portfolio and I wanna shoot pictures like this I need help coming up with an essential question", "link": "https://www.reddit.com/r/photography/comments/pn3myj/hey_guys_i_need_an_essential_question_for_my_ap/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "hey guys i need an essential question for my ap photography portfolio and i wanna shoot pictures like this i need help -----> coming !!!  -----> up !!!  -----> with !!!  an essential question", "sortedWord": "None", "Identifyer": null, "identifyer": 9632, "year": "2021"}, {"autor": "urspiritualgf", "date": "2021-09-18 00:24:20", "content": "help me come up with different industries that use photography?? /!/ i’m taking photography and im in grade 9. i already have police, medical, commerce, and real estate using photography. i need 6 more. any ideas?", "link": "https://www.reddit.com/r/photography/comments/pqc6go/help_me_come_up_with_different_industries_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "help me -----> come !!!  -----> up !!!  -----> with !!!  different industries that use photography?? /!/ i’m taking photography and im in grade 9. i already have police, medical, commerce, and real estate using photography. i need 6 more. any ideas?", "sortedWord": "None", "Identifyer": null, "identifyer": 9719, "year": "2021"}, {"autor": "winterwarrior33", "date": "2021-08-21 02:50:49", "content": "What does the ISO abbreviation stand for? /!/ I’m 7 years into the film industry and I don’t actually know what ISO stands for in film/photography.\n\nI know what it does and the technology behind it, but I don’t actually know what the abbreviation stands for. Even a Google search didn’t come up with anything other than the government group “International Organization for Standardization”. \n\nDoes it even stand for anything?", "link": "https://www.reddit.com/r/photography/comments/p8jl5x/what_does_the_iso_abbreviation_stand_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what does the iso abbreviation stand for? /!/ i’m 7 years into the film industry and i don’t actually know what iso stands for in film/photography.\n\ni know what it does and the technology behind it, but i don’t actually know what the abbreviation stands for. even a google search didn’t -----> come !!!  -----> up !!!  -----> with !!!  anything other than the government group “international organization for standardization”. \n\ndoes it even stand for anything?", "sortedWord": "None", "Identifyer": null, "identifyer": 10868, "year": "2021"}, {"autor": "limegreenlove", "date": "2021-10-20 16:30:06", "content": "How to Price Website/Social Rights to Use Images /!/ Along with weddings, I photograph events and a lot of fun agriculture/ranch stuff. I recently had an inquiry to the cost for rights to some of my vineyard shepherd photos for use in a rather large California wine company on website and social. I usually let small, local companies use my work for free provided they give me credit. But this wouldn't be that situation since they would be buying use to the photo as they please. I'm having a hard time coming up with a ballpark price per image they want to use. Any ideas?", "link": "https://www.reddit.com/r/photography/comments/qc4ttc/how_to_price_websitesocial_rights_to_use_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "how to price website/social rights to use images /!/ along with weddings, i photograph events and a lot of fun agriculture/ranch stuff. i recently had an inquiry to the cost for rights to some of my vineyard shepherd photos for use in a rather large california wine company on website and social. i usually let small, local companies use my work for free provided they give me credit. but this wouldn't be that situation since they would be buying use to the photo as they please. i'm having a hard time -----> coming !!!  -----> up !!!  -----> with !!!  a ballpark price per image they want to use. any ideas?", "sortedWord": "None", "Identifyer": null, "identifyer": 11248, "year": "2021"}, {"autor": "CharizardShiny", "date": "2021-02-16 11:03:28", "content": "Photography student looking for help with Project /!/ Hello, I'm a photography student at Edinburgh Napier. I'm doing a project this year that involves a written letter and I'm looking for people over the world to help me out. Due to the covid restrictions, I am not able to go out and take photos of people for work so we had to come up with different ideas to make projects. For the project, I'm trying to get to know people of the world and where they live as I'm desperate to see as much of the world as possible. So if you would be interested to be part of this project or generally want more information about it please send me a message and I'm happy to have a chat. Thanks.", "link": "https://www.reddit.com/r/photography/comments/ll1kix/photography_student_looking_for_help_with_project/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "photography student looking for help with project /!/ hello, i'm a photography student at edinburgh napier. i'm doing a project this year that involves a written letter and i'm looking for people over the world to help me out. due to the covid restrictions, i am not able to go out and take photos of people for work so we had to -----> come !!!  -----> up !!!  -----> with !!!  different ideas to make projects. for the project, i'm trying to get to know people of the world and where they live as i'm desperate to see as much of the world as possible. so if you would be interested to be part of this project or generally want more information about it please send me a message and i'm happy to have a chat. thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 12402, "year": "2021"}, {"autor": "Iron_on_reddit", "date": "2021-04-17 11:05:49", "content": "I enjoy doing photography, but I don't feel like an artistic person the slighest bit /!/ I always liked looking at nice photographs, appreciated when a photographer showed something in an unusual way, things like that. When taking photos myself, I was just a point and shoot kinda guy, not paying any attention whatsoever to subject, composition, light, etc.\n\nThis changed about 2 years ago, when I started to follow a few landscape photographers on youtube, and started to try to take photographs (landscape) more intentionally, trying to use what I learned from watching the videos. I never did anything artistic or even creative before in my life really, I was always a technical person.\n\nWhen I hear photographers talk about their photographs, they often mention feelings and vision, and stuff like this, which is very strange for my technical mind. I never have any vision, or feel anything (well, apart from enjoying myself) when I'm taking photos, I feel like my main motivation is that I just want to take nice pictures that look pretty. Boy, that sounds dumb. :D I can't even give a creative title to my photos, I see a lot of folks do that very well, but I can never come up with anything apart from literally descripting the image, so I never do that.\n\nDoes anyone else feel like this? Is it perhaps just a natural thing for a beginner in photography, or do you think some people are like this by nature, while other people are more artistic, in the sense that they feel the need to create, they have a drive to express themselves through their art? Do you think you can create good photos without being the latter type?", "link": "https://www.reddit.com/r/photography/comments/msor7m/i_enjoy_doing_photography_but_i_dont_feel_like_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i enjoy doing photography, but i don't feel like an artistic person the slighest bit /!/ i always liked looking at nice photographs, appreciated when a photographer showed something in an unusual way, things like that. when taking photos myself, i was just a point and shoot kinda guy, not paying any attention whatsoever to subject, composition, light, etc.\n\nthis changed about 2 years ago, when i started to follow a few landscape photographers on youtube, and started to try to take photographs (landscape) more intentionally, trying to use what i learned from watching the videos. i never did anything artistic or even creative before in my life really, i was always a technical person.\n\nwhen i hear photographers talk about their photographs, they often mention feelings and vision, and stuff like this, which is very strange for my technical mind. i never have any vision, or feel anything (well, apart from enjoying myself) when i'm taking photos, i feel like my main motivation is that i just want to take nice pictures that look pretty. boy, that sounds dumb. :d i can't even give a creative title to my photos, i see a lot of folks do that very well, but i can never -----> come !!!  -----> up !!!  -----> with !!!  anything apart from literally descripting the image, so i never do that.\n\ndoes anyone else feel like this? is it perhaps just a natural thing for a beginner in photography, or do you think some people are like this by nature, while other people are more artistic, in the sense that they feel the need to create, they have a drive to express themselves through their art? do you think you can create good photos without being the latter type?", "sortedWord": "None", "Identifyer": null, "identifyer": 13116, "year": "2021"}, {"autor": "Serberuss", "date": "2021-05-12 11:02:01", "content": "Feeling a little bit lost /!/ I debated about writing a post like this for days because I wasn't sure I could articulate my ramblings into an understandable post, but I decided I'd just give it a go. The title is the best I could come up with at the time.\n\nI'm a landscape photographer and I've been doing photography for almost 4 years, and I still love it. I don't travel a huge amount (especially not lately) so I mostly take photographs of my local area and a bit of the coast. They're not grand epic landscapes but nice enough to practice with at least, but quite light dependent.\n\nOver time my style has changed quite rapidly, if you compare each 6 month intervals there's a noticeable difference. When I say style I'm not talking IG filters or the like, although processing obviously plays a bit part in it. But I also mean the sort of subjects I'm drawn to, compositions and lighting etc.\n\nOne main problem I feel like I'm facing right now is what I'd perhaps describe as inspiration overload. I like a lot of different photographers, and I like looking at a lot of different types of phorographs. And many of them all have their own unique look and style. I think you'd perhaps agree that photographers such as Ryan Dyar ([https://www.ryandyar.com/mountains](https://www.ryandyar.com/mountains)) has a different style to Albert Dros ([https://www.albertdros.com/world-landscapes](https://www.albertdros.com/world-landscapes)) who also has a different style to Neil Burnell ([https://www.neilburnell.com/gallery](https://www.neilburnell.com/gallery)). They're all great and to be honest I like them quite equally. I picked these 3 as just examples.\n\nBecause of this I feel like I'm a bit torn as to where I think my own photography is heading or where I want it to go. One moment I feel like I'm drawn to a more bright, colourful and dramatic look and other times I feel a bit more drawn to a kind of dark, moody and more subtle colour pallet. I guess this comes hand in hand with mood and whether I want to represent my own personality, or a world that I want to see. I don't know if this is normal or whether others have experienced something similar but it's where I am right now. In the 4 years I've been doing photography so far I don't think I've nailed a direction and feeling to my own photography, and that's why I feel a bit lost.\n\nI think this is made especially worse as I often find myself comparing my own images to others. Social media obviously doesn't help with this and I know I need to cut down.\n\nAny advice you could give would be great, or if you think it's not worth worrying about that's fine also.", "link": "https://www.reddit.com/r/photography/comments/nalz96/feeling_a_little_bit_lost/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "feeling a little bit lost /!/ i debated about writing a post like this for days because i wasn't sure i could articulate my ramblings into an understandable post, but i decided i'd just give it a go. the title is the best i could -----> come !!!  -----> up !!!  -----> with !!!  at the time.\n\ni'm a landscape photographer and i've been doing photography for almost 4 years, and i still love it. i don't travel a huge amount (especially not lately) so i mostly take photographs of my local area and a bit of the coast. they're not grand epic landscapes but nice enough to practice with at least, but quite light dependent.\n\nover time my style has changed quite rapidly, if you compare each 6 month intervals there's a noticeable difference. when i say style i'm not talking ig filters or the like, although processing obviously plays a bit part in it. but i also mean the sort of subjects i'm drawn to, compositions and lighting etc.\n\none main problem i feel like i'm facing right now is what i'd perhaps describe as inspiration overload. i like a lot of different photographers, and i like looking at a lot of different types of phorographs. and many of them all have their own unique look and style. i think you'd perhaps agree that photographers such as ryan dyar ([https://www.ryandyar.com/mountains](https://www.ryandyar.com/mountains)) has a different style to albert dros ([https://www.albertdros.com/world-landscapes](https://www.albertdros.com/world-landscapes)) who also has a different style to neil burnell ([https://www.neilburnell.com/gallery](https://www.neilburnell.com/gallery)). they're all great and to be honest i like them quite equally. i picked these 3 as just examples.\n\nbecause of this i feel like i'm a bit torn as to where i think my own photography is heading or where i want it to go. one moment i feel like i'm drawn to a more bright, colourful and dramatic look and other times i feel a bit more drawn to a kind of dark, moody and more subtle colour pallet. i guess this comes hand in hand with mood and whether i want to represent my own personality, or a world that i want to see. i don't know if this is normal or whether others have experienced something similar but it's where i am right now. in the 4 years i've been doing photography so far i don't think i've nailed a direction and feeling to my own photography, and that's why i feel a bit lost.\n\ni think this is made especially worse as i often find myself comparing my own images to others. social media obviously doesn't help with this and i know i need to cut down.\n\nany advice you could give would be great, or if you think it's not worth worrying about that's fine also.", "sortedWord": "None", "Identifyer": null, "identifyer": 13812, "year": "2021"}, {"autor": "Pooch76", "date": "2021-06-02 16:19:23", "content": "Pricing a Graduation? /!/ With the few graduations i've shot in the past, the way i charge has never been consistent; I'd like to come up with some standard options. For events like this, both the organization and the attendees have interest in the photos, so pricing can be structured different ways; some tilting the cost more towards the organization, and other towards the attendees. For graduations, some schools will pay extra for parents to all have access to the photos, while others let the parents pay their own way.\n\nSo how do you all approach this — compared to your normal/standard event rate? For context, when hired for some random event, i do have a 'normal' rate i charge and i provide a the organization access to the high-res images with a commercial license.\n\nHere are five options I've come up with:  **(1)** For 2x (double) my normal rate, school pays for themselves AND parents to get access to all the high-res images (parents can buy prints for extra of course)...  **(2)** For 1.5x my rate, school pays for themselves to get high-res, and parents get low/med res copies...  **(3)** school pays my normal rate (which gets them the high-res) but parents get nothing and pay to get downloads or prints...  **(4)** parents again pay their own way, but, knowing i'll be making $$ from them, i give the school a *discount* off my normal rate.... and **(5)** Similar to #4, but i start with some *target* amount i expect to profit. i charge the school nothing up front, and then wait a month for parents to order stuff and reach that amount, and after that month, the school pays the difference!\n\nFor what it's worth,  i have a 'pro' Smugmug acct so i can tweak things in the gallery as needed. Also, there's one school whose graduation I've shot for a few years now, and with them the school never pays me anything — but i end up making a **killing** off parents' orders alone — so much so that i give the school access to the photos as well, at no charge to them.\n\nthanks for your feedback!", "link": "https://www.reddit.com/r/photography/comments/nqplsj/pricing_a_graduation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pricing a graduation? /!/ -----> with !!!  the few graduations i've shot in the past, the way i charge has never been consistent; i'd like to -----> come !!!  -----> up !!!  -----> with !!!  some standard options. for events like this, both the organization and the attendees have interest in the photos, so pricing can be structured different ways; some tilting the cost more towards the organization, and other towards the attendees. for graduations, some schools will pay extra for parents to all have access to the photos, while others let the parents pay their own way.\n\nso how do you all approach this — compared to your normal/standard event rate? for context, when hired for some random event, i do have a 'normal' rate i charge and i provide a the organization access to the high-res images with a commercial license.\n\nhere are five options i've come up with:  **(1)** for 2x (double) my normal rate, school pays for themselves and parents to get access to all the high-res images (parents can buy prints for extra of course)...  **(2)** for 1.5x my rate, school pays for themselves to get high-res, and parents get low/med res copies...  **(3)** school pays my normal rate (which gets them the high-res) but parents get nothing and pay to get downloads or prints...  **(4)** parents again pay their own way, but, knowing i'll be making $$ from them, i give the school a *discount* off my normal rate.... and **(5)** similar to #4, but i start with some *target* amount i expect to profit. i charge the school nothing up front, and then wait a month for parents to order stuff and reach that amount, and after that month, the school pays the difference!\n\nfor what it's worth,  i have a 'pro' smugmug acct so i can tweak things in the gallery as needed. also, there's one school whose graduation i've shot for a few years now, and with them the school never pays me anything — but i end up making a **killing** off parents' orders alone — so much so that i give the school access to the photos as well, at no charge to them.\n\nthanks for your feedback!", "sortedWord": "None", "Identifyer": null, "identifyer": 14097, "year": "2021"}, {"autor": "Pooch76", "date": "2021-06-02 16:17:27", "content": "Pricing help -- Standard rate vs rate for a Graduation (where parents will also want access) /!/ With the few graduations I've shot in the past, the way i charge has never been consistent; I'd like to come up with some standard options. For events like this, both the organization and the attendees have interest in the photos, so pricing can be structured different ways; some tilting the cost more towards the organization, and other towards the attendees. For graduations, some schools will pay extra for parents to all have access to the photos, while others let the parents pay their own way.\n\nSo how do you all approach this — compared to your normal/standard event rate? For context, when hired for some random event, i do have a 'normal' rate i charge and i provide a the organization access to the high-res images with a commercial license.\n\nHere are five options I've come up with:  **(1)** For 2x (double) my normal rate, school pays for themselves AND parents to get access to all the high-res images (parents can buy prints for extra of course)...  **(2)** For 1.5x my rate, school pays for themselves to get high-res, and parents get low/med res copies...  **(3)** school pays my normal rate (which gets them the high-res) but parents get nothing and pay to get downloads or prints...  **(4)** parents again pay their own way, but, knowing i'll be making $$ from them, i give the school a *discount* off my normal rate.... and **(5)** Similar to #4, but i start with some *target* amount i expect to profit. i charge the school nothing up front, and then wait a month for parents to order stuff and reach that amount, and after that month, the school pays the difference!\n\nFor what it's worth,  i have a 'pro' Smugmug acct so i can tweak things in the gallery as needed. Also, there's one school whose graduation I've shot for a few years now, and with them the school never pays me anything — but i end up making a **killing** off parents' orders alone — so much so that i give the school access to the photos as well, at no charge to them.\n\nthanks for your feedback!", "link": "https://www.reddit.com/r/photography/comments/nqpk3y/pricing_help_standard_rate_vs_rate_for_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pricing help -- standard rate vs rate for a graduation (where parents will also want access) /!/ -----> with !!!  the few graduations i've shot in the past, the way i charge has never been consistent; i'd like to -----> come !!!  -----> up !!!  -----> with !!!  some standard options. for events like this, both the organization and the attendees have interest in the photos, so pricing can be structured different ways; some tilting the cost more towards the organization, and other towards the attendees. for graduations, some schools will pay extra for parents to all have access to the photos, while others let the parents pay their own way.\n\nso how do you all approach this — compared to your normal/standard event rate? for context, when hired for some random event, i do have a 'normal' rate i charge and i provide a the organization access to the high-res images with a commercial license.\n\nhere are five options i've come up with:  **(1)** for 2x (double) my normal rate, school pays for themselves and parents to get access to all the high-res images (parents can buy prints for extra of course)...  **(2)** for 1.5x my rate, school pays for themselves to get high-res, and parents get low/med res copies...  **(3)** school pays my normal rate (which gets them the high-res) but parents get nothing and pay to get downloads or prints...  **(4)** parents again pay their own way, but, knowing i'll be making $$ from them, i give the school a *discount* off my normal rate.... and **(5)** similar to #4, but i start with some *target* amount i expect to profit. i charge the school nothing up front, and then wait a month for parents to order stuff and reach that amount, and after that month, the school pays the difference!\n\nfor what it's worth,  i have a 'pro' smugmug acct so i can tweak things in the gallery as needed. also, there's one school whose graduation i've shot for a few years now, and with them the school never pays me anything — but i end up making a **killing** off parents' orders alone — so much so that i give the school access to the photos as well, at no charge to them.\n\nthanks for your feedback!", "sortedWord": "None", "Identifyer": null, "identifyer": 14098, "year": "2021"}, {"autor": "Bruno_Alyami", "date": "2021-07-09 21:41:38", "content": "I'm a dark photographer and I just came up with the COOLEST Instagram username... @darknessence !!! What do you think ?! /!/ Here is a picture of my feed!\n\nhttps://preview.redd.it/llwdccn5b9a71.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=8f24c7f9c56f407d654593a80361ea8ba8d2a41c", "link": "https://www.reddit.com/r/photography/comments/oh5du2/im_a_dark_photographer_and_i_just_came_up_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i'm a dark photographer and i just -----> came !!!  -----> up !!!  -----> with !!!  the coolest instagram username... @darknessence !!! what do you think ?! /!/ here is a picture of my feed!\n\nhttps://preview.redd.it/llwdccn5b9a71.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=8f24c7f9c56f407d654593a80361ea8ba8d2a41c", "sortedWord": "None", "Identifyer": null, "identifyer": 14951, "year": "2021"}, {"autor": "MarsBoundSquircle", "date": "2021-06-20 03:21:21", "content": "Looking to get into aviation photography /!/ I’ve been doing some research the last few weeks on cameras. I’ll be using it for planespotting, with a budget of around $1000 USD. Mirrorless would be nice, so what I’ve come up with as a good option is the Olympus OM-D E-M10 Mark IV paired with an Olympus 75-300mm or Panasonic 100-300mm lens.\n\nDo you guys think this would be a good pick?", "link": "https://www.reddit.com/r/photography/comments/o3wf6y/looking_to_get_into_aviation_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking to get into aviation photography /!/ i’ve been doing some research the last few weeks on cameras. i’ll be using it for planespotting, with a budget of around $1000 usd. mirrorless would be nice, so what i’ve -----> come !!!  -----> up !!!  -----> with !!!  as a good option is the olympus om-d e-m10 mark iv paired -----> with !!!  an olympus 75-300mm or panasonic 100-300mm lens.\n\ndo you guys think this would be a good pick?", "sortedWord": "None", "Identifyer": null, "identifyer": 15295, "year": "2021"}, {"autor": "Jrummps", "date": "2021-07-18 00:15:09", "content": "How to add creativity to an outdoor portrait shoot? /!/ Hi all! This is my first post here -- I hope that asking for advice is okay!\n\n&amp;#x200B;\n\nI've been a portrait photographer (as a hobby) for a year or two now. I've started becoming really proud of my growth and the quality of my photos that have evolved over time. I love my portraits, but they're all just that: ordinary portraits. \n\n&amp;#x200B;\n\nI see so many photographers that come up with really creative concepts for their portrait sessions. I see various themes, ideas, and props that make the portraits stand out from the rest. I want to start growing in that direction, but I'm not sure how or where to start. When trying to brainstorm concepts, my mind always just draws a blank.\n\n&amp;#x200B;\n\nIf anyone has any advice on how to jumpstart that transition/journey, I would love to hear your thoughts! My growth as a photographer is important to me, but I've been feeling stuck in a rut.", "link": "https://www.reddit.com/r/photography/comments/omfvex/how_to_add_creativity_to_an_outdoor_portrait_shoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to add creativity to an outdoor portrait shoot? /!/ hi all! this is my first post here -- i hope that asking for advice is okay!\n\n&amp;#x200b;\n\ni've been a portrait photographer (as a hobby) for a year or two now. i've started becoming really proud of my growth and the quality of my photos that have evolved over time. i love my portraits, but they're all just that: ordinary portraits. \n\n&amp;#x200b;\n\ni see so many photographers that -----> come !!!  -----> up !!!  -----> with !!!  really creative concepts for their portrait sessions. i see various themes, ideas, and props that make the portraits stand out from the rest. i want to start growing in that direction, but i'm not sure how or where to start. when trying to brainstorm concepts, my mind always just draws a blank.\n\n&amp;#x200b;\n\nif anyone has any advice on how to jumpstart that transition/journey, i would love to hear your thoughts! my growth as a photographer is important to me, but i've been feeling stuck in a rut.", "sortedWord": "None", "Identifyer": null, "identifyer": 15436, "year": "2021"}, {"autor": "ballebaj", "date": "2021-08-10 21:48:10", "content": "Found a good (re-) use for my old camera sling bag. Discussion about reusing gear instead of throwing it away /!/ Found a good (re-) use for my old camera sling bag. All the disks fit snuggly and best of all, I can carry all my disks safely when relocating to another country.\n\nhttps://preview.redd.it/8g9c9iynnlg71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=284a21b8da0a8366705fb2fae16778bfa7ac9f8e\n\nI feel like we photographers have a pinch of GAS and generate a lot of trash. From all the plastic that wraps our USB cables and thick manuals that our beloved camera manufacturers give (which we almost always use to increase the height of our tripod just a little), \n\nI wish camera gear manufacturers REDUCE the amount of unnecessary stuff shipped in their product\n\nBut, i'm sure many of you have also come up with interesting ways to REUSE old stuff - I would love to hear your ideas", "link": "https://www.reddit.com/r/photography/comments/p1z4lq/found_a_good_re_use_for_my_old_camera_sling_bag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "found a good (re-) use for my old camera sling bag. discussion about reusing gear instead of throwing it away /!/ found a good (re-) use for my old camera sling bag. all the disks fit snuggly and best of all, i can carry all my disks safely when relocating to another country.\n\nhttps://preview.redd.it/8g9c9iynnlg71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=284a21b8da0a8366705fb2fae16778bfa7ac9f8e\n\ni feel like we photographers have a pinch of gas and generate a lot of trash. from all the plastic that wraps our usb cables and thick manuals that our beloved camera manufacturers give (which we almost always use to increase the height of our tripod just a little), \n\ni wish camera gear manufacturers reduce the amount of unnecessary stuff shipped in their product\n\nbut, i'm sure many of you have also -----> come !!!  -----> up !!!  -----> with !!!  interesting ways to reuse old stuff - i would love to hear your ideas", "sortedWord": "None", "Identifyer": null, "identifyer": 16207, "year": "2021"}, {"autor": "theflatandthefurious", "date": "2021-09-19 16:27:17", "content": "Making an Instagram for my photography, can anyone help me come up with a username?", "link": "https://www.reddit.com/r/photography/comments/prb6bo/making_an_instagram_for_my_photography_can_anyone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "making an instagram for my photography, can anyone help me -----> come !!!  -----> up !!!  -----> with !!!  a username?", "sortedWord": "None", "Identifyer": null, "identifyer": 16716, "year": "2021"}, {"autor": "searching4direction", "date": "2021-10-04 17:56:13", "content": "How do you come up with creative photo ideas? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/q1avya/how_do_you_come_up_with_creative_photo_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how do you -----> come !!!  -----> up !!!  -----> with !!!  creative photo ideas? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 17104, "year": "2021"}, {"autor": "_IV_VI_", "date": "2021-08-23 15:10:17", "content": "Tips on approaching a new project. /!/ I’m a bring-a-camera-and-find-interesting-light photographer, very spur of the moment usually and haven’t done much in intentional series work.\n\nThat said, I have a week-long road trip coming up with my father through a part of the US with significant sentimental value to him. I’ll be shooting a fuji XT-2 primarily but also plan on bringing an ETRSi for film work.  \n\nI’m interested in documenting places, hearing dad’s stories and understanding how things have changed there over the last 50 years. Finding relics, possibly juxtaposing old and new. \n\nWhat are some tips for how to approach this and stay on task for 10-12 images? What kind of prework should I be doing? How would you approach this as an assignment?", "link": "https://www.reddit.com/r/photography/comments/pa1rq1/tips_on_approaching_a_new_project/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "tips on approaching a new project. /!/ i’m a bring-a-camera-and-find-interesting-light photographer, very spur of the moment usually and haven’t done much in intentional series work.\n\nthat said, i have a week-long road trip -----> coming !!!  -----> up !!!  -----> with !!!  my father through a part of the us -----> with !!!  significant sentimental value to him. i’ll be shooting a fuji xt-2 primarily but also plan on bringing an etrsi for film work.  \n\ni’m interested in documenting places, hearing dad’s stories and understanding how things have changed there over the last 50 years. finding relics, possibly juxtaposing old and new. \n\nwhat are some tips for how to approach this and stay on task for 10-12 images? what kind of prework should i be doing? how would you approach this as an assignment?", "sortedWord": "None", "Identifyer": null, "identifyer": 17371, "year": "2021"}, {"autor": "kaiphive", "date": "2021-10-19 17:17:03", "content": "When coming up with a “name” is photography and media used interchangeably? /!/ Probably and obvious answer but I’ve been researching ideas for a name to brand myself because I want to avoid using my last name and I sometimes see people do things like “SW photography” or “SW media” and I’m just wondering how they are the same/different?", "link": "https://www.reddit.com/r/photography/comments/qbg5e4/when_coming_up_with_a_name_is_photography_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "when -----> coming !!!  -----> up !!!  -----> with !!!  a “name” is photography and media used interchangeably? /!/ probably and obvious answer but i’ve been researching ideas for a name to brand myself because i want to avoid using my last name and i sometimes see people do things like “sw photography” or “sw media” and i’m just wondering how they are the same/different?", "sortedWord": "None", "Identifyer": null, "identifyer": 17999, "year": "2021"}, {"autor": "SexualizedZucchini", "date": "2021-10-23 06:28:58", "content": "What lenses have the most unique visual qualities? Experimental lenses/cameras/etc? /!/ So, I'm looking for lenses that have a very distinctive look. Would love to hear about what you all have come up with!\n\nI currently own a Lomography 64mm Achromat which [has a very interesting soft, but sharp sort of look at f4](https://i.imgur.com/7z0YrqWh.jpg) and has a very swirly bokeh at wide apertures. This one is surprising because I originally bought it as a \"fun\" lens expecting very little out of it. I've learned that (at f4 and smaller) it's more than good enough to be extremely useful even on professional shoots. \n\nI also have this 90m Wollensak lens that I attached to a sock to make a super cheap and innacurate, [but oddly good tilt-shift lens](https://imgur.com/a/ZfBooRs)\n\nNot a lens perse [but I bought a $200 Nikon D7000 and tore out the IR/UV filter from the sensor after shocking the everliving shit out of myself with the flash capacitor](https://i.imgur.com/y3S8LBsh.jpg)\n\nI've also seen this photographer (NOT MY CONTENT) that does absolutely incredible portraiture work with a Russian projector lens called a 16KP - it's absolutely amazing and has the most severe bokeh swirl I've ever seen with wickedly soft corners and a surprisingly sharp center: https://www.flickr.com/photos/116120663@N04/albums/72157677709262421/ \n\nAside from that, I've looked closely at Helios-44 for that classical swirly bokeh - the Laowa 24mm probe macro lens which looks super interesting as an ultrawide super-macro - Lomo Petzval 85 (which appears to perform a lot like my 64mm Achromat) - the Nikkor-s 50mm f1.1 which costs an absurd sum of money but has swirly bokeh with sharp details wide open - and mirror lenses which gives extremely harsh bubble bokeh.\n\nSo tell me about some interesting experimental lenses in your kit!", "link": "https://www.reddit.com/r/photography/comments/qdzf7k/what_lenses_have_the_most_unique_visual_qualities/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what lenses have the most unique visual qualities? experimental lenses/cameras/etc? /!/ so, i'm looking for lenses that have a very distinctive look. would love to hear about what you all have -----> come !!!  -----> up !!!  -----> with !!! !\n\ni currently own a lomography 64mm achromat which [has a very interesting soft, but sharp sort of look at f4](https://i.imgur.com/7z0yrqwh.jpg) and has a very swirly bokeh at wide apertures. this one is surprising because i originally bought it as a \"fun\" lens expecting very little out of it. i've learned that (at f4 and smaller) it's more than good enough to be extremely useful even on professional shoots. \n\ni also have this 90m wollensak lens that i attached to a sock to make a super cheap and innacurate, [but oddly good tilt-shift lens](https://imgur.com/a/zfboors)\n\nnot a lens perse [but i bought a $200 nikon d7000 and tore out the ir/uv filter from the sensor after shocking the everliving shit out of myself with the flash capacitor](https://i.imgur.com/y3s8lbsh.jpg)\n\ni've also seen this photographer (not my content) that does absolutely incredible portraiture work with a russian projector lens called a 16kp - it's absolutely amazing and has the most severe bokeh swirl i've ever seen with wickedly soft corners and a surprisingly sharp center: https://www.flickr.com/photos/116120663@n04/albums/72157677709262421/ \n\naside from that, i've looked closely at helios-44 for that classical swirly bokeh - the laowa 24mm probe macro lens which looks super interesting as an ultrawide super-macro - lomo petzval 85 (which appears to perform a lot like my 64mm achromat) - the nikkor-s 50mm f1.1 which costs an absurd sum of money but has swirly bokeh with sharp details wide open - and mirror lenses which gives extremely harsh bubble bokeh.\n\nso tell me about some interesting experimental lenses in your kit!", "sortedWord": "None", "Identifyer": null, "identifyer": 18136, "year": "2021"}, {"autor": "djhin2", "date": "2021-01-15 17:50:07", "content": "Dealing with a fellow photographer who freeloads /!/ Hello! For context I am a hobbyist photographer who works with computer science for a career. I'm friendly with a professional photographer who's been shooting a little longer. I mostly do environmental portraits so I'm always trying to find creative ways to surround or enhance my model's profile.\n\nLately i've noticed that this other photographer has been following and shooting with people I work with, right after I put their shots up on social media. She also has been doing very similar themes to everything I try, right after i do them. It almost feels like she's letting me find new models + come up with ideas for her to poach.\n\nI do this for fun so my contracts literally only protect me from having to deal with people that ask for compensation, or extra photos, or fast turnarounds. I'm frustrated; I don't think what this photographer is doing is straight-up wrong, but its definitely annoying feeling like I have to look over my shoulder whenever I shoot. It feels like a competition. Has anyone dealt with a similar situation? Thanks and have a good one.", "link": "https://www.reddit.com/r/photography/comments/kxzqep/dealing_with_a_fellow_photographer_who_freeloads/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "dealing with a fellow photographer who freeloads /!/ hello! for context i am a hobbyist photographer who works with computer science for a career. i'm friendly with a professional photographer who's been shooting a little longer. i mostly do environmental portraits so i'm always trying to find creative ways to surround or enhance my model's profile.\n\nlately i've noticed that this other photographer has been following and shooting with people i work with, right after i put their shots up on social media. she also has been doing very similar themes to everything i try, right after i do them. it almost feels like she's letting me find new models + -----> come !!!  -----> up !!!  -----> with !!!  ideas for her to poach.\n\ni do this for fun so my contracts literally only protect me from having to deal with people that ask for compensation, or extra photos, or fast turnarounds. i'm frustrated; i don't think what this photographer is doing is straight-up wrong, but its definitely annoying feeling like i have to look over my shoulder whenever i shoot. it feels like a competition. has anyone dealt with a similar situation? thanks and have a good one.", "sortedWord": "None", "Identifyer": null, "identifyer": 18406, "year": "2021"}], "name": "withphotography2021"}