{"interestingcomments": [{"autor": "shanesaddlebags", "date": "2018-03-13 22:47:49", "content": "What do you guys REALLY think of Ansel Adams? /!/ Ansel Adams is widely regarded as the greatest landscape photographer of all time. He’s in every photography book, every photography documentary, every landscape tutorial, etc. BUT, do you REALLY think his work is that good?\n\nI’m not taking away from his work or his legacy at all. I like a lot of his photos. They’re interesting, engaging, well, framed, well processes, so on and so forth. However, is he actually leagues beyond everything we’ve seen up to this point? \n\nA great many of us on this sub are subscribed to [r/photocritique](https://www.reddit.com/r/photocritique/?st=JEPUR2IH&amp;sh=38640733) and I’m not sure any of us would call an Ansel shot “world class.” I’d be curious to see all of the problems people could come up with if they were asked to critique an Ansel Adams photo not knowing that it was, in fact, and Ansel Adams shot. \n\nAgain, this isn’t to take away from his work. His work is great and it’s inspired a lot of great photographers and continues to inspire people to this day. My point is, what would we all really think if Ansel were posting his photos on reddit today asking for feedback. Would we really think it’s amazing, captivating work, just as everyone says it is? Or, would we tear his work apart like any other photographer on the internet?\n\nI’d love to hear your guys’ thoughts on this. Thanks and have a good day! ", "link": "https://www.reddit.com/r/photography/comments/848h29/what_do_you_guys_really_think_of_ansel_adams/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what do you guys really think of ansel adams? /!/ ansel adams is widely regarded as the greatest landscape photographer of all time. he’s in every photography book, every photography documentary, every landscape tutorial, etc. but, do you really think his work is that good?\n\ni’m not taking away from his work or his legacy at all. i like a lot of his photos. they’re interesting, engaging, well, framed, well processes, so on and so forth. however, is he actually leagues beyond everything we’ve seen up to this point? \n\na great many of us on this sub are subscribed to [r/photocritique](https://www.reddit.com/r/photocritique/?st=jepur2ih&amp;sh=38640733) and i’m not sure any of us would call an ansel shot “world class.” i’d be curious to see all of the problems people could -----> come !!!  -----> up !!!  -----> with !!!  if they were asked to critique an ansel adams photo not knowing that it was, in fact, and ansel adams shot. \n\nagain, this isn’t to take away from his work. his work is great and it’s inspired a lot of great photographers and continues to inspire people to this day. my point is, what would we all really think if ansel were posting his photos on reddit today asking for feedback. would we really think it’s amazing, captivating work, just as everyone says it is? or, would we tear his work apart like any other photographer on the internet?\n\ni’d love to hear your guys’ thoughts on this. thanks and have a good day! ", "sortedWord": "None", "Identifyer": null, "identifyer": 11131, "year": "2018"}, {"autor": "cryptodesign", "date": "2018-03-30 16:07:40", "content": "10 Tips To Bring Your Landscape Photography To The Next Level /!/ Albert Dros here again, professional landscape photographer from the Netherlands. I like to write short useful articles and I just came up with this one. This may all sound quite basic but I feel like I need to point this out because I see so much of the same stuff online. I want to encourage people to be creative, even if it’s just for the sake of trying something new or different. \n\nThis article is both for beginners and advanced landscape photographers. I figured I’d list some tips to hopefully give you some inspiration and give you some new options to try out in your landscape photography. With the era of social media I notice a lot of people just copy photos they see on Facebook or Instagram. This happens to me a lot. I always try to be creative and find ‘new’ angles myself. For some people getting creative comes naturally, but others will need a bit of a push. This article will hopefully help :) Here are 10 tips that will hopefully be helpful to get that bit of extra in your shots.\n\n1) Most landscape photos are shot with wide lenses. I love wide lenses myself, but try a telezoom once and experiment with long focal lengths of 100-300+. Try photographing patterns or small details in landscapes. Or try it in the mountains on mountain tops. Once you get the hang of it, you’ll notice a whole new world of landscape photography opens. Seriously, try it.\n\n[Green Hills close up at 300mm](https://i.imgur.com/Tsjk3v5.jpg)\n\n2) Play with motion. Clouds move, water moves. Try to create dynamics in your frame by the use of moving water or clouds. You can do this by using long or short shutter speeds. You can make use of filters to create longer exposures, or create drama with very short exposures. Always experiment with different lengths of exposure with both clouds and water.\n\n[Short exposure to capture drama](https://i.imgur.com/cNqqXYl.jpg)\n\n[Long exposure of the same scene with a different composition to create a totally different mood](https://i.imgur.com/yOh6pLL.jpg)\n\n3) Experiment with a CPL filter. I have done landscape photography without a CPL filter for years. But once you have one, you start to see why it can be so useful in different cases. It can be especially useful to control the amount of sunlight and reflection on reflective surfaces. You simply can’t do this in post production.\n\n[Example of Rotating CPL effect on reflective surface](https://media.giphy.com/media/1o1u6VbxA54uBMCMlc/giphy.gif)\n\n4) When photographing with longer lenses use layers and compression. Landscapes look totally different with long lenses and you can compress foreground and background objects to give a lot of depth in your photo. \n\n[Compressed Road shot at 135mm](https://i.imgur.com/vrRBVGd.jpg)\n\n[Including a person with a long lens shot at 200mm](https://i.imgur.com/OZYvTbU.jpg)\n\n5) Use light to your advantage. Light always changes especially during sunsets and sunrises. Look for details here and isolated objects by light. This happens a lot in the mountains where clouds and light play around peaks go on during the whole day. \n\n[First Morning Light hitting a mountain peak](https://i.imgur.com/yI0maQn.jpg)\n\n6) When shooting with wide angles, get very close to objects to create a lot of depth in your photo. With ‘very close’ I mean VERY close. So close that your lens almost touches the foreground object. This can be a flower, a plant, or anything. You can use focus stacking to get everything in focus, or choose to pick a very wide open aperture to get the foreground completely out of focus/blurry. Both choices offer different looks and can both be used in nice ways.\n\n[Getting very low and close with Out of Focus foreground](https://i.imgur.com/xZQ3bLL.jpg)\n\n[Getting very low with focus stacking](https://i.imgur.com/cq7euyj.jpg)\n\n7) Make use of sunstars in your composition. When shooting directly in to the sun and closing down your aperture to f/16-f/22 you will see that your lens will create a sunstar. Different lenses have different characteristics. Some lenses create beautiful sunstars and you may want to make use of them. Position the sun against an edge, like the horizon or just an object in the frame. By positioning it slightly against an edge, the sunstars will look best. Try and experiment!\n\n[f/22 sunstar with the sun peaking just over the treeline](https://i.imgur.com/T3fxCrA.jpg)\n\n[Sun just touching the edge of an object to create a sunstar](https://i.imgur.com/tb42rPC.jpg)\n\n8) Learn how to shoot with extreme wide angle lenses and fisheye lenses. By extreme wide I mean wider than 14mm (full frame equivalent). Photographing at 10-12mm or wider with fisheye lenses give you a whole new perspective to a landscape. It opens up lots of (creative) possibilities. Learn the ‘defish’ technique also that makes it possible to create an undistorted shot out of a fisheye shot (not going to describe the technique here, but can be found online. I also have a Youtube tutorial about it). This can be extremely useful for photographing very wide landscapes.\n\n[Vertigo shot with 180 degree fisheye and corrupted with lens profile](https://i.imgur.com/TXya83Y.jpg)\n\n\n[Wide scene shot with 12mm fisheye 180 degrees, corrected so no distortion appears](https://i.imgur.com/Uzi8Pjr.jpg)\n\n9) Don’t always immediately take your camera out and look for potential frames. Walk around in nature and use your eyes. Try to visualise how things would look through your camera. I also often use my smartphone, which has an around 20mm field of view. Simply to check framing.\n\n[random spot I found next to the road](https://i.imgur.com/yskqooz.jpg)\n\n10) Last, this may sound very obvious but it’s important to train your eye nonstop. Look around you everywhere and try to see potential compositions in every day life. This may sounds hard and being a landscape photographer can be very tiring because of the nonstop possibilities nature offers. You train your eye by using a wide array of lenses so that you know how things will look through an extreme zoom lens, or how things would look with an extreme wide angle.\n\n[Cold Morning, Just looking around](https://i.imgur.com/DdeHidC.jpg)\n\n\nHope these were useful. Feel free to ask me anything in here!\n\n", "link": "https://www.reddit.com/r/photography/comments/88bguy/10_tips_to_bring_your_landscape_photography_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "10 tips to bring your landscape photography to the next level /!/ albert dros here again, professional landscape photographer from the netherlands. i like to write short useful articles and i just -----> came !!!  -----> up !!!  -----> with !!!  this one. this may all sound quite basic but i feel like i need to point this out because i see so much of the same stuff online. i want to encourage people to be creative, even if it’s just for the sake of trying something new or different. \n\nthis article is both for beginners and advanced landscape photographers. i figured i’d list some tips to hopefully give you some inspiration and give you some new options to try out in your landscape photography. with the era of social media i notice a lot of people just copy photos they see on facebook or instagram. this happens to me a lot. i always try to be creative and find ‘new’ angles myself. for some people getting creative comes naturally, but others will need a bit of a push. this article will hopefully help :) here are 10 tips that will hopefully be helpful to get that bit of extra in your shots.\n\n1) most landscape photos are shot with wide lenses. i love wide lenses myself, but try a telezoom once and experiment with long focal lengths of 100-300+. try photographing patterns or small details in landscapes. or try it in the mountains on mountain tops. once you get the hang of it, you’ll notice a whole new world of landscape photography opens. seriously, try it.\n\n[green hills close up at 300mm](https://i.imgur.com/tsjk3v5.jpg)\n\n2) play with motion. clouds move, water moves. try to create dynamics in your frame by the use of moving water or clouds. you can do this by using long or short shutter speeds. you can make use of filters to create longer exposures, or create drama with very short exposures. always experiment with different lengths of exposure with both clouds and water.\n\n[short exposure to capture drama](https://i.imgur.com/cnqqxyl.jpg)\n\n[long exposure of the same scene with a different composition to create a totally different mood](https://i.imgur.com/yoh6pll.jpg)\n\n3) experiment with a cpl filter. i have done landscape photography without a cpl filter for years. but once you have one, you start to see why it can be so useful in different cases. it can be especially useful to control the amount of sunlight and reflection on reflective surfaces. you simply can’t do this in post production.\n\n[example of rotating cpl effect on reflective surface](https://media.giphy.com/media/1o1u6vbxa54ubmcmlc/giphy.gif)\n\n4) when photographing with longer lenses use layers and compression. landscapes look totally different with long lenses and you can compress foreground and background objects to give a lot of depth in your photo. \n\n[compressed road shot at 135mm](https://i.imgur.com/vrrbvgd.jpg)\n\n[including a person with a long lens shot at 200mm](https://i.imgur.com/ozyvtbu.jpg)\n\n5) use light to your advantage. light always changes especially during sunsets and sunrises. look for details here and isolated objects by light. this happens a lot in the mountains where clouds and light play around peaks go on during the whole day. \n\n[first morning light hitting a mountain peak](https://i.imgur.com/yi0maqn.jpg)\n\n6) when shooting with wide angles, get very close to objects to create a lot of depth in your photo. with ‘very close’ i mean very close. so close that your lens almost touches the foreground object. this can be a flower, a plant, or anything. you can use focus stacking to get everything in focus, or choose to pick a very wide open aperture to get the foreground completely out of focus/blurry. both choices offer different looks and can both be used in nice ways.\n\n[getting very low and close with out of focus foreground](https://i.imgur.com/xzq3bll.jpg)\n\n[getting very low with focus stacking](https://i.imgur.com/cq7euyj.jpg)\n\n7) make use of sunstars in your composition. when shooting directly in to the sun and closing down your aperture to f/16-f/22 you will see that your lens will create a sunstar. different lenses have different characteristics. some lenses create beautiful sunstars and you may want to make use of them. position the sun against an edge, like the horizon or just an object in the frame. by positioning it slightly against an edge, the sunstars will look best. try and experiment!\n\n[f/22 sunstar with the sun peaking just over the treeline](https://i.imgur.com/t3fxcra.jpg)\n\n[sun just touching the edge of an object to create a sunstar](https://i.imgur.com/tb42rpc.jpg)\n\n8) learn how to shoot with extreme wide angle lenses and fisheye lenses. by extreme wide i mean wider than 14mm (full frame equivalent). photographing at 10-12mm or wider with fisheye lenses give you a whole new perspective to a landscape. it opens up lots of (creative) possibilities. learn the ‘defish’ technique also that makes it possible to create an undistorted shot out of a fisheye shot (not going to describe the technique here, but can be found online. i also have a youtube tutorial about it). this can be extremely useful for photographing very wide landscapes.\n\n[vertigo shot with 180 degree fisheye and corrupted with lens profile](https://i.imgur.com/txya83y.jpg)\n\n\n[wide scene shot with 12mm fisheye 180 degrees, corrected so no distortion appears](https://i.imgur.com/uzi8pjr.jpg)\n\n9) don’t always immediately take your camera out and look for potential frames. walk around in nature and use your eyes. try to visualise how things would look through your camera. i also often use my smartphone, which has an around 20mm field of view. simply to check framing.\n\n[random spot i found next to the road](https://i.imgur.com/yskqooz.jpg)\n\n10) last, this may sound very obvious but it’s important to train your eye nonstop. look around you everywhere and try to see potential compositions in every day life. this may sounds hard and being a landscape photographer can be very tiring because of the nonstop possibilities nature offers. you train your eye by using a wide array of lenses so that you know how things will look through an extreme zoom lens, or how things would look with an extreme wide angle.\n\n[cold morning, just looking around](https://i.imgur.com/ddehidc.jpg)\n\n\nhope these were useful. feel free to ask me anything in here!\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 12270, "year": "2018"}, {"autor": "IcantMainMercy", "date": "2018-06-11 09:13:49", "content": "Inspiration problems /!/ So I’m still new to photography, got my self a D3400 with kit lens. But I have a problem with what to photograph. How do you guys come up with what to photograph? I live in Ireland in a small town not a lot going on, I’ve tried to go to local parks etc but sick of taking photos of trees and waterfalls. ", "link": "https://www.reddit.com/r/photography/comments/8q84a3/inspiration_problems/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "inspiration problems /!/ so i’m still new to photography, got my self a d3400 with kit lens. but i have a problem with what to photograph. how do you guys -----> come !!!  -----> up !!!  -----> with !!!  what to photograph? i live in ireland in a small town not a lot going on, i’ve tried to go to local parks etc but sick of taking photos of trees and waterfalls. ", "sortedWord": "None", "Identifyer": null, "identifyer": 12765, "year": "2018"}, {"autor": "McQuadls", "date": "2018-08-03 01:24:34", "content": "To Use Watermarks or Not to Use Watermarks? /!/ I going to be starting up a freelance photography/videography business with some social media pages and such and I'm conflicted on using watermarks. I understand people use them to protect their work from being stolen, but I do think that pictures look nicer without them. I've heard multiple opinions but I can't decide if I want to use them, not use them, use them in certain scenarios, or use them but make it small and transparent. Would anyone be able to give me their thoughts so I could come up with what I want to do easier?", "link": "https://www.reddit.com/r/photography/comments/9459bl/to_use_watermarks_or_not_to_use_watermarks/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "to use watermarks or not to use watermarks? /!/ i going to be starting up a freelance photography/videography business with some social media pages and such and i'm conflicted on using watermarks. i understand people use them to protect their work from being stolen, but i do think that pictures look nicer without them. i've heard multiple opinions but i can't decide if i want to use them, not use them, use them in certain scenarios, or use them but make it small and transparent. would anyone be able to give me their thoughts so i could -----> come !!!  -----> up !!!  -----> with !!!  what i want to do easier?", "sortedWord": "None", "Identifyer": null, "identifyer": 16149, "year": "2018"}, {"autor": "Notleks_", "date": "2018-08-14 14:38:49", "content": "Having problems with my Tamron 70-300mm (f/5.6) which wont work beyond f/5.6. /!/ I've literally zero idea as to how this has happened. I was trying to get a nice macro of a butterfly that decided to fly into the house, but when I tried changing aperture, my Canon 1300D came up with with \"Err 01: Communications between the camera and lens is faulty. Clean the contact lens.\". I notice this only occurs when shooting past focal length 200mm or greater.\n\nI've tried cleaning every thing with a lens cleaning pen, micro fibre cloth, blowing with a puff thing... and nothing.", "link": "https://www.reddit.com/r/photography/comments/978wan/having_problems_with_my_tamron_70300mm_f56_which/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "having problems with my tamron 70-300mm (f/5.6) which wont work beyond f/5.6. /!/ i've literally zero idea as to how this has happened. i was trying to get a nice macro of a butterfly that decided to fly into the house, but when i tried changing aperture, my canon 1300d -----> came !!!  -----> up !!!  -----> with !!!  -----> with !!!  \"err 01: communications between the camera and lens is faulty. clean the contact lens.\". i notice this only occurs when shooting past focal length 200mm or greater.\n\ni've tried cleaning every thing with a lens cleaning pen, micro fibre cloth, blowing with a puff thing... and nothing.", "sortedWord": "None", "Identifyer": null, "identifyer": 16240, "year": "2018"}, {"autor": "starscreamm03", "date": "2018-09-28 01:27:06", "content": "photography inspiration /!/ ive been feeling uninspired lately and feels like my portraits are not good enough. i think i need to come up with concepts but cant seem to come up with out. can someone help me out cos google wont.", "link": "https://www.reddit.com/r/photography/comments/9jipc7/photography_inspiration/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "photography inspiration /!/ ive been feeling uninspired lately and feels like my portraits are not good enough. i think i need to -----> come !!!  -----> up !!!  -----> with !!!  concepts but cant seem to -----> come !!!  -----> up !!!  -----> with !!!  out. can someone help me out cos google wont.", "sortedWord": "None", "Identifyer": null, "identifyer": 16818, "year": "2018"}, {"autor": "martinpitonak", "date": "2018-10-25 13:12:28", "content": "Still Life Photography of Nail Polish in Whirlpool of Splash /!/ [https://www.youtube.com/watch?v=ykEECI1lVTo](https://www.youtube.com/watch?v=ykEECI1lVTo)\n\n&amp;#x200B;\n\n![img](ca7yap710cu11)\n\n## The Brief\n\nFor this project, I was tasked with creating hero images for a cosmetic brand. They commisioned me to work on several different shots for a range of nail polishes they are looking to market. Again, I was put in charge of coming up with the creative angle and had the freedom to explore and execute the final result. The client was open to any suggestions or ideas, and I had fun putting it all together.\n\nMy vision was to keep the design simple yet unique and deeply orientated towards the brand and product on show. Nail polish bottles are generally a small object and require slightly different treatment than, say, photographing a large carry bag. The bottle needed to be centered and close up enough to capture the logo and brand name. Each bottle was cubed-shaped, with a matt-pastel color, the same as the gel nail polish inside. The lids (bottle tops) were long, frosted-gold colored. This color really illuminates the final image and casts long diagonal lines as the viewer follows it up.\n\n## The Setup and Using Splashes\n\nAs this project is not a single image, but rather a series of images, I tried to create something that flows like a story. After brainstorming and running through different ideas, I found a particular genre of still life photography to be most suitable. Splash is the art of capturing liquid in motion. Splash is a classic genre, and it is popular to take splash templates and use them as backgrounds or additions to your image. It does require some knowledge of Photoshop and other editing software to manipulate. I chose to create a splash specifically for this project, and not take advantage of an existing one from other artists.\n\nI experimented with several different liquids, from organic to synthetic mixtures. The mixture or liquid needed the consistency and fluidity to fit the brand and idea. Eventually, I settled with a classic, white acrylic wall paint. A water-based solution worked best for this project. Pouring the liquid by hand from a raised position into a container below, I hoped to capture interesting patterns. The setup was a standard white background positioned not far behind the table. On the table, I had a container to catch the paint as I poured it from above. I repeated this pouring step multiple times until I found some splashes worth editing and merging with the nail polish bottles. The products were shot individually. This particular project required more post-production editing than usual. Software like Photoshop was used to achieve the final results.\n\n## To End\n\nThe client and I agree that the final results are satisfying. The elegance of the brand complements the creativity and flow of the photograph. The online community expressed an interest in learning more about splash. As well as, praising the final results. Furthermore, the client originally made me withhold the results until they have rolled out the new marketing material.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9ra645/still_life_photography_of_nail_polish_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "still life photography of nail polish in whirlpool of splash /!/ [https://www.youtube.com/watch?v=ykeeci1lvto](https://www.youtube.com/watch?v=ykeeci1lvto)\n\n&amp;#x200b;\n\n![img](ca7yap710cu11)\n\n## the brief\n\nfor this project, i was tasked with creating hero images for a cosmetic brand. they commisioned me to work on several different shots for a range of nail polishes they are looking to market. again, i was put in charge of -----> coming !!!  -----> up !!!  -----> with !!!  the creative angle and had the freedom to explore and execute the final result. the client was open to any suggestions or ideas, and i had fun putting it all together.\n\nmy vision was to keep the design simple yet unique and deeply orientated towards the brand and product on show. nail polish bottles are generally a small object and require slightly different treatment than, say, photographing a large carry bag. the bottle needed to be centered and close up enough to capture the logo and brand name. each bottle was cubed-shaped, with a matt-pastel color, the same as the gel nail polish inside. the lids (bottle tops) were long, frosted-gold colored. this color really illuminates the final image and casts long diagonal lines as the viewer follows it up.\n\n## the setup and using splashes\n\nas this project is not a single image, but rather a series of images, i tried to create something that flows like a story. after brainstorming and running through different ideas, i found a particular genre of still life photography to be most suitable. splash is the art of capturing liquid in motion. splash is a classic genre, and it is popular to take splash templates and use them as backgrounds or additions to your image. it does require some knowledge of photoshop and other editing software to manipulate. i chose to create a splash specifically for this project, and not take advantage of an existing one from other artists.\n\ni experimented with several different liquids, from organic to synthetic mixtures. the mixture or liquid needed the consistency and fluidity to fit the brand and idea. eventually, i settled with a classic, white acrylic wall paint. a water-based solution worked best for this project. pouring the liquid by hand from a raised position into a container below, i hoped to capture interesting patterns. the setup was a standard white background positioned not far behind the table. on the table, i had a container to catch the paint as i poured it from above. i repeated this pouring step multiple times until i found some splashes worth editing and merging with the nail polish bottles. the products were shot individually. this particular project required more post-production editing than usual. software like photoshop was used to achieve the final results.\n\n## to end\n\nthe client and i agree that the final results are satisfying. the elegance of the brand complements the creativity and flow of the photograph. the online community expressed an interest in learning more about splash. as well as, praising the final results. furthermore, the client originally made me withhold the results until they have rolled out the new marketing material.\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 17171, "year": "2018"}, {"autor": "idkwidd", "date": "2018-03-06 07:56:53", "content": "Looking for some stories of people who have lost interest in photography, and picking it back up again. /!/ Photography was my number 1 hobby all of last year and absolutely enjoyed going out and taking pictures, and learning to get better with my camera. People loved my photos and it felt awesome to be recognized for what I was doing. \n\nI'm not sure why I stopped but over the summer I just slowly stopped going out. I guess in a way I felt like I had photographed everything I was interested in and lost my motivation. I was so into it that at night I would come up with a picture in my head and set out the next day to try and emulate it.\n\nI want to get back into taking photos but at the same time am finding it hard to get motivated to go out and do it ", "link": "https://www.reddit.com/r/photography/comments/82debv/looking_for_some_stories_of_people_who_have_lost/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking for some stories of people who have lost interest in photography, and picking it back up again. /!/ photography was my number 1 hobby all of last year and absolutely enjoyed going out and taking pictures, and learning to get better with my camera. people loved my photos and it felt awesome to be recognized for what i was doing. \n\ni'm not sure why i stopped but over the summer i just slowly stopped going out. i guess in a way i felt like i had photographed everything i was interested in and lost my motivation. i was so into it that at night i would -----> come !!!  -----> up !!!  -----> with !!!  a picture in my head and set out the next day to try and emulate it.\n\ni want to get back into taking photos but at the same time am finding it hard to get motivated to go out and do it ", "sortedWord": "None", "Identifyer": null, "identifyer": 19715, "year": "2018"}, {"autor": "a49991", "date": "2018-06-06 01:30:58", "content": "The logistics of being a freelance photographer /!/ Hey everyone, I'm on mobile so I apologise in advance for the formatting.\nI am looking to start doing some freelance photography work taking pictures of cars for sale at local independent dealerships in my area. I have an extensive knowledge of cars and a lot of my photography has been based around them. Here's a few other details. \n-college student\n- the primary camera I would use is a Sony a-6000 with 3 lenses (1.8/50, 3.5-5.6/16-50, 4.5-6.3/55-210) tripod, circular polorizer and other basic equipment\n-experience with lightroom/Photoshop\nHere are some questions I have. \n1. What do I need to do on the business side of this work? Can I just be paid in cash or do I need to set up something more official? \n2. What is the best way to have a physical portfolio? (most independent dealer owners are more old fashioned and prefer in person and on paper instead of digital) \n3. what is the best way to start? I was thinking offer to photograph one of their cars for free so they could see how they liked it. \n4. Payment? I have no idea what to charge. The best idea I could come up with is a flat rate per car. \n5. Any other advice? \n\nThank you for taking the time to help me and hopefully others looking to start getting into the professional photography world! \n\nTl;dr how do I start doing freelance photography?", "link": "https://www.reddit.com/r/photography/comments/8owjz9/the_logistics_of_being_a_freelance_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "the logistics of being a freelance photographer /!/ hey everyone, i'm on mobile so i apologise in advance for the formatting.\ni am looking to start doing some freelance photography work taking pictures of cars for sale at local independent dealerships in my area. i have an extensive knowledge of cars and a lot of my photography has been based around them. here's a few other details. \n-college student\n- the primary camera i would use is a sony a-6000 with 3 lenses (1.8/50, 3.5-5.6/16-50, 4.5-6.3/55-210) tripod, circular polorizer and other basic equipment\n-experience with lightroom/photoshop\nhere are some questions i have. \n1. what do i need to do on the business side of this work? can i just be paid in cash or do i need to set up something more official? \n2. what is the best way to have a physical portfolio? (most independent dealer owners are more old fashioned and prefer in person and on paper instead of digital) \n3. what is the best way to start? i was thinking offer to photograph one of their cars for free so they could see how they liked it. \n4. payment? i have no idea what to charge. the best idea i could -----> come !!!  -----> up !!!  -----> with !!!  is a flat rate per car. \n5. any other advice? \n\nthank you for taking the time to help me and hopefully others looking to start getting into the professional photography world! \n\ntl;dr how do i start doing freelance photography?", "sortedWord": "None", "Identifyer": null, "identifyer": 21213, "year": "2018"}, {"autor": "Sehnsucht_13", "date": "2018-06-05 18:23:25", "content": "What photography contest do you guys join every year? /!/ I've come up with my own overwhelming list but I'm sure there's much more to know. What kind of contests do you guys look forward to join annually?", "link": "https://www.reddit.com/r/photography/comments/8ot72a/what_photography_contest_do_you_guys_join_every/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what photography contest do you guys join every year? /!/ i've -----> come !!!  -----> up !!!  -----> with !!!  my own overwhelming list but i'm sure there's much more to know. what kind of contests do you guys look forward to join annually?", "sortedWord": "None", "Identifyer": null, "identifyer": 21242, "year": "2018"}, {"autor": "RedTexan04", "date": "2018-06-14 05:16:42", "content": "Finally Used My Camera /!/ So I have been lurking on here for a few months  reading advice and looking at photos! I have always wanted to get into photography but never took the dive.  My new job has me traveling across the US and I was taking a ton of photos with my phone. Parents decided to gift me my first \"real\" camera a while back for my birthday and I have been super intimidated to use it. Well today I finally got around to taking the plunge. Took about 250 photos and came up with a few I thought were decent enough to clean up.  Just wanted to share and encourage others! PS: As someone new to photgraphy, critique and feedback would be awesome!\n\nhttps://www.instagram.com/p/Bj_gnQTjGOC/?utm_source=ig_share_sheet&amp;igshid=1b13770o5ci0b\n\nhttps://www.instagram.com/p/Bj_gcPSjrIG/?utm_source=ig_share_sheet&amp;igshid=yhlz01ihnfkn\n\nhttps://www.instagram.com/p/Bj_gSJpjVO2/?utm_source=ig_share_sheet&amp;igshid=sijg9sg3yfbm\n\nhttps://www.instagram.com/p/Bj_gH3lj3MF/?utm_source=ig_share_sheet&amp;igshid=4ouj9ijs2qc4\n\nhttps://www.instagram.com/p/Bj_f8UBD9cP/?utm_source=ig_share_sheet&amp;igshid=1lurs4id1et34\n\nhttps://www.instagram.com/p/Bj_f0JSDepV/?utm_source=ig_share_sheet&amp;igshid=5fazv0boj6ay", "link": "https://www.reddit.com/r/photography/comments/8qz9r0/finally_used_my_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "finally used my camera /!/ so i have been lurking on here for a few months  reading advice and looking at photos! i have always wanted to get into photography but never took the dive.  my new job has me traveling across the us and i was taking a ton of photos with my phone. parents decided to gift me my first \"real\" camera a while back for my birthday and i have been super intimidated to use it. well today i finally got around to taking the plunge. took about 250 photos and -----> came !!!  -----> up !!!  -----> with !!!  a few i thought were decent enough to clean -----> up !!! .  just wanted to share and encourage others! ps: as someone new to photgraphy, critique and feedback would be awesome!\n\nhttps://www.instagram.com/p/bj_gnqtjgoc/?utm_source=ig_share_sheet&amp;igshid=1b13770o5ci0b\n\nhttps://www.instagram.com/p/bj_gcpsjrig/?utm_source=ig_share_sheet&amp;igshid=yhlz01ihnfkn\n\nhttps://www.instagram.com/p/bj_gsjpjvo2/?utm_source=ig_share_sheet&amp;igshid=sijg9sg3yfbm\n\nhttps://www.instagram.com/p/bj_gh3lj3mf/?utm_source=ig_share_sheet&amp;igshid=4ouj9ijs2qc4\n\nhttps://www.instagram.com/p/bj_f8ubd9cp/?utm_source=ig_share_sheet&amp;igshid=1lurs4id1et34\n\nhttps://www.instagram.com/p/bj_f0jsdepv/?utm_source=ig_share_sheet&amp;igshid=5fazv0boj6ay", "sortedWord": "None", "Identifyer": null, "identifyer": 21585, "year": "2018"}, {"autor": "TSportraits", "date": "2018-06-18 21:03:59", "content": "Hi guys! Please help a newbie redditor come up with proper pricing structure :) /!/ Hi guys! I know a lot of these pricing questions depend a lot on a photographer's skill level and experience (or location), so I'll just jump right into it.\n\nHere's my portrait work on IG: [http://www.instagram.com/tripsirna](http://www.instagram.com/tripsirna) I'm still re-doing my website, so IG is what I have for now.\n\nI'm located in NYC, been shooting for about 9 years, most of which was just hobby/fun stuff. However, I started taking portraiture a lot more seriously and the headshot/portrait gig requests are coming in, and I'm having a bit of trouble setting the right price for my work. When I mention something like... $250, they just disappear. However, I know (or at least feel) that the quality of my work deserves at least that. I bring a good amount of lighting gear to every shoot, and spend a good 30-60 minutes retouching each photo.\n\nAs a clarification: yes most (if not all) of my work on IG are with models. The inquiries I'm talking about come from regular people who need headshots and portraits for business/promotional purposes. I have no problem turning down gigs that aren't worth it. I just want to know what is a reasonable amount to charge for 1 hour (1 look), 2 hour (2-3 looks) portrait sessions based on my market and my skill level. Thank you very much for your help!", "link": "https://www.reddit.com/r/photography/comments/8s31y2/hi_guys_please_help_a_newbie_redditor_come_up/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hi guys! please help a newbie redditor -----> come !!!  -----> up !!!  -----> with !!!  proper pricing structure :) /!/ hi guys! i know a lot of these pricing questions depend a lot on a photographer's skill level and experience (or location), so i'll just jump right into it.\n\nhere's my portrait work on ig: [http://www.instagram.com/tripsirna](http://www.instagram.com/tripsirna) i'm still re-doing my website, so ig is what i have for now.\n\ni'm located in nyc, been shooting for about 9 years, most of which was just hobby/fun stuff. however, i started taking portraiture a lot more seriously and the headshot/portrait gig requests are coming in, and i'm having a bit of trouble setting the right price for my work. when i mention something like... $250, they just disappear. however, i know (or at least feel) that the quality of my work deserves at least that. i bring a good amount of lighting gear to every shoot, and spend a good 30-60 minutes retouching each photo.\n\nas a clarification: yes most (if not all) of my work on ig are with models. the inquiries i'm talking about come from regular people who need headshots and portraits for business/promotional purposes. i have no problem turning down gigs that aren't worth it. i just want to know what is a reasonable amount to charge for 1 hour (1 look), 2 hour (2-3 looks) portrait sessions based on my market and my skill level. thank you very much for your help!", "sortedWord": "None", "Identifyer": null, "identifyer": 21614, "year": "2018"}, {"autor": "repsuc", "date": "2018-06-25 08:42:10", "content": "Surface storage /!/ I'm having a bit of a problem coming up with a convenient and practical way to store my shooting surfaces. I have about 25 surfaces all about 1 square meter or so in size. Right now they are just leaned up against every wall in my studio and are quickly becoming a tripping hazard. \n\nHow do you all store your shooting surfaces? Any and all ideas would be appreciated. ", "link": "https://www.reddit.com/r/photography/comments/8toxuk/surface_storage/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "surface storage /!/ i'm having a bit of a problem -----> coming !!!  -----> up !!!  -----> with !!!  a convenient and practical way to store my shooting surfaces. i have about 25 surfaces all about 1 square meter or so in size. right now they are just leaned up against every wall in my studio and are quickly becoming a tripping hazard. \n\nhow do you all store your shooting surfaces? any and all ideas would be appreciated. ", "sortedWord": "None", "Identifyer": null, "identifyer": 21895, "year": "2018"}, {"autor": "tinyant", "date": "2018-08-01 18:03:12", "content": "Star photo help please /!/ Can anyone tell me what I'm doing wrong with my astro photos please? I played around with my settings from ISO to f-stop and this is the best I was able to come up with on my Sony a6000 (settings are show in the image caption). I used an Amazon tripod and a remote shutter trigger with bulb exposure time.\n\nThanks for any tips!\n https://imgur.com/gallery/Mqz6dq7", "link": "https://www.reddit.com/r/photography/comments/93rdaz/star_photo_help_please/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "star photo help please /!/ can anyone tell me what i'm doing wrong with my astro photos please? i played around -----> with !!!  my settings from iso to f-stop and this is the best i was able to -----> come !!!  -----> up !!!  -----> with !!!  on my sony a6000 (settings are show in the image caption). i used an amazon tripod and a remote shutter trigger with bulb exposure time.\n\nthanks for any tips!\n https://imgur.com/gallery/mqz6dq7", "sortedWord": "None", "Identifyer": null, "identifyer": 22454, "year": "2018"}, {"autor": "swilkeni", "date": "2018-09-07 01:11:31", "content": "Best hosting site for privacy? /!/ Forgive me if this has been addressed here, I tried searching but didn't come up with what I was looking for. After the Cambridge Analytica debacle I became a lot more serious about my online privacy and immediately deleted my Facebook account. This also rules out Instagram. My question for the community: Is there a good hosting site available with a reasonable policy on privacy and data collection? Anything that privacy advocates would actively recommend? I'm just an amateur looking to share my work with family and friends, it doesn't necessarily have to be a professional level platform. Any advice is greatly appreciated, thanks.", "link": "https://www.reddit.com/r/photography/comments/9dpau7/best_hosting_site_for_privacy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "best hosting site for privacy? /!/ forgive me if this has been addressed here, i tried searching but didn't -----> come !!!  -----> up !!!  -----> with !!!  what i was looking for. after the cambridge analytica debacle i became a lot more serious about my online privacy and immediately deleted my facebook account. this also rules out instagram. my question for the community: is there a good hosting site available with a reasonable policy on privacy and data collection? anything that privacy advocates would actively recommend? i'm just an amateur looking to share my work with family and friends, it doesn't necessarily have to be a professional level platform. any advice is greatly appreciated, thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 23478, "year": "2018"}, {"autor": "JEEPATHON", "date": "2018-09-23 04:24:19", "content": "Help with Northern Lights /!/ Hey guys,\n\nVery new to photography. I'm fortunate enough to live in the sub-arctic where we get amazing Northern Lights (Aurora). I have an entry level DSLR (canon rebel T5) with the basic 18-55mm lens and bipod. I am having a hard time with the focus and brightness of the photos... [here](https://imgur.com/a/hXYktR3) is what I came up with.  \nI set the focus during the day by focusing on something very far and tried my best to keep it that way but it is very difficult not to knock or touch the focus adjust at all during handling/transport. I also found the photo to be too bright... we are in almost pitch black darkness and everything is way too bright.  \nThe settings used were: shutter speed 20\", aperture F3.5, ISO800 (tried ISO 400 and 1400) and 2.5 second delay when taking picture. Does anyone have any advise? How can I adjust my focus on the fly while shooting them at night? ", "link": "https://www.reddit.com/r/photography/comments/9i5u4j/help_with_northern_lights/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "help with northern lights /!/ hey guys,\n\nvery new to photography. i'm fortunate enough to live in the sub-arctic where we get amazing northern lights (aurora). i have an entry level dslr (canon rebel t5) with the basic 18-55mm lens and bipod. i am having a hard time with the focus and brightness of the photos... [here](https://imgur.com/a/hxyktr3) is what i -----> came !!!  -----> up !!!  -----> with !!! .  \ni set the focus during the day by focusing on something very far and tried my best to keep it that way but it is very difficult not to knock or touch the focus adjust at all during handling/transport. i also found the photo to be too bright... we are in almost pitch black darkness and everything is way too bright.  \nthe settings used were: shutter speed 20\", aperture f3.5, iso800 (tried iso 400 and 1400) and 2.5 second delay when taking picture. does anyone have any advise? how can i adjust my focus on the fly while shooting them at night? ", "sortedWord": "None", "Identifyer": null, "identifyer": 23837, "year": "2018"}, {"autor": "Revenge_Rampage", "date": "2018-10-11 07:33:22", "content": "Analog \"filters\" /!/ Hello, new visitor here seeking knowledge from people with more insights. \n\nIn my university studies we are currently working on a project that aims to spark interest in science among young adults, aged 12-16. Based half and half on user studies and presumptions we have come up with a concept to show what Snapchat is, where it \"came from\" and how it works.\n\nOur take on it was to create an old-school photo booth, which will be in an exhibit later this year. In the photo booth, there will be a camera, a printer and what I want to call \"analog filters\".\n\nFor instance, one analog filter could be the dog ears which are commonly used in snaps, put on a stick so you can hold it in front of your face when the picture is taken. Dog ears in all it's glory offer little to no understanding of science, and thus Im turning to you for ideas - if some are willing to help.\n\nQuestion is: What physical object can act as a filter, that creates some nice effect for the photo they're taking?", "link": "https://www.reddit.com/r/photography/comments/9n7tgp/analog_filters/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "analog \"filters\" /!/ hello, new visitor here seeking knowledge from people with more insights. \n\nin my university studies we are currently working on a project that aims to spark interest in science among young adults, aged 12-16. based half and half on user studies and presumptions we have -----> come !!!  -----> up !!!  -----> with !!!  a concept to show what snapchat is, where it \"came from\" and how it works.\n\nour take on it was to create an old-school photo booth, which will be in an exhibit later this year. in the photo booth, there will be a camera, a printer and what i want to call \"analog filters\".\n\nfor instance, one analog filter could be the dog ears which are commonly used in snaps, put on a stick so you can hold it in front of your face when the picture is taken. dog ears in all it's glory offer little to no understanding of science, and thus im turning to you for ideas - if some are willing to help.\n\nquestion is: what physical object can act as a filter, that creates some nice effect for the photo they're taking?", "sortedWord": "None", "Identifyer": null, "identifyer": 24101, "year": "2018"}, {"autor": "aspire569", "date": "2018-10-14 19:51:29", "content": "Digital or Physical? /!/ So I'm just starting to get into doing paid portrait shoots and I'm trying to come up with prices/packages to make things a bit more transparent. With that I'm curious: Do you mainly offer digital files, physical prints, or a mixture of both? What has had the more success for you? ", "link": "https://www.reddit.com/r/photography/comments/9o5qxf/digital_or_physical/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "digital or physical? /!/ so i'm just starting to get into doing paid portrait shoots and i'm trying to -----> come !!!  -----> up !!!  -----> with !!!  prices/packages to make things a bit more transparent. with that i'm curious: do you mainly offer digital files, physical prints, or a mixture of both? what has had the more success for you? ", "sortedWord": "None", "Identifyer": null, "identifyer": 24205, "year": "2018"}, {"autor": "shian243", "date": "2018-10-14 02:55:18", "content": "How do you go about designing your website?(if you have one) /!/ I know that the site design isn't the most important part, the pictures are, but a good design can make it a yes or no for a client. \n\nMost photography site design seems very minimalist and clean, I guess it make sense after all since you want the photos to be the main focus, not the site itself.\n\nBut how do you plan your design? There's so many options, and its something I get caught in as I progress up the ladder. I'm lazy, I don't want to spend too much time learning web design, so I paid for wix, which fills my needs mostly. Only issue is that the editor, has somewhat limited functionality. The drop down menus are fixed, I can't add additional sub menus to the drop down columns (which irks me) \n\nDo you stick with template web makers like squarespace, or build your own HTMLs? Do you come up with your own idea for a design, or you just stick to the common photography site designs? (Usually either a categories bar by the top or the left hand side)", "link": "https://www.reddit.com/r/photography/comments/9nzlwk/how_do_you_go_about_designing_your_websiteif_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how do you go about designing your website?(if you have one) /!/ i know that the site design isn't the most important part, the pictures are, but a good design can make it a yes or no for a client. \n\nmost photography site design seems very minimalist and clean, i guess it make sense after all since you want the photos to be the main focus, not the site itself.\n\nbut how do you plan your design? there's so many options, and its something i get caught in as i progress up the ladder. i'm lazy, i don't want to spend too much time learning web design, so i paid for wix, which fills my needs mostly. only issue is that the editor, has somewhat limited functionality. the drop down menus are fixed, i can't add additional sub menus to the drop down columns (which irks me) \n\ndo you stick with template web makers like squarespace, or build your own htmls? do you -----> come !!!  -----> up !!!  -----> with !!!  your own idea for a design, or you just stick to the common photography site designs? (usually either a categories bar by the top or the left hand side)", "sortedWord": "None", "Identifyer": null, "identifyer": 24261, "year": "2018"}, {"autor": "grantplace", "date": "2018-12-22 13:29:34", "content": "First time Squarespace Business vs. Basic Commerce plan and selling prints /!/ Hey guys, I’ve had Squarespace before and enjoyed it, but I wasn’t selling prints at the time. I’ve sold about 20-30 so far in the last year via Reddit and Instagram DMing however never had an online store.\n\nSo Squarespace offers one where they take 3% commission for $216/year, or for $312/year, where they don’t take commission. \n\nIt’s a difference of $8/month. I do have the discount code too, but I’m looking at the overall “value” of either plan in the long run. \n\nThe question is should I spend extra to get the higher plan without commission, and then if I’m not selling, “downgrade”... or do the cheaper plan and upgrade if my prints are actually selling? I’m no business man or marketer by any means,  but I’m having a hard time coming up with a break even point.  There’s no guarantee I’ll even sell anything either! Haha. \n\nAny advice would be great! \n\n[@grantplace](http://www.instagram.com/grantplace)  my Instagram here to show you the quality of work/judge if you think I’d sell anything or not. All feedback appreciated! ", "link": "https://www.reddit.com/r/photography/comments/a8kti8/first_time_squarespace_business_vs_basic_commerce/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "first time squarespace business vs. basic commerce plan and selling prints /!/ hey guys, i’ve had squarespace before and enjoyed it, but i wasn’t selling prints at the time. i’ve sold about 20-30 so far in the last year via reddit and instagram dming however never had an online store.\n\nso squarespace offers one where they take 3% commission for $216/year, or for $312/year, where they don’t take commission. \n\nit’s a difference of $8/month. i do have the discount code too, but i’m looking at the overall “value” of either plan in the long run. \n\nthe question is should i spend extra to get the higher plan without commission, and then if i’m not selling, “downgrade”... or do the cheaper plan and upgrade if my prints are actually selling? i’m no business man or marketer by any means,  but i’m having a hard time -----> coming !!!  -----> up !!!  -----> with !!!  a break even point.  there’s no guarantee i’ll even sell anything either! haha. \n\nany advice would be great! \n\n[@grantplace](http://www.instagram.com/grantplace)  my instagram here to show you the quality of work/judge if you think i’d sell anything or not. all feedback appreciated! ", "sortedWord": "None", "Identifyer": null, "identifyer": 25758, "year": "2018"}, {"autor": "almathden", "date": "2018-01-09 20:09:57", "content": "January Print Exchange Update! /!/ Good news, everyone! The print exchange matches are in your inbox! If you haven’t received yours, please PM /u/rphotographyswap and we will look in to it. Thank you for your patience - the response was larger than we had anticipated. The positive is that we have been able to work out a lot of kinks and the following months should be much more seamless.\n\n\n**A little reminder on the rules:**\n\nPlease try and ship the print ASAP. We know there was a bit of a delay this month, but hopefully that doesn’t effect the shipping/arrivals of your prints.\n\nPrints should be at least postcard sized and no larger than a magazine page (ie; A4). Photo selection is up to the sender. \n\nIf your receiver asked that no NSFW images be sent, please respect that and keep it PG.\n\n\n**Some tips for packaging:**\n\nPlace the print in a plastic sleeve.\n\nTape that sleeve to a piece of cardboard and place another piece on the other side (this: a sandwich). \n\nPlace the sandwiched print into a bubble or padded envelope. \n\nWrite “DO NOT BEND” on the outside.\n\n**You have the option to send via a printer in the destination country. [A wiki of online printers around the world](https://www.reddit.com/r/photography/wiki/index#wiki_reputable_photo_printers_across_the_world).**\n\n\n**Sign ups for next month.** Please sign up via [this form](https://goo.gl/forms/o0aJ9feBahMLSJru1). If you are participating in the current exchange, **you still need to sign up via this form - for this month only.** After this sign-up, you will no longer need to sign-up each month. If you wish to stop participating, just PM /u/rphotographyswap, /u/clondon, or /u/literally_alliterate and we will remove you from the list. \n\n\nThank you all for the enthusiasm for this project! We are looking forward to seeing what everyone comes up with!", "link": "https://www.reddit.com/r/photography/comments/7p9uef/january_print_exchange_update/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "january print exchange update! /!/ good news, everyone! the print exchange matches are in your inbox! if you haven’t received yours, please pm /u/rphotographyswap and we will look in to it. thank you for your patience - the response was larger than we had anticipated. the positive is that we have been able to work out a lot of kinks and the following months should be much more seamless.\n\n\n**a little reminder on the rules:**\n\nplease try and ship the print asap. we know there was a bit of a delay this month, but hopefully that doesn’t effect the shipping/arrivals of your prints.\n\nprints should be at least postcard sized and no larger than a magazine page (ie; a4). photo selection is up to the sender. \n\nif your receiver asked that no nsfw images be sent, please respect that and keep it pg.\n\n\n**some tips for packaging:**\n\nplace the print in a plastic sleeve.\n\ntape that sleeve to a piece of cardboard and place another piece on the other side (this: a sandwich). \n\nplace the sandwiched print into a bubble or padded envelope. \n\nwrite “do not bend” on the outside.\n\n**you have the option to send via a printer in the destination country. [a wiki of online printers around the world](https://www.reddit.com/r/photography/wiki/index#wiki_reputable_photo_printers_across_the_world).**\n\n\n**sign ups for next month.** please sign up via [this form](https://goo.gl/forms/o0aj9febahmlsjru1). if you are participating in the current exchange, **you still need to sign up via this form - for this month only.** after this sign-up, you will no longer need to sign-up each month. if you wish to stop participating, just pm /u/rphotographyswap, /u/clondon, or /u/literally_alliterate and we will remove you from the list. \n\n\nthank you all for the enthusiasm for this project! we are looking forward to seeing what everyone -----> comes !!!  -----> up !!!  -----> with !!! !", "sortedWord": "None", "Identifyer": null, "identifyer": 26150, "year": "2018"}, {"autor": "abphotos", "date": "2018-01-12 03:08:42", "content": "Making Locations Work For You /!/ I wrote this on my website a few months ago, and thought it might be worth reposting here if it helps some new starters in portrait photography. This is basically around how I organise and plan my on-location shoots so that I can work to a location’s strengths and ensure a successful shoot, as well as some example locations that are publicly accessible around my hometown, Sydney. This advice isn't for large commercial teams or projects - those will usually need permits. But if you’re shooting light for creative/portfolio development, this advice may be right up your alley.\n\n\nI have to be quite flexible with the location for my shoots. I select a location based on one or more of the following factors: Shoot Style, Time of Day &amp; Geographical Area.\n\n\n**Shoot Style**\n\nThe style of shoot can be your biggest factor when selecting a location. This can include shooting for swim, street, activewear, or simply knowing you have to shoot at a particular location by request. If you’re lucky though, you have creative control to influence this in some way. For example, swimwear may look just as good at a garden, beach house or pool and doesn’t require a beach in sight. The more creative you are with your locations, the more interesting and novel your shoots could be.\n\n\nRecognise the strengths of different location types and adjust your shoot to take advantage of them. Keep a shortlist of locations that have worked for you so you’re not starting from scratch for every shoot, which can be hard. I save my locations on Google Maps so I can review them when looking at the area I might look to shoot in. This is a godsend for me.\n\n\n**Time of Day**\n\nThis to me is the factor with the biggest impact on the look of your photos. When you don’t have time to scout locations (and I don’t), you can instead rely on a couple of great tools: Google Maps and [Suncalc](http://suncalc.net/). Suncalc overlays itself on Google Maps and shows you the arc of the sun throughout any day. It will give you a pretty good idea of where the sun will be, and based on the type of location you can use this to decide whether it’s appropriate for your aesthetic.\n\n\nFor example, shooting a late afternoon session on an east-facing beach will probably see you plunged into darkness well before sunset as the buildings cast a shadow over the whole beach. Using suncalc can instead help you find locations that might be facing more towards the sun and therefore get you more time to shoot (I use Vaucluse a lot for late afternoon shoots). Personally my favourite times of day are during sunrise and sunset so that I can get more interesting natural light punching through the shot, but that's just my style. When it comes to shooting inland, streetview and community-submitted photos are also your friend because buildings and elevation can limit the type of light you’ll have and viewing the street imagery will help you see what you’re in for.\n\n\nThere’s also a case to be made about shooting indoors - if you’re lucky enough to have a place offered. I’ve done a number of shoots in apartments and used the furnishings and decorations to modify the light and create some really great scenes. \n\n\nIf I’m shooting when the sun is high in the sky, I look for man-made structures that can give me more interesting backgrounds, but can also shield myself and the model from the sun - or even act as a reflector to provide more even light. Fortunately the more limited you are the more creative you have to be. If you're struggling to find structures to help you, instead adjust poses to make use of the light. Embrace the harsh lighting! Focus instead on the leading lines, the shadows and the overall mood of the day that you and your model have control of.\n\n\n**Geographical Area**\n\nYou’ll also have to address the location types available to you. If you live on the coast, you may have access to heaps of great beaches. If you live inland, not so much - but perhaps you can find a lake, lagoon, or pool if you need water. If you live in mountains and pick your time of day appropriately, you’ll get some stunning images. I am fortunate to live in Sydney and have access to some of the greatest beach locations, but you’ll find a lot of my work is shot all over Sydney or parkland a few hours out. Sometimes I just shoot down an alley. Check out your local tennis/basketball courts and book a slot when it’s not busy. Use the colours and lines to your advantage.\n\n\nIt’s easy to think you’re limited by only having access to public spaces for shoots. But then I remember how I wouldn’t have come up with a lot of the lighting, backdrops and poses without being challenged in the first place. Think critically about your surroundings - what types of public spaces are there? What about alleyways, or interesting homes? Rooftops, backyards, even carparks can all allow you to be creative and produce something amazing. Locations that I’ve struggled with the most have yielded some of my favourite photos due to the unusual angles, lighting and backdrops that resulted from it.\n\n\n\n**TLDR:** Use Google Maps and [Suncalc](http://suncalc.net/).", "link": "https://www.reddit.com/r/photography/comments/7ptpdu/making_locations_work_for_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "making locations work for you /!/ i wrote this on my website a few months ago, and thought it might be worth reposting here if it helps some new starters in portrait photography. this is basically around how i organise and plan my on-location shoots so that i can work to a location’s strengths and ensure a successful shoot, as well as some example locations that are publicly accessible around my hometown, sydney. this advice isn't for large commercial teams or projects - those will usually need permits. but if you’re shooting light for creative/portfolio development, this advice may be right up your alley.\n\n\ni have to be quite flexible with the location for my shoots. i select a location based on one or more of the following factors: shoot style, time of day &amp; geographical area.\n\n\n**shoot style**\n\nthe style of shoot can be your biggest factor when selecting a location. this can include shooting for swim, street, activewear, or simply knowing you have to shoot at a particular location by request. if you’re lucky though, you have creative control to influence this in some way. for example, swimwear may look just as good at a garden, beach house or pool and doesn’t require a beach in sight. the more creative you are with your locations, the more interesting and novel your shoots could be.\n\n\nrecognise the strengths of different location types and adjust your shoot to take advantage of them. keep a shortlist of locations that have worked for you so you’re not starting from scratch for every shoot, which can be hard. i save my locations on google maps so i can review them when looking at the area i might look to shoot in. this is a godsend for me.\n\n\n**time of day**\n\nthis to me is the factor with the biggest impact on the look of your photos. when you don’t have time to scout locations (and i don’t), you can instead rely on a couple of great tools: google maps and [suncalc](http://suncalc.net/). suncalc overlays itself on google maps and shows you the arc of the sun throughout any day. it will give you a pretty good idea of where the sun will be, and based on the type of location you can use this to decide whether it’s appropriate for your aesthetic.\n\n\nfor example, shooting a late afternoon session on an east-facing beach will probably see you plunged into darkness well before sunset as the buildings cast a shadow over the whole beach. using suncalc can instead help you find locations that might be facing more towards the sun and therefore get you more time to shoot (i use vaucluse a lot for late afternoon shoots). personally my favourite times of day are during sunrise and sunset so that i can get more interesting natural light punching through the shot, but that's just my style. when it comes to shooting inland, streetview and community-submitted photos are also your friend because buildings and elevation can limit the type of light you’ll have and viewing the street imagery will help you see what you’re in for.\n\n\nthere’s also a case to be made about shooting indoors - if you’re lucky enough to have a place offered. i’ve done a number of shoots in apartments and used the furnishings and decorations to modify the light and create some really great scenes. \n\n\nif i’m shooting when the sun is high in the sky, i look for man-made structures that can give me more interesting backgrounds, but can also shield myself and the model from the sun - or even act as a reflector to provide more even light. fortunately the more limited you are the more creative you have to be. if you're struggling to find structures to help you, instead adjust poses to make use of the light. embrace the harsh lighting! focus instead on the leading lines, the shadows and the overall mood of the day that you and your model have control of.\n\n\n**geographical area**\n\nyou’ll also have to address the location types available to you. if you live on the coast, you may have access to heaps of great beaches. if you live inland, not so much - but perhaps you can find a lake, lagoon, or pool if you need water. if you live in mountains and pick your time of day appropriately, you’ll get some stunning images. i am fortunate to live in sydney and have access to some of the greatest beach locations, but you’ll find a lot of my work is shot all over sydney or parkland a few hours out. sometimes i just shoot down an alley. check out your local tennis/basketball courts and book a slot when it’s not busy. use the colours and lines to your advantage.\n\n\nit’s easy to think you’re limited by only having access to public spaces for shoots. but then i remember how i wouldn’t have -----> come !!!  -----> up !!!  -----> with !!!  a lot of the lighting, backdrops and poses without being challenged in the first place. think critically about your surroundings - what types of public spaces are there? what about alleyways, or interesting homes? rooftops, backyards, even carparks can all allow you to be creative and produce something amazing. locations that i’ve struggled with the most have yielded some of my favourite photos due to the unusual angles, lighting and backdrops that resulted from it.\n\n\n\n**tldr:** use google maps and [suncalc](http://suncalc.net/).", "sortedWord": "None", "Identifyer": null, "identifyer": 26337, "year": "2018"}, {"autor": "nicehulk", "date": "2018-06-07 15:22:25", "content": "Help me come up with a fun activity for a photo course! /!/ I teach photography courses and have recently been doing one specifically aimed at people on parental leave. Yes, that means they've been bringing their babies with them and yes, it's been a challenge :)\n\nMy employer was contacted by a team who are making a documentary about these types of courses. So the participants have been offered an extra lesson for free where the documentary team will film us. Now I need to come up with what to do during that lesson.\n\nThe lesson is 2 hours long and we've had 4 previous lessons. In the previous lessons we have covered:\n\n* Aperture, depth of field\n* Shutter speed, motion blur\n* ISO, noise\n* Combine all that into the manual mode\n* A tiny bit on composition, mainly the rule of thirds\n* White balance\n* Introduction to light: hard, soft, backlight\n* How to select only good photos\n* Basic raw editing\n\nMost of them were complete beginners when we started but I am impressed by how much they have learned. I was thinking about teaching some basics into portrait photography, maybe a little more on composition, but I would love some ideas from you! I was also thinking it would be fun to do some activity, like [Create your own bokeh](https://www.diyphotography.net/diy_create_your_own_bokeh/) or something that will be fun for the documentary team to film. We did light painting which everyone enjoyed. Do you have any other suggestions?\n\nThanks in advance!\n\ntl/dr: I want suggestions on subjects and activities for a photo course. The participants know the basics and will bring their babies!", "link": "https://www.reddit.com/r/photography/comments/8pb5x3/help_me_come_up_with_a_fun_activity_for_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "help me -----> come !!!  -----> up !!!  -----> with !!!  a fun activity for a photo course! /!/ i teach photography courses and have recently been doing one specifically aimed at people on parental leave. yes, that means they've been bringing their babies with them and yes, it's been a challenge :)\n\nmy employer was contacted by a team who are making a documentary about these types of courses. so the participants have been offered an extra lesson for free where the documentary team will film us. now i need to come up with what to do during that lesson.\n\nthe lesson is 2 hours long and we've had 4 previous lessons. in the previous lessons we have covered:\n\n* aperture, depth of field\n* shutter speed, motion blur\n* iso, noise\n* combine all that into the manual mode\n* a tiny bit on composition, mainly the rule of thirds\n* white balance\n* introduction to light: hard, soft, backlight\n* how to select only good photos\n* basic raw editing\n\nmost of them were complete beginners when we started but i am impressed by how much they have learned. i was thinking about teaching some basics into portrait photography, maybe a little more on composition, but i would love some ideas from you! i was also thinking it would be fun to do some activity, like [create your own bokeh](https://www.diyphotography.net/diy_create_your_own_bokeh/) or something that will be fun for the documentary team to film. we did light painting which everyone enjoyed. do you have any other suggestions?\n\nthanks in advance!\n\ntl/dr: i want suggestions on subjects and activities for a photo course. the participants know the basics and will bring their babies!", "sortedWord": "None", "Identifyer": null, "identifyer": 29157, "year": "2018"}, {"autor": "sherunsthegamut", "date": "2018-07-01 23:46:14", "content": "Pastry Chef taking on the role of in-house photographer. I need advice on what would be fair compensation for my work. /!/ Hi there, I am looking for some advice. I am a pastry chef at well-known bakery that has 3 locations in town and getting ready to open a forth in another town an hour away. I've been a chef for over ten years and over the past five I have picked up photography as a hobby. I've been working at this bakery for about a year now and have recently started bring my dslr into work with me. The owners of the bakery love my photos and want to start paying me monthly to be their in-house photographer. The bakery is owned by a couple (who are chefs) and a guy (who is the moneyman). The couple told me mr. moneyman wants to pay me only $500 money to be their photographer and want me to ask for more. This would be my first paid photography gig and would be on top of my already full time job as a pastry chef. I have a meeting tomorrow with mr. moneyman to discuss the details. I don't want to come across as a complete ding-dong in this meeting. What would be a reasonable amount to ask for? I would be regularly traveling to the 4 locations to stage/take photos. I'd basically be reasonable for coming up with and providing content for their social media platforms. Any help and insight y'all could give would be wonderful. Thanks!", "link": "https://www.reddit.com/r/photography/comments/8ve53n/pastry_chef_taking_on_the_role_of_inhouse/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "pastry chef taking on the role of in-house photographer. i need advice on what would be fair compensation for my work. /!/ hi there, i am looking for some advice. i am a pastry chef at well-known bakery that has 3 locations in town and getting ready to open a forth in another town an hour away. i've been a chef for over ten years and over the past five i have picked up photography as a hobby. i've been working at this bakery for about a year now and have recently started bring my dslr into work with me. the owners of the bakery love my photos and want to start paying me monthly to be their in-house photographer. the bakery is owned by a couple (who are chefs) and a guy (who is the moneyman). the couple told me mr. moneyman wants to pay me only $500 money to be their photographer and want me to ask for more. this would be my first paid photography gig and would be on top of my already full time job as a pastry chef. i have a meeting tomorrow with mr. moneyman to discuss the details. i don't want to come across as a complete ding-dong in this meeting. what would be a reasonable amount to ask for? i would be regularly traveling to the 4 locations to stage/take photos. i'd basically be reasonable for -----> coming !!!  -----> up !!!  -----> with !!!  and providing content for their social media platforms. any help and insight y'all could give would be wonderful. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 29822, "year": "2018"}, {"autor": "3ster101", "date": "2018-07-06 03:35:08", "content": "HELP ME COME UP WITH A SLOGAN /!/ Hi! I need a slogan for my freelance photography called Emie Wonders Photography. Something appropriate and catchy! ", "link": "https://www.reddit.com/r/photography/comments/8wgu1z/help_me_come_up_with_a_slogan/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "help me -----> come !!!  -----> up !!!  -----> with !!!  a slogan /!/ hi! i need a slogan for my freelance photography called emie wonders photography. something appropriate and catchy! ", "sortedWord": "None", "Identifyer": null, "identifyer": 29860, "year": "2018"}, {"autor": "BreitlingB01", "date": "2018-07-28 01:00:06", "content": "Question about a Camera /!/ I'm quite sorry if this is the wrong way going about asking this question, but here it goes:\n\nI'm brand-new to this hobby. It interests me and I'm not quite sure how far I want to take it. \n\nI've done some research and have come up with two different cameras at different price points that I'm kind of in between. \n\nI saw the YI M1 that has a rather nice price point, but mixed reviews, and the Olympus Pen F which has decent reviews. (45mm f1.8 for the M1, and 25mm f1.8 for the Pen F).\n\nAs a gear whore, I'm into taking pictures of my guns and knives and other EDC gear, so I've been looking at upping my photo game, from what I've found I think a f1.8 would be best.\n\nAm I even correct in think this is the type of lens used for these up close shots of items? \n\nAnd should I just bite the bullet and get the Pen F or is the M1 going to take quality photos/comparable photos to that of the Pen F?\n\nThank you for reading this drawn out post.", "link": "https://www.reddit.com/r/photography/comments/92i4sr/question_about_a_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "question about a camera /!/ i'm quite sorry if this is the wrong way going about asking this question, but here it goes:\n\ni'm brand-new to this hobby. it interests me and i'm not quite sure how far i want to take it. \n\ni've done some research and have -----> come !!!  -----> up !!!  -----> with !!!  two different cameras at different price points that i'm kind of in between. \n\ni saw the yi m1 that has a rather nice price point, but mixed reviews, and the olympus pen f which has decent reviews. (45mm f1.8 for the m1, and 25mm f1.8 for the pen f).\n\nas a gear whore, i'm into taking pictures of my guns and knives and other edc gear, so i've been looking at upping my photo game, from what i've found i think a f1.8 would be best.\n\nam i even correct in think this is the type of lens used for these up close shots of items? \n\nand should i just bite the bullet and get the pen f or is the m1 going to take quality photos/comparable photos to that of the pen f?\n\nthank you for reading this drawn out post.", "sortedWord": "None", "Identifyer": null, "identifyer": 30175, "year": "2018"}, {"autor": "alextorres203", "date": "2018-08-26 02:44:09", "content": "HELP ME COME UP WITH PHOTOGRAPHY BUSINESS NAME /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9acfa8/help_me_come_up_with_photography_business_name/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "help me -----> come !!!  -----> up !!!  -----> with !!!  photography business name /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 31192, "year": "2018"}, {"autor": "pinionist", "date": "2018-08-29 15:15:52", "content": "Sony came up with a truly inventive name for its new tough SD card series", "link": "https://www.reddit.com/r/photography/comments/9ba642/sony_came_up_with_a_truly_inventive_name_for_its/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "sony -----> came !!!  -----> up !!!  -----> with !!!  a truly inventive name for its new tough sd card series", "sortedWord": "None", "Identifyer": null, "identifyer": 31273, "year": "2018"}, {"autor": "IPlayRaunchyMusic", "date": "2018-08-29 02:24:34", "content": "XQD versus SD Cards: Reliability /!/ I don't want to start another one of many screaming matches on the web right now about Nikon's decision to include just one card slot (XQD) into the new Z series cameras, but I do want to have a discussion centered around one thing - reliability. \n\nWhat I keep seeing is the classic  \"pros won't go for these cameras because writing backups (like I do when shooting weddings) is too important\" , and \"to not have it  for special events when there are options out there that do include two card slots is basically just negligent.\" \n\n&amp;#x200B;\n\nI get this. I agree, mostly. So if we're going to go that route, can we talk about the XQD card? Because that's the reality. This is what Nikon has chosen to move forward with for mirrorless and we will have to deal with it. I've been shooting with my Lexar XQD on my D500 since the day the camera released. I don't want to have an argument about cost, or speed versus another card type - I just want to know, have any of you had an XQD card fail? Have any of you had a bad experience with an XQD card ever? I'm trying to find information or posts out there about this and if I had to go by my internet searching, I would conclude that the XQD never fails (I know that's not true, but I'm having an incredibly hard time finding personal testament in opposition of XQD reliability). \n\n&amp;#x200B;\n\nSo, tell me your horror stories. Has an XQD card failed for you? How? Lets hear it. \n\nBonus points if you can link me some articles and drop some controlled testing results on me or something. \n\nI've had a couple SD cards fail on me in my 8 years of shooting, but in my last 2+ with the D500, not a single problem has come up with the one XQD card I have (50,000 shutter actuations attributed to that card)\n\n&amp;#x200B;\n\nBe nice.", "link": "https://www.reddit.com/r/photography/comments/9b5a0e/xqd_versus_sd_cards_reliability/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "xqd versus sd cards: reliability /!/ i don't want to start another one of many screaming matches on the web right now about nikon's decision to include just one card slot (xqd) into the new z series cameras, but i do want to have a discussion centered around one thing - reliability. \n\nwhat i keep seeing is the classic  \"pros won't go for these cameras because writing backups (like i do when shooting weddings) is too important\" , and \"to not have it  for special events when there are options out there that do include two card slots is basically just negligent.\" \n\n&amp;#x200b;\n\ni get this. i agree, mostly. so if we're going to go that route, can we talk about the xqd card? because that's the reality. this is what nikon has chosen to move forward with for mirrorless and we will have to deal with it. i've been shooting with my lexar xqd on my d500 since the day the camera released. i don't want to have an argument about cost, or speed versus another card type - i just want to know, have any of you had an xqd card fail? have any of you had a bad experience with an xqd card ever? i'm trying to find information or posts out there about this and if i had to go by my internet searching, i would conclude that the xqd never fails (i know that's not true, but i'm having an incredibly hard time finding personal testament in opposition of xqd reliability). \n\n&amp;#x200b;\n\nso, tell me your horror stories. has an xqd card failed for you? how? lets hear it. \n\nbonus points if you can link me some articles and drop some controlled testing results on me or something. \n\ni've had a couple sd cards fail on me in my 8 years of shooting, but in my last 2+ -----> with !!!  the d500, not a single problem has -----> come !!!  -----> up !!!  -----> with !!!  the one xqd card i have (50,000 shutter actuations attributed to that card)\n\n&amp;#x200b;\n\nbe nice.", "sortedWord": "None", "Identifyer": null, "identifyer": 31321, "year": "2018"}, {"autor": "stopbeingmeanman", "date": "2018-10-23 13:26:39", "content": "Good amateur photography account name?? /!/ I've been taking pictures for over 4 years now and have been wanting to create a photography Instagram to post them on for ages. I just can't come up with a good name, I don't want it to include my name but just a catchy name that sounds good, can anyone help me out? Thank you! ", "link": "https://www.reddit.com/r/photography/comments/9qoy4c/good_amateur_photography_account_name/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "good amateur photography account name?? /!/ i've been taking pictures for over 4 years now and have been wanting to create a photography instagram to post them on for ages. i just can't -----> come !!!  -----> up !!!  -----> with !!!  a good name, i don't want it to include my name but just a catchy name that sounds good, can anyone help me out? thank you! ", "sortedWord": "None", "Identifyer": null, "identifyer": 32895, "year": "2018"}, {"autor": "Thedirtyjersey", "date": "2018-12-02 20:13:18", "content": "Battery status stickers? /!/ Felt like I've seen this item before but for the life of me can't find it on Amazon or google, the terms jsut come up with unrelated items.\n\n&amp;#x200B;\n\nIs there a two way sticker that has some kind of sliding mechanism, I'm thinking a thin plastic sleeve with red or green on each side that you can slide an inserted paper/plastic tab from one end to the another? That way you can track your dead batteries easier when burning through a few on a job etc or are rushed. ", "link": "https://www.reddit.com/r/photography/comments/a2grak/battery_status_stickers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "battery status stickers? /!/ felt like i've seen this item before but for the life of me can't find it on amazon or google, the terms jsut -----> come !!!  -----> up !!!  -----> with !!!  unrelated items.\n\n&amp;#x200b;\n\nis there a two way sticker that has some kind of sliding mechanism, i'm thinking a thin plastic sleeve with red or green on each side that you can slide an inserted paper/plastic tab from one end to the another? that way you can track your dead batteries easier when burning through a few on a job etc or are rushed. ", "sortedWord": "None", "Identifyer": null, "identifyer": 33556, "year": "2018"}, {"autor": "Elmer_adkins", "date": "2018-12-15 06:12:16", "content": "Does anyone have any photo books of/by Robert Frank, John Cohen, Henri Cartier-Bresson or similar photographers? /!/ I wanna do a trade. r/bookexchange came up with nothing. ", "link": "https://www.reddit.com/r/photography/comments/a6cygg/does_anyone_have_any_photo_books_ofby_robert/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "does anyone have any photo books of/by robert frank, john cohen, henri cartier-bresson or similar photographers? /!/ i wanna do a trade. r/bookexchange -----> came !!!  -----> up !!!  -----> with !!!  nothing. ", "sortedWord": "None", "Identifyer": null, "identifyer": 34021, "year": "2018"}, {"autor": "littlegreenfish", "date": "2018-07-01 21:11:26", "content": "Your opinion of my website. Is it good enough? /!/ Hey Everyone. \n\nI recently started out on wordpress and have come up with a semi-decent layout. I really don't know if my web design actually works or if the content is adequate to pass as pro. I have spoken to local photographers who provide workshops and I've received very minimal feedback. I'm not sure if it has anything to do with competition? Whatever it is, I have moved away from it and have now turned to Reddit to seek erudite. \n\nI would absolutely LOVE to hear your feedback about my website from a professional viewpoint. What's missing? What do I need? What should I exclude? Does it look appealing and professional?\n\nIf this was your website, what will you change?  Can you suggest a better wp theme (Currently using Salient)\n\nMY WEBSITE - [http://www.imagecore.co.za](http://www.imagecore.co.za) \n\nYou have no idea how much your opinion (good OR bad) , means to me. If anything, I want to grow and develop myself and my brand into something I'm proud of.  So, THANK YOU! ", "link": "https://www.reddit.com/r/photography/comments/8vd44i/your_opinion_of_my_website_is_it_good_enough/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "your opinion of my website. is it good enough? /!/ hey everyone. \n\ni recently started out on wordpress and have -----> come !!!  -----> up !!!  -----> with !!!  a semi-decent layout. i really don't know if my web design actually works or if the content is adequate to pass as pro. i have spoken to local photographers who provide workshops and i've received very minimal feedback. i'm not sure if it has anything to do with competition? whatever it is, i have moved away from it and have now turned to reddit to seek erudite. \n\ni would absolutely love to hear your feedback about my website from a professional viewpoint. what's missing? what do i need? what should i exclude? does it look appealing and professional?\n\nif this was your website, what will you change?  can you suggest a better wp theme (currently using salient)\n\nmy website - [http://www.imagecore.co.za](http://www.imagecore.co.za) \n\nyou have no idea how much your opinion (good or bad) , means to me. if anything, i want to grow and develop myself and my brand into something i'm proud of.  so, thank you! ", "sortedWord": "None", "Identifyer": null, "identifyer": 35622, "year": "2018"}, {"autor": "adore17", "date": "2018-08-28 07:26:12", "content": "Capture and Freeze Your Special Moment: Instant Cameras and Photo Printers for Shutterbugs /!/  With the craze of smartphone photography and digital cameras, physical photos seem like relics of the past and instant camera obsolete in almost every way. Yet not everything we leave behind is worth abandoning. There is just an undeniable charm and whimsy to pressing the shutter button and watching an image develop right before your very eyes. Yes, film isn't just for old fogies and nostalgists. Lots of people enjoy snapping shots with a modern-day instant camera, as the compact and lightweight gadget hook up easily to your camera and deliver results that almost match digital in their immediacy.\n\nFrom selfies to Sunday brunch, there's always a reason to celebrate with these instant film cameras and printers.\n\n**✎Instant Camera**\n\n**Polaroid Snap Instant Digital Camera**\n\nPolaroid has filed for bankruptcy and sold off its name to a holding company, which also went bankrupt long ago. In 2017, the brand and intellectual property of the Polaroid corporation were acquired by the largest shareholder of the Impossible Project, which had originally started out by producing new instant films for Polaroid cameras and was renamed Polaroid Originals in September 2017. Thus, Polaroid's masterpiece, the instant camera, is still with us.\n\nhttps://i.redd.it/cqs2j1lycsi11.png\n\nThis is the camera that make instantaneous printouts to hold, clip and paste. This conveniently compact camera fits in your pocket and requires no messy inks or expensive toners. Users don't need to fiddle with a flash or focus the lens; just look through the pop-up viewfinder and click and out pops an adorable 2\"x 3\"sticky-backed picture ready to share with friends and family. Zink Zero Ink technology also helps save you a ton of money while keeping your memories alive. The 10-megapixel sensor captures millions of colors and tons of detail, while unique picture modes offer a variety of tones and filters to suit your mood. You can even add a 32-GB microSD card to save shots for social media or additional printing. However, the photo quality is not as good as that of a decent phone camera.             \n\n**Instax Square SQ6**\n\nThis is a square format as a new addition to the instax series of instant camera lineup, allows users to enjoy on-the-spot photo printing. It is equipped with various features: with auto exposure control, the camera detects the ambient brightness and adjusts to provide the optimum shutter speed and flash light intensity, even in low light conditions. Three color filters that fit over the flash in orange, purple and green are included to add a pop of color to the images. Additionally, the camera can be set to a selfie mode which automatically adjusts focus and brightness. There is also a self-shot mirror attached to the side of the lens allowing you to check the shooting range.\n\nhttps://i.redd.it/8xhlfjb0dsi11.png\n\nBesides, SQ6 offers three unique modes, you can press the Mode button on the back of the camera which you can choose between: the double exposure mode allows two photos to be overlapped on a single film when the shutter button is pressed twice; the macro mode allows users to capture beautiful close-up images of subjects up to a minimum of 30cm and the landscape mode can be used to capture long-range impressive scenic photos.\n\n**LG PC389S**\n\nThe LG Pocket Photo PC389S Instant Camera comes with a built-in printer. It uses dye-sublimation printing technology to output vibrant, high-quality prints onto 2.5 x 3.7\" adhesive-backed paper in around 45 seconds. The PC389S shoots photos with pixel perfection as well. Each image encapsulates five million pixels of crisp detail to give a clear image with a radiant and full color spectrum.\n\nhttps://i.redd.it/5qbrhhh1dsi11.png\n\nLG's Pocket Photo App, available for iOS and Android, allows for image corrections to be made in addition to adding custom filters, decorations, and frames to your final photos. Connect the phone to your camera via Bluetooth or USB, and you're ready to print out your favorite pictures.\n\n**✎Pocket Photo Printer**\n\n**Fujifilm SP-2 Instax Share**\n\nIf you like the look of an old-school, tangible print but still want to keep shooting with your smartphone, the Fujifilm Instax Share SP-2 is the best instant printer available.\n\nAccording to Fujifilm, the new SP-2 is faster, quieter, has better image quality, and a greatly improved Wi-Fi connection over the SP-1. The SP-2 has also a completely new design, featuring a silver or gold body with a sleek white casing and an internal rechargeable battery. \n\nhttps://i.redd.it/snevjpj2dsi11.png\n\nYou can easily connect your phone to the printer via Wi-Fi and share access to your library of images with the free Instax Share app, which you can then use to do some minor editing and add a filter or a custom border. Thanks to a new laser exposure system, the new SP-2 's high-resolution 320 dpi print will be ready in just 10 seconds. So not only does it print faster, the pictures are a lot better as well. As for image files, the printer supports JPEG and PNG formats.\n\n**HP Sprocket 100**\n\nThe HP Sprocket is tiny and has a tiny output as well: the paper tray holds just 10 sheets, and the machine can only produce wallet-size, 2 x 3\" photos. This is because it uses the zero-ink technology, which uses heat-activated paper instead of ink or dye sublimation. Zink doesn't produce the most detailed prints and some of the colors appeared washed out. However, the look of these filtered colors may appeal to you.\n\nhttps://i.redd.it/fzd59sq3dsi11.png\n\nFor a novelty printer, printing off social media photos has never been easier from your smartphone. Connect your social media accounts to the free-to-download HP Sprocket App and instantly turn those photos into colorful prints. You can customize your photos before you print with the HP Sprocket App to add fun text, borders, emojis, and more. Add a pop of personality for snapshots and stickers that are totally and uniquely you. \n\nI liked the HP Sprocket's simplicity and fun design, even if it's tough to come up with practical reasons for having it around.\n\n**✎Wireless Compact Photo Printer**\n\n**Canon SELPHY CP1300**\n\nWith SELPHY CP1300, Canon added another option to the battery-powered portable mini-printers market segment. With this lightweight, mobile and Wi-Fi-enabled printer, sharing memories in real-time can be quite easy.\n\nhttps://i.redd.it/5zl54q95dsi11.png\n\nThe Selphy CP1300 is a wireless printer: it comes with a larger 3.2\" tiltable LCD display, an improved user interface, improved image search with a date filter, the ability to print 2 x 6\" photo strips and a Party Shuffle mode that is designed to allow Wi-Fi connected users to connect multiple compatible mobile devices to the same printer and create a print layout made by combining images from everyone. The printer also offers the option to connect an external battery, making it that much more portable.\n\nIf you want to see more product reviews at [here](https://www.valueq.com/).", "link": "https://www.reddit.com/r/photography/comments/9awutk/capture_and_freeze_your_special_moment_instant/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "capture and freeze your special moment: instant cameras and photo printers for shutterbugs /!/  with the craze of smartphone photography and digital cameras, physical photos seem like relics of the past and instant camera obsolete in almost every way. yet not everything we leave behind is worth abandoning. there is just an undeniable charm and whimsy to pressing the shutter button and watching an image develop right before your very eyes. yes, film isn't just for old fogies and nostalgists. lots of people enjoy snapping shots with a modern-day instant camera, as the compact and lightweight gadget hook up easily to your camera and deliver results that almost match digital in their immediacy.\n\nfrom selfies to sunday brunch, there's always a reason to celebrate with these instant film cameras and printers.\n\n**✎instant camera**\n\n**polaroid snap instant digital camera**\n\npolaroid has filed for bankruptcy and sold off its name to a holding company, which also went bankrupt long ago. in 2017, the brand and intellectual property of the polaroid corporation were acquired by the largest shareholder of the impossible project, which had originally started out by producing new instant films for polaroid cameras and was renamed polaroid originals in september 2017. thus, polaroid's masterpiece, the instant camera, is still with us.\n\nhttps://i.redd.it/cqs2j1lycsi11.png\n\nthis is the camera that make instantaneous printouts to hold, clip and paste. this conveniently compact camera fits in your pocket and requires no messy inks or expensive toners. users don't need to fiddle with a flash or focus the lens; just look through the pop-up viewfinder and click and out pops an adorable 2\"x 3\"sticky-backed picture ready to share with friends and family. zink zero ink technology also helps save you a ton of money while keeping your memories alive. the 10-megapixel sensor captures millions of colors and tons of detail, while unique picture modes offer a variety of tones and filters to suit your mood. you can even add a 32-gb microsd card to save shots for social media or additional printing. however, the photo quality is not as good as that of a decent phone camera.             \n\n**instax square sq6**\n\nthis is a square format as a new addition to the instax series of instant camera lineup, allows users to enjoy on-the-spot photo printing. it is equipped with various features: with auto exposure control, the camera detects the ambient brightness and adjusts to provide the optimum shutter speed and flash light intensity, even in low light conditions. three color filters that fit over the flash in orange, purple and green are included to add a pop of color to the images. additionally, the camera can be set to a selfie mode which automatically adjusts focus and brightness. there is also a self-shot mirror attached to the side of the lens allowing you to check the shooting range.\n\nhttps://i.redd.it/8xhlfjb0dsi11.png\n\nbesides, sq6 offers three unique modes, you can press the mode button on the back of the camera which you can choose between: the double exposure mode allows two photos to be overlapped on a single film when the shutter button is pressed twice; the macro mode allows users to capture beautiful close-up images of subjects up to a minimum of 30cm and the landscape mode can be used to capture long-range impressive scenic photos.\n\n**lg pc389s**\n\nthe lg pocket photo pc389s instant camera comes with a built-in printer. it uses dye-sublimation printing technology to output vibrant, high-quality prints onto 2.5 x 3.7\" adhesive-backed paper in around 45 seconds. the pc389s shoots photos with pixel perfection as well. each image encapsulates five million pixels of crisp detail to give a clear image with a radiant and full color spectrum.\n\nhttps://i.redd.it/5qbrhhh1dsi11.png\n\nlg's pocket photo app, available for ios and android, allows for image corrections to be made in addition to adding custom filters, decorations, and frames to your final photos. connect the phone to your camera via bluetooth or usb, and you're ready to print out your favorite pictures.\n\n**✎pocket photo printer**\n\n**fujifilm sp-2 instax share**\n\nif you like the look of an old-school, tangible print but still want to keep shooting with your smartphone, the fujifilm instax share sp-2 is the best instant printer available.\n\naccording to fujifilm, the new sp-2 is faster, quieter, has better image quality, and a greatly improved wi-fi connection over the sp-1. the sp-2 has also a completely new design, featuring a silver or gold body with a sleek white casing and an internal rechargeable battery. \n\nhttps://i.redd.it/snevjpj2dsi11.png\n\nyou can easily connect your phone to the printer via wi-fi and share access to your library of images with the free instax share app, which you can then use to do some minor editing and add a filter or a custom border. thanks to a new laser exposure system, the new sp-2 's high-resolution 320 dpi print will be ready in just 10 seconds. so not only does it print faster, the pictures are a lot better as well. as for image files, the printer supports jpeg and png formats.\n\n**hp sprocket 100**\n\nthe hp sprocket is tiny and has a tiny output as well: the paper tray holds just 10 sheets, and the machine can only produce wallet-size, 2 x 3\" photos. this is because it uses the zero-ink technology, which uses heat-activated paper instead of ink or dye sublimation. zink doesn't produce the most detailed prints and some of the colors appeared washed out. however, the look of these filtered colors may appeal to you.\n\nhttps://i.redd.it/fzd59sq3dsi11.png\n\nfor a novelty printer, printing off social media photos has never been easier from your smartphone. connect your social media accounts to the free-to-download hp sprocket app and instantly turn those photos into colorful prints. you can customize your photos before you print with the hp sprocket app to add fun text, borders, emojis, and more. add a pop of personality for snapshots and stickers that are totally and uniquely you. \n\ni liked the hp sprocket's simplicity and fun design, even if it's tough to -----> come !!!  -----> up !!!  -----> with !!!  practical reasons for having it around.\n\n**✎wireless compact photo printer**\n\n**canon selphy cp1300**\n\nwith selphy cp1300, canon added another option to the battery-powered portable mini-printers market segment. with this lightweight, mobile and wi-fi-enabled printer, sharing memories in real-time can be quite easy.\n\nhttps://i.redd.it/5zl54q95dsi11.png\n\nthe selphy cp1300 is a wireless printer: it comes with a larger 3.2\" tiltable lcd display, an improved user interface, improved image search with a date filter, the ability to print 2 x 6\" photo strips and a party shuffle mode that is designed to allow wi-fi connected users to connect multiple compatible mobile devices to the same printer and create a print layout made by combining images from everyone. the printer also offers the option to connect an external battery, making it that much more portable.\n\nif you want to see more product reviews at [here](https://www.valueq.com/).", "sortedWord": "None", "Identifyer": null, "identifyer": 36384, "year": "2018"}, {"autor": "jonbonachon", "date": "2018-09-15 19:17:32", "content": "How to fix color shift issues when saving as an sRGB (Solution inside) /!/ Hello r/photography! \n\n&amp;#x200B;\n\nThere was a noticeable \"red boost\" when exporting my images from Photoshop. I was converting a Prophoto 16-bit tiff to an sRGB through the \"save for web\" dialog box and for the life of me I couldn't figure out what was wrong! It wasn't subtle it was like going to the red channel and boosting the saturation by 50%. I spent the whole day, yes the whole freaking day,  trying different solutions I found online. At the end nothing worked so I decided to called it a day and go to sleep. I shut down my computer and head to bed. But I could not go to sleep, I keep thinking of what the issue might be and trying to come up with solutions. Started searching the web again for any hints that could point out the problem was and at the end decided to go back to my computer to try one more thing. And lo and behold the issue was fucking gone!! Just like that! \n\n&amp;#x200B;\n\nI honestly have no idea what \"fix\" was the one that worked but if you're having issues I'd recommend that before you start messing with your settings (specially if you haven't had issues before, like me) to just shut down your computer and turn it back on. I sometimes keep my computer on for days so maybe my screen went out of whack. Also I noticed this happened right in sync with the latest chrome update where they changed the look of the tabs and search bar so maybe it was that. Although I also preview my images in Explorer and they too had the red boost so idk. Like I said, I went through several articles and tutorial so I know my Photoshop color settings and exporting parameters were on point! Hence why it was driving me crazy. \n\n&amp;#x200B;\n\nTl;dr \n\nIf you're having color shift issues and you know your settings are correct, or if you haven't had issues before, just shut down your computer and turn it back on. Also do this after changing a few settings that you think might fix the issue.  \n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9g4546/how_to_fix_color_shift_issues_when_saving_as_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how to fix color shift issues when saving as an srgb (solution inside) /!/ hello r/photography! \n\n&amp;#x200b;\n\nthere was a noticeable \"red boost\" when exporting my images from photoshop. i was converting a prophoto 16-bit tiff to an srgb through the \"save for web\" dialog box and for the life of me i couldn't figure out what was wrong! it wasn't subtle it was like going to the red channel and boosting the saturation by 50%. i spent the whole day, yes the whole freaking day,  trying different solutions i found online. at the end nothing worked so i decided to called it a day and go to sleep. i shut down my computer and head to bed. but i could not go to sleep, i keep thinking of what the issue might be and trying to -----> come !!!  -----> up !!!  -----> with !!!  solutions. started searching the web again for any hints that could point out the problem was and at the end decided to go back to my computer to try one more thing. and lo and behold the issue was fucking gone!! just like that! \n\n&amp;#x200b;\n\ni honestly have no idea what \"fix\" was the one that worked but if you're having issues i'd recommend that before you start messing with your settings (specially if you haven't had issues before, like me) to just shut down your computer and turn it back on. i sometimes keep my computer on for days so maybe my screen went out of whack. also i noticed this happened right in sync with the latest chrome update where they changed the look of the tabs and search bar so maybe it was that. although i also preview my images in explorer and they too had the red boost so idk. like i said, i went through several articles and tutorial so i know my photoshop color settings and exporting parameters were on point! hence why it was driving me crazy. \n\n&amp;#x200b;\n\ntl;dr \n\nif you're having color shift issues and you know your settings are correct, or if you haven't had issues before, just shut down your computer and turn it back on. also do this after changing a few settings that you think might fix the issue.  \n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 36486, "year": "2018"}, {"autor": "jen_photographs", "date": "2018-10-11 15:45:58", "content": "On Ricoh-Pentax's Future /!/ Every now and then I get a bug up my ass and I tweet at Pentax, trying to get them to respond. Last week they finally answered one of my tweets -- probably because I snarked about them promoting their customer svcs while ignoring their fans on social media. ;)  \n\nThey had a marketing rep contact me offering to answer questions. Sweet! I surveyed a Pentax group on FB, and in hindsight, I should've included you folks and /r/Pentax too. Anyway. They came up with three main questions: the future of dslr department (because that dept took a big loss in 2017, per their Annual Report), whether they'll expand or renew licensing w/ 3rd party lens maker, and the lack of digital marketing.\n\nI got a response yesterday, and a lot of it is marketing speak, I'll C/P the relevant bits:\n\n&gt; In regards to the future of Pentax cameras, our camera division is very important to us and will not be going anywhere. While Ricoh has no plans for a new DSLR camera at this time, we are not discontinuing the line. \n\nRegarding marketing:\n\n&gt; We are committed to increasing our social and digital presence and are currently working on executing new strategies to do so. \n\nThe rep did not answer the question about lens, but if I read her response to dSLR's future correctly, it might be moot. No new dslr = no need for new lens? \n\nAnyway. Have at it! (My musings in comments)", "link": "https://www.reddit.com/r/photography/comments/9nb409/on_ricohpentaxs_future/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "on ricoh-pentax's future /!/ every now and then i get a bug up my ass and i tweet at pentax, trying to get them to respond. last week they finally answered one of my tweets -- probably because i snarked about them promoting their customer svcs while ignoring their fans on social media. ;)  \n\nthey had a marketing rep contact me offering to answer questions. sweet! i surveyed a pentax group on fb, and in hindsight, i should've included you folks and /r/pentax too. anyway. they -----> came !!!  -----> up !!!  -----> with !!!  three main questions: the future of dslr department (because that dept took a big loss in 2017, per their annual report), whether they'll expand or renew licensing w/ 3rd party lens maker, and the lack of digital marketing.\n\ni got a response yesterday, and a lot of it is marketing speak, i'll c/p the relevant bits:\n\n&gt; in regards to the future of pentax cameras, our camera division is very important to us and will not be going anywhere. while ricoh has no plans for a new dslr camera at this time, we are not discontinuing the line. \n\nregarding marketing:\n\n&gt; we are committed to increasing our social and digital presence and are currently working on executing new strategies to do so. \n\nthe rep did not answer the question about lens, but if i read her response to dslr's future correctly, it might be moot. no new dslr = no need for new lens? \n\nanyway. have at it! (my musings in comments)", "sortedWord": "None", "Identifyer": null, "identifyer": 36836, "year": "2018"}], "name": "withphotography2018"}