{"interestingcomments": [{"autor": "feklipgl", "date": "2020-12-09 03:19:10", "content": "1 year experience with Pixsy - made over $30K so far from 500 photos /!/ I've been using the US find-photo-infringer service Pixsy for a little over a year now and have received payouts on a bunch of infringements they pursued, all for photos on CC-BY or CC-BY-SA licenses. In total I have 500 or so registered with them (though I don't think I have registered cases with more than 50-60 of them). \n\nMy total income from Pixsy this year is $30K, and that's for a really minimal amount of work on my end. I've certainly not received payouts from every single infringer, not even close, but registering for US copyright seems to have helped the amount of cases being successfully cleared, and Pixsy are honest-to-God actually moving to sue 10+ infringers on my behalf, most of them through the local office they're using in Japan. \n\nThe major downside with pixsy is that they claim to be active in a bunch of European jurisdictions, but I've never been able to submit any infringement from any European country except the UK and the Netherlands (and I've never had a successful case in NL). I know Copytrack are more effective in that part of the world (as a friend's company got caught by a photographer using them once). Pixsy is really only effective in the Anglophone world + Japan. When it comes to Japan specifically though they are INCREDIBLY efficient, I think I've actually received compensation for every case I've submitted there (minus the ones they'll be suing). Actually, Japanese cases are responsible for I think 50% of my payouts (despite only constituting maybe 10-20% of my submitted cases)\n\nThe other big negative is that their website is clunky and limited, but it's at least improved a lot over the year, submitting cases is a breeze compared to before, you had to do 20+ mouse clicks per submission, now it's down to like 4. \n\nRegistering US copyright through them was I think more than twice as expensive as doing it yourself, but it was worth it, they dealt with everything and I didn't have to manually add the info/registration numbers for 500-ish photos through their clunky website. Registering the photos also meant my payouts went up a lot, now I think the average I get (i.e. 50%) is maybe $350 or so per infringement, earlier, I think the average was maybe $100 or so (once, I just got $30 for an infringement, lol).\n\nOverall, I'm very happy with them, but I think you need to have A LOT of infringements to fall back on for them to be effective. The chance of a successful outcome on any random case is probably less than 25% and that's WITH US copyright registered, and it's even less without. So you know, I don't think it's for every photographer, and not for every type of infringement. If you definitely want money from a particular infringer that's not based in the US or Japan, you might be better served finding a lawyer in that jurisdiction who can help you out. If you have a bunch of photos with a bunch of infringements and don't particularly care all that much about who gets squeezed and who doesn't, and you want a nice side income without having to actually deal with any of the nasty stuff going on in the sausage factory, I think they're pretty awesome.", "link": "https://www.reddit.com/r/photography/comments/k9jt7u/1_year_experience_with_pixsy_made_over_30k_so_far/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "1 year experience with pixsy - made over $30k so far from 500 photos /!/ i've been using the us find-photo-infringer service pixsy for a little over a year now and have received payouts on a bunch of infringements they pursued, all for photos on cc-by or cc-by-sa licenses. in total i have 500 or so registered with them (though i don't think i have registered cases with more than 50-60 of them). \n\nmy total income from pixsy this year is $30k, and that's for a really minimal amount of work on my end. i've certainly not received payouts from every single infringer, not even close, but registering for us copyright seems to have helped the amount of cases being successfully cleared, and pixsy are honest-to-god actually moving to sue 10+ infringers on my behalf, most of them through the local office they're using in japan. \n\nthe major downside with pixsy is that they claim to be active in a bunch of european jurisdictions, but i've never been able to submit any infringement from any european country except the uk and the netherlands (and i've never had a successful case in nl). i know copytrack are more effective in that part of the world (as a friend's company got caught by a photographer using them once). pixsy is really only effective in the anglophone world + japan. when it comes to japan specifically though they are incredibly efficient, i think i've actually received compensation for every case i've submitted there (minus the ones they'll be suing). actually, japanese cases are responsible for i think 50% of my payouts (despite only constituting maybe 10-20% of my submitted cases)\n\nthe other big negative is that their website is clunky and limited, but it's at least improved a lot over the year, submitting cases is a breeze compared to before, you had to do 20+ mouse clicks per submission, now it's down to like 4. \n\nregistering us copyright through them was i think more than twice as expensive as -----> doing !!!  -----> it !!!  -----> yourself !!! , but -----> it !!!  was worth -----> it !!! , they dealt with everything and i didn't have to manually add the info/registration numbers for 500-ish photos through their clunky website. registering the photos also meant my payouts went up a lot, now i think the average i get (i.e. 50%) is maybe $350 or so per infringement, earlier, i think the average was maybe $100 or so (once, i just got $30 for an infringement, lol).\n\noverall, i'm very happy with them, but i think you need to have a lot of infringements to fall back on for them to be effective. the chance of a successful outcome on any random case is probably less than 25% and that's with us copyright registered, and it's even less without. so you know, i don't think it's for every photographer, and not for every type of infringement. if you definitely want money from a particular infringer that's not based in the us or japan, you might be better served finding a lawyer in that jurisdiction who can help you out. if you have a bunch of photos with a bunch of infringements and don't particularly care all that much about who gets squeezed and who doesn't, and you want a nice side income without having to actually deal with any of the nasty stuff going on in the sausage factory, i think they're pretty awesome.", "sortedWord": "None", "Identifyer": null, "identifyer": 72857, "year": "2020"}], "name": "yourselfphotography2020"}