{"interestingcomments": [{"autor": "CatBenchKettle", "date": "2019-12-07 16:55:37", "content": "Colourising - Best way to do it? /!/ Afternoon all, I was wondering if someone could help me with a problem.\n\nI’d like to get a couple of old pictures colourised for my nan as a gift. It’s the 5th year without my grandad and I thought a picture of them both when they first met back in the RAF would be a nice, unexpected gift.\n\nI’ve tried looking online at various bots/websites that can do this but they just turn out a slightly different shade of b&amp;w.\n\nDoes anyone know a good service that can do this or any experiences of how you’ve done it yourselves? I’m prepared to pay for it if needed if that makes a difference.\n\nThanks in advance for any advice / help / assistance you guys can give.", "link": "https://www.reddit.com/r/photography/comments/e7gn4c/colourising_best_way_to_do_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "done it yourselves", "selectorShort": "yourself", "MarkedSent": "colourising - best way to do it? /!/ afternoon all, i was wondering if someone could help me with a problem.\n\ni’d like to get a couple of old pictures colourised for my nan as a gift. it’s the 5th year without my grandad and i thought a picture of them both when they first met back in the raf would be a nice, unexpected gift.\n\ni’ve tried looking online at various bots/websites that can do this but they just turn out a slightly different shade of b&amp;w.\n\ndoes anyone know a good service that can do this or any experiences of how you’ve -----> done !!!  -----> it !!!  -----> yourselves !!! ? i’m prepared to pay for it if needed if that makes a difference.\n\nthanks in advance for any advice / help / assistance you guys can give.", "sortedWord": "None", "Identifyer": null, "identifyer": 4270, "year": "2019"}, {"autor": "kikokairuz", "date": "2019-09-24 03:18:38", "content": "Just done! Nothing better than do it yourself. Print and frame like a pro!", "link": "https://www.reddit.com/r/photography/comments/d8hi5k/just_done_nothing_better_than_do_it_yourself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "just done! nothing better than -----> do !!!  -----> it !!!  -----> yourself !!! . print and frame like a pro!", "sortedWord": "None", "Identifyer": null, "identifyer": 6611, "year": "2019"}, {"autor": "1stonthelistca", "date": "2019-05-28 19:52:01", "content": "HTTPS is Everywhere – And if It’s Not It Should Be /!/ HTTPS and SSL – two sets of letters that you’ve probably heard a lot about, even if you don’t know what it means. Essentially, they boil down to a technical signal that your website is secure for browsing and that your visitor’s data and information is safe and secure from vulnerabilities. They’re the symbols of Internet security.\n\nInternet security is a much talked about term these days, thanks in part to big businesses that have been in the media due to data breaches. What’s more, visitors are used to expecting security when conducting credit card transactions online. Beyond that, Internet security is something many web visitors and businesses take for granted. So, it may have been surprising when way back in 2014 Google admitted that HTTPS had become a [ranking factor](https://webmasters.googleblog.com/2014/08/https-as-ranking-signal.html) for websites. But, when Google says something is helpful, everyone jumps on board. Beyond being a helpful factor for SEO and ranking, having a secure website is good business practice. HTTPS and SSL is important. Today we’re going to review why you need it, how it works and how to get it installed on your website.\n\nThink about your place of business. Your employees have keys and your guests cannot enter until the doors have been opened or they’ve been let in. If you are part of a really large organization, the employees may have badges or nametags for identification. If you were to lose your keys or identification, your business would be left vulnerable. Your business has implemented security measures to keep the actual office safe, but also to protect important documents and data, right?\n\nWell, the same is true for a website. Years ago, websites were basically an online version of a business card. There wasn’t much data being exchanged and visitors were merely browsing. Then the onset of websites came where you could login and become a member. Or, you could shop and make a purchase. Or, you could fill out a form to sign up for important information. With that, all of a sudden your digital footprint that followed you around the Internet started to hold all sorts of data.\n\nNow, while you browse the web you are basically a walking billboard of information about yourself, unless you keep everything secure. Businesses can help protect your data by ensuring their own websites are security compliant.\n\nInternet users have been slowly trained to look for an ‘s’ next to the HTTP as a signal that a website is secure for browsing and exchanging information. While most Internet users don’t understand the technicalities of HTTPS and SSL they know what can happen if their sensitive information is breached. Perhaps their banking system has already been compromised and they’ve had to deal with the hassle of ordering new cards and updating information. Perhaps their social media accounts have been hacked and they’ve had to spend precious time cleaning things up and resetting passwords. More and more people are expecting security from the websites they visit, and if they don’t find it, they leave.\n\nWhat is Https?\n--------------\n\nThe ‘s’ in HTTPS stands for ‘secure’. When you see this in a URL, coupled with a lock symbol, you know the website you are visited is encrypted with a secure website connection. Historically, SSL was reserved primarily for websites that collected private information such as passwords, private data and credit cards. When you visit a website without the ‘s’ you could be on a compromised network, or one that is vulnerable to hackers, the Internet’s version of eavesdroppers.\n\nHTTPS helps protect the privacy of your website visitor. It is no longer enough for you to say you will protect a visitor’s information. Now you must show you are protecting it.\n\nHTTPS makes it harder for hackers to break the connection and steal personal information.\n\nWhen browsing the web, look for the ‘s’ to know that the website you’re on is trustworthy. Not all websites have converted over to HTTPS yet, so [if you are browsing a site that is not secure](https://seoexpertbrad.com/google-ssl-certificates-https/), just be sure to refrain from passing along your important personal information and data.\n\n**What is an SSL Certificate?**\n\nAn SSL certificate is the indication that your website is officially secure. This is what allows your website browser to establish a secure connection. The browser trusts the secure connection, which in turn a user can also feel safe browsing and even providing private/confidential information.\n\nOur official SSL partner is DigiCert, a leading SSL certificate authority. We recommend them because they provide increased speed and load time which is also a valuable SEO feature.\n\nWhy You need it?\n----------------\n\nInternet visitors are more savvy and have an innate trust associated with HTTPS. Recent media reports of big brands being hacked, compromised and having personal data leaked has made consumers even more cautious. We side with Google on this one and would like to see every website properly secured. It’s especially important if you collect credit card payments, you collect private information (such as name, address, health records, passwords etc.) or you are in a competitive market. Here are other reasons why you should consider HTTPS for your website:\n\n  - Google now uses HTTPS as an important ranking factor and sites with it tend to rank better. This in itself is an important reason to ensure your website is secure and compliant with HTTPS. With a lot of competition on the Internet, your business should be great at the basics.\n  - Some popular Internet browsers are giving warnings when web visitors try and access a non-secure website. Therefore, if your site is not secure, you could be missing out on valuable website traffic. In fact, these warnings might just scare your website visitors away.\n  - Ensuring your website is secure protects your business from the costs of a data breach. This could be a public relations nightmare if your website data was ever breached, not to mention an expensive nightmare, too.\n  - Visitors are more confident using your website if they know it is secure. As visitors become more confident in their website browsing they have expectations of businesses, including website and data security.\n\n“HTTPS Everywhere” is a term coined by Google. Google has confirmed that HTTPS is a ranking factor dating back to 2014. “Security is a top priority for Google… beyond our own stuff, we’re also working to make the Internet safer more broadly. A big part of that is making sure that websites people access from Google, are secure… so we’re starting to use HTTPS as a ranking signal…”\n\nHistorically, only pages or parts of a website that dealt with sensitive data were secured with an SSL certificate. But, now it is advantageous to secure every single page. In other words, only when an entire website is properly secured with SSL will it earn a ranking advantage.\n\nAre All SSL Certificates Created Equal?\n---------------------------------------\n\nNo! Many of the SSL certificates online are SHA-1 which gets more compromised each year. In fact, Google Chrome may even display a warning on websites with SHA-1.\n\nSHA-2 is a much stronger certificate. If you want to ensure your website is deemed trustworthy you can even obtain an SSL EV certificate.\n\nIn addition, it is important to regularly check your SSL certificate to ensure it is not vulnerable. Improperly installed or misconfigured [SSL certificates](https://www.1stonthelist.ca/seo/other-services/#ssl) can leave you open to attack.\n\nWe provide a complimentary Inspector Report. Ask us for it!\n\n**The SSL Handshake – How SSL Works**\n\nHow does your web browser know a website is secure? Well, it undertakes what is commonly referred to as the SSL Handshake.\n\n  - The Internet browser connects to the web server and requests the server to identify itself.\n  - The server sends a copy of its SSL Certificate\n  - The browser verifies the certificate to ensure it is valid. If the browser trusts the certificate it creates an encrypted symmetric session key using the server’s public key.\n  - The server decrypts the symmetric session key using its private key and sends back an acknowledgement to start the encrypted session.\n  - Server &amp;browser are now encrypted.\n\nHow to Purchase and Install an SSL Certificate\n----------------------------------------------\n\nBecause SSL and HTTPS is more important than ever, installation is best left to the professionals. While you can do it yourself, or have it done through your hosting provider you want to be sure that all configurations are correct and that your website is not vulnerable to insecurities.\n\n**In Summary**\n\nSo, while SSL and HTTPS is essentially good business practice, it is something users are looking for when they visit a website.\n\nHTTPS and SSL are the equivalent of a lock on a door or a code on a safe. Now more than ever it’s important to be secure. The same is true for a website. Internet users are vulnerable when they browse the Internet. They have private data, cookies and Internet session info following along with them. In addition, they make credit card transactions, utilize banking websites, enter their personal data such as their full name and address, and are constantly logging in and out or signing up for things with usernames and passwords. Without security, we’d all be victims of fraud and identity theft by now. That’s why, even when you aren’t conducting a financial transaction, it’s wise to look for websites that are HTTPS.\n\nAnd, if Google is using it as a ranking factor then it is just all the more reason to jump on board the security bandwagon. But, not all s’s are created equally. Even if you’re only obtaining the certificate to appease Google, it’s important to ensure that your SSL and security is set up and configured correctly. After all, the real goal is to ensure that your website visitors are safe while browsing your website. After all, a data breach could cost your business time, money and reputation!\n\nBeyond the visitor’s point of view, it’s just good business to ensure your website provides adequate security. And if it’s going to help with your SEO, well that’s great too.\n\nWebsite visitors do not always understand the technicalities of what goes on behind the scenes of a website. They don’t understand how their data is encrypted. But, they know the hassle that comes when they’ve become vulnerable to an attack, have been hacked or have had their information compromised. What they do know is that the S that is part of HTTPS and the lock in the browser is the best indication they have that a business is doing everything it can to protect their sensitive information. So, if you haven’t yet adopted HTTPS, perhaps it’s time you did.\n\nIf you still have questions about getting your website secure with SSL certificate, please call our SEO experts here at 1st on the List at 1-877-562-1750.\n\nThe post [HTTPS is Everywhere – And if It’s Not It Should Be](https://www.1stonthelist.ca/blog/https-is-everywhere-and-if-its-not-it-should-be/) appeared first on [1st on the List](https://www.1stonthelist.ca).\n\n   \n   \n from WordPress http://bit.ly/2WaQlMT", "link": "https://www.reddit.com/r/photography/comments/bu4mmt/https_is_everywhere_and_if_its_not_it_should_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "https is everywhere – and if it’s not it should be /!/ https and ssl – two sets of letters that you’ve probably heard a lot about, even if you don’t know what it means. essentially, they boil down to a technical signal that your website is secure for browsing and that your visitor’s data and information is safe and secure from vulnerabilities. they’re the symbols of internet security.\n\ninternet security is a much talked about term these days, thanks in part to big businesses that have been in the media due to data breaches. what’s more, visitors are used to expecting security when conducting credit card transactions online. beyond that, internet security is something many web visitors and businesses take for granted. so, it may have been surprising when way back in 2014 google admitted that https had become a [ranking factor](https://webmasters.googleblog.com/2014/08/https-as-ranking-signal.html) for websites. but, when google says something is helpful, everyone jumps on board. beyond being a helpful factor for seo and ranking, having a secure website is good business practice. https and ssl is important. today we’re going to review why you need it, how it works and how to get it installed on your website.\n\nthink about your place of business. your employees have keys and your guests cannot enter until the doors have been opened or they’ve been let in. if you are part of a really large organization, the employees may have badges or nametags for identification. if you were to lose your keys or identification, your business would be left vulnerable. your business has implemented security measures to keep the actual office safe, but also to protect important documents and data, right?\n\nwell, the same is true for a website. years ago, websites were basically an online version of a business card. there wasn’t much data being exchanged and visitors were merely browsing. then the onset of websites came where you could login and become a member. or, you could shop and make a purchase. or, you could fill out a form to sign up for important information. with that, all of a sudden your digital footprint that followed you around the internet started to hold all sorts of data.\n\nnow, while you browse the web you are basically a walking billboard of information about yourself, unless you keep everything secure. businesses can help protect your data by ensuring their own websites are security compliant.\n\ninternet users have been slowly trained to look for an ‘s’ next to the http as a signal that a website is secure for browsing and exchanging information. while most internet users don’t understand the technicalities of https and ssl they know what can happen if their sensitive information is breached. perhaps their banking system has already been compromised and they’ve had to deal with the hassle of ordering new cards and updating information. perhaps their social media accounts have been hacked and they’ve had to spend precious time cleaning things up and resetting passwords. more and more people are expecting security from the websites they visit, and if they don’t find it, they leave.\n\nwhat is https?\n--------------\n\nthe ‘s’ in https stands for ‘secure’. when you see this in a url, coupled with a lock symbol, you know the website you are visited is encrypted with a secure website connection. historically, ssl was reserved primarily for websites that collected private information such as passwords, private data and credit cards. when you visit a website without the ‘s’ you could be on a compromised network, or one that is vulnerable to hackers, the internet’s version of eavesdroppers.\n\nhttps helps protect the privacy of your website visitor. it is no longer enough for you to say you will protect a visitor’s information. now you must show you are protecting it.\n\nhttps makes it harder for hackers to break the connection and steal personal information.\n\nwhen browsing the web, look for the ‘s’ to know that the website you’re on is trustworthy. not all websites have converted over to https yet, so [if you are browsing a site that is not secure](https://seoexpertbrad.com/google-ssl-certificates-https/), just be sure to refrain from passing along your important personal information and data.\n\n**what is an ssl certificate?**\n\nan ssl certificate is the indication that your website is officially secure. this is what allows your website browser to establish a secure connection. the browser trusts the secure connection, which in turn a user can also feel safe browsing and even providing private/confidential information.\n\nour official ssl partner is digicert, a leading ssl certificate authority. we recommend them because they provide increased speed and load time which is also a valuable seo feature.\n\nwhy you need it?\n----------------\n\ninternet visitors are more savvy and have an innate trust associated with https. recent media reports of big brands being hacked, compromised and having personal data leaked has made consumers even more cautious. we side with google on this one and would like to see every website properly secured. it’s especially important if you collect credit card payments, you collect private information (such as name, address, health records, passwords etc.) or you are in a competitive market. here are other reasons why you should consider https for your website:\n\n  - google now uses https as an important ranking factor and sites with it tend to rank better. this in itself is an important reason to ensure your website is secure and compliant with https. with a lot of competition on the internet, your business should be great at the basics.\n  - some popular internet browsers are giving warnings when web visitors try and access a non-secure website. therefore, if your site is not secure, you could be missing out on valuable website traffic. in fact, these warnings might just scare your website visitors away.\n  - ensuring your website is secure protects your business from the costs of a data breach. this could be a public relations nightmare if your website data was ever breached, not to mention an expensive nightmare, too.\n  - visitors are more confident using your website if they know it is secure. as visitors become more confident in their website browsing they have expectations of businesses, including website and data security.\n\n“https everywhere” is a term coined by google. google has confirmed that https is a ranking factor dating back to 2014. “security is a top priority for google… beyond our own stuff, we’re also working to make the internet safer more broadly. a big part of that is making sure that websites people access from google, are secure… so we’re starting to use https as a ranking signal…”\n\nhistorically, only pages or parts of a website that dealt with sensitive data were secured with an ssl certificate. but, now it is advantageous to secure every single page. in other words, only when an entire website is properly secured with ssl will it earn a ranking advantage.\n\nare all ssl certificates created equal?\n---------------------------------------\n\nno! many of the ssl certificates online are sha-1 which gets more compromised each year. in fact, google chrome may even display a warning on websites with sha-1.\n\nsha-2 is a much stronger certificate. if you want to ensure your website is deemed trustworthy you can even obtain an ssl ev certificate.\n\nin addition, it is important to regularly check your ssl certificate to ensure it is not vulnerable. improperly installed or misconfigured [ssl certificates](https://www.1stonthelist.ca/seo/other-services/#ssl) can leave you open to attack.\n\nwe provide a complimentary inspector report. ask us for it!\n\n**the ssl handshake – how ssl works**\n\nhow does your web browser know a website is secure? well, it undertakes what is commonly referred to as the ssl handshake.\n\n  - the internet browser connects to the web server and requests the server to identify itself.\n  - the server sends a copy of its ssl certificate\n  - the browser verifies the certificate to ensure it is valid. if the browser trusts the certificate it creates an encrypted symmetric session key using the server’s public key.\n  - the server decrypts the symmetric session key using its private key and sends back an acknowledgement to start the encrypted session.\n  - server &amp;browser are now encrypted.\n\nhow to purchase and install an ssl certificate\n----------------------------------------------\n\nbecause ssl and https is more important than ever, installation is best left to the professionals. while you can -----> do !!!  -----> it !!!  -----> yourself !!! , or have -----> it !!!  done through your hosting provider you want to be sure that all configurations are correct and that your website is not vulnerable to insecurities.\n\n**in summary**\n\nso, while ssl and https is essentially good business practice, it is something users are looking for when they visit a website.\n\nhttps and ssl are the equivalent of a lock on a door or a code on a safe. now more than ever it’s important to be secure. the same is true for a website. internet users are vulnerable when they browse the internet. they have private data, cookies and internet session info following along with them. in addition, they make credit card transactions, utilize banking websites, enter their personal data such as their full name and address, and are constantly logging in and out or signing up for things with usernames and passwords. without security, we’d all be victims of fraud and identity theft by now. that’s why, even when you aren’t conducting a financial transaction, it’s wise to look for websites that are https.\n\nand, if google is using it as a ranking factor then it is just all the more reason to jump on board the security bandwagon. but, not all s’s are created equally. even if you’re only obtaining the certificate to appease google, it’s important to ensure that your ssl and security is set up and configured correctly. after all, the real goal is to ensure that your website visitors are safe while browsing your website. after all, a data breach could cost your business time, money and reputation!\n\nbeyond the visitor’s point of view, it’s just good business to ensure your website provides adequate security. and if it’s going to help with your seo, well that’s great too.\n\nwebsite visitors do not always understand the technicalities of what goes on behind the scenes of a website. they don’t understand how their data is encrypted. but, they know the hassle that comes when they’ve become vulnerable to an attack, have been hacked or have had their information compromised. what they do know is that the s that is part of https and the lock in the browser is the best indication they have that a business is doing everything it can to protect their sensitive information. so, if you haven’t yet adopted https, perhaps it’s time you did.\n\nif you still have questions about getting your website secure with ssl certificate, please call our seo experts here at 1st on the list at 1-877-562-1750.\n\nthe post [https is everywhere – and if it’s not it should be](https://www.1stonthelist.ca/blog/https-is-everywhere-and-if-its-not-it-should-be/) appeared first on [1st on the list](https://www.1stonthelist.ca).\n\n   \n   \n from wordpress http://bit.ly/2waqlmt", "sortedWord": "None", "Identifyer": null, "identifyer": 74153, "year": "2019"}], "name": "yourselfphotography2019"}