{"interestingcomments": [{"autor": "denzelvb", "date": "2018-01-12 13:43:33", "content": "Outsourcing photo editing? /!/ Hey guys!\n\nI just saw a podcast about tips on how to boost your photography business and one of the points in there was outsourcing you photo editing to save time and eventually make more money.\n\nI started reading about outsourcing your photography and I read that most of the high end photographers do this... Is this true?\n\nIn my opinion the photo editing is part of the work you deliver. When you edit the photos yourself the work is really yours and it has your style to it, which you develop through time and experience. But if you outsource it, you only did 50% of the work of the final photograph, IMO.\n\nI fully understand the benefits of outsourcing the editing, but I just don't feel like it is the right thing to do.\n\nHow do you feel about outsourcing your photo editing? And do you personally outsource it or do you rather do it yourself, and why?\n\nI would really like to hear some thoughts about this from professionals, since I am just a hobby photographer with the thought of starting a photography business in the (near) future.", "link": "https://www.reddit.com/r/photography/comments/7pwn0v/outsourcing_photo_editing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "outsourcing photo editing? /!/ hey guys!\n\ni just saw a podcast about tips on how to boost your photography business and one of the points in there was outsourcing you photo editing to save time and eventually make more money.\n\ni started reading about outsourcing your photography and i read that most of the high end photographers do this... is this true?\n\nin my opinion the photo editing is part of the work you deliver. when you edit the photos yourself the work is really yours and it has your style to it, which you develop through time and experience. but if you outsource it, you only did 50% of the work of the final photograph, imo.\n\ni fully understand the benefits of outsourcing the editing, but i just don't feel like it is the right thing to do.\n\nhow do you feel about outsourcing your photo editing? and -----> do !!!  you personally outsource -----> it !!!  or -----> do !!!  you rather -----> do !!!  -----> it !!!  -----> yourself !!! , and why?\n\ni would really like to hear some thoughts about this from professionals, since i am just a hobby photographer with the thought of starting a photography business in the (near) future.", "sortedWord": "None", "Identifyer": null, "identifyer": 26306, "year": "2018"}, {"autor": "Kudzupatch", "date": "2018-12-15 22:28:10", "content": "Anyone actually damaged a sensor cleaning it?? /!/ I see all the warning about having your sensor(s) cleaned by a pro rather than doing it yourself because you could damage your sensor. Obviously, your camera, your money and your choice. \n\nI have never heard of anyone that actually damaged a sensor, just rumors that they are delicate warnings. So has anyone actually damaged one or knows someone personally, *not second hand info/rumor,* that has damaged the sensor? And  I am not talking about people doing stupid either.", "link": "https://www.reddit.com/r/photography/comments/a6jju8/anyone_actually_damaged_a_sensor_cleaning_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "anyone actually damaged a sensor cleaning it?? /!/ i see all the warning about having your sensor(s) cleaned by a pro rather than -----> doing !!!  -----> it !!!  -----> yourself !!!  because you could damage your sensor. obviously, your camera, your money and your choice. \n\ni have never heard of anyone that actually damaged a sensor, just rumors that they are delicate warnings. so has anyone actually damaged one or knows someone personally, *not second hand info/rumor,* that has damaged the sensor? and  i am not talking about people doing stupid either.", "sortedWord": "None", "Identifyer": null, "identifyer": 33970, "year": "2018"}], "name": "yourselfphotography2018"}