{"interestingcomments": [{"Unnamed: 0": 224642, "autor": "thebeginingisnear", "date": 1583889556000, "content": "How can I DIY some mosquito protection in my yard? /!/ Northern NJ resident. Would love to do something about the mosquito's so we can enjoy our backyard in peace. It's not a huge problem in our yard but there are some days they can get rather aggressive even with some citronella lanterns around. I have a ryobi electric sprayer that I use for lawn pre/post emergent applications\n\nIs Permethrin or Bifen a viable option? For Bifen would I/T or XTS be better suited for mosquitos? Whats the deal with using these chemicals if we have a raised garden bed in our yard, if I don't spray the garden soil directly would the food still be safe to eat?", "link": "https://www.reddit.com/r/lawncare/comments/fgoyg2/how_can_i_diy_some_mosquito_protection_in_my_yard/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how can i -----> diy !!!  some mosquito protection in my yard? /!/ northern nj resident. would love to do something about the mosquito's so we can enjoy our backyard in peace. it's not a huge problem in our yard but there are some days they can get rather aggressive even with some citronella lanterns around. i have a ryobi electric sprayer that i use for lawn pre/post emergent applications\n\nis permethrin or bifen a viable option? for bifen would i/t or xts be better suited for mosquitos? whats the deal with using these chemicals if we have a raised garden bed in our yard, if i don't spray the garden soil directly would the food still be safe to eat?", "sortedWord": "None", "removed": null, "score": 1, "comments": 25, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/fgoyg2/how_can_i_diy_some_mosquito_protection_in_my_yard/", "identifyer": 224642, "year": "2020"}, {"Unnamed: 0": 224708, "autor": "short_sleep", "date": 1590356884000, "content": "Lawn is 80% Weeds. Should we destroy it? DIY or Hire Someone? /!/ My backyard lawn was inherited when I moved in two years ago. The first summer, the weeds were not too bad. Last summer they were a little worse. But this spring, it's gotten about 3 times worse. I'd say 80% of the lawn is weeds. Creeping Charlie and those little purple flowers as well. On top of that, we have a mole problem and our lawn is sinking in. We also have a section near our gate where the ground is dry, hard and mixed with rock extended from our gravel driveway. (From Google Street view, it looks like a speedboat and a small bus were stored there at different times.)\n\nWe're not lawn &amp; garden savvy, but we wanna do something about it this year. We've barely looked into it, but so far we've found that people sometimes just obliterate their entire lawns and start over from scratch. I wouldn't be opposed to that, but I was wondering if it would be easier to do it ourselves or hire someone to do it for us. And if we did do it ourselves, is a cultivator going to help at all? (I ask because we have Greenworks Tools products and would prefer to stick with battery operated or electric tools.)\n\nWhat are our options?", "link": "https://www.reddit.com/r/lawncare/comments/gpy4ye/lawn_is_80_weeds_should_we_destroy_it_diy_or_hire/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lawn is 80% weeds. should we destroy it? -----> diy !!!  or hire someone? /!/ my backyard lawn was inherited when i moved in two years ago. the first summer, the weeds were not too bad. last summer they were a little worse. but this spring, it's gotten about 3 times worse. i'd say 80% of the lawn is weeds. creeping charlie and those little purple flowers as well. on top of that, we have a mole problem and our lawn is sinking in. we also have a section near our gate where the ground is dry, hard and mixed with rock extended from our gravel driveway. (from google street view, it looks like a speedboat and a small bus were stored there at different times.)\n\nwe're not lawn &amp; garden savvy, but we wanna do something about it this year. we've barely looked into it, but so far we've found that people sometimes just obliterate their entire lawns and start over from scratch. i wouldn't be opposed to that, but i was wondering if it would be easier to do it ourselves or hire someone to do it for us. and if we did do it ourselves, is a cultivator going to help at all? (i ask because we have greenworks tools products and would prefer to stick with battery operated or electric tools.)\n\nwhat are our options?", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gpy4ye/lawn_is_80_weeds_should_we_destroy_it_diy_or_hire/", "identifyer": 224708, "year": "2020"}, {"Unnamed: 0": 224926, "autor": "emdubayoumd", "date": 1596646464000, "content": "Best Machine to Rent? DIY grading pre lawn reno /!/ In preparation for a lawn reno, I want to smooth out the grade in part of yard that previously had a tree with pertruding roots. \n\nI am contemplating renting a mini, ride behind skid steer, but not sure if its the right tool for the job, and will cost $200 + $100 deliver.\n\nAlternatively, I could rent a gas powered tiller and use a landscape rake to spread around.\n\nOr I could just try to be a hero and do it all with shovels and hand, but that maybe not good time-wise and lower-back wise. \n\npics below. \n\nAnyone have any experience? \n\n[https://imgur.com/a/WU9zFK4](https://imgur.com/a/WU9zFK4)", "link": "https://www.reddit.com/r/lawncare/comments/i4903z/best_machine_to_rent_diy_grading_pre_lawn_reno/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best machine to rent? -----> diy !!!  grading pre lawn reno /!/ in preparation for a lawn reno, i want to smooth out the grade in part of yard that previously had a tree with pertruding roots. \n\ni am contemplating renting a mini, ride behind skid steer, but not sure if its the right tool for the job, and will cost $200 + $100 deliver.\n\nalternatively, i could rent a gas powered tiller and use a landscape rake to spread around.\n\nor i could just try to be a hero and do it all with shovels and hand, but that maybe not good time-wise and lower-back wise. \n\npics below. \n\nanyone have any experience? \n\n[https://imgur.com/a/wu9zfk4](https://imgur.com/a/wu9zfk4)", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/i4903z/best_machine_to_rent_diy_grading_pre_lawn_reno/", "identifyer": 224926, "year": "2020"}, {"Unnamed: 0": 225121, "autor": "maverick633", "date": 1602888501000, "content": "How I made my DIY lawn striper /!/ After showing my stripes I had a request to explain how I made my striping kit.\n\nHere is my striping portfolio - [https://imgur.com/gallery/8rbnk0T](https://imgur.com/gallery/8rbnk0T)\n\nPVC striper - [https://imgur.com/gallery/7YNvDhP](https://imgur.com/gallery/7YNvDhP)\n\nItems I used:\n\nsteel angle - [https://www.homedepot.com/p/Everbilt-36-in-x-1-in-x-1-8-in-Steel-Angle-801457/204225879](https://www.homedepot.com/p/Everbilt-36-in-x-1-in-x-1-8-in-Steel-Angle-801457/204225879) \n\n3\" PVC - [https://www.homedepot.com/p/JM-eagle-3-in-x-10-ft-PVC-Schedule-40-DWV-Plain-End-Pipe-531095/100161921](https://www.homedepot.com/p/JM-eagle-3-in-x-10-ft-PVC-Schedule-40-DWV-Plain-End-Pipe-531095/100161921)\n\n3\" end caps - [https://www.lowes.com/pd/Charlotte-Pipe-3-in-x-3-in-x-3-in-dia-Cap-PVC-Fitting/3133057](https://www.lowes.com/pd/Charlotte-Pipe-3-in-x-3-in-x-3-in-dia-Cap-PVC-Fitting/3133057)\n\n1/2\" x 36\" threaded rod - [https://www.homedepot.com/p/Everbilt-1-2-in-x-36-in-Zinc-Threaded-Rod-802257/204274019](https://www.homedepot.com/p/Everbilt-1-2-in-x-36-in-Zinc-Threaded-Rod-802257/204274019)\n\n1/2\" lock nut - [https://www.homedepot.com/p/Everbilt-1-2-in-13-Zinc-Plated-Nylon-Lock-Nut-811521/204274162](https://www.homedepot.com/p/Everbilt-1-2-in-13-Zinc-Plated-Nylon-Lock-Nut-811521/204274162)\n\nchain - [https://www.homedepot.com/p/Everbilt-2-0-x-10-ft-Zinc-Plated-Steel-Straight-Link-Chain-803092/203958843](https://www.homedepot.com/p/Everbilt-2-0-x-10-ft-Zinc-Plated-Steel-Straight-Link-Chain-803092/203958843)\n\ncarabiner - [https://www.homedepot.com/p/Everbilt-1-2-in-x-5-1-2-in-Zinc-Plated-Spring-Link-42914/205887904](https://www.homedepot.com/p/Everbilt-1-2-in-x-5-1-2-in-Zinc-Plated-Spring-Link-42914/205887904)\n\nanchor shackle - [https://www.homedepot.com/p/Everbilt-3-8-in-Galvanized-Anchor-Shackle-43124/205887797](https://www.homedepot.com/p/Everbilt-3-8-in-Galvanized-Anchor-Shackle-43124/205887797)\n\nsand - [https://www.homedepot.com/p/SAKRETE-50-lb-Play-Sand-40100301/202007298](https://www.homedepot.com/p/SAKRETE-50-lb-Play-Sand-40100301/202007298)\n\n&amp;#x200B;\n\nMetal angle piece - [https://imgur.com/gallery/gCfDpaE](https://imgur.com/gallery/gCfDpaE)\n\nHow I attached it:\n\n1. My mower had some bolts on the back which I unscrewed and measured the width\n2. Then drill 2 holes (same size as bolts) with the measured width on one side of the metal angle\n3. On other side of metal angle, I drilled 2 holes on either end with 1/2\" bit I believe\n   1. Only need to be big enough to fit carabiner\n4. Attach metal angle by putting the bolts back on with the metal angle now attached to the mower\n\nHow I made it:\n\n1. Measure width from middle of rear tire to other rear tire (mine was about 30\")\n2. Cut PVC pipe to length\n3. Drill 1/2\" hole in each end cap\n4. Place one end cap on PVC pipe and thread the rod through the pipe and end cap\n5. Fill with as much sand as will fit\n6. Place other end cap on and get the rod through the hole in end cap\n7. Place each anchor shackle on the rod\n8. Put both lock nuts on and tighten enough until there is still some room for the shackle to move left and right\n9. Cut the chain to amount of links needed to have striper on the ground but not enough to roll and hit rear tires (from the metal angle piece)\n10. Connect chain to shackle and carabiner\n11. Put carabiners through the holes in the metal angle and should be good to go\n\nFinished product - [https://imgur.com/gallery/bIBFISV](https://imgur.com/gallery/bIBFISV)\n\nMetal striper - [https://imgur.com/gallery/Dyaq06P](https://imgur.com/gallery/Dyaq06P)\n\nSome notes:\n\n1. The finished product image contains a metal striper. This is a roller from a golf course rough mower (Toro 4500d). I work at a golf course and this roller was no longer in service and going to be scrap metal so I was able to take it and use it for residential use.\n2. I switch between the metal striper and PVC striper depending on how I'm feeling that day. I do not see a huge difference between how they stripe.\n3. I use the same chain, carabiners, and shackles for each striper.\n4. The metal striper holds in the shackle by a hose clamp because it is not threaded. \n5. This is what I made after testing multiple stripers such as dragging a mat behind the mower and dragging the PVC (instead of rolling)\n6. I have found that a roller puts down better stripes than dragging something\n\nFeel free to leave any questions, comments, or suggestions.\n\nI am currently building a parts list to make a DIY Checkmate striper with boat rollers. \n\nHopefully that will be made in the winter and can let everyone know how it worked out.", "link": "https://www.reddit.com/r/lawncare/comments/jcjzhb/how_i_made_my_diy_lawn_striper/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how i made my -----> diy !!!  lawn striper /!/ after showing my stripes i had a request to explain how i made my striping kit.\n\nhere is my striping portfolio - [https://imgur.com/gallery/8rbnk0t](https://imgur.com/gallery/8rbnk0t)\n\npvc striper - [https://imgur.com/gallery/7ynvdhp](https://imgur.com/gallery/7ynvdhp)\n\nitems i used:\n\nsteel angle - [https://www.homedepot.com/p/everbilt-36-in-x-1-in-x-1-8-in-steel-angle-801457/204225879](https://www.homedepot.com/p/everbilt-36-in-x-1-in-x-1-8-in-steel-angle-801457/204225879) \n\n3\" pvc - [https://www.homedepot.com/p/jm-eagle-3-in-x-10-ft-pvc-schedule-40-dwv-plain-end-pipe-531095/100161921](https://www.homedepot.com/p/jm-eagle-3-in-x-10-ft-pvc-schedule-40-dwv-plain-end-pipe-531095/100161921)\n\n3\" end caps - [https://www.lowes.com/pd/charlotte-pipe-3-in-x-3-in-x-3-in-dia-cap-pvc-fitting/3133057](https://www.lowes.com/pd/charlotte-pipe-3-in-x-3-in-x-3-in-dia-cap-pvc-fitting/3133057)\n\n1/2\" x 36\" threaded rod - [https://www.homedepot.com/p/everbilt-1-2-in-x-36-in-zinc-threaded-rod-802257/204274019](https://www.homedepot.com/p/everbilt-1-2-in-x-36-in-zinc-threaded-rod-802257/204274019)\n\n1/2\" lock nut - [https://www.homedepot.com/p/everbilt-1-2-in-13-zinc-plated-nylon-lock-nut-811521/204274162](https://www.homedepot.com/p/everbilt-1-2-in-13-zinc-plated-nylon-lock-nut-811521/204274162)\n\nchain - [https://www.homedepot.com/p/everbilt-2-0-x-10-ft-zinc-plated-steel-straight-link-chain-803092/203958843](https://www.homedepot.com/p/everbilt-2-0-x-10-ft-zinc-plated-steel-straight-link-chain-803092/203958843)\n\ncarabiner - [https://www.homedepot.com/p/everbilt-1-2-in-x-5-1-2-in-zinc-plated-spring-link-42914/205887904](https://www.homedepot.com/p/everbilt-1-2-in-x-5-1-2-in-zinc-plated-spring-link-42914/205887904)\n\nanchor shackle - [https://www.homedepot.com/p/everbilt-3-8-in-galvanized-anchor-shackle-43124/205887797](https://www.homedepot.com/p/everbilt-3-8-in-galvanized-anchor-shackle-43124/205887797)\n\nsand - [https://www.homedepot.com/p/sakrete-50-lb-play-sand-40100301/202007298](https://www.homedepot.com/p/sakrete-50-lb-play-sand-40100301/202007298)\n\n&amp;#x200b;\n\nmetal angle piece - [https://imgur.com/gallery/gcfdpae](https://imgur.com/gallery/gcfdpae)\n\nhow i attached it:\n\n1. my mower had some bolts on the back which i unscrewed and measured the width\n2. then drill 2 holes (same size as bolts) with the measured width on one side of the metal angle\n3. on other side of metal angle, i drilled 2 holes on either end with 1/2\" bit i believe\n   1. only need to be big enough to fit carabiner\n4. attach metal angle by putting the bolts back on with the metal angle now attached to the mower\n\nhow i made it:\n\n1. measure width from middle of rear tire to other rear tire (mine was about 30\")\n2. cut pvc pipe to length\n3. drill 1/2\" hole in each end cap\n4. place one end cap on pvc pipe and thread the rod through the pipe and end cap\n5. fill with as much sand as will fit\n6. place other end cap on and get the rod through the hole in end cap\n7. place each anchor shackle on the rod\n8. put both lock nuts on and tighten enough until there is still some room for the shackle to move left and right\n9. cut the chain to amount of links needed to have striper on the ground but not enough to roll and hit rear tires (from the metal angle piece)\n10. connect chain to shackle and carabiner\n11. put carabiners through the holes in the metal angle and should be good to go\n\nfinished product - [https://imgur.com/gallery/bibfisv](https://imgur.com/gallery/bibfisv)\n\nmetal striper - [https://imgur.com/gallery/dyaq06p](https://imgur.com/gallery/dyaq06p)\n\nsome notes:\n\n1. the finished product image contains a metal striper. this is a roller from a golf course rough mower (toro 4500d). i work at a golf course and this roller was no longer in service and going to be scrap metal so i was able to take it and use it for residential use.\n2. i switch between the metal striper and pvc striper depending on how i'm feeling that day. i do not see a huge difference between how they stripe.\n3. i use the same chain, carabiners, and shackles for each striper.\n4. the metal striper holds in the shackle by a hose clamp because it is not threaded. \n5. this is what i made after testing multiple stripers such as dragging a mat behind the mower and dragging the pvc (instead of rolling)\n6. i have found that a roller puts down better stripes than dragging something\n\nfeel free to leave any questions, comments, or suggestions.\n\ni am currently building a parts list to make a diy checkmate striper with boat rollers. \n\nhopefully that will be made in the winter and can let everyone know how it worked out.", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/jcjzhb/how_i_made_my_diy_lawn_striper/", "identifyer": 225121, "year": "2020"}, {"Unnamed: 0": 225150, "autor": "Pistol4469", "date": 1602822998000, "content": "3rd mow post-overseed /!/ Overseeded 9/14\n\nThe rain and Milo combo made the lawn take off this past week. \n\nHad to wait a week between 2nd and today’s mow due to rain. Grass was long as hell 🤦🏽‍♂️\n\nDid checkerboard passes to ensure a complete cut. Didn’t use my DIY striper this time, just mower lines, but still looks pretty straight to me 😃\n\nMowing again on Sunday will give the striper another go.\n\n[Not a bad view  ](https://imgur.com/a/yIexof1)", "link": "https://www.reddit.com/r/lawncare/comments/jc3dby/3rd_mow_postoverseed/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3rd mow post-overseed /!/ overseeded 9/14\n\nthe rain and milo combo made the lawn take off this past week. \n\nhad to wait a week between 2nd and today’s mow due to rain. grass was long as hell 🤦🏽‍♂️\n\ndid checkerboard passes to ensure a complete cut. didn’t use my -----> diy !!!  striper this time, just mower lines, but still looks pretty straight to me 😃\n\nmowing again on sunday will give the striper another go.\n\n[not a bad view  ](https://imgur.com/a/yiexof1)", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/jc3dby/3rd_mow_postoverseed/", "identifyer": 225150, "year": "2020"}, {"Unnamed: 0": 226399, "autor": "justforrazors", "date": 1604282299000, "content": "Fall reseed on new property results (6b) /!/ I posted a couple months back about the dismal yard I inherited along with a wonderful new house. We moved in August 21st and I really started focusing on the lawn in the second week of September after getting our previous house remodeled and up on the market. This lawn still has some Bermuda issues that I plan to address either with aggressive Tenacity applications and some small areas that will get full nukes/renos next summer. It is far from perfect, but for being the first lawn I've done more than just throw down some weed and feed on, I'm pretty happy with the results. In addition, we removed several trees, the basketball hoop base, and started a regrade on the worst of the sloped area. It's been a busy fall!\n\n[pics inside](http://imgur.com/a/vf4oqlt)\n\nProcess as follows: dethatched, scalped, bagged clippings. \nAerated, overseeded at 6lbs/1000 with a local blend of KBG/TTTF, watered the hell out of it for a week with an above ground sprinkler setup. \nApplied bag rate of slow release lime and a local starter fertilizer (16/20/5) at .5 lb N/1000 1 week after overseed. \nEnded up touching up a couple areas 2 weeks in after a mow with a reel mower, but ultimately a lot of the areas aren't getting the coverage they need with the diy sprinkler system, and working 24 hour shifts means I am not home often enough to do it by hand. Irrigation is going in first thing in the spring, down payment has already been paid. \n\nSeed went down 9/25, this is today post 3rd mow. While far from perfect, I'm very happy with the progress I've made in a little over a month!", "link": "https://www.reddit.com/r/lawncare/comments/jmeusr/fall_reseed_on_new_property_results_6b/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "fall reseed on new property results (6b) /!/ i posted a couple months back about the dismal yard i inherited along with a wonderful new house. we moved in august 21st and i really started focusing on the lawn in the second week of september after getting our previous house remodeled and up on the market. this lawn still has some bermuda issues that i plan to address either with aggressive tenacity applications and some small areas that will get full nukes/renos next summer. it is far from perfect, but for being the first lawn i've done more than just throw down some weed and feed on, i'm pretty happy with the results. in addition, we removed several trees, the basketball hoop base, and started a regrade on the worst of the sloped area. it's been a busy fall!\n\n[pics inside](http://imgur.com/a/vf4oqlt)\n\nprocess as follows: dethatched, scalped, bagged clippings. \naerated, overseeded at 6lbs/1000 with a local blend of kbg/tttf, watered the hell out of it for a week with an above ground sprinkler setup. \napplied bag rate of slow release lime and a local starter fertilizer (16/20/5) at .5 lb n/1000 1 week after overseed. \nended up touching up a couple areas 2 weeks in after a mow with a reel mower, but ultimately a lot of the areas aren't getting the coverage they need with the -----> diy !!!  sprinkler system, and working 24 hour shifts means i am not home often enough to do it by hand. irrigation is going in first thing in the spring, down payment has already been paid. \n\nseed went down 9/25, this is today post 3rd mow. while far from perfect, i'm very happy with the progress i've made in a little over a month!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/jmeusr/fall_reseed_on_new_property_results_6b/", "identifyer": 226399, "year": "2020"}, {"Unnamed: 0": 227993, "autor": "LegacyLemon", "date": 1592496429000, "content": "Here is my DIY striper from an old rubber mat + results /!/ http://imgur.com/a/47RjFjN for pictures and double wide stripes\n\nFor the old rubber mat, I rolled it up then used some string to tie it into a roll. Then I threaded a metal wire through the middle of the roll, so it poked out on each end. I took another wire and attached it to some holes in the side of the mower. Using the wire from the roll, I wound the ends around the second wire, to create a secure way to attach the roll to the mower. It took some playing around to get the lengths of the wires right to center the striper on the mower. Lastly, I tied a rope around the center of the roll, and attached the other end to the bar where the starter cord is. The purpose of this is to aid in reversing. Normally with a striper you can't roll the mower backwards, as it gets caught in the striper. Now I use the rope to lift up the striper so I can reverse freely. \n\nLet me know what you think of my simple design, and let the results speak for themselves.", "link": "https://www.reddit.com/r/lawncare/comments/hbhirn/here_is_my_diy_striper_from_an_old_rubber_mat/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here is my -----> diy !!!  striper from an old rubber mat + results /!/ http://imgur.com/a/47rjfjn for pictures and double wide stripes\n\nfor the old rubber mat, i rolled it up then used some string to tie it into a roll. then i threaded a metal wire through the middle of the roll, so it poked out on each end. i took another wire and attached it to some holes in the side of the mower. using the wire from the roll, i wound the ends around the second wire, to create a secure way to attach the roll to the mower. it took some playing around to get the lengths of the wires right to center the striper on the mower. lastly, i tied a rope around the center of the roll, and attached the other end to the bar where the starter cord is. the purpose of this is to aid in reversing. normally with a striper you can't roll the mower backwards, as it gets caught in the striper. now i use the rope to lift up the striper so i can reverse freely. \n\nlet me know what you think of my simple design, and let the results speak for themselves.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/hbhirn/here_is_my_diy_striper_from_an_old_rubber_mat/", "identifyer": 227993, "year": "2020"}, {"Unnamed: 0": 228391, "autor": "warmoth91", "date": 1593132744000, "content": "DIY lawn striper for SP2100 EGO mower /!/ Just thought I'd show my DIY lawn striper in action on my EGO mower. Spent about $40 CAD building it. Currently there is no striping kit you can buy that fits the EGO right out the box, but I've seen some owners modify the checkmate striper. However, ordering the checkmate striper plus shipping comes out to over 180$ CAD which I think is crazy...anyway here it is [https://imgur.com/a/UBv59R9](https://imgur.com/a/UBv59R9). Lawn isn't at its best, but I just had to try the striper out!", "link": "https://www.reddit.com/r/lawncare/comments/hfxxb0/diy_lawn_striper_for_sp2100_ego_mower/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  lawn striper for sp2100 ego mower /!/ just thought i'd show my diy lawn striper in action on my ego mower. spent about $40 cad building it. currently there is no striping kit you can buy that fits the ego right out the box, but i've seen some owners modify the checkmate striper. however, ordering the checkmate striper plus shipping comes out to over 180$ cad which i think is crazy...anyway here it is [https://imgur.com/a/ubv59r9](https://imgur.com/a/ubv59r9). lawn isn't at its best, but i just had to try the striper out!", "sortedWord": "None", "removed": null, "score": 1, "comments": 31, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/hfxxb0/diy_lawn_striper_for_sp2100_ego_mower/", "identifyer": 228391, "year": "2020"}, {"Unnamed: 0": 228664, "autor": "InvadingBacon", "date": 1598822756000, "content": "If it works, then it aint stupid. DIY striping kit /!/ [I built myself a striping unit](https://imgur.com/a/ujWMRTe) to go behind my Troybilt push mower. Its not the best but it works! I think itll fit better on a wider mower.", "link": "https://www.reddit.com/r/lawncare/comments/ijkxb5/if_it_works_then_it_aint_stupid_diy_striping_kit/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "if it works, then it aint stupid. -----> diy !!!  striping kit /!/ [i built myself a striping unit](https://imgur.com/a/ujwmrte) to go behind my troybilt push mower. its not the best but it works! i think itll fit better on a wider mower.", "sortedWord": "None", "removed": null, "score": 1, "comments": 33, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/ijkxb5/if_it_works_then_it_aint_stupid_diy_striping_kit/", "identifyer": 228664, "year": "2020"}, {"Unnamed: 0": 229971, "autor": "andyx1234", "date": 1601087185000, "content": "DIY recipes for adding micronutrients to lawn? /!/ Anyone got a recipe for adding micronutrients to lawn with a hose sprayer? \n\nI've had wood results with stuff from kelp4less and a sprayer, so I thought I'd ask here.", "link": "https://www.reddit.com/r/lawncare/comments/izxep8/diy_recipes_for_adding_micronutrients_to_lawn/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  recipes for adding micronutrients to lawn? /!/ anyone got a recipe for adding micronutrients to lawn with a hose sprayer? \n\ni've had wood results with stuff from kelp4less and a sprayer, so i thought i'd ask here.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/izxep8/diy_recipes_for_adding_micronutrients_to_lawn/", "identifyer": 229971, "year": "2020"}, {"Unnamed: 0": 230312, "autor": "Pistol4469", "date": 1590984709000, "content": "Another Quarantine Lawn Makeover (Northern VA) /!/ The day the sports stopped my boredom as well as my time, since I work in sports tech, rose exponentially to an all time high literally overnight.\n\nThat night was March 11th for me, when the last NBA games were played.  I spent that night and next day doing what everyone else did, literally asked myself and my family. How in the actual F did we get here? And is this really happening, TF? \n\nFriday March 13th, I’d accepted and came to peace with what was going on and as simple as how my good ole friend Ricky Bobby put it “That Just Happened!” I started to think, well now what!?!! And with my typical vice of playing golf shut down, I recognized that I needed something to pass the time. \n\nSo what was my bright idea??\n\nWho’s up for a good ole fashion block lawn war. My neighbors all have decades of DIY under their belts over me and/or have expensive lawn services so their lawns always look like Nationals Park. I had a lawn service too, but just mowing not anything else for the 4.5 years we’ve lived here.  I didn’t even have a lawnmower, but I cancelled my lawn service and bought a Troybilt cheapy from HD and started a very painful, hurtful but absolutely gratifying quarantine project.\n\nI knew I was definitely the underdog so I dove headfirst into YT, blogs, all the sites on lawn care maintenance, products and before/afters, I mean I went deep and wide. Absorbing everything I could.  Thanks to all the other Lawn DIYers contributors out there.  \n\nLawn vitals:\nTransition zone/MidAtlantic \n~7k sq ft\nI think fescue and possibly mixed with rye\nIrrigation system (5 zones)\n\nHere’s what went down after many countless/sleepless nights researching my eyeballs out. \n\nFirst attempt: Scott’s 50lb Thick’s Lawn 3-in-1\nMarch 23rd, mowed lowest level, manually “aerated” with 2 hand held foot aerator tools from HD. Horrible idea. Painful and took forever\nWatered 2x/day and after 2 weeks, Weeds galore and literally no germination. Crabgrass, chickweed, plaintains and others. It was a disgrace.  \n\nNow it was on! I’m pissed now and dead set on coming off the canvas fighting back. This spring still! \n\nI Immediately ordered and rushed delivered Tenacity, Turbo surfactant, a SunJoe Dethatcher, SJ edger and a weedwhacker.\n\nMade a plan, did a sketch of my yard, sized up my opponent and started listing every thing I needed. I realized you can’t go in underbudgeted nor underprepared to win or the lawn will make you look silly real quick. \n\nHere’s what I gathered:\n50 lb KY31 TTTF\n10lb of Lime\n5 bags of Milo\n40 lb Lessco Starter Fert\n13 bales of Peat Moss\n\nTimeline:\n4/16 - Lime (granular)\n4/17- Tenacity 1st app w NIS\n4/25 - Tenacity 2nd app w NIS  \nMowing 1x week at 2” height\n\n5/12 - Leveled low spot from previously removed stump. You can make out the white circle outline about 5 ft in diameter in middle of lawn on before pic. About 4” at the deepest center points.\n8 bags of 50 lb sand \n5 cu ft of top soil (generic)\n1 cu ft of premium top soil (Scott’s)\n40 sq ft of HD Fescue sod\n\n5/15-Game Day (went on IR afterwards lol)\nmowed lowest height \nScarified (2 passes w alternate directions)\nOverseed at 7lb per 1k sqft \nInsecticide \nStarter fertilizer (Lessco)\nMilorganite \nTenacity 3rd App w/o NIS\n1/4 layer of Peat Moss\n\nSprinklers set for 4am and 8:30pm \n5 zones 12 mins each zone.\n\nMy learnings:\nMilo is king\nSunJoe is alright in my books\nWater Bills gonna suck\nRd 2 coming this Fall - “Let’s get it on”\n\nGot lucky with such a mild Spring. Hopefully the 90+ days hold off for a few more weeks after these roots are more matured.\n\nHow we look?\n\n[May 10th to May 31st](https://imgur.com/a/5ylK1Ym)", "link": "https://www.reddit.com/r/lawncare/comments/gudobc/another_quarantine_lawn_makeover_northern_va/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "another quarantine lawn makeover (northern va) /!/ the day the sports stopped my boredom as well as my time, since i work in sports tech, rose exponentially to an all time high literally overnight.\n\nthat night was march 11th for me, when the last nba games were played.  i spent that night and next day doing what everyone else did, literally asked myself and my family. how in the actual f did we get here? and is this really happening, tf? \n\nfriday march 13th, i’d accepted and came to peace with what was going on and as simple as how my good ole friend ricky bobby put it “that just happened!” i started to think, well now what!?!! and with my typical vice of playing golf shut down, i recognized that i needed something to pass the time. \n\nso what was my bright idea??\n\nwho’s up for a good ole fashion block lawn war. my neighbors all have decades of -----> diy !!!  under their belts over me and/or have expensive lawn services so their lawns always look like nationals park. i had a lawn service too, but just mowing not anything else for the 4.5 years we’ve lived here.  i didn’t even have a lawnmower, but i cancelled my lawn service and bought a troybilt cheapy from hd and started a very painful, hurtful but absolutely gratifying quarantine project.\n\ni knew i was definitely the underdog so i dove headfirst into yt, blogs, all the sites on lawn care maintenance, products and before/afters, i mean i went deep and wide. absorbing everything i could.  thanks to all the other lawn diyers contributors out there.  \n\nlawn vitals:\ntransition zone/midatlantic \n~7k sq ft\ni think fescue and possibly mixed with rye\nirrigation system (5 zones)\n\nhere’s what went down after many countless/sleepless nights researching my eyeballs out. \n\nfirst attempt: scott’s 50lb thick’s lawn 3-in-1\nmarch 23rd, mowed lowest level, manually “aerated” with 2 hand held foot aerator tools from hd. horrible idea. painful and took forever\nwatered 2x/day and after 2 weeks, weeds galore and literally no germination. crabgrass, chickweed, plaintains and others. it was a disgrace.  \n\nnow it was on! i’m pissed now and dead set on coming off the canvas fighting back. this spring still! \n\ni immediately ordered and rushed delivered tenacity, turbo surfactant, a sunjoe dethatcher, sj edger and a weedwhacker.\n\nmade a plan, did a sketch of my yard, sized up my opponent and started listing every thing i needed. i realized you can’t go in underbudgeted nor underprepared to win or the lawn will make you look silly real quick. \n\nhere’s what i gathered:\n50 lb ky31 tttf\n10lb of lime\n5 bags of milo\n40 lb lessco starter fert\n13 bales of peat moss\n\ntimeline:\n4/16 - lime (granular)\n4/17- tenacity 1st app w nis\n4/25 - tenacity 2nd app w nis  \nmowing 1x week at 2” height\n\n5/12 - leveled low spot from previously removed stump. you can make out the white circle outline about 5 ft in diameter in middle of lawn on before pic. about 4” at the deepest center points.\n8 bags of 50 lb sand \n5 cu ft of top soil (generic)\n1 cu ft of premium top soil (scott’s)\n40 sq ft of hd fescue sod\n\n5/15-game day (went on ir afterwards lol)\nmowed lowest height \nscarified (2 passes w alternate directions)\noverseed at 7lb per 1k sqft \ninsecticide \nstarter fertilizer (lessco)\nmilorganite \ntenacity 3rd app w/o nis\n1/4 layer of peat moss\n\nsprinklers set for 4am and 8:30pm \n5 zones 12 mins each zone.\n\nmy learnings:\nmilo is king\nsunjoe is alright in my books\nwater bills gonna suck\nrd 2 coming this fall - “let’s get it on”\n\ngot lucky with such a mild spring. hopefully the 90+ days hold off for a few more weeks after these roots are more matured.\n\nhow we look?\n\n[may 10th to may 31st](https://imgur.com/a/5ylk1ym)", "sortedWord": "None", "removed": null, "score": 3, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/gudobc/another_quarantine_lawn_makeover_northern_va/", "identifyer": 230312, "year": "2020"}, {"Unnamed: 0": 230620, "autor": "bibliotecha", "date": 1601918976000, "content": "[6b] Fall renovation updates - 1st timer - Tall fescue /!/ Moved to a new house in july. The yard (1000sq ft front yard) was seriously neglected. Edges were overgrown onto the sidewalk and the yard was full of wild violet, crabgrass, and nutsedge. \n\nWeed shot: https://imgur.com/g1PwZFj\n\nI tried a general roundup weed killer and didn’t have too much luck. I then went hard with some tryclopyr to get rid of the wild violet. Probably 2 applications 2 weeks apart. I’m not exaggerating when I saw the wild violet was EVERYWHERE. \n\nThe tryclopyr worked a charm and all of the wild violet died off. I was very happy.\n\nAt this point I decided it was time to dethatch. At the beginning I used a regular metal gardening rake and pulled up SO MUCH THATCH. It was astounding. However, there will still SO MUCH MORE THATCH TO GET. I went and bought a proper dethatching rake and went over the yard again. Even more thatch came out. I bagged it all and had another look at the yard. Still a lot of thatch. Manual dethatching is a lot of labor so this time I decided to bite the bullet and just buy the electric greenworks dethatcher. It worked very very well. I went over the yard twice with that and I was starting to see bare soil. This made me very happy. \n\nI scalped the yard and overseeded with tall fescue. I applied a start fert with tenacity in it. Here is what everything was looking like:\n\nhttps://imgur.com/jSll1fo\n\nLooked rough. Wife was questioning the process as this was my first time. Hell, I was questioning the process. I  watered the shit out of it. I started getting sprouts on day five or so. I kept watering it and obsessing every day. It was coming in nicely but I had definitely missed so many spots. \n\nI overseeded again two weeks later. I would also patch spots by manually dropping seed whenever I saw a bare spot. I probably dropped WAY too much seed but I was obsessed. I also covered with peat moss this time as I think birds ate a lot of my seed. Here is what it looked like after the 2nd reseed:\n\nhttps://imgur.com/uynf6cJ\n\nTemps started dropping and we got some much needed rain. The yard started to shine. I dropped another dose of fert with tenacity and it really started to green up and grow. \n\nHere is a picture 26 days after the first overseed:\n\nhttps://imgur.com/MHxWI9i\n\nLooking pretty good at this point. Neighbors have started to notice and I’m getting a lot of comments and encouragement. \n\nHere is what we have today. \n\nhttps://imgur.com/seS8GLf\n\nI’ve spent the last two weeks focusing on learning to edge and patching spots on the skirt next to the curb. I plan to fertilize again in a week or so and I also have some nutsedge herbicide on the way as it appears that nut grass is my only major weed problem at the moment. \n\nI’m excited for spring and plan to overseed again. I’m also looking into buying a new mower and building a DIY striping kit. I’m officially obsessed.", "link": "https://www.reddit.com/r/lawncare/comments/j5nrj6/6b_fall_renovation_updates_1st_timer_tall_fescue/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[6b] fall renovation updates - 1st timer - tall fescue /!/ moved to a new house in july. the yard (1000sq ft front yard) was seriously neglected. edges were overgrown onto the sidewalk and the yard was full of wild violet, crabgrass, and nutsedge. \n\nweed shot: https://imgur.com/g1pwzfj\n\ni tried a general roundup weed killer and didn’t have too much luck. i then went hard with some tryclopyr to get rid of the wild violet. probably 2 applications 2 weeks apart. i’m not exaggerating when i saw the wild violet was everywhere. \n\nthe tryclopyr worked a charm and all of the wild violet died off. i was very happy.\n\nat this point i decided it was time to dethatch. at the beginning i used a regular metal gardening rake and pulled up so much thatch. it was astounding. however, there will still so much more thatch to get. i went and bought a proper dethatching rake and went over the yard again. even more thatch came out. i bagged it all and had another look at the yard. still a lot of thatch. manual dethatching is a lot of labor so this time i decided to bite the bullet and just buy the electric greenworks dethatcher. it worked very very well. i went over the yard twice with that and i was starting to see bare soil. this made me very happy. \n\ni scalped the yard and overseeded with tall fescue. i applied a start fert with tenacity in it. here is what everything was looking like:\n\nhttps://imgur.com/jsll1fo\n\nlooked rough. wife was questioning the process as this was my first time. hell, i was questioning the process. i  watered the shit out of it. i started getting sprouts on day five or so. i kept watering it and obsessing every day. it was coming in nicely but i had definitely missed so many spots. \n\ni overseeded again two weeks later. i would also patch spots by manually dropping seed whenever i saw a bare spot. i probably dropped way too much seed but i was obsessed. i also covered with peat moss this time as i think birds ate a lot of my seed. here is what it looked like after the 2nd reseed:\n\nhttps://imgur.com/uynf6cj\n\ntemps started dropping and we got some much needed rain. the yard started to shine. i dropped another dose of fert with tenacity and it really started to green up and grow. \n\nhere is a picture 26 days after the first overseed:\n\nhttps://imgur.com/mhxwi9i\n\nlooking pretty good at this point. neighbors have started to notice and i’m getting a lot of comments and encouragement. \n\nhere is what we have today. \n\nhttps://imgur.com/ses8glf\n\ni’ve spent the last two weeks focusing on learning to edge and patching spots on the skirt next to the curb. i plan to fertilize again in a week or so and i also have some nutsedge herbicide on the way as it appears that nut grass is my only major weed problem at the moment. \n\ni’m excited for spring and plan to overseed again. i’m also looking into buying a new mower and building a -----> diy !!!  striping kit. i’m officially obsessed.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/j5nrj6/6b_fall_renovation_updates_1st_timer_tall_fescue/", "identifyer": 230620, "year": "2020"}, {"Unnamed: 0": 230646, "autor": "Pistol4469", "date": 1601858075000, "content": "Well - here it is. Extremely happy and thankful that things worked out /!/ 7a - Nova\n7k sq ft (front and back)\nFront - Overseed (TTTF and Rye)\nBack - Nuke/Reseed (TTTF and Rye)\n\nSept 11 - Sept 14\n\nPrep:\nFront yard -Tenacity w NIS 2x (2 weeks apart) August 8th &amp; 22nd\nMowed lower and lower until seed down \nDetached 4 times - each direction twice\nRaked out dead areas and used shovel to really break up/till the topsoil\n\n\nBackyard - Glyphosate w NIS 2x (10 days apart) August 9th and 19th \nMowed lower and lower until seed down \nDetached 4 times - each direction twice\n\n*Applied Tenacity on backyard at first, but the Nutsedge that took over didn’t even flinch. Not on Tenacity’s list but didn’t know what the seeds were 😂 \n\nSupplies:\n50 lb Kentucky 31 TTTF\n50 lb Oregon ARye Grass (overseeding TTF w KBG next Fall)\n9 bales of 3.8 Cu Yd Peat Moss\n2 bags of Scott’s Starter w Weed preventer\n5 bags of Milorganite \n2 cu yds of Topsoil/Compost mix\n- needed 5 more Scott’s topsoil with Starter Fertilizer \n\nTools:\nSunJoe Dethatcher (best $120 I’ve ever spent)\n\nManual foot Aerator\n\nMower\n\nLawn flags\n\nPinwheels \n\nShovel\n\nLawn cart/wheelbarrow \n\nTarps\n\nScott’s mini-Guard broadcast spreader \n\nSeed down: Front yard (9/14/20)\n\nApplied topsoil/compost mix to raked out bare spots \n\nApplied Tenacity w/o NIS\n\nSeeded at 7 lbs/1k rate \n\nScott’s starter w weed preventer\n\nMilorganite \n\nSowed 4 bales of Peat Moss (3.8 cu yd) by hand\n\nSeed down: Backyard (9/12/20)\n\nPut down 2 cu yds of topsoil/compost mix (extremely painful 😂) half of backyard is 45 degree slope up\n\nApplied Tenacity w/o NIS\n\nSeeded at 12 lbs/1k rate \n\nScott’s starter w weed preventer\n\nMilorganite \n\nSowed 5 bales of Peat Moss (3.8 cu yd) by hand\n\nPics are of before prep, progress of weed killing, pre-seed down, final seed down pics, progress through the weeks.\n\nCame out better than I expected \nTweaking my DIY striper, don’t roast me too badly \n\n[how’d I do?](https://imgur.com/gallery/o0xIG5y)", "link": "https://www.reddit.com/r/lawncare/comments/j59vru/well_here_it_is_extremely_happy_and_thankful_that/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "well - here it is. extremely happy and thankful that things worked out /!/ 7a - nova\n7k sq ft (front and back)\nfront - overseed (tttf and rye)\nback - nuke/reseed (tttf and rye)\n\nsept 11 - sept 14\n\nprep:\nfront yard -tenacity w nis 2x (2 weeks apart) august 8th &amp; 22nd\nmowed lower and lower until seed down \ndetached 4 times - each direction twice\nraked out dead areas and used shovel to really break up/till the topsoil\n\n\nbackyard - glyphosate w nis 2x (10 days apart) august 9th and 19th \nmowed lower and lower until seed down \ndetached 4 times - each direction twice\n\n*applied tenacity on backyard at first, but the nutsedge that took over didn’t even flinch. not on tenacity’s list but didn’t know what the seeds were 😂 \n\nsupplies:\n50 lb kentucky 31 tttf\n50 lb oregon arye grass (overseeding ttf w kbg next fall)\n9 bales of 3.8 cu yd peat moss\n2 bags of scott’s starter w weed preventer\n5 bags of milorganite \n2 cu yds of topsoil/compost mix\n- needed 5 more scott’s topsoil with starter fertilizer \n\ntools:\nsunjoe dethatcher (best $120 i’ve ever spent)\n\nmanual foot aerator\n\nmower\n\nlawn flags\n\npinwheels \n\nshovel\n\nlawn cart/wheelbarrow \n\ntarps\n\nscott’s mini-guard broadcast spreader \n\nseed down: front yard (9/14/20)\n\napplied topsoil/compost mix to raked out bare spots \n\napplied tenacity w/o nis\n\nseeded at 7 lbs/1k rate \n\nscott’s starter w weed preventer\n\nmilorganite \n\nsowed 4 bales of peat moss (3.8 cu yd) by hand\n\nseed down: backyard (9/12/20)\n\nput down 2 cu yds of topsoil/compost mix (extremely painful 😂) half of backyard is 45 degree slope up\n\napplied tenacity w/o nis\n\nseeded at 12 lbs/1k rate \n\nscott’s starter w weed preventer\n\nmilorganite \n\nsowed 5 bales of peat moss (3.8 cu yd) by hand\n\npics are of before prep, progress of weed killing, pre-seed down, final seed down pics, progress through the weeks.\n\ncame out better than i expected \ntweaking my -----> diy !!!  striper, don’t roast me too badly \n\n[how’d i do?](https://imgur.com/gallery/o0xig5y)", "sortedWord": "None", "removed": null, "score": 1, "comments": 29, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/j59vru/well_here_it_is_extremely_happy_and_thankful_that/", "identifyer": 230646, "year": "2020"}, {"Unnamed: 0": 230755, "autor": "shockstyle25", "date": 1602440685000, "content": "Lawn leveling tool suggestions /!/ More than $120 seems pricey but the DIY pvc pipe route seems like it wouldn’t be effective.\nI see metal handles, wood handles, extending and fixed handles.\nAny suggestions from you experienced “professionals”", "link": "https://www.reddit.com/r/lawncare/comments/j9ajlm/lawn_leveling_tool_suggestions/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lawn leveling tool suggestions /!/ more than $120 seems pricey but the -----> diy !!!  pvc pipe route seems like it wouldn’t be effective.\ni see metal handles, wood handles, extending and fixed handles.\nany suggestions from you experienced “professionals”", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/j9ajlm/lawn_leveling_tool_suggestions/", "identifyer": 230755, "year": "2020"}, {"Unnamed: 0": 230832, "autor": "Pretend_i_Care", "date": 1591719996000, "content": "6-week Bermuda Bible Transformation - 7a /!/ [6-week Bermuda Bible Transformation](https://imgur.com/gallery/6runHmE)\n\nLet me start by saying I’m totally new to the DIY lawn care. I read through the Bermuda Bible about 10 times, and listened to advice on here. My post history shows my game plan starting 4/23/2020 - consistently mow at 1.25” and give the lawn low doses of nitrogen (46-0-0) every 7-10 days. Thanks to the weather patterns in Oklahoma, I didn’t have to turn on the sprinklers until last week. \n\nIn the album, you’ll notice the biggest issue was the back yard. There was bermuda, it was just REALLY thin from previous homeowner mowing at about 4” HOC. Keeping it mowed nice and tight really helped thicken up the yard. At one point in the process my wife pointed at another yard and said “I like their lawn” (thin bermuda with a HOC around 3”). Then about a week ago, 2 days after I had mowed, she said “are you going to mow tonight, the grass is getting tall again” (it was MAYBE 1.75”). I’ve converted her!\n\nI’ll also note that last Fall I WAY over-applied Pre-E/Post-E and nuked the perimeter of my back yard. Hadn’t calibrated my backpack sprayer and pretty much fucked up. It’s been crazy to see how fast Bermuda spreads. It seems like I’ve been nurturing this yard for a year, but using progress pics and realizing it’s truly only been 6 weeks is pretty incredible. Went from being one of the weaker yards in the neighborhood to a golf course look. \n\nNext plan is start PGR - I’ve been mowing every other day this past week to keep up with it. Waiting for new sprayer accessories to get in so I can make sure I’m applying very measured amounts. Excited to see what the yard will look like in another 6 weeks.", "link": "https://www.reddit.com/r/lawncare/comments/gzqgjz/6week_bermuda_bible_transformation_7a/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "6-week bermuda bible transformation - 7a /!/ [6-week bermuda bible transformation](https://imgur.com/gallery/6runhme)\n\nlet me start by saying i’m totally new to the -----> diy !!!  lawn care. i read through the bermuda bible about 10 times, and listened to advice on here. my post history shows my game plan starting 4/23/2020 - consistently mow at 1.25” and give the lawn low doses of nitrogen (46-0-0) every 7-10 days. thanks to the weather patterns in oklahoma, i didn’t have to turn on the sprinklers until last week. \n\nin the album, you’ll notice the biggest issue was the back yard. there was bermuda, it was just really thin from previous homeowner mowing at about 4” hoc. keeping it mowed nice and tight really helped thicken up the yard. at one point in the process my wife pointed at another yard and said “i like their lawn” (thin bermuda with a hoc around 3”). then about a week ago, 2 days after i had mowed, she said “are you going to mow tonight, the grass is getting tall again” (it was maybe 1.75”). i’ve converted her!\n\ni’ll also note that last fall i way over-applied pre-e/post-e and nuked the perimeter of my back yard. hadn’t calibrated my backpack sprayer and pretty much fucked up. it’s been crazy to see how fast bermuda spreads. it seems like i’ve been nurturing this yard for a year, but using progress pics and realizing it’s truly only been 6 weeks is pretty incredible. went from being one of the weaker yards in the neighborhood to a golf course look. \n\nnext plan is start pgr - i’ve been mowing every other day this past week to keep up with it. waiting for new sprayer accessories to get in so i can make sure i’m applying very measured amounts. excited to see what the yard will look like in another 6 weeks.", "sortedWord": "None", "removed": null, "score": 4, "comments": 13, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/gzqgjz/6week_bermuda_bible_transformation_7a/", "identifyer": 230832, "year": "2020"}, {"Unnamed: 0": 231215, "autor": "Bresus09", "date": 1585708418000, "content": "How to eliminate tire tracks in lawn when mowing? /!/ Everyone’s walk behind rotary mower leaves tire tracks in the lawn when mowing. Any DIY ideas to minimize them? I think it would provide a cleaner look without the tire marks.", "link": "https://www.reddit.com/r/lawncare/comments/fsqwvm/how_to_eliminate_tire_tracks_in_lawn_when_mowing/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to eliminate tire tracks in lawn when mowing? /!/ everyone’s walk behind rotary mower leaves tire tracks in the lawn when mowing. any -----> diy !!!  ideas to minimize them? i think it would provide a cleaner look without the tire marks.", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/fsqwvm/how_to_eliminate_tire_tracks_in_lawn_when_mowing/", "identifyer": 231215, "year": "2020"}, {"Unnamed: 0": 231560, "autor": "TheHUUS", "date": 1584334411000, "content": "Best riding lawnmower with enclosed cab /!/ Title says it, I can’t seem to find any mowers at all with an enclosed cab for all-weather conditions.  I found some DIY cab builds but manufacturer builds are near impossible to find. \n\nAnyone know of any type of mower (z turn also) with a good cab or enclosure? (No soft covers)", "link": "https://www.reddit.com/r/lawncare/comments/fjfdjb/best_riding_lawnmower_with_enclosed_cab/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best riding lawnmower with enclosed cab /!/ title says it, i can’t seem to find any mowers at all with an enclosed cab for all-weather conditions.  i found some -----> diy !!!  cab builds but manufacturer builds are near impossible to find. \n\nanyone know of any type of mower (z turn also) with a good cab or enclosure? (no soft covers)", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/fjfdjb/best_riding_lawnmower_with_enclosed_cab/", "identifyer": 231560, "year": "2020"}, {"Unnamed: 0": 232816, "autor": "Pretend_i_Care", "date": 1593710666000, "content": "8-week update. Bermuda Grass in Tulsa, OK (7a). And a PSA about leveling your mower!! /!/ [8-week progress, and uneven mower deck](https://imgur.com/gallery/VP0CRD2)\n\nSo, this is my first time diving in to the whole DIY lawn care lifestyle (yes, lifestyle - mowing every other day). You can see my strategy and game plan from my previous posts. I’m super happy with the success I’ve had at encouraging my grass to SPREAD and get thick. I knew I would have to mow LOW and mow OFTEN, especially as it got warmer outside. \n\nI initially scalped at 1” (lowest my John Deere Zero Turn will go). Then I bumped up to 1.25” for my routine HOC. I noticed the mower started cutting a little funny but just had to make a few extra passes to get it all level. Well, with the heat wave we’ve had, my grass has been growing like crazy so I decided to take a little stress off the grass and raise the HOC to 1.5”. Now my mower SUCKS! Having to make 3 passes just to get everything smooth. It was like the right blade (3 blades on my 54”) was barely even cutting. I’ve sharpened blades, checked tire pressure, greased pulleys, etc. Nothing. Finally, after I mowed last night I took a ruler out there and measured my grass.... right at 1”. Turns out when I leveled my mower at the beginning of the season (at 1”) I had the deck sitting on the anti-scalp wheels. So now when I’m raising my HOC I’m actually just raising the ass-end of the deck and the front is still riding those anti-scalp wheels. And the right blade is “further back” in the deck, which makes sense as to why that particular blade wasn’t doing much. \n\nLevel your mowing deck, folks. And check it often.", "link": "https://www.reddit.com/r/lawncare/comments/hk18pq/8week_update_bermuda_grass_in_tulsa_ok_7a_and_a/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "8-week update. bermuda grass in tulsa, ok (7a). and a psa about leveling your mower!! /!/ [8-week progress, and uneven mower deck](https://imgur.com/gallery/vp0crd2)\n\nso, this is my first time diving in to the whole -----> diy !!!  lawn care lifestyle (yes, lifestyle - mowing every other day). you can see my strategy and game plan from my previous posts. i’m super happy with the success i’ve had at encouraging my grass to spread and get thick. i knew i would have to mow low and mow often, especially as it got warmer outside. \n\ni initially scalped at 1” (lowest my john deere zero turn will go). then i bumped up to 1.25” for my routine hoc. i noticed the mower started cutting a little funny but just had to make a few extra passes to get it all level. well, with the heat wave we’ve had, my grass has been growing like crazy so i decided to take a little stress off the grass and raise the hoc to 1.5”. now my mower sucks! having to make 3 passes just to get everything smooth. it was like the right blade (3 blades on my 54”) was barely even cutting. i’ve sharpened blades, checked tire pressure, greased pulleys, etc. nothing. finally, after i mowed last night i took a ruler out there and measured my grass.... right at 1”. turns out when i leveled my mower at the beginning of the season (at 1”) i had the deck sitting on the anti-scalp wheels. so now when i’m raising my hoc i’m actually just raising the ass-end of the deck and the front is still riding those anti-scalp wheels. and the right blade is “further back” in the deck, which makes sense as to why that particular blade wasn’t doing much. \n\nlevel your mowing deck, folks. and check it often.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hk18pq/8week_update_bermuda_grass_in_tulsa_ok_7a_and_a/", "identifyer": 232816, "year": "2020"}, {"Unnamed: 0": 233388, "autor": "BuddyKane", "date": 1595908226000, "content": "[Zone 6b] Please Help - Suddenly hosting my wedding reception in my back yard in two months... /!/ Friendly people of r/lawncare, this long-time lurker and burgeoning weekend lawncare warrior needs your help. I’ll spare you the play-by-play, but long story short is my pre-COVID wedding plans were scrapped in light of COVID. With just over two months to go (10/03/20), we are likely holding a small back-yard gathering of our wedding party and their significant others, about 25 people total, that evening for a small dinner and drinks. \n\nI will update with some photos tomorrow morning. Let’s just say it is mostly green and not god awful, and some of it is grass but other parts are thick with weeds and undesirable crabgrass and other weedy grasses. I’d like it to be better for the wedding day evening. I planned for it to be better next year, and had ideas about work to do in September and October, but that work must be done in August and September now. I’ve read several of the sidebars and studied the sticky post at the top about improving lawns as well. Please review my plan below and let me know your suggestions and comments and criticisms? \n\n**I am in zone 6b in Kansas City.** I think I have a combination of kentucky bluegrass, ryegrass, fescue, and weed junk grasses (sorry I’ll post photos in the morning, am somewhat freaking out getting this together tonight). The back yard is my priority and where I will focus most as that is where we will gather, but will do the whole yard the same if possible. Each yard is approx. 2200 sq feet, with a 600 sq feet side yard. I aerated last fall and put down an application of weed and feed this spring, but was really planning to attack this fall. It doesn’t need to be perfect but I’d like it to be better if I can by the wedding date. I have the ability to water as much as you all recommend. I’m working from home and will be for the indefinite future.   \n\n**My Plan**: \n\n1. I purchased a Sunjoe detatcher and scarifier. The lawn has thick thatch in places and this hasn’t been done in years. I will thatch. I can scarify but less knowledgeable about what that may do to the lawn or how to work into this plan. I will be able to do this early next week and know it needs to be done asap.  \n2. I will do a top layer of soil and attempt to make the yard somewhat more level (though I know I can’t do that with one application of dirt, its gonna take a few years). I'm not trying to make it flat, but maybe lessen some immediate dips and holes from pulling weeds and critters digging. \n3. I will seed. Not sure what type of seed or how yet. Use a spreader? Get that green mossy seedy stuff? Something else? \n4. I will fertilize with Scotts Weed and Feed. I can do something else instead, or in addition to the weed and feed. I know you’re supposed to follow the prescribed directions and not use illegal substances, but if there is like a steroids of lawncare, I’d inject it. I don't necessarily know how often or in what order to apply various treatments if I combine multiple.   \n5. I will water. And then water some more. And then water more. I will then whisper sweet nothings to each blade of grass. I will read the grass children’s books and show it Disney movies so it can grow strong and tall. \n\nWhat suggestions do you have? The yard has a lot of bugs because it is a thatch haven--any good DIY treatments or things to keep bugs down?  \n\nThank you for taking time to drop your knowledge, it is very much appreciated.", "link": "https://www.reddit.com/r/lawncare/comments/hz7i8g/zone_6b_please_help_suddenly_hosting_my_wedding/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[zone 6b] please help - suddenly hosting my wedding reception in my back yard in two months... /!/ friendly people of r/lawncare, this long-time lurker and burgeoning weekend lawncare warrior needs your help. i’ll spare you the play-by-play, but long story short is my pre-covid wedding plans were scrapped in light of covid. with just over two months to go (10/03/20), we are likely holding a small back-yard gathering of our wedding party and their significant others, about 25 people total, that evening for a small dinner and drinks. \n\ni will update with some photos tomorrow morning. let’s just say it is mostly green and not god awful, and some of it is grass but other parts are thick with weeds and undesirable crabgrass and other weedy grasses. i’d like it to be better for the wedding day evening. i planned for it to be better next year, and had ideas about work to do in september and october, but that work must be done in august and september now. i’ve read several of the sidebars and studied the sticky post at the top about improving lawns as well. please review my plan below and let me know your suggestions and comments and criticisms? \n\n**i am in zone 6b in kansas city.** i think i have a combination of kentucky bluegrass, ryegrass, fescue, and weed junk grasses (sorry i’ll post photos in the morning, am somewhat freaking out getting this together tonight). the back yard is my priority and where i will focus most as that is where we will gather, but will do the whole yard the same if possible. each yard is approx. 2200 sq feet, with a 600 sq feet side yard. i aerated last fall and put down an application of weed and feed this spring, but was really planning to attack this fall. it doesn’t need to be perfect but i’d like it to be better if i can by the wedding date. i have the ability to water as much as you all recommend. i’m working from home and will be for the indefinite future.   \n\n**my plan**: \n\n1. i purchased a sunjoe detatcher and scarifier. the lawn has thick thatch in places and this hasn’t been done in years. i will thatch. i can scarify but less knowledgeable about what that may do to the lawn or how to work into this plan. i will be able to do this early next week and know it needs to be done asap.  \n2. i will do a top layer of soil and attempt to make the yard somewhat more level (though i know i can’t do that with one application of dirt, its gonna take a few years). i'm not trying to make it flat, but maybe lessen some immediate dips and holes from pulling weeds and critters digging. \n3. i will seed. not sure what type of seed or how yet. use a spreader? get that green mossy seedy stuff? something else? \n4. i will fertilize with scotts weed and feed. i can do something else instead, or in addition to the weed and feed. i know you’re supposed to follow the prescribed directions and not use illegal substances, but if there is like a steroids of lawncare, i’d inject it. i don't necessarily know how often or in what order to apply various treatments if i combine multiple.   \n5. i will water. and then water some more. and then water more. i will then whisper sweet nothings to each blade of grass. i will read the grass children’s books and show it disney movies so it can grow strong and tall. \n\nwhat suggestions do you have? the yard has a lot of bugs because it is a thatch haven--any good -----> diy !!!  treatments or things to keep bugs down?  \n\nthank you for taking time to drop your knowledge, it is very much appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hz7i8g/zone_6b_please_help_suddenly_hosting_my_wedding/", "identifyer": 233388, "year": "2020"}, {"Unnamed: 0": 233787, "autor": "Unabomber007", "date": 1597195457000, "content": "Humic and Kelp FAQ /!/ This is what my research tells me, please provide input if I screwed something up.  Also know I have no axe to grind with companies that want to sell premixed solutions.  If you want to buy that product from the famous youtuber or next day Amazon Prime product, God bless.  For those that want to DIY for cheaper, this is for you.\n\n**What is Humic Acid** Humic acid is a product of Leonardite coal which is mined from many parts of the world.  It is arguably the world’s best organic material for use in a lawn.  It is both a terrific product as a soil amendment and for root development, a real two trick pony.\n\n**What is kelp** Kelp is a product of the sea which is harvested from many parts of the world.  It is arguably the world’s best organic material for use in a lawn.  It is both a terrific as a soil amendment and for root development, a real two trick pony.\n\n**Did you just copy/paste those definitions** Basically.  Both are natural.  Both are terrific alone.  If you wish to learn more, please visit google, but be warned:  the well of nerd runs very deep on these so you best screw on your propeller cap tight.  A nice general primer about these type of products, also known as biostimulants, may be found via [this link](https://archive.lib.msu.edu/tic/tgtre/article/2001aug6.pdf).\n\n**What about fulvic acid** Fulvic acid is part and parcel of humic acid.  You must be part geologist, materials scientist and attorney to know the difference.  You cannot name and/or sell fulvic acid in some states due to legal reasons.  If want to know more, have fun falling down the google mineshaft on that topic.  It is only mentioned as you see those words peppered everywhere online with biostimulant/humic/kelp products.\n\n**Who can use and are there any interaction warnings** You can.  Humic and Kelp do not care about your USDA Plant Hardiness Zone, your elevation, your grass type, your sun/shade ratio, your rain/moisture, if you have new sod, new seedlings, live on a watershed, have animals, have kids, raise bees, or have great or poor soil test results.  You may apply on the same day as herbicide, fungicide, pesticide, fertilizer, seed or any other soil amendment in temperatures from 0 degrees Kelvin to 50 degrees Celsius.  Tank mixing other liquids or combing other granular products in a spreader is verboten.\n\n**Use separate or together and what ratio** Use of either alone is a great thing for your lawn.  Together is even better.  Mix them into a 5:2 ratio of Humic:Kelp and you have the greatest root development tool in the history of the world.  [Famous 10 year Virginia Tech study on the 5:2 topic](http://www.aapfco.org/presentations/2015/2015_AN_biostimulant_research.pdf).\n\n**How much to apply** This is the $64,000 question as there is no answer.  There are 100+ makers of humic/kelp products and they don’t agree as there are many concentration levels with the liquid and granular application form factors.  Since both products are organic, you cannot over apply unless maybe you decide to level your lawn with granular humic acid.\n\n**Any Canada/Organic options** These products have no restrictions in Canada and may be used during fertilizer blackout periods.  Since they are natively organic, they have no chemical restrictions.  And use of the word organic here does not imply OMRI/USDA certified organic as that’s a whole other ball of wax, but a general term meaning not man made.\n\n**When to use** Groupthink says the best time for these products would be at seed/sod/overseed followed by the active growing period for your grass type.  You can also apply during no fertilizer periods some localities have.  About the only universal “no period” might be when there is literal snow on the ground.\n\n**Granular or liquid for purchasing** Both humic and kelp come in both form factors.  Liquid is the least wise choice as you are paying for water to be shipped, you have no control over the concentration and you must spray it.  Granular means you are in control of the concentration and you can spread it or turn into a liquid and spray it.\n\n**How do I make liquid humic acid** Most commercial liquid humic products you see are 12%, so let’s use that as the standard.  Eight ounces of dry humic mixed in 1 gallon of water becomes a 12% humic acid solution.  Most commercial liquid humic products recommend you spray this at a rate of 2oz/gallon.  You can follow this, use less or spray at full strength if you so desire.\n\n**How is DIY saving me money** One DIY humic example, you can do your own math on the other products:  [The Andersons Humic DG]( https://www.amazon.com/Andersons-Humic-Granular-Soil-Conditioner/dp/B00D9F3QY0/) is $65 for 40lbs.  One bag will net you 80 gallons of 12% humic acid solution.  $65/80 gallons is $0.81/gallon.  Most commercial liquid humic products are $20/gallon at a minimum.\n\n**How do I make liquid kelp** Same as humic.  Or mix a 5:2 blend or custom blend with whatever amount you have on hand.  Do ratios by weight as it’s the most accurate method for ratios.  Be crazy…make a 50/50 blend at 30% concentration…have fun with it.\n\n**Any sprayer advice** If you are making a liquid for a sprayer application, you have to do so with a high degree of concentration.  Perhaps get a garage sale blender to aid in refining the product dry and/or wet.  Invest in a mixing attachment for your drill if bulk mixing.  Use a chinois with cheesecloth for a final straining before use.  These extra steps should ensure a clog free spraying experience.\n\n**Granular or liquid for use** This is another question without a great answer.  These products are soil amendments and root development products, so one might say granular application is best, but it would be easier to get the liquid ratios correct for those seeking the perfect 5:2 or custom ratio.\n\n**Do I need to water after application** If you feel like it.  Rain tomorrow or next week will get it into the soil eventually.\n\n**Other uses of these** The hydroponics folks, the marijuana cultivators and the tomato dorks are all huge fans of these products.  If you have a garden or just about anything that is green, feel free to spray/deep soak/granular apply as you desire.\n\n**Where do I buy** These are the cheapest options I have found.  If you find a cheaper option, please let me know and I’ll add it here but keep in mind:  This request is only for shipped options as Sally in Sacramento don’t care that you can get kelp in person for 99 cents a pound at your local hydroponics store.  Do look local for savings, especially in bulk, where shipping is an overt or covert cost increaser.\nKelp 50lb:  https://www.newcountryorganics.com/nature-s-kelp-ireland-50-lb-bag.html Cart Subtotal $54.00, Discount Code (Welcome10) -$5.40, Shipping UPS Ground $18.24, Tax $2.58, Order Total $69.42\nKelp 2, 5, 15 or 25lb:  https://www.kelp4less.com/shop/kelp-meal/ $54 shipped for 25lbs.  I paid $43.61 shipped for 25lbs due to sales. Setup an account there and join their email list.  Sales are based either on the email or it will have you log in to your account to see special pricing.  Check coupon code websites for 5-10% coupon codes as well.\nHumic 40lb:  [The Andersons Humic DG](https://www.amazon.com/Andersons-Humic-Granular-Soil-Conditioner/dp/B00D9F3QY0/) $65 shipped.\nYou can find smaller quantities of Humic online, but pricing is super terrible for some reason and you must watch out for the Down To Earth brand which is cheap but 50% cat litter.  Kelp is somewhat more reasonable for smaller quantities.", "link": "https://www.reddit.com/r/lawncare/comments/i84ire/humic_and_kelp_faq/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "humic and kelp faq /!/ this is what my research tells me, please provide input if i screwed something up.  also know i have no axe to grind with companies that want to sell premixed solutions.  if you want to buy that product from the famous youtuber or next day amazon prime product, god bless.  for those that want to -----> diy !!!  for cheaper, this is for you.\n\n**what is humic acid** humic acid is a product of leonardite coal which is mined from many parts of the world.  it is arguably the world’s best organic material for use in a lawn.  it is both a terrific product as a soil amendment and for root development, a real two trick pony.\n\n**what is kelp** kelp is a product of the sea which is harvested from many parts of the world.  it is arguably the world’s best organic material for use in a lawn.  it is both a terrific as a soil amendment and for root development, a real two trick pony.\n\n**did you just copy/paste those definitions** basically.  both are natural.  both are terrific alone.  if you wish to learn more, please visit google, but be warned:  the well of nerd runs very deep on these so you best screw on your propeller cap tight.  a nice general primer about these type of products, also known as biostimulants, may be found via [this link](https://archive.lib.msu.edu/tic/tgtre/article/2001aug6.pdf).\n\n**what about fulvic acid** fulvic acid is part and parcel of humic acid.  you must be part geologist, materials scientist and attorney to know the difference.  you cannot name and/or sell fulvic acid in some states due to legal reasons.  if want to know more, have fun falling down the google mineshaft on that topic.  it is only mentioned as you see those words peppered everywhere online with biostimulant/humic/kelp products.\n\n**who can use and are there any interaction warnings** you can.  humic and kelp do not care about your usda plant hardiness zone, your elevation, your grass type, your sun/shade ratio, your rain/moisture, if you have new sod, new seedlings, live on a watershed, have animals, have kids, raise bees, or have great or poor soil test results.  you may apply on the same day as herbicide, fungicide, pesticide, fertilizer, seed or any other soil amendment in temperatures from 0 degrees kelvin to 50 degrees celsius.  tank mixing other liquids or combing other granular products in a spreader is verboten.\n\n**use separate or together and what ratio** use of either alone is a great thing for your lawn.  together is even better.  mix them into a 5:2 ratio of humic:kelp and you have the greatest root development tool in the history of the world.  [famous 10 year virginia tech study on the 5:2 topic](http://www.aapfco.org/presentations/2015/2015_an_biostimulant_research.pdf).\n\n**how much to apply** this is the $64,000 question as there is no answer.  there are 100+ makers of humic/kelp products and they don’t agree as there are many concentration levels with the liquid and granular application form factors.  since both products are organic, you cannot over apply unless maybe you decide to level your lawn with granular humic acid.\n\n**any canada/organic options** these products have no restrictions in canada and may be used during fertilizer blackout periods.  since they are natively organic, they have no chemical restrictions.  and use of the word organic here does not imply omri/usda certified organic as that’s a whole other ball of wax, but a general term meaning not man made.\n\n**when to use** groupthink says the best time for these products would be at seed/sod/overseed followed by the active growing period for your grass type.  you can also apply during no fertilizer periods some localities have.  about the only universal “no period” might be when there is literal snow on the ground.\n\n**granular or liquid for purchasing** both humic and kelp come in both form factors.  liquid is the least wise choice as you are paying for water to be shipped, you have no control over the concentration and you must spray it.  granular means you are in control of the concentration and you can spread it or turn into a liquid and spray it.\n\n**how do i make liquid humic acid** most commercial liquid humic products you see are 12%, so let’s use that as the standard.  eight ounces of dry humic mixed in 1 gallon of water becomes a 12% humic acid solution.  most commercial liquid humic products recommend you spray this at a rate of 2oz/gallon.  you can follow this, use less or spray at full strength if you so desire.\n\n**how is diy saving me money** one diy humic example, you can do your own math on the other products:  [the andersons humic dg]( https://www.amazon.com/andersons-humic-granular-soil-conditioner/dp/b00d9f3qy0/) is $65 for 40lbs.  one bag will net you 80 gallons of 12% humic acid solution.  $65/80 gallons is $0.81/gallon.  most commercial liquid humic products are $20/gallon at a minimum.\n\n**how do i make liquid kelp** same as humic.  or mix a 5:2 blend or custom blend with whatever amount you have on hand.  do ratios by weight as it’s the most accurate method for ratios.  be crazy…make a 50/50 blend at 30% concentration…have fun with it.\n\n**any sprayer advice** if you are making a liquid for a sprayer application, you have to do so with a high degree of concentration.  perhaps get a garage sale blender to aid in refining the product dry and/or wet.  invest in a mixing attachment for your drill if bulk mixing.  use a chinois with cheesecloth for a final straining before use.  these extra steps should ensure a clog free spraying experience.\n\n**granular or liquid for use** this is another question without a great answer.  these products are soil amendments and root development products, so one might say granular application is best, but it would be easier to get the liquid ratios correct for those seeking the perfect 5:2 or custom ratio.\n\n**do i need to water after application** if you feel like it.  rain tomorrow or next week will get it into the soil eventually.\n\n**other uses of these** the hydroponics folks, the marijuana cultivators and the tomato dorks are all huge fans of these products.  if you have a garden or just about anything that is green, feel free to spray/deep soak/granular apply as you desire.\n\n**where do i buy** these are the cheapest options i have found.  if you find a cheaper option, please let me know and i’ll add it here but keep in mind:  this request is only for shipped options as sally in sacramento don’t care that you can get kelp in person for 99 cents a pound at your local hydroponics store.  do look local for savings, especially in bulk, where shipping is an overt or covert cost increaser.\nkelp 50lb:  https://www.newcountryorganics.com/nature-s-kelp-ireland-50-lb-bag.html cart subtotal $54.00, discount code (welcome10) -$5.40, shipping ups ground $18.24, tax $2.58, order total $69.42\nkelp 2, 5, 15 or 25lb:  https://www.kelp4less.com/shop/kelp-meal/ $54 shipped for 25lbs.  i paid $43.61 shipped for 25lbs due to sales. setup an account there and join their email list.  sales are based either on the email or it will have you log in to your account to see special pricing.  check coupon code websites for 5-10% coupon codes as well.\nhumic 40lb:  [the andersons humic dg](https://www.amazon.com/andersons-humic-granular-soil-conditioner/dp/b00d9f3qy0/) $65 shipped.\nyou can find smaller quantities of humic online, but pricing is super terrible for some reason and you must watch out for the down to earth brand which is cheap but 50% cat litter.  kelp is somewhat more reasonable for smaller quantities.", "sortedWord": "None", "removed": null, "score": 1, "comments": 31, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/i84ire/humic_and_kelp_faq/", "identifyer": 233787, "year": "2020"}, {"Unnamed: 0": 233794, "autor": "spartyon11", "date": 1597187683000, "content": "EGO Mower Striping Kit (DIY) /!/ It's not pretty and it's not perfect but there doesn't seem to be a striping kit made for the EGO mower and this is all I could do with limited tools.\n\nMower maintains full functionality (bagging, folding, etc.). No holes were drilled or parts altered. \n\n[https://imgur.com/a/JwI183G](https://imgur.com/a/JwI183G)", "link": "https://www.reddit.com/r/lawncare/comments/i82gfl/ego_mower_striping_kit_diy/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "ego mower striping kit (-----> diy !!! ) /!/ it's not pretty and it's not perfect but there doesn't seem to be a striping kit made for the ego mower and this is all i could do with limited tools.\n\nmower maintains full functionality (bagging, folding, etc.). no holes were drilled or parts altered. \n\n[https://imgur.com/a/jwi183g](https://imgur.com/a/jwi183g)", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/i82gfl/ego_mower_striping_kit_diy/", "identifyer": 233794, "year": "2020"}, {"Unnamed: 0": 235043, "autor": "gwoompies", "date": 1601744201000, "content": "First time striping with DIY striper, zone 7A PRG, TTTF, KBG (super turf ii, champion gq, midnight) /!/ [https://imgur.com/a/lExdUZ7](https://imgur.com/a/lExdUZ7) \nI built a striper for around 15 bucks, I wanted to go with the big league striper but they dont have an attachment for the ego mower.\n\nHere’s what I used \n1 - 3” pvc pipe 24”\n4 - caribiners\n2 - 1/4” x 2 1/2” steel eye bolts with nut\n2 - 3” pvc caps\npaver sand\n\nPretty stoked with the results might have to make a few adjustments. \nOverseed is really coming along going into week 5.", "link": "https://www.reddit.com/r/lawncare/comments/j4iih6/first_time_striping_with_diy_striper_zone_7a_prg/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "first time striping with -----> diy !!!  striper, zone 7a prg, tttf, kbg (super turf ii, champion gq, midnight) /!/ [https://imgur.com/a/lexduz7](https://imgur.com/a/lexduz7) \ni built a striper for around 15 bucks, i wanted to go with the big league striper but they dont have an attachment for the ego mower.\n\nhere’s what i used \n1 - 3” pvc pipe 24”\n4 - caribiners\n2 - 1/4” x 2 1/2” steel eye bolts with nut\n2 - 3” pvc caps\npaver sand\n\npretty stoked with the results might have to make a few adjustments. \noverseed is really coming along going into week 5.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/j4iih6/first_time_striping_with_diy_striper_zone_7a_prg/", "identifyer": 235043, "year": "2020"}, {"Unnamed: 0": 235306, "autor": "Copper-Road", "date": 1592599606000, "content": "For those that DIY aerate, how do you do it? /!/ DFW/Texas_Approx 1.5 acres irrigated yard, hasn’t been aerated in years. Definitely compacted in a lot of areas. I have a zero turn mower, but haven’t pulled the trigger on pull behind aerators as they are expensive and there’s too much variety to know what works best. For those who do it themselves, how do you do it? What do you have? Any advice you can share?\n\nThanks in advance.", "link": "https://www.reddit.com/r/lawncare/comments/hc8g56/for_those_that_diy_aerate_how_do_you_do_it/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "for those that -----> diy !!!  aerate, how do you do it? /!/ dfw/texas_approx 1.5 acres irrigated yard, hasn’t been aerated in years. definitely compacted in a lot of areas. i have a zero turn mower, but haven’t pulled the trigger on pull behind aerators as they are expensive and there’s too much variety to know what works best. for those who do it themselves, how do you do it? what do you have? any advice you can share?\n\nthanks in advance.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hc8g56/for_those_that_diy_aerate_how_do_you_do_it/", "identifyer": 235306, "year": "2020"}, {"Unnamed: 0": 235400, "autor": "matthewbarber87", "date": 1603211460000, "content": "Max weight for a DIY striping kit? /!/ I have one of the big rollers that attach to the back of my rider. Obviously, I’m not planning on filling it up with water the whole way, but I was going to add a little bit so that I could get a nice stripe after I cut   \n\nHow much or how little water should I add?", "link": "https://www.reddit.com/r/lawncare/comments/jet1p2/max_weight_for_a_diy_striping_kit/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "max weight for a -----> diy !!!  striping kit? /!/ i have one of the big rollers that attach to the back of my rider. obviously, i’m not planning on filling it up with water the whole way, but i was going to add a little bit so that i could get a nice stripe after i cut   \n\nhow much or how little water should i add?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/jet1p2/max_weight_for_a_diy_striping_kit/", "identifyer": 235400, "year": "2020"}, {"Unnamed: 0": 235966, "autor": "evilbug33", "date": 1592836822000, "content": "DIY PROS show your stripe kit /!/ Looking to make my first DIY stripe kit for my cub cadet tractor. All you pros need some help in idea/design.", "link": "https://www.reddit.com/r/lawncare/comments/hdtjen/diy_pros_show_your_stripe_kit/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  pros show your stripe kit /!/ looking to make my first diy stripe kit for my cub cadet tractor. all you pros need some help in idea/design.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hdtjen/diy_pros_show_your_stripe_kit/", "identifyer": 235966, "year": "2020"}, {"Unnamed: 0": 236006, "autor": "jr1c", "date": 1593812833000, "content": "Grandparent's gardeners' leaving lawn like this, what can I do DIY wise? /!/ My Grandfather used to be very pro-lawn care, but as he aged he really doesn't give a shit anymore. He pays his gardener a flat fee for mowing and they don't care about the weeds.\n\nHe has all of the tools too and I want to pick up the hobby. I want to first perfect the side of the house so for that I want to:\n\n1. Take care of the weeds (I see clovers, chickweed, and spotted spurge)\n2. Get rid of those edging stones and edge the grass properly. He has a half-moon tool and I will slope it so that there is a ledge of grass, a divot, and then the soil.\n3. Mulch bed?\n4. Fix exposed sprinkler tubing\n\nHere are some preliminary photos: https://imgur.com/a/Lf7E6a9 -- I live in the North East (NY Region) and it might be too late for a weed and feed treatment. Any thoughts?", "link": "https://www.reddit.com/r/lawncare/comments/hkrnbi/grandparents_gardeners_leaving_lawn_like_this/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "grandparent's gardeners' leaving lawn like this, what can i do -----> diy !!!  wise? /!/ my grandfather used to be very pro-lawn care, but as he aged he really doesn't give a shit anymore. he pays his gardener a flat fee for mowing and they don't care about the weeds.\n\nhe has all of the tools too and i want to pick up the hobby. i want to first perfect the side of the house so for that i want to:\n\n1. take care of the weeds (i see clovers, chickweed, and spotted spurge)\n2. get rid of those edging stones and edge the grass properly. he has a half-moon tool and i will slope it so that there is a ledge of grass, a divot, and then the soil.\n3. mulch bed?\n4. fix exposed sprinkler tubing\n\nhere are some preliminary photos: https://imgur.com/a/lf7e6a9 -- i live in the north east (ny region) and it might be too late for a weed and feed treatment. any thoughts?", "sortedWord": "None", "removed": null, "score": 3, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/hkrnbi/grandparents_gardeners_leaving_lawn_like_this/", "identifyer": 236006, "year": "2020"}, {"Unnamed: 0": 236054, "autor": "cerisebow", "date": 1594505533000, "content": "Female lawn newb here. After getting burnt by several mowing companies, want to go full on DIY. Help please /!/ We had wonderful 10/10 sod laid in May, it was a thing of beauty, dense, green, thick...I would wake up and stare at the lawn for a good hour. It last 1 month. It was my baby. Hired a reputed lawn mowing company, recommended by neighbours. I specifically asked him to cut at highest setting and low behold, he scalped my lawn and blamed it on the tall grass. It looks dreadful, I cannot even post pics without dying inside. After two weeks of crying over the damage, I am ready to take matters into my own hands and fix the mess he has made to my lawn. \n\nFirst things, I need a good lawn mower. I know this sub is all about any Honda, but I have zero experience with gas mowers, I would not be able to winterize, repair/fix and all of that. Only reason I am mentioning my gender here is...yes biologically speaking we aren't as strong (not trying to get sexist). So I was thinking my only option would be a cordless mower. But I am not sure. Can you please guide what would be the best bet here? \n\nSecond, to repair the bald spots, scalped and ripped sections of land left my the mower, I am going to seed in those areas. My understanding is to mow short, de-thatch, aerate if needed, seed, topdress. Is this correct? What should be in the topdress - I have plenty of peat moss, can I combine peat moss and compost? What about a lawn fertilizer? Does this go before or after seeding?\n\nAppreciate any feedback here.", "link": "https://www.reddit.com/r/lawncare/comments/hpivec/female_lawn_newb_here_after_getting_burnt_by/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "female lawn newb here. after getting burnt by several mowing companies, want to go full on -----> diy !!! . help please /!/ we had wonderful 10/10 sod laid in may, it was a thing of beauty, dense, green, thick...i would wake up and stare at the lawn for a good hour. it last 1 month. it was my baby. hired a reputed lawn mowing company, recommended by neighbours. i specifically asked him to cut at highest setting and low behold, he scalped my lawn and blamed it on the tall grass. it looks dreadful, i cannot even post pics without dying inside. after two weeks of crying over the damage, i am ready to take matters into my own hands and fix the mess he has made to my lawn. \n\nfirst things, i need a good lawn mower. i know this sub is all about any honda, but i have zero experience with gas mowers, i would not be able to winterize, repair/fix and all of that. only reason i am mentioning my gender here is...yes biologically speaking we aren't as strong (not trying to get sexist). so i was thinking my only option would be a cordless mower. but i am not sure. can you please guide what would be the best bet here? \n\nsecond, to repair the bald spots, scalped and ripped sections of land left my the mower, i am going to seed in those areas. my understanding is to mow short, de-thatch, aerate if needed, seed, topdress. is this correct? what should be in the topdress - i have plenty of peat moss, can i combine peat moss and compost? what about a lawn fertilizer? does this go before or after seeding?\n\nappreciate any feedback here.", "sortedWord": "None", "removed": null, "score": 1, "comments": 28, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hpivec/female_lawn_newb_here_after_getting_burnt_by/", "identifyer": 236054, "year": "2020"}, {"Unnamed: 0": 236264, "autor": "ankiyani", "date": 1590594144000, "content": "Best Grass Seed for New Lawn and Overseeding. Best Seeds for Sun, Shade, Season. DIY Where to buy all Tools? When to Grow. Everything is covered in this detailed and simple article /!/ Want to grow grass in new lawn or looking to overseed? We have written an article to select the best grass seed for season, area, temperature and water requirements. \n\nYou need a different seed depending upon Sun, Shade, Areas like Northern/Southern, temperature and Season. A guide to grow lush green lawn in a simple way and everything you need\n\n&amp;#x200B;\n\n**Best Grass Seed Category**\n\n| Best for Sun and Shade \\[Northern US\\]    | Pennington Grass Seed Sun and Shade|\n|:-|:-|\n| Best for Dense Shade| Jonathan Green Dense Shade |\n| Best for Full Sun \\[Southern US\\]| Pennington Bermudagrass|\n| Best for All in One Fertilizer| Scotts ThickR Lawn|\n| Best for Patch Repair| Scotts Patch Master|\n| Best for Dog| Scotts Dog Spot Repair|\n| Best Perennial Ryegrass| Scotts Perennial Ryegrass|\n| Best Zoysia grass| Scotts Zoysia Grass Seed  |\n\nClick on below link to see all details for **best grass seed, essential tools, how to grow, and where to buy**  [**https://bestxbuy.com/best-grass-seed/**](https://bestxbuy.com/best-grass-seed/)", "link": "https://www.reddit.com/r/lawncare/comments/grm1b4/best_grass_seed_for_new_lawn_and_overseeding_best/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best grass seed for new lawn and overseeding. best seeds for sun, shade, season. -----> diy !!!  where to buy all tools? when to grow. everything is covered in this detailed and simple article /!/ want to grow grass in new lawn or looking to overseed? we have written an article to select the best grass seed for season, area, temperature and water requirements. \n\nyou need a different seed depending upon sun, shade, areas like northern/southern, temperature and season. a guide to grow lush green lawn in a simple way and everything you need\n\n&amp;#x200b;\n\n**best grass seed category**\n\n| best for sun and shade \\[northern us\\]    | pennington grass seed sun and shade|\n|:-|:-|\n| best for dense shade| jonathan green dense shade |\n| best for full sun \\[southern us\\]| pennington bermudagrass|\n| best for all in one fertilizer| scotts thickr lawn|\n| best for patch repair| scotts patch master|\n| best for dog| scotts dog spot repair|\n| best perennial ryegrass| scotts perennial ryegrass|\n| best zoysia grass| scotts zoysia grass seed  |\n\nclick on below link to see all details for **best grass seed, essential tools, how to grow, and where to buy**  [**https://bestxbuy.com/best-grass-seed/**](https://bestxbuy.com/best-grass-seed/)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/grm1b4/best_grass_seed_for_new_lawn_and_overseeding_best/", "identifyer": 236264, "year": "2020"}, {"Unnamed: 0": 237204, "autor": "zeus1356", "date": 1589059333000, "content": "Thank you! /!/ [https://imgur.com/B1sIBOM](https://imgur.com/B1sIBOM)\n\nI just wanted to say thanks to the many helpers in this sub who have answered my questions. I've posted almost daily in the \"no stupid questions\" thread and I always get a quick answer. I'm quickly turning into a lawncare dad.\n\nI'm seeing some great results. And my DIY lawn striper (lead pipe strapped to mower) working great.\n\nThanks again to all the grass gurus!", "link": "https://www.reddit.com/r/lawncare/comments/ggnzij/thank_you/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "thank you! /!/ [https://imgur.com/b1sibom](https://imgur.com/b1sibom)\n\ni just wanted to say thanks to the many helpers in this sub who have answered my questions. i've posted almost daily in the \"no stupid questions\" thread and i always get a quick answer. i'm quickly turning into a lawncare dad.\n\ni'm seeing some great results. and my -----> diy !!!  lawn striper (lead pipe strapped to mower) working great.\n\nthanks again to all the grass gurus!", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/ggnzij/thank_you/", "identifyer": 237204, "year": "2020"}, {"Unnamed: 0": 237673, "autor": "ButImPagliacci", "date": 1589477569000, "content": "Laying fert followed by heavy rain /!/ Might be overthinking it, but I dropped some CX DIY yesterday with rain in the forecast, with the plan of the rain watering in the fert. That rain turned into a pretty heavy downpour this morning, and I'm curious what the chances are that the fert got washed away.\n\nIf it makes a difference, my lawn is already thick, and I did spray some RGS and Air-8 via a hose-end sprayer, though I doubt enough for the fert to be considered watered-in.", "link": "https://www.reddit.com/r/lawncare/comments/gjqx25/laying_fert_followed_by_heavy_rain/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "laying fert followed by heavy rain /!/ might be overthinking it, but i dropped some cx -----> diy !!!  yesterday with rain in the forecast, with the plan of the rain watering in the fert. that rain turned into a pretty heavy downpour this morning, and i'm curious what the chances are that the fert got washed away.\n\nif it makes a difference, my lawn is already thick, and i did spray some rgs and air-8 via a hose-end sprayer, though i doubt enough for the fert to be considered watered-in.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gjqx25/laying_fert_followed_by_heavy_rain/", "identifyer": 237673, "year": "2020"}, {"Unnamed: 0": 238252, "autor": "cadet133", "date": 1600562084000, "content": "Made my own DIY Striper under $10. Happy with results /!/ I used a 3inch pvc pipe, 2 end caps, 2 eye bolts, 2 carabiners 2 nuts.\n\n Essentially I drilled 2 holes on top and slipped 2 eye bolts through and screwed with nut. I filled the pipe with sand and sealed with end caps. I attached eye bolts to carabiner and carabiner clipped onto metal rod underneath mower\n\n\nBackyard https://i.ibb.co/fGKg70d/20200919-190407.jpg\n\nFront yard \nhttps://i.ibb.co/7Ns2BYx/20200919-185951.jpg\n\nDIY striper ( sorry not best pic)\nhttps://i.ibb.co/Ld6j4t5/20200919-185027.jpg", "link": "https://www.reddit.com/r/lawncare/comments/iw40s9/made_my_own_diy_striper_under_10_happy_with/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "made my own -----> diy !!!  striper under $10. happy with results /!/ i used a 3inch pvc pipe, 2 end caps, 2 eye bolts, 2 carabiners 2 nuts.\n\n essentially i drilled 2 holes on top and slipped 2 eye bolts through and screwed with nut. i filled the pipe with sand and sealed with end caps. i attached eye bolts to carabiner and carabiner clipped onto metal rod underneath mower\n\n\nbackyard https://i.ibb.co/fgkg70d/20200919-190407.jpg\n\nfront yard \nhttps://i.ibb.co/7ns2byx/20200919-185951.jpg\n\ndiy striper ( sorry not best pic)\nhttps://i.ibb.co/ld6j4t5/20200919-185027.jpg", "sortedWord": "None", "removed": null, "score": 1, "comments": 49, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/iw40s9/made_my_own_diy_striper_under_10_happy_with/", "identifyer": 238252, "year": "2020"}, {"Unnamed: 0": 238376, "autor": "LawnEnforcement101", "date": 1591388769000, "content": "PSA: buy an angle grinder and 60 grit flap disk ASAP. /!/ So after years of trying several gimmicky  lawn mower blade sharpening “tools” that we’re horrible, and spending way too much time and effort using a file, I broke down and bought a $35 Bosch angle grinder (chorded) and a DeWalt 60 grit flap disk. \n\nI just used it for the first time and OMG, two swipes and that’s it. Sharp to the touch.   So if you’re a DIY guy. Stop wasting your time with and buy these ASAP.", "link": "https://www.reddit.com/r/lawncare/comments/gxccb9/psa_buy_an_angle_grinder_and_60_grit_flap_disk/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "psa: buy an angle grinder and 60 grit flap disk asap. /!/ so after years of trying several gimmicky  lawn mower blade sharpening “tools” that we’re horrible, and spending way too much time and effort using a file, i broke down and bought a $35 bosch angle grinder (chorded) and a dewalt 60 grit flap disk. \n\ni just used it for the first time and omg, two swipes and that’s it. sharp to the touch.   so if you’re a -----> diy !!!  guy. stop wasting your time with and buy these asap.", "sortedWord": "None", "removed": null, "score": 1, "comments": 44, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gxccb9/psa_buy_an_angle_grinder_and_60_grit_flap_disk/", "identifyer": 238376, "year": "2020"}, {"Unnamed: 0": 238448, "autor": "JeffroeBodine", "date": 1588781609000, "content": "75k sq./ft. Lawn. Why is it cheaper to hire a company than diy? /!/ I'm looking at fertilizers for my 75k sq./ft. Lawn. Scott's is about $350 PER treatment and that's just for granular, no liquid at all. I just got a quote from a lawn care company here that said they could do 6 treatments at $261 per.\n\nI realize this isn't actually cheaper since it's for 6 treatments than 4 but still. What the hell. Labor is a huge cost and I thought that by doing it myself I'd be able to save some money. \n\nEven my local tractor supply and rural king don't have much better prices. \n\nAnyone got tips on how to fertilize a couple acres without breaking the bank? I'm in Ohio btw a d do not water my lawn if that matters.", "link": "https://www.reddit.com/r/lawncare/comments/gemz8v/75k_sqft_lawn_why_is_it_cheaper_to_hire_a_company/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "75k sq./ft. lawn. why is it cheaper to hire a company than -----> diy !!! ? /!/ i'm looking at fertilizers for my 75k sq./ft. lawn. scott's is about $350 per treatment and that's just for granular, no liquid at all. i just got a quote from a lawn care company here that said they could do 6 treatments at $261 per.\n\ni realize this isn't actually cheaper since it's for 6 treatments than 4 but still. what the hell. labor is a huge cost and i thought that by doing it myself i'd be able to save some money. \n\neven my local tractor supply and rural king don't have much better prices. \n\nanyone got tips on how to fertilize a couple acres without breaking the bank? i'm in ohio btw a d do not water my lawn if that matters.", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gemz8v/75k_sqft_lawn_why_is_it_cheaper_to_hire_a_company/", "identifyer": 238448, "year": "2020"}], "name": "diylawncare2020"}