{"interestingcomments": [{"Unnamed: 0": 228099, "autor": "Drakmyth", "date": 1581294001000, "content": "Lawn care newbie, Getting serious about maintenance but need guidance /!/ [Album](https://imgur.com/a/EDdLSdZ) \\- Zone 8b\n\nApologies for the background context wall of text. A list of specific questions is at the bottom.\n\n***\n\nI moved to the Pacific Northwest about 5 years ago, and purchased my first house here about 3 years ago. When my wife and I bought this house, the yard was decent. Not great, but not notably bad either. We've kept up on mowing, trimming, and watering the grass but haven't done much beyond that.\n\nEach year the yard looks a little bit worse. There's a little bit more moss and clover everywhere. Last year we tried spraying some killer around which sort of worked (the moss turned black at least), then tried raking it up and while a lot of moss came up, it seemed like we had barely made a dent. We've also had moles the past 2 years or so. The first year was real bad, but after much trial and error we managed to catch the bugger. The second year, now knowing how to deal with it, we jumped right on it and only had a couple hills crop up before we got him. Hopefully, that won't repeat this year, but we'll see.\n\nToday was the first real sunny day of 2020. I mowed the lawn today for the first time this year and am dismayed to see the moss has completely taken over the yard; orders of magnitude more moss than in previous years. (I've had the suspicion this was the case for a while, but as it has been rainy for the past 2 months or so there was a good amount of grass coming through the moss and the full scope of the infestation was not clear.)\n\nNeither I nor my wife have very much knowledge around proper lawn care, and what we have tried has been physically strenuous and shown minimal results. I suspect this is just us doing the wrong things and/or using the wrong tools, but on the occasions I've tried to get a better understanding of correct processes, I get marred down in conflicting advice and pictures of yards that look nothing like my own.\n\nI want to get to the point of maintaining the yard myself, but I feel like I'm so far behind the starting line both in knowledge and in the current state of my yard that I might need someone to come in and just get me to a decent starting place. Looking around at services though, I find I'm having a hard time finding one that I feel comfortable giving hundreds of dollars to with no guarantee they won't swindle me for a half-done job.\n\nAnd so I turn to this community for advice on how to proceed. Specifically my questions are:\n\n1. Is my yard recoverable, or do I need a professional to come in and fix or replace it? If the former, what should I do? If the latter, any recommendations for which services are trustworthy or what kinds of things I should look for or ask about to make that determination?\n2. The only lawn care equipment I own is a Craftman 40v electric push mower and the accompanying trimmer, a couple standard garden hoses and sprinklers, and a leaf rake. What else should I look into getting? I suspect a fertilizer spreader and/or an aerator, but even just mentioning those I'm outside my knowledgebase already (I know these are things that are useful, but not entirely sure how important they are or how to/how often to use them).\n3. Are there things I should be doing now, or do I need to wait until Spring officially starts next month?\n4. Assuming the yard is recoverable, how viable is it that I will have a healthy, thriving lawn this year? Or will I have to wait until next year to really see the benefits of this year's work?\n5. The one thing I repeatedly see called for before doing anything else is a soil test. Is the $12 kit at Lowe's sufficient for this? I keep hearing the recommendation to check my \"local cooperative extension\" that supposedly will help with this. As near as I can tell [this is mine](https://extension.wsu.edu/king/), but I don't see anything on that site relating to soil tests.\n\nThank you so much in advance for any help or guidance you can provide, as well as your patience with my ignorance/lack of experience. I'm usually pretty good at researching topics and being able to speak intelligently about them, but for some reason I've had a very difficult time getting a solid grasp on lawn care.", "link": "https://www.reddit.com/r/lawncare/comments/f1hvsq/lawn_care_newbie_getting_serious_about/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "we had barely made", "selectorShort": "make", "MarkedSent": "lawn care newbie, getting serious about maintenance but need guidance /!/ [album](https://imgur.com/a/eddlsdz) \\- zone 8b\n\napologies for the background context wall of text. a list of specific questions is at the bottom.\n\n***\n\ni moved to the pacific northwest about 5 years ago, and purchased my first house here about 3 years ago. when my wife and i bought this house, the yard was decent. not great, but not notably bad either. we've kept up on mowing, trimming, and watering the grass but haven't done much beyond that.\n\neach year the yard looks a little bit worse. there's a little bit more moss and clover everywhere. last year -----> we !!!  tried spraying some killer around which sort of worked (the moss turned black at least), then tried raking it up and while a lot of moss came up, it seemed like -----> we !!!  -----> had !!!  -----> barely !!!  -----> made !!!  a dent. we've also had moles the past 2 years or so. the first year was real bad, but after much trial and error we managed to catch the bugger. the second year, now knowing how to deal with it, we jumped right on it and only had a couple hills crop up before we got him. hopefully, that won't repeat this year, but we'll see.\n\ntoday was the first real sunny day of 2020. i mowed the lawn today for the first time this year and am dismayed to see the moss has completely taken over the yard; orders of magnitude more moss than in previous years. (i've had the suspicion this was the case for a while, but as it has been rainy for the past 2 months or so there was a good amount of grass coming through the moss and the full scope of the infestation was not clear.)\n\nneither i nor my wife have very much knowledge around proper lawn care, and what we have tried has been physically strenuous and shown minimal results. i suspect this is just us doing the wrong things and/or using the wrong tools, but on the occasions i've tried to get a better understanding of correct processes, i get marred down in conflicting advice and pictures of yards that look nothing like my own.\n\ni want to get to the point of maintaining the yard myself, but i feel like i'm so far behind the starting line both in knowledge and in the current state of my yard that i might need someone to come in and just get me to a decent starting place. looking around at services though, i find i'm having a hard time finding one that i feel comfortable giving hundreds of dollars to with no guarantee they won't swindle me for a half-done job.\n\nand so i turn to this community for advice on how to proceed. specifically my questions are:\n\n1. is my yard recoverable, or do i need a professional to come in and fix or replace it? if the former, what should i do? if the latter, any recommendations for which services are trustworthy or what kinds of things i should look for or ask about to make that determination?\n2. the only lawn care equipment i own is a craftman 40v electric push mower and the accompanying trimmer, a couple standard garden hoses and sprinklers, and a leaf rake. what else should i look into getting? i suspect a fertilizer spreader and/or an aerator, but even just mentioning those i'm outside my knowledgebase already (i know these are things that are useful, but not entirely sure how important they are or how to/how often to use them).\n3. are there things i should be doing now, or do i need to wait until spring officially starts next month?\n4. assuming the yard is recoverable, how viable is it that i will have a healthy, thriving lawn this year? or will i have to wait until next year to really see the benefits of this year's work?\n5. the one thing i repeatedly see called for before doing anything else is a soil test. is the $12 kit at lowe's sufficient for this? i keep hearing the recommendation to check my \"local cooperative extension\" that supposedly will help with this. as near as i can tell [this is mine](https://extension.wsu.edu/king/), but i don't see anything on that site relating to soil tests.\n\nthank you so much in advance for any help or guidance you can provide, as well as your patience with my ignorance/lack of experience. i'm usually pretty good at researching topics and being able to speak intelligently about them, but for some reason i've had a very difficult time getting a solid grasp on lawn care.", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/f1hvsq/lawn_care_newbie_getting_serious_about/", "identifyer": 228099, "year": "2020"}, {"Unnamed: 0": 232032, "autor": "TonyTone1985", "date": 1594421496000, "content": "Sharpening Scotts classic 20 /!/ Might not be the place for this post but maybe someone might be able to help. I just picked up a free Scotts classic 20 reel mower and tried it out and it was quite uneventful. Figured “this thing sucks!” Then thought “well, maybe not let’s investigate..” so I got a sharpening kit with the abrasive compound and adjusted the straight blade part to where it was making contact with the reel and then hooked up my power drill and spun away for about 10 minutes adding more compound every few minutes. Cleaned it up backed off the straight blade just a tad and tried it out. Still sucked. Upon closer investigation I noticed that just the ends of the reel we’re making contact with the straight blade when adjusted close enough. It seems that no matter how I adjust those 4 blade adjustment bolts that only the ends of the reel blade make contact with the straight blade leaving the remaining 95% of the reel too far from the straight blade. Is something wrong here? Is this normal? How can I get this thing to cut the way it was meant to cut?", "link": "https://www.reddit.com/r/lawncare/comments/hoz187/sharpening_scotts_classic_20/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "we’re making", "selectorShort": "make", "MarkedSent": "sharpening scotts classic 20 /!/ might not be the place for this post but maybe someone might be able to help. i just picked up a free scotts classic 20 reel mower and tried it out and it was quite uneventful. figured “this thing sucks!” then thought “well, maybe not let’s investigate..” so i got a sharpening kit with the abrasive compound and adjusted the straight blade part to where it was making contact with the reel and then hooked up my power drill and spun away for about 10 minutes adding more compound every few minutes. cleaned it up backed off the straight blade just a tad and tried it out. still sucked. upon closer investigation i noticed that just the ends of the reel -----> we !!! -----> ’re !!!  -----> making !!!  contact with the straight blade when adjusted close enough. it seems that no matter how i adjust those 4 blade adjustment bolts that only the ends of the reel blade make contact with the straight blade leaving the remaining 95% of the reel too far from the straight blade. is something wrong here? is this normal? how can i get this thing to cut the way it was meant to cut?", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hoz187/sharpening_scotts_classic_20/", "identifyer": 232032, "year": "2020"}, {"Unnamed: 0": 238384, "autor": "I_DO_ALOT_OF_DRUGS", "date": 1591384330000, "content": "Advice for a new home owner with a overgrown and uneven yard. /!/ So I am buying a home with a quarter acre yard, the problem is that it is SUPER uneven (up to a 3 foot high differential in some areas).\n\nMe and my Fiance are both planning on doing all the work to fix the place up top to bottom, that being said we can NOT fit anything larger than about 5 ft. Wide into our back yard because we have a large shed in the way.\n\nWe have the money to afford most tools we would need, but we don't want to spend to much on tools that we probably won't need afterwards. We want to make the area at least mostly even and then plan to till the area and replant grass later.\n\nThis is both of our first time on landscaping projects so we aren't sure what the right tools would be, we considered just using a rake and a shovel, but decided its worth it to just buy the right tools for the job.\n\nWe also have a large area that was originally nice gravel for parking, but over time has become covered in weeds and other stuff that we aren't sure how to remove other than with herbicides or a mini flame thrower too burn it away if you have any advice for that we would truly appreciate that as well.\n\nFor a bit of clarity I work maintenance and used to work pest control and construction so I can use basically use any tool and know how to use pesticides/herbicides. I just don't know what are the ideal tools for the work. \n\nWe want to do all the work ourselves to save money, our goal is to spend about 400-500$ on tools at most.\n\nI appreciate all response and advice you guys have to give.", "link": "https://www.reddit.com/r/lawncare/comments/gxax9x/advice_for_a_new_home_owner_with_a_overgrown_and/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "we want to make", "selectorShort": "make", "MarkedSent": "advice for a new home owner with a overgrown and uneven yard. /!/ so i am buying a home with a quarter acre yard, the problem is that it is super uneven (up to a 3 foot high differential in some areas).\n\nme and my fiance are both planning on doing all the work to fix the place up top to bottom, that being said we can not fit anything larger than about 5 ft. wide into our back yard because we have a large shed in the way.\n\nwe have the money to afford most tools we would need, but we don't want to spend to much on tools that we probably won't need afterwards. -----> we !!!  -----> want !!!  -----> to !!!  -----> make !!!  the area at least mostly even and then plan -----> to !!!  till the area and replant grass later.\n\nthis is both of our first time on landscaping projects so we aren't sure what the right tools would be, we considered just using a rake and a shovel, but decided its worth it to just buy the right tools for the job.\n\nwe also have a large area that was originally nice gravel for parking, but over time has become covered in weeds and other stuff that we aren't sure how to remove other than with herbicides or a mini flame thrower too burn it away if you have any advice for that we would truly appreciate that as well.\n\nfor a bit of clarity i work maintenance and used to work pest control and construction so i can use basically use any tool and know how to use pesticides/herbicides. i just don't know what are the ideal tools for the work. \n\nwe want to do all the work ourselves to save money, our goal is to spend about 400-500$ on tools at most.\n\ni appreciate all response and advice you guys have to give.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gxax9x/advice_for_a_new_home_owner_with_a_overgrown_and/", "identifyer": 238384, "year": "2020"}], "name": "makelawncare2020"}