{"interestingcomments": [{"Unnamed: 0": 220648, "autor": "mdezzi", "date": 1617732037000, "content": "For my next project, I am retrofitting a PumpZero compressor on a $20 harbor freight 4gal backpack sprayer /!/ [Here are the materials](https://i.imgur.com/SGDz23R.png)\n\nI picked up the harbor freight 4 gal backpack sprayer for $20 and pretty much everything about it looks cheap. My plan is to 3d print an adapter for the fill cover that the pumpzero compressor will thread in to. \n\nI am also retrofitting the fieldking wand which will require a 3d printed coupler. That will allow me to use the TeeJet spray nozzles that i just purchased. \n\nFrom what i can tell, it appears both the filler cap and the compressor have non-standard 45 deg sawtooth threads. After a few hours of measuring, designing and 3 test prints [I've figured out the filler cap threads](https://i.imgur.com/iIUjmaZ.png). \n\nSince the angle of the threads is opposite from the filler cap to the compressor i'm going to print two separate parts and glue them together. A test print for the thread pitch on the compressor is printing now. \n\nI'll make sure to post an update in a few days with progress.", "link": "https://www.reddit.com/r/lawncare/comments/mlhnzf/for_my_next_project_i_am_retrofitting_a_pumpzero/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "for my next project, i am retrofitting a pumpzero compressor on a $20 harbor freight 4gal backpack sprayer /!/ [here are the materials](https://i.imgur.com/sgdz23r.png)\n\ni picked up the harbor freight 4 gal backpack sprayer for $20 and pretty much everything about it looks cheap. my plan is to -----> 3d !!!  -----> print !!!  an adapter for the fill cover that the pumpzero compressor will thread in to. \n\ni am also retrofitting the fieldking wand which will require a 3d printed coupler. that will allow me to use the teejet spray nozzles that i just purchased. \n\nfrom what i can tell, it appears both the filler cap and the compressor have non-standard 45 deg sawtooth threads. after a few hours of measuring, designing and 3 test prints [i've figured out the filler cap threads](https://i.imgur.com/iiujmaz.png). \n\nsince the angle of the threads is opposite from the filler cap to the compressor i'm going to print two separate parts and glue them together. a test print for the thread pitch on the compressor is printing now. \n\ni'll make sure to post an update in a few days with progress.", "sortedWord": "None", "removed": null, "score": 1, "comments": 19, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/mlhnzf/for_my_next_project_i_am_retrofitting_a_pumpzero/", "identifyer": 220648, "year": "2021"}], "name": "printlawncare2021"}