{"interestingcomments": [{"Unnamed: 0": 211963, "autor": "melfenx", "date": 1609614234000, "content": "Can our yard be fixed? St Augustine in Houston Zone 9a. /!/ St Augustine Grass. Houston Zone 9a. We have a huge bare area in our yard. There used to be grass here but I believe it all died from a combination of not watering, our mowers mowing too low, and trees shading the area (which have now been removed). Is there any way to fix this area of the yard or do we need to re sod? Is it possible for the runners to ever fill back in this area? We just had a sprinkler system installed so everything is pretty muddy. With the temperatures right now, I figure we can’t do anything until the Spring. But still want to come up with a plan. Any help would be appreciated!\n\nPictures:\n\nhttps://imgur.com/a/Jx21wRz\n\nhttps://imgur.com/a/q413VLx", "link": "https://www.reddit.com/r/lawncare/comments/kp3dj5/can_our_yard_be_fixed_st_augustine_in_houston/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "can our yard be fixed? st augustine in houston zone 9a. /!/ st augustine grass. houston zone 9a. we have a huge bare area in our yard. there used to be grass here but i believe it all died from a combination of not watering, our mowers mowing too low, and trees shading the area (which have now been removed). is there any way to fix this area of the yard or do we need to re sod? is it possible for the runners to ever fill back in this area? we just had a sprinkler system installed so everything is pretty muddy. with the temperatures right now, i figure we can’t do anything until the spring. but still want to -----> come !!!  -----> up !!!  -----> with !!!  a plan. any help would be appreciated!\n\npictures:\n\nhttps://imgur.com/a/jx21wrz\n\nhttps://imgur.com/a/q413vlx", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/kp3dj5/can_our_yard_be_fixed_st_augustine_in_houston/", "identifyer": 211963, "year": "2021"}, {"Unnamed: 0": 216667, "autor": "guancharlie", "date": 1621392229000, "content": "Fixing grade of backyard...SOS /!/ I recently decided to fix up my backyard.  It used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! The tree has since been removed.  For the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  It has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  So, I was tired of looking at this eyesore and so I took it upon myself to fix the slope of the backyard. \n\nI researched and know the basic steps I need to take to complete this task:\n\n1. Remove top layer\n2. Till the top soil\n3. Rake and even out grade of top soil\n4. Add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. Covering with sod\n\nUpon removing the top layer I've come into a problem:\n\nAlthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  As I dug and removed the top layer, I would come up with shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\nI have not finished removing the top layer, but I foresee that what I will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  My question is this:\n\n1. How will this affect my ability to till the soil using a till machine/ tool?\n2. How will this affect the laying of new sod?\n3. Do I have to remove all brick and stone in order to till?\n4. Should I seek professional help (It's only day 2 and my back is killing me)?   \n\nPlease, I am dying for some advice!!!!", "link": "https://www.reddit.com/r/lawncare/comments/nftt6c/fixing_grade_of_backyardsos/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "fixing grade of backyard...sos /!/ i recently decided to fix up my backyard.  it used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! the tree has since been removed.  for the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  it has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  so, i was tired of looking at this eyesore and so i took it upon myself to fix the slope of the backyard. \n\ni researched and know the basic steps i need to take to complete this task:\n\n1. remove top layer\n2. till the top soil\n3. rake and even out grade of top soil\n4. add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. covering with sod\n\nupon removing the top layer i've come into a problem:\n\nalthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  as i dug and removed the top layer, i would -----> come !!!  -----> up !!!  -----> with !!!  shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\ni have not finished removing the top layer, but i foresee that what i will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  my question is this:\n\n1. how will this affect my ability to till the soil using a till machine/ tool?\n2. how will this affect the laying of new sod?\n3. do i have to remove all brick and stone in order to till?\n4. should i seek professional help (it's only day 2 and my back is killing me)?   \n\nplease, i am dying for some advice!!!!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/nftt6c/fixing_grade_of_backyardsos/", "identifyer": 216667, "year": "2021"}, {"Unnamed: 0": 222102, "autor": "eschulma2020", "date": 1629377064000, "content": "Best setup for overseed watering /!/ The lawn company is going to dethatch, aerate, and overseed soon, and unlike previous years I really want to get the seed watering right. We had a bad crabgrass infestation this year due to the county banning all chemicals from professionals, so I had to kill it off myself with Tenacity. There are large parts of the yard that were almost all crabgrass so I want to help the seed as much as possible.\n\nI recently got a tractor sprinkler based on suggestions here. It looks to be a great tool for watering the lawn, but maybe not for the initial overseeding, because I gather that the initial goal is just to sprinkle the seeds with water multiple times a day rather than doing deep watering. My backyard is about 90 feet by 70 feet and I am trying to come up with a sensible sprinkler setup. None of the oscillating ones look big enough even if I run two at a time. Does anyone have a suggestion for a good setup?", "link": "https://www.reddit.com/r/lawncare/comments/p7e3r1/best_setup_for_overseed_watering/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "best setup for overseed watering /!/ the lawn company is going to dethatch, aerate, and overseed soon, and unlike previous years i really want to get the seed watering right. we had a bad crabgrass infestation this year due to the county banning all chemicals from professionals, so i had to kill it off myself with tenacity. there are large parts of the yard that were almost all crabgrass so i want to help the seed as much as possible.\n\ni recently got a tractor sprinkler based on suggestions here. it looks to be a great tool for watering the lawn, but maybe not for the initial overseeding, because i gather that the initial goal is just to sprinkle the seeds with water multiple times a day rather than doing deep watering. my backyard is about 90 feet by 70 feet and i am trying to -----> come !!!  -----> up !!!  -----> with !!!  a sensible sprinkler setup. none of the oscillating ones look big enough even if i run two at a time. does anyone have a suggestion for a good setup?", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/p7e3r1/best_setup_for_overseed_watering/", "identifyer": 222102, "year": "2021"}, {"Unnamed: 0": 223184, "autor": "BnWk", "date": 1627180946000, "content": "What mower should I buy? /!/ Just got a house, and my new JD S130 broke less than a month after buying it, and I realize I need a bigger, better riding mower. My strict budget is 5k so I came up with the following options:\n\n\nHusquavarna TS48XD \nPrice:$3999\n\nPros:  K66 transmission, Kawasaki engine.\nCons: Reviews question frame strength, durability. Unreliable warranty.\n\n\nJohn Deere X380\nPrice:$4699\n\nPros: Kawasaki engine, good frame strength, reliable warranty.\n\nCons: K58 transmission\n\n\nSimplicity Broadmoor 2691670\nDealer discount:$3,699 or $3,799(forgot which one)\n\nPros: Good frame strength, Good price.\n\nCons: Lacking a warranty, K57 transmission,  Briggs engine.\n\nI have about two acres to mow, pulling a small trailer or dump cart. I want to move a few small trees with the trailer. I will need to be able to blow/pust snow in the winter. What do you think would be the best out of the three? Is there another option I haven't mentioned?", "link": "https://www.reddit.com/r/lawncare/comments/or3h5x/what_mower_should_i_buy/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "what mower should i buy? /!/ just got a house, and my new jd s130 broke less than a month after buying it, and i realize i need a bigger, better riding mower. my strict budget is 5k so i -----> came !!!  -----> up !!!  -----> with !!!  the following options:\n\n\nhusquavarna ts48xd \nprice:$3999\n\npros:  k66 transmission, kawasaki engine.\ncons: reviews question frame strength, durability. unreliable warranty.\n\n\njohn deere x380\nprice:$4699\n\npros: kawasaki engine, good frame strength, reliable warranty.\n\ncons: k58 transmission\n\n\nsimplicity broadmoor 2691670\ndealer discount:$3,699 or $3,799(forgot which one)\n\npros: good frame strength, good price.\n\ncons: lacking a warranty, k57 transmission,  briggs engine.\n\ni have about two acres to mow, pulling a small trailer or dump cart. i want to move a few small trees with the trailer. i will need to be able to blow/pust snow in the winter. what do you think would be the best out of the three? is there another option i haven't mentioned?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/or3h5x/what_mower_should_i_buy/", "identifyer": 223184, "year": "2021"}], "name": "withlawncare2021"}