{"interestingcomments": [{"Unnamed: 0": 33739, "autor": "Cylisellare", "date": 1599596277000, "content": "Sorting through the archive from last season [ Sony a9 | FE 400mm F2.8 GM OSS ]", "link": "https://www.reddit.com/r/SonyAlpha/comments/ip19c1/sorting_through_the_archive_from_last_season_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "sorting through the -----> archive !!!  from last season [ sony a9 | fe 400mm f2.8 gm oss ]", "sortedWord": "None", "identifyer": 34459, "year": "2020"}, {"Unnamed: 0": 39354, "autor": "marcotonetti", "date": 1592435461000, "content": "What would you need for your photography passion or business? /!/ Hello everyone, I’m considering working on a series of web apps for photographers only. The goal would be to create a suite of products tailored around photographers needs; and I would like to hear from you what you think would be really useful for your photography business or career.\n\nThink of anything from a tool that could help you closing new clients, to something for you to archive photos, to a software that could help you overcoming a specific struggle or that could save you lots of time.\n\nWhat would it be? Sky is the limit here so feel free to wonder anywhere you like with your mind. Chances are that your idea could help giving life to a brand new digital product for everyone to use it.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hb2hc0/what_would_you_need_for_your_photography_passion/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what would you need for your photography passion or business? /!/ hello everyone, i’m considering working on a series of web apps for photographers only. the goal would be to create a suite of products tailored around photographers needs; and i would like to hear from you what you think would be really useful for your photography business or career.\n\nthink of anything from a tool that could help you closing new clients, to something for you to -----> archive !!!  photos, to a software that could help you overcoming a specific struggle or that could save you lots of time.\n\nwhat would it be? sky is the limit here so feel free to wonder anywhere you like with your mind. chances are that your idea could help giving life to a brand new digital product for everyone to use it.", "sortedWord": "None", "identifyer": 40213, "year": "2020"}, {"Unnamed: 0": 49210, "autor": "[deleted]", "date": 1595098202000, "content": "MyShoots - a new service that comes with unlimited archive I've space /!/ [deleted]", "link": "https://www.reddit.com/r/SonyAlpha/comments/htlu4l/myshoots_a_new_service_that_comes_with_unlimited/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "myshoots - a new service that comes with unlimited -----> archive !!!  i've space /!/ [deleted]", "sortedWord": "None", "identifyer": 50408, "year": "2020"}], "name": "archiveSonyAlpha2020"}