{"interestingcomments": [{"Unnamed: 0": 136001, "autor": "inorman", "date": 1623747462000, "content": "ClearImage Zoom and APS-C modes are AMAZING for video. /!/ Seriously, ClearImage Zoom and APS-C modes are severely underrated tools on your Sony camera. They're AMAZING for video work and have clear [resolution benefits](https://imgur.com/a/w8QI7an). If you do video work with your Sony camera, do yourself a favor add them to your tool chest right now by mapping them to a custom key or into your Fn menu. \n\nWHAT IT IS: \n\nYou probably already know this, but anyways: ClearImage Zoom and APS-C modes effectively apply a crop to your recording so that you can, well, \"zoom-in\", for when you need more reach from your lens. These modes are particularly useful for video work. \n\nThe best part about these functions is that on any of the 24MP+ bodies like the a7III a7RIV, etc., you can still maintain true 4K video resolution, even with the 1.5x cropping of ClearImage Zoom or APS-C mode, making for a tangible benefit to video recording if you need more reach from your lens.\n\nIn my experience, this is extremely effective and any kind of quality difference between full-frame and APS-C modes or 1.5x ClearImage Zoom for video are negligible. In fact, the extra \"reach\" of the crop gives you more resolution on distant subjects and can really make a positive difference in detail in your video shots when you need just a little tighter field of view. \n\nI personally shoot a lot with prime lenses (usually for the aperture/size benefit) but sometimes that can feel restricting in terms of focal length coverage... but ClearImage Zoom and/or APS-C modes dramatically increased the usability range of my fixed focal length prime lenses. \n\nPRIMES BECOME ZOOMS\n\nIn my case, ClearImage Zoom has totally changed the way that I look at the usefulness of my primes. My a7III and a7C can do ClearImage Zoom up to 1.5x in 4K/24p/30p. With that, now my 18mm can be effectively an 18-27mm for 4K/24p recording. And with all 3 of my primes: 18mm, 35mm and 55mm, I basically have nearly full FOV coverage from an equivalent 18-72.5mm coverage in 4K shooting. \n\nZOOMS BECOME ZOOMIER\n\nThis is also beneficial to zoom lenses of course. It means a 24-70mm can become effectively a 24-105. Or as another example, a 17-28mm becomes up to a 17-56mm. That's a really useful improvement in overall reach with a single zoom lens. \n\nBUT WAIT, THERE'S MORE... IT GOES EVEN FARTHER: \n\nIt gets even more interesting and useful because in 4K recording, you can **COMBINE 1.5x APS-C mode with 1.5x ClearImage Zoom to get an effective 2.25x crop**, all while still capturing what's basically a 2.7K section of the sensor (on the a7III at least) that gets upsampled to 4K. The resulting video when doing this still looks exceptionally good in a 4K timeline and there's still a tangible resolution benefit to doing this: you'll be able to resolve significantly more detail on distant subjects.\n\nJust as an example, here's [what's possible on just my 55mm lens in term of zoom fields of view](https://imgur.com/a/fckAzrY) by using these modes. And these crops show that there is a [clear benefit in terms of resolution on distant subjects](https://imgur.com/a/w8QI7an) when combining both APS-C and ClearImage Zoom.\n\nSo even better now, by combining both modes, my single 18mm prime lens is now effectively an 18-40mm zoom.  And with my 3 small prime lenses (18, 35, 55), I can cover nearly any focal length equivalent from 18mm to 124mm. \n\nWHY AREN'T YOU USING THESE MODES FOR VIDEO?\n\nFor 4K video shooters, I really feel like these features are heavily overlooked because the idea of cropping an image feels inherently destructive. Why not use the full sensor if we have it right? \n\nBut remember that the fact that our output in video is already limited to 3840 pixels wide means that we're already dramatically downsampling from the full sensor width. Why not use some of those extra pixels for some extra zoom reach when we need it?\n\nDo you you ClearImage Zoom or APS-C mode for your video work? Why or why not?", "link": "https://www.reddit.com/r/SonyAlpha/comments/o09t6i/clearimage_zoom_and_apsc_modes_are_amazing_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapping", "selectorShort": "map", "MarkedSent": "clearimage zoom and aps-c modes are amazing for video. /!/ seriously, clearimage zoom and aps-c modes are severely underrated tools on your sony camera. they're amazing for video work and have clear [resolution benefits](https://imgur.com/a/w8qi7an). if you do video work with your sony camera, do yourself a favor add them to your tool chest right now by -----> mapping !!!  them to a custom key or into your fn menu. \n\nwhat it is: \n\nyou probably already know this, but anyways: clearimage zoom and aps-c modes effectively apply a crop to your recording so that you can, well, \"zoom-in\", for when you need more reach from your lens. these modes are particularly useful for video work. \n\nthe best part about these functions is that on any of the 24mp+ bodies like the a7iii a7riv, etc., you can still maintain true 4k video resolution, even with the 1.5x cropping of clearimage zoom or aps-c mode, making for a tangible benefit to video recording if you need more reach from your lens.\n\nin my experience, this is extremely effective and any kind of quality difference between full-frame and aps-c modes or 1.5x clearimage zoom for video are negligible. in fact, the extra \"reach\" of the crop gives you more resolution on distant subjects and can really make a positive difference in detail in your video shots when you need just a little tighter field of view. \n\ni personally shoot a lot with prime lenses (usually for the aperture/size benefit) but sometimes that can feel restricting in terms of focal length coverage... but clearimage zoom and/or aps-c modes dramatically increased the usability range of my fixed focal length prime lenses. \n\nprimes become zooms\n\nin my case, clearimage zoom has totally changed the way that i look at the usefulness of my primes. my a7iii and a7c can do clearimage zoom up to 1.5x in 4k/24p/30p. with that, now my 18mm can be effectively an 18-27mm for 4k/24p recording. and with all 3 of my primes: 18mm, 35mm and 55mm, i basically have nearly full fov coverage from an equivalent 18-72.5mm coverage in 4k shooting. \n\nzooms become zoomier\n\nthis is also beneficial to zoom lenses of course. it means a 24-70mm can become effectively a 24-105. or as another example, a 17-28mm becomes up to a 17-56mm. that's a really useful improvement in overall reach with a single zoom lens. \n\nbut wait, there's more... it goes even farther: \n\nit gets even more interesting and useful because in 4k recording, you can **combine 1.5x aps-c mode with 1.5x clearimage zoom to get an effective 2.25x crop**, all while still capturing what's basically a 2.7k section of the sensor (on the a7iii at least) that gets upsampled to 4k. the resulting video when doing this still looks exceptionally good in a 4k timeline and there's still a tangible resolution benefit to doing this: you'll be able to resolve significantly more detail on distant subjects.\n\njust as an example, here's [what's possible on just my 55mm lens in term of zoom fields of view](https://imgur.com/a/fckazry) by using these modes. and these crops show that there is a [clear benefit in terms of resolution on distant subjects](https://imgur.com/a/w8qi7an) when combining both aps-c and clearimage zoom.\n\nso even better now, by combining both modes, my single 18mm prime lens is now effectively an 18-40mm zoom.  and with my 3 small prime lenses (18, 35, 55), i can cover nearly any focal length equivalent from 18mm to 124mm. \n\nwhy aren't you using these modes for video?\n\nfor 4k video shooters, i really feel like these features are heavily overlooked because the idea of cropping an image feels inherently destructive. why not use the full sensor if we have it right? \n\nbut remember that the fact that our output in video is already limited to 3840 pixels wide means that we're already dramatically downsampling from the full sensor width. why not use some of those extra pixels for some extra zoom reach when we need it?\n\ndo you you clearimage zoom or aps-c mode for your video work? why or why not?", "sortedWord": "None", "identifyer": 26779, "year": "2021"}, {"Unnamed: 0": 139569, "autor": "cnr0", "date": 1609629557000, "content": "Are there any Sony QX users? /!/ I have purchased not one, but two QX100's in 2013. Still rocking it - these devices has their own niche, connects to your smartphone via WLAN and you can take pictures and videos in DSLR quality but in a very small form factor. \n\nI am still using them as video recorders - with 1 inch sensor they provide incredible result for talking-heads videos and interviews,  but really hate the PlayMemories / ImagingEdge apps and it seems like nobody is interested into developing some new software / firmware into it. I really wish I can map the shutter button to video, firmware is  very buggy, but still, the development has been stopped already. \n\nAnybody here still uses their QX? Just wanted to gather and share experiences.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kp89g1/are_there_any_sony_qx_users/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "are there any sony qx users? /!/ i have purchased not one, but two qx100's in 2013. still rocking it - these devices has their own niche, connects to your smartphone via wlan and you can take pictures and videos in dslr quality but in a very small form factor. \n\ni am still using them as video recorders - with 1 inch sensor they provide incredible result for talking-heads videos and interviews,  but really hate the playmemories / imagingedge apps and it seems like nobody is interested into developing some new software / firmware into it. i really wish i can -----> map !!!  the shutter button to video, firmware is  very buggy, but still, the development has been stopped already. \n\nanybody here still uses their qx? just wanted to gather and share experiences.", "sortedWord": "None", "identifyer": 30469, "year": "2021"}, {"Unnamed: 0": 143350, "autor": "nurse_miles", "date": 1623398134000, "content": "Awaiting New Macro GM Lens /!/ Anyone else waiting for Sony to drop a new macro lens? Iv been saving my money for when/if they drop the lens this year. Sony Alpha Rumors posted a road map that listed the Macro GM Lens right below the 50mm f/1.2…", "link": "https://www.reddit.com/r/SonyAlpha/comments/nxagyc/awaiting_new_macro_gm_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "awaiting new macro gm lens /!/ anyone else waiting for sony to drop a new macro lens? iv been saving my money for when/if they drop the lens this year. sony alpha rumors posted a road -----> map !!!  that listed the macro gm lens right below the 50mm f/1.2…", "sortedWord": "None", "identifyer": 34381, "year": "2021"}, {"Unnamed: 0": 143606, "autor": "Benjiblobs", "date": 1622134846000, "content": "Record button not work on my A7S ii /!/ As the title states, the record/movie button on my A7S ii has randomly stopped working. The camera hasn't taken a hit or been damp to my knowledge and the button has been working fine up until a few days ago.\n\nIt's not a huge deal because I have the movie record button mapped to C3 anyway (lifelong Canon user and old habits die hard) but I'd like to at least have the option of using it if possible. \n\nI've gone through the settings to see if there's anything set wrong, but I can't find anything. The setting that allows you to disable the button in modes other than movie mode is set to 'always' and I've been using the camera in movie mode.\n\nDoes anyone have any advice/anything else I can try?\n\nCheers in advance,\n\nBen", "link": "https://www.reddit.com/r/SonyAlpha/comments/nmc11u/record_button_not_work_on_my_a7s_ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "record button not work on my a7s ii /!/ as the title states, the record/movie button on my a7s ii has randomly stopped working. the camera hasn't taken a hit or been damp to my knowledge and the button has been working fine up until a few days ago.\n\nit's not a huge deal because i have the movie record button -----> mapped !!!  to c3 anyway (lifelong canon user and old habits die hard) but i'd like to at least have the option of using it if possible. \n\ni've gone through the settings to see if there's anything set wrong, but i can't find anything. the setting that allows you to disable the button in modes other than movie mode is set to 'always' and i've been using the camera in movie mode.\n\ndoes anyone have any advice/anything else i can try?\n\ncheers in advance,\n\nben", "sortedWord": "None", "identifyer": 34644, "year": "2021"}, {"Unnamed: 0": 146577, "autor": "existorexit", "date": 1628770612000, "content": "Keeping apart 4K &amp; Full HD shots apart during shooting on a Sony A7 III /!/ Is it possible for them to get stored in 2 different maps so I don't have to look up the resolution everytime in post-production before moving it into the timeline? That why I could make 2 folders for my footage so it's easier to know which shots are Full HD, and which shots are 4K.\n\nThanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/p2ymwc/keeping_apart_4k_full_hd_shots_apart_during/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "keeping apart 4k &amp; full hd shots apart during shooting on a sony a7 iii /!/ is it possible for them to get stored in 2 different -----> maps !!!  so i don't have to look up the resolution everytime in post-production before moving it into the timeline? that why i could make 2 folders for my footage so it's easier to know which shots are full hd, and which shots are 4k.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 37734, "year": "2021"}, {"Unnamed: 0": 149693, "autor": "daush", "date": 1617419648000, "content": "Back button mapped to Menu , Sony A7C /!/ Hi there, I don’t know if I’m posting in the right place.\n\nI got Sony A7C, update from nex 5n\nAnd one thing bitter me a lot. The back button is mapped to the Menu button up the touch screen.\nIs uncomfortable and difficult access. \nWhen I want to press back using my left hand the screen turn off (view finder)\n\nI tried but I can’t see an option to map the back/return button to another key.\n\nIs that possible ?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mj07j4/back_button_mapped_to_menu_sony_a7c/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "back button -----> mapped !!!  to menu , sony a7c /!/ hi there, i don’t know if i’m posting in the right place.\n\ni got sony a7c, update from nex 5n\nand one thing bitter me a lot. the back button is mapped to the menu button up the touch screen.\nis uncomfortable and difficult access. \nwhen i want to press back using my left hand the screen turn off (view finder)\n\ni tried but i can’t see an option to map the back/return button to another key.\n\nis that possible ?", "sortedWord": "None", "identifyer": 40965, "year": "2021"}, {"Unnamed: 0": 149818, "autor": "smh_photo", "date": 1631965888000, "content": "Road map or schedule about next gears? /!/ Is there any road map or something like schedule about next gears, camera, lens etc. which is published officially by sony?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pql0um/road_map_or_schedule_about_next_gears/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "road -----> map !!!  or schedule about next gears? /!/ is there any road map or something like schedule about next gears, camera, lens etc. which is published officially by sony?", "sortedWord": "None", "identifyer": 41090, "year": "2021"}], "name": "mapSonyAlpha2021"}