{"interestingcomments": [{"Unnamed: 0": 234870, "autor": "sneekeemonkee", "date": 1533338897000, "content": "Fuji user looking at Sony and looking for some input from Sony users /!/ Hey everyone,\n\nCurrently I shoot with a Fuji X-T2 and the 23 1.4 (35mm equivalent) lens. Great combo. Magical glass.\n\nTL;DR - Jumping from Fujifilm to a fullframe body. Looking for Sony user input.   \n\n\nI've started to eye up an upgrade to move more fully towards landscape and cityscape photography with the odd bit of portraiture.  Currently I'm stuck between a Pentax K1 and the Sony A7Rii for options. I've read just about every review and comparison out there, but I'm wondering what real world users have for input here. \n\nWhat are some of the quirks of the A7Rii that you've noticed so far? \n\nAny nagging issues? \n\nHow does it's weather sealing hold up? \n\nIs it fairly easy to map exposure controls (ISO, aperture, SS) to dials? \n\nMy main pull towards Pentax is that it's something that just makes sense when you pick it up, as well as it being basically weatherproof and appears to handle cold weather well (I live in Canada). \n\nThe Sony (maybe just how my shop had it set up) was less than intuitive while attempting to try it out. The Sony however has the slightly better resolution, the smaller form factor, and the plethora of adaptable glass.", "link": "https://www.reddit.com/r/SonyAlpha/comments/94eivl/fuji_user_looking_at_sony_and_looking_for_some/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "fuji user looking at sony and looking for some input from sony users /!/ hey everyone,\n\ncurrently i shoot with a fuji x-t2 and the 23 1.4 (35mm equivalent) lens. great combo. magical glass.\n\ntl;dr - jumping from fujifilm to a fullframe body. looking for sony user input.   \n\n\ni've started to eye up an upgrade to move more fully towards landscape and cityscape photography with the odd bit of portraiture.  currently i'm stuck between a pentax k1 and the sony a7rii for options. i've read just about every review and comparison out there, but i'm wondering what real world users have for input here. \n\nwhat are some of the quirks of the a7rii that you've noticed so far? \n\nany nagging issues? \n\nhow does it's weather sealing hold up? \n\nis it fairly easy to -----> map !!!  exposure controls (iso, aperture, ss) to dials? \n\nmy main pull towards pentax is that it's something that just makes sense when you pick it up, as well as it being basically weatherproof and appears to handle cold weather well (i live in canada). \n\nthe sony (maybe just how my shop had it set up) was less than intuitive while attempting to try it out. the sony however has the slightly better resolution, the smaller form factor, and the plethora of adaptable glass.", "sortedWord": "None", "identifyer": 29934, "year": "2018"}, {"Unnamed: 0": 236405, "autor": "2CharlieTango", "date": 1523823290000, "content": "Offering my photos for sale - 1st one to replace trail map posters in ski condos", "link": "https://www.reddit.com/r/SonyAlpha/comments/8chvp4/offering_my_photos_for_sale_1st_one_to_replace/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "offering my photos for sale - 1st one to replace trail -----> map !!!  posters in ski condos", "sortedWord": "None", "identifyer": 31493, "year": "2018"}, {"Unnamed: 0": 239460, "autor": "iggyazaleatown", "date": 1528336917000, "content": "Eye AF won’t map to Focus Hold button, A7III /!/ It’s working for every other button, just not focus hold. Am I overlooking something dumb?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8p6hfr/eye_af_wont_map_to_focus_hold_button_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "eye af won’t -----> map !!!  to focus hold button, a7iii /!/ it’s working for every other button, just not focus hold. am i overlooking something dumb?", "sortedWord": "None", "identifyer": 34591, "year": "2018"}, {"Unnamed: 0": 243682, "autor": "colohan", "date": 1534271808000, "content": "Sony a7iii Geek's Review /!/ I bought a Sony a7iii a week ago.  I got two lenses, the kit lens (f3.5-5.6/28-70mm), and the f1.8/85mm lens.  My primary use case is recording videos of myself using a tripod in my home (hence my interest in the features below).\n\nWith a new toy, I had to play with it a bunch.  As a camera, it works better than any camera I’ve ever used.  I brought it on a camping trip, and was amazed at how late into the evening I was able to take reasonably clear photographs (at ISO12500).  The focus tracking when recording video with shallow depth-of-field is much better than any prior camera I’ve used.  I could take clear videos of my kids reading books in a dark tent to the light of a single flashlight.  Wow!  My kids think the slow-motion recording feature is neat.  The only “taking pictures” issue I’ve encountered so far is that one pixel always comes out bright white, no matter what the color of the area I’m taking a photo of is.  I guess that is what retouching is for, although I’d love a way to map it out and perhaps have it colored based on neighbouring pixels.\n\nIf you want to learn about how great the photos are, how great the videos are, etc. -- just go look for reviews on YouTube.  There are plenty of them.  But as an engineer, I tend to notice the things which are not quite right yet, and figured it would be useful for some others if I listed what I’ve noticed so far.\n\nMany reviewers have pointed out that the menu system is a mess.  But how is it a mess?  It has three problems:  (a) too many options presented in a single flat menu system.  The organization and categorization of menu items is loose at best, with many things crammed in where they don’t really seem to fit.  (b) too many poor abbreviations.  Quick, what is “Set. Face Prty in AF”?  Is it a face party?  Clicking on it reveals the oh-so-clear option “Face Dtct Frame Dsp”.  What?  (c) in a seemingly random fashion you can only select certain menu items in certain modes, only if you’ve not selected other menu items.  Getting something turned on (such as actual silent shooting with no beeps) is hopeless without Googling the answer.\n\nThe camera can be controlled by a cell app.  I’ve tried the PlayMemories Mobile app on Android (on a Google Pixel running the latest Android release 8.1.0).  Getting it to connect via WiFi over a local network is not something I’ve gotten to work.  I can’t get the bluetooth pairing to geotag photos to work.  The WiFi direct connection works -- as long as you don’t mistakenly open a menu or change modes, at which point the connection will probably (but not always) drop.  Once you run this app, Android will tell you that it is draining your phone’s battery -- even after you close the app, swipe it away, and turn off your camera.  You need to force stop it or reboot the phone to stop it from consuming power.  Every time you want to connect your app to the phone (even after a random dropped connection) you need to find the WiFi option deep in the phone menus (strangely you are not allowed to add this one to your custom quick menu) and turn it on again.  This annoyed the crud out of me until I figured out that an NFC tap also seems to turn it on.  So this app is better than not having the app, but has a lot of rough edges.\n\nThere is a desktop app called PC Remote.  Like the mobile app, it promises to let you not have to buy an external monitor for your camera, just use a laptop instead!  I got it to work by plugging in a micro-USB cable.  It worked briefly then failed if I tried using USB-C.  It strangely doesn’t work over WiFi or bluetooth.  The UI is so compact as to be illegible on my Surface Book screen.  It seems that Sony engineers only own (and test on) lower-resolution displays.  Due to my trouble connecting, requirement for a cable, and the tiny display, this is much less useful to me than the flaky cell app -- so I don’t think I’ll be using it (even though it would give me a much larger display).\n\nThe phone supports WiFi.  Cool, can you use that to copy photos to your computer?  It supports that, via ftp -- great!  So I set that up.  I configured an ftp server, and then gave the phone the credentials and IP address.  It worked… sort of.  To use it, you have to select each and every photo you want to copy.  You can’t just say “copy them all”.  Or even better, “copy each photo to my server as I take it”.  That would be too easy.  Worse yet, it arbitrarily refuses to copy video files, it only copies photos.  Photos get placed in a directory named via a random number generator, so after they are copied you have to go hunting for them.  This is a feature which seems not ready for actual use on a “pro-level” camera -- what I’d really want is for the fully-configured camera to just automatically copy photos and videos to my server as I take them, without my getting involved.  Perhaps this will come someday.\n\nOverall, I love the camera -- but some of the features could certainly use some work.", "link": "https://www.reddit.com/r/SonyAlpha/comments/97awxj/sony_a7iii_geeks_review/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "sony a7iii geek's review /!/ i bought a sony a7iii a week ago.  i got two lenses, the kit lens (f3.5-5.6/28-70mm), and the f1.8/85mm lens.  my primary use case is recording videos of myself using a tripod in my home (hence my interest in the features below).\n\nwith a new toy, i had to play with it a bunch.  as a camera, it works better than any camera i’ve ever used.  i brought it on a camping trip, and was amazed at how late into the evening i was able to take reasonably clear photographs (at iso12500).  the focus tracking when recording video with shallow depth-of-field is much better than any prior camera i’ve used.  i could take clear videos of my kids reading books in a dark tent to the light of a single flashlight.  wow!  my kids think the slow-motion recording feature is neat.  the only “taking pictures” issue i’ve encountered so far is that one pixel always comes out bright white, no matter what the color of the area i’m taking a photo of is.  i guess that is what retouching is for, although i’d love a way to -----> map !!!  it out and perhaps have it colored based on neighbouring pixels.\n\nif you want to learn about how great the photos are, how great the videos are, etc. -- just go look for reviews on youtube.  there are plenty of them.  but as an engineer, i tend to notice the things which are not quite right yet, and figured it would be useful for some others if i listed what i’ve noticed so far.\n\nmany reviewers have pointed out that the menu system is a mess.  but how is it a mess?  it has three problems:  (a) too many options presented in a single flat menu system.  the organization and categorization of menu items is loose at best, with many things crammed in where they don’t really seem to fit.  (b) too many poor abbreviations.  quick, what is “set. face prty in af”?  is it a face party?  clicking on it reveals the oh-so-clear option “face dtct frame dsp”.  what?  (c) in a seemingly random fashion you can only select certain menu items in certain modes, only if you’ve not selected other menu items.  getting something turned on (such as actual silent shooting with no beeps) is hopeless without googling the answer.\n\nthe camera can be controlled by a cell app.  i’ve tried the playmemories mobile app on android (on a google pixel running the latest android release 8.1.0).  getting it to connect via wifi over a local network is not something i’ve gotten to work.  i can’t get the bluetooth pairing to geotag photos to work.  the wifi direct connection works -- as long as you don’t mistakenly open a menu or change modes, at which point the connection will probably (but not always) drop.  once you run this app, android will tell you that it is draining your phone’s battery -- even after you close the app, swipe it away, and turn off your camera.  you need to force stop it or reboot the phone to stop it from consuming power.  every time you want to connect your app to the phone (even after a random dropped connection) you need to find the wifi option deep in the phone menus (strangely you are not allowed to add this one to your custom quick menu) and turn it on again.  this annoyed the crud out of me until i figured out that an nfc tap also seems to turn it on.  so this app is better than not having the app, but has a lot of rough edges.\n\nthere is a desktop app called pc remote.  like the mobile app, it promises to let you not have to buy an external monitor for your camera, just use a laptop instead!  i got it to work by plugging in a micro-usb cable.  it worked briefly then failed if i tried using usb-c.  it strangely doesn’t work over wifi or bluetooth.  the ui is so compact as to be illegible on my surface book screen.  it seems that sony engineers only own (and test on) lower-resolution displays.  due to my trouble connecting, requirement for a cable, and the tiny display, this is much less useful to me than the flaky cell app -- so i don’t think i’ll be using it (even though it would give me a much larger display).\n\nthe phone supports wifi.  cool, can you use that to copy photos to your computer?  it supports that, via ftp -- great!  so i set that up.  i configured an ftp server, and then gave the phone the credentials and ip address.  it worked… sort of.  to use it, you have to select each and every photo you want to copy.  you can’t just say “copy them all”.  or even better, “copy each photo to my server as i take it”.  that would be too easy.  worse yet, it arbitrarily refuses to copy video files, it only copies photos.  photos get placed in a directory named via a random number generator, so after they are copied you have to go hunting for them.  this is a feature which seems not ready for actual use on a “pro-level” camera -- what i’d really want is for the fully-configured camera to just automatically copy photos and videos to my server as i take them, without my getting involved.  perhaps this will come someday.\n\noverall, i love the camera -- but some of the features could certainly use some work.", "sortedWord": "None", "identifyer": 38885, "year": "2018"}], "name": "mapSonyAlpha2018"}