{"interestingcomments": [{"Unnamed: 0": 2371, "autor": "lukepighetti", "date": 1561837068000, "content": "a7iii rotating portrait video /!/ Hey all, is there any way to get the Sony to output 1080 x 1920 files in portrait orientation instead of 1920 x 1080? It would make my life easier when sorting through my videos in my editor (FCPX)", "link": "https://www.reddit.com/r/SonyAlpha/comments/c73l8r/a7iii_rotating_portrait_video/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a7iii rotating portrait video /!/ hey all, is there any way to get the sony to output 1080 x 1920 files in portrait -----> orientation !!!  instead of 1920 x 1080? it would make my life easier when sorting through my videos in my editor (fcpx)", "sortedWord": "None", "identifyer": 2392, "year": "2019"}, {"Unnamed: 0": 5109, "autor": "merz-person", "date": 1562619164000, "content": "Anyone else bothered by this behavior in the A7iii? /!/ When I'm shooting vertical orientation on a tripod I often need to review my photos to ensure everything is properly in focus. However, when you zoom in the photo rotates back as if you're holding the camera horizontally. This is such a small inconvenience but it seems like it would be very easy to fix. Anyone else bothered by this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/caqrqb/anyone_else_bothered_by_this_behavior_in_the_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "anyone else bothered by this behavior in the a7iii? /!/ when i'm shooting vertical -----> orientation !!!  on a tripod i often need to review my photos to ensure everything is properly in focus. however, when you zoom in the photo rotates back as if you're holding the camera horizontally. this is such a small inconvenience but it seems like it would be very easy to fix. anyone else bothered by this?", "sortedWord": "None", "identifyer": 5165, "year": "2019"}, {"Unnamed: 0": 14549, "autor": "dantose", "date": 1558271624000, "content": "A5000 How to turn off auto portrait crop? /!/ Just picked up a a5000 as a second camera and it seems to randomly crop photos to portrait orientation. This seems to reliably ruin the effected photos. I can't seem to find the option to turn it off and Google insisted on telling me instructions for the 6000 instead.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bqgt6m/a5000_how_to_turn_off_auto_portrait_crop/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a5000 how to turn off auto portrait crop? /!/ just picked up a a5000 as a second camera and it seems to randomly crop photos to portrait -----> orientation !!! . this seems to reliably ruin the effected photos. i can't seem to find the option to turn it off and google insisted on telling me instructions for the 6000 instead.", "sortedWord": "None", "identifyer": 14763, "year": "2019"}], "name": "orientationSonyAlpha2019"}