{"interestingcomments": [{"Unnamed: 0": 1690, "autor": "Emesine", "date": 1549309996000, "content": "Triggering the camera remotely hands-free /!/ Hey, so I have a somewhat tricky problem. I need to be able to trigger my a6000 remotely, however for the shots I'm taking I can't use my hands. I'm a hand balancer, so I need to be able to get into position, feel that I'm ready, and then trigger the camera.  \n\n\nI have thought of two possible solutions:\n\n1. Voice activation. I'm not sure if there are any remotes or apps which support voice activation, but if so this would be great.\n2. Use a long-range remote that is small enough to fit in my mouth. I could then just use my tongue to trigger the remote button. Not ideal, but would probably work just fine.  \n\n\nDoes anyone know of any possibilities for either option? For the remote in mouth option, I think the remote needs to be no more than  3\" (7.5cm) long, and it can't be IR, but infrared won't pass through flesh.\n\n  \nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/an5itn/triggering_the_camera_remotely_handsfree/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "triggering the camera remotely hands-free /!/ hey, so i have a somewhat tricky problem. i need to be able to trigger my a6000 remotely, however for the shots i'm taking i can't use my hands. i'm a hand balancer, so i need to be able to get into -----> position !!! , feel that i'm ready, and then trigger the camera.  \n\n\ni have thought of two possible solutions:\n\n1. voice activation. i'm not sure if there are any remotes or apps which support voice activation, but if so this would be great.\n2. use a long-range remote that is small enough to fit in my mouth. i could then just use my tongue to trigger the remote button. not ideal, but would probably work just fine.  \n\n\ndoes anyone know of any possibilities for either option? for the remote in mouth option, i think the remote needs to be no more than  3\" (7.5cm) long, and it can't be ir, but infrared won't pass through flesh.\n\n  \nthanks!", "sortedWord": "None", "identifyer": 1701, "year": "2019"}, {"Unnamed: 0": 2108, "autor": "Couch_King", "date": 1555553635000, "content": "A7s II -- Default to manual focus? /!/ Is there a way to set the A7s II so that it always defaults to manual focus?  I have my camera set up in a fixed position on a tripod. It would be great not to have to re-pull focus on the same spot every time I turn it on. Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/beg7cc/a7s_ii_default_to_manual_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7s ii -- default to manual focus? /!/ is there a way to set the a7s ii so that it always defaults to manual focus?  i have my camera set up in a fixed -----> position !!!  on a tripod. it would be great not to have to re-pull focus on the same spot every time i turn it on. thanks!", "sortedWord": "None", "identifyer": 2124, "year": "2019"}, {"Unnamed: 0": 4413, "autor": "409W_TPW", "date": 1558628482000, "content": "Question: Sony a7rii Battery Grip issues, see post for question /!/ I have a Sony a7rii and the Sony (VG-C2EM) battery grip. I have a problem with the battery grip Not recognizing batteries in the #2 position. \n\nI will then switch the same battery to the #1 position and it works fine. Has anyone else here experienced this and if so did you find a fix? \n\nThanks for your help.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bs4yoy/question_sony_a7rii_battery_grip_issues_see_post/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: sony a7rii battery grip issues, see post for question /!/ i have a sony a7rii and the sony (vg-c2em) battery grip. i have a problem with the battery grip not recognizing batteries in the #2 -----> position !!! . \n\ni will then switch the same battery to the #1 position and it works fine. has anyone else here experienced this and if so did you find a fix? \n\nthanks for your help.", "sortedWord": "None", "identifyer": 4460, "year": "2019"}, {"Unnamed: 0": 5147, "autor": "_shootnick", "date": 1562574085000, "content": "A quick timelapse from an evening wandering around Orchard, Singapore. A7Riii | 70-200 Gmaster | 600 frame total using alpha internal intervolometer with a scale/position push in post to achieve a “Ken Burns” effect. Exposure: 123mm on 1 &amp; 3/5” at 80 ISO. Music: Marilyn Manson, Sweet Dreams.", "link": "https://www.reddit.com/r/SonyAlpha/comments/caicra/a_quick_timelapse_from_an_evening_wandering/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a quick timelapse from an evening wandering around orchard, singapore. a7riii | 70-200 gmaster | 600 frame total using alpha internal intervolometer with a scale/-----> position !!!  push in post to achieve a “ken burns” effect. exposure: 123mm on 1 &amp; 3/5” at 80 iso. music: marilyn manson, sweet dreams.", "sortedWord": "None", "identifyer": 5203, "year": "2019"}, {"Unnamed: 0": 6392, "autor": "Juniky", "date": 1555182278000, "content": "One Prime to rule them all: Sony 55 1.8 vs Batis 40 2.0 /!/ Hello everyone.\n\nI'm debating with myself over the last couple of weeks if I should stay with my Sony 55 1.8 or switch to the Batis 40/2 and would like to hear your opinion.\nComing from an old Canon 5D with the nifty-fifty I instantly just bought the 55 along with the A7III - which is a great combination. Especially when it comes down to a small general purpose setup. However, my main shots at the moment are wife and kids with not much spare time for trips that make use of specialized equipment - so I was wondering if 40mm would be a better choice than the 55 because I often find myself need to take a few steps back to get into position for the composition I want. \nFeels strange because I am really used to the 50mm and cant Imagine that those additional 5mm are a hindrance... But 40mm seems to be perfect.\n\nLong Story short: Which of both lenses is your choice when it comes down to the perfect standard walk around lens that barely left your camera? What are the pros and cons for each of them? Did anyone compared those two?\n\nBest regards!", "link": "https://www.reddit.com/r/SonyAlpha/comments/bcty46/one_prime_to_rule_them_all_sony_55_18_vs_batis_40/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "one prime to rule them all: sony 55 1.8 vs batis 40 2.0 /!/ hello everyone.\n\ni'm debating with myself over the last couple of weeks if i should stay with my sony 55 1.8 or switch to the batis 40/2 and would like to hear your opinion.\ncoming from an old canon 5d with the nifty-fifty i instantly just bought the 55 along with the a7iii - which is a great combination. especially when it comes down to a small general purpose setup. however, my main shots at the moment are wife and kids with not much spare time for trips that make use of specialized equipment - so i was wondering if 40mm would be a better choice than the 55 because i often find myself need to take a few steps back to get into -----> position !!!  for the composition i want. \nfeels strange because i am really used to the 50mm and cant imagine that those additional 5mm are a hindrance... but 40mm seems to be perfect.\n\nlong story short: which of both lenses is your choice when it comes down to the perfect standard walk around lens that barely left your camera? what are the pros and cons for each of them? did anyone compared those two?\n\nbest regards!", "sortedWord": "None", "identifyer": 6460, "year": "2019"}, {"Unnamed: 0": 7102, "autor": "ChrisWatkinsMedia1", "date": 1552950636000, "content": "5 minute exposure taken on my a7s a few years back! Hours of waiting for the moon to be in the perfect position!", "link": "https://www.reddit.com/r/SonyAlpha/comments/b2pjrl/5_minute_exposure_taken_on_my_a7s_a_few_years/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "5 minute exposure taken on my a7s a few years back! hours of waiting for the moon to be in the perfect -----> position !!! !", "sortedWord": "None", "identifyer": 7182, "year": "2019"}, {"Unnamed: 0": 7150, "autor": "Mullazman", "date": 1552359714000, "content": "Explore | A6300, iso 100, 50mm, f1.8, 1/500 + variable ND /!/ Hi Guys, I'd love to hear your feedback here, I've edited this to bring out the colour in the wood more, and make it sharper / more contrasted, I also bumped the vibrance and saturation as I do with wood all the time because I'm colour blind and love seeing more colour in nature - is this too much?\n\nAngle could have been better, I'm not convinced this was the best, and the horizon line is a little awkwardly positioned to me now (this isn't cropped - I should have taken it higher or lower, even removing the sky altogether?) \n\n&amp;#x200B;\n\nI'm just getting the hang of tone curves, but I bumped the highlights which made the water and sky more blue, I like this - what do you all think?\n\n&amp;#x200B;\n\nThanks for your feedback!\n\nhttps://i.redd.it/728m49r2sll21.jpg", "link": "https://www.reddit.com/r/SonyAlpha/comments/b02ofu/explore_a6300_iso_100_50mm_f18_1500_variable_nd/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "explore | a6300, iso 100, 50mm, f1.8, 1/500 + variable nd /!/ hi guys, i'd love to hear your feedback here, i've edited this to bring out the colour in the wood more, and make it sharper / more contrasted, i also bumped the vibrance and saturation as i do with wood all the time because i'm colour blind and love seeing more colour in nature - is this too much?\n\nangle could have been better, i'm not convinced this was the best, and the horizon line is a little awkwardly -----> positioned !!!  to me now (this isn't cropped - i should have taken it higher or lower, even removing the sky altogether?) \n\n&amp;#x200b;\n\ni'm just getting the hang of tone curves, but i bumped the highlights which made the water and sky more blue, i like this - what do you all think?\n\n&amp;#x200b;\n\nthanks for your feedback!\n\nhttps://i.redd.it/728m49r2sll21.jpg", "sortedWord": "None", "identifyer": 7231, "year": "2019"}, {"Unnamed: 0": 7341, "autor": "Hotshoedrew", "date": 1554993178000, "content": "With the recent firmware updates and app changes is anyone else a bit upset that you still can’t tap to focus in the “Imaging Edge Mobile” app with cameras like the A7RIII? /!/ I had hope that at some point I could trigger eye af through their app, but nope.\n\n\nCurrently taking self portraits is a crapshoot. I have to re-enable AF w/ shutter and either choose a focus area and try and position myself within that area, or set it to wide and hope that it focuses on what I want it to focus on. \n\n\nAs someone that has been back and forth between the Nikon and Sony systems it’s baffling to me that an entry level camera I had over 5 years ago was able to do this but I can’t do it with one of the most recently released cameras. \n\n\nAlso, if I have completely missed something I’d love to know.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bc0kv0/with_the_recent_firmware_updates_and_app_changes/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "with the recent firmware updates and app changes is anyone else a bit upset that you still can’t tap to focus in the “imaging edge mobile” app with cameras like the a7riii? /!/ i had hope that at some point i could trigger eye af through their app, but nope.\n\n\ncurrently taking self portraits is a crapshoot. i have to re-enable af w/ shutter and either choose a focus area and try and -----> position !!!  myself within that area, or set it to wide and hope that it focuses on what i want it to focus on. \n\n\nas someone that has been back and forth between the nikon and sony systems it’s baffling to me that an entry level camera i had over 5 years ago was able to do this but i can’t do it with one of the most recently released cameras. \n\n\nalso, if i have completely missed something i’d love to know.", "sortedWord": "None", "identifyer": 7427, "year": "2019"}, {"Unnamed: 0": 7479, "autor": "StrawHatHS", "date": 1567941600000, "content": "Sell A7RII and get the A7RIII, or Keep it and Get an A7III? /!/ So I realize the A7RIII vs A7III debate has been done a hundred times, but my circumstances are a little different. \n\nI currently own an A6300 and an A7RII. For my next body I'm either getting the A7III or A7RIII, but I have two options. I can sell the A7RII and grab the A7RIII (I can get one from a friend for the same price as the III, and keeping the RII wouldn't make any sense.) I would use that extra money to grab another lens. \n\nOr I can keep the RII and pick up the III. I love the extra megapixels so I want at least one of the 42mp sensor bodies. \n\nI'm mostly interested in video, which I know the A7III is better at, but I'm wondering if it's that much of a difference to put it over the convenience of one body. \n\nBut then is the A7RIII that much of a difference over the RII to outweigh the A7III choice. The A6300 is already a great video camera, but lacks Ibis and doesn't have that same full frame look. \n\nSo, if you were in my position what would you do? \n\nThanks for any suggestions!", "link": "https://www.reddit.com/r/SonyAlpha/comments/d19pdj/sell_a7rii_and_get_the_a7riii_or_keep_it_and_get/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sell a7rii and get the a7riii, or keep it and get an a7iii? /!/ so i realize the a7riii vs a7iii debate has been done a hundred times, but my circumstances are a little different. \n\ni currently own an a6300 and an a7rii. for my next body i'm either getting the a7iii or a7riii, but i have two options. i can sell the a7rii and grab the a7riii (i can get one from a friend for the same price as the iii, and keeping the rii wouldn't make any sense.) i would use that extra money to grab another lens. \n\nor i can keep the rii and pick up the iii. i love the extra megapixels so i want at least one of the 42mp sensor bodies. \n\ni'm mostly interested in video, which i know the a7iii is better at, but i'm wondering if it's that much of a difference to put it over the convenience of one body. \n\nbut then is the a7riii that much of a difference over the rii to outweigh the a7iii choice. the a6300 is already a great video camera, but lacks ibis and doesn't have that same full frame look. \n\nso, if you were in my -----> position !!!  what would you do? \n\nthanks for any suggestions!", "sortedWord": "None", "identifyer": 7570, "year": "2019"}, {"Unnamed: 0": 9982, "autor": "Crazyo_0", "date": 1548254222000, "content": "shutterSTUCK - shutter button stuck in the \"half-pressed\" position on ILCE6300 /!/ Hallo Alpha users! I got a a6300 which shutter button has the very bad habit to remain half-pressed. I tried -as suggested online, coz this seems to be a fairly common issue- with some lubricant for electronics circuits but it did nothing.\n\nNow I'm stuck just as the button, so if anybody can share some suggestions I'll read them as a Bible.\n\n&amp;#x200B;\n\n[https://www.reddit.com/r/SonyAlpha/comments/8j8xc3/stuck\\_shutter\\_button\\_in\\_a6300/](https://www.reddit.com/r/SonyAlpha/comments/8j8xc3/stuck_shutter_button_in_a6300/)\n\nAs you can read here I'm not the only one experiencing this issue, but I didn't understand too much of it\n\n&amp;#x200B;\n\nIf anyone can help me figure out how to change my shutter button he will save my job and help making my life a little less complicated. Thank you in advance", "link": "https://www.reddit.com/r/SonyAlpha/comments/aj0aqt/shutterstuck_shutter_button_stuck_in_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shutterstuck - shutter button stuck in the \"half-pressed\" -----> position !!!  on ilce6300 /!/ hallo alpha users! i got a a6300 which shutter button has the very bad habit to remain half-pressed. i tried -as suggested online, coz this seems to be a fairly common issue- with some lubricant for electronics circuits but it did nothing.\n\nnow i'm stuck just as the button, so if anybody can share some suggestions i'll read them as a bible.\n\n&amp;#x200b;\n\n[https://www.reddit.com/r/sonyalpha/comments/8j8xc3/stuck\\_shutter\\_button\\_in\\_a6300/](https://www.reddit.com/r/sonyalpha/comments/8j8xc3/stuck_shutter_button_in_a6300/)\n\nas you can read here i'm not the only one experiencing this issue, but i didn't understand too much of it\n\n&amp;#x200b;\n\nif anyone can help me figure out how to change my shutter button he will save my job and help making my life a little less complicated. thank you in advance", "sortedWord": "None", "identifyer": 10117, "year": "2019"}, {"Unnamed: 0": 10565, "autor": "kaydeay", "date": 1572246926000, "content": "Lens suggestion for a7r3 coming from a a77 /!/ Hey!\n\n I decided it was time to upgrade my old Sony A77 and bought a Sony A7R III. \nMost of my lenses are just for APS-C so I'm gonna have to switch them as well. \nI'm mostly doing landscapes and sometimes weddings and portraits, but that's not as important for me right now. Some time later I'll probably buy a 55m and a 85mm prime lens.\nTherefore I want an everyday lens and a wider lens for landscapes (and possibly astrophotography, I at least want the option, because I enjoy it from time to time)\n\nThe lenses I looked at:\n\nSony 24-70 f2.8 GM\nSony 24-105 f.4 G\nTamron 28-75 f2.8\n\nSony 16-35 f4\nSony 16-35 f2.8\nTamron 17-28 f.28\npossibly adapting a Canon 16-35\nMaybe even a prime lens (for example Zeiss Batis 18mm f2.8 or a Laowa 15mm f2.0)\n\nAs I want to buy 2 lenses, the SEL2470GM is probably out, as it costs as much as two other lenses. Same thing for the Sel1635GM probably. \n\nThat pretty much leaves The Sony 24-105 or the Tamron 28-75 \nand for wide the Sony 16-35 or the Tamron 17-28 (or a different prime lens). \n\nI think for everyday photography I'm okay with the f4, though I really want the possibility for astrophotography, so I should couple it with the Tamron 17-28 for the f2.8. \n\nAnyone else in a similar position or someone that can make a suggestion? :-)", "link": "https://www.reddit.com/r/SonyAlpha/comments/do5foj/lens_suggestion_for_a7r3_coming_from_a_a77/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens suggestion for a7r3 coming from a a77 /!/ hey!\n\n i decided it was time to upgrade my old sony a77 and bought a sony a7r iii. \nmost of my lenses are just for aps-c so i'm gonna have to switch them as well. \ni'm mostly doing landscapes and sometimes weddings and portraits, but that's not as important for me right now. some time later i'll probably buy a 55m and a 85mm prime lens.\ntherefore i want an everyday lens and a wider lens for landscapes (and possibly astrophotography, i at least want the option, because i enjoy it from time to time)\n\nthe lenses i looked at:\n\nsony 24-70 f2.8 gm\nsony 24-105 f.4 g\ntamron 28-75 f2.8\n\nsony 16-35 f4\nsony 16-35 f2.8\ntamron 17-28 f.28\npossibly adapting a canon 16-35\nmaybe even a prime lens (for example zeiss batis 18mm f2.8 or a laowa 15mm f2.0)\n\nas i want to buy 2 lenses, the sel2470gm is probably out, as it costs as much as two other lenses. same thing for the sel1635gm probably. \n\nthat pretty much leaves the sony 24-105 or the tamron 28-75 \nand for wide the sony 16-35 or the tamron 17-28 (or a different prime lens). \n\ni think for everyday photography i'm okay with the f4, though i really want the possibility for astrophotography, so i should couple it with the tamron 17-28 for the f2.8. \n\nanyone else in a similar -----> position !!!  or someone that can make a suggestion? :-)", "sortedWord": "None", "identifyer": 10704, "year": "2019"}, {"Unnamed: 0": 15053, "autor": "Yamsfordays", "date": 1569002127000, "content": "Wait or buy? /!/ I've been using an a6000 since it was released and over the 5 years I've owned it, it's really been through some shit. It's getting a little bit *too* beat up about now so I've been hoping to upgrade for a while.\n\nI bought the Zony 55mm last year so a FF upgrade would only require me to buy a body and I'm now in a position where I can afford to pick up an a7iii (yay).\n\nI was just wondering whether anyone is expecting black friday deals on the a7iii or if the a7iv is expected in the next few months? I'm not really in a rush and I don't wanna pick one up if a better opportunity is expected soon!", "link": "https://www.reddit.com/r/SonyAlpha/comments/d6yl4k/wait_or_buy/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wait or buy? /!/ i've been using an a6000 since it was released and over the 5 years i've owned it, it's really been through some shit. it's getting a little bit *too* beat up about now so i've been hoping to upgrade for a while.\n\ni bought the zony 55mm last year so a ff upgrade would only require me to buy a body and i'm now in a -----> position !!!  where i can afford to pick up an a7iii (yay).\n\ni was just wondering whether anyone is expecting black friday deals on the a7iii or if the a7iv is expected in the next few months? i'm not really in a rush and i don't wanna pick one up if a better opportunity is expected soon!", "sortedWord": "None", "identifyer": 15281, "year": "2019"}, {"Unnamed: 0": 16007, "autor": "trenzterra", "date": 1570591164000, "content": "A7iii and Sony 24-105G - weird focusing behaviour in AF-S /!/ Hi there, I just got my a7iii with the Sony 24-105G and am quite happy with the sharpness so far.\n\nHowever, I noticed the following peculiar behaviour when focusing in AF-S when taking landscape shots and was wondering if anyone else experiences this too:\n\n- at wider apertures (eg f4) and wider focal length (24mm), when I focus on something near, and then refocus on the landscape (around infinity distance), I am unable to get the entire field in focus. The point of focus remains acceptably sharp, but the left and right sides of the frame are slightly blurred.\n\n- however, when I refocus at a similar distance (i.e. half press shutter again), the resulting image is sharp from end to end. \n\nAt first I suspected field curvature, but this does not explain the second bit above. It seems like when the focus motor has to move a large distance, it lands at a \"slightly less than ideal\" position and requires additional nudging before it will focus correctly.\n\nI do not experience this issue at telephoto lengths, as well as my Tamron 28-75 and Sony 28mm shot wide open. AF-C seems generally fine, too.\n\nDoes anyone experience this too?", "link": "https://www.reddit.com/r/SonyAlpha/comments/dfb82s/a7iii_and_sony_24105g_weird_focusing_behaviour_in/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7iii and sony 24-105g - weird focusing behaviour in af-s /!/ hi there, i just got my a7iii with the sony 24-105g and am quite happy with the sharpness so far.\n\nhowever, i noticed the following peculiar behaviour when focusing in af-s when taking landscape shots and was wondering if anyone else experiences this too:\n\n- at wider apertures (eg f4) and wider focal length (24mm), when i focus on something near, and then refocus on the landscape (around infinity distance), i am unable to get the entire field in focus. the point of focus remains acceptably sharp, but the left and right sides of the frame are slightly blurred.\n\n- however, when i refocus at a similar distance (i.e. half press shutter again), the resulting image is sharp from end to end. \n\nat first i suspected field curvature, but this does not explain the second bit above. it seems like when the focus motor has to move a large distance, it lands at a \"slightly less than ideal\" -----> position !!!  and requires additional nudging before it will focus correctly.\n\ni do not experience this issue at telephoto lengths, as well as my tamron 28-75 and sony 28mm shot wide open. af-c seems generally fine, too.\n\ndoes anyone experience this too?", "sortedWord": "None", "identifyer": 16251, "year": "2019"}, {"Unnamed: 0": 16912, "autor": "FadeAesthetic", "date": 1564498607000, "content": "How to Vlog without a Flip screen /!/ Hey so I have almost purchased the Gh5 but the sweet Sony Autofocus is dragging me back. However without a flip screen I am not sure how I can vlog and am also a bit concerned about the IBIS of the Sony but mostly the screen. How do you do it without a screen, do you just know your camera so well that you know what is in shot all the time (do you not accidentally get into awkward positions or are you always in like a perfect grid position on the screen. Even the A6400 that does have a flip screen any external mic will block it so that's not possible (however I have seen some potential solutions, but with a6400 im losing all that buttery 4k 60fps+ goodness). Getting a monitor is out of the question because its just cumbersome and I guess I'm dumbfounded that people do seem to be vlogging without a screen (but how!!) Is there some hot tip like attach a mini mirror to my camera lol (but actually?)", "link": "https://www.reddit.com/r/SonyAlpha/comments/cjswd2/how_to_vlog_without_a_flip_screen/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "how to vlog without a flip screen /!/ hey so i have almost purchased the gh5 but the sweet sony autofocus is dragging me back. however without a flip screen i am not sure how i can vlog and am also a bit concerned about the ibis of the sony but mostly the screen. how do you do it without a screen, do you just know your camera so well that you know what is in shot all the time (do you not accidentally get into awkward -----> positions !!!  or are you always in like a perfect grid position on the screen. even the a6400 that does have a flip screen any external mic will block it so that's not possible (however i have seen some potential solutions, but with a6400 im losing all that buttery 4k 60fps+ goodness). getting a monitor is out of the question because its just cumbersome and i guess i'm dumbfounded that people do seem to be vlogging without a screen (but how!!) is there some hot tip like attach a mini mirror to my camera lol (but actually?)", "sortedWord": "None", "identifyer": 17171, "year": "2019"}, {"Unnamed: 0": 17161, "autor": "ShizFizz", "date": 1571500914000, "content": "A7RIV [ 35mm F1.8 ] Body And Feel Compared To The A7III And A7RIII [ JPG and Raw files included ] /!/ [Sample jpg folder here. Raw files are inside the \"Raw files\" folder](https://drive.google.com/open?id=1-v_ZMZxs_0dDXrCk7prgj4nv-iO4JOkC)\n\nThe pictures I took are honestly crap, and not really the focus of the post but I think someone might find them useful to judge the quality of Bokeh of the new 35mm F1.8 I'll add what I think of it below\n\nTL:DR at bottom\n\n**Compared to**\n\nA7RIII and A7III\n\nUpgraded from A7III, because I'm a pixel peeper and no AA filter. I really wanted the A7RIV for the body and grip but ultimately had a a couple factors such as file sizes and not needing 61mp made me choose the A7RIII\n\n**Where**\n\nSony Kiosk in Australia. Got test the A7RIV with the 35mm F1.8 which is great since other Australian camera stores, DCW and George's don't have a demo unit of both the A7RIV and the 35mm F1.8 since they are both relatively new.\n\n**How it feels in the hand**\n\n[Grip difference thanks to this helpful post](https://old.reddit.com/r/SonyAlpha/comments/ce1vtx/a7riv_vs_a7riii_grip_size_comparison_overlay/)\n\n*   I have small hands. When I first wrapped my fingers around the grip I kinda went \"Huh that feels pretty good. Isn't this how it normally feels?\" I tried the A7RIII and held it which is ok but going back to the A7RIV, the height of the groove and body was quite noticable. Your entire hand is now ever so slightly a bit further up, middle finger rests nicely in the groove and my pinky had a bit more contact with the body. It feels very solid to hold, but it doesn't come from the fingers as you might think. **It's the contact of your palm to the bottom of the camera, if you pick up your A7 camera, even if you have the pinky on the grip, the entire bottom part of your hand doesn't make contact with the body.**\n\n**Buttons**\n\n* They are now extremely tactile, coming from r/mechanicalkeyboards. When I went to press C1 and C2 I was not expecting the entire button the physically move up and down and let me tell you, the feeling of pressing down on the custom buttons is insanely satisfying. Very distinct with good travel distance and response and larger buttons, no mistaking if you did or did not press the button. This is extremely useful if you shoot in cold climates or weather where you might need to wear gloves. I only pressed C1, C2, C3, MENU, and AF-ON. I have no idea how the other buttons feel with my short time spent unfortunately. \n\n* The joystick (focus box mover thing) is alright? I can't really say for sure it feels better or worse than the one on the A7III or A7RIV.\n\n* The shutter button has also gotten the same treatment. I'm slightly not sure if I trust my memory on this, but I think the travel is slightly longer and might have a slightly better tactile feeling which will also help when shooting with gloves. If someone here has an A7RIV and can confirm if this is the case that would be great.\n\n**Dials**\n\n* The change of the default exposure dial being on the top instead of being half enclosed in the body makes sense now that your hand position has changed. It is much smoother and nicer to turn as a result probably due to the rotation mechanism being different. Being smoother and easier to rotate makes it much easier to use the back of your thumb to rotate the dial. \n\n* The Mode Dial (Auto, P, A, S, M) which I thought had been changed to toggle lock, is still the press and hold to rotate. I don't change modes at all since I shoot manual and haven't setup the customs shooting modes up out of laziness. Even then I still don't really like the rotation lock, I wish it was the toggle lock like on the exposure dial.\n\n* The Exposure Dial toggle lock is a welcome change. There are a good amount of times when I had the A7III when the exposure dial would be changed whenever I pulled it out of my bag or put it back in, this was extremely frustrating when using Auto ISO. I'd end up with an overexposed image and way too much noise. It's about half as tactile as the new improved buttons which is not bad and shouldn't matter as it's more of a set and forget button.\n\n**Slots**\n\n* I didn't test the slots on the left of the body. SD card slot being swapped, top being first and second being bottom tripped me up. The mechanism for the door is ok, I didn't have any issues with the old mechanism and prefer it mostly because I'm used to it. The mechanism requires a little more force to open, probably to stop it from accidentally opening.\n\nDid not test the viewfinder for some reason. LCD looks good\n\nAutofocus speed I feel depends more on the lens at this point. \n\n**Editing and Processing**\n\n* After processing the images and uploading the files made me glad I didn't buy the RIV, the files are huge. \n\n* A single JPG export at 300ppi takes around 1 minute 30 seconds +-15 seconds.\n\n* That is stupid long, for reference my CPU is an &gt;!AMD Ryzen 3900X!&lt;. If you have an Intel CPU or an older AMD CPU, please post your export times for a 300ppi jpg and what CPU you have.\n\n* 2 GB (1.94 rounded) for just 17 raw files??? \n\n**TL:DR and Closing thoughts**\n\n**TL:DR Great body, amazing tactile buttons, takes 1 and a half fucking minutes to export a jpg file. Even if money is no issue, time is. 1 and a half minutes with basically a top of the line AMD CPU to see a single jpg of your cat is insanity.**\n\nIf Sony released an A7IV, with a A7RIV body with 36mp instead of 24mp, I would buy it in a damn heartbeat. 90% of the time I don't need 42mp, I just like it for cropping in that 10% when I do. 36 would be a good middle ground. If you're confused as to why this camera was released along with the A9II instead of the A7SIII, I think some people have said it's in preparation for the 2020 Olympics.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dk5nfc/a7riv_35mm_f18_body_and_feel_compared_to_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7riv [ 35mm f1.8 ] body and feel compared to the a7iii and a7riii [ jpg and raw files included ] /!/ [sample jpg folder here. raw files are inside the \"raw files\" folder](https://drive.google.com/open?id=1-v_zmzxs_0ddxrck7prgj4nv-io4jokc)\n\nthe pictures i took are honestly crap, and not really the focus of the post but i think someone might find them useful to judge the quality of bokeh of the new 35mm f1.8 i'll add what i think of it below\n\ntl:dr at bottom\n\n**compared to**\n\na7riii and a7iii\n\nupgraded from a7iii, because i'm a pixel peeper and no aa filter. i really wanted the a7riv for the body and grip but ultimately had a a couple factors such as file sizes and not needing 61mp made me choose the a7riii\n\n**where**\n\nsony kiosk in australia. got test the a7riv with the 35mm f1.8 which is great since other australian camera stores, dcw and george's don't have a demo unit of both the a7riv and the 35mm f1.8 since they are both relatively new.\n\n**how it feels in the hand**\n\n[grip difference thanks to this helpful post](https://old.reddit.com/r/sonyalpha/comments/ce1vtx/a7riv_vs_a7riii_grip_size_comparison_overlay/)\n\n*   i have small hands. when i first wrapped my fingers around the grip i kinda went \"huh that feels pretty good. isn't this how it normally feels?\" i tried the a7riii and held it which is ok but going back to the a7riv, the height of the groove and body was quite noticable. your entire hand is now ever so slightly a bit further up, middle finger rests nicely in the groove and my pinky had a bit more contact with the body. it feels very solid to hold, but it doesn't come from the fingers as you might think. **it's the contact of your palm to the bottom of the camera, if you pick up your a7 camera, even if you have the pinky on the grip, the entire bottom part of your hand doesn't make contact with the body.**\n\n**buttons**\n\n* they are now extremely tactile, coming from r/mechanicalkeyboards. when i went to press c1 and c2 i was not expecting the entire button the physically move up and down and let me tell you, the feeling of pressing down on the custom buttons is insanely satisfying. very distinct with good travel distance and response and larger buttons, no mistaking if you did or did not press the button. this is extremely useful if you shoot in cold climates or weather where you might need to wear gloves. i only pressed c1, c2, c3, menu, and af-on. i have no idea how the other buttons feel with my short time spent unfortunately. \n\n* the joystick (focus box mover thing) is alright? i can't really say for sure it feels better or worse than the one on the a7iii or a7riv.\n\n* the shutter button has also gotten the same treatment. i'm slightly not sure if i trust my memory on this, but i think the travel is slightly longer and might have a slightly better tactile feeling which will also help when shooting with gloves. if someone here has an a7riv and can confirm if this is the case that would be great.\n\n**dials**\n\n* the change of the default exposure dial being on the top instead of being half enclosed in the body makes sense now that your hand -----> position !!!  has changed. it is much smoother and nicer to turn as a result probably due to the rotation mechanism being different. being smoother and easier to rotate makes it much easier to use the back of your thumb to rotate the dial. \n\n* the mode dial (auto, p, a, s, m) which i thought had been changed to toggle lock, is still the press and hold to rotate. i don't change modes at all since i shoot manual and haven't setup the customs shooting modes up out of laziness. even then i still don't really like the rotation lock, i wish it was the toggle lock like on the exposure dial.\n\n* the exposure dial toggle lock is a welcome change. there are a good amount of times when i had the a7iii when the exposure dial would be changed whenever i pulled it out of my bag or put it back in, this was extremely frustrating when using auto iso. i'd end up with an overexposed image and way too much noise. it's about half as tactile as the new improved buttons which is not bad and shouldn't matter as it's more of a set and forget button.\n\n**slots**\n\n* i didn't test the slots on the left of the body. sd card slot being swapped, top being first and second being bottom tripped me up. the mechanism for the door is ok, i didn't have any issues with the old mechanism and prefer it mostly because i'm used to it. the mechanism requires a little more force to open, probably to stop it from accidentally opening.\n\ndid not test the viewfinder for some reason. lcd looks good\n\nautofocus speed i feel depends more on the lens at this point. \n\n**editing and processing**\n\n* after processing the images and uploading the files made me glad i didn't buy the riv, the files are huge. \n\n* a single jpg export at 300ppi takes around 1 minute 30 seconds +-15 seconds.\n\n* that is stupid long, for reference my cpu is an &gt;!amd ryzen 3900x!&lt;. if you have an intel cpu or an older amd cpu, please post your export times for a 300ppi jpg and what cpu you have.\n\n* 2 gb (1.94 rounded) for just 17 raw files??? \n\n**tl:dr and closing thoughts**\n\n**tl:dr great body, amazing tactile buttons, takes 1 and a half fucking minutes to export a jpg file. even if money is no issue, time is. 1 and a half minutes with basically a top of the line amd cpu to see a single jpg of your cat is insanity.**\n\nif sony released an a7iv, with a a7riv body with 36mp instead of 24mp, i would buy it in a damn heartbeat. 90% of the time i don't need 42mp, i just like it for cropping in that 10% when i do. 36 would be a good middle ground. if you're confused as to why this camera was released along with the a9ii instead of the a7siii, i think some people have said it's in preparation for the 2020 olympics.", "sortedWord": "None", "identifyer": 17425, "year": "2019"}, {"Unnamed: 0": 17791, "autor": "Jester7677", "date": 1550525987000, "content": "Looking to purchase A7iii and have a number of questions. /!/ I'll lay it all out there, hope you can help.  I'm coming from a D40 where I have an 18-55mm (3.5 - 5.6) and a 55-200mm (4 - 5.6).  I also have an iPhone XS.  I take pictures of (in this order) landscape, family, architecture, landscape, some action, wildlife.  Ideally, I would have photo's that I could print to about 20\" wide.  I don't like using a flash but the D40 and my lenses didn't do well indoors without it.  I don't want to be in that same position again.  I also don't like cropping as that will lose me precious resolution, I don't want to be in that position again.  My computer/mac is old, which wasn't an issue until work shut off the USB ports on my 2015 MacBook pro... so now I'm just file managing/backing up with a 2009 iMac with external drives.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n1)  I'm a little bummed at the resolution quality in the EVF and the LCD screen on the A7iii.  Am I making too much of that?\n\n2)  Really struggling with what lenses to start with.  Was thinking of the Sony16-35 f/2 but that would be my first and only for a while, but help with most of what I list.  Just a bit pricy.  Say you had \\~2k for lenses and my interests above.  What would you do?  How would you spend my money?  :)\n\n3)  I'm thinking I'll use my 2009 Mac for the moment, until I start crying, then upgrade.  The issue is iMac, MacBook Pro or Windows desktop (attached to the 42\" monitor at home that I use for work)?  I don't have any editing software but want to in the future.  I love macs, just work and do so for a long time, but don't love the entry cost (sorta like a lens).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThis adds up fast...  :(", "link": "https://www.reddit.com/r/SonyAlpha/comments/as2fwo/looking_to_purchase_a7iii_and_have_a_number_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking to purchase a7iii and have a number of questions. /!/ i'll lay it all out there, hope you can help.  i'm coming from a d40 where i have an 18-55mm (3.5 - 5.6) and a 55-200mm (4 - 5.6).  i also have an iphone xs.  i take pictures of (in this order) landscape, family, architecture, landscape, some action, wildlife.  ideally, i would have photo's that i could print to about 20\" wide.  i don't like using a flash but the d40 and my lenses didn't do well indoors without it.  i don't want to be in that same -----> position !!!  again.  i also don't like cropping as that will lose me precious resolution, i don't want to be in that position again.  my computer/mac is old, which wasn't an issue until work shut off the usb ports on my 2015 macbook pro... so now i'm just file managing/backing up with a 2009 imac with external drives.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n1)  i'm a little bummed at the resolution quality in the evf and the lcd screen on the a7iii.  am i making too much of that?\n\n2)  really struggling with what lenses to start with.  was thinking of the sony16-35 f/2 but that would be my first and only for a while, but help with most of what i list.  just a bit pricy.  say you had \\~2k for lenses and my interests above.  what would you do?  how would you spend my money?  :)\n\n3)  i'm thinking i'll use my 2009 mac for the moment, until i start crying, then upgrade.  the issue is imac, macbook pro or windows desktop (attached to the 42\" monitor at home that i use for work)?  i don't have any editing software but want to in the future.  i love macs, just work and do so for a long time, but don't love the entry cost (sorta like a lens).\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nthis adds up fast...  :(", "sortedWord": "None", "identifyer": 18075, "year": "2019"}, {"Unnamed: 0": 18356, "autor": "TryHardKurd", "date": 1559601645000, "content": "got my Sony a6400 damaged.... /!/ hello everyone, I just bought the sony a6400 with 16-50mm kit lens a couple weeks ago from Amazon. when I received it, I turned it on and the lens started acting funny. it wouldn't focus, wouldn't zoom and seemed to be stuck. when I turned off the camera, the lens wouldn't close up. it was stuck in an outward position. \n\n\nI was super bummed out since I was waiting so long for it and I got it broken. it may have been a result of poor packaging, as there was only a thin layer of bubble wrap on the bottom of the box. I called Sony and they told me to send it in for a warranty repair. (they gave me a prepaid shipping label to send it to precision camera repair)\n\n\nthey received the package today but the repair tracking hasn't updated. I've been reading stuff online and now I'm super nervous that they won't repair my camera, since it being broken during shipping likely looks like I broke it. \n\n\ndo you guys think they'll fix my camera? and how long do you think it'll take? I'm dying of stress rn.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bwh4da/got_my_sony_a6400_damaged/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "got my sony a6400 damaged.... /!/ hello everyone, i just bought the sony a6400 with 16-50mm kit lens a couple weeks ago from amazon. when i received it, i turned it on and the lens started acting funny. it wouldn't focus, wouldn't zoom and seemed to be stuck. when i turned off the camera, the lens wouldn't close up. it was stuck in an outward -----> position !!! . \n\n\ni was super bummed out since i was waiting so long for it and i got it broken. it may have been a result of poor packaging, as there was only a thin layer of bubble wrap on the bottom of the box. i called sony and they told me to send it in for a warranty repair. (they gave me a prepaid shipping label to send it to precision camera repair)\n\n\nthey received the package today but the repair tracking hasn't updated. i've been reading stuff online and now i'm super nervous that they won't repair my camera, since it being broken during shipping likely looks like i broke it. \n\n\ndo you guys think they'll fix my camera? and how long do you think it'll take? i'm dying of stress rn.", "sortedWord": "None", "identifyer": 18653, "year": "2019"}, {"Unnamed: 0": 19102, "autor": "BeWorthy", "date": 1567427494000, "content": "What to do? /!/ I’m in a position that I can pick either the a7lll or A9 what should I do ?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cyodgx/what_to_do/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what to do? /!/ i’m in a -----> position !!!  that i can pick either the a7lll or a9 what should i do ?", "sortedWord": "None", "identifyer": 19412, "year": "2019"}, {"Unnamed: 0": 19542, "autor": "carliway", "date": 1565188231000, "content": "How to set up a GlideCam for use with a Sony A6500? for a beginner? /!/ I bought [this stabilizer](https://www.amazon.com/gp/product/B00WUCRVD0/ref=ask_ql_qh_dp_hza) from Amazon a few months back, and I was going to use it with my Canon 60D. However I've recently upgraded to the Alpha 6500. I'm still learning, but I love the quality and the size of the camera.\n\nI figured that I could use the same mechanical stabilizer for the new camera, however I am having difficulties balancing it. I read online that mirrorless cameras may be too light in weight to use with this type of stabilizer. I have tried different ways where I have removed all of the weights, or put them all on, or tried different combinations of weights and camera position, and it still swings way too fast when I try to do the 3-second \"drop test\". \n\nI tried watching lots of YouTube tutorials and videos, but I'm not having much success. I wanted to use it during a film shoot tomorrow but I'm definitely not going to be able to have this ready by then. I know it's a learning curve and something that will take time and practice, but I'm having problems even setting it up in the first place haha. \n\nHas anyone ever set up one of these for their camera? Would you be able to give me some advice or tips please?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cn6iqg/how_to_set_up_a_glidecam_for_use_with_a_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to set up a glidecam for use with a sony a6500? for a beginner? /!/ i bought [this stabilizer](https://www.amazon.com/gp/product/b00wucrvd0/ref=ask_ql_qh_dp_hza) from amazon a few months back, and i was going to use it with my canon 60d. however i've recently upgraded to the alpha 6500. i'm still learning, but i love the quality and the size of the camera.\n\ni figured that i could use the same mechanical stabilizer for the new camera, however i am having difficulties balancing it. i read online that mirrorless cameras may be too light in weight to use with this type of stabilizer. i have tried different ways where i have removed all of the weights, or put them all on, or tried different combinations of weights and camera -----> position !!! , and it still swings way too fast when i try to do the 3-second \"drop test\". \n\ni tried watching lots of youtube tutorials and videos, but i'm not having much success. i wanted to use it during a film shoot tomorrow but i'm definitely not going to be able to have this ready by then. i know it's a learning curve and something that will take time and practice, but i'm having problems even setting it up in the first place haha. \n\nhas anyone ever set up one of these for their camera? would you be able to give me some advice or tips please?", "sortedWord": "None", "identifyer": 19859, "year": "2019"}, {"Unnamed: 0": 20595, "autor": "Danskkat", "date": 1574530792000, "content": "\"Tripod\" Gunk /!/ I was given one of those cute little adjustable feet stands that are only ~6 inches or so that you can carry around in your pocket and adjust to weird positions as they are not straight beams like a regular tripod. They're neat, but the problem is when I went to go screw it in, the plastic just shredded and now has clogged the threading in the camera so I can't seem to use anything else.\n\nAny ideas how to clean out all that mashed plastic or otherwise salvage this situation?", "link": "https://www.reddit.com/r/SonyAlpha/comments/e0l56z/tripod_gunk/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "\"tripod\" gunk /!/ i was given one of those cute little adjustable feet stands that are only ~6 inches or so that you can carry around in your pocket and adjust to weird -----> positions !!!  as they are not straight beams like a regular tripod. they're neat, but the problem is when i went to go screw it in, the plastic just shredded and now has clogged the threading in the camera so i can't seem to use anything else.\n\nany ideas how to clean out all that mashed plastic or otherwise salvage this situation?", "sortedWord": "None", "identifyer": 20927, "year": "2019"}, {"Unnamed: 0": 20903, "autor": "carliway", "date": 1575558379000, "content": "Can't seem to balance my stabilizer with my A6500 - is it too light? /!/ Hi everyone! I'm a beginner videographer who is still learning but am making progress every day. I have a A6500 that I use as my main camera. Seeing as I'm on a budget, I bought this [mechanical stabilizer](https://www.amazon.com/gp/product/B00WUCRVD0/ref=ppx_yo_dt_b_asin_title_o04_s00?ie=UTF8&amp;psc=1) from Amazon to use until I'm able to afford a gimbal. I bought this based on some reviews I saw on YouTube, and a friend who has the same stabilizer that he used with his Nikon DSLR.\n\nHowever, I can't seem to get it balanced properly. I've spent ages adjusting the weights and sometimes even taking them off, as well as the position of the camera on top, and nothing worked. The camera still swirls around on the stabilizer and when I do the \"Drop test\", it falls really fast, a lot faster than instructions say that it should.  I've watched videos and tutorials online (the stabilizer doesn't come with very clear instructions) and it doesn't seem to be calibrated properly. To be honest, all of the tutorials i've seen are for DSLR cameras; none of them had mirrorless cameras using with the stabilizer.\n\nMost of the videographers/pros here use electronic/battery operated gimbals and weren't able to give any advice when I asked for help. A few of them suggested that maybe the Sony camera is too light in weight for the stabilizer. Could it be that?\n\nShould I keep trying with it or just sell it and save up for a gimbal? Thank you in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/e6ieho/cant_seem_to_balance_my_stabilizer_with_my_a6500/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "can't seem to balance my stabilizer with my a6500 - is it too light? /!/ hi everyone! i'm a beginner videographer who is still learning but am making progress every day. i have a a6500 that i use as my main camera. seeing as i'm on a budget, i bought this [mechanical stabilizer](https://www.amazon.com/gp/product/b00wucrvd0/ref=ppx_yo_dt_b_asin_title_o04_s00?ie=utf8&amp;psc=1) from amazon to use until i'm able to afford a gimbal. i bought this based on some reviews i saw on youtube, and a friend who has the same stabilizer that he used with his nikon dslr.\n\nhowever, i can't seem to get it balanced properly. i've spent ages adjusting the weights and sometimes even taking them off, as well as the -----> position !!!  of the camera on top, and nothing worked. the camera still swirls around on the stabilizer and when i do the \"drop test\", it falls really fast, a lot faster than instructions say that it should.  i've watched videos and tutorials online (the stabilizer doesn't come with very clear instructions) and it doesn't seem to be calibrated properly. to be honest, all of the tutorials i've seen are for dslr cameras; none of them had mirrorless cameras using with the stabilizer.\n\nmost of the videographers/pros here use electronic/battery operated gimbals and weren't able to give any advice when i asked for help. a few of them suggested that maybe the sony camera is too light in weight for the stabilizer. could it be that?\n\nshould i keep trying with it or just sell it and save up for a gimbal? thank you in advance!", "sortedWord": "None", "identifyer": 21242, "year": "2019"}], "name": "positionSonyAlpha2019"}