{"interestingcomments": [{"Unnamed: 0": 32814, "autor": "MINERAL-115", "date": 1587040959000, "content": "Sony A6100; LCD Image Flip/Rotation Issue /!/ I've had my A6100 for a month or so now, and I'm loving how customisable it is, although the number of menu options is causing frustration when trying to switch certain functions from automatic to manual.\n\nI've already contacted Sony support, but have yet to get a response, and Google seems fixated on giving me search results related to rotation of the actual photos taken by the camera. This seemed like the ideal place to ask!\n\nI'm trying to figure out how to disable the \"Selfie Mode\" LCD flip-over; when the camera's LCD is up in \"Selfie Mode\", the viewfinder image on the LCD rotates 180 degrees.\n\nMy goal is to use the camera for high angles on my subject - without the use of a field monitor - but the moment the LCD is tilted slightly back from the \"Selfie\" position, it flips the image back over the other way. How do I disable the orientation sensor so the image does not flip when using the camera this way?\n\nThanks in advance! :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/g2e6pi/sony_a6100_lcd_image_fliprotation_issue/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony a6100; lcd image flip/rotation issue /!/ i've had my a6100 for a month or so now, and i'm loving how customisable it is, although the number of menu options is causing frustration when trying to switch certain functions from automatic to manual.\n\ni've already contacted sony support, but have yet to get a response, and google seems fixated on giving me search results related to rotation of the actual photos taken by the camera. this seemed like the ideal place to ask!\n\ni'm trying to figure out how to disable the \"selfie mode\" lcd flip-over; when the camera's lcd is up in \"selfie mode\", the viewfinder image on the lcd rotates 180 degrees.\n\nmy goal is to use the camera for high angles on my subject - without the use of a field monitor - but the moment the lcd is tilted slightly back from the \"selfie\" -----> position !!! , it flips the image back over the other way. how do i disable the orientation sensor so the image does not flip when using the camera this way?\n\nthanks in advance! :)", "sortedWord": "None", "identifyer": 33512, "year": "2020"}, {"Unnamed: 0": 33093, "autor": "DeucalionCG", "date": 1588745825000, "content": "Best way to mount A6400 above my monitor for streaming use? /!/ I have recently purchased A6400 for streaming purposes and I was wondering what would be the best tripod/mount that I can use to have it mounted above my monitor in a stationary position? \n\nPlease feel free to share Amazon links or name of the product that you believe worked best for you when you were streaming, I am open to all suggestions!\n\nThank you very much!", "link": "https://www.reddit.com/r/SonyAlpha/comments/geemak/best_way_to_mount_a6400_above_my_monitor_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best way to mount a6400 above my monitor for streaming use? /!/ i have recently purchased a6400 for streaming purposes and i was wondering what would be the best tripod/mount that i can use to have it mounted above my monitor in a stationary -----> position !!! ? \n\nplease feel free to share amazon links or name of the product that you believe worked best for you when you were streaming, i am open to all suggestions!\n\nthank you very much!", "sortedWord": "None", "identifyer": 33798, "year": "2020"}, {"Unnamed: 0": 33450, "autor": "fusserbalrod", "date": 1594952434000, "content": "A5100 wont turn off /!/ Hi guys! I bought a used sony A5100 from this lady  and the camera looks in great shape and everything works fine. However i notice that i cant seem to turn the camera off. Whether that switch is in on or off position the camera is always on. Battery has to be taken out to shut it off. Anybody experienced this before?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hsnh4i/a5100_wont_turn_off/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a5100 wont turn off /!/ hi guys! i bought a used sony a5100 from this lady  and the camera looks in great shape and everything works fine. however i notice that i cant seem to turn the camera off. whether that switch is in on or off -----> position !!!  the camera is always on. battery has to be taken out to shut it off. anybody experienced this before?", "sortedWord": "None", "identifyer": 34161, "year": "2020"}, {"Unnamed: 0": 33911, "autor": "monsow", "date": 1602777721000, "content": "Sony GM vs Sigma 24-70 /!/ I'm currently in a position where I can get the GM for only GBP 300 more than the Sigma, so price isn't really an issue.\n\nI'm so torn, as I've heard many pros about the Sigma. I've rented the GM twice and it's fantastic. \n\nAny guidance on which to get?", "link": "https://www.reddit.com/r/SonyAlpha/comments/jbqcx9/sony_gm_vs_sigma_2470/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony gm vs sigma 24-70 /!/ i'm currently in a -----> position !!!  where i can get the gm for only gbp 300 more than the sigma, so price isn't really an issue.\n\ni'm so torn, as i've heard many pros about the sigma. i've rented the gm twice and it's fantastic. \n\nany guidance on which to get?", "sortedWord": "None", "identifyer": 34634, "year": "2020"}, {"Unnamed: 0": 34030, "autor": "scudge52", "date": 1601251366000, "content": "Help fixing my 16-35 f2.8 /!/ Hey Sony People!\n\nSo today unfortunately my 16-35 took a tumble and the focus ring has now come out of its original position, its still fully intact as is, on the lens! \n\nAutofocus is perfectly fine and no other damage from what I can see, thank you to whoever is looking down on me !!!!\n\nSo the focus ring looks like it will screw down a bit and perhaps needs some physical encouragement to push back into place, has anyone had this happen before who can help or advise if this can be pushed/screwed on ?\n\n&amp;#x200B;\n\nOr, should I save myself the trouble and bring this for repair? (4-8weeks + $$$)\n\nIt seems like I could do this myself but I am cautious of the connection points, do they connect to something on the focus ring ?\n\n&amp;#x200B;\n\nAny advice greatly appreciated!\n\nhttps://preview.redd.it/43q0xkhu4sp51.jpg?width=4896&amp;format=pjpg&amp;auto=webp&amp;s=15002e1f940d78d8152c6d5d176cf8a2654d2b73", "link": "https://www.reddit.com/r/SonyAlpha/comments/j11p7i/help_fixing_my_1635_f28/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help fixing my 16-35 f2.8 /!/ hey sony people!\n\nso today unfortunately my 16-35 took a tumble and the focus ring has now come out of its original -----> position !!! , its still fully intact as is, on the lens! \n\nautofocus is perfectly fine and no other damage from what i can see, thank you to whoever is looking down on me !!!!\n\nso the focus ring looks like it will screw down a bit and perhaps needs some physical encouragement to push back into place, has anyone had this happen before who can help or advise if this can be pushed/screwed on ?\n\n&amp;#x200b;\n\nor, should i save myself the trouble and bring this for repair? (4-8weeks + $$$)\n\nit seems like i could do this myself but i am cautious of the connection points, do they connect to something on the focus ring ?\n\n&amp;#x200b;\n\nany advice greatly appreciated!\n\nhttps://preview.redd.it/43q0xkhu4sp51.jpg?width=4896&amp;format=pjpg&amp;auto=webp&amp;s=15002e1f940d78d8152c6d5d176cf8a2654d2b73", "sortedWord": "None", "identifyer": 34759, "year": "2020"}, {"Unnamed: 0": 36204, "autor": "bhk2000", "date": 1584639061000, "content": "Is my lens broken or is it user error? (a7 w/ Samyang AF 14/2.8 FE) /!/ So I recently got home from a trip and after reviewing my photos I've noticed the majority of them are blurry. Furthermore when comparing similar photos taken with the same lens from a different trip they are all much sharper.\n\n[I've attached some examples cropped at 100% labeled with settings.](https://imgur.com/a/G9ZGcwE)\n\nI'm not a professional photographer but from what I can gather, the blur doesn't seem to be attributed to any of the typical causes.\n\n**Motion/shutter speed:** Examples shot up to 1/400 sec. are still blurry. Is it possible to get motion blur at 1/400 sec. when shooting static objects from a standing position?\n\n**Out of focus:**  Many of the photos appear to be blurry throughout the entire focal distance captured, both foreground and background.\n\nMaybe it's user error but I haven't had this problem before with the same lens and camera. I've bumped the lens around by accident a few times and maybe it's caused some internal issue. I don't think it's the camera body since my photos from the same trip using a different lens look fine, but it's hard to compare photos from a 14mm lens to a 55mm lens.\n\nAny thoughts or suggestions? I just wanted to ask some opinions before looking into the warranty solution.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fldzcp/is_my_lens_broken_or_is_it_user_error_a7_w/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is my lens broken or is it user error? (a7 w/ samyang af 14/2.8 fe) /!/ so i recently got home from a trip and after reviewing my photos i've noticed the majority of them are blurry. furthermore when comparing similar photos taken with the same lens from a different trip they are all much sharper.\n\n[i've attached some examples cropped at 100% labeled with settings.](https://imgur.com/a/g9zgcwe)\n\ni'm not a professional photographer but from what i can gather, the blur doesn't seem to be attributed to any of the typical causes.\n\n**motion/shutter speed:** examples shot up to 1/400 sec. are still blurry. is it possible to get motion blur at 1/400 sec. when shooting static objects from a standing -----> position !!! ?\n\n**out of focus:**  many of the photos appear to be blurry throughout the entire focal distance captured, both foreground and background.\n\nmaybe it's user error but i haven't had this problem before with the same lens and camera. i've bumped the lens around by accident a few times and maybe it's caused some internal issue. i don't think it's the camera body since my photos from the same trip using a different lens look fine, but it's hard to compare photos from a 14mm lens to a 55mm lens.\n\nany thoughts or suggestions? i just wanted to ask some opinions before looking into the warranty solution.", "sortedWord": "None", "identifyer": 36984, "year": "2020"}, {"Unnamed: 0": 37900, "autor": "Qilo5", "date": 1583602701000, "content": "A6400 Night video /!/ I want to film a motorcycle riding towards my tripod position to the side of the road at night on a lone road with street lighting. \n\n1.8/ 85 SONY lens. \n\nWhat are the best things I can do to get pro looking footage?", "link": "https://www.reddit.com/r/SonyAlpha/comments/feyf8z/a6400_night_video/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a6400 night video /!/ i want to film a motorcycle riding towards my tripod -----> position !!!  to the side of the road at night on a lone road with street lighting. \n\n1.8/ 85 sony lens. \n\nwhat are the best things i can do to get pro looking footage?", "sortedWord": "None", "identifyer": 38720, "year": "2020"}, {"Unnamed: 0": 38444, "autor": "idrinkforbadges", "date": 1601069010000, "content": "How to avoid banding or flare with lightning pics on the A7RIV? /!/ Here's a link to the pic in question: https://i.imgur.com/s0FUR8a.jpg\n\nI've been trying to figure out what's up with some of my lightning pictures that I took with my A7RIV and the Zeiss 55mm f1.8.  This also happened with the 24mm GM that night as well, so I am not sure it's lens specific.\n\nThis is the first time taking lightning pics with this camera, and these bands appear when the camera is in the landscape or portrait position. Settings: ISO 100, 55mm, f1.8, 30 sec. Silent Shooting is off, E Front Curtain Shutter is on. At first I thought it had something to do with PDAF banding, but the pattern doesn't match up.\n\nThen I thought it has something to do with rolling shutter, but I'm not taking video. I read about EFCS needed to be off when shooting with faster shutter speeds but this is a 30 second exposure. This only happens in the middle of the image where the lightning is, no where else in the picture. Is this a type of flaring from the lens?  It kind of looks like anamorphic flare that one would get from an anamorphic lens?\n\nAny advice on how to get rid of it in Photoshop? I tried a surface blur on a masked layer in photoshop that does a good job, but the banding is still there except the gradient is softer. Any help about how to avoid this in the first place, or how to correct it in post is greatly appreciated, thank you in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/izsd6m/how_to_avoid_banding_or_flare_with_lightning_pics/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to avoid banding or flare with lightning pics on the a7riv? /!/ here's a link to the pic in question: https://i.imgur.com/s0fur8a.jpg\n\ni've been trying to figure out what's up with some of my lightning pictures that i took with my a7riv and the zeiss 55mm f1.8.  this also happened with the 24mm gm that night as well, so i am not sure it's lens specific.\n\nthis is the first time taking lightning pics with this camera, and these bands appear when the camera is in the landscape or portrait -----> position !!! . settings: iso 100, 55mm, f1.8, 30 sec. silent shooting is off, e front curtain shutter is on. at first i thought it had something to do with pdaf banding, but the pattern doesn't match up.\n\nthen i thought it has something to do with rolling shutter, but i'm not taking video. i read about efcs needed to be off when shooting with faster shutter speeds but this is a 30 second exposure. this only happens in the middle of the image where the lightning is, no where else in the picture. is this a type of flaring from the lens?  it kind of looks like anamorphic flare that one would get from an anamorphic lens?\n\nany advice on how to get rid of it in photoshop? i tried a surface blur on a masked layer in photoshop that does a good job, but the banding is still there except the gradient is softer. any help about how to avoid this in the first place, or how to correct it in post is greatly appreciated, thank you in advance!", "sortedWord": "None", "identifyer": 39283, "year": "2020"}, {"Unnamed: 0": 39477, "autor": "WhosAfraidOf_138", "date": 1605825984000, "content": "Tips on filming water drops and ripples with the A7III? /!/ Been experimenting a lot with filming water drops in my little studio lately, and have been failing more than succeeding. I'm using the A7III + Tamron 28-75 with a macro tube extension. \n\nI shoot in full manual mode with as low as an exposure I can go based on my weak studio LED light panels. The lowest I can go is 1/5000 without under exposing. I have ISO set to 3200, and a F 4.0\n\nI use the Hi+ mode, but it seems even that's not fast enough to capture the drops at the right time even if I hold the shutter with a release\n\nI know the most obvious upgrade would be to get stronger lights so I can shoot at a lower ISO and higher f-stop (which would have more in focus and I don't need to fiddle with the focus as much). \n\nBut I've shot about 900 shots so far and only 20-30 capture the droplets at a decent position and location.", "link": "https://www.reddit.com/r/SonyAlpha/comments/jxd54l/tips_on_filming_water_drops_and_ripples_with_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "tips on filming water drops and ripples with the a7iii? /!/ been experimenting a lot with filming water drops in my little studio lately, and have been failing more than succeeding. i'm using the a7iii + tamron 28-75 with a macro tube extension. \n\ni shoot in full manual mode with as low as an exposure i can go based on my weak studio led light panels. the lowest i can go is 1/5000 without under exposing. i have iso set to 3200, and a f 4.0\n\ni use the hi+ mode, but it seems even that's not fast enough to capture the drops at the right time even if i hold the shutter with a release\n\ni know the most obvious upgrade would be to get stronger lights so i can shoot at a lower iso and higher f-stop (which would have more in focus and i don't need to fiddle with the focus as much). \n\nbut i've shot about 900 shots so far and only 20-30 capture the droplets at a decent -----> position !!!  and location.", "sortedWord": "None", "identifyer": 40341, "year": "2020"}, {"Unnamed: 0": 39580, "autor": "tewn_up", "date": 1607460933000, "content": "Imaging Edge App not having a Tap to Focus option /!/ I seriously can't believe they removed this.  Why would they do that?\n\nFor those of you that take your own photos / portraits, how do you focus it on you?\n\nI have a ZV-1 and the only way I can focus is by turning the dial, it's pretty slow.  I've tried using Eye AF as well, and some other options - but when I hit the shutter button, it focuses on *where I am* when I hit the shutter button, not where I have to walk to to get into position\n\nIf the App had a Tap to focus option it would solve this completely for me hahaha\n\nI make more fitness content, so I'm a little far from the camera physically when trying to capture stills.\n\nStill learning about Photography so maybe there's something I'm missing", "link": "https://www.reddit.com/r/SonyAlpha/comments/k9ctt7/imaging_edge_app_not_having_a_tap_to_focus_option/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "imaging edge app not having a tap to focus option /!/ i seriously can't believe they removed this.  why would they do that?\n\nfor those of you that take your own photos / portraits, how do you focus it on you?\n\ni have a zv-1 and the only way i can focus is by turning the dial, it's pretty slow.  i've tried using eye af as well, and some other options - but when i hit the shutter button, it focuses on *where i am* when i hit the shutter button, not where i have to walk to to get into -----> position !!! \n\nif the app had a tap to focus option it would solve this completely for me hahaha\n\ni make more fitness content, so i'm a little far from the camera physically when trying to capture stills.\n\nstill learning about photography so maybe there's something i'm missing", "sortedWord": "None", "identifyer": 40444, "year": "2020"}, {"Unnamed: 0": 40244, "autor": "NickEmmerson", "date": 1592148909000, "content": "how to easily line up subjects /!/ hey so im making a hyperlapse and wanted to know if there was a setting in the Sony Alpha series (a6500 specifically) to help me easily line up my subject and keep it in the same position in the frame for every shot I take. I know other cameras have a like a \"crosshair\" feature but anything that'd allow me to easily do this would be great   \nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/h8vy5y/how_to_easily_line_up_subjects/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to easily line up subjects /!/ hey so im making a hyperlapse and wanted to know if there was a setting in the sony alpha series (a6500 specifically) to help me easily line up my subject and keep it in the same -----> position !!!  in the frame for every shot i take. i know other cameras have a like a \"crosshair\" feature but anything that'd allow me to easily do this would be great   \nthanks!", "sortedWord": "None", "identifyer": 41126, "year": "2020"}, {"Unnamed: 0": 42562, "autor": "MrNorthfair", "date": 1595277607000, "content": "Sony a7riii - He stood in that same position for over an hour.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hut9x8/sony_a7riii_he_stood_in_that_same_position_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony a7riii - he stood in that same -----> position !!!  for over an hour.", "sortedWord": "None", "identifyer": 43522, "year": "2020"}, {"Unnamed: 0": 42811, "autor": "Alexrocks1253", "date": 1593708438000, "content": "The A7RIV needs a firmware update in my opinion. /!/ I love this camera, but I've experienced problems with it.\n\nThe steadyshot doesn't feel like it's compensating enough at certain shutter speeds (1/60-1/250) and I am getting blurry photos handheld shooting at 28mm at f8 with a 1/125 shutter which is rediculous. When in af-c, the steadyshot sometimes does a weird action that leaves photos with a horizontal blur even when the camera was held completely still and even sometimes on a tripod (did this to make sure it wasn't just shaky hands)\n\nAnother problem is that frequently when tracking far away subjects, the focus seems to prefer the background to the foreground, but when I manually position a flexible spot, it works fine.\n\nOverall, great camera but I'm hoping new firmware fixes these few quirks in an otherwise good camera.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hk0j7o/the_a7riv_needs_a_firmware_update_in_my_opinion/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the a7riv needs a firmware update in my opinion. /!/ i love this camera, but i've experienced problems with it.\n\nthe steadyshot doesn't feel like it's compensating enough at certain shutter speeds (1/60-1/250) and i am getting blurry photos handheld shooting at 28mm at f8 with a 1/125 shutter which is rediculous. when in af-c, the steadyshot sometimes does a weird action that leaves photos with a horizontal blur even when the camera was held completely still and even sometimes on a tripod (did this to make sure it wasn't just shaky hands)\n\nanother problem is that frequently when tracking far away subjects, the focus seems to prefer the background to the foreground, but when i manually -----> position !!!  a flexible spot, it works fine.\n\noverall, great camera but i'm hoping new firmware fixes these few quirks in an otherwise good camera.", "sortedWord": "None", "identifyer": 43786, "year": "2020"}, {"Unnamed: 0": 43987, "autor": "MachkyMahc21", "date": 1585246548000, "content": "Shooting video Sony A6400 /!/ Hey guys, I use my A6400 primarily for vlogging. I use a Sigma 16MM lens. My camera is always mounted and does not change position, but I notice that the lighting in my shot always changes. Should I be shooting in manual mode? Anyway to prevent the light change?\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/fpgkav/shooting_video_sony_a6400/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shooting video sony a6400 /!/ hey guys, i use my a6400 primarily for vlogging. i use a sigma 16mm lens. my camera is always mounted and does not change -----> position !!! , but i notice that the lighting in my shot always changes. should i be shooting in manual mode? anyway to prevent the light change?\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 45000, "year": "2020"}, {"Unnamed: 0": 44049, "autor": "qwertzuiopqwertzuiop", "date": 1585150792000, "content": "Stuck shutter button repair in Sony A6000, A6300 /!/ My A6000 started to have the problem of a stuck shutter / focus button. From time to time when the focus button is pressed, it stays in this mode / position even when the button is physically released. Shaking the camera or multiple presses on the focus / shutter button solved the problem temporarily. \n\nHowever, the problem persisted. You find many threads / tutorials to fix it with WD40 or some contact spray. This will not work and will only destroy your camera even further.\n\nI was opening my camera, and found the SMD push button. Finally I found the part number here on reddit. Unfortunetly the post is archived:  [https://www.reddit.com/r/SonyAlpha/comments/8j8xc3/stuck\\_shutter\\_button\\_in\\_a6300/](https://www.reddit.com/r/SonyAlpha/comments/8j8xc3/stuck_shutter_button_in_a6300/) \n\nI ordered the ALPS button SKSDPBE010  from RS-Privat for 0.91€ per unit: [https://www.alps.com/prod/info/E/HTML/Tact/SurfaceMount/SKSD/SKSD\\_list.html](https://www.alps.com/prod/info/E/HTML/Tact/SurfaceMount/SKSD/SKSD_list.html)\n\nVideo of how to open the camera:\n\n[https://www.youtube.com/watch?v=6PAI0uXjpl4](https://www.youtube.com/watch?v=6PAI0uXjpl4) \n\nSoldering was more difficult then expected. I used a conventional soldering iron at 300°C with a fine tip. Tip: unsolder the metal housing in the front between PAD 1 (dot) and 4 and the contact between PAD 2 and 3. Then you can take it off with a fine clamp / tweezer. You will permanantely destroy the smd button, but you have to replace it anyway. Then you can unsolder PAD 1 to 4 by applying the soldering iron for 2-3 s and lifting the button with a fine screwdriver on the edge. \n\nAfter removing the button, apply fresh solder to the contacts and place the new button on top. Heat carefully the solder points and slightly press from the top with something soft to the button to take away some heat and fix it in place. \n\nCheck with multimeter, 2 and 3 are connected to ground (middle contacts), 1 and 4 are the pins for focus and to take a picture.\n\nReassamble and close everything and it worked agian. \n\nBy the way, there are two version of the ALPS switch. A softer and a harder one. The softer one lats 50000 hits, the harder one 100000. I took the harder one and it feels slightly harder now. I think the original one was the softer one. \n\nHere some images:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ntchl3jb9uo41.jpg?width=571&amp;format=pjpg&amp;auto=webp&amp;s=eaa1a2a0d61da32d495d41be0d155df7a9546020\n\nhttps://preview.redd.it/8xyy22jb9uo41.jpg?width=611&amp;format=pjpg&amp;auto=webp&amp;s=1a14e858ad8e1b4552cf448e3a0c6ad8ec19c8cf\n\nhttps://preview.redd.it/rwibh42m9uo41.jpg?width=963&amp;format=pjpg&amp;auto=webp&amp;s=81df3291099dd1fb72e4ba05dafd5e3afc2f8e5a", "link": "https://www.reddit.com/r/SonyAlpha/comments/fose31/stuck_shutter_button_repair_in_sony_a6000_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "stuck shutter button repair in sony a6000, a6300 /!/ my a6000 started to have the problem of a stuck shutter / focus button. from time to time when the focus button is pressed, it stays in this mode / -----> position !!!  even when the button is physically released. shaking the camera or multiple presses on the focus / shutter button solved the problem temporarily. \n\nhowever, the problem persisted. you find many threads / tutorials to fix it with wd40 or some contact spray. this will not work and will only destroy your camera even further.\n\ni was opening my camera, and found the smd push button. finally i found the part number here on reddit. unfortunetly the post is archived:  [https://www.reddit.com/r/sonyalpha/comments/8j8xc3/stuck\\_shutter\\_button\\_in\\_a6300/](https://www.reddit.com/r/sonyalpha/comments/8j8xc3/stuck_shutter_button_in_a6300/) \n\ni ordered the alps button sksdpbe010  from rs-privat for 0.91€ per unit: [https://www.alps.com/prod/info/e/html/tact/surfacemount/sksd/sksd\\_list.html](https://www.alps.com/prod/info/e/html/tact/surfacemount/sksd/sksd_list.html)\n\nvideo of how to open the camera:\n\n[https://www.youtube.com/watch?v=6pai0uxjpl4](https://www.youtube.com/watch?v=6pai0uxjpl4) \n\nsoldering was more difficult then expected. i used a conventional soldering iron at 300°c with a fine tip. tip: unsolder the metal housing in the front between pad 1 (dot) and 4 and the contact between pad 2 and 3. then you can take it off with a fine clamp / tweezer. you will permanantely destroy the smd button, but you have to replace it anyway. then you can unsolder pad 1 to 4 by applying the soldering iron for 2-3 s and lifting the button with a fine screwdriver on the edge. \n\nafter removing the button, apply fresh solder to the contacts and place the new button on top. heat carefully the solder points and slightly press from the top with something soft to the button to take away some heat and fix it in place. \n\ncheck with multimeter, 2 and 3 are connected to ground (middle contacts), 1 and 4 are the pins for focus and to take a picture.\n\nreassamble and close everything and it worked agian. \n\nby the way, there are two version of the alps switch. a softer and a harder one. the softer one lats 50000 hits, the harder one 100000. i took the harder one and it feels slightly harder now. i think the original one was the softer one. \n\nhere some images:\n\n&amp;#x200b;\n\nhttps://preview.redd.it/ntchl3jb9uo41.jpg?width=571&amp;format=pjpg&amp;auto=webp&amp;s=eaa1a2a0d61da32d495d41be0d155df7a9546020\n\nhttps://preview.redd.it/8xyy22jb9uo41.jpg?width=611&amp;format=pjpg&amp;auto=webp&amp;s=1a14e858ad8e1b4552cf448e3a0c6ad8ec19c8cf\n\nhttps://preview.redd.it/rwibh42m9uo41.jpg?width=963&amp;format=pjpg&amp;auto=webp&amp;s=81df3291099dd1fb72e4ba05dafd5e3afc2f8e5a", "sortedWord": "None", "identifyer": 45063, "year": "2020"}, {"Unnamed: 0": 44460, "autor": "Ilikedogsandplants", "date": 1582602773000, "content": "Gerbera Daisy - 15 position focus stack - 90 mm Macro - f5.6 1/125s ISO 64 - A7III", "link": "https://www.reddit.com/r/SonyAlpha/comments/f94567/gerbera_daisy_15_position_focus_stack_90_mm_macro/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "gerbera daisy - 15 -----> position !!!  focus stack - 90 mm macro - f5.6 1/125s iso 64 - a7iii", "sortedWord": "None", "identifyer": 45496, "year": "2020"}, {"Unnamed: 0": 44758, "autor": "jacob_cathey", "date": 1583205189000, "content": "Best Sony Lenses/Focal Lengths? /!/ I soon hope to switch to full-frame in the form of either an A7iii or an A7Riii (haven’t decided yet, although the A7Riiis resolution is appealing). I do a combination of portraits, travel/landscape, and street photography. I would say I do all of these things somewhat equally. Because I’m on a budget, after selling my DSLR gear and getting a Sony, I will probably  only be able to get 2 lenses to start. I’m thinking about getting 2 primes, such as a 25/2 and an 85/1.8, but what lenses/focal lengths would you suggest for someone in my position, considering my main photographic interests?", "link": "https://www.reddit.com/r/SonyAlpha/comments/fco98v/best_sony_lensesfocal_lengths/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best sony lenses/focal lengths? /!/ i soon hope to switch to full-frame in the form of either an a7iii or an a7riii (haven’t decided yet, although the a7riiis resolution is appealing). i do a combination of portraits, travel/landscape, and street photography. i would say i do all of these things somewhat equally. because i’m on a budget, after selling my dslr gear and getting a sony, i will probably  only be able to get 2 lenses to start. i’m thinking about getting 2 primes, such as a 25/2 and an 85/1.8, but what lenses/focal lengths would you suggest for someone in my -----> position !!! , considering my main photographic interests?", "sortedWord": "None", "identifyer": 45803, "year": "2020"}, {"Unnamed: 0": 44987, "autor": "GoGo_Robot", "date": 1604802609000, "content": "A7R IV: Won't focus on my face automatically /!/ I am using a Sony a7R IV with a Sigma 1.4 85mm DG DN lens and I would like the camera to focus on my face automatically, since I will be too far from the camera to press the AF button. My settings are:\n\n* Drive mode: single shooting\n* Focus mode: AF-C\n* Focus area: wide\n* Face/Eye Priority in AF: ON\n\nI have a monitor attached to the camera and I can see that it is tracking my face (I see the rectangle around it as I move), however this doesn't affect the focus. Even if I stay put in a new position, the focus won't change. If someone is behind the camera and presses the AF button, it promptly focuses on me. If I change position, whoever is behind the camera will have to press the AF button again.\n\nIs there any setting I'm missing? Any help is much appreciated!", "link": "https://www.reddit.com/r/SonyAlpha/comments/jq3rs7/a7r_iv_wont_focus_on_my_face_automatically/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7r iv: won't focus on my face automatically /!/ i am using a sony a7r iv with a sigma 1.4 85mm dg dn lens and i would like the camera to focus on my face automatically, since i will be too far from the camera to press the af button. my settings are:\n\n* drive mode: single shooting\n* focus mode: af-c\n* focus area: wide\n* face/eye priority in af: on\n\ni have a monitor attached to the camera and i can see that it is tracking my face (i see the rectangle around it as i move), however this doesn't affect the focus. even if i stay put in a new -----> position !!! , the focus won't change. if someone is behind the camera and presses the af button, it promptly focuses on me. if i change position, whoever is behind the camera will have to press the af button again.\n\nis there any setting i'm missing? any help is much appreciated!", "sortedWord": "None", "identifyer": 46039, "year": "2020"}, {"Unnamed: 0": 45314, "autor": "thekyyubi", "date": 1600272062000, "content": "Looking for Guidance on Business Purchases /!/ Hey guys, I'm a little out of my element here, so I'm hoping to get some pointers on what to buy. Let me add a little bit of background first.\n\nI've recently taken over a marketing position and have inherited the gear that the person before me bought: **a Sony α7sII with the Rokinon Cine 24mm T1.5, the Rokinon Cine 35mm T1.5, and the Rokinon 85mm T1.5.** Most of my life, I have used Canon lenses and Canon cameras (my personal camera is a Blackmagic Pocket Cinema 6K with an EF Sigma 18-35 1.8f and a Canon 50mm pancake lens), so I am basically walking into a completely different world with this equipment.\n\nJust off the few times I've been able to use the camera, one of the biggest problems for me was the lack of stabilization and auto-focus in the lenses coupled with the camera. At the advice of others, I have turned on Steadyshot-- and I even brought my own gimbal from home, but still ended up with noticeable tremors in my footage. With the monitor on the Sony α7sII being as small as it is, I will likely end up buying a monitor, and a company gimbal is on the way-- so that leaves me with $350 to $400 company money to buy a new lens.   \n\n\nI have looked at a couple different options, and the one that seems to have the features I value most is the **Sony FE 28-70mm F3.5-5.6**\\-- but it is apparently a kit lens and has a plethora of mixed reviews. The second closest option was the **Sigma 16mm f/1.4**\\-- obviously lacking any stabilization, but having a very sharp image and autofocus.\n\n With a monitor, I can forgo autofocus-- as I'll be able to see the peaking lines easily, but I am still concerned with stabilization. I have also considered simply purchasing a Metabones adapter to use the Canon lenses I already own, but the company has requested that I not use any of my own gear, if at all possible. Any suggestions? Thanks, I know this was a *lot* to read.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ityeu2/looking_for_guidance_on_business_purchases/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for guidance on business purchases /!/ hey guys, i'm a little out of my element here, so i'm hoping to get some pointers on what to buy. let me add a little bit of background first.\n\ni've recently taken over a marketing -----> position !!!  and have inherited the gear that the person before me bought: **a sony α7sii with the rokinon cine 24mm t1.5, the rokinon cine 35mm t1.5, and the rokinon 85mm t1.5.** most of my life, i have used canon lenses and canon cameras (my personal camera is a blackmagic pocket cinema 6k with an ef sigma 18-35 1.8f and a canon 50mm pancake lens), so i am basically walking into a completely different world with this equipment.\n\njust off the few times i've been able to use the camera, one of the biggest problems for me was the lack of stabilization and auto-focus in the lenses coupled with the camera. at the advice of others, i have turned on steadyshot-- and i even brought my own gimbal from home, but still ended up with noticeable tremors in my footage. with the monitor on the sony α7sii being as small as it is, i will likely end up buying a monitor, and a company gimbal is on the way-- so that leaves me with $350 to $400 company money to buy a new lens.   \n\n\ni have looked at a couple different options, and the one that seems to have the features i value most is the **sony fe 28-70mm f3.5-5.6**\\-- but it is apparently a kit lens and has a plethora of mixed reviews. the second closest option was the **sigma 16mm f/1.4**\\-- obviously lacking any stabilization, but having a very sharp image and autofocus.\n\n with a monitor, i can forgo autofocus-- as i'll be able to see the peaking lines easily, but i am still concerned with stabilization. i have also considered simply purchasing a metabones adapter to use the canon lenses i already own, but the company has requested that i not use any of my own gear, if at all possible. any suggestions? thanks, i know this was a *lot* to read.", "sortedWord": "None", "identifyer": 46379, "year": "2020"}, {"Unnamed: 0": 46206, "autor": "Godvater", "date": 1579364039000, "content": "Sony a7iii SD Card slot 2 is stuck in \"locked position\" with no SD Card inside, can't put SD Cards in. /!/ I tried to u put my SD card into slot 2 and it only went third of the way in. When I checked the camera with a flashlight I noticed there are some metal or plastic tabs in the way which I assume are there to hold the SD card in place. But I don't have any SD cards in there. \n\n&amp;#x200B;\n\n[those different colored tabs are not apparent on the bottom slot](https://preview.redd.it/6swog0hiakb41.jpg?width=1575&amp;format=pjpg&amp;auto=webp&amp;s=639bd6cc4f0156e2df3d96ca182510ac7f64044e)\n\nI have been using Sony Cameras with a similar mechanism since 2016. This is the first time it happened to me. Do you have similar experiences? What did you do and what would you recommend?", "link": "https://www.reddit.com/r/SonyAlpha/comments/eqi95g/sony_a7iii_sd_card_slot_2_is_stuck_in_locked/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony a7iii sd card slot 2 is stuck in \"locked -----> position !!! \" with no sd card inside, can't put sd cards in. /!/ i tried to u put my sd card into slot 2 and it only went third of the way in. when i checked the camera with a flashlight i noticed there are some metal or plastic tabs in the way which i assume are there to hold the sd card in place. but i don't have any sd cards in there. \n\n&amp;#x200b;\n\n[those different colored tabs are not apparent on the bottom slot](https://preview.redd.it/6swog0hiakb41.jpg?width=1575&amp;format=pjpg&amp;auto=webp&amp;s=639bd6cc4f0156e2df3d96ca182510ac7f64044e)\n\ni have been using sony cameras with a similar mechanism since 2016. this is the first time it happened to me. do you have similar experiences? what did you do and what would you recommend?", "sortedWord": "None", "identifyer": 47297, "year": "2020"}, {"Unnamed: 0": 48513, "autor": "shieldyboii", "date": 1587286907000, "content": "A temporary solution to use my alpha as a webcam without a capture card /!/ Guys, I need a webcam for my pc for my online classes. I have a really crappy old webcam, and a tablet, but I would like a somewhat decent solution for my desktop. This puts me in this weird position of not wanting to invest enough money to buy either a good webcam or a capture card. \n\nSo the question is, can I use my good old a6300 as a webcam for zoom, google, discord etc without a capture card? I know you can set obs up to capture a sony remote software window for a satisfying image. Can you do something similar for other applications? can you perhaps stream OBS to those programs? \n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/g44kfw/a_temporary_solution_to_use_my_alpha_as_a_webcam/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a temporary solution to use my alpha as a webcam without a capture card /!/ guys, i need a webcam for my pc for my online classes. i have a really crappy old webcam, and a tablet, but i would like a somewhat decent solution for my desktop. this puts me in this weird -----> position !!!  of not wanting to invest enough money to buy either a good webcam or a capture card. \n\nso the question is, can i use my good old a6300 as a webcam for zoom, google, discord etc without a capture card? i know you can set obs up to capture a sony remote software window for a satisfying image. can you do something similar for other applications? can you perhaps stream obs to those programs? \n\nthanks!", "sortedWord": "None", "identifyer": 49693, "year": "2020"}, {"Unnamed: 0": 50013, "autor": "floofilllilllilfloof", "date": 1601481335000, "content": "I'm about to jump ship from GH5 to A7s iii. Before i do it, I just want to double check with you... /!/ So i've been shooting video on the Panasonic GH5 for a 26 months or so, and i've really liked the camera. It was my first foray into decent videography. And i think it's been super awesome for me to start/learn with.\n\nI've also got myself some decent glass for it:   \nSigma 18-35 + 0.71 speedbooster  \nPanasonic 15mm, 20mm, 42.5mm primes (F1.7)  \na monster panasonic leica 100-400mm (great for birds along way away).\n\n**But i've found i've been buying fast and faster glass** for low light, and i was about to buy another fast zoom 10-25mm F1.4 for £1700(!)... and then it dawned on me, perhaps a larger sensor is what i need, so i've started looking for FF videocentric cameras and i've seen the amazing hype on the A7s iii, and i can see it would be amazing.   \nAlso i was getting pretty naffed off with the GH5 lack of decnt auto focus, i've actually never shot anything with AF on, and i'm getting too old for manual focus constantly. It's what i've always done, but man it'd be nice to not have to do \"manual everything\" sometimes. it would be so great to put AF on and be confidant.  \n\n\n**so my question is this. Apart from the obvious expense of switching to sony, should i get the A7s iii? i'd be buying the GM 24-70mm f2.8 at the same time as the body.** As there is an offer of £300 off the lens if i purchase today.   \nI can see that the sony  GM 24-70mm zoom will basically cover all of my current panasonic glass except the crazy 100-400mm monster. Am i doing the right thing? i thikn i'm going to do it, it's just such a big leap to take. I've heard nothing but amazing things about the a7S iii... Is there anything i'm going to regret if i do it? i have to say, i'm a little nervous of having to change to a sony menu system, the panasonic has been fairly ok.  \n\n\ni've never used any other 'nice' camera except my GH5 so any advice would be very greatfully recieved, especially if any of you have come from a GH5 position yourselves? many thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/j2os9w/im_about_to_jump_ship_from_gh5_to_a7s_iii_before/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i'm about to jump ship from gh5 to a7s iii. before i do it, i just want to double check with you... /!/ so i've been shooting video on the panasonic gh5 for a 26 months or so, and i've really liked the camera. it was my first foray into decent videography. and i think it's been super awesome for me to start/learn with.\n\ni've also got myself some decent glass for it:   \nsigma 18-35 + 0.71 speedbooster  \npanasonic 15mm, 20mm, 42.5mm primes (f1.7)  \na monster panasonic leica 100-400mm (great for birds along way away).\n\n**but i've found i've been buying fast and faster glass** for low light, and i was about to buy another fast zoom 10-25mm f1.4 for £1700(!)... and then it dawned on me, perhaps a larger sensor is what i need, so i've started looking for ff videocentric cameras and i've seen the amazing hype on the a7s iii, and i can see it would be amazing.   \nalso i was getting pretty naffed off with the gh5 lack of decnt auto focus, i've actually never shot anything with af on, and i'm getting too old for manual focus constantly. it's what i've always done, but man it'd be nice to not have to do \"manual everything\" sometimes. it would be so great to put af on and be confidant.  \n\n\n**so my question is this. apart from the obvious expense of switching to sony, should i get the a7s iii? i'd be buying the gm 24-70mm f2.8 at the same time as the body.** as there is an offer of £300 off the lens if i purchase today.   \ni can see that the sony  gm 24-70mm zoom will basically cover all of my current panasonic glass except the crazy 100-400mm monster. am i doing the right thing? i thikn i'm going to do it, it's just such a big leap to take. i've heard nothing but amazing things about the a7s iii... is there anything i'm going to regret if i do it? i have to say, i'm a little nervous of having to change to a sony menu system, the panasonic has been fairly ok.  \n\n\ni've never used any other 'nice' camera except my gh5 so any advice would be very greatfully recieved, especially if any of you have come from a gh5 -----> position !!!  yourselves? many thanks in advance!", "sortedWord": "None", "identifyer": 51242, "year": "2020"}, {"Unnamed: 0": 52391, "autor": "cupplesey", "date": 1592207261000, "content": "A6000 Vintage Lens Adapter Advise /!/ So im diving head first into the vintage lens and of course i need some adapters so i picked up a 'thin' adapter off ebay. But since then ive been watching and reading more and the majority use the 'thick' version.\n\nI understand that this is to position the lens away from the sensor correctly so it can focus to infinity due to it being mirrorless but which type is the correct one for the a6000 camera? Should I only use the 'thick' adapter as a default or are there some lenses or shooting scenarios like macro that need the 'thin' one? \n\nBeen researching ages for to get a clear answer, most point to using the 'thick' but its not explained why the 'thin' are not used yet you can buy both types.\n\nThanks all in advance", "link": "https://www.reddit.com/r/SonyAlpha/comments/h9blah/a6000_vintage_lens_adapter_advise/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a6000 vintage lens adapter advise /!/ so im diving head first into the vintage lens and of course i need some adapters so i picked up a 'thin' adapter off ebay. but since then ive been watching and reading more and the majority use the 'thick' version.\n\ni understand that this is to -----> position !!!  the lens away from the sensor correctly so it can focus to infinity due to it being mirrorless but which type is the correct one for the a6000 camera? should i only use the 'thick' adapter as a default or are there some lenses or shooting scenarios like macro that need the 'thin' one? \n\nbeen researching ages for to get a clear answer, most point to using the 'thick' but its not explained why the 'thin' are not used yet you can buy both types.\n\nthanks all in advance", "sortedWord": "None", "identifyer": 53720, "year": "2020"}], "name": "positionSonyAlpha2020"}