{"interestingcomments": [{"Unnamed: 0": 37830, "autor": "akgt94", "date": 1583286988000, "content": "Imaging Edge Mobile? /!/ Android, here. Drunk the alpha Kool-Aid. Tried to fire up Imaging Edge Mobile and the whole experience feels like trying to sew buttons while wearing mittens. Somehow I managed to see a live view from my phone and push a couple of pictures  to the phone.  Both involved a lot of fiddling back and forth between the camera and phone. Location tagging?  Camera remote? Getting images in the phone? Should be way easier. What am I missing?", "link": "https://www.reddit.com/r/SonyAlpha/comments/fd5nvv/imaging_edge_mobile/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "imaging edge mobile? /!/ android, here. drunk the alpha kool-aid. tried to fire up imaging edge mobile and the whole experience feels like trying to sew buttons while wearing mittens. somehow i managed to see a live view from my phone and push a couple of pictures  to the phone.  both involved a lot of fiddling back and forth between the camera and phone. location -----> tagging !!! ?  camera remote? getting images in the phone? should be way easier. what am i missing?", "sortedWord": "None", "identifyer": 38650, "year": "2020"}, {"Unnamed: 0": 42521, "autor": "sebweyn", "date": 1584217076000, "content": "a6100 + Sony 70-350mm G is a satisfying and compact amateur wildlife kit /!/ MSRP: $750 (a6100) + $900 (SEL70350G); I paid $600 + $750 (traded in my SEL55210 for $50 + $100 Sony trade-in bonus at B&amp;H).\n\nI am a very amateur photographer who mostly enjoys shooting animals. I first upgraded my 55-210mm to the 70-350mm. I was getting some nice, sharp shots but, particularly at the longer focal lengths and for moving subjects, also missing the focus more often than I wanted. I therefore decided to give the a6100 a try; its autofocus really makes the lens shine. It is so much faster and more accurate and I can’t go back to the a6000 for wildlife (though it’s still a really great camera for people and scenes).\n\nThis kit doesn’t have the longest reach, the brightest lens, the best dynamic range, the biggest or most sensor pixels, or even a great body, but it’s compact, super satisfying to use thanks to the excellent autofocus, and takes great, sharp shots in daylight. \n\nOn the a6100, the Zone AF + AF-C is fast enough to reliably capture birds in flight. I’m finding myself switching to Spot AF less often because even in Zone the AF is pretty good at picking the right subject (though that’s also partly because the interface is clunky... if it was a physical dial or if I could reorder the options in the menu I would probably switch more often). And being able to immediately move the spot/zone after pressing the shutter button (without pushing the center button) is a nice enhancement as well.\n\nI am now switching from being happy getting a focused shot of an animal to being able to trust the autofocus and aim at capturing the right light or right action. It’s such an amazing feeling and has made me really excited to go out and take more photos.\n\n___\n\nSome sample shots, released under CC-BY-SA license:\n\n[JPEGs](https://adobe.ly/39R3E8b) (cropped and lightly edited)\n\n[RAWs]( https://www.dropbox.com/sh/c2wggnhagige3hu/AACu-bwADA4_ROtI7zIH8_NBa?dl=0)\n\nMisc observations about the a6100 compared to the a6000:\n\nPros:\n+ Expandable Spot AF gives you a bit more flexibility for your camera position, though it makes it more likely you’ll focus on a branch\n+ Tracking AF looks pretty good, though I haven’t really used it in the wild yet\n+ Animal Eye-AF for the dog is nice. It sometimes even works on squirrels and birds. You have to disable it to use Tracking AF.\n+ It has a completely silent shutter option, which while not recommended for moving subjects (it causes artifacts) it’s good for not distracting the dog\n+ Touch to focus works when using the EVF, though I don’t really use it\n+ This only works maybe 1/3 of the time, but a Bluetooth connection to my phone enables geo-tagging of shots\n+ Same battery as the a6000, so while battery life isn’t great, I now have an extra battery\n\nCons:\n-\tThe EVF is usable but definitely could and should be higher resolution\n-\tA $750 MSRP device in 2020 uses microUSB? Come on.\n-\tThe a6400 gets you weatherproofing, minimum shutter speed in auto ISO, an extra custom button, and a better EVF and LCD. I wish these were all included on the a6100 but they’re not worth $300 to me. For a $150 difference I probably would’ve jumped up. On the bright side, I’m happy Sony gave photographers almost all the features they need on the lower-priced model.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fiorvm/a6100_sony_70350mm_g_is_a_satisfying_and_compact/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "a6100 + sony 70-350mm g is a satisfying and compact amateur wildlife kit /!/ msrp: $750 (a6100) + $900 (sel70350g); i paid $600 + $750 (traded in my sel55210 for $50 + $100 sony trade-in bonus at b&amp;h).\n\ni am a very amateur photographer who mostly enjoys shooting animals. i first upgraded my 55-210mm to the 70-350mm. i was getting some nice, sharp shots but, particularly at the longer focal lengths and for moving subjects, also missing the focus more often than i wanted. i therefore decided to give the a6100 a try; its autofocus really makes the lens shine. it is so much faster and more accurate and i can’t go back to the a6000 for wildlife (though it’s still a really great camera for people and scenes).\n\nthis kit doesn’t have the longest reach, the brightest lens, the best dynamic range, the biggest or most sensor pixels, or even a great body, but it’s compact, super satisfying to use thanks to the excellent autofocus, and takes great, sharp shots in daylight. \n\non the a6100, the zone af + af-c is fast enough to reliably capture birds in flight. i’m finding myself switching to spot af less often because even in zone the af is pretty good at picking the right subject (though that’s also partly because the interface is clunky... if it was a physical dial or if i could reorder the options in the menu i would probably switch more often). and being able to immediately move the spot/zone after pressing the shutter button (without pushing the center button) is a nice enhancement as well.\n\ni am now switching from being happy getting a focused shot of an animal to being able to trust the autofocus and aim at capturing the right light or right action. it’s such an amazing feeling and has made me really excited to go out and take more photos.\n\n___\n\nsome sample shots, released under cc-by-sa license:\n\n[jpegs](https://adobe.ly/39r3e8b) (cropped and lightly edited)\n\n[raws]( https://www.dropbox.com/sh/c2wggnhagige3hu/aacu-bwada4_roti7zih8_nba?dl=0)\n\nmisc observations about the a6100 compared to the a6000:\n\npros:\n+ expandable spot af gives you a bit more flexibility for your camera position, though it makes it more likely you’ll focus on a branch\n+ tracking af looks pretty good, though i haven’t really used it in the wild yet\n+ animal eye-af for the dog is nice. it sometimes even works on squirrels and birds. you have to disable it to use tracking af.\n+ it has a completely silent shutter option, which while not recommended for moving subjects (it causes artifacts) it’s good for not distracting the dog\n+ touch to focus works when using the evf, though i don’t really use it\n+ this only works maybe 1/3 of the time, but a bluetooth connection to my phone enables geo------> tagging !!!  of shots\n+ same battery as the a6000, so while battery life isn’t great, i now have an extra battery\n\ncons:\n-\tthe evf is usable but definitely could and should be higher resolution\n-\ta $750 msrp device in 2020 uses microusb? come on.\n-\tthe a6400 gets you weatherproofing, minimum shutter speed in auto iso, an extra custom button, and a better evf and lcd. i wish these were all included on the a6100 but they’re not worth $300 to me. for a $150 difference i probably would’ve jumped up. on the bright side, i’m happy sony gave photographers almost all the features they need on the lower-priced model.", "sortedWord": "None", "identifyer": 43481, "year": "2020"}, {"Unnamed: 0": 45523, "autor": "inktomi", "date": 1577901779000, "content": "Issues with geotagging with the latest Imaging Edge Mobile updates? /!/ I've been using the Android version of the Play Memories app for a while to tag my photos with location - it worked reasonably well. Then they updated the app to Imaging Edge Mobile. The new app is nicer from a user interface perspective - except that location geotagging no longer works on my Pixel 3 with my A7R III. I've cleared out the connection to the camera and set it all up from scratch, but still it doesn't connect and get location when I turn on my camera like it used to. \n\nAre you seeing similar behavior? Do you have any tips on getting this to work? I rely on this data being present in my photos and it's super frustrating that this buggy connection is the only way to get GPS tagging. I wish there was a GPS device I could attach to my camera instead.", "link": "https://www.reddit.com/r/SonyAlpha/comments/eilc4k/issues_with_geotagging_with_the_latest_imaging/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "issues with geotagging with the latest imaging edge mobile updates? /!/ i've been using the android version of the play memories app for a while to tag my photos with location - it worked reasonably well. then they updated the app to imaging edge mobile. the new app is nicer from a user interface perspective - except that location geotagging no longer works on my pixel 3 with my a7r iii. i've cleared out the connection to the camera and set it all up from scratch, but still it doesn't connect and get location when i turn on my camera like it used to. \n\nare you seeing similar behavior? do you have any tips on getting this to work? i rely on this data being present in my photos and it's super frustrating that this buggy connection is the only way to get gps -----> tagging !!! . i wish there was a gps device i could attach to my camera instead.", "sortedWord": "None", "identifyer": 46593, "year": "2020"}], "name": "taggingSonyAlpha2020"}