{"interestingcomments": [{"Unnamed: 0": 134623, "autor": "Orleviko", "date": 1627715802000, "content": "buy the A7R3 now or wait for the A74 - what do you think guys? /!/ it is rumorred that the A74 is just around the corner with a price tag of 2500$.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ov2rx6/buy_the_a7r3_now_or_wait_for_the_a74_what_do_you/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "buy the a7r3 now or wait for the a74 - what do you think guys? /!/ it is rumorred that the a74 is just around the corner with a price -----> tag !!!  of 2500$.", "sortedWord": "None", "identifyer": 25370, "year": "2021"}, {"Unnamed: 0": 134784, "autor": "Chill_la_Chill", "date": 1633018278000, "content": "What are some good A7iii B-cam options? /!/ I'm wondering what kinds of good companion options there are for the A7iii as a b-cam for doing live events, interviews or on set photography where I have the ability to set something on a tripod and then use the other camera on-the-go as I leave one rolling. I was originally looking into the ZV-E10 as an possibility (mainly from a lens compatibility standpoint) but am wondering if I'm better off saving up and waiting to get myself an A7C when it goes on sale. In most on-the-go scenarios I'd have it on a tripod or on my Ronin SC2 so I don't think the ZV-E10 rolling shutter would be an issue for me (although I'd be interested to hear if people have had issues with that in those kinds of scenarios). That being said although the ZV-E10s cheaper price tag was enticing, another concern I had was the battery life, the battery compatibility and its pro-usability. I figured if I had a b-cam I should try and have something that shares the same battery system as my A7iii.\n\nI'm not sure how many of you own both an A7iii and an A7C but I'd be interested to hear if that was worth saving up for instead of going for a cheaper option like an ZV-E10 or something in the a6000 series. The A7C has a lot of nice video features as I use picture profiles on my A7iii and wondered if it really complimented it or having both was redundant (especially for the price). I've thought about the cheaper options but what's holding me back is just the overall compatibility with my current gear. I'm curious what everyone else's practical uses are with b-cameras and their functionality alongside an A7iii.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pyn0p9/what_are_some_good_a7iii_bcam_options/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what are some good a7iii b-cam options? /!/ i'm wondering what kinds of good companion options there are for the a7iii as a b-cam for doing live events, interviews or on set photography where i have the ability to set something on a tripod and then use the other camera on-the-go as i leave one rolling. i was originally looking into the zv-e10 as an possibility (mainly from a lens compatibility standpoint) but am wondering if i'm better off saving up and waiting to get myself an a7c when it goes on sale. in most on-the-go scenarios i'd have it on a tripod or on my ronin sc2 so i don't think the zv-e10 rolling shutter would be an issue for me (although i'd be interested to hear if people have had issues with that in those kinds of scenarios). that being said although the zv-e10s cheaper price -----> tag !!!  was enticing, another concern i had was the battery life, the battery compatibility and its pro-usability. i figured if i had a b-cam i should try and have something that shares the same battery system as my a7iii.\n\ni'm not sure how many of you own both an a7iii and an a7c but i'd be interested to hear if that was worth saving up for instead of going for a cheaper option like an zv-e10 or something in the a6000 series. the a7c has a lot of nice video features as i use picture profiles on my a7iii and wondered if it really complimented it or having both was redundant (especially for the price). i've thought about the cheaper options but what's holding me back is just the overall compatibility with my current gear. i'm curious what everyone else's practical uses are with b-cameras and their functionality alongside an a7iii.", "sortedWord": "None", "identifyer": 25533, "year": "2021"}, {"Unnamed: 0": 135940, "autor": "thatsbczwhynot", "date": 1623793068000, "content": "Cheap &amp; reliable charger for NP-FZ100 batteries /!/ Hi, A7 III user here. I've got 3 batteries in total. Charging batteries in camera is pain, using QZ1 charger is just not enough, MQZ1K battery is just too expensive and too much to carry around. I'm not a video guy either. Could you guys please suggest a reliable double battery charger that has a cheap/reasonable price tag? Thanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/o0p9k3/cheap_reliable_charger_for_npfz100_batteries/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "cheap &amp; reliable charger for np-fz100 batteries /!/ hi, a7 iii user here. i've got 3 batteries in total. charging batteries in camera is pain, using qz1 charger is just not enough, mqz1k battery is just too expensive and too much to carry around. i'm not a video guy either. could you guys please suggest a reliable double battery charger that has a cheap/reasonable price -----> tag !!! ? thanks in advance.", "sortedWord": "None", "identifyer": 26718, "year": "2021"}, {"Unnamed: 0": 137626, "autor": "Various-Enthusiasm-1", "date": 1635557009000, "content": "Built-in flash /!/ Hi, I’d like to know if you often use the flash and in what situations. I’m currently looking at the a6400, a6600, a7c and sadly only the a6400 comes with the built-in flash. I will have to spend few extra hundreds of dollars to get an external flash and that makes me hesitant… \n\nI love the fact that the a6600 has longer battery life, I like the tilt screen too\n\nThe a7c is full frame and I love that you can flip the screen on the side, I love the size too\n\nthe a6400 has built in flash, tilt screen, good price tag but I’m scared of the IQ if I mainly want to do portraits and maybe one day become a photographer\n\nI’m just a photography enthusiast for now but I like good quality", "link": "https://www.reddit.com/r/SonyAlpha/comments/qir0ht/builtin_flash/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "built-in flash /!/ hi, i’d like to know if you often use the flash and in what situations. i’m currently looking at the a6400, a6600, a7c and sadly only the a6400 comes with the built-in flash. i will have to spend few extra hundreds of dollars to get an external flash and that makes me hesitant… \n\ni love the fact that the a6600 has longer battery life, i like the tilt screen too\n\nthe a7c is full frame and i love that you can flip the screen on the side, i love the size too\n\nthe a6400 has built in flash, tilt screen, good price -----> tag !!!  but i’m scared of the iq if i mainly want to do portraits and maybe one day become a photographer\n\ni’m just a photography enthusiast for now but i like good quality", "sortedWord": "None", "identifyer": 28463, "year": "2021"}, {"Unnamed: 0": 140525, "autor": "seeleeburtee", "date": 1615703995000, "content": "1st Camera Purchase: A7C or A6600 /!/ Hello,\n\nI'm looking to upgrade from my A7ii, which I've owned for a couple of months. I'm relatively new to photography and am looking to upgrade to either the A7C or a6600. I'm very much still a beginner and am trying to figure out which camera would be best for my needs. \n\nMy budget isn't super tight, but I like the idea of the a6600 due to the versatility of lenses with relation to price. At present, I'm eyeing the a6600 body (\\~$1400 USD) with the 16-55mm f/2.8 G Lens at a start–purely for that lens's versatility. I plan on expanding my kit to include a portrait lens (Sigma 30mm f/1.4) and possibly a telephoto (Sony 70-350mm f/4.5-6.3) down the road, as I love sports photography. Macro has always been an interest of mine, but I think portraits and action shots would take providence as of now. \n\nMy issue is with Sony's future with APS-C. I come from a line of photographers (a handful of family members have taken up the profession), and all suggest I just invest in FF now, considering that's where Sony seems to be heading. I consider myself an enthused hobbiest at most right now, but I'm not sure if opting for the modern FF camera body &amp; glass will help me further develop any talent. The low price of APS-C lenses is super attractive, but I don't know if that's best for the long-run, you know?\n\nI can bear the cost of the A7C + 24-105mm f/4, but part of me questions that \\~$3000 price tag for the a6600 with my choice of lenses. Does Sony seem to be at all invested in their crop sensor line throughout the future? Should I just accept the quality of the A7C and recognize that I'm \"dating the body but marrying the glass\"? I'd appreciate any help you all can offer me.", "link": "https://www.reddit.com/r/SonyAlpha/comments/m4pwr4/1st_camera_purchase_a7c_or_a6600/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1st camera purchase: a7c or a6600 /!/ hello,\n\ni'm looking to upgrade from my a7ii, which i've owned for a couple of months. i'm relatively new to photography and am looking to upgrade to either the a7c or a6600. i'm very much still a beginner and am trying to figure out which camera would be best for my needs. \n\nmy budget isn't super tight, but i like the idea of the a6600 due to the versatility of lenses with relation to price. at present, i'm eyeing the a6600 body (\\~$1400 usd) with the 16-55mm f/2.8 g lens at a start–purely for that lens's versatility. i plan on expanding my kit to include a portrait lens (sigma 30mm f/1.4) and possibly a telephoto (sony 70-350mm f/4.5-6.3) down the road, as i love sports photography. macro has always been an interest of mine, but i think portraits and action shots would take providence as of now. \n\nmy issue is with sony's future with aps-c. i come from a line of photographers (a handful of family members have taken up the profession), and all suggest i just invest in ff now, considering that's where sony seems to be heading. i consider myself an enthused hobbiest at most right now, but i'm not sure if opting for the modern ff camera body &amp; glass will help me further develop any talent. the low price of aps-c lenses is super attractive, but i don't know if that's best for the long-run, you know?\n\ni can bear the cost of the a7c + 24-105mm f/4, but part of me questions that \\~$3000 price -----> tag !!!  for the a6600 with my choice of lenses. does sony seem to be at all invested in their crop sensor line throughout the future? should i just accept the quality of the a7c and recognize that i'm \"dating the body but marrying the glass\"? i'd appreciate any help you all can offer me.", "sortedWord": "None", "identifyer": 31459, "year": "2021"}, {"Unnamed: 0": 141916, "autor": "Comfortable-Grand-46", "date": 1635458889000, "content": "Any GPS accessories for tagging GPS with Sony cameras? /!/ Canon and Nikon have an accessory to tag GPS but how can I do the same thing with Sony cameras? I'm plan to get A7IV and I have A7R2 right now. It would be nice if I can use GPU for each files.\n\n&amp;#x200B;\n\nAny ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/qhxuu3/any_gps_accessories_for_tagging_gps_with_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "any gps accessories for -----> tagging !!!  gps with sony cameras? /!/ canon and nikon have an accessory to tag gps but how can i do the same thing with sony cameras? i'm plan to get a7iv and i have a7r2 right now. it would be nice if i can use gpu for each files.\n\n&amp;#x200b;\n\nany ideas?", "sortedWord": "None", "identifyer": 32891, "year": "2021"}, {"Unnamed: 0": 141966, "autor": "OyeMateStfu", "date": 1635407474000, "content": "Sony a7rii Question /!/ Hello!\n\nI have never used a full frame camera, and am considering purchasing the a7rii in the future. Considering the price tag (especially used), it looks rather tempting.\n\nI mainly take landscape and macro shots so the high megapixels would be really nice.\n\nIf anyone has experience with this camera please let me know what you think of it. Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/qhhud1/sony_a7rii_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony a7rii question /!/ hello!\n\ni have never used a full frame camera, and am considering purchasing the a7rii in the future. considering the price -----> tag !!!  (especially used), it looks rather tempting.\n\ni mainly take landscape and macro shots so the high megapixels would be really nice.\n\nif anyone has experience with this camera please let me know what you think of it. thanks!", "sortedWord": "None", "identifyer": 32942, "year": "2021"}, {"Unnamed: 0": 148225, "autor": "EpicOneHit", "date": 1635080519000, "content": "Sony A6000 for ebay products /!/ I sell a lot on ebay mostly clothing and own a sony a6000 i dont use tripod due to how fast i have to take pictures of one pc of clothing. i wanted to know what settings should i use to get the best results and also a better way to focus zoom on tags of cloths. i use a stock lens that comes with it but am thinking about picking up a macro lens if it works out for my needs or if someone els has better suggestion for me on a lens. i cant use a tri pod due to me having to take close up pics all the time and i also use a canvas to lay my clothes", "link": "https://www.reddit.com/r/SonyAlpha/comments/qerq5c/sony_a6000_for_ebay_products/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "sony a6000 for ebay products /!/ i sell a lot on ebay mostly clothing and own a sony a6000 i dont use tripod due to how fast i have to take pictures of one pc of clothing. i wanted to know what settings should i use to get the best results and also a better way to focus zoom on -----> tags !!!  of cloths. i use a stock lens that comes with it but am thinking about picking up a macro lens if it works out for my needs or if someone els has better suggestion for me on a lens. i cant use a tri pod due to me having to take close up pics all the time and i also use a canvas to lay my clothes", "sortedWord": "None", "identifyer": 39434, "year": "2021"}, {"Unnamed: 0": 150929, "autor": "DLG101", "date": 1627092046000, "content": "Keep thinking on the A7siii /!/ Looking at the A7iii after my RX100va was stolen...\n\nHi everyone wanted to know your opinion... if the A7s3 wld be a good investment... I had the rx100va loved it but the 4K was limited and it wasn’t stable enough! BUT!!! Loved the form factor n how easy it was to carry arnd. My main issue( apart from the price tag!!!)  is the size of the A7s3... Is it hard to carry around? I don’t vlog but from time to time in videos appreciate the angle of holding the camera out in front... how difficult is it to do w the A7S3 ?\n\n2nd question is which Lens... weight n size is a factor... from my research I’m thinkn the tamaron 17-28 wld be the best fit. \n\nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/oqgos2/keep_thinking_on_the_a7siii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "keep thinking on the a7siii /!/ looking at the a7iii after my rx100va was stolen...\n\nhi everyone wanted to know your opinion... if the a7s3 wld be a good investment... i had the rx100va loved it but the 4k was limited and it wasn’t stable enough! but!!! loved the form factor n how easy it was to carry arnd. my main issue( apart from the price -----> tag !!! !!!)  is the size of the a7s3... is it hard to carry around? i don’t vlog but from time to time in videos appreciate the angle of holding the camera out in front... how difficult is it to do w the a7s3 ?\n\n2nd question is which lens... weight n size is a factor... from my research i’m thinkn the tamaron 17-28 wld be the best fit. \n\nthanks", "sortedWord": "None", "identifyer": 42245, "year": "2021"}, {"Unnamed: 0": 151087, "autor": "TheOverratedPhotog", "date": 1609473049000, "content": "Sigma 85mm f/1.4 DG DN Art Review /!/ Put my thoughts together on the new Sigma 85mm f/1.4 DG DN\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3ud6pcxl7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=39a6b4d475ef67dfa70bd28148b7b9d0f13b7caa\n\n**Introduction**\n\nSigma has been doing some amazing things in recent times. Gone are the days of big heavy oversized monsters that required you to have a Sherpa with you at all times. Some of the bags taken up Mount Everest are smaller than the old Sigma ARTs.\n\nThe modern-day Sigma DG DN range is more BMW than Kia, but it still comes in at a Kia price tag which what is so impressive about it. Okay, maybe an expensive Kia, but it’s nearly half the price the Sony GM’s in most cases.\n\nI’ve had a Zeiss Batis 85mm, and for the most part, I’ve been happy. There is absolutely no reason other than GAS to replace it. The f/1.4 vs f/1.8 is such a poor excuse that I’m not going to try to use it to justify the Sigma.\n\nThe Sigma looked really good, I wanted it, so here we are.\n\n&amp;#x200B;\n\n*Processing img 2sk1mj0o7n861...*\n\n**Build Quality/Construction**\n\nFirst impressions last and in this case, the Sigma created quite a big first impression. The Sigma is provided in their usual white box, but the box is much smaller than what you’re accustomed to with Sigma.\n\nInside the box, you’ll find a semi-hard pouch, the lens and hood and the usual assortment of paperwork you never bother to read. I’m pretty sure they could have inserted a winning lotto ticket in there and nobody would know.\n\nLike most of the newer DG DN lenses, Sigma has done an amazing job on the 85mm f/1.4. It’s actually really hard to fault this lens when it comes to size, weight, or construction.\n\nThe previous generation was big, heavy, sluggish, lack features on the lenses, had cheap hoods, terrible lens caps, but were optically outstanding and cheap. The new lens retains absolutely none of these negatives. Okay, maybe that’s a lie, their lens caps are still terrible.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qgeoo9vp7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=0fb2c858a924f9bba8c94808443dc34747719ea7\n\nYes, we might actually have a brand that listens to the consumer instead of telling the consumer what they want. Maybe some of the brands like Apple and Sony could learn a thing or two from them.\n\nHey Sony, thanks for that action camera no one asked for, but how about actually providing a small and medium raw that everyone has been asking for. Seriously!\n\nWhen I first took the lens out, I panicked thinking they had sent me the wrong lens. I had to find the 85mm DG DN label on the lens to make sure because the size and weight seemed too good to be true. It’s that small, almost the same size as my 24mm GM.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pfv02svr7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=54b7994c5f8fbf4282b3a8149e1f5aef403331ab\n\nAs with the rest of Sigma’s DG DN range of lenses, the construction is impeccable. It’s premium level and on a par with most of the OEM Pro glass (Sony, Fujifilm, Nikon) I have tried.\n\nSide by side with the Sony 24mm f/1.4 GM, you’d be hard-pressed to find any discrepancies in manufacturing. They have a different texture and feel, but none of them is more premium than the other.\n\n**Features**\n\nCompared to the Sigma of old, the new DG DN range is feature-rich. The 85mm offers:\n\n* a focus ring.\n* an aperture ring.\n* a button on the lens, similar to that found on the Sony GM range which you can program to do anything from eye detect to focus lock.\n* an autofocus/manual focus lock.\n* an aperture ring lock (only works in auto)\n* a switch to turn the aperture clicks on or off, assumingly for those doing video work where the sound may be heard.\n\nOverall, it’s on a par with any of the premium lenses on the market.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Sony 24GM, Sigma 85 and Zeiss Batis 85](https://preview.redd.it/dpwf7aiu7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=4186f90020a39af04edd938e204ede4c9ec39e10)\n\n**Focus Performance**\n\nAs mentioned above, the Sigma’s of yesteryear suffered from some less than stellar performance issues. It wasn’t bad per se, my 135mm is fairly good, but it didn’t match the Sony 135mm in the focus department.\n\nWith the DG DN range, that started to change. My 35mm f/1.2 and 24-70mm f/2.8 are both outstanding in the focus department.\n\nThe 85mm continues in this line and the performance is up with the best. Whilst I can’t test the DG DN alongside the GM, the other reviews claim the 85mm matches it, and in some cases exceeds it and I have no reason to doubt that. It’s fast enough for sports.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ntyeah0x7n861.png?width=960&amp;format=png&amp;auto=webp&amp;s=e2f42284b69352e06a06be0dd7ed6ea0d5da0366\n\n**Image Quality**\n\nOne word to describe the image quality: incredible. This thing is super sharp and I would potentially say it’s the sharpest non-macro lens I have tried possibly exceeding my 35mm f/1.2 although the comparison is difficult to make due to the different maximum apertures and focal lengths.\n\nBokeh is really pleasing and soft. It doesn't look as nice as my 135mm but I'm not disappointed with it.\n\nChromatic Aberration is well controlled and Sigma has done an amazing job with flare resistance. While not perfect, it’s definitely one of the best in class which will keep owners happy.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wmt7453z7n861.png?width=800&amp;format=png&amp;auto=webp&amp;s=96142d8ba9006631db401bfa323705cbcc3c8451\n\nThere is mild vignetting but it’s easily corrected and not the sort of thing I would be concerned about. It’s correctable in camera and standard lens profiles in Lightroom or Capture One will make this unnoticeable to most owners.\n\nThere is also some distortion which may be concerning to users, but, like the vignetting, it’s easily corrected. I know some users will be concerned about this because it looks bad uncorrected, but it’s really a non-issue with lens correction.\n\nOverall, the strengths of the lens are in the right place and the weaknesses are easily corrected which are acceptable compromises.\n\n**Value for Money**\n\n&amp;#x200B;\n\n[The camera had no issues with focus shooting into the sun](https://preview.redd.it/xxbs1yi18n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=34bd5eccddfc1598b88d9d2fd18a1c3919d1f92c)\n\nWith a recommended retail of around $1200, it’s hard to find a reason to complain. We’d obviously all like to see it cheaper but the reality is good lenses cost money and this is about as low cost as you expect a lens of this construction and quality to cost. keep in mind that this is recommended retail so there will be some better deals to be had if you look out for them.\n\nBy comparison, the Sony GM retails for nearly $600 more. I honestly cannot think of a reason to spend that extra $600 given the Sigma matches the Sony in every category.\n\nLet me be clear, however: If you’re planning to sell your GM for the Sigma, don’t waste your time. The Sigma hasn’t mysteriously made the GM into a bad lens. It’s\n\n**Conclusion**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gcnnqau38n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3c5ca604729c5aa5fe5172e0691a823b09f24db\n\nSigma seems to be kicking goal after goal with their latest range of DG DN lenses. Sigma has moved from being the ugly duckling to a beautiful swan and that is good for everyone.\n\nIt lowers the bar for those looking to get into Sony and it provides competition to Sony who might have otherwise stagnated with their lens performance. In the past, buying Sigma would have meant a lot of compromises but right now, there are few, if any.\n\nSome people I know think that Sony may not be happy but I think the opposite is true. This is a win for the consumer and Sony.\n\nCanon is Sony’s biggest competitor right now. One of the single biggest selling points that Sony offers over Canon is a range of cheaper pro-quality lenses. Canon doesn’t have an 85mm f/1.4 for $1200 unless you look at DSLR glass which doesn’t offer the same performance.\n\nThat puts Sony in the driving seat for people looking to buy into a system and until Sigma start making glass for Sony, that advantage will exist.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ko4gkz/sigma_85mm_f14_dg_dn_art_review/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sigma 85mm f/1.4 dg dn art review /!/ put my thoughts together on the new sigma 85mm f/1.4 dg dn\n\n&amp;#x200b;\n\nhttps://preview.redd.it/3ud6pcxl7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=39a6b4d475ef67dfa70bd28148b7b9d0f13b7caa\n\n**introduction**\n\nsigma has been doing some amazing things in recent times. gone are the days of big heavy oversized monsters that required you to have a sherpa with you at all times. some of the bags taken up mount everest are smaller than the old sigma arts.\n\nthe modern-day sigma dg dn range is more bmw than kia, but it still comes in at a kia price -----> tag !!!  which what is so impressive about it. okay, maybe an expensive kia, but it’s nearly half the price the sony gm’s in most cases.\n\ni’ve had a zeiss batis 85mm, and for the most part, i’ve been happy. there is absolutely no reason other than gas to replace it. the f/1.4 vs f/1.8 is such a poor excuse that i’m not going to try to use it to justify the sigma.\n\nthe sigma looked really good, i wanted it, so here we are.\n\n&amp;#x200b;\n\n*processing img 2sk1mj0o7n861...*\n\n**build quality/construction**\n\nfirst impressions last and in this case, the sigma created quite a big first impression. the sigma is provided in their usual white box, but the box is much smaller than what you’re accustomed to with sigma.\n\ninside the box, you’ll find a semi-hard pouch, the lens and hood and the usual assortment of paperwork you never bother to read. i’m pretty sure they could have inserted a winning lotto ticket in there and nobody would know.\n\nlike most of the newer dg dn lenses, sigma has done an amazing job on the 85mm f/1.4. it’s actually really hard to fault this lens when it comes to size, weight, or construction.\n\nthe previous generation was big, heavy, sluggish, lack features on the lenses, had cheap hoods, terrible lens caps, but were optically outstanding and cheap. the new lens retains absolutely none of these negatives. okay, maybe that’s a lie, their lens caps are still terrible.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qgeoo9vp7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=0fb2c858a924f9bba8c94808443dc34747719ea7\n\nyes, we might actually have a brand that listens to the consumer instead of telling the consumer what they want. maybe some of the brands like apple and sony could learn a thing or two from them.\n\nhey sony, thanks for that action camera no one asked for, but how about actually providing a small and medium raw that everyone has been asking for. seriously!\n\nwhen i first took the lens out, i panicked thinking they had sent me the wrong lens. i had to find the 85mm dg dn label on the lens to make sure because the size and weight seemed too good to be true. it’s that small, almost the same size as my 24mm gm.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/pfv02svr7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=54b7994c5f8fbf4282b3a8149e1f5aef403331ab\n\nas with the rest of sigma’s dg dn range of lenses, the construction is impeccable. it’s premium level and on a par with most of the oem pro glass (sony, fujifilm, nikon) i have tried.\n\nside by side with the sony 24mm f/1.4 gm, you’d be hard-pressed to find any discrepancies in manufacturing. they have a different texture and feel, but none of them is more premium than the other.\n\n**features**\n\ncompared to the sigma of old, the new dg dn range is feature-rich. the 85mm offers:\n\n* a focus ring.\n* an aperture ring.\n* a button on the lens, similar to that found on the sony gm range which you can program to do anything from eye detect to focus lock.\n* an autofocus/manual focus lock.\n* an aperture ring lock (only works in auto)\n* a switch to turn the aperture clicks on or off, assumingly for those doing video work where the sound may be heard.\n\noverall, it’s on a par with any of the premium lenses on the market.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n[sony 24gm, sigma 85 and zeiss batis 85](https://preview.redd.it/dpwf7aiu7n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=4186f90020a39af04edd938e204ede4c9ec39e10)\n\n**focus performance**\n\nas mentioned above, the sigma’s of yesteryear suffered from some less than stellar performance issues. it wasn’t bad per se, my 135mm is fairly good, but it didn’t match the sony 135mm in the focus department.\n\nwith the dg dn range, that started to change. my 35mm f/1.2 and 24-70mm f/2.8 are both outstanding in the focus department.\n\nthe 85mm continues in this line and the performance is up with the best. whilst i can’t test the dg dn alongside the gm, the other reviews claim the 85mm matches it, and in some cases exceeds it and i have no reason to doubt that. it’s fast enough for sports.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/ntyeah0x7n861.png?width=960&amp;format=png&amp;auto=webp&amp;s=e2f42284b69352e06a06be0dd7ed6ea0d5da0366\n\n**image quality**\n\none word to describe the image quality: incredible. this thing is super sharp and i would potentially say it’s the sharpest non-macro lens i have tried possibly exceeding my 35mm f/1.2 although the comparison is difficult to make due to the different maximum apertures and focal lengths.\n\nbokeh is really pleasing and soft. it doesn't look as nice as my 135mm but i'm not disappointed with it.\n\nchromatic aberration is well controlled and sigma has done an amazing job with flare resistance. while not perfect, it’s definitely one of the best in class which will keep owners happy.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/wmt7453z7n861.png?width=800&amp;format=png&amp;auto=webp&amp;s=96142d8ba9006631db401bfa323705cbcc3c8451\n\nthere is mild vignetting but it’s easily corrected and not the sort of thing i would be concerned about. it’s correctable in camera and standard lens profiles in lightroom or capture one will make this unnoticeable to most owners.\n\nthere is also some distortion which may be concerning to users, but, like the vignetting, it’s easily corrected. i know some users will be concerned about this because it looks bad uncorrected, but it’s really a non-issue with lens correction.\n\noverall, the strengths of the lens are in the right place and the weaknesses are easily corrected which are acceptable compromises.\n\n**value for money**\n\n&amp;#x200b;\n\n[the camera had no issues with focus shooting into the sun](https://preview.redd.it/xxbs1yi18n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=34bd5eccddfc1598b88d9d2fd18a1c3919d1f92c)\n\nwith a recommended retail of around $1200, it’s hard to find a reason to complain. we’d obviously all like to see it cheaper but the reality is good lenses cost money and this is about as low cost as you expect a lens of this construction and quality to cost. keep in mind that this is recommended retail so there will be some better deals to be had if you look out for them.\n\nby comparison, the sony gm retails for nearly $600 more. i honestly cannot think of a reason to spend that extra $600 given the sigma matches the sony in every category.\n\nlet me be clear, however: if you’re planning to sell your gm for the sigma, don’t waste your time. the sigma hasn’t mysteriously made the gm into a bad lens. it’s\n\n**conclusion**\n\n&amp;#x200b;\n\nhttps://preview.redd.it/gcnnqau38n861.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3c5ca604729c5aa5fe5172e0691a823b09f24db\n\nsigma seems to be kicking goal after goal with their latest range of dg dn lenses. sigma has moved from being the ugly duckling to a beautiful swan and that is good for everyone.\n\nit lowers the bar for those looking to get into sony and it provides competition to sony who might have otherwise stagnated with their lens performance. in the past, buying sigma would have meant a lot of compromises but right now, there are few, if any.\n\nsome people i know think that sony may not be happy but i think the opposite is true. this is a win for the consumer and sony.\n\ncanon is sony’s biggest competitor right now. one of the single biggest selling points that sony offers over canon is a range of cheaper pro-quality lenses. canon doesn’t have an 85mm f/1.4 for $1200 unless you look at dslr glass which doesn’t offer the same performance.\n\nthat puts sony in the driving seat for people looking to buy into a system and until sigma start making glass for sony, that advantage will exist.", "sortedWord": "None", "identifyer": 42406, "year": "2021"}, {"Unnamed: 0": 152071, "autor": "Ilackcreativity99", "date": 1624117705000, "content": "Sony A1 receiving \"a\" model /!/ Is there any news as to whether the Sony A1 will receive an \"a\" model refresh to increase the LCD screen resolution to 2.4M dots like we've seen with the a7rIII and A7RIV? seems like a kick in the teeth if not, considering the £6500 price tag.", "link": "https://www.reddit.com/r/SonyAlpha/comments/o3izde/sony_a1_receiving_a_model/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony a1 receiving \"a\" model /!/ is there any news as to whether the sony a1 will receive an \"a\" model refresh to increase the lcd screen resolution to 2.4m dots like we've seen with the a7riii and a7riv? seems like a kick in the teeth if not, considering the £6500 price -----> tag !!! .", "sortedWord": "None", "identifyer": 43427, "year": "2021"}], "name": "tagSonyAlpha2021"}