{"interestingcomments": [{"Unnamed: 0": 234116, "autor": "Samsote", "date": 1522371169000, "content": "Need some advice on lens choice for A7 iii /!/ So I've been hired full time to create Videos for a company that wants to have a presence on social media.  \nI'll be mostly shooting corporate, interview and event coverage and the starting budget to build my tool kit with isn't the greatest.  \n  \nAfter much research I've decided on the A7 iii, it just seems like best camera overall especially at that price.  \n  \nI know that the \"best all around\" Lens is the 24-105 F4 G but the price tag is a little heavy.  \n\nand while i do need a zoom lens in my kit, I'm thinking that i will mostly be shooting portrait style videos where a 50mm prime lens might offer the best usability.  \n  \nSo the lenses i am looking at are,  \nthe 28-70 3.5-5.6 kit lens    \nthe Sony 50mm f/1.8  \nThe Sigma art 50mm f/1.4    \n  \nSo i would love to hear peoples opinion on this choice, and lenses.\nIs the Sigma really that much better?  \nOr should i drop the prime lens all together and just go for the 24-105?\n\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/886igu/need_some_advice_on_lens_choice_for_a7_iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "need some advice on lens choice for a7 iii /!/ so i've been hired full time to create videos for a company that wants to have a presence on social media.  \ni'll be mostly shooting corporate, interview and event coverage and the starting budget to build my tool kit with isn't the greatest.  \n  \nafter much research i've decided on the a7 iii, it just seems like best camera overall especially at that price.  \n  \ni know that the \"best all around\" lens is the 24-105 f4 g but the price -----> tag !!!  is a little heavy.  \n\nand while i do need a zoom lens in my kit, i'm thinking that i will mostly be shooting portrait style videos where a 50mm prime lens might offer the best usability.  \n  \nso the lenses i am looking at are,  \nthe 28-70 3.5-5.6 kit lens    \nthe sony 50mm f/1.8  \nthe sigma art 50mm f/1.4    \n  \nso i would love to hear peoples opinion on this choice, and lenses.\nis the sigma really that much better?  \nor should i drop the prime lens all together and just go for the 24-105?\n\n", "sortedWord": "None", "identifyer": 29172, "year": "2018"}, {"Unnamed: 0": 234468, "autor": "AgThunderbird", "date": 1530442767000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - July 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; ** **\n\nWill be Selected by our winner from [June](https://www.reddit.com/r/SonyAlpha/comments/8nribv/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/imthecar. The winning photo [Huaxi Street Auntie] (https://i.imgur.com/oxGUfbe.jpg).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/8v96el/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - july 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; ** **\n\nwill be selected by our winner from [june](https://www.reddit.com/r/sonyalpha/comments/8nribv/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/imthecar. the winning photo [huaxi street auntie] (https://i.imgur.com/oxgufbe.jpg).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 29527, "year": "2018"}, {"Unnamed: 0": 235530, "autor": "emotionofcolors", "date": 1542646443000, "content": "Sony A7 MK2 black friday sale vs. waiting on buying Sony A7 MK3 /!/ Hello all,\n\n&amp;#x200B;\n\nI currently have an internal dilemma:\n\nAfter jumping ship to a Canon 6D MK2 from my Sony A7 MK1 due to my focus on motorsports , I'm working on getting back into a mirrorless for a backup/spare/travel camera. Best Buy is going to have a Black Friday Sale for the A7II with 24-70 lens for $999, I planned on getting an A7III some time in spring and pairing that with a Sigma MC-11 adapter for all of Canon L lenses.\n\n&amp;#x200B;\n\nMy main reasons for getting a Sony for a spare:\n\n* picture quality is night and day between the Canon and the Sony for anything still \n* The canon is bulky, heavy (especially with a battery grip and the thicc 24-70 2.8 lens). I barely used my camera during my trip to Korea and Japan over the summer simply because it was a huge hassle, but when I went last year with my A7I it was perfectly fine.\n\nIs the extra $1000 price tag really worth it for a A7III without a lens? Everything I've read on the comparison hasn't helped me in making a firm decision. Maybe there are other factors I need to consider that I'm not seeing?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9yiih0/sony_a7_mk2_black_friday_sale_vs_waiting_on/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony a7 mk2 black friday sale vs. waiting on buying sony a7 mk3 /!/ hello all,\n\n&amp;#x200b;\n\ni currently have an internal dilemma:\n\nafter jumping ship to a canon 6d mk2 from my sony a7 mk1 due to my focus on motorsports , i'm working on getting back into a mirrorless for a backup/spare/travel camera. best buy is going to have a black friday sale for the a7ii with 24-70 lens for $999, i planned on getting an a7iii some time in spring and pairing that with a sigma mc-11 adapter for all of canon l lenses.\n\n&amp;#x200b;\n\nmy main reasons for getting a sony for a spare:\n\n* picture quality is night and day between the canon and the sony for anything still \n* the canon is bulky, heavy (especially with a battery grip and the thicc 24-70 2.8 lens). i barely used my camera during my trip to korea and japan over the summer simply because it was a huge hassle, but when i went last year with my a7i it was perfectly fine.\n\nis the extra $1000 price -----> tag !!!  really worth it for a a7iii without a lens? everything i've read on the comparison hasn't helped me in making a firm decision. maybe there are other factors i need to consider that i'm not seeing?", "sortedWord": "None", "identifyer": 30599, "year": "2018"}, {"Unnamed: 0": 235641, "autor": "agentrandom", "date": 1541113825000, "content": "Some newbie A6000 questions /!/ Hey there, Alphas. I've been using a Nikon for a couple of years, but mirrorless has been tempting me. I saw a good deal on a used A6000, so decided to switch. Though there are many things to which I look forward, GPS and RAW transfer are things for which I'd like to be prepared before my kit arrives.\n\nI'm aware that there's no recent GPS hotshoe/hardware addon - to the best of my knowledge - and the A6000 can't automatically add the data from my phone to captures. Is there an app solution for Android that will allow me to add GPS data to the RAW files directly, rather than just the JPEGs exported from Lightroom? A consensus on the easiest app for workflow would be great. Even if I can only tag the JPEGs. I travel fairly often and the idea of manually tagging \\~200 files every couple of weeks doesn't sound like fun.\n\nI've read mixed things regarding RAW file transfer to phones. I realise it can't officially be done, but some videos and posts I've seen seem to suggest it can be done via opening up the image preview/something in Playmemories, rather than using the send to phone functionality. I realise send to phone will only send JPEGs. If there's some kind of wireless workaround - I'd prefer to avoid an OTG card reader - that would be great.\n\nI have seen the threads from roughly 9 months to a year ago that cover these issues, but I'm hoping that things have somehow improved. I appreciate that's unlikely, but I'm feeling optimistic.\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/9tekmx/some_newbie_a6000_questions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "some newbie a6000 questions /!/ hey there, alphas. i've been using a nikon for a couple of years, but mirrorless has been tempting me. i saw a good deal on a used a6000, so decided to switch. though there are many things to which i look forward, gps and raw transfer are things for which i'd like to be prepared before my kit arrives.\n\ni'm aware that there's no recent gps hotshoe/hardware addon - to the best of my knowledge - and the a6000 can't automatically add the data from my phone to captures. is there an app solution for android that will allow me to add gps data to the raw files directly, rather than just the jpegs exported from lightroom? a consensus on the easiest app for workflow would be great. even if i can only tag the jpegs. i travel fairly often and the idea of manually -----> tagging !!!  \\~200 files every couple of weeks doesn't sound like fun.\n\ni've read mixed things regarding raw file transfer to phones. i realise it can't officially be done, but some videos and posts i've seen seem to suggest it can be done via opening up the image preview/something in playmemories, rather than using the send to phone functionality. i realise send to phone will only send jpegs. if there's some kind of wireless workaround - i'd prefer to avoid an otg card reader - that would be great.\n\ni have seen the threads from roughly 9 months to a year ago that cover these issues, but i'm hoping that things have somehow improved. i appreciate that's unlikely, but i'm feeling optimistic.\n\nthanks!", "sortedWord": "None", "identifyer": 30713, "year": "2018"}, {"Unnamed: 0": 235804, "autor": "GivenGraceX", "date": 1539563938000, "content": "Purchasing tomorrow 70-200mm f2.8 GM /!/ Guys I’m super hyped and ready for this huge investment! I’m considering the price tag of 1000$+ over the f4 to the f2.8 for long term use and honestly not getting buyer remorse. Give me some great feedback on your use with the 70-200 f2.8 :) I’m looking to much success with this lens! Any advice and tips would be awesome as well thanks in advance! ", "link": "https://www.reddit.com/r/SonyAlpha/comments/9o7ys8/purchasing_tomorrow_70200mm_f28_gm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "purchasing tomorrow 70-200mm f2.8 gm /!/ guys i’m super hyped and ready for this huge investment! i’m considering the price -----> tag !!!  of 1000$+ over the f4 to the f2.8 for long term use and honestly not getting buyer remorse. give me some great feedback on your use with the 70-200 f2.8 :) i’m looking to much success with this lens! any advice and tips would be awesome as well thanks in advance! ", "sortedWord": "None", "identifyer": 30879, "year": "2018"}, {"Unnamed: 0": 236485, "autor": "gimboroot", "date": 1526988781000, "content": "True newbie here. Need recommendation for my first A7RIII lens /!/ I am a true newbie. I have not owned a mirrorless or DSLR before. I've been a kind of photo 'enthusiast' but never a camera enthusiast and never bothered with buying a DSLR before. Now, with travel in the plans for the next 2 years (7 trips across multiple continents with my SO and young son), it felt like the right time to buy a really good camera. Did my research and since budget wasn't really a problem, I decided to buy a Sony A7RIII. I'm set to place the order today and hopefully receive it by the end of this month.\n\nFor the lenses, I did my research and I thought that I would get the Sony FE 24-70mm f/2.8 GM simply because I thought that I would get one lens that does most of \"what I need\". There was a myriad of options in different categories (Prime, Wide angle, Zoom, Portrait) and I thought buying something that would somewhat cater to multiple things is a good thing. That said, it costs $2200 and while I can afford it, I also want to ensure that I'm buying something that I can use for a decade or more instead at that cost. That's when I had a second thought: why not buy multiple cheap lens that does one thing only without the GM tag. This way, I get to 'build' my lens kit, experimenting with different lenses and learning the proper way AND ensuring that I make informed purchases on the lenses in the future.\n\nThe purpose of buying the camera is mostly to do portraits (family) - 40%, scenery (some landscape) - 30% and locations (wide angle) - 30%. I am wondering if I should buy one thing that fits most of what I need well or buy cheaper lens that does one function (without OSS or GM tag) and build my way. \n\nI would appreciate any recommendations that I can get. Thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8l9a1i/true_newbie_here_need_recommendation_for_my_first/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "true newbie here. need recommendation for my first a7riii lens /!/ i am a true newbie. i have not owned a mirrorless or dslr before. i've been a kind of photo 'enthusiast' but never a camera enthusiast and never bothered with buying a dslr before. now, with travel in the plans for the next 2 years (7 trips across multiple continents with my so and young son), it felt like the right time to buy a really good camera. did my research and since budget wasn't really a problem, i decided to buy a sony a7riii. i'm set to place the order today and hopefully receive it by the end of this month.\n\nfor the lenses, i did my research and i thought that i would get the sony fe 24-70mm f/2.8 gm simply because i thought that i would get one lens that does most of \"what i need\". there was a myriad of options in different categories (prime, wide angle, zoom, portrait) and i thought buying something that would somewhat cater to multiple things is a good thing. that said, it costs $2200 and while i can afford it, i also want to ensure that i'm buying something that i can use for a decade or more instead at that cost. that's when i had a second thought: why not buy multiple cheap lens that does one thing only without the gm -----> tag !!! . this way, i get to 'build' my lens kit, experimenting with different lenses and learning the proper way and ensuring that i make informed purchases on the lenses in the future.\n\nthe purpose of buying the camera is mostly to do portraits (family) - 40%, scenery (some landscape) - 30% and locations (wide angle) - 30%. i am wondering if i should buy one thing that fits most of what i need well or buy cheaper lens that does one function (without oss or gm tag) and build my way. \n\ni would appreciate any recommendations that i can get. thanks in advance!", "sortedWord": "None", "identifyer": 31573, "year": "2018"}, {"Unnamed: 0": 236952, "autor": "AgThunderbird", "date": 1519904861000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - March 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; **GEOMETRY**\n\nSelected by our winner from [February](https://www.reddit.com/r/SonyAlpha/comments/7ui8w6/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/simon_lc. The winning shot, [Old Montreal](https://i.imgur.com/uy1CsFF.jpg).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/814opn/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - march 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; **geometry**\n\nselected by our winner from [february](https://www.reddit.com/r/sonyalpha/comments/7ui8w6/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/simon_lc. the winning shot, [old montreal](https://i.imgur.com/uy1csff.jpg).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 32043, "year": "2018"}, {"Unnamed: 0": 237152, "autor": "AgThunderbird", "date": 1533126905000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - August 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; ** **\n\nWill be Selected by our winner from [July](https://www.reddit.com/r/SonyAlpha/comments/8v96el/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/limache. The winning photo [construction] (https://i.imgur.com/2zS7y2E.jpg).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/93okcm/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - august 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; ** **\n\nwill be selected by our winner from [july](https://www.reddit.com/r/sonyalpha/comments/8v96el/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/limache. the winning photo [construction] (https://i.imgur.com/2zs7y2e.jpg).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 32244, "year": "2018"}, {"Unnamed: 0": 237344, "autor": "AgThunderbird", "date": 1541073374000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - November 2018 Let's Make Some Art! /!/ So much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;#x200B;\n\nTag your photos on Instagram with our hashtag #redditsonyalpha\n\n&amp;#x200B;\n\nThis month's theme -----&gt; \n\nWill be Selected by our winner from [October](https://www.reddit.com/r/SonyAlpha/comments/9kfx1i/sony_alpha_monthly_photo_inspiration_theme_thread/),  [2CharlieTango](https://www.reddit.com/user/2CharlieTango). The winning photo, [Laurel Mountain](https://imgur.com/jMgroHr).\n\n&amp;#x200B;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\n&amp;#x200B;\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n&amp;#x200B;\n\n \n\n**Guidelines:**\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9t8qu7/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - november 2018 let's make some art! /!/ so much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;#x200b;\n\n-----> tag !!!  your photos on instagram with our hashtag #redditsonyalpha\n\n&amp;#x200b;\n\nthis month's theme -----&gt; \n\nwill be selected by our winner from [october](https://www.reddit.com/r/sonyalpha/comments/9kfx1i/sony_alpha_monthly_photo_inspiration_theme_thread/),  [2charlietango](https://www.reddit.com/user/2charlietango). the winning photo, [laurel mountain](https://imgur.com/jmgrohr).\n\n&amp;#x200b;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\n&amp;#x200b;\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n&amp;#x200b;\n\n \n\n**guidelines:**\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.", "sortedWord": "None", "identifyer": 32439, "year": "2018"}, {"Unnamed: 0": 239520, "autor": "AgThunderbird", "date": 1527856283000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - June 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; ** **\n\nWill be Selected by our winner from [May](https://www.reddit.com/r/SonyAlpha/comments/8g7yj2/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/DeliciousGorilla. The winning video ... yes video, [Minolta Trio](https://vimeo.com/269498341).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/8nribv/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - june 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; ** **\n\nwill be selected by our winner from [may](https://www.reddit.com/r/sonyalpha/comments/8g7yj2/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/deliciousgorilla. the winning video ... yes video, [minolta trio](https://vimeo.com/269498341).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 34651, "year": "2018"}, {"Unnamed: 0": 239563, "autor": "v79k", "date": 1527769702000, "content": "What camera should I think of getting? /!/ Hey guys, I'm starting to get into photography again and want to start taking it seriously. I really enjoy Sony system and how it works. I would like work to look professional without the hefty price tag.  \nAll in all was looking for the best camera for around $1,000 \\- 1,500 range, and a camera which would be an all rounder in photography and videography.   \nAny key pointers in what camera/s I should be looking at?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8ni0fv/what_camera_should_i_think_of_getting/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what camera should i think of getting? /!/ hey guys, i'm starting to get into photography again and want to start taking it seriously. i really enjoy sony system and how it works. i would like work to look professional without the hefty price -----> tag !!! .  \nall in all was looking for the best camera for around $1,000 \\- 1,500 range, and a camera which would be an all rounder in photography and videography.   \nany key pointers in what camera/s i should be looking at?", "sortedWord": "None", "identifyer": 34694, "year": "2018"}, {"Unnamed: 0": 240599, "autor": "kazuma_san", "date": 1519701998000, "content": "so A7iii is basically a better A7Riii? /!/ A7III is finally announced, and I have very mixed feelings...\n\nTheres not much (one) review for A7iii out there now, but from the specs, is A7iii just down right better than A7Riii? \nAfter doing some quick comparisons, A7iii is on par if not better than A7Riii in almost every aspect...\n\nSharing some of my findings here: \nWhere A7iii &gt; A7Riii : \n\n* Better focus system (693 phase detection with 93% coverage vs 399 phase detection with 68% coverage)\n\n* Better (more efficient) battery life since they use the same battery (710 shots vs 650 shots)\n\n* Better 4k video quality (downsample from 6k vs downsample from 5k)\n\n* Better continuous shooting, 40 un-compressed raw vs 26\n\n* MAYBE better ISO performance? 100-51200(Extended Mode: 50-204800) vs 100-32000 (Extended Mode: 50-102400) and it has a larger pixel size which usually means better signal to noise ratio\n\n* Much cheaper than A7Riii by $1100\n\nWhere A7Riii &gt; A7iii:\n\n* Resolution, 42.4 effective MP vs 24.2 effective MP\n\n* Better EVF, 3.6MP(0.78x) vs 2.3MP(0.78x)\n\n* Better touch screen, 3.6MP vs 2.3MP\n\n* Pixel Shift Multi-shot\n\nFor the rest of the feature, A7iii gets the same upgrades as A7Riii (dual card slot, 10fps, no low-pass, weather sealing...etc)\n\nPerhaps I am a bit quick to judge, (for example, more phase focus point doesnt mean better AF...?) But it seems to me that unless someone needs the resolution of 42MP, A7iii is the better camera with cheaper price tag. Happy to get some input and discuss.\n\n\nBy the way... I just recently bought A7Riii so yes I am a bit salty :'(\n\nedit: formatting", "link": "https://www.reddit.com/r/SonyAlpha/comments/80j8a7/so_a7iii_is_basically_a_better_a7riii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "so a7iii is basically a better a7riii? /!/ a7iii is finally announced, and i have very mixed feelings...\n\ntheres not much (one) review for a7iii out there now, but from the specs, is a7iii just down right better than a7riii? \nafter doing some quick comparisons, a7iii is on par if not better than a7riii in almost every aspect...\n\nsharing some of my findings here: \nwhere a7iii &gt; a7riii : \n\n* better focus system (693 phase detection with 93% coverage vs 399 phase detection with 68% coverage)\n\n* better (more efficient) battery life since they use the same battery (710 shots vs 650 shots)\n\n* better 4k video quality (downsample from 6k vs downsample from 5k)\n\n* better continuous shooting, 40 un-compressed raw vs 26\n\n* maybe better iso performance? 100-51200(extended mode: 50-204800) vs 100-32000 (extended mode: 50-102400) and it has a larger pixel size which usually means better signal to noise ratio\n\n* much cheaper than a7riii by $1100\n\nwhere a7riii &gt; a7iii:\n\n* resolution, 42.4 effective mp vs 24.2 effective mp\n\n* better evf, 3.6mp(0.78x) vs 2.3mp(0.78x)\n\n* better touch screen, 3.6mp vs 2.3mp\n\n* pixel shift multi-shot\n\nfor the rest of the feature, a7iii gets the same upgrades as a7riii (dual card slot, 10fps, no low-pass, weather sealing...etc)\n\nperhaps i am a bit quick to judge, (for example, more phase focus point doesnt mean better af...?) but it seems to me that unless someone needs the resolution of 42mp, a7iii is the better camera with cheaper price -----> tag !!! . happy to get some input and discuss.\n\n\nby the way... i just recently bought a7riii so yes i am a bit salty :'(\n\nedit: formatting", "sortedWord": "None", "identifyer": 35744, "year": "2018"}, {"Unnamed: 0": 240855, "autor": "AgThunderbird", "date": 1514808892000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - January 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; **DRAMATIC LIGHTING**\n\nSelected by our winner from [December](https://www.reddit.com/r/SonyAlpha/comments/7gueoy/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/five2270photography. The [winning shot](https://www.instagram.com/p/BcnuZpGF_P6/).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/7nevh8/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - january 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; **dramatic lighting**\n\nselected by our winner from [december](https://www.reddit.com/r/sonyalpha/comments/7gueoy/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/five2270photography. the [winning shot](https://www.instagram.com/p/bcnuzpgf_p6/).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 36003, "year": "2018"}, {"Unnamed: 0": 242521, "autor": "AgThunderbird", "date": 1538397217000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - October 2018 /!/ \\## \\*\\*Let's Make Some Art!\\*\\*\n\n&amp;#x200B;\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;#x200B;\n\n\\&amp;nbsp;\n\n&amp;#x200B;\n\nTag your photos on Instagram with our hashtag \\*\\*\\\\#redditsonyalpha\\*\\*\n\n&amp;#x200B;\n\n\\&amp;nbsp;\n\n&amp;#x200B;\n\nThis month's theme -----&gt; \\*\\* \\*\\*\n\n&amp;#x200B;\n\nWill be Selected by our winner from \\[September\\]([https://www.reddit.com/r/SonyAlpha/comments/9c2drs/sony\\_alpha\\_monthly\\_photo\\_inspiration\\_theme\\_thread/](https://www.reddit.com/r/SonyAlpha/comments/9c2drs/sony_alpha_monthly_photo_inspiration_theme_thread/)), /u/[**hautepocket**](https://www.reddit.com/user/hautepocket). The winning photo \\[In the Mainframe\\] ([h](https://i.redd.it/rq6i4jrg4id11.jpg)[https://www.instagram.com/p/Bnl3Jb0lhk0/?taken-by=chr\\_street](https://www.instagram.com/p/Bnl3Jb0lhk0/?taken-by=chr_street)).\n\n&amp;#x200B;\n\n\\&amp;nbsp;\n\n&amp;#x200B;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\n&amp;#x200B;\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n&amp;#x200B;\n\n\\## Guidelines:\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\* Share only one photo per month, please.\n\n\\* All photos must be taken during this month.\n\n\\* If you post a photo, please comment on at least two others.\n\n\\* Keep all comments constructive and civil.\n\n\\* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;#x200B;\n\n\\&amp;nbsp;\n\n&amp;#x200B;\n\n\\*\\*\\*\n\n&amp;#x200B;\n\nThe Sony E Mount Lens Lineup List is found on our \\[wiki\\]([https://www.reddit.com/r/SonyAlpha/wiki/lens/emount](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount))", "link": "https://www.reddit.com/r/SonyAlpha/comments/9kfx1i/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - october 2018 /!/ \\## \\*\\*let's make some art!\\*\\*\n\n&amp;#x200b;\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;#x200b;\n\n\\&amp;nbsp;\n\n&amp;#x200b;\n\n-----> tag !!!  your photos on instagram with our hashtag \\*\\*\\\\#redditsonyalpha\\*\\*\n\n&amp;#x200b;\n\n\\&amp;nbsp;\n\n&amp;#x200b;\n\nthis month's theme -----&gt; \\*\\* \\*\\*\n\n&amp;#x200b;\n\nwill be selected by our winner from \\[september\\]([https://www.reddit.com/r/sonyalpha/comments/9c2drs/sony\\_alpha\\_monthly\\_photo\\_inspiration\\_theme\\_thread/](https://www.reddit.com/r/sonyalpha/comments/9c2drs/sony_alpha_monthly_photo_inspiration_theme_thread/)), /u/[**hautepocket**](https://www.reddit.com/user/hautepocket). the winning photo \\[in the mainframe\\] ([h](https://i.redd.it/rq6i4jrg4id11.jpg)[https://www.instagram.com/p/bnl3jb0lhk0/?taken-by=chr\\_street](https://www.instagram.com/p/bnl3jb0lhk0/?taken-by=chr_street)).\n\n&amp;#x200b;\n\n\\&amp;nbsp;\n\n&amp;#x200b;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\n&amp;#x200b;\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n&amp;#x200b;\n\n\\## guidelines:\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\* share only one photo per month, please.\n\n\\* all photos must be taken during this month.\n\n\\* if you post a photo, please comment on at least two others.\n\n\\* keep all comments constructive and civil.\n\n\\* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;#x200b;\n\n\\&amp;nbsp;\n\n&amp;#x200b;\n\n\\*\\*\\*\n\n&amp;#x200b;\n\nthe sony e mount lens lineup list is found on our \\[wiki\\]([https://www.reddit.com/r/sonyalpha/wiki/lens/emount](https://www.reddit.com/r/sonyalpha/wiki/lens/emount))", "sortedWord": "None", "identifyer": 37703, "year": "2018"}, {"Unnamed: 0": 243533, "autor": "MaxMunsta", "date": 1529082040000, "content": "Looking to Get into Photography: Sony A6000 or Nikon/Canon Option? /!/ Hey everyone,\n\nI'm pretty new to \"high-end\"/not-a-smartphone photography and I was wondering if you guys could shed some light on the Sony options that are out there and if my purchasing thought process is correct.\n\nOver the past month or so I have been doing some pretty intense research about entry level and more affordable DSLRs. This originally led me to consider purchasing the Canon T7i and Nikon D5600. However, after watching Tony and Chelsea Northrup's camera brand history videos and considering where Sony, Nikon, and Canon are heading, it seems like Sony is more poised to dedicate itself to camera innovation, where as Nikon and Canon are looking elsewhere. When I asked myself if I would personally invest in Nikon, Canon, or Sony, the answer was Sony.\n\nThis, in turn, made me take a look at the Sony options that were in my price range. The A6000 looks pretty appealing. The size, image quality, and auto-focusing speed all look really good, but I saw some issues with the kit lens ceasing to function and an issue with overheating. If I plan to take my new camera with me when travelling, would I have to worry about technical issues that would tank my photography for an entire trip? Does the A7 (base model) have the same issues?\n\nFurthermore, it seems as if the world of Zeiss glass is pretty inaccessible to a beginner. Have any of you found the price of Sony lenses to be especially prohibitive, our should I not even worry about this issue as a beginner?\n\nI know this post is getting really long winded, so I'll wrap it up with a bit of a TL;DR. As a beginner do I purchase a Sony A6K or A7 for size, image quality, and the potential for future innovation by Sony, or do I purchase a T7i/D5600 for reliability and lens ecosystem?\n\nI really appreciate any replies, and I hope you guys can understand my need to make a really educated decision. $600-$800 is not a small price tag for me, and I'd rather not get hit by a freight train of buyer's remorse.\n\nThanks again,\n\nMax", "link": "https://www.reddit.com/r/SonyAlpha/comments/8rcizu/looking_to_get_into_photography_sony_a6000_or/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking to get into photography: sony a6000 or nikon/canon option? /!/ hey everyone,\n\ni'm pretty new to \"high-end\"/not-a-smartphone photography and i was wondering if you guys could shed some light on the sony options that are out there and if my purchasing thought process is correct.\n\nover the past month or so i have been doing some pretty intense research about entry level and more affordable dslrs. this originally led me to consider purchasing the canon t7i and nikon d5600. however, after watching tony and chelsea northrup's camera brand history videos and considering where sony, nikon, and canon are heading, it seems like sony is more poised to dedicate itself to camera innovation, where as nikon and canon are looking elsewhere. when i asked myself if i would personally invest in nikon, canon, or sony, the answer was sony.\n\nthis, in turn, made me take a look at the sony options that were in my price range. the a6000 looks pretty appealing. the size, image quality, and auto-focusing speed all look really good, but i saw some issues with the kit lens ceasing to function and an issue with overheating. if i plan to take my new camera with me when travelling, would i have to worry about technical issues that would tank my photography for an entire trip? does the a7 (base model) have the same issues?\n\nfurthermore, it seems as if the world of zeiss glass is pretty inaccessible to a beginner. have any of you found the price of sony lenses to be especially prohibitive, our should i not even worry about this issue as a beginner?\n\ni know this post is getting really long winded, so i'll wrap it up with a bit of a tl;dr. as a beginner do i purchase a sony a6k or a7 for size, image quality, and the potential for future innovation by sony, or do i purchase a t7i/d5600 for reliability and lens ecosystem?\n\ni really appreciate any replies, and i hope you guys can understand my need to make a really educated decision. $600-$800 is not a small price -----> tag !!!  for me, and i'd rather not get hit by a freight train of buyer's remorse.\n\nthanks again,\n\nmax", "sortedWord": "None", "identifyer": 38736, "year": "2018"}, {"Unnamed: 0": 243594, "autor": "cloudywolf2288", "date": 1534438642000, "content": "The Truth About GMASTER 24-70mm /!/ Hello follow Sony shooters,\n\nI have 24-70mm GMASTER. I am currently on the fence about keeping it or selling it. \n\nI want to know peoples opinions on what they truly think of the lens. \n\nDo the people who own an 24-70 GM, what do you think of it? Is the price tag worth the lens? Should I downgrade to a cheaper lens? What separates this 24-70mm from other company 24-70mm? \n\nThanks friends!", "link": "https://www.reddit.com/r/SonyAlpha/comments/97u12y/the_truth_about_gmaster_2470mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "the truth about gmaster 24-70mm /!/ hello follow sony shooters,\n\ni have 24-70mm gmaster. i am currently on the fence about keeping it or selling it. \n\ni want to know peoples opinions on what they truly think of the lens. \n\ndo the people who own an 24-70 gm, what do you think of it? is the price -----> tag !!!  worth the lens? should i downgrade to a cheaper lens? what separates this 24-70mm from other company 24-70mm? \n\nthanks friends!", "sortedWord": "None", "identifyer": 38797, "year": "2018"}, {"Unnamed: 0": 246945, "autor": "MafHoney", "date": 1540743761000, "content": "The Sigma 19mm is really a great option if you want a wider angle lens without a huge price tag.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9s4eam/the_sigma_19mm_is_really_a_great_option_if_you/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "the sigma 19mm is really a great option if you want a wider angle lens without a huge price -----> tag !!! .", "sortedWord": "None", "identifyer": 42218, "year": "2018"}, {"Unnamed: 0": 247511, "autor": "AgThunderbird", "date": 1535801347000, "content": "Sony Alpha Monthly Photo Inspiration Theme Thread - September 2018 /!/ ## **Let's Make Some Art!**\n\nSo much of our subreddit involves gear discussion or reviews. That's fine, of course, since there is  lot of new gear each month in the Sony Alpha universe. But we all got into photography not just to spend money on cameras and lenses, but to take photos. We hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\nTag your photos on Instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nThis month's theme -----&gt; ** **\n\nWill be selected by our winner from [August](https://www.reddit.com/r/SonyAlpha/comments/93okcm/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/We_Major. The winning photo [Milky Way Rise] (https://i.redd.it/rq6i4jrg4id11.jpg).\n\n&amp;nbsp;\n\nAll photos must involve the the month's theme in some way. It can be in a portrait, macro, street, abstract, other photo style ... you name it. Share your SOOC jpg or go crazy with post processing ... your choice. The photo shared must, of course, be taken with a Sony Alpha camera, a legacy Minolta A-mount camera, or our spiritual cousins in the Sony RX series. Let us know the gear you used for your shot so that we can give appropriate dap.\n\nAll of us win just for shooting this month with this theme in mind and for participating in this thread. But the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. And, of course, the prestige.\n\n## Guidelines:\n\n\n* Share only one photo per month, please.\n* All photos must be taken during this month.\n* If you post a photo, please comment on at least two others.\n* Keep all comments constructive and civil.\n* It doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nThe Sony E Mount Lens Lineup List is found on our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount)", "link": "https://www.reddit.com/r/SonyAlpha/comments/9c2drs/sony_alpha_monthly_photo_inspiration_theme_thread/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony alpha monthly photo inspiration theme thread - september 2018 /!/ ## **let's make some art!**\n\nso much of our subreddit involves gear discussion or reviews. that's fine, of course, since there is  lot of new gear each month in the sony alpha universe. but we all got into photography not just to spend money on cameras and lenses, but to take photos. we hope that this thread will everyone an extra excuse to pull the camera of the bag this month.\n\n&amp;nbsp;\n\n-----> tag !!!  your photos on instagram with our hashtag **\\#redditsonyalpha**\n\n&amp;nbsp;\n\nthis month's theme -----&gt; ** **\n\nwill be selected by our winner from [august](https://www.reddit.com/r/sonyalpha/comments/93okcm/sony_alpha_monthly_photo_inspiration_theme_thread/), /u/we_major. the winning photo [milky way rise] (https://i.redd.it/rq6i4jrg4id11.jpg).\n\n&amp;nbsp;\n\nall photos must involve the the month's theme in some way. it can be in a portrait, macro, street, abstract, other photo style ... you name it. share your sooc jpg or go crazy with post processing ... your choice. the photo shared must, of course, be taken with a sony alpha camera, a legacy minolta a-mount camera, or our spiritual cousins in the sony rx series. let us know the gear you used for your shot so that we can give appropriate dap.\n\nall of us win just for shooting this month with this theme in mind and for participating in this thread. but the taker of the \"winning\" photo, as determined by upvotes, gets to decide the inspiration theme for next month. and, of course, the prestige.\n\n## guidelines:\n\n\n* share only one photo per month, please.\n* all photos must be taken during this month.\n* if you post a photo, please comment on at least two others.\n* keep all comments constructive and civil.\n* it doesn't matter if you're new to photography or a seasoned veteran, just share and learn from each other how to make better art.\n\n&amp;nbsp;\n\n***\n\nthe sony e mount lens lineup list is found on our [wiki](https://www.reddit.com/r/sonyalpha/wiki/lens/emount)", "sortedWord": "None", "identifyer": 42801, "year": "2018"}, {"Unnamed: 0": 247701, "autor": "chrizyo", "date": 1535233597000, "content": "Upgrading to FF from A6000 /!/ Hi guys,\n\nI'm currently thinking about upgrading my gear from a A6000 to a FF body. I've been using the A6000 for 6 months now, since I started getting into photography again, and I have to say I'm really impressed by what it does for the price. But when I decided to start picking up photography as a hobby I mainly bought the A6000 for budget reasons, since I first wanted to see if the hobby sticks before I put more money on the table. \n\nI have a professional background in computer graphics, which basically means I've been photographing in the \"virtual space\" for 15 years now, but real-life photography enabled me to leave the house a lot more, so I really want to stick with it and expand my possibilites with my gear.\n\nNow I find myself debating over what would be the next logical step to upgrade to. I mainly shoot a mixture of architecture, landscape, portrait and some street photography. Wildlife and more action-oriented themes like sports are not really my main concern.\n\nI've been seriously eyeing the a7iii, and I'm 100% sure it would be a great camera to use, but I'm not sure yet if it's worth the price tag for me personally. \n\nSome of my key factors for considering going FF (especially the a7iii) are low light capability, IBIS, overall improvement in IQ, weather proofing and the general FF look.\n\nWhat's putting me off a bit is the fact that I'm quite happy with the lens setup I've assembled over the last few months and that it proved quite challenging so far to find some reasonably priced alternatives.\n\nMy current lenses that I frequently use are:\n\n12mm 2.0 Rokinon/Samyang\n\n19mm 2.8 Sigma Art AF DN\n\n50mm 1.4 Canon FD adapted\n\n135mm 2.8 Canon FD adapted\n\nSince my style is not really action-oriented I really enjoy using manual focus lenses, especially those vintage Canon's are a real joy to use, and I would definitely keep those also for FF. The 135mm would probably even of more use to me, due to the missing crop factor on FF.\n\nThis would leave me in the market for a \\~85mm portrait lens and a \\~15-20mm Wide Angle lens. The 85mm range should be fairly easy to cover, but the wide angle lens is giving me some headaches. I really like the Samyang I currently have, but for their FF lenses it seems the build quality isn't quite up to snuff from what I have gathered so far. A vintage Canon 20mm 2.8 also costs about 350€, but probably won't match the 12mm 2.0 in terms of quality. So I'm a bit lost here - the Sony 16-35 4.0 would be an alternative, because for the price it could cover the need of a second additional lens &amp; some other goodies, but I've been reading also some varying opinions about it. Any alternatives?\n\nBut before I'm rambling on much further - is it even worth to upgrade or am I just lusting for gear?\n\nWould love to hear your opinions!\n\nBest", "link": "https://www.reddit.com/r/SonyAlpha/comments/9aag2u/upgrading_to_ff_from_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "upgrading to ff from a6000 /!/ hi guys,\n\ni'm currently thinking about upgrading my gear from a a6000 to a ff body. i've been using the a6000 for 6 months now, since i started getting into photography again, and i have to say i'm really impressed by what it does for the price. but when i decided to start picking up photography as a hobby i mainly bought the a6000 for budget reasons, since i first wanted to see if the hobby sticks before i put more money on the table. \n\ni have a professional background in computer graphics, which basically means i've been photographing in the \"virtual space\" for 15 years now, but real-life photography enabled me to leave the house a lot more, so i really want to stick with it and expand my possibilites with my gear.\n\nnow i find myself debating over what would be the next logical step to upgrade to. i mainly shoot a mixture of architecture, landscape, portrait and some street photography. wildlife and more action-oriented themes like sports are not really my main concern.\n\ni've been seriously eyeing the a7iii, and i'm 100% sure it would be a great camera to use, but i'm not sure yet if it's worth the price -----> tag !!!  for me personally. \n\nsome of my key factors for considering going ff (especially the a7iii) are low light capability, ibis, overall improvement in iq, weather proofing and the general ff look.\n\nwhat's putting me off a bit is the fact that i'm quite happy with the lens setup i've assembled over the last few months and that it proved quite challenging so far to find some reasonably priced alternatives.\n\nmy current lenses that i frequently use are:\n\n12mm 2.0 rokinon/samyang\n\n19mm 2.8 sigma art af dn\n\n50mm 1.4 canon fd adapted\n\n135mm 2.8 canon fd adapted\n\nsince my style is not really action-oriented i really enjoy using manual focus lenses, especially those vintage canon's are a real joy to use, and i would definitely keep those also for ff. the 135mm would probably even of more use to me, due to the missing crop factor on ff.\n\nthis would leave me in the market for a \\~85mm portrait lens and a \\~15-20mm wide angle lens. the 85mm range should be fairly easy to cover, but the wide angle lens is giving me some headaches. i really like the samyang i currently have, but for their ff lenses it seems the build quality isn't quite up to snuff from what i have gathered so far. a vintage canon 20mm 2.8 also costs about 350€, but probably won't match the 12mm 2.0 in terms of quality. so i'm a bit lost here - the sony 16-35 4.0 would be an alternative, because for the price it could cover the need of a second additional lens &amp; some other goodies, but i've been reading also some varying opinions about it. any alternatives?\n\nbut before i'm rambling on much further - is it even worth to upgrade or am i just lusting for gear?\n\nwould love to hear your opinions!\n\nbest", "sortedWord": "None", "identifyer": 42993, "year": "2018"}], "name": "tagSonyAlpha2018"}