{"interestingcomments": [{"autor": "sherpa_pat", "date": "2019-10-21 01:12:53", "content": "Sold my X Vario... /!/ I sold my X Vario yesterday. It was my first and, so far, only Leica. It served me well for the last 5 years, so I think it’s time for a little retrospective. Consider this a long-term review. This is a bit long and also could be considered my first camera review.\n\nI bought the XV in 2014 to supplement my Canon 30D w/35L &amp; 70-200 f/4. The goal was to get a camera that was more portable and to get out of the mindset of constantly chasing new lenses. For what I wanted, the XV filled the the niche perfectly with its small size and versatile zoom range. To this point, it ultimately replaced my 30D. In the early days I would shoot with both, but the Canon gear stopped getting brought along on my outings or travel due to its cumbersome size. An important factor for my choice of the XV, and ultimately its continued use, was fully manual controls that are easily accessible. Early on, I bought the Olympus VF-2 and found that the optional EVF was a must. I rarely ever shot using the LCD screen. I found myself tilting the EVF 90 degrees and looking down for a lot of photos. By resting the camera in front of my chest, I could be very steady and get a slightly different point of view. I don’t have statistics, but an overwhelming majority of my photos were taken this way. The EVF also allows you to easily get low to the ground. The occasional self-timer group shot was also made easy to compose by laying the camera down on any surface and using the tiltable EVF.\n\nWhat I didn’t expect from the XV was how amazing colours, light and shadows would be rendered compared to the Canon. I had researched the XV extensively prior to buying it and looked at many images others had taken with the camera, but it was a bit of a revelation in how much the camera took away from post processing work. Images just immediately “popped” with beautiful contrast and saturation, without being excessive. I still get blown away by results from the little guy 5 years later. (Shameless plug, you can see my recent images from a trip to Vancouver with the XV to get a taste of those colours https://www.instagram.com/p.mg.ee/ ). An unintended aspect of this was that I started getting drawn to scenes with colours and light that favoured the XV. I would get excited when I saw these scenes.\n\nFor my photographic journey, the XV made me slow down and focus on composing the entire frame. I didn’t realize how I previously used depth of field as a crutch, especially with the 35L. The XV, with its often criticized lack of wide aperture (f/3.5-6.4 on a FF equivalent 28-70mm), doesn’t allow for much use of bokeh as an artistic tool. That said, the XV does, under the right circumstances, render out of focus areas quite nicely. It has pleasing bokeh. Through my forced change in photographic perspective, I developed a love for facades and architectural photos of cities. The XV is very strong for this use and produced consistent results when used in manual focus mode.\n\nOverall, I think the XV made me a better photographer and in general I’ve been overwhelmingly pleased with my results. I’m glad I got to use this camera.\n\n\nMy XV also had a number of issues... Which ultimately led to my decision to sell it now. I’d like to detail them for prospective buyers of the XV.\n\nI feel like its age was showing with the overall slow operation and startup time. Even on my first day with the XV, I was surprised that my 30D from 2006 was a faster operating camera than the XV. Today, the difference feels even worse, which is hard to believe. Electronically, my 30D has felt more consistent — I still have it, even though hasn’t gotten much use lately, it still functions like it did when I got it in 2009. I don’t have any other cameras to benchmark so it’s the only comparison I can make. Pre-focusing manually can help speed up the camera when taking photos as shutter lag isn’t too bad when AF isn’t required. Because the XV lens is a zoom, there aren’t any guides for zone focusing, so a bit of trial and error pays off for those moments it’s needed.\n\nThe flimsy battery latch broke twice and I didn’t bother repairing it the second time. The battery door will hold the battery in place, one just needs to be careful not to drop the battery out when opening the door. \n\nThere’s sensor dust that somehow accumulated inside and it would require a Leica CLA to remove the dust. At this point, it didn’t seem to be worth the cost so I just kept cloning out the bad spots whenever they were visible in a scene.\n\nThe EVF screen displays a review of the latest shot for far too long. This is akin to SLR shutter blackout, but much worse. It often feels like the image review is frozen (see http://www.waloszek.de/lxv_func_err_e.php#auto_review for an explanation on this phenomenon). For some reason Leica never corrected this with a firmware update. It didn’t ruin the camera and I still consider it quite good for the type of photography I did with the XV, but it’s certainly disappointing it wasn’t fixed. Recently, I would change the shutter or aperture settings between shots and the camera frustratingly wouldn’t register these changes. I suspect this was related to the frozen review issue. \n\nThe manual focus mode, while useful, wasn’t exactly to my liking. It worked well in static settings and macro, but was difficult to work with when taking images of people. Unfortunately, the AF would occasionally misfocus entirely resulting in bad and often unusable images. Not to get into a debate on user error vs equipment, there are intermittent focusing problems with the XV that are fairly well detailed on the web. In my experience, they are true. It’s possible that this isn’t consistent from camera to camera. One has to expect a few duds through a day of shooting the XV due to focus issues, so take care to review your work in the field. Unfortunately, this is not always possible with photos of people. The moment is gone. Ultimately, this AF behaviour was unlike my extensive experience with the 30D that I used primarily in servo mode with back button focusing. I would burst shoot and pick the best image in post. The XV didn’t lend itself well to this type of continuous shooting. This per se isn’t a knock against the XV, they are completely different cameras and need to be worked differently. It did teach me to better anticipate moments with people.\n\n\nShould you get an X Vario in 2019? I think it’s hard to provide a resounding yes when there are a lot of options out there to consider. I haven’t done research on the competition and I haven’t used other cameras in its class to provide a definite answer. In a way, I wish I could have kept it, but I needed to sell it to fund my next camera. The XV still captures great images and I think in some ways I will miss it. If you can live with its quirks or faults, and you find it at a good price I can then recommend it.", "link": "https://www.reddit.com/r/Leica/comments/dkszw3/sold_my_x_vario/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "sold my x vario... /!/ i sold my x vario yesterday. it was my first and, so far, only leica. it served me well for the last 5 years, so i think it’s time for a little retrospective. consider this a long-term review. this is a bit long and also could be considered my first camera review.\n\ni bought the xv in 2014 to supplement my canon 30d w/35l &amp; 70-200 f/4. the goal was to get a camera that was more portable and to get out of the mindset of constantly chasing new lenses. for what i wanted, the xv filled the the niche perfectly with its small size and versatile zoom range. to this point, it ultimately replaced my 30d. in the early days i would shoot with both, but the canon gear stopped getting brought along on my outings or travel due to its cumbersome size. an important factor for my choice of the xv, and ultimately its continued use, was fully manual controls that are easily accessible. early on, i bought the olympus vf-2 and found that the optional evf was a must. i rarely ever shot using the lcd screen. i found myself tilting the evf 90 degrees and looking down for a lot of photos. by resting the camera in front of my chest, i could be very steady and get a slightly different point of view. i don’t have statistics, but an overwhelming majority of my photos were taken this way. the evf also allows you to easily get low to the ground. the occasional self-timer group shot was also made easy to compose by laying the camera down on any surface and using the tiltable evf.\n\nwhat i didn’t expect from the xv was how amazing colours, light and shadows would be rendered compared to the canon. i had researched the xv extensively prior to buying it and looked at many images others had taken with the camera, but it was a bit of a revelation in how much the camera took away from post processing work. images just immediately “popped” with beautiful contrast and saturation, without being excessive. i still get blown away by results from the little guy 5 years later. (shameless plug, you can see my recent images from a trip to vancouver with the xv to get a taste of those colours https://www.instagram.com/p.mg.ee/ ). an unintended aspect of this was that i started getting drawn to scenes with colours and light that favoured the xv. i would get excited when i saw these scenes.\n\nfor my photographic journey, the xv made me slow down and focus on composing the entire frame. i didn’t realize how i previously used depth of field as a crutch, especially with the 35l. the xv, with its often criticized lack of wide aperture (f/3.5-6.4 on a ff equivalent 28-70mm), doesn’t allow for much use of bokeh as an artistic tool. that said, the xv does, under the right circumstances, render out of focus areas quite nicely. it has pleasing bokeh. through my forced change in photographic perspective, -----> i !!!  -----> developed !!!  a love for facades and architectural photos of cities. the xv is very strong for this use and produced consistent results when used in manual focus mode.\n\noverall, i think the xv made me a better photographer and in general i’ve been overwhelmingly pleased with my results. i’m glad i got to use this camera.\n\n\nmy xv also had a number of issues... which ultimately led to my decision to sell it now. i’d like to detail them for prospective buyers of the xv.\n\ni feel like its age was showing with the overall slow operation and startup time. even on my first day with the xv, i was surprised that my 30d from 2006 was a faster operating camera than the xv. today, the difference feels even worse, which is hard to believe. electronically, my 30d has felt more consistent — i still have it, even though hasn’t gotten much use lately, it still functions like it did when i got it in 2009. i don’t have any other cameras to benchmark so it’s the only comparison i can make. pre-focusing manually can help speed up the camera when taking photos as shutter lag isn’t too bad when af isn’t required. because the xv lens is a zoom, there aren’t any guides for zone focusing, so a bit of trial and error pays off for those moments it’s needed.\n\nthe flimsy battery latch broke twice and i didn’t bother repairing it the second time. the battery door will hold the battery in place, one just needs to be careful not to drop the battery out when opening the door. \n\nthere’s sensor dust that somehow accumulated inside and it would require a leica cla to remove the dust. at this point, it didn’t seem to be worth the cost so i just kept cloning out the bad spots whenever they were visible in a scene.\n\nthe evf screen displays a review of the latest shot for far too long. this is akin to slr shutter blackout, but much worse. it often feels like the image review is frozen (see http://www.waloszek.de/lxv_func_err_e.php#auto_review for an explanation on this phenomenon). for some reason leica never corrected this with a firmware update. it didn’t ruin the camera and i still consider it quite good for the type of photography i did with the xv, but it’s certainly disappointing it wasn’t fixed. recently, i would change the shutter or aperture settings between shots and the camera frustratingly wouldn’t register these changes. i suspect this was related to the frozen review issue. \n\nthe manual focus mode, while useful, wasn’t exactly to my liking. it worked well in static settings and macro, but was difficult to work with when taking images of people. unfortunately, the af would occasionally misfocus entirely resulting in bad and often unusable images. not to get into a debate on user error vs equipment, there are intermittent focusing problems with the xv that are fairly well detailed on the web. in my experience, they are true. it’s possible that this isn’t consistent from camera to camera. one has to expect a few duds through a day of shooting the xv due to focus issues, so take care to review your work in the field. unfortunately, this is not always possible with photos of people. the moment is gone. ultimately, this af behaviour was unlike my extensive experience with the 30d that i used primarily in servo mode with back button focusing. i would burst shoot and pick the best image in post. the xv didn’t lend itself well to this type of continuous shooting. this per se isn’t a knock against the xv, they are completely different cameras and need to be worked differently. it did teach me to better anticipate moments with people.\n\n\nshould you get an x vario in 2019? i think it’s hard to provide a resounding yes when there are a lot of options out there to consider. i haven’t done research on the competition and i haven’t used other cameras in its class to provide a definite answer. in a way, i wish i could have kept it, but i needed to sell it to fund my next camera. the xv still captures great images and i think in some ways i will miss it. if you can live with its quirks or faults, and you find it at a good price i can then recommend it.", "sortedWord": "None", "Identifyer": null, "identifyer": 14219, "year": "2019"}], "name": "developleica2019"}