{"interestingcomments": [{"autor": "charliebigpot", "date": "2020-01-25 11:48:52", "content": "Any DIY solutions to „fix“ this tiny scratch beneath the A?", "link": "https://www.reddit.com/r/Leica/comments/etpv66/any_diy_solutions_to_fix_this_tiny_scratch/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any -----> diy !!!  solutions to „fix“ this tiny scratch beneath the a?", "sortedWord": "None", "Identifyer": null, "identifyer": 10972, "year": "2020"}, {"autor": "Kisafir", "date": "2020-05-24 21:28:47", "content": "A-la-carte DIY", "link": "https://www.reddit.com/r/Leica/comments/gpxsxf/alacarte_diy/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a-la-carte -----> diy !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 11238, "year": "2020"}, {"autor": "Fenix022", "date": "2020-06-17 21:32:56", "content": "DIY tips for a Leica ever-ready case? /!/ Hi all! I got myself a Leica ever-ready case for my M3, but was kind of disappointed that I could not take off the front part and make it a half-case. Kinda what this guy did [here](https://www.flickr.com/photos/andrew-d/6966677095). Would y'all know of anyone that could do that or any DIY methods to get it done?\n\nThanks!", "link": "https://www.reddit.com/r/Leica/comments/hb0n64/diy_tips_for_a_leica_everready_case/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  tips for a leica ever-ready case? /!/ hi all! i got myself a leica ever-ready case for my m3, but was kind of disappointed that i could not take off the front part and make it a half-case. kinda what this guy did [here](https://www.flickr.com/photos/andrew-d/6966677095). would y'all know of anyone that could do that or any diy methods to get it done?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 11396, "year": "2020"}, {"autor": "Fenix022", "date": "2020-07-26 15:40:54", "content": "Leica M3 with a hard shutter problem /!/ My Leica M3 was working fine until suddenly, the shutter button did not work properly. I have to press really hard in order to take a photo. It works better with a shutter release cable, but still feels like I have to press harder than usual to take a photo. Weirdly enough, if I take out the bottom and the film spool, the shutter button works better.\n\nAny ideas for why this is happening? Would it be an easy DIY fix? Thanks!", "link": "https://www.reddit.com/r/Leica/comments/hy90jo/leica_m3_with_a_hard_shutter_problem/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "leica m3 with a hard shutter problem /!/ my leica m3 was working fine until suddenly, the shutter button did not work properly. i have to press really hard in order to take a photo. it works better with a shutter release cable, but still feels like i have to press harder than usual to take a photo. weirdly enough, if i take out the bottom and the film spool, the shutter button works better.\n\nany ideas for why this is happening? would it be an easy -----> diy !!!  fix? thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 11511, "year": "2020"}, {"autor": "JerrryGergich", "date": "2020-08-15 17:13:20", "content": "WTF is wrong with my M240? (Curiosity at 100%) /!/ Looks like my M240 needs a CLA be jade the rangefinder cam is sticking when I rack focus and prevents the rangefinder patch from moving. \n\nIf I take the lens off and pop it back in place it focuses for a little and then gets stuck again. \n\nTime to send it to DAG cause I don't want to diy a digital M. \n\nHas this ever happened to y'all? Super weird but nothing a servicing can't fix.", "link": "https://www.reddit.com/r/Leica/comments/iab7ko/wtf_is_wrong_with_my_m240_curiosity_at_100/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "wtf is wrong with my m240? (curiosity at 100%) /!/ looks like my m240 needs a cla be jade the rangefinder cam is sticking when i rack focus and prevents the rangefinder patch from moving. \n\nif i take the lens off and pop it back in place it focuses for a little and then gets stuck again. \n\ntime to send it to dag cause i don't want to -----> diy !!!  a digital m. \n\nhas this ever happened to y'all? super weird but nothing a servicing can't fix.", "sortedWord": "None", "Identifyer": null, "identifyer": 12632, "year": "2020"}], "name": "diyleica2020"}