{"interestingcomments": [{"autor": "iAMyourMISTAKE", "date": "2019-09-02 02:39:18", "content": "Contemporary Photography in Vietnam - Looking for resources /!/ Hello r/photography!  \nI am getting ready to submit a preference list of countries for a research project for an Art History Class of mine that will focus on contemporary photography in a country that is not the US. Part of the 10 page paper will be a virtual exhibit of my own creation discussing different photographers in which ever final country I have (I am not worried about this part), but the other part requires a lot of academic resources (between books and journal articles). Many of the sources I find focus on the war. While this will be part of my assignment, this is not at all what I want to focus on as there has been 40 years of development in the world of photography since then.  \n\n\nCan any you point me in direction of resources that talk about and discuss styles and changes of photography in Vietnam over the last 40 years? I have a large minimum on the sources I need to use, and if I can't find more than just a couple I will have to change my country selection:/", "link": "https://www.reddit.com/r/photography/comments/cyj7h5/contemporary_photography_in_vietnam_looking_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my own creation", "selectorShort": "creation", "MarkedSent": "contemporary photography in vietnam - looking for resources /!/ hello r/photography!  \ni am getting ready to submit a preference list of countries for a research project for an art history class of mine that will focus on contemporary photography in a country that is not the us. part of the 10 page paper will be a virtual exhibit of -----> my !!!  -----> own !!!  -----> creation !!!  discussing different photographers in which ever final country i have (i am not worried about this part), but the other part requires a lot of academic resources (between books and journal articles). many of the sources i find focus on the war. while this will be part of my assignment, this is not at all what i want to focus on as there has been 40 years of development in the world of photography since then.  \n\n\ncan any you point me in direction of resources that talk about and discuss styles and changes of photography in vietnam over the last 40 years? i have a large minimum on the sources i need to use, and if i can't find more than just a couple i will have to change my country selection:/", "sortedWord": "None", "Identifyer": null, "identifyer": 7304, "year": "2019"}, {"autor": "ThorDansLaCroix", "date": "2019-09-05 13:00:49", "content": "The most joyful thing one can have is to contemplate oneself as the cause of joy of others. But being envied is a solitary form of reassurance /!/ We photographers, or any creative and art lovers, have a lot in common with those in love with business and money. Despite the criticism and sometimes conflicting attitude among our differences, resulting the feeling of being against each other, we are looking for the same through different means.  \n\n\nEither if we care about it or not we can't deny that society is highly driven by money, status, aesthetics and so. Values, that are things related to the power of influence. The influence to create and the influence of attracting people persuaded to collaborate with us for our creation. Collaboration that others offer as exchange of some of the access to such values, which once acquired enough gives them the power to create and influence.  \n\n\nWe know about people who have the believe that human interaction have only one meaning, and that would be money (which all other values are related to). In this particular perspective, money is what defines you. Your abilities, your brightness, your position in society, your level of access to goods and services and your level of creative power. There is a truth in it, not for natural reasons but for cultural reasons. The only way to survive with an healthy and integrated life balance in today society is through acquiring money (which ironically, the stress and worries related to money often scorn our health and  life balance). The amount of money needed will depend on the values and views of those around you I suppose.  \n\n\nWhat I disagree in this view is about money being the means of every human relation. It's the meaning for social integration at certain level but not the meaning of human interaction. Humans, as any alive organism, strive for survival and according to [Antonio Damasio](https://www.antoniodamasio.com/) such survival is measured by the organism balance. We have the perception of balance through emotion (visible or invisible somatic action and movements in reaction to something that provoked them), meaning that we perceive what causes us joy or irritability (and anything in between) and react according to it. In short, we build emotional defenses against what causes us distress and emotional attachment to what cause us joy in order to maintain a balance for life preservation and perpetuation. Simple living organisms such as insects, mono-cellular and even bacteria don't have consciousness of their emotions (which is not the same as feelings). Only animals who have feelings (mental images) can feel what they emote, which require a more developed nervous system. As Antonio Damasio simplify in a short quote, *\"emotions play in the theater of the body. Feelings play in the theater of the mind\".*  \n\n\nWe can then conclude that the meaning of human interaction is Joy. Even if the job we work with is not joyful, we do it for the payment, normally through monetary earning. Money which bring us a joyful feeling, not because of the money itself but because of the joyful things (and people) we can obtain through it. And the most joyful thing one can have is to contemplate oneself as the cause of joy of others according to Lordon.  \n\n\n*\"Since this \\[joy\\] is renewed as man considers his virtues, or his power of acting, everyone is anxious to tell his own deeds, and show off his powers, both of body and mind.\"* \\- Frédéric Lordon, [Willing Slaves of Capital: Spinoza and Marx on Desire](https://www.goodreads.com/book/show/18112211-willing-slaves-of-capital).  \n\n\nDuring my early adulthood I was often taking the buses in front of the building I used to live. As normally, at least for me, I had always been ignored. Not disrespected but ignored. At least until I started attending a flight attendant course that imposed on me the demand of a very formal looking and behavior. When I left home for the first time wearing suit and tie, in a such elegant and status symbol outfit, was when I noticed I had people attention, servitude and privileged treatment. Bus drivers welcoming with \"good morning sir\", shop attendants looking forwards to serve me first and women who usually would avoid contact and interaction with me were now smiley and approachable. I was the same poor guy as before only that I was in a fancy clothes going to, and returning from, a fancy neighborhood. The talk about the social prejudice in Brazilian society back then was still a kind of taboo among many people (despite today's obviousness), but it was a clear fact I deduced from my experience. Such experience made me feel good about myself, but I could not just ignore the fact that people was treating me based on a believe they have about me that wasn't true, based on my clothes symbolism. A believe on my power of acting, my power of causing others joy, biological and social harmony satisfaction, which they wish to acquire through me.  \n\n\nIn 2008 I arrived in Ireland where I met great photographers and models who, thanks to them, I could learn from, build my portfolio with and get some jobs as photographer through. Over all, excluding some exceptions, we were not looking for money or status in a direct way but have fun, have joy. Models, makeup artists and photographers among other creators were happy to be part of projects for the creativity and joy sake, that consequently helped us in further opportunities in our respective industries. Enjoying and respecting each other work without snobbish attitude, aloofness or competition about who has the privilege to be the joy provider to others but agreeing that we share joy among us, making we all feeling in harmony working with each other, a biological (consequently emotional) and social harmony balance, all offering and acquiring the power of acting from each other, without the monetary gate keeping. Money? it always could be negotiated according to what we could afford. I was paying my bills working in a convenience store which was fine. My time in Ireland was the most joyful and prolific in my life, all that required little money but only trust. I found models searching among university students and I met many people through street photography.  \n\n\nMoney is the value that gives us the power of acting, but we must not forget that the monetary value is not in the money itself but in the power of creation, of acting. This is the joy we are after and to truly obtain such joy it requires trust. Otherwise, the joy of monetary power monopoly creates envy and segregation, consequently social stress. [John Berger](https://en.wikipedia.org/wiki/John_Berger) says that the happiness of being envied is called glamour.  \n\n\n\"Being envied is a solitary form of reassurance. It depends precisely upon *not sharing your experience with those who envy you.* You are observed with interest but you do not observe with interest - if you do, you will become less enviable. In this respect the envied are like bureaucrats; the more impersonal they are, the greater the illusion (for themselves and for others) of their power. The power of the glamorous resides in their supposed happiness: the power of the bureaucrat in his supposed authority.” ― John Berger, [Ways of Seeing](https://www.goodreads.com/book/show/2784.Ways_of_Seeing)  \n\n\nI arrived in Germany with the expectation to continuous the photography life style I had in Ireland but I was wrong about it. Making contacts became rare, everybody is looking for money even though they don't need it. Being able to offer joy through my work became not enough, because people are not interested in sharing joy but in monopolize it through monetary status, using the money status as gate keeping, as trust symbol. Even among models and creators who look for no payment collaborative work, they often are looking for photographers who show to have fancy tools, a dedicated studio in a fix address. It doesn't matter to them the result and the joy of the activity unless it can be provided through monetary status, as the access to a monopolized joy which they can justify their aloofness and segregation.  \n\n\nIt also results on a social fear, a distrust on people who look for joy sharing without segregation, suspicious of them as if they have second intentions, the intention to steal something from you maintained through the monetary gate keeping. Them seen as segregated from the privilege of your monopolistic joy, the ones who lack acting power and consequently have not much to provide as a joy, therefore desperate to take it from you.  \n\n\nModels and photographers seem to compete on their self importance, on who is the joy provider to the other, instead of enjoying it as a joy exchange though helping each other for a same result goal. People are not approachable because of the distrust that strangers attempt of interaction has either monetary or sexual (joyful) goal or is a mad person. The other human interaction attempt can only be about dubious intention of climbing and preserve the intrinsic joy of being the joy provider in a monopolistic status kept through monetary (and sexual) border.  \n\n\nI think the key is empathy and understanding of what really matters, what we are striving for. We are striving for balance that comes with joy. Through such understanding I suppose we can learn the importance of trust and honesty required for us to be able to enjoy life and society together. Because *Being envied is a solitary form of reassurance.*\n\nhttp://www.marciofaustino.com/blog/the-economics-of-joy-or-the-strive-for-balance", "link": "https://www.reddit.com/r/photography/comments/d00i4y/the_most_joyful_thing_one_can_have_is_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "our creation", "selectorShort": "creation", "MarkedSent": "the most joyful thing one can have is to contemplate oneself as the cause of joy of others. but being envied is a solitary form of reassurance /!/ we photographers, or any creative and art lovers, have a lot in common with those in love with business and money. despite the criticism and sometimes conflicting attitude among our differences, resulting the feeling of being against each other, we are looking for the same through different means.  \n\n\neither if we care about it or not we can't deny that society is highly driven by money, status, aesthetics and so. values, that are things related to the power of influence. the influence to create and the influence of attracting people persuaded to collaborate with us for -----> our !!!  -----> creation !!! . collaboration that others offer as exchange of some of the access to such values, which once acquired enough gives them the power to create and influence.  \n\n\nwe know about people who have the believe that human interaction have only one meaning, and that would be money (which all other values are related to). in this particular perspective, money is what defines you. your abilities, your brightness, your position in society, your level of access to goods and services and your level of creative power. there is a truth in it, not for natural reasons but for cultural reasons. the only way to survive with an healthy and integrated life balance in today society is through acquiring money (which ironically, the stress and worries related to money often scorn our health and  life balance). the amount of money needed will depend on the values and views of those around you i suppose.  \n\n\nwhat i disagree in this view is about money being the means of every human relation. it's the meaning for social integration at certain level but not the meaning of human interaction. humans, as any alive organism, strive for survival and according to [antonio damasio](https://www.antoniodamasio.com/) such survival is measured by the organism balance. we have the perception of balance through emotion (visible or invisible somatic action and movements in reaction to something that provoked them), meaning that we perceive what causes us joy or irritability (and anything in between) and react according to it. in short, we build emotional defenses against what causes us distress and emotional attachment to what cause us joy in order to maintain a balance for life preservation and perpetuation. simple living organisms such as insects, mono-cellular and even bacteria don't have consciousness of their emotions (which is not the same as feelings). only animals who have feelings (mental images) can feel what they emote, which require a more developed nervous system. as antonio damasio simplify in a short quote, *\"emotions play in the theater of the body. feelings play in the theater of the mind\".*  \n\n\nwe can then conclude that the meaning of human interaction is joy. even if the job we work with is not joyful, we do it for the payment, normally through monetary earning. money which bring us a joyful feeling, not because of the money itself but because of the joyful things (and people) we can obtain through it. and the most joyful thing one can have is to contemplate oneself as the cause of joy of others according to lordon.  \n\n\n*\"since this \\[joy\\] is renewed as man considers his virtues, or his power of acting, everyone is anxious to tell his own deeds, and show off his powers, both of body and mind.\"* \\- frédéric lordon, [willing slaves of capital: spinoza and marx on desire](https://www.goodreads.com/book/show/18112211-willing-slaves-of-capital).  \n\n\nduring my early adulthood i was often taking the buses in front of the building i used to live. as normally, at least for me, i had always been ignored. not disrespected but ignored. at least until i started attending a flight attendant course that imposed on me the demand of a very formal looking and behavior. when i left home for the first time wearing suit and tie, in a such elegant and status symbol outfit, was when i noticed i had people attention, servitude and privileged treatment. bus drivers welcoming with \"good morning sir\", shop attendants looking forwards to serve me first and women who usually would avoid contact and interaction with me were now smiley and approachable. i was the same poor guy as before only that i was in a fancy clothes going to, and returning from, a fancy neighborhood. the talk about the social prejudice in brazilian society back then was still a kind of taboo among many people (despite today's obviousness), but it was a clear fact i deduced from my experience. such experience made me feel good about myself, but i could not just ignore the fact that people was treating me based on a believe they have about me that wasn't true, based on my clothes symbolism. a believe on my power of acting, my power of causing others joy, biological and social harmony satisfaction, which they wish to acquire through me.  \n\n\nin 2008 i arrived in ireland where i met great photographers and models who, thanks to them, i could learn from, build my portfolio with and get some jobs as photographer through. over all, excluding some exceptions, we were not looking for money or status in a direct way but have fun, have joy. models, makeup artists and photographers among other creators were happy to be part of projects for the creativity and joy sake, that consequently helped us in further opportunities in our respective industries. enjoying and respecting each other work without snobbish attitude, aloofness or competition about who has the privilege to be the joy provider to others but agreeing that we share joy among us, making we all feeling in harmony working with each other, a biological (consequently emotional) and social harmony balance, all offering and acquiring the power of acting from each other, without the monetary gate keeping. money? it always could be negotiated according to what we could afford. i was paying my bills working in a convenience store which was fine. my time in ireland was the most joyful and prolific in my life, all that required little money but only trust. i found models searching among university students and i met many people through street photography.  \n\n\nmoney is the value that gives us the power of acting, but we must not forget that the monetary value is not in the money itself but in the power of creation, of acting. this is the joy we are after and to truly obtain such joy it requires trust. otherwise, the joy of monetary power monopoly creates envy and segregation, consequently social stress. [john berger](https://en.wikipedia.org/wiki/john_berger) says that the happiness of being envied is called glamour.  \n\n\n\"being envied is a solitary form of reassurance. it depends precisely upon *not sharing your experience with those who envy you.* you are observed with interest but you do not observe with interest - if you do, you will become less enviable. in this respect the envied are like bureaucrats; the more impersonal they are, the greater the illusion (for themselves and for others) of their power. the power of the glamorous resides in their supposed happiness: the power of the bureaucrat in his supposed authority.” ― john berger, [ways of seeing](https://www.goodreads.com/book/show/2784.ways_of_seeing)  \n\n\ni arrived in germany with the expectation to continuous the photography life style i had in ireland but i was wrong about it. making contacts became rare, everybody is looking for money even though they don't need it. being able to offer joy through my work became not enough, because people are not interested in sharing joy but in monopolize it through monetary status, using the money status as gate keeping, as trust symbol. even among models and creators who look for no payment collaborative work, they often are looking for photographers who show to have fancy tools, a dedicated studio in a fix address. it doesn't matter to them the result and the joy of the activity unless it can be provided through monetary status, as the access to a monopolized joy which they can justify their aloofness and segregation.  \n\n\nit also results on a social fear, a distrust on people who look for joy sharing without segregation, suspicious of them as if they have second intentions, the intention to steal something from you maintained through the monetary gate keeping. them seen as segregated from the privilege of your monopolistic joy, the ones who lack acting power and consequently have not much to provide as a joy, therefore desperate to take it from you.  \n\n\nmodels and photographers seem to compete on their self importance, on who is the joy provider to the other, instead of enjoying it as a joy exchange though helping each other for a same result goal. people are not approachable because of the distrust that strangers attempt of interaction has either monetary or sexual (joyful) goal or is a mad person. the other human interaction attempt can only be about dubious intention of climbing and preserve the intrinsic joy of being the joy provider in a monopolistic status kept through monetary (and sexual) border.  \n\n\ni think the key is empathy and understanding of what really matters, what we are striving for. we are striving for balance that comes with joy. through such understanding i suppose we can learn the importance of trust and honesty required for us to be able to enjoy life and society together. because *being envied is a solitary form of reassurance.*\n\nhttp://www.marciofaustino.com/blog/the-economics-of-joy-or-the-strive-for-balance", "sortedWord": "None", "Identifyer": null, "identifyer": 7485, "year": "2019"}, {"autor": "varshith03", "date": "2019-05-27 09:12:22", "content": "My creation leads to next generation", "link": "https://www.reddit.com/r/photography/comments/btjut2/my_creation_leads_to_next_generation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my creation", "selectorShort": "creation", "MarkedSent": "-----> my !!!  -----> creation !!!  leads to next generation", "sortedWord": "None", "Identifyer": null, "identifyer": 84373, "year": "2019"}], "name": "leica2018creation"}