{"interestingcomments": [{"Unnamed: 0": 219028, "autor": "godzillafries", "date": 1546388565000, "content": "Just magical. The location, the looks...", "link": "https://www.reddit.com/r/Leica/comments/abnsvw/just_magical_the_location_the_looks/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "just magical. the -----> location !!! , the looks...", "sortedWord": "None", "identifyer": 13523, "year": "2019"}, {"Unnamed: 0": 219282, "autor": "PandaPopulation", "date": 1563828064000, "content": "Can someone help ID what is going on with my M3 / Summicron 50mm? /!/ [https://imgur.com/a/Li6vmQ7](https://imgur.com/a/Li6vmQ7)\n\n&amp;#x200B;\n\nThere are what would appear to be light leaks happening throughout the frame as well as dark lines throughout the top.\n\nI initially thought this to be a bad scan but the result is the same after the lab did a rescan.  \n\nAlso, these issues are only noticeable on images I shot at the beach.  I have yet to see any of these issues when shooting in other locations.", "link": "https://www.reddit.com/r/Leica/comments/cgiovg/can_someone_help_id_what_is_going_on_with_my_m3/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "can someone help id what is going on with my m3 / summicron 50mm? /!/ [https://imgur.com/a/li6vmq7](https://imgur.com/a/li6vmq7)\n\n&amp;#x200b;\n\nthere are what would appear to be light leaks happening throughout the frame as well as dark lines throughout the top.\n\ni initially thought this to be a bad scan but the result is the same after the lab did a rescan.  \n\nalso, these issues are only noticeable on images i shot at the beach.  i have yet to see any of these issues when shooting in other -----> locations !!! .", "sortedWord": "None", "identifyer": 13781, "year": "2019"}, {"Unnamed: 0": 219288, "autor": "nickMA21", "date": 1563578949000, "content": "Leica Store Boston /!/ Hey everyone, first time poster so let me know if there is a better place for me to be asking this question. Finally gonna pull the trigger and get myself a Leica and was wondering what kind of stock they usually keep at their stores? As the title suggests I’ll be going to the Boston location, but insight on the stock/prices in other stores is welcome too. \n\nI messaged their Facebook page but haven’t heard back, so I figured I’d try my luck here. Thanks in advance!", "link": "https://www.reddit.com/r/Leica/comments/cfevyu/leica_store_boston/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "leica store boston /!/ hey everyone, first time poster so let me know if there is a better place for me to be asking this question. finally gonna pull the trigger and get myself a leica and was wondering what kind of stock they usually keep at their stores? as the title suggests i’ll be going to the boston -----> location !!! , but insight on the stock/prices in other stores is welcome too. \n\ni messaged their facebook page but haven’t heard back, so i figured i’d try my luck here. thanks in advance!", "sortedWord": "None", "identifyer": 13787, "year": "2019"}, {"Unnamed: 0": 219390, "autor": "__sicko", "date": 1560828500000, "content": "The M-A is so bloody expensive- prohibitively expensive!-, but I still want one... will it somehow benefit me? I'm a fashion/portrait photographer. /!/ I'm a full-time pro fashion/portrait photographer shooting for various major global publications, brands, record labels, etc. Sold off my film stuff (Mamiya RZ67 Pro II, Sinar F1, and some 35mm's) a few years ago, but recently got the bug and grabbed a Hassy 503cw, which I've been enjoying, but not using as much as I thought I would. After spending a little time with an M6 in Vienna last year, I fell in love (or, rather, lust) with Leica. While I'm still far from proficient at shooting with a rangefinder, the intuitiveness and sheer quality of a Leica is just unmatched- and I wasn't even experiencing a \"proper\" brass one! So this might sound kind of odd, to want something almost solely because of the physicality of it, but it's true; I want a Leica because it just feels so fucking solid and looks so damn good. Shallow, I know... but I'm a fashion photographer after all! The few images I shot on that Viennese M6 were just random amateur street scenes, and a far cry from what I'd like to utilize one for if/when I buy one. \n\nThe M-A is the one I've set my heart on. I'm aware of all the great vintage stuff I could get for the price of just the body, but what can I say- I've really made my mind up on the M-A. It just so bloody happens that it's their most expensive film camera, almost prohibitively so. I'm a master at justifying pointless purchases to myself, however this is one where I really begin to question my sanity... I'm not a wealthy collector or someone who wants one exclusively just to flex. While there is a large component of my decision being drawn by the aesthetic and high quality feel, I do actually plan to use this thing in a professional capacity, and that's why I'm posting here today... \n\nMy works aesthetic is so heavily dependant on shooting 85mm (in full frame/35mm), but with the Leica I'd most likely keep it a 50mm-only system until I can muster up the cash to get into a second lens down the line, which would probably be a 35mm. I'm going to link you some samples of my work below and would like your opinion regarding whether or not you think the Leica would realistically be of any benefit to me- specifically, the aesthetic which I shoot. Shooting at 50 or 35 would no doubt be a departure which would likely yield some different results, which is always a welcome thing! But I'm not so much concerned with the focal lengths as I am the rendering of images. Leica's, shot at whichever focal length, at whatever aperture, seem to yield extremely flat images. Now I can see why that'd be of value in photojournalism and street photography, which Leica's are obviously so highly regarded for, but how about in fashion and portrait photography? I'd very much love to see the work of some fashion/portrait photographers shot on an Leica M system before taking the plunge. My searches have yielded very little. Any fashion guys shooting Leica are obviously using their S system, which looks lovely, but I'm too indifferent re: what I shoot with digitally (or maybe just too content with my Nikon). A Leica in the context of shooting fashion editorials seems somehow wrong, but I'm also a firm believer that the tools don't matter quite so much... plus, I'd love the challenge. Will the Leica yield images good enough to be published in ELLE or some other magazine with which I frequently work? It's easy to say \"it's entirely dependant on the user\", but I don't buy that... forgive me if I sound too cocky here, but I've shot some great stuff, all of which has been published internationally in major publications, on various different formats (digital, 35mm, medium, large format), yet the 35mm rangefinder Leica's have always kind of scared me for use in my applications- they just seem like the wrong tool for the job... but that could, again, lend a welcome aesthetic departure and adventure. Won't know 'till I'm there... it's just a massive financial gamble to take. I \\*know\\* that the Pentax 67II is the camera I \\*should\\* be buying for my film fashion stuff- and I will at some point, though who knows when if/when I get the Leica... I even thought the Mamiya 7II would be added to my modest stable before a Leica, but seriously, after spending some time with one, it's all I can think about! \n\nBelow I'm linking some examples of my work. I shoot 50/50 studio (either with studio lights or natural light) or location with mostly natural light. It's also a mix between colour and bw. The Leica would be for natural light stuff exclusively and mostly likely for more 'environmental' portraits, which I'll have to force myself more into shooting as most of what I shoot is tighter 85mm stuff. \n\nPhotos: [https://imgur.com/a/XjY2Ezx](https://imgur.com/a/XjY2Ezx)", "link": "https://www.reddit.com/r/Leica/comments/c1x74w/the_ma_is_so_bloody_expensive_prohibitively/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the m-a is so bloody expensive- prohibitively expensive!-, but i still want one... will it somehow benefit me? i'm a fashion/portrait photographer. /!/ i'm a full-time pro fashion/portrait photographer shooting for various major global publications, brands, record labels, etc. sold off my film stuff (mamiya rz67 pro ii, sinar f1, and some 35mm's) a few years ago, but recently got the bug and grabbed a hassy 503cw, which i've been enjoying, but not using as much as i thought i would. after spending a little time with an m6 in vienna last year, i fell in love (or, rather, lust) with leica. while i'm still far from proficient at shooting with a rangefinder, the intuitiveness and sheer quality of a leica is just unmatched- and i wasn't even experiencing a \"proper\" brass one! so this might sound kind of odd, to want something almost solely because of the physicality of it, but it's true; i want a leica because it just feels so fucking solid and looks so damn good. shallow, i know... but i'm a fashion photographer after all! the few images i shot on that viennese m6 were just random amateur street scenes, and a far cry from what i'd like to utilize one for if/when i buy one. \n\nthe m-a is the one i've set my heart on. i'm aware of all the great vintage stuff i could get for the price of just the body, but what can i say- i've really made my mind up on the m-a. it just so bloody happens that it's their most expensive film camera, almost prohibitively so. i'm a master at justifying pointless purchases to myself, however this is one where i really begin to question my sanity... i'm not a wealthy collector or someone who wants one exclusively just to flex. while there is a large component of my decision being drawn by the aesthetic and high quality feel, i do actually plan to use this thing in a professional capacity, and that's why i'm posting here today... \n\nmy works aesthetic is so heavily dependant on shooting 85mm (in full frame/35mm), but with the leica i'd most likely keep it a 50mm-only system until i can muster up the cash to get into a second lens down the line, which would probably be a 35mm. i'm going to link you some samples of my work below and would like your opinion regarding whether or not you think the leica would realistically be of any benefit to me- specifically, the aesthetic which i shoot. shooting at 50 or 35 would no doubt be a departure which would likely yield some different results, which is always a welcome thing! but i'm not so much concerned with the focal lengths as i am the rendering of images. leica's, shot at whichever focal length, at whatever aperture, seem to yield extremely flat images. now i can see why that'd be of value in photojournalism and street photography, which leica's are obviously so highly regarded for, but how about in fashion and portrait photography? i'd very much love to see the work of some fashion/portrait photographers shot on an leica m system before taking the plunge. my searches have yielded very little. any fashion guys shooting leica are obviously using their s system, which looks lovely, but i'm too indifferent re: what i shoot with digitally (or maybe just too content with my nikon). a leica in the context of shooting fashion editorials seems somehow wrong, but i'm also a firm believer that the tools don't matter quite so much... plus, i'd love the challenge. will the leica yield images good enough to be published in elle or some other magazine with which i frequently work? it's easy to say \"it's entirely dependant on the user\", but i don't buy that... forgive me if i sound too cocky here, but i've shot some great stuff, all of which has been published internationally in major publications, on various different formats (digital, 35mm, medium, large format), yet the 35mm rangefinder leica's have always kind of scared me for use in my applications- they just seem like the wrong tool for the job... but that could, again, lend a welcome aesthetic departure and adventure. won't know 'till i'm there... it's just a massive financial gamble to take. i \\*know\\* that the pentax 67ii is the camera i \\*should\\* be buying for my film fashion stuff- and i will at some point, though who knows when if/when i get the leica... i even thought the mamiya 7ii would be added to my modest stable before a leica, but seriously, after spending some time with one, it's all i can think about! \n\nbelow i'm linking some examples of my work. i shoot 50/50 studio (either with studio lights or natural light) or -----> location !!!  with mostly natural light. it's also a mix between colour and bw. the leica would be for natural light stuff exclusively and mostly likely for more 'environmental' portraits, which i'll have to force myself more into shooting as most of what i shoot is tighter 85mm stuff. \n\nphotos: [https://imgur.com/a/xjy2ezx](https://imgur.com/a/xjy2ezx)", "sortedWord": "None", "identifyer": 13891, "year": "2019"}, {"Unnamed: 0": 219664, "autor": "Cuntdestroyer1998", "date": 1573456423000, "content": "horizontal flaring /!/ Hey guys I recently pick up a used M-P 240 and I'm puzzled as to what is causing these horizontal flaring in my photos. This first example ([here](https://imgur.com/cIEvpMZ)) the sun is on the left of the frame and the second example ([here](https://imgur.com/JB08KU0)) the sun is on the right of the frame so it't not at the same location on the sensor. Is this a lens or sensor issue? These were shot with the 50mm lux ASPH. Asking just in case it's a common problem before I contact Leica.", "link": "https://www.reddit.com/r/Leica/comments/duouyh/horizontal_flaring/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "horizontal flaring /!/ hey guys i recently pick up a used m-p 240 and i'm puzzled as to what is causing these horizontal flaring in my photos. this first example ([here](https://imgur.com/cievpmz)) the sun is on the left of the frame and the second example ([here](https://imgur.com/jb08ku0)) the sun is on the right of the frame so it't not at the same -----> location !!!  on the sensor. is this a lens or sensor issue? these were shot with the 50mm lux asph. asking just in case it's a common problem before i contact leica.", "sortedWord": "None", "identifyer": 14167, "year": "2019"}], "name": "locationleica2019"}