{"interestingcomments": [{"Unnamed: 0": 220099, "autor": "tinfish123", "date": 1518387650000, "content": "Anybody selling a leica Q in the UK? I'm interested. /!/ As the title says, I am interested in a leica Q. I often live/work in Shanghai and I see the perfect opportunity for some Street photography moments. \n\nI don't really know that much about leica to be honest. I've never used one but after doing some reading it seems perfect for my needs. I dont' want to change lens, the mechanics of the camera seem simple and obviously I expect the picture quality to be amazing? \n\nAnyway, I live in the midlands, and I'm willing to do cash on collection depending on the price and location. A receipt for warranty claims is preferred. \n\nThanks ", "link": "https://www.reddit.com/r/Leica/comments/7ww36l/anybody_selling_a_leica_q_in_the_uk_im_interested/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "anybody selling a leica q in the uk? i'm interested. /!/ as the title says, i am interested in a leica q. i often live/work in shanghai and i see the perfect opportunity for some street photography moments. \n\ni don't really know that much about leica to be honest. i've never used one but after doing some reading it seems perfect for my needs. i dont' want to change lens, the mechanics of the camera seem simple and obviously i expect the picture quality to be amazing? \n\nanyway, i live in the midlands, and i'm willing to do cash on collection depending on the price and -----> location !!! . a receipt for warranty claims is preferred. \n\nthanks ", "sortedWord": "None", "identifyer": 14613, "doc": "b'x\\x9c\\xddZ\\x0b\\\\\\x14\\xd5\\x1a\\x07Rn\\xa2\\x98o3\\xe5\\x82O\\xcc\\x8b\\x02\\x99\\xcf\\xe4\\x02\\x8a\\x10\"\\xcb\\x06\\x88/\\x12\\x87\\xdd\\xd9edwf\\x99\\x99\\x05\\x161Q{X\\xbe@\\xcbG\\xa6\\xc9\\xec\\x0b\\x84$\\xb5\\xc4G\\x9a\\x0fP\\xcb\\x17W+%\\x1f\\xa8Y\\x96\\x89\\xde+WM\\xd3\\xba\\xb3\\xb0\\x87\\xf2\\xcbs\\x99\\xbd\\xbb?\\xbc9\\xfb\\x9b\\xf9\\xcf\\xb7\\xe7\\xcc\\xf9\\xe6\\xfb\\xcew\\xbe\\xef;g\\xce\\x9b\\xd6L\\x92\\xe5(\\x866\\x06\\r\\n6\\x13<\\xcfrk\\xc2\\xc7D\\x8f\\x8b\\x19\\x1f+\\x8b\\x93\\x1fq\\xaf8\\xe2^y\\xc4}\\xbf\\x85g\\xd2I\\x9a\\xab\\x1c\\xde\\xae\\xcd\\xfe\\xc3U\\xafd\\xf7\\xdc\\x0b1\\xc5\\xad\\xe1\\xd8\\xd4\\xe7`T\\xc9\\xdf3\\xbe\\x18_5\\xeb\\xba\\xa9\\xe2R\\x86\\x87\\xdb\\xc3\\x0fw@\\xf7\\x9bQ\\x13\\xd6)\\xd8o=\\xa2\\xfb\\xeeM\\xde\\xb2\\xe0\\xc4\\xb40\\x84\\x0b\\xbf6\\x84X\\xf8*\\x83\\xd2^\\x9e\\x7fuv\\xec\\xf0\\x88q\\x9d\\xf7\\xd9\\x1b\\x82|~\\x05G\\xe3\\xff\\xfd\\xa6V\\x85\\xe5\\x9c\\xacB\\xf4\\x80\\x18\\xf5\\xad\\xcd\\xdf\\xfe\\xcd\\x0cq\\x8a\\xbd|\\xd5Ec\\xf7Yk.\\x9cx\\x1f\\xc3\\x07\\xd1\\x90\\xcf\\xde\\x89\\xcb\\x93\\x9eY\\xac0 :Y\\xe7\\xcd\\xc6\\xed)\\xa0!N\\xb7\\x97\\xb7\\x1fyr\\xf77\\xf3\\x82O\\'\\xc4\\xf8\\xf7\\xba\\xb5\\xab\\x84\\x80|\\x90\\xbe \\x9f\\xc0\\xdd\\xe7\\xee\\xf6z\\xbe\\xfc=D\\xdfS\\x94E\\x07\\xc7$\\xec\\x83\\x08\\xf9\\xac\\xc3\\xc8s\\x1f\\xa37\\xc8G\\xb1\\xe9\\xf4\\xb2\\x81\\xbbJ\\x9f\\x858\\xc1^\\xee\\xab\\x9aV\\xfb\\\\\\xea\\xb5\\xf6;\\x1c\\xec\\x9f\\x83\\xc00\\x96\\xbe\\xcb\\r\\xb1\\xa8\\xda\\xaa!J\\xed\\x1f\\x9c\\xde\\xae\\xadh\\x97|~\\xeb\\x96;\\x88\\x9e\\xffm\\x97$\\xd3\\xab\\xde\\x85\\x10\\xa1\\xde\\xca\\xed\\r>a\\xff?\\xcfN\\xff\"Qo\\x91\\xa9\\x13\\xe7i\\xb8\\x9a\\x0c\\x88\\x84\\xbd\\\\\\xd8[:\\xfej\\xf5\\xec\\xb2\\x9d\\x18y~\\xc2\\xf0\\t\\x88\\xcfQ\\xa5L\\x9b\\xff2\\xa2}}kt}\\x96\\xee\\x8aD\\xf8\\xe9\\xd8\\x88\\x8c_\\xb7v\\rG\\xe3\\xf4L\\xdf\\xd0@\\xbf[\\xaf\\xef\\xfc\\xa0\\t\\xbd\\xc1qzM\\xb6\\xed\\xca\\xd5\\xf7ng\"\\xfa\\x1f\\xebw\\xab6\\x7f\\xe4\\x999\\xbdm]\\xdf-B\\x9c\\xf7\\xad\\x1a\\xf3_K\\x83\\xba\\xe4O\\xb4\\x97\\xaf\\xfa9!`*\\xff\\xea\\xec\\xa6\\xfc\\x01\\x94\\xc7\\xef\\xf3\\xb4@\\x8f\\xc2\\xae\\x9d\\x10m8\\xbe\\x9a}\\xe7\\xa5\\xf3\\x1e\\x10\\x13\\xed\\xe5\\xd5\\x1bZT\\xcc?`X\\xba\\xd8A{S\\xff\\xda\\xdd\\xa7\\xf0x/\\x0e\\xd1H\\xff\\x10\\xa5\\xf6\\x0f\\xce\\x0e`\\xff\\xdc\\xee\\xf1\\x85nz\\xbb\\xe3\\xdd \">\\x1d\\xe6\\xf7\\xb9\\xf7\\xddM\\xd5QG\\xfd(\\x1c?\\x17\\xf7\\x08)\\xbd\\x96\\rSCL\\xb5\\x97\\xa3qj\\xc5\\xc8\\x83\\xec\\xbc)>\\xcd5N\\x97\\x07\\xfer\\xf4\\xf0\\xa8\\xa4\\xe1\\x10\\x93\\xed\\xe5(\\xfe4e\\xd7M\\x8d\\xd35+\\xc2C^\"G\\x8c@\\xd8}p\\xfb\\x9a\\xe2I\\xf3\\xb3Q\\xfc\\xe9p\\xbfC\\xf1\\x99\\x89\\xd1{\\x964\\xa17\\xc8G\\x93\\xecq\\xa5k\\xe8\\xe5\\x8f\\x11\\xbd\\xad\\xcb3\\x0b\\x16\\xd5\\xde\\xeb\\r\\x91\\x00\\xe58{\\xc3\\xc5\\x9f\\xebO\\xbc]V\\xd5v\\xe6\\tD\\xbb\\xca\\x1f\\xfc\\xa1\\x7f\\x80?@~\\xe0q\\xf1\\x07\\xcd\\x15\\xe7\\x1e\\xb7<\\xa4\\xf2\\xfb\\x03\\xf2\\x8dA!\\xf7 B>\\xe5\\x18y\\xa4\\xe6!\\xce\\xda5\\xa2\\x9b\\x8asa\\xfd\\xdd6\\x0e\\x9d\\xa2\\xca\\x82\\x98d/\\xbf\\xb8\\xe3RPd\\xfbh\\x8f|\\x07\\xc7\\x0f\\xb4\\x83\\xdan\\xddOy\\x05-\\xda\\r\\x11\\xf9\\x9d\\xffu\\xfc\\xbc\\xb8\\xe6u\\xf9\\xb1k\\xad\\xfd\\x11MuT\\x1f\\xa8\\x1b\\xf8B/\\x88\\n{9B\\x9c\\xdf\\x91*\\xcf\\xe5\\xf4\\xcc\\x98\\x94\\x8f\\xe2\\x16@\\x84\\xfez\\xad\\x83\\xf1\\xf4Q\\xe5\\xa3G\\xbf\\xf7Q\\xe6\\xa9o\\x9e\\x868\\xdd^\\xdeT\\x9e\\x88\\xe3\\x03\\xe5\\xf92\\xea\\x8c\\xff\\xc2\\x81\\x1b}!N\\xb6\\x97\\x0f\\x188-5\\xbcwu\\xdd\\n\\x07\\xed:\\xb0(4zZlu?D7W\\\\\\x08\\xff\\xa0f\\xf3\\xe7\\xd3\\xf3\\xcc\\x10]m\\xd7\\xce\\xe6!8?\\n\\xf3\\x90\\x11;\\xb7+\\xee~\\xe8\\xd3\\x15\"\\x8c?K\\x1d\\xd4\\x1b\\x8c?\\xa3\\xfd\\x8b\\xf2\\x85c\\xf1o@\\x84\\xe3\\xc7\\xd9\\xf9\\xdcl\\xb3\\xf6\\xd2Y\\xcf\\xfcs\\x10]=~\\xd4i\\xa7\"\\xfc>\\xedG@\\x94\\xda?\\xb8\\xbc\\n\\xf2\\x19\\x19\\xe3\\xfbC\\xf6\\x82\\xc3\\xe3!B\\xbd\\xe1\\xe2\\x1c\\xce\\x0e\\xa0\\xde\\x12O\\x07\\xfdt\\xf6\\xed%\\x0b J\\xe5#5\\x9e\\x9a\\xff:\\xb6\\xf5\\xb6\\r{\"\\x10\\x0e\\xb2\\xee/\\xcf\\x18\\xf5e\\x19\\xe23s\\xbc\\xcf\\xd3-_\\xaa\\xf1\\xc2\\xc5\\xd3{\\x98\\xfei\\x9d\\xbd|\\xa8\\xe7\\xf6\\'\\xbb!\\xda\\xd9\\xf9\\xcfm\\x0c\\x1f8\\xffY\\xbcj\\x9br\\x95ju\\x1b\\x88j{9\\xdb\\xfa\\xb5\\x13qQ%)\\xb8\\xb8\\xd0\\x12\\xe8\\x0f\\x1d\\xd0\\x0e\\x9c\\xf5o-\\xec\\xd8\\x94\\x7f\\xb3\\xacc\\xbc\\x97\\xec\\xbd\\xe9\\x03\\x11\\xe6\\xbd\\xef8h\\xd7\\xf2\\x7fv\\xacxran%\\xa2\\xdb\\x19\\xcb\\xf6\\x94\\xb7J\\xee\\xf1\\xf1\\x9a\\x95\\xa3\\xbd\\x0e\\x0e\\xf5D8\\xcd^\\x8e\\xf2\\x90b\\x07\\xfd[\\xab\\x1bE\\x872\\xee?5\\x16\\xd1\\xec\\xba\\xb9\\xb9gZ\\'\\x1f\\x82\\xe8\\xea|\\xc7#\\xeb\\xf8\\xb3;\\x0e\\xf0\\xe9\\x10Q\\\\\\x98Vn8\\xee[\\xdd\\xae\\xd2\\xd1\\xb8P\\x15\\x19\\xaf\\xf9\\xd7\\xdd\\xac\\xe1\\x88>\\xbd\\xc1J\\\\\\x9c\\xfc\\xd9(\\x88\\xae\\x96\\'gx\\x8f\\x1eA\\x15_?\\x03\\x11\\xc6\\x05G\\xed\\r\\xc6\\x05ML\\xfe,\\x9f\\xcb\\x9d\\xbc!\\xba\\xda_K\\x9d/\\xe0\\xfc\\x0e\\x8e\\x0f\\xf4o\\xf9w\\xfc\\xdc7\\x8dX\\xfb<Dd\\xd7\\x01U\\xca\\xa8\\xb7nXcq\\xe3Gj\\xff\\xa0\\xf9(D4N\\x91\\xbd\\xad\\xc4\\xf0\\xb9\\x8b\\x91\\x07\\xda\\x9b\\xdf\\x85\\xed\\x05y\\x94q\\'\\xc4\\xff\\xb7\\xf5\\xaa\\xe6ZO\\xc4\\xad#A?\\xfaQ|7\\x93~\\xd2+\\xcfv8\\xba\\xfdb\\xe8\\xed\\xef\\x0e!Z\\xaa\\x1f\\xc5\\xf97\\xe8G\\x0f\\xe9:R\\xd9?\\xfc\\xbc\\x1c\"\\xf4\\x078?*\\xd5\\xde\\x84\\xd0LE\\xbb-9u\\x08\\xc3\\xa7\\xf7-/\\xcaR\\xa6 \\xff\\xf6\\xdc\\xe4\\xa5D\\xddW\\xad\\x878\\xea\\xdfZ\\xb6\\xfe\\xb4Sh\\xf0\\x9d\\xb7\\x10=i\\x9c\\xe2\\x10c\\x18q\\x03\"\\xea\\xc0d\\xbf\\x8e[\\x7f\\xcc\\xad\\xe3qy\"\\xce\\xde\\xb6\\xb4\\xf2]\\xfdZ\\xf9\\xe0.\\x88\\xd6\\x97\\x04\\x86\\xd1I\\x1d>\\x87(u^\\x82\\x9d\\xcf\\x81y\\xc9\\x82\\x82\\x93\\xb1>\\xe6\\xa9\\xdb!J\\xf5o\\xb8\\xbc\\x17\\xf6\\x8f\\xff\\xa4\\xf3g\\xaf_\\xbfZ\\x80\\x10\\xc5m\\xf8\\x9di\\x8b\\x93\\xdf\\x99\\x9c\\xcd{\\xa5\\xda\\x9bll\\xd0\\x95\\xaa\\x81K\\xa6B\\x94:_\\x90:\\xdf\\xf6\\x7f\\xba\\xb6\\xcd\\xd1\\x8e\\xdd\\x16Ctv\\xde\\xb8m\\xee\\x84\\xec\\xc1\\xfd\\xf6\\xcdG\\xf4\\x90\\x11\\xf3?\\xee\\x93~\\xb3\\'B\\xcd\\xe9\\x95\\x8b\\xd7\\x84\\xfdr\\x1c\\xae\\xc3\\xbe\\xeb\\xa0\\x7f\\x83\\xeb\\xb0R\\xe7s\\x1b\\x9d\\xf4\\xd7\\xce\\xce\\xb3p\\xfd\\x03\\xed\\xa0\\xacdO\\xbb\\x9c\\xd1\\xfd\\x9f\\x80\\x88\\xfa\\xe7E\\xf9\\xd1\\xde\\x07\\x89\\xd4\\xe1[\\x1d\\xec\\x9f\\xe8\\x99\\x13O\\xee\\xee\\xb1i\\x18\\xa2+\\xe7~\\x182\\'\\x90\\xea\\x800\\xf0\\xf8\\x8aa1\\x93\\xcc\\x9eR\\xe7%8y\\\\=/\\xf9\\x19\\xc3\\xc7\\xd5q\\x0e\\xe5oM\\xc5\\xb9\\xe6\\x9a/\\xcc\\xc9\\xa9\\xf2\\xca\\x9bzd\\x8e\\xab\\xe7\\x0b\\xd0\\xde\\xce\\x1e\\xca]\\xf4\\x9dl\\xfbj\\x880\\x8fwt=\\x11\\xe6U;_\\xd9h*\\xd2\\xe8(\\x88\\x90\\x0f.\\x7f\\xf3\\x92\\xc8\\xa7\\xb9\\xf2\\xd1\\xfb\\x87\\xde\\x9f\\x15\\xb5z\\xf80\\x88P\\x9e\\xbd\\x0e\\x8e\\x1f(O\\xcc\\xd2\\xf6\\xa7>\\xeb\\xbf\\xcf\\x1b\\xe1\\x1b\\x01\\xa3\\xf4\\x9f\\x04e\\xee\\x82\\xe3\\xd4\\xd1\\xfc\\x00\\x8eSg\\xbfgyb\\xf4\\x06\\xbfg5\\xd7\\xf7\\xc6\\xbf,\\xea\\x1b\\xda\\xe2l|\\x00\\xc2Q\\xde\\x95J\\x8f\\xda\\xfew\\xa1\\xde\\x1c\\x9d\\xcfA\\xbd\\xed\\xda6a\\xff\\x85\\x0b1m \\xfeY\\xf7S\\x14\\xb4\\x9c07\\xe2\\xf6\\xa8^\\x10a\\x1e\\xe2h\\\\\\x80y\\x08\\xca\\x07 \\xbaz]\\xf9X\\xc8\\xcb\\xc1\\x9e}?<\\x0c\\xd1\\xd5\\xf9\\x81\\xb3\\xeb\\xfeR\\xf3\\xeb#\\xadFVF\\xba\\xc7\\x0e\\x80(u=Dj\\\\h\\xae\\xef\\x0b\\x97\\xbc\\xd4\\xe3\\xa7\\x0c\\xb8\\xf3\\x03Dh\\x07\\xb8<\\x11\\x97\\x1f<\\xaa\\xef\\x0bG\\xbe\\xa9\\x8d\\xbb\\xfa\\xd4\\xa9<\\x88\\xae^W\\x1ey#.\\xce\\xd4oe\\x16D\\xa9\\xfb)\\xa4\\xae\\x93\\xffY\\xd6wpv\\x00\\xe3\\xe9\\xed\\x85\\xe1\\xf3\\x0e\\x87\\xfd\\xb4\\x19\\xa2\\xab\\xd7w\\x9c\\xdd/v\\x07\\xc3\\xc7\\xd5\\xeb\\xf1\\xb8\\xbc\\xf7\\x0f\\xfd3\\xec\\xfd\\x80e\\xc7\\x12\\x8b J\\xf5;8\\xbdA>\\x8f\\xdb\\xbe\\x9a\\xe6\\xda\\x17\\xf0\\xb8\\xed\\xeb\\xbc~\\xb0mMom\\x89\\x19\\xe2t{yS\\xeb\\xd7R\\xf3\\x10g\\xed\\r\\xf7}\\x0e\\xda\\x9b\\xb3\\xf9\\x01\\xce\\xbf=\\xaa}\\x01R\\xf7\\x8f\\xe2\\xe26\\xce\\xbf\\xc1\\xfdb\\x9eQ/o\\xac\\x9d{w\\x1eDW\\xfb\\xeb\\xe6\\x8as\\xb8\\xf5\\x03W\\xcf\\x1b\\xb9\\xb5SZ\\xc8Y.\\x16\\xa2\\xd4\\xf5D\\x9c\\xde\\xe0\\xf8\\xd91tW\\x8e\\xcf\\xdaH\\x19DW\\xaf\\x8b\\xad\\xf2]\\x18\\xb6\\xbd\\xf7\\x8c\\xd7 J\\x9d\\x97H\\x95\\xa7\\xc4\\xc7{\\x91\\xfc\\\\Y-\\xc23\\xba\\r\\xa6O\\xa6\\xb6M\\x82\\xeb\\xca8yp\\xfe\\x00\\xae+;\\xab7\\x9c<\\x8f\\xca_\\x7fu\\xbe\\xb3\\xe9\\xeb\\x9d\\xf7\\x97@t\\xf5\\xbc\\xd1Y?\\x8a\\xb5\\x03\\xe0G\\xdf\\xb4$\\x06\\x97-\\x1c\\xff\\x02D(\\x0f\\xce\\xbfI\\x95\\xc7\\xd9\\xf5\\xd1:\\x0c\\x1f\\x98\\':\\xbbO\\xd5\\x1d :\\xe0>\\xd5e-V\\xf4\\xbc\\x1f\\xbf#\\x02\"\\xd4\\xdb\\x06\\x0c\\x1f\\xb4?\\xa4)\\xbd5\\xd7\\xbe\\xa7S\\xe7<j\\xabfV\\x85Bt\\xf5|\\x8e\\xeb\\x9c\\x1f~zN\\x80\\x05\\xe1\\xf3u\\xab7\\xef\\xf8qB\\xa8\\xab\\xd7\\xe3Go\\xbd\\xdaU\\x999)\\x10!\\x8c\\xdb\\xe8\\xbb\\xccr\\x07\\xfdA\\xf2\\xc9\\x7f\\xcb\\xa7^\\xbd1\\t\\xd1\\xb5\\x97\\xafl9\\xba\\xf0\\x1d\\x15\\xc2\\x91\\xfcSo\\xe4u\\xee\\xfb\\xa4\\xab\\xbf\\x9f:;~pv\\xe0\\xeay\\x16\\xd4\\x1f:\\xa0\\xbd%\\x0c\\xb8^\\xd4oU@:\\xc2\\xfe\\tE\\tn\\x1e\\x93s\\xa1\\x1d\\x94:\\xb9\\xdek\\xe1t\\x84\\x82\\xe4*\\xdero8\\xdc\\xea\\x7f\\rw\\x8d\\x87\\xdb\\xef\\xee\\x1f\\xa8\\x83(Pl\\x7f\\x00\\xfc\\xdfP\\xb7\\xb1q7\\xf0LccV\\rI\\xab\\xf94\\xae\\xa2\\x85\\xadw\\xad\\x1c\\xcfR\\xb4\\x9a;\\xe3V\\xbaN\\xf0\\xf2*\\xf4\\x17\\xfc\\xb5F\\xffL\\xb20\\xa0pPa\\xa01\\xb0g`ahu\\x9fpNG*\\xf8\\x109\\xc9\\xaar\\x13I\\x9a#C\\xe4\\x04\\xc7\\xe7&\\x91lj$\\xc3jE\\x8a\\xe5\\x7f\\xab\\xc52jT\\x8b%\\xb9\\x07k\\tc\\xc6\\x08c\"\\xaa\\x87\\x8e!\\xc4b\\x19\\xa3\\xcd\\x8d\"i%\\xc9\\x86\\xc8H=\\x9f+\\xd3kS\\xc5\\xfb\\x04\\xf1\\x85rE^\\x1cC\\x87\\x0c\\xce\\x15\\x9b\\xa3\\x13\\r:[c\\\\\\xf5\\x80\\xc6\\xe7\\x1eR7\\xf8\\x81\\xba\\xa5c\\x18zF=1F\\xab\\x13\"\\x12\\xb7E\\x90*\\x8a\\xa6x2D\\xbc\\xf9\\xadf8\\xcb\\xffV\\x12M+\\x1f(Y\\x1fA\\xaaYRl\\x8e\\xe1\\x8cQ\\xf2\\xb1\\x85\\xd1B\\xb4L\\x187\\xaezH,\\xc3(\\xebk?\\xf45\\x1e&|$E\\xff\\xf7\\xc7\\x06c\\x1f\\xf3k|\\x0cS\\xc3(\\x8b\\x94\\x0b2\\x99Q&\\x93\\x8bgB\\xa9\\xd8z\\x83\\xe0\\x04\\xab,\\xb1\\xb3\\x92k\\xf4l\\xc9\\xef\\xd8V\\x0fx\\xb8\\x06\\x19\\x8e\\x0b\\x99,\\xb6\\xff\\x80\\xda\\x03\\x1cy\\xdf\\xad\\x0fTF\\xcd\\x88\\xafo\\x94\\xc7\\xcbM\\xe2\\xd9\\xa7T\\xceh\\x08\\x96\\xe2\\rb\\xb7\\xab7\\xc8\\xf5\\xb4\\x82ox_F\\xab\\xfd\\x1d)2\\xa2\\x84\\xf8\\xd1\\xa6\\xf8\\xb8\\xb8Dc\\xc2\\xe4X!1\\xae\\x1c\\xc3SH\\x1amL\\x1a\\x1d%\\x9e2\\xf1\\x94\\x8b\\xe7\\x94\\xd2\\xc6\\xf2hZeLI\\x90\\x17\\x12f\"\\x95\\xd1\\xf3FB\\xa11\\x13\\nF\\xab3\\x13\\xcaL\\x85\\xc6\"^\\xb5\\x8c\\xd2L\\xa8x\\x92\\x15\\x08\\xad\\x95\\xd0\\x129\\xe2\\xbb\\x9b\\x08\\xf1_#A+\\xad\\x04mHe\\x94\\x06\\x8b\\x88Y\\x84A 8#\\xa1\\xcf\\xb6\\x8a\\xa7\\x8e\\xe08!\\x954\\xa6\\xeay\\x8b\\x82\\xd0\\x92,aR\\x10\\\\\\x9a\\xa0P\\x98\\x156\\x06\\x16E\\x1aA\\xabI\\xb3BCPZK\\xfd\\x95[\\xaf`4\\x1aq\\x9cP\\x0c]d\\xab\\xc3\\xe8i\\xa5I!\\xda\\xaaQI\\xea,\\xe2)\\x0e\\x88\\xe2\\x06\\x10_B\\xfc\\x93\\x17\\x94\\x8cI\\xc9\\xa4\\xce0+\\x19\\xf1\\x1f\\x0b\\x99m\\x1bfF\\x15\\xc3\\x9a\\xd2\\x88L\\xd2\\x92\\xc6\\xd0$\\xc7\\x17R\\x02E\\xaf\\xa7hQ\\x06\\x91\"\\x95\\x02\\xc5\\t\\x14oJ\\xa7\\x99,\\xb3\\x86\\xa4\\x14\\x84Q\\x1c\\xf7&\\xf1\\xe4L\\x1a*\\x93,\\xd20\\n\\xc2\\xf6\\x0e&-\\xc1\\xa6\\x17iI\\xdb\\x9bR\\x8abt\\xc3\\x15i)\\xa5F\\x14\\x9e\\xb3h\\x19-I\\xf3\\xd6\\x06\\xe0LZ\\xbd\"M\\xd0\\x1a\\x8c\\xb4?o\\xa2IRi\\xb6]8#M\\xaa\\xc5\\xbbL\\x925\\xd2\\x0c_D\\xeb\\xecJ\\xa59}\\xea\\x8c\\xe2\\xfak\\xbd\\xb2h\\xbe\\x98I\\xcd\\xa4\\x18=\\xa71\\x08\\x8c\\xca\\xcc\\x88J\\xa7\\x05\\x866\\x8aB\\x940:\\x1d\\xc3\\xf2zq(\\x1aL\\x8c\\x8eU\\x9au6\\x05Yu\\xa2\\xdb\\x11%.\\xd1\\xa51<\\xa3f\\t]\\x9a\\xc1\\xaa\\xa3\\x14\\xbc\\x9e%M:Q/\\xe2\\x85\\xe3,:\\x96T\\x91lq\\x03\\xb0\\xa4\\xd2$\\xde\\xe9\\xcc:\\x96R\\x90f\\x9d\\xcd\\xa6\\n3\\x84\\x8cA\\xd6\\x0c=\\xa1\\x11\\xdb\\xb7\\xb2$a\\xd3\\xafED\\x8d\\xc6F*HJ\\xc7\\x1b9\\xc2`\\x12O\\xce\\xc8\\x91\\xa4I<\\xb5f\\xdb\\x85\\x13o5\\x1a\\xab\\xed\">S\\xc4\\xd9z5\\x8d\\xa0,\\x1c\\xa5\\xd5i\\xc4z\\xa2j,\\xa2#%I\\xde\\xcc\\x8be\\xe9\\x96\\xfa+g\\x12\\x817\\xf2i\\xa4\\x99\\xa7x\\r)\\xf0\\x8c\\xa0O7\\xea9\\xd2$\\x9eJS\\x16A\\xf3EY\\x04\\xcb\\x8ah\\xb0fQ\\xf5\\x8d\\x9b\\xb2\\x186\\xdd\\x9cm\\x13\\\\\\xb4%\\x9e+\\xc83\\xab4\\x84\\x9a+\\x98\\xb3)\\x8d\\xe0R\\xf4\\xb4\\xadG\\xe9\\x94\\x86\\xb8\\xb2\\xb7DD:E\\xcd2z\\x1dWP\\xe1\\x9e\\xff\\x1fh\\xfa\\x8cf'", "year": "2018"}, {"Unnamed: 0": 220754, "autor": "guitarist89", "date": 1544844518000, "content": "Which Leica to accompany my Hassy? And is Leica for me at all? /!/ Leica. It's a name that so many know, but an item which relatively few ever get their hands on. I got into photography around 2008/9 and remember attending a big show where I held my first Leica. I didn't know anything about anything at that point, but knew that what I was holding was special, at least as far as inanimate objects-- especially cameras-- go. It was markedly better feeling than any other camera I'd owned/held up until that point. There's people out there who equate weight and rigidity to quality-- heavier the better-- and I get that. I handled a Pentax 67 that same day and while it was undoubtedly solid, it didn't exude the same level of finesse as the Leica. Truth be told, I don't think I've ever held an item in any category which felt as good/high quality. For years I toyed with the idea of one, but without the ability to try before buying I just couldn't pull the trigger on such an expensive item. \n\nFast forward to a couple weeks ago when I visited the Leica store in Vienna. I finally got to spend some hands-on time with an M6 and it felt just as incredible as whatever M-series it was I held a decade earlier. It handled so beautiful and completely flawlessly. After only a few minutes with it, I seemed to be completely dialled in and one with the camera- it was like an extension of me. Focusing was an absolute joy. I was sorely tempted to pick up that M6 with a matching 50mm, but a quick eBay search showed me I could find one substantially cheaper back home in North America, so I waited. \n\nJust today I picked up my dream camera-- a Hasselblad 503cw--, which reignited my love for analog photography. I previously used to shoot a Mamiya RZ67 Pro II and Sinar F1, but sold them a few years ago as the expedited workflow of digital hijacked all my attention. Now with the Hasselblad by my side I'd like a great 35mm counterpart and of course it only seems natural that a Leica be it. I'm trying to be as objective as possible about this and figure out if a Leica even has any place in my arsenal in the first place... I'm a fashion-portrait photographer, shooting 50/50 studio/location. I generally prefer shooting 85mm (in full frame/35mm), but am thinking the Leica might be better for more 'environmental' portrait work where you bring more of the surroundings into the frame. \n\nAlso, I know there's no shortage of threads on the subject, but could someone perhaps give me a brief summary regarding the different analog M-series cameras. I'll likely go the M6 route, but am curious how the MP compares. Is it better in any way? I don't really understand the price difference. Also, which magnification M6 is best to get? What's standard? I know people love the double stroke M3's, but I'd really prefer something newer. Also, which are the best/most popular lenses? ", "link": "https://www.reddit.com/r/Leica/comments/a6bvg5/which_leica_to_accompany_my_hassy_and_is_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "which leica to accompany my hassy? and is leica for me at all? /!/ leica. it's a name that so many know, but an item which relatively few ever get their hands on. i got into photography around 2008/9 and remember attending a big show where i held my first leica. i didn't know anything about anything at that point, but knew that what i was holding was special, at least as far as inanimate objects-- especially cameras-- go. it was markedly better feeling than any other camera i'd owned/held up until that point. there's people out there who equate weight and rigidity to quality-- heavier the better-- and i get that. i handled a pentax 67 that same day and while it was undoubtedly solid, it didn't exude the same level of finesse as the leica. truth be told, i don't think i've ever held an item in any category which felt as good/high quality. for years i toyed with the idea of one, but without the ability to try before buying i just couldn't pull the trigger on such an expensive item. \n\nfast forward to a couple weeks ago when i visited the leica store in vienna. i finally got to spend some hands-on time with an m6 and it felt just as incredible as whatever m-series it was i held a decade earlier. it handled so beautiful and completely flawlessly. after only a few minutes with it, i seemed to be completely dialled in and one with the camera- it was like an extension of me. focusing was an absolute joy. i was sorely tempted to pick up that m6 with a matching 50mm, but a quick ebay search showed me i could find one substantially cheaper back home in north america, so i waited. \n\njust today i picked up my dream camera-- a hasselblad 503cw--, which reignited my love for analog photography. i previously used to shoot a mamiya rz67 pro ii and sinar f1, but sold them a few years ago as the expedited workflow of digital hijacked all my attention. now with the hasselblad by my side i'd like a great 35mm counterpart and of course it only seems natural that a leica be it. i'm trying to be as objective as possible about this and figure out if a leica even has any place in my arsenal in the first place... i'm a fashion-portrait photographer, shooting 50/50 studio/-----> location !!! . i generally prefer shooting 85mm (in full frame/35mm), but am thinking the leica might be better for more 'environmental' portrait work where you bring more of the surroundings into the frame. \n\nalso, i know there's no shortage of threads on the subject, but could someone perhaps give me a brief summary regarding the different analog m-series cameras. i'll likely go the m6 route, but am curious how the mp compares. is it better in any way? i don't really understand the price difference. also, which magnification m6 is best to get? what's standard? i know people love the double stroke m3's, but i'd really prefer something newer. also, which are the best/most popular lenses? ", "sortedWord": "None", "identifyer": 15279, "doc": "b'x\\x9c\\xe5}\\x07\\\\\\x14G\\xfb?\\xd8\\xc5\\xa0\\x18{\\x8b]^\\x8d\\xd8\\x10[b\\x14\\xc4\\x82J\\x11\\xb1ET\\x96\\xbb\\xe58\\xb8\\xbb=\\xef\\xf6(\\x96\\xd8\\x13{\\xd7X\\x82\\x91\\xab41j$vE%\\xb6\\x18K\\x8c\\x86`\\xef\\xaf\\xb1kT\\xac\\xbf9\\xbc1\\xfa\\xc4\\xf9\\xdflv\\xdf3\\xc9\\x9f\\x0f;\\xdf\\x9d\\xdb\\xbd\\x9d\\x9b\\x99g\\x9e6\\xcf\\xccN\\xb3%\\xb0:\\xbd\\x92\\xd3\\x98Z\\xb5hmax^\\xa7O\\xf1\\xef\\x16\\xd4\\xbbO\\xdf\\xe0\\x90\\xd0\\xb0\\x83\\xee\\xbb\\x0f\\xba\\xe7\\x1dt\\xff\\xde\\xcas\\xf1\\xacF\\x9fWXf_\\xdfG\\xc6z\\rKGC\\xfc\\xd4\\xed\\xe5\\xdf\\xf9!\\xed\\x82\\x03\\xabo\\xbe\\xf9\\xb5\\xfb\\xcb|1\\xb77\\xff\\xdc\\x01\\xe2\\xbf\\xbd\\xe0\\x83H\\xad\\xa7.4w\\x9e\\x06b\\x94\\xe3z\\xc5N\\'v\\\\\\x98\\xd4\\xba`\\x95\\xe3{\\xc5\\x1d\\x9fO\\x04\\xe5\\xbep\\xfc\\xe1\\xe7\\xb6\\xdcq\\xfaq\\x83\\xb6\\xdf}\\x85\\xf3s\\x0b\\xeb\\xb9\\xaf\\xed\\xb8\\xa2-\\xc4\\xe1\\x8e\\xeb\\xcd\\x0f\\xcb{N\\xbfk\\x0b^\\xe4\\xa4>\\xb0\\x1cX\\x9fF%\\x97F7}^\\xa7#D\\xb9\\xe3\\xfa\\xf0\\xef\\x92\\x8f\\xd6\\xcd\\xf7\\xca\\xeb{x\\xec-\\xf3\\xee\\x8b#a9\\xf8\\x0f\\x96s\\xb8G\\xb8\\xea\\xce\\xe3\\xc4\\x0e8\\xbf:3\\xd7kT\\xc0\\x7f\\x8aC\\x1c\\xe1\\xb8\\xde+\\xec\\xc7\\x86{\\x99\\xe8\\x0e\\x1b\\x04\\xd6\\'h\\xf4\\xa0\\x13;j\\xafm\\x8f\\xf3\\xe3j<\\xda\\x9f~iHu\\x88\\x91\\x8e\\xebk\\x1b\\xed\\xed\\x99\\xf9\\xc9\\xc8c+\\t\\xe5<\\x7f\\xf1\\xe6\\x1f\\xfe\\x1c\\xf6O\\x8f\\xe8A\\x93T\\xfa3#!2\\x8e\\xeb\\xc6\\x9dY}\\xaf\\xe7\\x8f[\\xbd\\x95P\\xce3B9\\xcd\\xc3G\\xc5\\x8c\\x18>u\\x18\\xce\\xff\\xdc\\xf3\\xa4\\xf7L\\x9f5u!\\x0eq\\\\o\\xe63<\\xda\\xbfa\\xfe\\xbd/\\x05\\xd2u\\xcb\\xb4.A\\xc3\\x83\\xf3\\x9b\\xe0|\\xc0\\x86\\xeb\\xd5\\xe4\\t\\x83[b|p\\xc6\\xf2AV\\xab\\xaas\\x079\\xae\\xbf\\xff\\xec\\xfd\\xf4\\x93\\x83\\x82r\\x85\\xd2A\\xe4\\x89\\xfbaC\\xaf\\xdf\\x1d\\xfc*O9~\\x16\\x12\\xea\\xf3\\x82\\xd0n\\xb0\\x7f\\xc6Y\\xd4\\x17O\\x95\\x9a{\\x1a\\xe2\\x00\\xc7\\xf5\\xba1\\xc3o\\xb4\\x89\\xbeYq\\xb3@:\\x80\\xe3g\\xbc\\xdf\\x90\\x1fw\\x9e\\x9c\\xfa\\x14\\xe3\\xf6\\xee\\x81#_l\\xa8\\xe6\\x8f\\xe9\\xfad\\xe3.-\\xeb=\\xf8|\\xebw\\x02\\xeb\\xf3A\\xe1\\xd0\\xf3\\xa7\\xebx\\xf5\\xc1\\xf9\\x982k:{M\\xbf\\x96\\nq\\xa0\\xe3\\xfa\\xf9\\xcd\\x17[\\xf5\\xa8\\x18Tl\\xaeH~p\\xe7b\\xbbz\\xe7\\x92\\xaam\\x82H[\\xce\\x13\\xcav\\x13;~\\x1eS\\x8e\\x9f\\x87\\xb5\\x8fi\\xa3\\xbc\\x8e\\xd6\\x80\\x18\\xe5\\xb8\\x8e\\xe9\\xad\\x7f\\x1f\\xef\\x06\\x0f\\xb6e2\\x98_\\x8fu\\x7f\\xb3\\xdd\\xfe4~\\x00\\xbd\\xd1\\xd2\\xb5\\xd0\\xf1\\x03\\xcb\\xc1\\xed\\x02\\x91\\xb6\\xddH\\xf4\\x06\\xdb\\xcd\\xbb\\xfa\\x8d\\xf7~\\xacTc6DH\\xd7\\xab\\x04\\xf2\\x9d\\x8d\\x13\\x07$\\xf96\\xd95\\x15\\xe7\\xab>\\xfb\\xc6\\x14\\xd3\\xf2\\xe9\\x05\\x8c\\xff+\\xbe\\xd3\\xac\\x8f\\xe2\\xc1\\xbaK\\x1fZ b\\xfd`\\xe9yS\\xad\\xb1)\\xe7~r\\xa6\\x1f\\xc0rv\\x0eZ<\\xb0\\xe6lY2\\xceomT\\xe6\\xa0\\xf7\\xdd\\x1a\\xcf!B\\xf9C\\xe2o\\xb4\\xf2\\xa7 \\xdb\\xc6\\x9c\\x1f\\xb2\\xefc\\x88\\xb8\\x7f\\xb0\\xbeC\\x92s\\x98\\xcea9\\xdf^\\t\\xb9Q\\xf8s\\xc0\\xab\\xfe\\xe1\\x02\\xb3\\xa2\\xb8\\x0e\\xdb\\xbf\\x80(5\\xdf\\x91\\r\\xf9*\\xd4g\\xda\\xc5\\xcf!F8\\xae\\xe7g\\x97\\xd8=uO\\xf2|g\\xf4\\x06\\xcbQ\\xbc\\xa8U\\'\\xf5h\\x03=\\xce\\x17K<\\xdat\\xf3\\x1e>\\x1e\"\\xd6w\\x96>\\xe9\\xdf|(?y\\xdcvB9O\\t\\xfd\\xd3+\\xe5\\xf3\\xb0C7\\xcby\\xe3\\xfc\\xc6\\xaa5g\\xcc\\xba\\xf1\\xb4!D\\x06\\\\\\x17:No\\x15_\\xb8\\xfap\\xf9\\xd1?\\xe1\\xbc!\\xb3eW\\xcd\\xc0\\xf7\\xf7C\\xa4\\xd5\\x0fH|\\x14\\xea\\x07\\xdd\\xfbe\\xcfOI\\x99~\\x04\\xa2\\xd4\\xe3g\\xfa\\xb7\\x91\\xd7\\xc7x\\xfc\\xf2\\x05D\\xda\\xf1\\xf3\\x80r\\xfc\\x90\\xec\\x058~H\\xf4V\\x82P\\x1fH\\xd7\\xbfy\\\\\\xeepd\\xcf\\xa1\\xbb\\x10\\xa5\\x1e?+\\'w\\xdd\\xfa{\\xebl3D\\xda\\xf1C\\xb2K\\xe0\\xf817_\\xda~ix\\xf2@\\x88R\\xd7\\xa7\\xeb\\xb9\\rc\\xef\\x94\\xbeS\\x0b\"\\xb4KH\\xe3\\x94\\xa4\\x87@\\xbbd\\xd4\\xe8\\xf9\\x1f\\xd7\\xff\\xe1J\\'\\x88b\\xed\\x12\\xe5\\xf0m\\xa5\\xd3\\x147\\xa3q\\xde\\xb3\\xd7\\xe1!\\x99\\xf7t\\xd50\\xfa.\\xddW\\xf6j\\xf9a\\x0b1]\\x8f\\xee[\\xa7z\\xc9~g<\\x84\\xda%\\xe5\\x92\\x16\\xb7+\\xb5\\xa9L\\r\\x9c\\xdf\\xdcn\\xdb\\xa8:+z\\x84@\\xc4z\\xef\\xc9I#m9e\\xdb\\x8e\\xd8\"\\xd0.\\x81\\xfd#V\\x0f\\xb9A(\\x07\\xea!u\\xeb\\x9e\\xd16\\x9a\\xbf\\xad\\x07F\\x92~-T\\x0f\\xb9\\x19\\xb2\\xf1\\xda\\xf5\\xaf\\x1e&\\xe0|\\xbd-\\xe5\\x9a\\xf1\\xf7\\xe6gc\\x84\\xf4v\\xb5\\xc3\\xe8\\xf5S\\xa2\\xb9\\x1bB\\xf5\\x90\\x80\\xd5\\x8bS<\\xda~\\xfa\\x1c\\xe7\\x1f\\xc4\\xfb\\x0f\\xf0\\xdb?\\xce\\x07\"\\xad]\\xf2\\x82\\xd0n\\xb0\\x7f\"\\nZ=:\\xb5p\\xce\\x0c\\x88\\x90\\x8f\\n\\xb5K \\x1f\\x1d\\xfaM\\x9bx\\xaf\\xe6\\x11\\xcd!\\xd2\\xd6\\x87\\x96\\xde\\xea\\x1fs\\x8b\\x92\\xef\\xf1\\x1f\\x0c\\x11\\x13Jd\\xbdJ\\x1b~\\x1bs\\x8f\\x17Z\\x9f\\x9c\\xb2u\\x97O\\xf9\\xce\\xb7*\\xce\\x8b\\xb5\\xb7I|\\x07\\xca\\xd3\\x9c\\xf0\\xb9\\x95\\xb2\\xcd\\'R B\\xfe\\xb6L\\xa0\\xdc\\x86\\xfcM}\\xf8\\xf2\\xae\\x03\\x05C\\xcfb\\x1c\\xeb\\xbd\\xa4\\xde\\xd9\\xe0\\xe7{p9s\\xaf\\x8f\\x0b\\xee\\x10\\xd8\\xbb\\xcaN\\x81\\xed\\xf6\\xa2\\xc9\\xd0\\xc3]G\\x9d8\\x8c\\xf3b\\xf5k\\x92\\xfc\\x81\\xfa\\x01\\xf3\\xa0{\\x9b\\x93\\xb2\\xc0\\x13\\x10\\xa1\\x9c\\x9b/RO4\\xbb\\x97|\\xdc\\xea\\xab\\xa55!\\xd2\\xfa\\x91Ht\\xfd\\'\\xbb\\xf1\\x91e\\xdd\\xd8\\x91I\\xe7!b\\xc1\\x11\\x9c\\xdf\\xc6\\xfb\\xc1\\xa26\\xf7H\\xf2\\x94\\xd4np\\xfcH\\xc5Ga9\\x90\\x8f\\x9e\\xedU\\xfa\\xb3\\'\\x9e\\xe1\\xcd1~\\xe0\\x9dX}\\xd8\\xbdgm!\\x1f%\\xc9mR\\xbbA>*\\xd6\\x9fHj7\\xe8O\\x9c\\xac\\xfcmW\\xfa\\xf6/\\xcd\\x10I\\xf4\\x86\\xed\\xaa\\x99\\xc0\\x7f\\xe0\\x8c\\xdeh\\xfd\\x07b\\xe9M\\xac\\xdc\\xbeE(Gj\\xb9\\x8d\\xdb\\xd1\\x99\\xdc^_\\xe5L\\xca\\xf7\\x9fL\\xdcb]\\xc9y\\xce\\xd9\\xf9{\\x1d\\x8c\\xd8\\x7f\\x80\\xe9\\x8d\\xe4\\'\\'\\xd1\\x01\\xa47/\\xd3\\xea\\xdc\\xef\\xcaF\\xd6^\\x9f\\xb2$\\xc0co\\xbbR\\x18\\xb1?\\x1e\\xeb\\xbd\\xe9\\x02\\xc7O\\xd9\\xbbi\\x07F>\\xab\\xd0\\xfd\\xd5\\xefqb\\x9fJ\\xe5\\x8f\\xbf\\xbf\\'\\xeb\\xdb_*\\x8e\\\\\\x00\\x11\\xf7\\x8f3\\xfeF\\x92\\x0bM\\xe2\\xcet\\xad\\xdc\\xba^\\x06\\xce\\xab\\xfa\\xcc\\x1d[\\xe7JeO\\x88R\\xeb;\\xb4\\xf5\\x11\\xaa\\x1f\\xc0\\xfa\\x90\\xfc\\xb0\\xb4\\xf5!\\xf9\\x0f`}H\\xfe\\x1d\\xb1\\xf6\\xb6\\xe1\\xfe\\xad3>\\x87\\x0c\\x95p~\\xed\\xba\\xf2[\\xa2+\\xfct\\x1c\"\\xad\\x9eH\\xeb\\xaf\\x12\\xeb\\x0f)$\\x94#\\xb5?\\xe4\\x11\\xa9>@\\x7f{qeQL\\x85\\xea\\xb3\\x97b\\x84\\xe3\\x14\\xf3\\x1d\\x92\\xfe\\xf6\\x90P\\x0e\\xe4;$:\\xc0\\xfa\\x01\\xa67\\x1b\\xa1\\x9c\\x92\\xf8\\xf7:\\xa177\\xbf\\xfa\\x9dw\\x98\\x15\\xfd \\xe2\\xf1\\xe3\\x11\\xbe\\xaa\\xben\\xd7\\xe6\\x00\\xa1\\xfeD\\xa9\\xf5\\x10\\x12\\xbf\\x86r!\\xea\\xdaf\\x8f~\\xff\\xfdf\\x1aF\\xe8Wv&\\x17H\\xe3\\xe7\\xf2\\x16\\xb73Qi=z\\xe0\\xfc/\\xb5>\\xdb\\xe3\\xb7tx,F\\xa8\\xef`\\xfd\\xfa+\\x81\\xe5@\\xfd\\x9a\\xb6>K\\x04\\xda\\x0b\\xb0>L\\xe4\\x91\\x8ey\\xfb\\x86\\xb7\\x80\\x08\\xf5\\x9d\\xd9\\x02\\xf9(\\xd4w\\xc4\\xf2\\x03\\x12\\xdf\\x81\\xfc\\x80\\x96_\\x8b\\xf5W\\xf5\\x1d<V\\xe7\\xef\\x16i\\x83\\x88\\xdb\\x8d\\xdd\\xb06\\xac\\xf6\\xf5\\xad?\\x08\\xd5\\xe3g\\x1d\\x8fL\\xec}v\\x9b\\x07\\xce\\x9f\\xcf5\\x8eh\\xb0\\xa0\\xbd\\x02\\xa2\\xd4\\xfe\\xb7\\xb6\\x07G}vk~\\xd3\\xe1\\x10i\\xcb!\\xd1\\x1b,\\x87T\\x1f\\xa9\\xf9[\\xb3\\xed\\xcb\\xb3\\x9amZ\\xd6\\x1d\\xa2\\xd4v\\xa3\\xe7\\xf8\\xd5\\xf3\\x07\\xdd\\xbf\\xff\\x03D\\xe8\\xe7s\\xa6\\xf7\\xc2r\\xa0\\x9foW\\xb7\\xaf\\x1e\\x17.\\xfce\\x1bD\\xa9\\xe9@\\xa7\\xf0jS\\xb0\\xf9\\xdcz\\x88\\xa4\\xfa\\xe0\\xdf?\\xc6\\x89\\xfd\\x03\\xeb\\xd3\\xf4\\xd0\\xe5\\xe5\\xcb\\x1fU\\xe1 B\\xbdw\\x8eH\\x7f\\x88X\\xfb\\xe7\"\\xa1\\x9cw5\\x7fJ+\\x17\\x84\\xda\\x0bP.h\\x7fkZ\\x7f\\xd1\\x89\\xe5\\xe5!JMo\\xc7\\x9f\\xb7\\xb9\\x92\\xf7\\xf0\\xea&\\x8c\\x91-:\\xc4M\\x9d~\\xe8\\x13<N\\x03\\x06f\\x9f\\xdf7~_q\\xa1\\xe34\\xf1\\x91\\xe2\\xf6\\x88\\xd0\\xe5;p>Y\\x91\\x14\\xfb\\xfe\\x85^\\'!\\xd2\\xce3\\xd1\\xda\\xdb\\'*\\xff6-j\\xc5\\xc1E\\x10\\xa5\\xb6\\x7f.\\xa6\\xcfG\\x832)\\x07\\xa2X\\xff\\x1b,\\xa7\\xb1\\xfb\\xe2\\n\\xb5\\xfbGxA\\x94\\x9a\\x8f\\xce+9`b\\xe0\\xc3\\x8f\\x1b@\\xa4\\xb5Kh\\xfb\\xc7U\\xfah\\x8d=\\x8a\\xb4\\xc0;\\xc3\\x96c|\\xff\\xc7M\\xe7\\xbb<\\xbc|@\\xac>\\xba,+\\xff\\x9b\\x9f\\x93t\\xbdq~\\xe9\\xac\\xed\\x95\\x8a\\xbd_\\xc9\\x1fc\\xc1\\xe4\\xdd\\'V\\xfe\\xb6\\xa1\\x11\\xe6\\xa3m\\x86\\xccg\\xee\\x1d/\\xe7\\'\\xd4\\xffV\\xb2\\xdc\\xf6\\xca]Z\\x17N\\xc7ye%\\xc5\\x9e{>\\x1f5\\x80(s\\\\\\xc7(t~\\x1b\\xd2\\x9b3\\x7f\"\\xae\\xcf.\\x81\\xfexX\\x9f\\x0b\\xf3\\x96\\xdc\\x7f0p\\xca\\x07\\x10i\\xe7\\xcdh\\xebS=\\xc6#w\\xda\\xdd\\x81\\xff\\x81(u\\\\\\xda\\xbf\\xcd\\x7f\\xe0*\\xbf\\xa5[\\xf3\\xbaW\\x82R\\xfa\\xd5\\x81\\x88\\xf9\\xc1\\xc6\\x1d\\xf3\\x9a\\xbe\\x98\\xe5\\xf3s\\xaa@\\xb9\\r\\xfb\\x87\\x14\\xf7\\x84\\xe9Z\\xaa\\xb8\\xa7\\xf7<\\xe6\\xa7h\\x98h%D\\xa8\\xbf\\t\\x8d\\xb7\\x84\\xfa\\xdbZ\\xc3\\xeei=/\\xcc\\xac\\x06Qj;\\x8b\\xd4?\\xb4z\\x08\\x89\\xde\\xb2\\xaf\\xa64Y\\xbc6\\xed>\\xce[\\xee\\xca\\'w\\x8d>\\xe8\\x07\\x11\\xfaC\\x84\\xce\\x97\\xc0\\xfa\\xc4U2l\\xc8-\\xec\\xc6A\\x94:\\x1ei\\xfe\\x0f\\xd7\\x97\\xbd\\x9f\\xed\\xdb\\x11\"\\xed|\\x16\\x89\\x0e\\xe08\\x15;\\x7fJ,\\x07\\xf8\\xdf\\x92\\xb7|\\xd2\\xcb\\xb4u\\xe9C\\x88\\xb0>$\\xff\\x1b-\\xdf!\\xc5\\xe1c\\xb9\\x8d\\xe9Zl\\x1c\\xfe\\xa4.)~+\\xd8\\xbd\\xd7!B\\xfb\\x874OK\\x1b\\xef\\xb2\\xb7w\\x97\\x8eg<\\x87\\xed\\xc3\\xc8\\xd4X\\xceu\\x9f{^\\x01\\xf5k\\xd2\\xf8!\\xf5\\x0f\\xd4\\xaf\\xe7/\\xd3\\xfbYc\\xca+ \\x8a\\x95?7\\xbf\\xf4\\x8a<\\xbb!\\xa7\\x10\\xe7e\\xbf\\xde\\xbd\\xd1)i^>D\\x12]c\\xfbt\\x9c#O\\xab\\'\\x8a\\xa5\\xeb\\xbb\\x94t\\xed\\xaayZg\\xf1U\\x98\\xef\\x90\\xc6\\xcfmJ\\xbe\\xe3,N\\x15\\xd3\\x81P\\xbe\\x03\\xf5\\x10\\xb1\\xfa\\x01\\x89\\x1f\\xbc\\xabx\\xa4\\x1d\\x9fO\\xbb\\xb5bb\\xca\\x02\\x8c=L\\xde\\xbf\\xb7\\x90\\xa7$I\\x1d\\x8f\\xe4\\xaa\\xb8\\x8d%\\xb9\\x13Z\\x1f\\xf5\\\\\\xb3\\x06b\\x94\\xe3:\\x8c\\xc3\\xa7\\xa5k8N\\xe5U\\xc7\\x1cm\\xb1\\xa9B.D\\x18\\'$t\\x1e\\x1d\\xc6\\t\\x89\\xd5\\xafI\\xed\\x06\\xe9:p\\xf9\\xf0\\xf8#\\x87o( Jmo\\xdfh\\xb0c]\\xa9Q\\xe1U!B>\\x9a%\\xd0\\xff&5\\x1f%\\xcd\\x03B>\\xfa\\xed\\xc5\\x1d\\x0frZ\\xab\\xcbC\\xa4\\xf5+\\xd3\\xfaC\\xa4\\xf2\\xf3\\xc1r\\xfe\\xaa\\x9f\\x8f\\xc4\\xafIq\\xd1\\xd0\\xcf\\xb7o\\xf5\\xf2\\xf4\\x82\\xd9\\x85\\x8b \\xd2\\xea\\xd7$~\\r\\xdb\\xedV\\xbb\\x8e\\xee\\xc3\\x1f\\x163B\\xa4\\x9dg\"\\xf1k\\xa9\\xe7\\x99Hq\\xdep\\x9eI,\\x1d\\x90\\xfc\\xfe\\x90\\x0e\\xfem\\xf1.\\xb5\\xab1\\xd5\\xd9]\\xec$\\x88\\xb4q\\x90$\\xbb\\x1e\\xea\\xbdb\\xf5Q\\xa2\\x9f\\x0f\\xe8\\xa3\\xae\\xe2\\xd7?\\xcc\\xbe\\xe4\\x13\\x17\\xeev\\x04\\xa2\\xd4\\xf1\\x89\\xdb6\\x0e\\xf8\\xfe\\xdc\\xb9>\\xefA\\x94\\xda\\x7f]sU\\\\\\xeb}\\x03j\\x86@\\x94:^\\x994\\xdf(u\\xbc\\xb2\\xab\\xec\\x1f\\xda\\xb8\\xc1w\\xed\\x7f#\\xc5\\xbb@\\xfdz\\xfc\\x89q\\xbe^\\xde\\x13\\xf6A\\x84t\\x90\\xedd\\x9cB\\xfd\\x1a\\xd6\\x07\\xcbO\\x88\\x98\\x8fb\\xbe\\xb3X`\\xff@\\xbeS\\xa2w\\xaf*^qA\\x151>\\xbfx\\xb2jM\\xee\\xac\\x1b\\xf4_\\x93\\xe26H\\xf3\\xdb\\xd0\\x7f\\xed*9\\'U\\\\\\xe7\\x9f\\xe8\\x1a\\xd8?P\\xbeA9\\x87\\xedS\\xa1r.\\xecv\\xa5\\xddef\\x8e\\xc9\\xc3yW\\xc9\\xb9\\xf7N\\xc9\\xce5\\xbb\\xdd\\xe6\\x1aD\\xa9\\xe3:]\\xd5?\\xdf\\x86\\xd70\\x1b\\x06\\x7f\\xd6\\x14\\xcfc\\xe1\\xbc\\xd4\\xfd\\xe3\\xaa\\xf5f\\xb4\\xf3L\\xa4qJ\\xf2\\xc3\\xc2q\\xfaw[G)v\\x1f\\x0c\\xd9\\xda\\x82\\x05>\\xdb\\xb2\\x9aB\\x94Z\\x9e\\x8a\\x9d\\xdf\\xa6\\xa5\\x83\\xcb\\xcf\\xabW\\xbcy\\xacV6D\\xa9\\xe7\\xb3\\xc4\\xae?\\xa5\\xad\\xcfaw\\xb6o\\xb3\\'\\xbd6b\\xf4\\xac\\x91T\\xe2\\xc6\\xa9\\xecP\\xda\\xf5\\x18\\xa4\\xfa@{\\x816.M\\xac\\x9eX\\xb0#\\xf7\\'\\xd5\\x91n\\xa1\\x10i\\xf5k\\x12\\xdf\\x81\\xfa\\xb5\\xab\\xe6\\xb7\\x87\\xed\\xbb\\x12\\xb6p\\xf6\\x87\\x89\\x10\\xa5\\xb6\\x17:\\xdd\\r\\r57Y\\x92\\x08\\x91\\x96\\xaeI\\xfc\\xed]\\xcd\\xd3\\x8a\\xdd\\xdf\\x85\\xb4\\xbe\\x04\\xf6On\\xe9*\\xcd\\xf6O\\xdd2\\tc~\\xee\\xe5\\xbd\\xc1#L?\\xc2\\xf9S\\xdcn\\xf8\\xb9_8\\xf2$:\\x80\\xf3\\xa7\\xae\\xf2\\xfbW\\x1b4\\xf7\\xe1\\xe4\\xa85s0~PS\\x11\\xbd\\xab\\xfd\\xe6\\'R\\xfb\\x955\\xba\\xf1\\xe6\\x8f\\x8f~\\xbd\\n\\xa2\\xd4v\\xa3\\xab\\xec\\xacK\\xdd[G\\xe7\\xb6\\xf0\\x0f\\x86(\\xb5\\\\p\\x95\\xbd=\\xb8\\xb7\\xec\\x00\\x97\\xdc\\xf1.D\\xa9\\xd7\\xd3\\x8a\\xb5KH~e\\xa9\\xd7}\\xd0\\xfa\\x95O\\xf7XqV\\xb9\\x87\\xf1\\x87H\\xdb?\\xe5@\\xfb\\xe1\\xcf\\xdf\\x15]O\\xf8$\\xc38\\xa6\\xd8\\xc4\\x95\\x10\\xa5\\xa6kW\\xedg\\x97}\\xa9\\xd6\\xe9\\xaf.\\xee\\t\\x80\\x08\\xed,R\\xbc\\x18\\xa9>\\xd0\\xce2/\\xa9\\xbf\\xbbRJ\\x8d\\x14\\x88R\\x8f\\xd3o\\x96V\\xf9\\x8d;\\xdb\\xa7\\x04\\xc6\\xfaO\\xfcR\\x9e|\\xdfe\\x12\\\\_\\x92#\\xb0\\x1c\\xb8\\xbeD\\xac\\xfc!\\xf9\\x0f\\xa0\\xfc\\xf9\\xf0\\xc4\\x80\\x13_\\xdb\\xda\\xca \\xd2\\xdas\\xb4\\xeb\\x8cr\\x8d\\x85\\x97\\xa6\\xf2n\\xb1\\x10_\\xed+\\xb5\\xb8v\\xce7\\xabB\\xcf\\t\\xb5Ow\\x1e\\x1cz\\xb8q\\xb1e\\xaf\\xe6\\xb7]\\xe6?h\\x91im\\xe8\\xde\\xbf5DZ?9i\\xbf\\r\\xa9\\xfd\\xe4\\xb4|\\xe7\\x89,\\xb1^b\\xd3L\\x0f\\x88R\\xdb\\xa7\\xce\\xf6C\\x91\\xca>\\xf5)\\x97\\xe1ve\\xe7\\xc3o!\\xe2v;}\\xb3p\\xc6\\xc9\\x82<E\\xbd[\\x89\\xe5\\x14\\x9f\\\\\\xde\\xf0W\\xe9Z\\xac\\xff\\x80v\\xbe\\xbe\\\\\\xaf:\\xcf\\x9a\\r\\xe8h\\x81(\\xb5]B\\xeb\\xa7x\\xd7v\\ti](\\xb4Kf/\\xdd(_\\x1a\\xb3\\xfc=\\x88\\n\\xc7u]\\xb9)?\\x85\\xf6\\xcc\\x1c\\xb1\\xc2I\\xbb9\\xb3K>*~\\xa9\\xf5\\xfdU\\x83j@\\x84\\xf1;B\\xf5x\\x18\\xbf\\xb3\\xaf\\xcd\\xec\\xc4\\xc6W#oC\\x94z>\\x98\\xa4\\x1fH\\x1d\\x17-4\\xde\\x05\\xdas\\xb4\\xfe\\xb7\\xa0\\x0bO\\xb7\\x9f\\x99\\x90q\\x06\"\\xa4k\\x1c\\xef\\xe2NY\\x0e\\xa4\\xebC\\xe7?(lQ8\\xe8\\t\\xc6\\xbc\\xd5\\xe1\\xd9\\xfd>\\xdf\\x9e\\x07\\xed\\xd3,\\xf0\\\\g\\xe5@\\xfbtj\\xcd\\xea\\xd1\\xcd\\xea\\x1fz\\x01\\x11\\xd2A\\x0e\\xa1\\x1c\\xdau\\xef{\\x8ey\\xde\\\\\\xfa\\xcb\\xf0\\x02\\x888n\\xe3\\x9f\\xb6\\x1fJ\\xe3c\\xebv\\xee\\xdb\\\\\\xde\\x841\\xb0\\xb1\\xb7\\xfa\\xa3;\\x91\\x05\\xd0\\xde&\\xadk\\xa3]\\'\\xee\\xaa\\xf9m\\xda\\xf9F\\xb8\\x9f\\xeaD\\x81tm(k\\xac\\x12\\xea~\\x82\\x85\\x08\\xcb\\x11;\\xbf-\\xd6\\x7fM\\xcb\\xdf\\xd2\\xd6\\x18\\x9f\\xab/\\xed\\xab\\x0c\\x11\\xd6\\x07\\xfa\\x91\\xc6;\\xf1#I-\\xe7\\xee\\x10\\xca\\x91:\\x0e\\x924O\\x0b\\xc7\\xcf\\xa7e#\\x06\\x0fW.\\xf1\\x80(\\xf5\\xfc\\x8f\\xab\\xf6\\x7fs\\x95\\x1d\\xdc\\xbeT\\xc6i\\xf3\\xde\\x99\\xed!\\xd2\\xc6\\x93\\xd3\\xda\\xc1\\x8a\\xd8_\\x02\\xebmo\\xc2@\\xa4\\xe5;\\xb4\\xfbh\\xd2\\xee\\x9f\\x98!\\xd0n\\x84rn\\xfd\\x9ae\\x8b\\xaa\\xba\\x95\\x1e\\x07\\x11\\x8f\\x9fg\\xb3\\x8e\\xef?X\\xcbM\\'\\xd4\\xef\\x7ftU\\x8b\\xed\\x0b\\xa7\\x1d\\\\\\x8f\\xf3b\\xf7i\\xa4\\xd5wV\\xae?\\xda\\xd7mC\\xd8h\\x88\\xb4v\\x16q?;\\xc0w\\xc4\\xfa{i\\xf7\\x0bp\\xd5\\xfc\\xa9os\\x8f\\x06\\x17>[5\\x0e\\xa23\\xbf?\\x96s\\xb4\\xfbu\\x8a\\x8d\\x87\\xfd\\x9d\\xd4?\\xc0o\\xe9\\xaa8U\\xda\\xf9F\\x92\\x9f\\xe2\\x1e\\xa1>\\x90\\x8f\\x8a\\xf5#\\xd1\\xea\\x89\\xae\\xdaoc\\x82\\xf2\\xf1\\x84\\xf8\\xdc\\x8eO!\\xd2\\xc6\\xc3\\x92\\xf4\\x1dho\\x8b\\x8d\\x7f{A(\\x07\\xd6g\\xcbF/\\xb7\\xc4\\nS+A\\xa4}\\x1f\\x0b\\xad?$\\xd0\\xa3\\xd3\\xee\\xd8\\x1f\\n\\xcb@$\\xd9Y\\xb4t\\x00\\xf9\\x9bX\\xb9@\\xa2\\x03(\\x17\\x8eD\\x8e*\\x7fp\\xd3\\x8b\\x85\\x10\\xa5\\xf6\\x87\\xd0\\xf2\\x03R\\x9c\\x1d\\xa9\\x7f\\xf6{v;w\\\\q\\xa8,\\xce\\xd3\\xc6\\xad\\x93\\xe2\\xecH\\xfd\\x03\\xe3\\xd6i\\xf5QR}h\\xed9\\xb1qB\\xf7\\t\\xfd\\x03\\xe3\\x84\\\\\\xe5\\xa7\\xf8\\xfcq\\xa7_\\xfb\\x18\\xe2\\x9eC$\\xad\\xfb\\xf8\\xab~\\n\\xd6<g\\x9df\\xa3u=\\xc6u)\\xcf\\xfe\\x9b7 \\xba\\x02\\xe6\\xa3\\xb1\\x072\\xf6\\x7f\\xa9\\x0f\\xa99\\x97P\\x0e\\x89\\xbf\\xc1u\\x87b\\xed\\x1f\\xd2\\xba\\xb6w\\xb5\\xbf\\x8b\\xab\\xd6\\x81\\xb9\\xea=\\x0f\\x03g{\\x96,,\\x1cV\\x1a\\xa2\\xd4\\xeb>\\\\\\xb5\\x0e\\xb9S\\xff\\xe9\\x83\\x02>\\xda\\xdc\\x18\\xa2\\xd4\\xedv\\xa4\\xec\\xc5\\x8f\\xe7\\xf6\\t\\xac\\x08\\x11\\x96C\\xd2\\xab\\\\\\xb5\\xaf;\\xed{yf\\xcc;\\x11\\\\\\xc72t\\x13DZ=\\x04\\x0b\\x18g~\\xf2\\x12On\\xeel\\x9evg#DR\\xff`>:\\x15\\x94\\xeb\\xac\\xddh\\xf9\\xf56\\xc0\\xdf\\xa6:\\xe1\\xa3\\x90_\\xd3\\xbe\\xe7ap\\xdaOk/\\xe8\\xbd\\xd7\\xd2\\x96\\x03\\xc7O\\xb5Ck\\x9e\\xf4^f:\\x85\\xb1\\xce\\xf3\\x80\\xf4g\\xb5\\xbe\\\\F\\xb2\\x7f`9$=\\x04\\xda?\\xae\\x8a\\x13\\xa2\\xe5\\xd7B\\xe3]R\\x1b\\xaas\\x07\\xf7>\\x8b\\x9bEt\\xbc\\x0b\\x89\\xde\\xa4\\x8e\\xc3\\xa7\\xd5w*\\x97\\x1f\\xedVx\\xf4F\\x1aFU\\xc1\\x92\\xd9)]\\x9f\\x1f\\xfd\\xbb\\xf9\\xc5h\\xed\\x05\\xb1\\xeb>H\\xfd\\x03\\xfdb\\xae\\x92\\x0b\\xad\\xe7\\xce\\xfcz\\xdd\\x81\\xde\\x0f&\\x9f_u\\xba\\xc9O\\x8b\\x87\\xcd\\n\\x19n*\\x9c\\x12W\\t\\xea\\xa3$?\\x1fm\\xdc\\xba3?\\xb9T\\xfb#\\x89\\x95\\xdb\\xc4\\xb8\\x00 \\xb7i\\xe3\\xdf\\x84\\xcaS\\x18\\xff\\xf6o\\x8b\\x83\\xdc\\xd8\\'\\xbeZ\\'s\\x9b\\xa7\\x10\\xa5\\x8e\\x17\\xfb\\xa7\\xac\\xab&\\xd9s\\xd0>\\xfd\\xbc\\xfb\\xcf\\xcbj\\xf5\\x18\\xf7\\x14\\xa2\\xd4t\\xe0*\\xff\\xe8\\xe5\\xd4\\xf1?\\xecY\\x9b\\xb7\\x0f\\xe2?5\\x1e\\xd6U\\xef\\xf1\\x14\\xab_\\xdf$\\x94\\x03\\xf5\\xeb\\xb9\\xca\\xe6w{\\x1f\\x88\\xaa\\x8bqs\\xd0\\xa8K\\x17j\\xdc\\xcc\\x12\\xba/5\\xd4\\xaf\\xff\\xea\\xbe\\xd4b\\xf7\\x1fuU\\xdc\\xd3\\x96\\xba\\xcd<;\\xcf\\xdb[\\x15\\xa2\\xd4qO\\xe7\\n\\x9a\\xcc\\xca\\xc9n\\xf7\\x18\\xa2\\xd4\\xfb\\x8f\\x8a\\xa57\\x92~\\xf0W\\xe7\\x83\\x9d\\xf9\\x13!\\xbd\\xfd\\xd5}\\xdd\\xc5\\xfa\\x13\\x07\\x06\\xb5\\xe3\\xee\\x0cm\\x92\\xf7\\'t\\\\\\x97L\\x7f\\xd3<\\xfbq\\x9f\\xdb\\x81\\xe1\\x18K\\xe8\\x8e\\xb4\\xee\\xb0\\xf6\\x9e/\\xad?\\xb1>\\xa1\\x1c\\xa8\\xbf\\xb9j\\xde\\xf9\\xce\\xe1\\x9d\\xf7\\x17~\\xbf`\\'D\\xa9\\xe7\\x9d]\\xb5_\\xa7\\xab\\xf6\\xd1\\xa4\\x9do\\x84\\xfb\\x98\\xe1\\xf9F\\x12?\\x90\\xda\\xde\\xa6\\x8d\\xe3\\x12\\xbb\\xaf\\x14\\xc9\\x9e\\x83\\xfcz\\xe6\\n\\xf9\\xb9K\\xcf\\xefxa\\xdc\\xdc6\\xec\\xe33]\\x7f?\\r\\xe5\\x9c\\xd0\\xf5\\x80P\\xce5\\x9c\\xc3\\xd8F_\\xdb\\x7f\\x15\"\\xb4\\x17\\xb0\\xdf\\x05\\xff\\xfe\\x19N\\xfc.\\xd0^8\\x1f9bF\\xcc\\xd0\\x99\\x91\\x10\\x9d\\xf9]p9\\xb4~\\x17\\xb1~\\n\\xd2\\xbc\\xb3\\xd4\\xebrH\\xfa5\\xb4\\xe7\\\\Eo\\x15l\\xc1\\xdf{\\xa6eeA\\x94z\\xfdi\\xc7\\xcfO\\x1a\\x8c\\xb9\\n\\x1bD\\xd2\\xbc&\\xdc\\xd7\\x90v^f\\x95L\\xd1\\xae\\xc7G\\xb5J@\\x84\\xe5\\x08\\xb5\\xb3`9\\x0fK|>\\xac\\xb0{\\xbb1\\x18\\xf1\\xfb\\xf4h\\xe3\\x02H\\xebB\\xa1\\x1f\\x89V\\x8f\\x17\\xba\\xdf \\xd4\\xe3]\\xb5o\\xb8\\xd8u,D{\\x0e\\xaccy\\x7fu\\xc6\\xad\\xee\\xa7K\\\\\\x86\\x08\\xe5\\xb6\\xd0\\xfd\\x0f\\xa0\\xdc\\xa6\\xf5\\xbb@97\\xcb\\xfd\\xcdz\\xc0r \\x1f-v\\xbeO\\xbb\\xf7\\xdd\\xcf\\x96\\x81(\\xb5\\xfe6;5F\\x13\\xb1ie\\x19\\x8c\\xcf\\xdf\\xcby\\x12\\x90s\\xbb#\\xed\\xfb\\nH\\xfa\\x0e\\x9c\\xd7\\x1c9\\xe2g\\xe3\\xd0u\\xdf\\xfd\\x04Q\\xea\\xfa\\xdc\\xcc\\xbceT\\\\]i\\x85H[\\x0e\\xad~\\xe0\\xaa\\xb8\\xdb\\xe3\\xa3o\\x97\\xce\\xbb\\xfbE\\x12\\xc4(\\xc7uR\\xbc\\xf2\\x04\\x81|\\xb4\\xce\\xf9\\xaf\\x8e\\xd5T-\\x0f\\x85\\x08\\xcb\\x81r\\x1b\\x97\\xe3\\xaa\\xf7\\xa8\\x91\\xe4\\x1c\\x94\\xdbb\\xe7\\x83\\xffnq\\xf8O\\x83\\xaf\\xb5/\\x96X\\xda\\x13c\\xbb\\x03\\x19\\x1d\\xee\\x9d\\xa8:P\\xeay\\x0c\\xb1\\xf66\\x89\\xae\\xa5^g\\x84\\xe3n\\xa1\\xbd\\r\\xfbGl\\x9c\\x1d-\\xdf\\x19\\xbd\\xe1r\\x1d\\x9f=\\x9f,\\x85H\\x8aC\\x81\\xf1.\\xb4q\\\\\\xae\\xa2\\xb7\\x92\\xd9\\xda\\x9d\\x8f\\xab>\\x99\\x89\\x11\\xda\\xc1R\\xd1\\x9b\\xab\\xec`\\xb1\\xef\\xdb%\\xb5\\x1b|\\xdf\\xae\\xa1\\xef\\x80\\xb8\\xfa\\xdd\\xea\\x1c\\x81H\\x1b\\xcfG\\xcb\\xafG\\xa7w\\xad\\xfd\\xe9\\x99\\xe1\\x87!\\xd2\\xc6E\\xd3\\xc6\\xd9\\xb9j\\x7f\\xe5\\xc9\\xfdJ=\\xaa\\xf2\\xb8D\\x0b\\x88Q\\x8e\\xeb$9\\'\\xd4^0\\xf6\\x1dt\\'eNO\\x0bDg\\xfa\\x1b\\xf6S\\x90\\xf6Y\\x90z\\xdf\\x08\\x12]C9\\xe7\\xaa}\\x98\\x965\\xeb\\xd7\\xb1\\xd3\\xb3\\xe9y\\x18\\x1b\\x97\\xaf^ol\\xa3\\xe2\\t\\x7f\\xb7\\xf7b\\xd3\\x8e\\xd3\\xbc\\xf5S\\xbd\\xbf\\xef\\x14\\xe5\\x0bQ\\xea\\xf5\\xdbb\\xf7\\xf9\\xa1\\xe5o\\x9f\\xae8d\\xa9\\xd4\\xd0\\x96\\x0c\\x11\\xda\\xf5B\\xf9\\x0e\\xb4\\xeb#\\nZ=:\\xb5p\\xce\\x0c\\x88\\x7f\\xb7\\xf7\\xe5\\xd0\\xc6A\\xbaj\\x1dX\\x83\\x1fk\\r\\x1bpL\\xb7\\x00\\xa2\\xd4z\\x88\\xb1K\\x82\\xcc+g\\xd4=\\x8c\\xfeQ\\x8d\\xbfKK\\x94\\x8f\\xf8\\xbb\\xc5\\xbb\\xd0\\xd6g\\xc2\\xc5V\\xef\\r\\xf0\\xa9\\xfc\\x01D\\xa9\\xfd\\xf1b\\xe5\\x1c\\xd1O\\x01\\xe4\\xdc\\xc3[\\x8dV7\\x1c\\x14\\xde\\x11b\\x94\\xe3\\xba\\xb3u\\xa1\\xb4\\xe3\\xa7\\xf6\\xae{\\xa5\\xc6.\\xadY\\x1b\",\\x87\\xb4\\xde\\x8cV\\x1f\\r\\x99\\xdc.\\x7f\\xd1pK(DX\\x8eX}\\xa7\\xf8\\xc7i\\xb6\\x88%\\xf36C\\x84\\xe5,\\x109\\xdf\\xe8\\xaa\\xb8\\xdb,\\xbf\\x9a\\xa7\\xd2v\\xde\\x9a\\x0f\\x91\\xd4n\\xb4\\xef%\\x85\\xf5y\\x9a\\xc3\\xe7\\x8ef\\xa6\\x8c\\x86\\x08\\xcbY\\x06\\x9e\\x8b\\xcb\\xa1}/\\xc2\\xbf\\xcd\\x1f\\xbf\\xad\\xb0\\xa2\\xcf\\xd3\\xa8)\\xcb1\\xce\\xfc5\\xb9\\xb3\\x95?\\x9c,\\xf5:\\xb0Y&\\xd3\\xf9\\xd2\\xb25\\x1a\\x8c\\x8b3{|\\xba\\xabv\\x9bkP\\xfe,\\xac\\xb0?\\xe1\\xfb\\x8b\\xa5\\xda\\xd3\\xd2[\\xcdo\\x8f\\x04\\xe5n\\xect\\x08\\xe7\\xc5\\xae\\xc7\\xa0\\xd5\\xe3i\\xe3{\\xe7\\x03zs\\xb6\\x1e\\x03\\xea!\\xb4\\xfb\\x1a\\xbaj\\xdf\\x08\\xd2\\xba\\x0f\\xd2\\xfaS\\xa9\\xdf#]\\x8aP\\x1f\\xa9\\xe3\\xec\\x88~\\x7f\\x10g\\xb7\\xcfZ\\xde=x\\xc8\\xf2_1r\\x87\\xb3}v\\x99\\'\\xdf\\x86q\\x01B\\xe3P`\\\\@\\xd3\\xccj\\xca\\xb0;3\\x0eB\\xa4\\x9d\\xff!\\xf9\\x13\\xdfU\\x1c\\xd7\\x99\\xea\\xbb\\xab4\\xac41\\x04b\\x94\\xe3\\xba\\xb3\\xfd\\xf0I\\xe5\\xc0\\xfa\\x0cf\\xe45\\x93f\\xf0\\x171n-\\xc8\\x19\\x97\\xb8ia9\\xda}=H|\\x14\\xf2\\xb7;\\x17\\xdb\\xd5;\\x97Tm\\x13D\\xda}\\xa5h\\xfd\\xb0\\xae\\xb2\\x1b\\xd3z\\x7f\\xdc0~f\\xd3\\xb6\\x10\\xa5~o\\x85X\\xfb\\xe7\\x02\\xa1\\x1ch\\xffl\\xf9 \\xd6\\xbd\\xb2\\xa5\\xd6M\\x88\\xb4v\\t\\xed:\\x16\\xb1q\\x1be\\x1c\\xf8\\xbf\\xe6oD\\xff(\\xe0o$\\x7f\\x95\\xd4vp\\x87\\t\\xb1;\\x8ek\\xadW!J\\xcdw\\\\5~\\xe6oT\\xe7t\\x99\\xd2%\\t\\xa2\\xd4\\xed\\xf6\\xae\\xde\\x8b}zBP^\\xfd\\x8d\\x1e\\x8c\\xd4\\xf3\\xdb\\xa4\\xf8k\\xa9\\xdf\\xbf \\xd6\\x0e&\\xed\\x87\\x02\\xf5\\xc4)\\x13\\xdd|u^\\x01\\xa3!\\xd2\\xc6\\xa1\\x90\\xe46\\xd4\\x13\\xa7-\\xb6\\xad\\\\tiF\\x1d\\x88\\xae\\x8e{\"\\xed\\x97\\xe6\\xac\\x1cH\\xd7\\x9935\\xf1\\r\\xcb\\x1f<\\x07Q\\xea\\xfdP\\xc4\\xda\\xc1D\\xbb\\x11\\xdaY\"\\xf5*\\xda\\xfdw<F&EOc\\x8a7\\x81(\\xf5\\xfb\\x99\\xc4\\xae\\xfb \\xf1\\x1d\\xb8\\xeeC\\xe8\\xba\\xd0\\xbf\\xea\\x7f\\xf3\\xeb8u}\\xa3\\xf8\\xdf\\xebc\\x84\\xeb\\xe7\\xf0{\\xbeIv0\\xc9\\xaeWE\\x16\\xbbV\\xad\\xcb\\x95W\\xfbF\\\\~\\xfc(\\xf4\\xe6/\\xf7|!B~\\xb0F`\\xff@~@\\x8a\\x87\\xa5\\xb5\\xb3h\\xd7\\xe9\\xb9\\xca\\x9fH\\xbb\\x9f\\x9d\\xd8\\xf87\\xdau\\x87\\xa4\\xf8*\\xda\\xf7;\\xd3\\x8e\\x1f\\xa1\\xef{\\x87\\xfbz\\x88\\xd5\\xafI\\xf3\\x80\\xefj~\\xe1H\\xc6\\x8e\\x98u\\xdf\\x96J\\x88*\\x7f\\xafq\\x8e1\\xd4\\x13\\xf6\\x8f\\xb3\\xf7\\x19\\x91\\xe8\\xa0\\xde\\xfe\\xd8\\x96\\xc5R\\xabU\\xc6\\xf9\\xb3\\xcb\\xbe\\xd1\\xf6o\\xb0\\xb37F\\xb8?9\\x8eW\\x16\\xaa\\x87\\xc0xeW\\xcd/\\xd0\\xd2\\xb5\\xd8\\xf9\\x05W\\xed\\xc3T\\xadG\\xac\\xf1H\\xc6\\x80\\xfe\\x10\\xa5\\xde\\x9f\\xc2U\\xfb0Mkx\\xc7\\xbb^\\xc0\\xa7\\xefC\\xa4\\xd5\\x13I\\xe5\\xc0\\xfa\\xa8\\xfa\\xcc\\x1d[\\xe7JeO\\x88R\\xef\\xb3\\x1d\\xfc\\xe1\\xe2Y\\x87/\\xae\\xad\\x05\\x11\\xf3\\x03,\\x17\\x84\\xea!p=\\x86\\xab\\xdeS\\\\!\\xbc\\xf9\\xfa[\\r:n\\x83H\\xbb\\xaf;i_j8~\\xd6\\x1avO\\xebyaf5\\x88R\\xc7\\t\\x95\\xbf=g\\xbf\\xc7\\xd3\\xcdY\\x10i\\xf5\\x03Z}\\xf4\\x9f\\xa2\\x1f\\xd0\\xce\\x03\\xc6u\\xffeS\\x87\\x90\\xd4\\xdb\\x10\\xa5\\xe6o\\x97\\r\\xdb<\\x1f\\x1b\\xc3+b\\xc4\\xef\\xef\\x83\\xfa(I\\x0f!\\xd9%\\x91\\'\\xee\\x87\\r\\xbd~w0\\xce\\xbb\\xea}m\\xf5\\xbb\\xe4\\x17o\\xfcU@,\\xc4\\xbf\\xdb{\\xeeh\\xc7\\x8f\\xab\\xfcH\\xde7\\x0f\\x18O7\\xba\\xf5\\x18\\xa2\\xd4~$\\xb1\\xedF\\xbb/\\xa8\\xab\\xe6e&+\\x7f\\xdb\\x95\\xbe\\xfdK3D\\x92<\\xc5\\xf6\\xceL\\x81\\xf3s\\xb4tM\\xea\\x1fZ?\\xb9\\xef\\xf6\\x01\\xea.wo,\\x86\\x88\\xf5\\xf8\\xc5\\xe5\\x9ag\\x87-(\\xb7\\x92\\xa4\\xc7_\\xa6\\xec\\x1f\\xa9\\xe2n\\xa5\\xd2\\xe3\\x85\\xea\\xd7P\\x8fw\\x95\\x9foBxHH\\xc5\\x16m\\xc7@\\xfc\\xa7\\xeeo\\xb9\\xabTd\\xf8\\xf4\\x9a\\x95OA\\x94:\\xbe\\x97\\x9b\\x16w3d\\xc4\\xa6(\\x88\\xb4\\xeb\\xebi\\xfd|\\xaez\\xbf\\xd9\\xa4\\x9e\\xadv\\x9f\\x1d;~\\x05F\\x18\\xc7\\x85\\xedF\\xd2|#I\\x1f\\x85v\\xe3\\xd0\\xcc\\x17%o\\x84Fw\\x85\\xe8\\xcc\\xdf;\\xcb\\t\\x7f\\x83\\xfe\\xde~\\xd6%\\xd7\\xe6\\x1d\\x9bS\\x1c\\xa2\\xd4r\\xdbU\\xef\\xf1\\x9cf\\x8dh\\xbdzf\\xdf\\x8f \\xc2\\xfa\\x90\\xe2\\xab\\\\\\x15\\xd7I\\x9aw~W~\\x97\\x89\\x0b+GV\\xa9\\xd8\\xfe\\x05D\\xa9\\xf5\\xdeN|\\x85/\\xc6Wi\\\\\\x06\\xa2\\xd4\\xef\\xcb\\xa1\\x1d\\xa7$\\x7f\\x08\\x89\\xde\\xe08\\xad9E\\x9e\\xdd\\xe9\\xc6\\x06\\x1d\\xc4w\\xb5\\x1e}%x..\\x87v\\x1f\\xf4\\x9c#9\\xda\\x83\\xd5cVC\\xc4t]\\xa1\\x8b\\xbeS\\xd9\\x9d\\t7\\x84\\x8eS\\xcd\\xf9\\xec\\x05y\\xc76\\x9d\\xc2y\\xb1\\xfa(\\xed\\xfa\\xc6:\\xe3\\x9b\\xf5q{\\x9e9\\x14\\xa2\\xd4\\xfb\\xc8\\xe4G\\x9d\\xfc\\xb1C\\x1b\\xf9\\x12\\x88R\\xcbS\\x12\\x1dD9\\xae;\\x8b\\xab\\xa1\\xd5G\\x97\\xe7m\\x1e5m{\\xb8\\x1fDL\\x07U\\xae\\x96X\\xbcrA\\x87\\x06B\\xf7\\xab)\\xe9\\xb7\\xe7\\xdc\\xe2Rz\\xcc\\xbeD\\xcb\\xed\\x07\\x84r\\xa4\\x8e\\xb7\\xa4\\xdd\\xdf\\x1f\\xeb\\xbb\\xffk\\xffuj\\xaf\\xd5\\x85?\\xc5-\\x9a\\x83\\xf1\\xbdS\\xb2s\\xcdn\\xb7\\xb9\\x06\\xf9\\x9b\\xd0\\xb8N\\xc8\\xdf\\\\\\x15\\x87\\xe2*\\xff\\xce\\xce2_o\\x0empb,D\\xa9\\xe3\\x1c\\xc4\\xce3\\xd1\\xae\\xe3?\\xfe\\xbc\\xcd\\x95\\xbc\\x87W7a\\x8cl\\xd1!n\\xea\\xf4C\\x9f\\xc0u\\xef$?\\xf9\\x0bB9p\\xdd\\xbb\\xab\\xd6\\xff\\xdc\\xaa\\xf7$\\xcc\\xad\\xc9\\x93:\\x10i\\xd7\\xf1\\x97\\x04\\xe5\\x91\\xeas\\xea\\xc0\\x98Y\\x97C6-\\x87\\x88\\xf9\\xce\\xb8\\x17S\\xbc\\xddF?\\n\\x14jg\\xdd\\xf0}j\\xf0\\x1f\\xd5\\xc1\\x82\\xf3mZl_\\xb0d\\xda\\xc8#\\x10\\xa5\\x8e\\x0fqV\\x9f\\x1a\\x965\\xe5\\x96\\x9d\\xed\\xb9[\\xe8~\\xb7\\xe1\\xaa\\x9c\\xe09K\\xfe\\xbb\\x07\\xe7]e7^\\x89O\\xe83\\xe2\\xdb\\xd0\\x19\\x10i\\xfd.\\xb4\\xf1\\xfe\\x91\\x8f,\\xeb\\xc6\\x8eL:\\x0f\\x11\\xfb\\xc9\\xa5z\\xcf\\xdd\\xb0\\x80\\xdb9\\xb9\\t?*!\\n\\xf5\\xbb\\xc0r>3\\xa7LZ\\xfa\\xa8+6\\x9f\\xdc\\x82\\x7f\\x8f\\xbb\\xd0m\\xc0\\xcd\\xd6\\x10\\xa1~-t}#\\xd4\\xafi\\xc7\\xa9\\xd0\\xfd]\\xe08uU\\xbc\\xb2\\xab\\xe4\\\\AF\\xf0\\xe3\\x89\\xa5\\n>\\xc4\\xf8\\x9f\\r\\xb7\\xbd\\xae\\x1ek\\xc1\\x93\\xf6\\x95\\xa2\\xb5O\\xa1\\x1e\\xff \\xde\\x7f\\x80\\xdf\\xfeq>\\x10i\\xdb\\x8d6\\xde\\xdfU\\xedv)\\xe2\\xab\\xb0m\\xf3\\x7f\\x18\\n\\xf1\\xef\\xb6^\\xf3$\\xa1\\x9cw\\xb5o\\xc4\\xf5\\xb6\\x9d\\xcf\\xb6\\xac\\x95c\\x83(\\xf5{\\xbe\\xffm\\xfb\\xad\\x17K<\\xdat\\xf3\\x1e>\\x1e\\xa2\\xd4~\\n\\xb7\\xe6u\\xaf\\x04\\xa5\\xf4\\xab\\x03\\x11\\xd7g\\xe3\\x8eyM_\\xcc\\xf2\\xf99U\\xa4\\xdf\\xa5\\xea\\xb3oL1-\\x9f^\\xc0\\x88\\xf5Q\\xda\\xf9F\\xd2\\xf8\\x81\\xf3\\x8d\\x13\\x1b\\xac\\x1erwd\\xcb\\xf5\\x10\\xa5\\x9eol\\xfd\\xf3\\xf1\\xdf\\xaa\\xa4\\xe9\\x97@\\xa4\\xf5+\\xff\\xdd\\xf6=N\\xf8p\\xc2\\x92\\xd3\\x1d\\xd7\\x95\\xc4\\xa8\\xd6\\x19\\xd8\\xc7K\\x0e\\xcf\\xa5\\x95\\x0b\\xa4r\\xa0\\\\\\x10\\xfb\\x1ev\\xda\\xfa\\xb8J.<\\x7f\\x18\\xd9S\\xfei\\xf5|\\x88R\\xcb\\x05\\xb1\\xfc\\x8d\\x14\\x1f\"\\xb5\\x9f\\x82\\xf4\\x9eb\\xe8\\xa7\\x10\\xbb\\x9f\\x1dq\\x9fF`\\x07\\xfb\\xab*>\\x1a\\xa1h\\xf4\\x18\"\\xe6o\\xce\\xd6\\xb5\\x91\\xe4B\\x93\\xb83]+\\xb7\\xae\\x97\\x81\\xf37\\xfa\\x15\\x9c\\xabk1W\\x81(\\xb5\\xffzb\\xcf\\x0e\\x9f\\xb5\\x9c23\\x15\"m\\x9c\\x10\\xc9\\xef\\x02\\xedz\\xda\\xfd\\x13\\x85\\xae\\xa7\\x85\\xfb\\'\\xbaj_\\x9c\\xb6#l5\\xfe\\x93\\xf0\\xb5\\'D\\xa9\\xfd\\xb0\\x8b\\xbb\\xac\\x984r\\xa3\\xea7\\x88R\\xef\\'\\xd4pE\\x839\\xf2\\xc3{\\xfd0\\x06\\xa7\\x04qW\\r\\xfe\\xbfB\\xff\\x9bP>*\\xb5\\xff\\x8d\\xb4\\x9e\\x16\\xf2\\xd1>?\\x97\\\\\\xb4u|\\xcb;\\x10i\\xfb\\x87\\xe4w\\x81\\xfdC\\xda\\xdf\\x05\\xf6\\x0f\\xa9\\x1c\\xd2|=\\xec\\x9f\\xff_\\xdfG)\\xd6\\xef\\xf2\\xc5\\xd4b%\\r\\x8f\\xef=\\xc28\\xaf\\xe4\\x80\\x89\\x81\\x0f?n@\\xab\\x87\\x90\\xe6\\xb7\\xa1\\x1e\"\\xd6\\xce\\xbaH(G\\xea\\xf9S\\xda\\xfd\\xf0\\x07\\xadP\\\\H\\xaf\\xb61\\xac|\\xcd\\x15\\xc5k\\xce\\xab\\xf8\\x1c\\xe7i\\xe5)\\x89\\xde\\xd24\\xea\\x87\\xcd\\x02\\xa6\\xed\\xc7\\xf9\\xd3M\\x19\\xd3\\x07\\x9fN\\x1f\\x06Qj9\\xd7\\xf4\\xd0\\xe5\\xe5\\xcb\\x1fU\\xe1 J\\xbdN\\xcfU\\xf1b\\xa4}\\xdd\\xe1<\\xad\\xd0\\xf1\\x03\\xe7i\\xb7\\xe7\\x8d=\\xbe\\x9e\\xf7\\x8a\\x81\\x18\\xe5\\xb8\\xeel_\\x1c\\xda\\xf99\\xb1\\xfa(I\\xceI\\xad\\x8f\\x12\\xe3w\\xfe\\xe2\\xbc\\x19I\\xaf\"\\xf9{\\xe1\\xbcY\\xe5\\x15Q\\xad\\xaf7fJA\\xa4]W\\xf0\\x82P\\x0e\\x94s\\x9b\\xc2\\x97\\xa7\\xe7}k:\\x0f\\x91\\xd6\\xafL\\xebwq\\xd9\\xfb\\xa6Z\\x8c\\x9e9\\xcbK\\x1e\\x03Q\\xea\\xfd\\xc9W\\x8fmQ0\\xb6j\\xf3\\xfe\\x18?\\x18=\\xf6V\\x89\\x85M\\xbe\\xa7\\xf5S\\x90\\xe8\\x1a\\xae\\xd3sU\\xfcN\\xc0\\x86\\xeb\\xd5\\xe4\\t\\x83[b\\x84t\\x8d\\xeb\\xe3\\x8c\\x8fB\\xf9\\x03\\xfd.b\\xd7k\\x92\\xe8\\x1a\\xae\\xd7\\x14;\\xdfH\\xbb\\xcf\\xb6\\xd8\\xf8\\x10\\xdau,\\xae\\x8a\\x8f\\x9fi\\x9d\\xec5$\\x8c\\x1f\\x01Qj?E\\x8f\\xe8A\\x93T\\xfa3#!\\xd2\\xd25\\xed{c\\xc5\\xeaU$\\xff5\\xd4\\xab\\xac+9\\xcf9;\\x7f\\xaf\\x03\\x916\\x9e\\x82\\xc4G\\xc3nW\\xda]f\\xe6\\x98<\\x9c\\xf72\\xad\\xce\\xfd\\xaeld\\xed\\xf5)K\\x02<\\xf6\\xb6+\\x85\\x11\\xaf\\xd3\\xc3zU\\xba@=\\xa4\\xec\\xdd\\xb4\\x03#\\x9fU\\xe8\\x8e\\xf3\\xba\\x95\\x13\\xc7\\x9c,\\x17y\\x00\\xa2\\xd4\\xfa\\x9b,\\xf3f\\xe9^%\\xc2\\xebB\\xfc\\xa7\\xeao\\xc7\\xcfV1\\xff\\xba\\xf5\\xd9\\x1c\\x88R\\xdb?q?n(\\xb3g\\xe7\\xa3$\\x88\\x7f\\xb7}qh\\xdf\\x07&v\\xfe\\x07\\xdb\\xf5\\xce\\xe6\\x99\\xc4\\xea\\xa3$\\xbb\\x9ev\\x9f`Lox\\x9f`\\xa1\\xf4\\x06\\xeb\\xd3\\xe8Xh\\xd7i\\xc3\\x1e6\\x83(5\\xbd\\x91\\xec\\x92(\\xc7u\\xa9\\xd6\\xbdK\\xa5\\x87\\xc0r\\xa0\\x1e2\\xe4\\xb9\\xfb\\xa2!-\\xb7\\x0e\\xc4X\\xb0#\\xf7\\'\\xd5\\x91n\\xa1X?`7\\xac\\r\\xab}}\\xeb\\x0fB\\xf5\\xebY\\xc7#\\x13{\\x9f\\xdd\\xe6\\x81\\xf3\\xaeZW\\xdd\\xf5\\xdc\\x86\\xb1wJ\\xdf\\xa9\\x05Q\\xea}[\\xc5\\xcamZ~\\xe0\\xe6W\\xbf\\xf3\\x0e\\xb3\\xa2\\x1fD,\\xb7=\\xc2W\\xd5\\xd7\\xed\\xda\\x1c t\\xfd\\x0f\\xed|\\xa3\\xd4\\xf46{\\xbf\\xfa\\xf3\\xa1;.u\\x83\\x08\\xc7\\xa9Pz\\x93Z\\xaf\"\\xd1\\x81\\xd4z\\x15\\xa9\\x7f\\xde\\xd5\\xfc\\xf6{\\x1e\\xf3S4L\\xb4\\x12\"\\xf4\\'\\n\\xe5o\\xd0\\x9fH\\xda\\x07\\x1d\\xd6G\\xe8\\xfc6\\xac\\x8f\\xab\\xf4\\x1d\\xd9\\x9c\\xde\\xbe\\xef\\xad\\xa9g\\x82(\\xf5|\\xc9\\r\\xdf\\xca)\\xe7\\xea_\\xf3\\x81(\\xb5\\xbes\\xe5r\\xbb\\xab\\x89n\\x13\\xeeB\\x8cr\\\\\\x87~1\\xf8^\\x04\\xday\\x19\\xc8w0b\\xb9\\xd0\\xdb\\x81\\xe5\\xab\\xf8\\xfah\\x1f\\xce\\xd4\\xfe\\xd5\\xf9\\xed\\x7f\\xdb|\\xb0T~\\xf2?\\xd1\\xb5\\xc4\\xfb\\xcc\\x11\\xe7\\x1b\\xc1\\xbc\\xb3\\xab\\xec,g\\xeb\\x99\\xa4\\x9a\\x0fn\\x9e\\x19\\xda\\xfd\\xb4\\xdc\\xeb\\x0eD8\\x8f.4\\xde\\x12\\xce\\xa3\\xcf\\x9b\\xed\\x19\\xf1\\xcck\\xb7\\r\\xe3\\xdd\\xff\\x06\\xdf-U\\xfe\\x91?m\\xfc5\\xa9\\x1c\\xe8\\xdf\\x11k\\xff\\x90\\xf8\\x8e\\xd4\\xf6\\x0fi\\xfe\\xe7]\\xc5\\xbf\\xb9\\xea=)\\xdb^,n\\x1e\\xaf\\x9d\\xdb\\x1d\\xa3T\\xeb\\xb7\\xa1\\xdfE\\xac<%\\xcd;CyJk\\x97\\x08\\x9dw\\x86v\\x89\\xd8u\\xae\\xb4~\\xff\\x13\\x0f\\xea\\x1d\\xa9r\\xa3\\xd62\\x88\\x98\\xae\\x175}^\\xb7d\\xf5\\x89\\xb5\\x84\\xf27X\\x9f\\x9d\\xab\\x9b\\x8e\\x8fX\\x96\\x7f\\x00\\xa2\\xd4z\\xc8\\xda\\xf2i\\xcd\\x1e\\x16\\xee\\xdb\\x85\\xb1\\xffC\\x8d\\xfb\\x9d\\x03\\xfaaPO$\\xc5\\xf3\\x91\\xfc\\x96PO\\x14\\xab\\xc7\\xd3\\xee\\x97f\\xd5k\\x19\\x19\\xab\\xcf+\\xc6\\xba\\xdb\\xff\\xdc\\xdc\\xdd1\\xba\\xe1\\x0c\\xfe\\x0c\\x9e\\xbf~+\\xbc\\xea\\xe6\\xfe\\xf6S77\\x07\\xbe\\xed1\\x84\\xa7\\xbe<s\\x03\\x9f\\xb9\\xdb\\x9f\\xf5\\xd6\\x02\\xff8\\xffS9\\xaf~\\xe8\\x9b\\x9f\\xbb\\xc1\\n\\xfc\\xb9B\\xf0\\x19\\x84\\x07\\x80\\xfb\\xdc\\xde\\xd6\\x10n\\x7f\\xba\\xed\\xed?\\xd2\\xdd\\xedmw\\xbf\\xed\\'\\xbd~\\xd1\\xd1*nnn\\xaf\\x7f\\x06\\xda\\xed\\xcd/\\xb9\\x11\\x7f\\xdc\\xcb\\xa7\\xbdY\\xe3?\\xa8\\xe2\\xb5\\x12^\\x9d\\xb9\\xbd\\xf6M\\\\\\x01\\xb7?\\xf26\\x15\\xabQ\\xf0\\xb1\\xfa\\xdd%XD\\xb16=\\xafSj\\x14\\xfa\\x93\\xee\\x87V\\x1a=<R\\xbd\\x8d\\xde\\xe8_n\\xf2V\\xa9\\x8c\\xdej\\xa3\\xb7\\xde\\xe4\\x9d\\xc0\\xa6\\xfe\\'\\xb5ij\\xf3T\\x1f\\x8bO\\xdf\\xf0\\x00\\x94\\x86\\xa34\\xb5\\x85\\xa9E\\x8b\\x16\\xa9-M-\\xeb\\xb7\\xb4\\xb6i\\xd5\\xaaC\\xcb\\x8eF_?\\xa3_+\\x8b_\\xab\\x96~\\xadl~\\xad|e\\x89>>\\xc6v\\xed\\x8d\\x1d\\xfcR;\\xa5v\\xc9o\\xe4\\xaf\\xd7\\xb22\\xbes\\x18\\xab\\x8b\\x19\\x13\\xc1j\\xf4l\\xe70F\\xcf\\x8f\\x19\\xc8\\xea\\xa2{p:5\\xca\\xe9\\xf8?\\xee\\xd2q\\n|\\x97\\x8e\\xd5\\xbfyWZ7\\xff\\xf0\\xc0\\xa0\\x10\\xff\\xbe\\xc6n\\xdd\\x8c\\xdd\\x02\\xf3\\xdbuc\\xd0}\\xfe2\\xd9\\x98\\x9e\\xacF\\xce\\xea:\\x87\\xb0\\x06~L\\x88A\\x1d\\x8d\\xce\\xfb\\xa3\\xfa\\x8dA\\x85\\xea9Mg\\xdf1\\xe8\\xb9\\x9a\\x88d\\xad\\xfd\\xa9\\xfa\\xfcf\\xaf\\xbe\\xe7\\xb87Le\\xd0\\xd1\\xde\\xfb\\xfas[\\xbfy\\xef\\xcb\\xdf\\x13\\xc2\\xa9\\xff\\xd2\\xef\\xb1\\x7f\\xcfi\\x19\\xdb^\\xdd\\xea\\xb8\\xdc\\xe6\\x8d\\xcbY\\xdd8M\\\\Q\\xa6\\x9bZk\\x0e\\xf4\\x8f\\xe8n\\x0c\\x8c\\xd8\\x18\\xc8\\xc6(5J\\x9e\\xed\\x8cN\\xfe\\xb8\\xdd_\\xc7\\xffq%H#\\x7f\\xe3JF \\xab\\xd0\\xb1E\\x8f\\xc1\\xa7a\\x9c\\x1e\\x9f\\xf67h\\x8d\\xdd\\x07\\x9bz\\x86u\\xcf\\xf7\\x11TUs\\xaf!a\\xbdR\\x83\\x8cA!\\xc6\\xde\\xbdM\\xbd{\\x87\\xa3\\xa3\\xbf\\xa9oh7cp`\\xbe_0\\xc7\\xc9\\x8b~\\xc9[\\x9b\\xe1mT\\xd1C\\xa9\\xf9\\x7f\\x7f\\xcd\\xf7\\xad$G\\xff\\xb5?\\x95V\\xef\\xd5\\xd7H\\x0f\\xfe\\xd3\\x1d\\xf0\\x19\\xc6\\x90\\x10SHH\\x18:\\xfa\\x9bCB\\xc3\\xc3\\xb2\\xd0\\x0fx\\xd9g\\x8cN\\x9e\\xf9\\x1aI\\xe67{;}rz}\\xe7!\\xe8\\xa1\\xaf\\xb7l\\xe6k\\xb5x\\xf5=@Go\\xfb^~s!\\xd5\\xdf\\xf0\\xc6\\xcd\\xf81\\x81\\xac\\xfa\\xed\\x17P#\\xd8B_\\x0eYShxOSX`\\x845\\xac{x\\xff\\xd0\\x10SXh\\x7f[Xxh\\xe0\\x80n\\x11\\xa6\\xb0\\xf003:\\x1ae\\x85q*F\\xa7\\xe4\\x93\\x115)\\xb2^\\x7f\\xfc\\x1f\\x99pV\\xb5%\\xcc\\xa0\\x91\\xf1\\xfd\\x95r\\xd6\\xfe\\x93\\xc6\\x14\\xe5\\x8a\\xae\\x05\\xe8d\\xf1\\xc4\\x8b\\xfd\\x0c\\x1c\\xff\\xda\\xc5 \\x8d\\x92\\xfc\\xcd7/\\xda\\xbf\\x99\\xfdG\\xb6\\x1b\\xa7V\\xbf\\x96\\rd\\xf4\\xb1\\xafeQ\\x0b*\\xd3\\xfa\\r\\xf0\\x0f\\x89\\x08\\x8a\\x18b\\x0c\\x0f0\\x85\\x07\\x84\\xa3\\xa3\\xbf9<44\\xc2\\x18\\x1ef\\xea?$\\xd8\\x1c\\x11\\x14\\xdc\\xdd\\x18\\x11\\xfa\\x1d\\x81\\x84\\xbe#\\x11\\xce\\xc0\\x00\\xd3\\xc0\\x80@t\\xf4DG\\x08:\\xc2\\xd0\\xf1i\\xd6\\xeb\\xf7\\xfc\\x91\\t\\xd2\\xc4\\x14e\\x8a~V0\\'7\\r\\n\\x8c0\\x0e\\n3\\rB?jD\\xff0cTT*cc\\xa2\\x95*\\xd4\\xe0\\x16&\\x9a3\\xf0iL\\xb4\\x9eS\\x19x6\\x9d\\x91\\xc98\\xb5\\x96\\xd1$\\x9b\\x18\\x99\\xca\\xc2\\xd83\\x16F\\x9e SYQ\\xaa\\xe6\\xe4\\x16&\\x86gu&F\\xc1\\x99\\x18\\x95\\xca\\xcc\\xa8\\xf4\\x9c\\x91Q\\xdb\\x185\\xaa\\xbd\\x8c13\\xe8\\x16#\\xa3\\xb12\\x1aF\\xc5)L\\x8cF\\x8e\\x8e\\xe44t\\xf0\\xb1\\x88@,\\x8cV\\xcb\\xe9M\\x8c\\x8e\\xb52:\\xce\\x80\\x88\\x84\\xd1\\xe9Yt\\xaf\\x91\\xd1\\x1b\\x19\\xde\\xca\\xf0<b*\\xe9/\\x01\\xdd\\xff\\xf2\\x8cWr\\x1a3:C\\xc5\\x1a\\x92l\\xe8\\xd02z\\xbd9\\x9a\\x91\\xc5\\x1b\\xa3\\xd9\\xf4h\\x961\\xf0\\xca\\x18\\x83\\xca\\x1a\\xcd\\xc6p:\\xd6\\x1c\\xcd\\xeayt\\x8e\\xbe\\xa9K{\\t>>\\xa6h\\xa5\\xc2\\x12\\xadS\\xb21\\xf6T\\xa30E\\x1bxt$[\\xd1\\x81\\xb2\\xc6\\xe8d\\xab\\xcc^\\x07\\xc6\\xf6\\x12|\\xd2\\x1c\\xe8\\xe3\\xf8@\\x9f\\xee@\\x1f\\x1f\\xb3\\x0cqbt\\x9dg\\x15\\x9c.\\xd9(\\x93Y\\x8a\\xda\\xcc\"\\x8be\\x19\\xad\\xad(eu\\xb6\\xa2f\\xd4\\xa1\\xfb^\\xa2>\\xc3~\\xa2byV\\x95\\\\\\xf4\\x99\\xbd\\xf6f\\x19b\\xda\\x16\\x19gP\\xc93Q\\xaaA?\\x15\\xdd\\xcb[\\xd19\\xba\\xd5\\x0e\\xa8u,2\\xbd!:\\xce&3\\xe8\\x94\\x9cAo\\x953\\xbc2\\x815\\xc9\\x99d\\xab\\x9c\\x951rt\\xcaj\\xd1\\xc1\\x9b\\xe5JFe\\xb5\\'\\xac\\xdcf\\x07\\x84&\\xb9R\\x9e!W\\xc6\\xc4\\xb0:V#c\\xd3\\xf1)\\x8fnP(y\\xd4\\xeer\\xce,\\xe7\\xa2\\xe3\\xacr\\xce\\x10\\xadb-r\\x1d\\x8bz\\x93et*%\\xab\\xb3\\xd81\\xd9\\xccF3\\xc9\\xabXM\\x82\\x12\\x8dD5\\xfa.*\\x85\\x1di@\\xd5\\xcf`\\xed\\xa2\\xdb^\\x12\\xba)\\x81\\xd5\\xd8\\x13]\\x1a\\x9b\\xa4e\\xe5H\\xb2\\xa4\\xe3\\x13y\\xd1\\x99F\\x8f~\\xb6\\x19\\x9d\\xa9P\\x96\\xb7g9\\x8d\\x85M2\\xc8YcLkS\\x0c\\xa3\\xb3\\xc5\\xa0\\xf1d\\xefi\\x84\\xbc9\\x86eU6{\\x82z\\x07eT\\xbc)\\x86M\\xb4\\xc6(\\x15\\x06\\x1dkC\\xa2\\xab\\xa8P\\x84r{\\x86\\xd5\\xa3f\\x8aQ\\xea\\xf4|F\\x8c\\x8aIT\\xa1\\xbc*\\xd9\\x12\\xc3\\xc9\\x0c\\xfa\\xb4\\xa2\\xd4\\xde\\xe3\\x886l\\xe8HD\\xac\\xd6\\x12\\xa3C\\x9d\\x99V\\x94\\xb6\\xf4\\xf53#\\xe2Q\\xa5+X\\r\\xea_\\xf4X\\x93\\x025\\xa6\\x02\\xfdZ\\xa3\\x823+\\x10K7)8\\xde\\x82\\xc4\\x1f\\xc3\\x9bc\\x11E[\\xed\\x89\\x8a\\xb5\\xbd\\x04\\xb9\\xc5\\x8ezS,\\xa3\\xcf@\\x87\\x9eUE\\xab\\x18\\xfb\\x87z}2\\xba=\\x01\\xdd\\xc72\\t\\xf6\\xd6\\xb4#\\xfa\\x88U\\xc9\\xcd\\xb1JE\\xac5V\\x19\\x87H8\\xed%\\xb0\\xe8CN%\\xb7\\xd9\\x13{\\x95c95k\\x8a\\xe5\\x12S\\x95f\\xc4\\x97\\x18\\xa32\\xc6\\xa8T\\x1a\\x95\\x9atTu\\x8dRmo}\\xa5F\\xa6C\\r\\x8c\\xba\\xcd\\xac\\xd4\\xf0\\x9cQ\\xa97*y3jp\\xb5)\\x8eK6\\xc7\\x19P3\\xc6k\\xd8D\\x94p\\x89\\x16\\x15\\x8b\\x9a\\x15\\xa5h\\x94\\xa2\\x14q\\x19kQ\\xaaG\\x99\\x04VeV)\\xe3\\xd1\\'(A\\xe4\\xa9\\xe2\\x10q\\xdb{B\\xc5!]PmT\\xfb\\x1a\\xd5\\xedV\\xa9\\x19\\x85F\\x19\\xa3|y\\xc9\\xaaf\\xd4\\xcad\\xc6\\xacF#\\x1b%\\xba\\xf84{\\xc2\\xcaQ\\xb3\\xa3\\xdf&\\x8bM+J\\xed#K\\xcdZ\\xd4\\xa8\\xb6\\xbcU\\xad\\xd4 \\x06c{\\tz\\xa3ZmV\\xdbG\\xab\\x9a\\xd3\\xf3F\\xb5\\xd6\\xa8N6i\\xbcy\\xb3\\x06u\\x89M\\xc3\\xf0\\x06\\xd4\\x15&\\r\\xab@G\\xa2\\x05\\x1d\\xac\\xce\\xac\\xb1\\xf3\\x16\\rg\\xd1p:>\\xd6\\xa4\\xe1xt$\\xa6i\\xb4\\x0e\\xc6\\xa4\\xb1\\x0f\\x93\\xf4\\xa2\\xd4\\xce\\x1f\\xac\\x1a\\x83\\x1a}\\x9c\\x8e\\x88\\x1b\\xa9\\x97\\xa87\\x1dgh\\x00\\x1b\\xb9\\x18#\\xa71q\\x1a\\xd6\\xcci\\x10\\x19qZD\\x12\\x1c\\x1f\\x8b\\xf8\\x1a\\xe2\\x85&.QcA\\x07\\xeaY\\xad}\\xa0Z\\xb5v\\x9aOB\\xc0\\xa1AiCc;\\x96\\xd1\\xea\\xb3\\xb4\\xb1\\x1c\\xcf)t\\x8c\\x16}-\\xf3\\x8fL\\xb2Y\\xab\\x94\\xc5[\\xed\\x89\\xfd\\x01*d\\xe9\\x99\\xb5\\xa8d\\x8b\\x96C\\x9dd\\xd3rZ\\x03\\x92tiZT\\x07\\x1d\\x83\\xba\\x0b\\xb1C}\\x9a=\\xb1\\xf7\\xa3U\\x8b:\\x94\\xe5\\xed\\x80\\x86\\xa9\\x19\\x816\\x03%\\t\\xf6\\x81\\x8fZV\\x8bX,k\\xd2\\xea8t\\xa0o\"\\xa2\\xb5h\\xed\\xe2\\xc7\\x86F\\xa3\\x9d\\x97\\xa7;\\xd0\\xc7\\'\\r\\x9dix{\\xab\\x8c4\\xd8\\x7f\\x0e\\xa2]D\\xd8\\x08\\x14\\x88\\xfa\\xd3_\\x02\\xea\\x9c4\\x1d\\xabT\\xd8\\xb5\\xc0t|\"\\xcf\\xd0\\xb1\\xaa\"\\x0e\\x83\\xcaC\\xa72\\x15\\xbaG\\xcd\\xda%|\\x9a\\x0e\\xb1\\x0c\\xb9]d \\xce\\xcd\\xb3f\\xdd\\xa8v\\xed\\xcdz\\xd4]V=\\xe2\\x13\\xb2X\\xb3\\x9ee\\xd5V{\\x82*n\\x07=\\xfaD\\xa5B\\x9f \\xb6\\xab\\xb7\\xe8c9\\x8eO+J\\xed%\\xa3\\x13\\x1d\\xcf(X3:I\\xb4\\xda\\x134\\x02\\xf4\\x88\\xd4-h\\xb02:\\xa3\\x9e3#\\x89\\x84\\x1e\\xc4\\xa9\\x94\\xe8\\x02\\x1a\\r6{\\x82\\xfa,\\xdd\\x8eE\\xd2\\xc4\\xaaG\\x04\\xa4J\\xb69\\xb8\\x90\\x05\\xa1F\\x9e\\xa6\\xe7\\xd1x\\xb4\\x0fr=\\x8f.[\\x91\\xbd\\xc3\\xc5\\xdb\\xc1 Wr6;u \"X\\x85\\xd0~\\x1f\\xff\\x92y\\xe9\\r\\xb2XtI\\x8dh89So\\xd0\\x15\\x89&T@\\xd6k\\xe7z3b\\xdd*\\x0b\\x1a]Z\\xdeV\\x94\\xa2\\x1f\\xcc\\xa3\\xb1oOx\\x13\\xa2\\x1e\\x0b:\\x94:\\x94e\\xd5\\xf6SD\\xdb(M\\xb6\\xd8\\x7fj|ZQj\\x1f\\xd8\\xe8Do\\xe5cQ\\x8f\\xc8m/\\x01=Y\\xa9f\\x8d<g\\xe19\\xc4\\xd6\\xcd<\\xaa\\xb7\\x89\\xe7\\xd07\\xb9d\\xc4\\xca\\x91\\xbd\\xa6P \\xf6\\xc1\\xeb\\x0c\\x88\\xecy]\\xb2\\x15\\x1d\\xe8I\\x19\\x06\\xbb\\xfa]T\\xdbLt\\x8a\\xf87_4\\xfe\\x90\\x18Q\\xaa\\x8c\\x06\\xad\\xc9\\xa0g\\xcd\\xe8\\x90[\\x11\\xf7\\xd1h\\x18K\\x82R\\xaf\\xe4mE)\\xfa\\xe9\\x89\\x88\\xfa\\xac\\xf6\\x04I\\x89DF\\x8f\\x8eds\"\\xcb\\xc6[\\xec\\x89\\xde\\x9a\\xc8\\xda\\x07-\\xfa\\x04\\t\\xf9DT\\xc14{b\\xe7\\xef(\\xc7j,\\x89\\xf6\\xfa\\xa1T)\\x8b\\xb5\\xa7*\\xd6\\x94\\x18\\xcb\\x99\\x13\\x95\\xf6\\xbb\\x95|\\xac\\xcd\\x9e *1\\'r\\x885\\xd8\\x93\\x18\\x15\\xe2A\\x89vIgI\\xb2\\x8f*s2\"\\x1a\\x8b=\\xd1\\x9b\\x929\\x03\\x92\\xa9\\xbc~\\xdex\\x0bb\\xdf\\n\\xfd\\xbc\\tk\\x11\\xfb\\x1ca\\xd0\\xd8\\x19\\x97f\\xc4Kw\\xc9\\xceL\\x84\\x9a\\x11\\n\\xd4\\x1fZ\\xfd\\xbc\\xdd\\xees\\xff\\x0fO\\xfe\\xa8\\xe6'", "year": "2018"}], "name": "locationleica2018"}