{"interestingcomments": [{"Unnamed: 0": 218974, "autor": "living-intentionally", "date": 1548542903000, "content": "Upsidedown Summicron 23mm on my CL? /!/ Hi, all! I'm hoping there is a very obvious answer to this seemingly foolish question. I was recently gifted a beautiful 23mm, but am confused as to why the LEICA and SUMMICROn text is upside down. I've lined up the red dots and mounted the lens as I would with any other.\n\n As you can see, the 23mm seems to be in the correct position at the top of the lens. Any ideas?\n\nLink to photos in comments...TIA!", "link": "https://www.reddit.com/r/Leica/comments/ak61n4/upsidedown_summicron_23mm_on_my_cl/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upsidedown summicron 23mm on my cl? /!/ hi, all! i'm hoping there is a very obvious answer to this seemingly foolish question. i was recently gifted a beautiful 23mm, but am confused as to why the leica and summicron text is upside down. i've lined up the red dots and mounted the lens as i would with any other.\n\n as you can see, the 23mm seems to be in the correct -----> position !!!  at the top of the lens. any ideas?\n\nlink to photos in comments...tia!", "sortedWord": "None", "identifyer": 13467, "year": "2019"}, {"Unnamed: 0": 219395, "autor": "Lee_Van_Kief", "date": 1560716031000, "content": "Summaron 35 2.8 woes /!/ Howdy all,\n\nI’ve just recently picked up this 1960 Summaron lens from a reputable seller, billed as “serviced.” It was delivered to me with a dirty helicoid as well as a couple other issues, so I’m sending it back for service. One of the “issues” that I had mentioned to them was that the aperture ring had quite a bit of play front to back, at about 1.5mm if movement. It feels great otherwise and clicks into position cleanly, but when I mentioned this to the seller, they responded that it was normal for lenses of that era. \n\nHaving never handled one before this, I’m unsure what to make of their response, as any other lens that exhibits that kind of movement would be a candidate for repair in my eyes. Can anyone comment on their experiences with this lens or anything similar?", "link": "https://www.reddit.com/r/Leica/comments/c1ed26/summaron_35_28_woes/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "summaron 35 2.8 woes /!/ howdy all,\n\ni’ve just recently picked up this 1960 summaron lens from a reputable seller, billed as “serviced.” it was delivered to me with a dirty helicoid as well as a couple other issues, so i’m sending it back for service. one of the “issues” that i had mentioned to them was that the aperture ring had quite a bit of play front to back, at about 1.5mm if movement. it feels great otherwise and clicks into -----> position !!!  cleanly, but when i mentioned this to the seller, they responded that it was normal for lenses of that era. \n\nhaving never handled one before this, i’m unsure what to make of their response, as any other lens that exhibits that kind of movement would be a candidate for repair in my eyes. can anyone comment on their experiences with this lens or anything similar?", "sortedWord": "None", "identifyer": 13896, "year": "2019"}], "name": "positionleica2019"}