{"interestingcomments": [{"Unnamed: 0": 181266, "autor": "DangerDan831", "date": 1612004078000, "content": "M6 TTL hot shoe woes /!/ Recently I’ve gotten in to using an sf20 on my m6 to spice up my day to day photography. However as of today the flash will not fire in the hot shoe. It works on my Nikon, my hammerhead flash works using the pc sync cable on the m6 and the flash fires if I slide it on to the hot shoe of the m6 while in the on position. I have tried fresh batteries as well as firing the camera with the flash inserted at different depths of the hot shoe yet nothing. Any help I’d appreciated!", "link": "https://www.reddit.com/r/Leica/comments/l8j9vb/m6_ttl_hot_shoe_woes/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m6 ttl hot shoe woes /!/ recently i’ve gotten in to using an sf20 on my m6 to spice up my day to day photography. however as of today the flash will not fire in the hot shoe. it works on my nikon, my hammerhead flash works using the pc sync cable on the m6 and the flash fires if i slide it on to the hot shoe of the m6 while in the on -----> position !!! . i have tried fresh batteries as well as firing the camera with the flash inserted at different depths of the hot shoe yet nothing. any help i’d appreciated!", "sortedWord": "None", "identifyer": 73775, "year": "2021"}, {"Unnamed: 0": 181377, "autor": "kurt1358", "date": 1617224325000, "content": "Leica III Question /!/ Recently got a Leica IIIa!\n\nLooks to be in great shape- however when I screw on my Summicron lens, the infinity focus knob lands at the 6:00 position instead of the typical 7/8:00. I tried forcing it a bit but backed off because I didn’t want to break anything... the lens screws on properly to my other Leica a IIIC...\n\nIs it going to matter that the lens isn’t exactly in the proper position when it comes to focusing?\n\nSorry if this is a noob question...\nI’ll run a roll through it soon- just looking for any advice now!\n\nThanks!", "link": "https://www.reddit.com/r/Leica/comments/mhfkrr/leica_iii_question/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica iii question /!/ recently got a leica iiia!\n\nlooks to be in great shape- however when i screw on my summicron lens, the infinity focus knob lands at the 6:00 -----> position !!!  instead of the typical 7/8:00. i tried forcing it a bit but backed off because i didn’t want to break anything... the lens screws on properly to my other leica a iiic...\n\nis it going to matter that the lens isn’t exactly in the proper position when it comes to focusing?\n\nsorry if this is a noob question...\ni’ll run a roll through it soon- just looking for any advice now!\n\nthanks!", "sortedWord": "None", "identifyer": 73891, "year": "2021"}, {"Unnamed: 0": 181556, "autor": "procagefighter", "date": 1619868788000, "content": "Question around M4-P light baffle leaks /!/ I've had my near pristine M4-P for a couple months now and noticed on my last 2 rolls an interesting light leak. Since the leaks are blue and in the same position of the frame, I thought they might be a due to light coming through a worn baffle (common M4-P issue). \n\nI ran some tests on a white board:\n\n1) Capping the lens between shots\n2) Uncapping the lens and pointing it at a light source wide open between shots\n3) Stopping down to f/16 without a cap between shots\n4) Taking the lens off and pointing the body at a light source between shots\n\nThe result was there were no leaks in any of the tests, but leaks on other random photos (despite capping the lens after most shots).\n\nMy question is, are light baffle leaks purely random or can they be replicated fairly easily?\n\n[EVIDENCE OF LIGHT LEAKS](https://postimg.cc/gallery/bzTpNP8)", "link": "https://www.reddit.com/r/Leica/comments/n2gkzz/question_around_m4p_light_baffle_leaks/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question around m4-p light baffle leaks /!/ i've had my near pristine m4-p for a couple months now and noticed on my last 2 rolls an interesting light leak. since the leaks are blue and in the same -----> position !!!  of the frame, i thought they might be a due to light coming through a worn baffle (common m4-p issue). \n\ni ran some tests on a white board:\n\n1) capping the lens between shots\n2) uncapping the lens and pointing it at a light source wide open between shots\n3) stopping down to f/16 without a cap between shots\n4) taking the lens off and pointing the body at a light source between shots\n\nthe result was there were no leaks in any of the tests, but leaks on other random photos (despite capping the lens after most shots).\n\nmy question is, are light baffle leaks purely random or can they be replicated fairly easily?\n\n[evidence of light leaks](https://postimg.cc/gallery/bztpnp8)", "sortedWord": "None", "identifyer": 74074, "year": "2021"}, {"Unnamed: 0": 181716, "autor": "A-Gentleperson", "date": 1621846734000, "content": "I am confused. Potential issue with the Leica 135mm f/2.8 Elmarit-M. /!/ As the title says, I am confused. Today I was out at my local park. I had my M3 with the Leica 135mm f/2.8 Elmarit-M. I was attempting to photograph a lovely looking little hut on the other side of the lake. \n\nI started focusing. The hut is a long way away, so I'm quickly turning the focus towards infinity. I can see the dual images getting close to being in perfect focus, but then suddenly my focus ring ends. I am focused at infinity, but there still is a not-insignificant way for the image to move until the two windows match. \n\nI then went home. I marked a place on the floor, and while standing on it I (using Olympus Pen E-PL9 + Voigtländer Leica M to MFT adapter + Leica 135mm f/2.8 Elmarit-M) targeted a tree a bit farther away and made a note of when my focus was perfect. I then, without moving the focus ring and while staying at the same position, changed the lens to my Leica M3. I looked at the finder. The focus shows the same not-insignificant distance before the images overlap. I was aiming at the same tree, at same position, holding my hands the same way.\n\nWhile I was out I tried to find the farthest object I could focus on. I found out that at farthest I can focus is about 10 meters away. Though the focus ring claims the focus is at about 40 meters away, just before the infinity.\n\nAny tips on how to fix the issue myself? Leica themselves is always the option, but the time that I would be separated from the lens would be rather long to my understanding.", "link": "https://www.reddit.com/r/Leica/comments/njtfje/i_am_confused_potential_issue_with_the_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i am confused. potential issue with the leica 135mm f/2.8 elmarit-m. /!/ as the title says, i am confused. today i was out at my local park. i had my m3 with the leica 135mm f/2.8 elmarit-m. i was attempting to photograph a lovely looking little hut on the other side of the lake. \n\ni started focusing. the hut is a long way away, so i'm quickly turning the focus towards infinity. i can see the dual images getting close to being in perfect focus, but then suddenly my focus ring ends. i am focused at infinity, but there still is a not-insignificant way for the image to move until the two windows match. \n\ni then went home. i marked a place on the floor, and while standing on it i (using olympus pen e-pl9 + voigtländer leica m to mft adapter + leica 135mm f/2.8 elmarit-m) targeted a tree a bit farther away and made a note of when my focus was perfect. i then, without moving the focus ring and while staying at the same -----> position !!! , changed the lens to my leica m3. i looked at the finder. the focus shows the same not-insignificant distance before the images overlap. i was aiming at the same tree, at same position, holding my hands the same way.\n\nwhile i was out i tried to find the farthest object i could focus on. i found out that at farthest i can focus is about 10 meters away. though the focus ring claims the focus is at about 40 meters away, just before the infinity.\n\nany tips on how to fix the issue myself? leica themselves is always the option, but the time that i would be separated from the lens would be rather long to my understanding.", "sortedWord": "None", "identifyer": 74234, "year": "2021"}, {"Unnamed: 0": 181825, "autor": "chthocas", "date": 1624420918000, "content": "Leica Q2 Help: Macro-ring not in correct position", "link": "https://www.reddit.com/r/Leica/comments/o653fm/leica_q2_help_macroring_not_in_correct_position/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica q2 help: macro-ring not in correct -----> position !!! ", "sortedWord": "None", "identifyer": 74345, "year": "2021"}, {"Unnamed: 0": 181844, "autor": "A-Gentleperson", "date": 1627817150000, "content": "A wildlife photography outing with the Leica Thambar-M 90mm f/2.2. /!/ There are two lenses in the Leica world that I would call \"dream lenses\" of mine. First of them finally being in my hands, the Thambar-M. Naturally, I have been using it for 99% of my photography since purchasing it, to test it in wide variety of conditions. I am extremely pleased with it.\n\nYesterday, I went out in the woods. I had my Leica M3, the Thambar-M and a 50mm Summicron V5. The weather was a bit unstable, but that is nothing new here in Finland. At least the light was nice.\n\nOr so I thought until I got to the aforementioned woods. It was rather dark. Not a humongous issue, Thambar-M having maximum aperture of f/2.2, or f/2.3 with the included filter in use. I did have to go down to 1/125 shutterspeed, but it is still fast enough for some larger wildlife taking it easy.\n\nAnd then the rain started. So I stood there, taking cover under the leaves, while fiddling with settings. I was out testing the Thambar-M, so I would test it, regardless of the weather. Then I saw movement farther away, deep in the woods. Bushes were moving rapidly, not due to wind or rain, but by something hitting them. I admit, my thoughts went into bears and how screwed I might possibly be.\n\nUntil the culprit revealed itself, dashing from the bushes. A large hedgehog going full speed ahead. I barely could keep myself from laughing. I managed to lie down to hide myself, behind a large tree. Checked my settings, and started photographing.\n\nThe long focus throw of the Thambar-M was marvelous. I kept the focus on the hedgehog with surprising ease, while it ran at me. And I do mean at me. Very nearly hit me, before noticing me. Much to my surprise, it did not run away. \n\nInstead it kept stuffing its face, with whatever it catched. I thought I saw a worm or two. The rain had awakened the critters, and the buffet was ready for the hedgehog. For the next 10 or so minutes it stayed in the area, basically letting me freely to photograph it. It was a little suspicious about the sound the shutter of my M3 made, but soon ignored it. During this whole time I was in the ground, in a rather uncomfortable position. I didn't want to stand up and scare the animal.\n\nAfter it had finished the buffet, it dashed back into the bushes it had appeared from. I chose not to go after it, not wanting to stress the animal. It had already given me a fantastic opportunity to test my Thambar-M. \n\n*The conclusions of the trip:*\n\n1. The long focus throw of the Thambar-M suits me and my kind of photography very well. It aids in focusing a lot. I wish more lenses had this long focus throws.\n\n2. The Thambar-M has a great lens hood. It is the kind you just push in. There is no separate locking mechanism, nor is it screwed in. Regardless, it stays put. It feels very solid, and not once was I afraid it would get loose and just fall. That happening in a forest would be a nightmare. Good luck in finding it.\n\n3. The dual nature of the Thambar-M is even more fun I had thought. I had thought I would mostly enjoy this lens wide open, soft focus spot filter in use. I have found I also greatly enjoy the effect the lens causes at smaller apertures. At f/6.3 for example, the out of focus areas get this very distinctive look, while the in focus areas are sharp. A photo of a gull still has great feather detail. Just to give an example.", "link": "https://www.reddit.com/r/Leica/comments/ovqg2z/a_wildlife_photography_outing_with_the_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a wildlife photography outing with the leica thambar-m 90mm f/2.2. /!/ there are two lenses in the leica world that i would call \"dream lenses\" of mine. first of them finally being in my hands, the thambar-m. naturally, i have been using it for 99% of my photography since purchasing it, to test it in wide variety of conditions. i am extremely pleased with it.\n\nyesterday, i went out in the woods. i had my leica m3, the thambar-m and a 50mm summicron v5. the weather was a bit unstable, but that is nothing new here in finland. at least the light was nice.\n\nor so i thought until i got to the aforementioned woods. it was rather dark. not a humongous issue, thambar-m having maximum aperture of f/2.2, or f/2.3 with the included filter in use. i did have to go down to 1/125 shutterspeed, but it is still fast enough for some larger wildlife taking it easy.\n\nand then the rain started. so i stood there, taking cover under the leaves, while fiddling with settings. i was out testing the thambar-m, so i would test it, regardless of the weather. then i saw movement farther away, deep in the woods. bushes were moving rapidly, not due to wind or rain, but by something hitting them. i admit, my thoughts went into bears and how screwed i might possibly be.\n\nuntil the culprit revealed itself, dashing from the bushes. a large hedgehog going full speed ahead. i barely could keep myself from laughing. i managed to lie down to hide myself, behind a large tree. checked my settings, and started photographing.\n\nthe long focus throw of the thambar-m was marvelous. i kept the focus on the hedgehog with surprising ease, while it ran at me. and i do mean at me. very nearly hit me, before noticing me. much to my surprise, it did not run away. \n\ninstead it kept stuffing its face, with whatever it catched. i thought i saw a worm or two. the rain had awakened the critters, and the buffet was ready for the hedgehog. for the next 10 or so minutes it stayed in the area, basically letting me freely to photograph it. it was a little suspicious about the sound the shutter of my m3 made, but soon ignored it. during this whole time i was in the ground, in a rather uncomfortable -----> position !!! . i didn't want to stand up and scare the animal.\n\nafter it had finished the buffet, it dashed back into the bushes it had appeared from. i chose not to go after it, not wanting to stress the animal. it had already given me a fantastic opportunity to test my thambar-m. \n\n*the conclusions of the trip:*\n\n1. the long focus throw of the thambar-m suits me and my kind of photography very well. it aids in focusing a lot. i wish more lenses had this long focus throws.\n\n2. the thambar-m has a great lens hood. it is the kind you just push in. there is no separate locking mechanism, nor is it screwed in. regardless, it stays put. it feels very solid, and not once was i afraid it would get loose and just fall. that happening in a forest would be a nightmare. good luck in finding it.\n\n3. the dual nature of the thambar-m is even more fun i had thought. i had thought i would mostly enjoy this lens wide open, soft focus spot filter in use. i have found i also greatly enjoy the effect the lens causes at smaller apertures. at f/6.3 for example, the out of focus areas get this very distinctive look, while the in focus areas are sharp. a photo of a gull still has great feather detail. just to give an example.", "sortedWord": "None", "identifyer": 74365, "year": "2021"}, {"Unnamed: 0": 182203, "autor": "procagefighter", "date": 1634943877000, "content": "'Baffling' light leaks. Advice on what to do with the body? /!/ I've had a M4-P 70th for the last 8 months. I got it for an absolute bargain and it's in great condition (it had been dry-stored for 10 years). I noticed soon after a few rolls that there were light leaks from the front running across the top of the frame. Classic light baffle leaks.\n\nI decided to send it to an ex-leica tech in Melbourne who does fantastic work. It got lost in the post for weeks, but finally made it and was beautifully CLA'd. The baffles were treated and all seemed well. I shot about 4 rolls after getting it back with no issue.\n\nThen the light leak came back. Same position. Across the top of the frame. I called the camera tech, but unfortunately due to unforeseen circumstances they had to move back to Europe.\n\nThe leaks only happen a couple frames a roll (sporadically). I habitually stop the lens down after shooting or cap it altogether, but it still seems to happen.\n\nSo now I'm left with the decision to sell it on as a collectors item (or discounted so the new buyer can sort it out). There is no Leica repair where I live and any servicing would require me to post it far and wide. If it had any sentimental value I would have Leica service it.\n\nI absolutely love the camera. Love that I have 28mm and 75mm options. I just don't want such a valuable camera having an unpredictable issue like this. Would happily swap for a beater body with a solid lens. I just want to shoot without the fear of ruined shots.\n\nThoughts?", "link": "https://www.reddit.com/r/Leica/comments/qdslal/baffling_light_leaks_advice_on_what_to_do_with/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "'baffling' light leaks. advice on what to do with the body? /!/ i've had a m4-p 70th for the last 8 months. i got it for an absolute bargain and it's in great condition (it had been dry-stored for 10 years). i noticed soon after a few rolls that there were light leaks from the front running across the top of the frame. classic light baffle leaks.\n\ni decided to send it to an ex-leica tech in melbourne who does fantastic work. it got lost in the post for weeks, but finally made it and was beautifully cla'd. the baffles were treated and all seemed well. i shot about 4 rolls after getting it back with no issue.\n\nthen the light leak came back. same -----> position !!! . across the top of the frame. i called the camera tech, but unfortunately due to unforeseen circumstances they had to move back to europe.\n\nthe leaks only happen a couple frames a roll (sporadically). i habitually stop the lens down after shooting or cap it altogether, but it still seems to happen.\n\nso now i'm left with the decision to sell it on as a collectors item (or discounted so the new buyer can sort it out). there is no leica repair where i live and any servicing would require me to post it far and wide. if it had any sentimental value i would have leica service it.\n\ni absolutely love the camera. love that i have 28mm and 75mm options. i just don't want such a valuable camera having an unpredictable issue like this. would happily swap for a beater body with a solid lens. i just want to shoot without the fear of ruined shots.\n\nthoughts?", "sortedWord": "None", "identifyer": 74726, "year": "2021"}, {"Unnamed: 0": 182341, "autor": "A-Gentleperson", "date": 1609658699000, "content": "What are your best Leica related memories from 2020? /!/ Enough with the negativity. What do you think back to with warmth? Did you get a photo you loved with your Leica body of choise? Did you finally save up for your dream Leica lens? \n\nMine has to be the moment I realized my OUBIO-M adapter had two positions it could be locked in to. It blew my mind. Wildlife photography with the M3 + Visoflex III kit became a lot easier.", "link": "https://www.reddit.com/r/Leica/comments/kpg82o/what_are_your_best_leica_related_memories_from/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "what are your best leica related memories from 2020? /!/ enough with the negativity. what do you think back to with warmth? did you get a photo you loved with your leica body of choise? did you finally save up for your dream leica lens? \n\nmine has to be the moment i realized my oubio-m adapter had two -----> positions !!!  it could be locked in to. it blew my mind. wildlife photography with the m3 + visoflex iii kit became a lot easier.", "sortedWord": "None", "identifyer": 74864, "year": "2021"}, {"Unnamed: 0": 182530, "autor": "apltd", "date": 1612182386000, "content": "Left-eyed Leicaphiles /!/ I’ve been scrimping. I’ve been saving. I’m finally in a position to place my dream opening bet; a Leica M-A (black chrome) with a silver 35 Cron.\n\nMy issue? I’m seemingly left-eye dominant. I’ve been warming up with an Olly SP to make the move into RFs (I really enjoy it!) but I always end up using my left eye. \n\nCan I train myself out of this? Or is it just something I have to accept?\n\nPoll is just for fun and to see how alone I am out there!\n\n[View Poll](https://www.reddit.com/poll/la1y4z)", "link": "https://www.reddit.com/r/Leica/comments/la1y4z/lefteyed_leicaphiles/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "left-eyed leicaphiles /!/ i’ve been scrimping. i’ve been saving. i’m finally in a -----> position !!!  to place my dream opening bet; a leica m-a (black chrome) with a silver 35 cron.\n\nmy issue? i’m seemingly left-eye dominant. i’ve been warming up with an olly sp to make the move into rfs (i really enjoy it!) but i always end up using my left eye. \n\ncan i train myself out of this? or is it just something i have to accept?\n\npoll is just for fun and to see how alone i am out there!\n\n[view poll](https://www.reddit.com/poll/la1y4z)", "sortedWord": "None", "identifyer": 75057, "year": "2021"}, {"Unnamed: 0": 183020, "autor": "310toYuggoth", "date": 1623447002000, "content": "Finally getting around to my grandfathers old Leica III Summitar f/2 and I have a few questions (in comments)! Love to hear thoughts and opinions and advice! /!/ Questions:\n\nShould I have it CLA’d? Any suggestions where this would be possible?\n\nHow best can I clean the camera body?\n\nThe leatherette is brittle and dry and chipping off and the glue is dry too. I’d like to fix that. Is that a good idea to do?\n\nExtending the lens is a bit loose and wobbly but locks into place firmly. Is that normal?\n\nAdditional Information:\n\nI think its a Leica IIIc but might be “d” though not sure how to find that out. I know the “d”’s are quite rare and my grandfather was stationed in Germany during 45-6 which is when he purchased the camera.\n\nLens looks really good, no haze or mold. Blue coating.\n\nExtending the lens is a bit loose for a lack of a better term and kinda wobbly or jangly. Is that normal? Once fully extended and locked in place it’s solid.\n\nShutter seems to work at the right speeds. Aperture settings seem a bit loose but aperture remains in position.\n\nTakes and advances film! Shooting a test shot now to see how well it looks.\n\nLeatherette is dry and brittle almost falling/chipping off if I handle it. I would like to have this fixed. Is that a good idea?\n\nFocus is a bit sticky but not terrible.", "link": "https://www.reddit.com/r/Leica/comments/nxqrp0/finally_getting_around_to_my_grandfathers_old/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "finally getting around to my grandfathers old leica iii summitar f/2 and i have a few questions (in comments)! love to hear thoughts and opinions and advice! /!/ questions:\n\nshould i have it cla’d? any suggestions where this would be possible?\n\nhow best can i clean the camera body?\n\nthe leatherette is brittle and dry and chipping off and the glue is dry too. i’d like to fix that. is that a good idea to do?\n\nextending the lens is a bit loose and wobbly but locks into place firmly. is that normal?\n\nadditional information:\n\ni think its a leica iiic but might be “d” though not sure how to find that out. i know the “d”’s are quite rare and my grandfather was stationed in germany during 45-6 which is when he purchased the camera.\n\nlens looks really good, no haze or mold. blue coating.\n\nextending the lens is a bit loose for a lack of a better term and kinda wobbly or jangly. is that normal? once fully extended and locked in place it’s solid.\n\nshutter seems to work at the right speeds. aperture settings seem a bit loose but aperture remains in -----> position !!! .\n\ntakes and advances film! shooting a test shot now to see how well it looks.\n\nleatherette is dry and brittle almost falling/chipping off if i handle it. i would like to have this fixed. is that a good idea?\n\nfocus is a bit sticky but not terrible.", "sortedWord": "None", "identifyer": 75557, "year": "2021"}, {"Unnamed: 0": 183035, "autor": "rvinman", "date": 1626538022000, "content": "Help choosing between digital Leica models /!/ Hey guys, just wanted to see if I could get some advice on choosing a digital Leica.\n\nI currently am using a Nikon Z6 for shooting digital however have found in the past few months not enjoying the experience of shooting with it. Build quality and lens selection/performance isn’t an issue but I’ve become accustomed to the simplicity of Leica that I feel my Z6 does *too much* almost. I’m in a position where I could sell my Z6 kit and purchase a digital Leica but I’m having trouble deciding which to purchase.\n\nI would like to pick you guy’s brains to see which option you would go for if you were in my same position. I’m indifferent to getting any of the digital bodies, being the SL2, SL2-S, M10-P or M10-R. As much as I know it would be a better deal to purchase a pre-owned, I would rather purchase new and get a warranty with it.\n\nLet me know what you guys would do or what you would get!", "link": "https://www.reddit.com/r/Leica/comments/om73vr/help_choosing_between_digital_leica_models/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help choosing between digital leica models /!/ hey guys, just wanted to see if i could get some advice on choosing a digital leica.\n\ni currently am using a nikon z6 for shooting digital however have found in the past few months not enjoying the experience of shooting with it. build quality and lens selection/performance isn’t an issue but i’ve become accustomed to the simplicity of leica that i feel my z6 does *too much* almost. i’m in a -----> position !!!  where i could sell my z6 kit and purchase a digital leica but i’m having trouble deciding which to purchase.\n\ni would like to pick you guy’s brains to see which option you would go for if you were in my same position. i’m indifferent to getting any of the digital bodies, being the sl2, sl2-s, m10-p or m10-r. as much as i know it would be a better deal to purchase a pre-owned, i would rather purchase new and get a warranty with it.\n\nlet me know what you guys would do or what you would get!", "sortedWord": "None", "identifyer": 75572, "year": "2021"}, {"Unnamed: 0": 183486, "autor": "Edwinapril", "date": 1633890059000, "content": "Images tilted clockwise by a few degrees /!/ I’ve recently encountered a problem with my M240 - images tilted clockwise by 3 degrees. I was taking photos of a building and I remember that the building was composed upright (I used the frame lines and focusing patches to make sure of that). After I’ve taken the first photo, I looked at it in the LCD and found it look crooked, took 3 more while making sure the building is upright straight, the result is the same - tilted clockwise by a few degrees. It doesn’t happen all the time, but it’s more noticeable when I was using the 90mm Summicron, and not a 35mm lens.\n\nI don’t think it’s a problem of posture. I tried the same camera-holding position with my other non-rangefinder camera and images are upright straight 100% of the time.\n\nI couldn’t find an answer anywhere online. Hope can find an answer here.\n\nThanks.", "link": "https://www.reddit.com/r/Leica/comments/q5djq6/images_tilted_clockwise_by_a_few_degrees/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "images tilted clockwise by a few degrees /!/ i’ve recently encountered a problem with my m240 - images tilted clockwise by 3 degrees. i was taking photos of a building and i remember that the building was composed upright (i used the frame lines and focusing patches to make sure of that). after i’ve taken the first photo, i looked at it in the lcd and found it look crooked, took 3 more while making sure the building is upright straight, the result is the same - tilted clockwise by a few degrees. it doesn’t happen all the time, but it’s more noticeable when i was using the 90mm summicron, and not a 35mm lens.\n\ni don’t think it’s a problem of posture. i tried the same camera-holding -----> position !!!  with my other non-rangefinder camera and images are upright straight 100% of the time.\n\ni couldn’t find an answer anywhere online. hope can find an answer here.\n\nthanks.", "sortedWord": "None", "identifyer": 76028, "year": "2021"}, {"Unnamed: 0": 183499, "autor": "pizmeyre", "date": 1633799109000, "content": "Q2 question, but really Leica. /!/ I am a photography lover from way back.  Having said that, I don't do near enough of it.  I've been using a Nikon D5300 for a few years but I want to go full frame.\n\nI've been somewhat obsessed with Leica for years.  I've always thought they were amazing cameras that were just as much works of art as.the amazing photos that people have taken with them over the years.\n\nI've never really been in a financial position where I could afford one.  Still can't, if I'm honest.\n\nBUT... I do feel like I could make the effort to go the Q2 route.  It is significantly cheaper than an M10, especially considering I wouldn't have to also buy a camera.\n\nIs it silly to go all on on an expensive, fixed lense camera?  Do people even consider the Q2 a \"real\" Lieca?   I know you could make the argument that it's an overpriced point-n-shoot, but I don't really see it that way.  I have never held one, but by all accounts it seems like a sturdy, well-built piece of kit.   \n\nThe lense, although fixed, is still a typical Leica lense, correct?  Any major differences from one of their M-mount 28mm lenses?\n\nI tend towards near-50mm equivalent lenses, but the really wide angle lense of the Q2 doesn't bother me.  I think it would just demand a different way of shooting and composing.  \n\nTo be honest, there's even a part of me that's intrigued by the Q2 Monochrom.   But that may be going a bit far.  :)\n\nJust looking for opinions. \n\nThanks!", "link": "https://www.reddit.com/r/Leica/comments/q4peac/q2_question_but_really_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "q2 question, but really leica. /!/ i am a photography lover from way back.  having said that, i don't do near enough of it.  i've been using a nikon d5300 for a few years but i want to go full frame.\n\ni've been somewhat obsessed with leica for years.  i've always thought they were amazing cameras that were just as much works of art as.the amazing photos that people have taken with them over the years.\n\ni've never really been in a financial -----> position !!!  where i could afford one.  still can't, if i'm honest.\n\nbut... i do feel like i could make the effort to go the q2 route.  it is significantly cheaper than an m10, especially considering i wouldn't have to also buy a camera.\n\nis it silly to go all on on an expensive, fixed lense camera?  do people even consider the q2 a \"real\" lieca?   i know you could make the argument that it's an overpriced point-n-shoot, but i don't really see it that way.  i have never held one, but by all accounts it seems like a sturdy, well-built piece of kit.   \n\nthe lense, although fixed, is still a typical leica lense, correct?  any major differences from one of their m-mount 28mm lenses?\n\ni tend towards near-50mm equivalent lenses, but the really wide angle lense of the q2 doesn't bother me.  i think it would just demand a different way of shooting and composing.  \n\nto be honest, there's even a part of me that's intrigued by the q2 monochrom.   but that may be going a bit far.  :)\n\njust looking for opinions. \n\nthanks!", "sortedWord": "None", "identifyer": 76041, "year": "2021"}, {"Unnamed: 0": 183565, "autor": "17thkahuna", "date": 1614833565000, "content": "Any Leica technicians work on electronics? /!/ I'm still having issues with battery drain on my M6 TTL. I recently sent it to YYE and asked him to look into this. Said it's probably an electronics issue and he doesn't do that.\n\nI have some fresh batteries coming tomorrow and going to test to see how it works and see if turning it on the OFF position helps.\n\nI was having issues earlier this year where I would maybe get 15 minutes of use in cold weather.", "link": "https://www.reddit.com/r/Leica/comments/lxcz61/any_leica_technicians_work_on_electronics/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any leica technicians work on electronics? /!/ i'm still having issues with battery drain on my m6 ttl. i recently sent it to yye and asked him to look into this. said it's probably an electronics issue and he doesn't do that.\n\ni have some fresh batteries coming tomorrow and going to test to see how it works and see if turning it on the off -----> position !!!  helps.\n\ni was having issues earlier this year where i would maybe get 15 minutes of use in cold weather.", "sortedWord": "None", "identifyer": 76109, "year": "2021"}, {"Unnamed: 0": 183751, "autor": "_hugerobots_", "date": 1617753617000, "content": "Anyone have eyes on an in-stock 35 APO? /!/ Or a waiting list position would be fun. Could give us an expectation.", "link": "https://www.reddit.com/r/Leica/comments/mlpfqx/anyone_have_eyes_on_an_instock_35_apo/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "anyone have eyes on an in-stock 35 apo? /!/ or a waiting list -----> position !!!  would be fun. could give us an expectation.", "sortedWord": "None", "identifyer": 76296, "year": "2021"}, {"Unnamed: 0": 183877, "autor": "Timesyndicate", "date": 1620036774000, "content": "M10 Reporter or M11? /!/ I have my local Leica dealer mess up my order and back order for 4 months,  they blame to Leica HQ Asia mess up region distribution and now offer me 2 solutions. Either wait for another month get M10 Reporter or wait until November for M11 announcements? What would be your choice if you were in my position and see which one more reasonable to choose.", "link": "https://www.reddit.com/r/Leica/comments/n3sk8l/m10_reporter_or_m11/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m10 reporter or m11? /!/ i have my local leica dealer mess up my order and back order for 4 months,  they blame to leica hq asia mess up region distribution and now offer me 2 solutions. either wait for another month get m10 reporter or wait until november for m11 announcements? what would be your choice if you were in my -----> position !!!  and see which one more reasonable to choose.", "sortedWord": "None", "identifyer": 76423, "year": "2021"}, {"Unnamed: 0": 183944, "autor": "apostrophe-s", "date": 1622765719000, "content": "Help with beginner LTM lens /!/ Hi all! After years of wanting to get into film photography I’m finally in a position to dabble a bit but I’m still very new. I bought a Pentax K1000 that came with its traditional lens but I was always enchanted with the Leica iiif, and after some eBay shopping I was finally able to snag one in good condition. However the lens it came with is a Nikkor 135 (https://www.mir.com.my/rb/photography/companies/nikon/nikkoresources/RF-Nikkor/RF135mm/index1.htm)\n\nLuckily it came with a viewfinder for that length and also one for 35mm for some reason.\n\nMy question is this: I’ve been told I should probably get a 50mm lens since 135 is mostly for portrait and I really would like to do street/landscape/and nature so a 50mm lens would be good. I like the idea of a collapsible lens since it would make the camera a little easier to transport, but the Summicron and Summitars are pretty pricey. I intend for this new lens to be my daily driver so I’ve seen forums where they say they’re more collector items and something like a 50 Elmar 3.5 lens would be better. I’ve also seen YouTube reviews by Matt Osborne who likes the Cannon 50 f/1.8 LTM lens a lot. I guess my question is what do you all recommend for someone starting off but a lens that will grow with me? I can’t afford a Summicron but am willing to spring for a Summitar if that gives a general idea of price point.\n\nAlso, any thoughts on wide range? Is that a lens I would need for nature or landscape? I included info on the K1000 because maybe I could use both cameras for different things?\n\nThank you all!", "link": "https://www.reddit.com/r/Leica/comments/nrs02m/help_with_beginner_ltm_lens/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help with beginner ltm lens /!/ hi all! after years of wanting to get into film photography i’m finally in a -----> position !!!  to dabble a bit but i’m still very new. i bought a pentax k1000 that came with its traditional lens but i was always enchanted with the leica iiif, and after some ebay shopping i was finally able to snag one in good condition. however the lens it came with is a nikkor 135 (https://www.mir.com.my/rb/photography/companies/nikon/nikkoresources/rf-nikkor/rf135mm/index1.htm)\n\nluckily it came with a viewfinder for that length and also one for 35mm for some reason.\n\nmy question is this: i’ve been told i should probably get a 50mm lens since 135 is mostly for portrait and i really would like to do street/landscape/and nature so a 50mm lens would be good. i like the idea of a collapsible lens since it would make the camera a little easier to transport, but the summicron and summitars are pretty pricey. i intend for this new lens to be my daily driver so i’ve seen forums where they say they’re more collector items and something like a 50 elmar 3.5 lens would be better. i’ve also seen youtube reviews by matt osborne who likes the cannon 50 f/1.8 ltm lens a lot. i guess my question is what do you all recommend for someone starting off but a lens that will grow with me? i can’t afford a summicron but am willing to spring for a summitar if that gives a general idea of price point.\n\nalso, any thoughts on wide range? is that a lens i would need for nature or landscape? i included info on the k1000 because maybe i could use both cameras for different things?\n\nthank you all!", "sortedWord": "None", "identifyer": 76492, "year": "2021"}], "name": "positionleica2021"}