{"interestingcomments": [{"Unnamed: 0": 216844, "autor": "35mmperseconds", "date": 1589817806000, "content": "Problem with my M6 /!/ Hello all, went out shooting the stars last week with my Leica M6 and my 50 Summicron and the 28mm F1.4 with a roll of Portra 400. Most of the pictures (if not underexposed too much) have those 3 dots on them. Since they appeared with both lenses i think its not an issue with the lenses (both are clean). First thought, this could be a scanner issue, but the dots depend on the Camera position. If i shifted the camera on the tripod they ended up on another spot of the scan (so it shouldn't be the scanner, right?). Any idea what could create these dots? Never saw them on earlier scans, but they appeared on this roll from the beginning i put the roll in (shot with several weeks delay between them)\n\nhttps://preview.redd.it/h7flc6hspjz41.jpg?width=3578&amp;format=pjpg&amp;auto=webp&amp;s=9aa0c30a101ab1fea2a096312478dee6d816cdb9", "link": "https://www.reddit.com/r/Leica/comments/gm484y/problem_with_my_m6/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "problem with my m6 /!/ hello all, went out shooting the stars last week with my leica m6 and my 50 summicron and the 28mm f1.4 with a roll of portra 400. most of the pictures (if not underexposed too much) have those 3 dots on them. since they appeared with both lenses i think its not an issue with the lenses (both are clean). first thought, this could be a scanner issue, but the dots depend on the camera -----> position !!! . if i shifted the camera on the tripod they ended up on another spot of the scan (so it shouldn't be the scanner, right?). any idea what could create these dots? never saw them on earlier scans, but they appeared on this roll from the beginning i put the roll in (shot with several weeks delay between them)\n\nhttps://preview.redd.it/h7flc6hspjz41.jpg?width=3578&amp;format=pjpg&amp;auto=webp&amp;s=9aa0c30a101ab1fea2a096312478dee6d816cdb9", "sortedWord": "None", "identifyer": 11288, "year": "2020"}, {"Unnamed: 0": 216869, "autor": "Jon_J_", "date": 1589482242000, "content": "Elmar not positioning right on M4?", "link": "https://www.reddit.com/r/Leica/comments/gjsfsz/elmar_not_positioning_right_on_m4/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "elmar not -----> positioning !!!  right on m4?", "sortedWord": "None", "identifyer": 11314, "year": "2020"}, {"Unnamed: 0": 216987, "autor": "Delete_Now", "date": 1596677548000, "content": "Need Help with Loading Film into M6 TTL /!/ Hi everyone. I'm still fairly new with using my M6 as I've probably now shot only about 10 or so rolls. Out of the 10 I've had about 3 rolls that had no images when the film was developed so I don't think I am loading the film properly.\n\nAfter I finished one roll in particular, I rewound the film and after a few cranks it became really hard to wind so I slowly kept winding and then felt a snap. The film has broken. I brought the roll into a lab to have it developed and it was blank. Since then I've had two other rolls that rewound correctly but again no exposures.\n\nQuestion 1: When I am shooting and advancing the film to the next frame, should I see the rewind (level) know rotate?\n\nQuestion 2: After I rewind a roll by lowering the film rewind level, and load a new roll should the rewind lever pop back up to the vertical position?\n\nI've never look at the position of the rewind lever before shooting with a new roll so I am wondering if the film in not advancing because the level (clutch) is still down or not back up all the way.\n\nAny other suggestions? This is not only getting expensive but I am losing a lot or precious shots. Thanks in advance!!", "link": "https://www.reddit.com/r/Leica/comments/i4ihf2/need_help_with_loading_film_into_m6_ttl/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help with loading film into m6 ttl /!/ hi everyone. i'm still fairly new with using my m6 as i've probably now shot only about 10 or so rolls. out of the 10 i've had about 3 rolls that had no images when the film was developed so i don't think i am loading the film properly.\n\nafter i finished one roll in particular, i rewound the film and after a few cranks it became really hard to wind so i slowly kept winding and then felt a snap. the film has broken. i brought the roll into a lab to have it developed and it was blank. since then i've had two other rolls that rewound correctly but again no exposures.\n\nquestion 1: when i am shooting and advancing the film to the next frame, should i see the rewind (level) know rotate?\n\nquestion 2: after i rewind a roll by lowering the film rewind level, and load a new roll should the rewind lever pop back up to the vertical -----> position !!! ?\n\ni've never look at the -----> position !!!  of the rewind lever before shooting with a new roll so i am wondering if the film in not advancing because the level (clutch) is still down or not back up all the way.\n\nany other suggestions? this is not only getting expensive but i am losing a lot or precious shots. thanks in advance!!", "sortedWord": "None", "identifyer": 11434, "year": "2020"}, {"Unnamed: 0": 217010, "autor": "xtsi2", "date": 1596416219000, "content": "Question about an M240/262 and a collapsible 50mm Elmar-M /!/ Hello, I can't seem to find the manual for this lens. From what I understand the lens should be attached and removed in it's **extended** position. What I don't seem to understand is if the lens can be collapsed once it is attached to the camera. I have a M262 if it matters.\n\nI assumed that it being collapsible on the camera is the point... however  just watched a Red Dot Forum live stream and they talked about this lens. They said that if the lens is fully collapsed on the camera the back of the lens can crash into the shutter.", "link": "https://www.reddit.com/r/Leica/comments/i2nk5i/question_about_an_m240262_and_a_collapsible_50mm/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question about an m240/262 and a collapsible 50mm elmar-m /!/ hello, i can't seem to find the manual for this lens. from what i understand the lens should be attached and removed in it's **extended** -----> position !!! . what i don't seem to understand is if the lens can be collapsed once it is attached to the camera. i have a m262 if it matters.\n\ni assumed that it being collapsible on the camera is the point... however  just watched a red dot forum live stream and they talked about this lens. they said that if the lens is fully collapsed on the camera the back of the lens can crash into the shutter.", "sortedWord": "None", "identifyer": 11457, "year": "2020"}, {"Unnamed: 0": 217194, "autor": "A-Gentleperson", "date": 1606027418000, "content": "I have been a fool. Today I learned that the Visoflex adapter OUBIO 16466M can be used in two positions. It has a turning tripod collar, that can be locked in both landscape and portrait orientation.", "link": "https://www.reddit.com/r/Leica/comments/jyr8x2/i_have_been_a_fool_today_i_learned_that_the/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i have been a fool. today i learned that the visoflex adapter oubio 16466m can be used in two -----> positions !!! . it has a turning tripod collar, that can be locked in both landscape and portrait orientation.", "sortedWord": "None", "identifyer": 11647, "year": "2020"}, {"Unnamed: 0": 217359, "autor": "wetreels", "date": 1598953225000, "content": "Film vs Digital Leica M's /!/ Recently purchased a digital M and since then I havent touched my film bodies. Im very happy with the results and working with raw. Not having the worry about the cost of film, time of development, and slooooow feedback is amazing. To those with both, were you ever in a position where you opted out for digital bodies only? If so, did you regret it? Im considering selling my M3 and M6 to purchase a back up.", "link": "https://www.reddit.com/r/Leica/comments/ikhap4/film_vs_digital_leica_ms/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "film vs digital leica m's /!/ recently purchased a digital m and since then i havent touched my film bodies. im very happy with the results and working with raw. not having the worry about the cost of film, time of development, and slooooow feedback is amazing. to those with both, were you ever in a -----> position !!!  where you opted out for digital bodies only? if so, did you regret it? im considering selling my m3 and m6 to purchase a back up.", "sortedWord": "None", "identifyer": 11816, "year": "2020"}, {"Unnamed: 0": 217769, "autor": "KauaiWeddingPlans", "date": 1591662497000, "content": "M5 Light meter was stuck in the \"UP\" position. /!/ Posting here because Im not a member of any Leica forums.\n\nGot some film back today, only to find that a lot of photos, some precious, had a giant black rectangle. As you probably already know from the title, my light meter was stuck in the \"UP\" position and was giving no indication through normal use. I reluctantly and gently nudged it back down into place and it seems to be working now, but now I don't know if I can trust it to shoot anything important. I've had the camera CLAd by DAG within the last 6 months to a year and Don told me that it was in great condition and that it seemed to have been CLAd very recently before. I bought the camera at Sukiya in Tokyo. \n\nHas anyone had this problem before and did this persist? It's my first Leica and I really love how it handles and Id like to keep it for a while. I should add that when it started, I let someone who has never used it before take a photo of me and my wife, so I don't know if they did something weird. Any feedback other than M5 hate would be appreciated.", "link": "https://www.reddit.com/r/Leica/comments/gzc0oh/m5_light_meter_was_stuck_in_the_up_position/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m5 light meter was stuck in the \"up\" -----> position !!! . /!/ posting here because im not a member of any leica forums.\n\ngot some film back today, only to find that a lot of photos, some precious, had a giant black rectangle. as you probably already know from the title, my light meter was stuck in the \"up\" position and was giving no indication through normal use. i reluctantly and gently nudged it back down into place and it seems to be working now, but now i don't know if i can trust it to shoot anything important. i've had the camera clad by dag within the last 6 months to a year and don told me that it was in great condition and that it seemed to have been clad very recently before. i bought the camera at sukiya in tokyo. \n\nhas anyone had this problem before and did this persist? it's my first leica and i really love how it handles and id like to keep it for a while. i should add that when it started, i let someone who has never used it before take a photo of me and my wife, so i don't know if they did something weird. any feedback other than m5 hate would be appreciated.", "sortedWord": "None", "identifyer": 12232, "year": "2020"}, {"Unnamed: 0": 217972, "autor": "sillo38", "date": 1604937357000, "content": "Favorite LTM Adapters /!/ What's up guys. So I've been shooting a Canon P for a while now and have acquired 25, 35, 50 and 100mm LTM lenses. I just got an M2 and while I'm eventually going to grab some M mount glass, I'm sticking with my LTM stuff for now and am looking for some decent adapters. I know the Leica and Voigtlander ones are highly recommended, but they're not the easiest/cheapest to find (and don't think they're made new anymore?) and while I stalk a few listings on ebay are there any decent and cheap options I can get by on. \n\nI've tried the Fotodiox ones and while they're ok, my 35 skopar doesn't clock right so the focus knob is in a weird position throughout most of the focus range. On the 100mm Canon lens because it's not clocked right the rangefinder doesn't couple. I also briefly tried the Metabones one which was complete garbage, barely fit into the mount and took way to much effort to lock in so I want to avoid those.", "link": "https://www.reddit.com/r/Leica/comments/jr04ee/favorite_ltm_adapters/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "favorite ltm adapters /!/ what's up guys. so i've been shooting a canon p for a while now and have acquired 25, 35, 50 and 100mm ltm lenses. i just got an m2 and while i'm eventually going to grab some m mount glass, i'm sticking with my ltm stuff for now and am looking for some decent adapters. i know the leica and voigtlander ones are highly recommended, but they're not the easiest/cheapest to find (and don't think they're made new anymore?) and while i stalk a few listings on ebay are there any decent and cheap options i can get by on. \n\ni've tried the fotodiox ones and while they're ok, my 35 skopar doesn't clock right so the focus knob is in a weird -----> position !!!  throughout most of the focus range. on the 100mm canon lens because it's not clocked right the rangefinder doesn't couple. i also briefly tried the metabones one which was complete garbage, barely fit into the mount and took way to much effort to lock in so i want to avoid those.", "sortedWord": "None", "identifyer": 12443, "year": "2020"}, {"Unnamed: 0": 218105, "autor": "WowSuchName21", "date": 1600201502000, "content": "Wondering what price I can put my M6 at. /!/ Hi all,\n\nSo I’ve fallen on hard times and my beloved M6 is my most valuable position. I paid about half of what it’s worth when I first bought it a few years back but just wondering what you guys think I should price it at? No pictures sorry, just found out news and I’m still at work just need to get a ballpark figure. I really hate to sell it but at the end of the day it’s time has come. It’s been my lovely companion for over two years now, I was hoping I could keep it forever but maybe sometime I can buy another. Anyway, details:\n\nIncluded:\n\nCamera:\n\n- Leica M6 Classic 0.72 (Black) condition is great, a chip on the red dot and a few minor scratches on the baseplate and a further few scratches on the winder. Finder is clear.\n\n-Original Leica Box. Outer cardboard and plastic (white with red felt inner) matching numbers. \n\n-Original Leica Strap. \n\n-Original warranty card, not for camera but from a different lens. name stickers on inside matched person I bought it from, which heavily \nimplies its had one previous owner before me. \n\nLens:\n\n- Serviced last year from cameraworks UK, a Summicron 50mm f/2 (Type 3 Lens.) \n\n-The red dot to line the lens up is missing and had been painted on from what I can see comparing it to other pictures of the same lens (though if anybody is familiar with the type 3 please let me know!)\n\n-the dot to line up the aperture has seemingly shifted to the bottom over time. It used to be loose but is now stuck, not sure weather or not to try and fix myself or sell as is. Again, any advice here would be appreciated. \n\n- LEICA e39 uva filter.", "link": "https://www.reddit.com/r/Leica/comments/itgwsc/wondering_what_price_i_can_put_my_m6_at/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wondering what price i can put my m6 at. /!/ hi all,\n\nso i’ve fallen on hard times and my beloved m6 is my most valuable -----> position !!! . i paid about half of what it’s worth when i first bought it a few years back but just wondering what you guys think i should price it at? no pictures sorry, just found out news and i’m still at work just need to get a ballpark figure. i really hate to sell it but at the end of the day it’s time has come. it’s been my lovely companion for over two years now, i was hoping i could keep it forever but maybe sometime i can buy another. anyway, details:\n\nincluded:\n\ncamera:\n\n- leica m6 classic 0.72 (black) condition is great, a chip on the red dot and a few minor scratches on the baseplate and a further few scratches on the winder. finder is clear.\n\n-original leica box. outer cardboard and plastic (white with red felt inner) matching numbers. \n\n-original leica strap. \n\n-original warranty card, not for camera but from a different lens. name stickers on inside matched person i bought it from, which heavily \nimplies its had one previous owner before me. \n\nlens:\n\n- serviced last year from cameraworks uk, a summicron 50mm f/2 (type 3 lens.) \n\n-the red dot to line the lens up is missing and had been painted on from what i can see comparing it to other pictures of the same lens (though if anybody is familiar with the type 3 please let me know!)\n\n-the dot to line up the aperture has seemingly shifted to the bottom over time. it used to be loose but is now stuck, not sure weather or not to try and fix myself or sell as is. again, any advice here would be appreciated. \n\n- leica e39 uva filter.", "sortedWord": "None", "identifyer": 12578, "year": "2020"}, {"Unnamed: 0": 218222, "autor": "AimClickCapture", "date": 1596895176000, "content": "M10 Framelines &amp; Shutter Actuation Count Questions /!/ I looked at a used copy of an M10 at my local dealer yesterday and came away with two questions pertaining to frame lines and shutter actuation count: \n\n1.) Should there be 28mm framelines visible when a 28mm lens is attached or is the entire viewfinder the 28mm framelines? I attached my Zeiss 28mm F2.8 ZM lens to this copy of the M10 and the frame lines that popped up seemed to be narrower (possibly the 35/135 combo) and didn’t seem to match up with what the actual image showed. However, the frameline preview lever seemed to lock into the correct position — all the way to the left (when looking at the camera from the front) right against the lens mount — and if I used the entire viewfinder window as my “frame line”, that seemed to be more accurate to the 28mm frame lines and NOT the ones that were showing in the viewfinder. Could this be an issue specific to this M10 copy? I know my Zeiss lens brings up the correct frame lines when attached to my M6 TTL. \n\n2.) Is there a way within the menu of the camera to see the shutter actuation count? This copy is rated as excellent and overall appears to be close to that (slight dust next to the shutter dial, very slight wear on the edges of the bottom baseplate; otherwise in beautiful condition) but given my concerns regarding the framelines above, I want to make sure this copy hasn’t had tens of thousands of shutter actuations (Or more) on it already and I’ll end up having to send it in for a costly service shortly after purchase. I have a feeling it’s a copy someone traded in to switch to the newer M10-R so it may have had a few years use on it already. \n\nAny info you can offer is greatly appreciated!", "link": "https://www.reddit.com/r/Leica/comments/i5zkv6/m10_framelines_shutter_actuation_count_questions/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m10 framelines &amp; shutter actuation count questions /!/ i looked at a used copy of an m10 at my local dealer yesterday and came away with two questions pertaining to frame lines and shutter actuation count: \n\n1.) should there be 28mm framelines visible when a 28mm lens is attached or is the entire viewfinder the 28mm framelines? i attached my zeiss 28mm f2.8 zm lens to this copy of the m10 and the frame lines that popped up seemed to be narrower (possibly the 35/135 combo) and didn’t seem to match up with what the actual image showed. however, the frameline preview lever seemed to lock into the correct -----> position !!!  — all the way to the left (when looking at the camera from the front) right against the lens mount — and if i used the entire viewfinder window as my “frame line”, that seemed to be more accurate to the 28mm frame lines and not the ones that were showing in the viewfinder. could this be an issue specific to this m10 copy? i know my zeiss lens brings up the correct frame lines when attached to my m6 ttl. \n\n2.) is there a way within the menu of the camera to see the shutter actuation count? this copy is rated as excellent and overall appears to be close to that (slight dust next to the shutter dial, very slight wear on the edges of the bottom baseplate; otherwise in beautiful condition) but given my concerns regarding the framelines above, i want to make sure this copy hasn’t had tens of thousands of shutter actuations (or more) on it already and i’ll end up having to send it in for a costly service shortly after purchase. i have a feeling it’s a copy someone traded in to switch to the newer m10-r so it may have had a few years use on it already. \n\nany info you can offer is greatly appreciated!", "sortedWord": "None", "identifyer": 12699, "year": "2020"}, {"Unnamed: 0": 218303, "autor": "paparoachfan420", "date": 1597890086000, "content": "Leica M5 lens compatibility question /!/ I’ve heard some lenses are not compatible with the M5 due to the position of the light meter. Can anyone point me toward a comprehensive list of lenses which are not compatible? \n\nAdditionally, if anyone is selling a 3-lug M5 with a serial number over 135XXXX, let me know!", "link": "https://www.reddit.com/r/Leica/comments/id1ti9/leica_m5_lens_compatibility_question/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica m5 lens compatibility question /!/ i’ve heard some lenses are not compatible with the m5 due to the -----> position !!!  of the light meter. can anyone point me toward a comprehensive list of lenses which are not compatible? \n\nadditionally, if anyone is selling a 3-lug m5 with a serial number over 135xxxx, let me know!", "sortedWord": "None", "identifyer": 12780, "year": "2020"}, {"Unnamed: 0": 218534, "autor": "dangerousdingus", "date": 1588018267000, "content": "Looking for advice into buying my first leica. /!/ Hi all,\n\nI have been shooting with my nikon fm coupled with a 50mm lens for some time and have had great fun shooting with it, \nbut i have always dreamed to shoot with a leica m6.\n\nNow having saved up enough to purchase one, I have come  to sense that the prices have increased quite alot in recent times and I have begun to ask myself questions such as whether or not it is stupid of me in my current position (university student working as a casual) to purchase it.\n\nI would greatly appreciate if i could hear some of your opinions on whether or not it is a good time to go ahead and purchase one. (I am also afraid prices might decrease due to reasons such as a loss in hype from mainstream audiences).", "link": "https://www.reddit.com/r/Leica/comments/g98d5y/looking_for_advice_into_buying_my_first_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for advice into buying my first leica. /!/ hi all,\n\ni have been shooting with my nikon fm coupled with a 50mm lens for some time and have had great fun shooting with it, \nbut i have always dreamed to shoot with a leica m6.\n\nnow having saved up enough to purchase one, i have come  to sense that the prices have increased quite alot in recent times and i have begun to ask myself questions such as whether or not it is stupid of me in my current -----> position !!!  (university student working as a casual) to purchase it.\n\ni would greatly appreciate if i could hear some of your opinions on whether or not it is a good time to go ahead and purchase one. (i am also afraid prices might decrease due to reasons such as a loss in hype from mainstream audiences).", "sortedWord": "None", "identifyer": 13013, "year": "2020"}, {"Unnamed: 0": 218642, "autor": "A-Gentleperson", "date": 1604077683000, "content": "I'm looking for a vertical grip for my Leica M3. /!/ I like to photograph birds and other wildlife with my Leica M3, and sometimes I have to have the camera in very unnatural/weird/uncomfortable positions. Having a vertical grip would help a lot. It doesn't have to do anything other than be a vertical grip. Think battery grip, but just no functions. Hopefully someone knows one, that fits the bill. If not, I'll have to have one made, which I'd like to avoid. Probably rather pricy. Thanks in advance.", "link": "https://www.reddit.com/r/Leica/comments/jl0rrj/im_looking_for_a_vertical_grip_for_my_leica_m3/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i'm looking for a vertical grip for my leica m3. /!/ i like to photograph birds and other wildlife with my leica m3, and sometimes i have to have the camera in very unnatural/weird/uncomfortable -----> positions !!! . having a vertical grip would help a lot. it doesn't have to do anything other than be a vertical grip. think battery grip, but just no functions. hopefully someone knows one, that fits the bill. if not, i'll have to have one made, which i'd like to avoid. probably rather pricy. thanks in advance.", "sortedWord": "None", "identifyer": 13125, "year": "2020"}, {"Unnamed: 0": 218643, "autor": "Yablan", "date": 1604062133000, "content": "Leica Q - EVF has a fisheye type distortion on the edges, difficult to use. Only me? /!/ So, I recently got a Leica Q, and the image quality is great.   \nMy other/previous camera is a Fuji X-T20. I will sell it soon (I cannot justify keeping both).  \nAnd I have some issues with the EVF. It is quite distorted in the edges, and I have to position my eyes EXACTLY right to get a sharp image in the center.   \nI've never had that particular kind of problem with my other/previous mirrorless cameras. There, I just put my eye against the viewfinder, and it just works. \n\n Is it only me?", "link": "https://www.reddit.com/r/Leica/comments/jkw46m/leica_q_evf_has_a_fisheye_type_distortion_on_the/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica q - evf has a fisheye type distortion on the edges, difficult to use. only me? /!/ so, i recently got a leica q, and the image quality is great.   \nmy other/previous camera is a fuji x-t20. i will sell it soon (i cannot justify keeping both).  \nand i have some issues with the evf. it is quite distorted in the edges, and i have to -----> position !!!  my eyes exactly right to get a sharp image in the center.   \ni've never had that particular kind of problem with my other/previous mirrorless cameras. there, i just put my eye against the viewfinder, and it just works. \n\n is it only me?", "sortedWord": "None", "identifyer": 13126, "year": "2020"}], "name": "positionleica2020"}