{"interestingcomments": [{"Unnamed: 0": 218871, "autor": "Timesyndicate", "date": 1552184069000, "content": "How much it would cost to send Leica clean oil on aperture blade? /!/ I got 28mm Summicron and there's a few oil spot on aperture blade, I'm curious how much it would cost to send Leica clean oil on aperture blade.", "link": "https://www.reddit.com/r/Leica/comments/azb0tr/how_much_it_would_cost_to_send_leica_clean_oil_on/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much it would cost to send leica clean oil on aperture blade? /!/ i got 28mm summicron and there's a few oil -----> spot !!!  on aperture blade, i'm curious how much it would cost to send leica clean oil on aperture blade.", "sortedWord": "None", "identifyer": 13361, "year": "2019"}, {"Unnamed: 0": 218872, "autor": "Timesyndicate", "date": 1552183970000, "content": "How much is cost to clean oil on aperture blade /!/ I got 28mm Summicron and there's a few oil spot on aperture blade, I'm curious how much it would cost to send Leica clean oil on aperture blade.", "link": "https://www.reddit.com/r/Leica/comments/azb0bb/how_much_is_cost_to_clean_oil_on_aperture_blade/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much is cost to clean oil on aperture blade /!/ i got 28mm summicron and there's a few oil -----> spot !!!  on aperture blade, i'm curious how much it would cost to send leica clean oil on aperture blade.", "sortedWord": "None", "identifyer": 13362, "year": "2019"}, {"Unnamed: 0": 218916, "autor": "eyeiaye", "date": 1550415768000, "content": "Leica MP with Voigtlander lenses??? Or M6 and slow Leica glass? /!/ Hey all. \n\nSo I am selling all my camera gear and downsizing to 1 camera body and 1-2 lenses. I am a professional documentary photographer, and usually don’t post, but I’m torn. \n\nBecause this is to get rid of my GAS and focus on the craft I have some things I require. \n\n1) the camera needs to be rock solid and require minimal service. I make my living on my photos and hope to have this camera for the next 20-30 years. This is a buy for life situation. \n\n2) i need something compact. So that rules out most zeiss as it is chunky. The best camera is what you have slung around your neck, and if my lenses stuck out I bust them. So super thin. \n\n3) I’m all about feel. To me taking pictures is spiritual. \n\n4) I want a 28-50 focal length. So 35 is the sweet spot. \n\nSo given all of this, I am now to the big decision. Get the MP for longevity so I can be avoiding CLA and parts in the future and get something like the new voigtlander 1.4 35.  Super thin, etc. \n\nOr\n\nGet a used m6 and a used 35 2.4\n\nI’m not a pixel peeper, I like quality and flexibility. I also create images that can be described as “dreamy yet sterile”\n\nHope this helps. Thanks all for your thoughts!", "link": "https://www.reddit.com/r/Leica/comments/arla14/leica_mp_with_voigtlander_lenses_or_m6_and_slow/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica mp with voigtlander lenses??? or m6 and slow leica glass? /!/ hey all. \n\nso i am selling all my camera gear and downsizing to 1 camera body and 1-2 lenses. i am a professional documentary photographer, and usually don’t post, but i’m torn. \n\nbecause this is to get rid of my gas and focus on the craft i have some things i require. \n\n1) the camera needs to be rock solid and require minimal service. i make my living on my photos and hope to have this camera for the next 20-30 years. this is a buy for life situation. \n\n2) i need something compact. so that rules out most zeiss as it is chunky. the best camera is what you have slung around your neck, and if my lenses stuck out i bust them. so super thin. \n\n3) i’m all about feel. to me taking pictures is spiritual. \n\n4) i want a 28-50 focal length. so 35 is the sweet -----> spot !!! . \n\nso given all of this, i am now to the big decision. get the mp for longevity so i can be avoiding cla and parts in the future and get something like the new voigtlander 1.4 35.  super thin, etc. \n\nor\n\nget a used m6 and a used 35 2.4\n\ni’m not a pixel peeper, i like quality and flexibility. i also create images that can be described as “dreamy yet sterile”\n\nhope this helps. thanks all for your thoughts!", "sortedWord": "None", "identifyer": 13409, "year": "2019"}, {"Unnamed: 0": 218923, "autor": "thecasperlife", "date": 1550032217000, "content": "Cleaning sensor dust? /!/ Hi everyone,\n\n&amp;#x200B;\n\nI just picked up a second-hand Leica M240 and was testing it out shooting some snow in the afternoon when I noticed what looked like dust spots. I took a photo of a white screen at F/22 and got this: [https://imgur.com/hX0NS33](https://imgur.com/hX0NS33), which appears to be dust (I think?)\n\nI tried cleaning it with a rocket blower but it barely made a difference. \n\nAnyone have any tips on getting the sensor clean?", "link": "https://www.reddit.com/r/Leica/comments/aq2nhk/cleaning_sensor_dust/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning sensor dust? /!/ hi everyone,\n\n&amp;#x200b;\n\ni just picked up a second-hand leica m240 and was testing it out shooting some snow in the afternoon when i noticed what looked like dust -----> spots !!! . i took a photo of a white screen at f/22 and got this: [https://imgur.com/hx0ns33](https://imgur.com/hx0ns33), which appears to be dust (i think?)\n\ni tried cleaning it with a rocket blower but it barely made a difference. \n\nanyone have any tips on getting the sensor clean?", "sortedWord": "None", "identifyer": 13416, "year": "2019"}, {"Unnamed: 0": 219029, "autor": "TheOtherAccount3333", "date": 1546377602000, "content": "Analog camera with a digital back: q vs m10 /!/ Hi, I am new to Leica but have been contemplating getting one for many years. I would like to ask of those of you with experience which camera , Leica Q or Leica M10 May be a right fit for me. \n\nI’m experienced photographer and the most joy I still have when shooting for my own personal needs is the simplicity of a film camera. My only 35mm film camera I have is a Pentax K1000. I do also have an older canon model but the pure simplicity of aperture, shutter, and a spot meter are all I really need. Even today, I tend to use techniques with focusing in the center and re-framing. \n\nI have been looking to get a Leica q because it is an all in one package and I like fixed lens camera s and generally shoot primes on my DSLR.  However, the q has both worlds of past and present which may be a good fit. The camera I purchased to fill my Leica need in the past is a Fuji X100T which I absolutely love. The Q I’ve heard is a better version of this camera in every way other than compactness ( protruding lens) \n\nSaying that, I just looked at reviews of the M10-D and it fits so close to everything that I wanted in simple 35mm camera with relying on fundamentals and only on myself. I would probably get a M10-P because I am still not sure if I could live without a screen, but I have a bad habit of chimping and getting lazy with modern cameras limitless shots. \n\nFor professional work I have a new Fuji XT3, but am not sure if the Q or a M10 would work better to my ideal version. Also I have some very nice film era glass from Pentax ( limited primes ) , that may be good on a Leica body? ", "link": "https://www.reddit.com/r/Leica/comments/abm4iq/analog_camera_with_a_digital_back_q_vs_m10/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "analog camera with a digital back: q vs m10 /!/ hi, i am new to leica but have been contemplating getting one for many years. i would like to ask of those of you with experience which camera , leica q or leica m10 may be a right fit for me. \n\ni’m experienced photographer and the most joy i still have when shooting for my own personal needs is the simplicity of a film camera. my only 35mm film camera i have is a pentax k1000. i do also have an older canon model but the pure simplicity of aperture, shutter, and a -----> spot !!!  meter are all i really need. even today, i tend to use techniques with focusing in the center and re-framing. \n\ni have been looking to get a leica q because it is an all in one package and i like fixed lens camera s and generally shoot primes on my dslr.  however, the q has both worlds of past and present which may be a good fit. the camera i purchased to fill my leica need in the past is a fuji x100t which i absolutely love. the q i’ve heard is a better version of this camera in every way other than compactness ( protruding lens) \n\nsaying that, i just looked at reviews of the m10-d and it fits so close to everything that i wanted in simple 35mm camera with relying on fundamentals and only on myself. i would probably get a m10-p because i am still not sure if i could live without a screen, but i have a bad habit of chimping and getting lazy with modern cameras limitless shots. \n\nfor professional work i have a new fuji xt3, but am not sure if the q or a m10 would work better to my ideal version. also i have some very nice film era glass from pentax ( limited primes ) , that may be good on a leica body? ", "sortedWord": "None", "identifyer": 13524, "year": "2019"}, {"Unnamed: 0": 219061, "autor": "benmills", "date": 1554926725000, "content": "Summicron 35mm ASPH Stiff Focus /!/ Hi folks!\n\n&amp;#x200B;\n\nOne of my first Leica lenses was the first version of the summicron 35mm ASPH. While I decided to move on to other lenses, one of the things it had that I absolutely loved was how fast I could focus it. It had  just barely enough resistance where I didn't feel out of control.\n\n&amp;#x200B;\n\nOver the last few years I realized 35mm was really my sweet spot so I just bought a V2 summicron 35mm ASPH. One thing that has disappointed me is the focus is significantly stiffer. I also shoot often with a Summilux 50mm ASPH which I generally consider to be slow to focus mostly due to the floating element. My copy of the v2 summicron 35MM is even stiffer than my 50mm Summilux.\n\n&amp;#x200B;\n\nI figure not many people have shot for an extended time with the different versions of the 35mm summicron ASPH, but I wanted to see if anyone else had a similar experience. Even if not, I'm curious if folks had luck getting a lens serviced to make the focus ring move faster. I bought it used, but since the lens only came out a few years ago it's definitely not a super old lens. \n\n&amp;#x200B;\n\nThank you!", "link": "https://www.reddit.com/r/Leica/comments/bbqo6i/summicron_35mm_asph_stiff_focus/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "summicron 35mm asph stiff focus /!/ hi folks!\n\n&amp;#x200b;\n\none of my first leica lenses was the first version of the summicron 35mm asph. while i decided to move on to other lenses, one of the things it had that i absolutely loved was how fast i could focus it. it had  just barely enough resistance where i didn't feel out of control.\n\n&amp;#x200b;\n\nover the last few years i realized 35mm was really my sweet -----> spot !!!  so i just bought a v2 summicron 35mm asph. one thing that has disappointed me is the focus is significantly stiffer. i also shoot often with a summilux 50mm asph which i generally consider to be slow to focus mostly due to the floating element. my copy of the v2 summicron 35mm is even stiffer than my 50mm summilux.\n\n&amp;#x200b;\n\ni figure not many people have shot for an extended time with the different versions of the 35mm summicron asph, but i wanted to see if anyone else had a similar experience. even if not, i'm curious if folks had luck getting a lens serviced to make the focus ring move faster. i bought it used, but since the lens only came out a few years ago it's definitely not a super old lens. \n\n&amp;#x200b;\n\nthank you!", "sortedWord": "None", "identifyer": 13556, "year": "2019"}, {"Unnamed: 0": 219143, "autor": "Jon_J_", "date": 1558389641000, "content": "Question....what do the small red lines symbolize? Lense aperture sweet spots?", "link": "https://www.reddit.com/r/Leica/comments/br1zub/questionwhat_do_the_small_red_lines_symbolize/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "question....what do the small red lines symbolize? lense aperture sweet -----> spots !!! ?", "sortedWord": "None", "identifyer": 13638, "year": "2019"}, {"Unnamed: 0": 219376, "autor": "LoMeinBoi", "date": 1561073154000, "content": "Leica D-Lux 3 case help /!/ I just bought a D-Lux 3 and noticed it only has one spot to attach a lanyard. The vintage Leica cases that are made for it go for ~100 and that’s a bit too expensive for the camera it is. I was just wondering if there’s a half case that will fit it or a 3rd party case maker that makes one that will work. Thanks!", "link": "https://www.reddit.com/r/Leica/comments/c32z33/leica_dlux_3_case_help/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica d-lux 3 case help /!/ i just bought a d-lux 3 and noticed it only has one -----> spot !!!  to attach a lanyard. the vintage leica cases that are made for it go for ~100 and that’s a bit too expensive for the camera it is. i was just wondering if there’s a half case that will fit it or a 3rd party case maker that makes one that will work. thanks!", "sortedWord": "None", "identifyer": 13877, "year": "2019"}, {"Unnamed: 0": 219529, "autor": "warrrenh", "date": 1571340737000, "content": "M9... why! /!/ So recently I have found that my M9 has corrosion in a coupe of spots.  I had the sensor replaced the first time after the glass broke in 2014. \n\nHas anyone here upgraded theirs or even just replaced the sensor again?  I can't decide one whether to repair or upgrade at this point. \n\nIs it possible even to upgrade to a SL?", "link": "https://www.reddit.com/r/Leica/comments/djbdh6/m9_why/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "m9... why! /!/ so recently i have found that my m9 has corrosion in a coupe of -----> spots !!! .  i had the sensor replaced the first time after the glass broke in 2014. \n\nhas anyone here upgraded theirs or even just replaced the sensor again?  i can't decide one whether to repair or upgrade at this point. \n\nis it possible even to upgrade to a sl?", "sortedWord": "None", "identifyer": 14030, "year": "2019"}, {"Unnamed: 0": 219569, "autor": "nichisato", "date": 1570011004000, "content": "Which one i should calibrate? /!/ Hi, I have M240 with 7artisans 35mm/f2 and Nokton 40mm/F1.4\n\nwhen i bought 7artisans new, i adjust the focusing ring with their screw from the box (from here i know that all 7artisans should be adjusted), and then i adjusted till it spot on from my camera and distance from the lens. \n\nToday, i bought used Nokton 40mm/F1.4, and then test my focus to 1m with Live View, it seems right, but when i use OVF with rangefinder, it seems off, it's on 0.8m. \n\nWhich one i should calibrate? my lens or my camera?\n\ni was test other lenses too on used store, i test summicron, zeiss, and voigt, some of them ok, but some of them off.\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/Leica/comments/dc8678/which_one_i_should_calibrate/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "which one i should calibrate? /!/ hi, i have m240 with 7artisans 35mm/f2 and nokton 40mm/f1.4\n\nwhen i bought 7artisans new, i adjust the focusing ring with their screw from the box (from here i know that all 7artisans should be adjusted), and then i adjusted till it -----> spot !!!  on from my camera and distance from the lens. \n\ntoday, i bought used nokton 40mm/f1.4, and then test my focus to 1m with live view, it seems right, but when i use ovf with rangefinder, it seems off, it's on 0.8m. \n\nwhich one i should calibrate? my lens or my camera?\n\ni was test other lenses too on used store, i test summicron, zeiss, and voigt, some of them ok, but some of them off.\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 14071, "year": "2019"}, {"Unnamed: 0": 219574, "autor": "Atomicbrtzel", "date": 1569961859000, "content": "Leica M3 stored for years - lack of contrast for the rangefinder /!/ Hi!\n\nLately I gota ton of cameras that my grandfather had as part of a collection (Nikon, Canon, Rolleiflex, Kowa, Foca, etc) and in the lot there is a Leica M3.\n\nBefore that I only used digital cameras and I tested about 4 out of 50 so far but the Leica, not yet. It seems in pretty good shape, the Summicron 50 had 0 fungus, all shutter speeds seem perfect (which is quite amazing to me as it was unused and stored in a pretty warm place for about 30 years) and the body looks okay.\n\n[https://imgur.com/a/bw5WcSm](https://imgur.com/a/bw5WcSm) \\- some cameras I brought home first (I just couldn't take all in one trip)\n\nThe issue comes when it comes to the rangefinder. I compared it to other rangefinders he got and it seems like it lacks some contrast to it. I still shot a roll with the M3 (going to send it to the lab in a few days) to see what comes out of it but I'm still puzzled with this rangefinder thing, maybe this is normal and I'm just too picky I don't know.\n\nSo, I took some pictures of the lenses for the viewfinder and rangefinder, do you have any idea what caused these things I can see on the glass (different for both) ?\n\n [https://imgur.com/a/2FvDPMZ](https://imgur.com/a/2FvDPMZ) \n\nIt looks like some small black spots everywhere in the rangefinder and like part of the glass peeled (?) for the viewfinder.\n\nIf you have any tips or idea of how much it would be to send it to repair it could really help!\n\nThank you :)", "link": "https://www.reddit.com/r/Leica/comments/dbzbvb/leica_m3_stored_for_years_lack_of_contrast_for/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "leica m3 stored for years - lack of contrast for the rangefinder /!/ hi!\n\nlately i gota ton of cameras that my grandfather had as part of a collection (nikon, canon, rolleiflex, kowa, foca, etc) and in the lot there is a leica m3.\n\nbefore that i only used digital cameras and i tested about 4 out of 50 so far but the leica, not yet. it seems in pretty good shape, the summicron 50 had 0 fungus, all shutter speeds seem perfect (which is quite amazing to me as it was unused and stored in a pretty warm place for about 30 years) and the body looks okay.\n\n[https://imgur.com/a/bw5wcsm](https://imgur.com/a/bw5wcsm) \\- some cameras i brought home first (i just couldn't take all in one trip)\n\nthe issue comes when it comes to the rangefinder. i compared it to other rangefinders he got and it seems like it lacks some contrast to it. i still shot a roll with the m3 (going to send it to the lab in a few days) to see what comes out of it but i'm still puzzled with this rangefinder thing, maybe this is normal and i'm just too picky i don't know.\n\nso, i took some pictures of the lenses for the viewfinder and rangefinder, do you have any idea what caused these things i can see on the glass (different for both) ?\n\n [https://imgur.com/a/2fvdpmz](https://imgur.com/a/2fvdpmz) \n\nit looks like some small black -----> spots !!!  everywhere in the rangefinder and like part of the glass peeled (?) for the viewfinder.\n\nif you have any tips or idea of how much it would be to send it to repair it could really help!\n\nthank you :)", "sortedWord": "None", "identifyer": 14076, "year": "2019"}, {"Unnamed: 0": 219693, "autor": "Captain_Toots", "date": 1572273764000, "content": "Leica M4 dark spot on rangefinder patch /!/ I just had my Leica M4 CLA'd by Youxin, after about a day of usage a dark spot appears on the rangefinder patch. I cleaned the rangefinder window and the viewfinder, but the spot is still there. I don't really want to send it back in for CLA again, and I'm wondering if there are any ways I can fix this at home.", "link": "https://www.reddit.com/r/Leica/comments/do9rok/leica_m4_dark_spot_on_rangefinder_patch/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica m4 dark -----> spot !!!  on rangefinder patch /!/ i just had my leica m4 cla'd by youxin, after about a day of usage a dark spot appears on the rangefinder patch. i cleaned the rangefinder window and the viewfinder, but the spot is still there. i don't really want to send it back in for cla again, and i'm wondering if there are any ways i can fix this at home.", "sortedWord": "None", "identifyer": 14197, "year": "2019"}, {"Unnamed: 0": 219715, "autor": "sherpa_pat", "date": 1571620373000, "content": "Sold my X Vario... /!/ I sold my X Vario yesterday. It was my first and, so far, only Leica. It served me well for the last 5 years, so I think it’s time for a little retrospective. Consider this a long-term review. This is a bit long and also could be considered my first camera review.\n\nI bought the XV in 2014 to supplement my Canon 30D w/35L &amp; 70-200 f/4. The goal was to get a camera that was more portable and to get out of the mindset of constantly chasing new lenses. For what I wanted, the XV filled the the niche perfectly with its small size and versatile zoom range. To this point, it ultimately replaced my 30D. In the early days I would shoot with both, but the Canon gear stopped getting brought along on my outings or travel due to its cumbersome size. An important factor for my choice of the XV, and ultimately its continued use, was fully manual controls that are easily accessible. Early on, I bought the Olympus VF-2 and found that the optional EVF was a must. I rarely ever shot using the LCD screen. I found myself tilting the EVF 90 degrees and looking down for a lot of photos. By resting the camera in front of my chest, I could be very steady and get a slightly different point of view. I don’t have statistics, but an overwhelming majority of my photos were taken this way. The EVF also allows you to easily get low to the ground. The occasional self-timer group shot was also made easy to compose by laying the camera down on any surface and using the tiltable EVF.\n\nWhat I didn’t expect from the XV was how amazing colours, light and shadows would be rendered compared to the Canon. I had researched the XV extensively prior to buying it and looked at many images others had taken with the camera, but it was a bit of a revelation in how much the camera took away from post processing work. Images just immediately “popped” with beautiful contrast and saturation, without being excessive. I still get blown away by results from the little guy 5 years later. (Shameless plug, you can see my recent images from a trip to Vancouver with the XV to get a taste of those colours https://www.instagram.com/p.mg.ee/ ). An unintended aspect of this was that I started getting drawn to scenes with colours and light that favoured the XV. I would get excited when I saw these scenes.\n\nFor my photographic journey, the XV made me slow down and focus on composing the entire frame. I didn’t realize how I previously used depth of field as a crutch, especially with the 35L. The XV, with its often criticized lack of wide aperture (f/3.5-6.4 on a FF equivalent 28-70mm), doesn’t allow for much use of bokeh as an artistic tool. That said, the XV does, under the right circumstances, render out of focus areas quite nicely. It has pleasing bokeh. Through my forced change in photographic perspective, I developed a love for facades and architectural photos of cities. The XV is very strong for this use and produced consistent results when used in manual focus mode.\n\nOverall, I think the XV made me a better photographer and in general I’ve been overwhelmingly pleased with my results. I’m glad I got to use this camera.\n\n\nMy XV also had a number of issues... Which ultimately led to my decision to sell it now. I’d like to detail them for prospective buyers of the XV.\n\nI feel like its age was showing with the overall slow operation and startup time. Even on my first day with the XV, I was surprised that my 30D from 2006 was a faster operating camera than the XV. Today, the difference feels even worse, which is hard to believe. Electronically, my 30D has felt more consistent — I still have it, even though hasn’t gotten much use lately, it still functions like it did when I got it in 2009. I don’t have any other cameras to benchmark so it’s the only comparison I can make. Pre-focusing manually can help speed up the camera when taking photos as shutter lag isn’t too bad when AF isn’t required. Because the XV lens is a zoom, there aren’t any guides for zone focusing, so a bit of trial and error pays off for those moments it’s needed.\n\nThe flimsy battery latch broke twice and I didn’t bother repairing it the second time. The battery door will hold the battery in place, one just needs to be careful not to drop the battery out when opening the door. \n\nThere’s sensor dust that somehow accumulated inside and it would require a Leica CLA to remove the dust. At this point, it didn’t seem to be worth the cost so I just kept cloning out the bad spots whenever they were visible in a scene.\n\nThe EVF screen displays a review of the latest shot for far too long. This is akin to SLR shutter blackout, but much worse. It often feels like the image review is frozen (see http://www.waloszek.de/lxv_func_err_e.php#auto_review for an explanation on this phenomenon). For some reason Leica never corrected this with a firmware update. It didn’t ruin the camera and I still consider it quite good for the type of photography I did with the XV, but it’s certainly disappointing it wasn’t fixed. Recently, I would change the shutter or aperture settings between shots and the camera frustratingly wouldn’t register these changes. I suspect this was related to the frozen review issue. \n\nThe manual focus mode, while useful, wasn’t exactly to my liking. It worked well in static settings and macro, but was difficult to work with when taking images of people. Unfortunately, the AF would occasionally misfocus entirely resulting in bad and often unusable images. Not to get into a debate on user error vs equipment, there are intermittent focusing problems with the XV that are fairly well detailed on the web. In my experience, they are true. It’s possible that this isn’t consistent from camera to camera. One has to expect a few duds through a day of shooting the XV due to focus issues, so take care to review your work in the field. Unfortunately, this is not always possible with photos of people. The moment is gone. Ultimately, this AF behaviour was unlike my extensive experience with the 30D that I used primarily in servo mode with back button focusing. I would burst shoot and pick the best image in post. The XV didn’t lend itself well to this type of continuous shooting. This per se isn’t a knock against the XV, they are completely different cameras and need to be worked differently. It did teach me to better anticipate moments with people.\n\n\nShould you get an X Vario in 2019? I think it’s hard to provide a resounding yes when there are a lot of options out there to consider. I haven’t done research on the competition and I haven’t used other cameras in its class to provide a definite answer. In a way, I wish I could have kept it, but I needed to sell it to fund my next camera. The XV still captures great images and I think in some ways I will miss it. If you can live with its quirks or faults, and you find it at a good price I can then recommend it.", "link": "https://www.reddit.com/r/Leica/comments/dkszw3/sold_my_x_vario/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sold my x vario... /!/ i sold my x vario yesterday. it was my first and, so far, only leica. it served me well for the last 5 years, so i think it’s time for a little retrospective. consider this a long-term review. this is a bit long and also could be considered my first camera review.\n\ni bought the xv in 2014 to supplement my canon 30d w/35l &amp; 70-200 f/4. the goal was to get a camera that was more portable and to get out of the mindset of constantly chasing new lenses. for what i wanted, the xv filled the the niche perfectly with its small size and versatile zoom range. to this point, it ultimately replaced my 30d. in the early days i would shoot with both, but the canon gear stopped getting brought along on my outings or travel due to its cumbersome size. an important factor for my choice of the xv, and ultimately its continued use, was fully manual controls that are easily accessible. early on, i bought the olympus vf-2 and found that the optional evf was a must. i rarely ever shot using the lcd screen. i found myself tilting the evf 90 degrees and looking down for a lot of photos. by resting the camera in front of my chest, i could be very steady and get a slightly different point of view. i don’t have statistics, but an overwhelming majority of my photos were taken this way. the evf also allows you to easily get low to the ground. the occasional self-timer group shot was also made easy to compose by laying the camera down on any surface and using the tiltable evf.\n\nwhat i didn’t expect from the xv was how amazing colours, light and shadows would be rendered compared to the canon. i had researched the xv extensively prior to buying it and looked at many images others had taken with the camera, but it was a bit of a revelation in how much the camera took away from post processing work. images just immediately “popped” with beautiful contrast and saturation, without being excessive. i still get blown away by results from the little guy 5 years later. (shameless plug, you can see my recent images from a trip to vancouver with the xv to get a taste of those colours https://www.instagram.com/p.mg.ee/ ). an unintended aspect of this was that i started getting drawn to scenes with colours and light that favoured the xv. i would get excited when i saw these scenes.\n\nfor my photographic journey, the xv made me slow down and focus on composing the entire frame. i didn’t realize how i previously used depth of field as a crutch, especially with the 35l. the xv, with its often criticized lack of wide aperture (f/3.5-6.4 on a ff equivalent 28-70mm), doesn’t allow for much use of bokeh as an artistic tool. that said, the xv does, under the right circumstances, render out of focus areas quite nicely. it has pleasing bokeh. through my forced change in photographic perspective, i developed a love for facades and architectural photos of cities. the xv is very strong for this use and produced consistent results when used in manual focus mode.\n\noverall, i think the xv made me a better photographer and in general i’ve been overwhelmingly pleased with my results. i’m glad i got to use this camera.\n\n\nmy xv also had a number of issues... which ultimately led to my decision to sell it now. i’d like to detail them for prospective buyers of the xv.\n\ni feel like its age was showing with the overall slow operation and startup time. even on my first day with the xv, i was surprised that my 30d from 2006 was a faster operating camera than the xv. today, the difference feels even worse, which is hard to believe. electronically, my 30d has felt more consistent — i still have it, even though hasn’t gotten much use lately, it still functions like it did when i got it in 2009. i don’t have any other cameras to benchmark so it’s the only comparison i can make. pre-focusing manually can help speed up the camera when taking photos as shutter lag isn’t too bad when af isn’t required. because the xv lens is a zoom, there aren’t any guides for zone focusing, so a bit of trial and error pays off for those moments it’s needed.\n\nthe flimsy battery latch broke twice and i didn’t bother repairing it the second time. the battery door will hold the battery in place, one just needs to be careful not to drop the battery out when opening the door. \n\nthere’s sensor dust that somehow accumulated inside and it would require a leica cla to remove the dust. at this point, it didn’t seem to be worth the cost so i just kept cloning out the bad -----> spots !!!  whenever they were visible in a scene.\n\nthe evf screen displays a review of the latest shot for far too long. this is akin to slr shutter blackout, but much worse. it often feels like the image review is frozen (see http://www.waloszek.de/lxv_func_err_e.php#auto_review for an explanation on this phenomenon). for some reason leica never corrected this with a firmware update. it didn’t ruin the camera and i still consider it quite good for the type of photography i did with the xv, but it’s certainly disappointing it wasn’t fixed. recently, i would change the shutter or aperture settings between shots and the camera frustratingly wouldn’t register these changes. i suspect this was related to the frozen review issue. \n\nthe manual focus mode, while useful, wasn’t exactly to my liking. it worked well in static settings and macro, but was difficult to work with when taking images of people. unfortunately, the af would occasionally misfocus entirely resulting in bad and often unusable images. not to get into a debate on user error vs equipment, there are intermittent focusing problems with the xv that are fairly well detailed on the web. in my experience, they are true. it’s possible that this isn’t consistent from camera to camera. one has to expect a few duds through a day of shooting the xv due to focus issues, so take care to review your work in the field. unfortunately, this is not always possible with photos of people. the moment is gone. ultimately, this af behaviour was unlike my extensive experience with the 30d that i used primarily in servo mode with back button focusing. i would burst shoot and pick the best image in post. the xv didn’t lend itself well to this type of continuous shooting. this per se isn’t a knock against the xv, they are completely different cameras and need to be worked differently. it did teach me to better anticipate moments with people.\n\n\nshould you get an x vario in 2019? i think it’s hard to provide a resounding yes when there are a lot of options out there to consider. i haven’t done research on the competition and i haven’t used other cameras in its class to provide a definite answer. in a way, i wish i could have kept it, but i needed to sell it to fund my next camera. the xv still captures great images and i think in some ways i will miss it. if you can live with its quirks or faults, and you find it at a good price i can then recommend it.", "sortedWord": "None", "identifyer": 14219, "year": "2019"}, {"Unnamed: 0": 219865, "autor": "FiftyBands", "date": 1562552562000, "content": "Does this white spot at the bottom of my image mean I'm having issues with my sensor?", "link": "https://www.reddit.com/r/Leica/comments/caf9w0/does_this_white_spot_at_the_bottom_of_my_image/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does this white -----> spot !!!  at the bottom of my image mean i'm having issues with my sensor?", "sortedWord": "None", "identifyer": 14370, "year": "2019"}], "name": "spotleica2019"}