{"interestingcomments": [{"Unnamed: 0": 219319, "autor": "bergmeout", "date": 1562886704000, "content": "Selling my Mint M6TTL (0.72) /!/ $2700, or best offer! + 3% PayPal Fees, and $40 shipping\n    \nMint condition Leica M6TTL Silver (0.72)    \nWith original box, original case, strap, papers    \n    \nBought from a photo teacher who had it as a back-up.  He shot with a M4, and he never touched this M6TTL ever.  He sold it to me 6 months ago, and I shot &lt; 10 rolls through it. \n\nLight meter, TTL, film advance, work perfectly and crisply, absolutely mint and like NEW.    \n\nSelling because I recently bought a 28mm Summilux, and another M6TTL but 0.58 magnification.    \n\nNeed cash, make me a best offer.    \n\n[Imgur with Tag at End] (https://imgur.com/a/f4Btb14)", "link": "https://www.reddit.com/r/Leica/comments/cc2ueq/selling_my_mint_m6ttl_072/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "selling my mint m6ttl (0.72) /!/ $2700, or best offer! + 3% paypal fees, and $40 shipping\n    \nmint condition leica m6ttl silver (0.72)    \nwith original box, original case, strap, papers    \n    \nbought from a photo teacher who had it as a back-up.  he shot with a m4, and he never touched this m6ttl ever.  he sold it to me 6 months ago, and i shot &lt; 10 rolls through it. \n\nlight meter, ttl, film advance, work perfectly and crisply, absolutely mint and like new.    \n\nselling because i recently bought a 28mm summilux, and another m6ttl but 0.58 magnification.    \n\nneed cash, make me a best offer.    \n\n[imgur with -----> tag !!!  at end] (https://imgur.com/a/f4btb14)", "sortedWord": "None", "identifyer": 13818, "year": "2019"}, {"Unnamed: 0": 219505, "autor": "devio_evio", "date": 1566276661000, "content": "Clarification on micro-contrast, character, and lens IQ. /!/ I am really getting deep into the rabbit hole of lens/glass quality and figured this is a good place to post this.\n\nI am somewhat mystified about older/vintage lenses and lenses with very high price tags and what people say about that glass.\n\nSo what do you guys think about micro-contrast, character, and lens IQ?\n\nIs micro-contrast part of lens IQ, does it connect to character, is the character of a lens just how certain flaws in it's design make the image it produces look interesting, is this why many people fall in love with vintage glass, are these high priced lenses (cooke, zeiss, leica, etc.) really giving some extra etherial substance to their image beyond lens IQ????\n\nAny input would highly appriciated.", "link": "https://www.reddit.com/r/Leica/comments/cssu1z/clarification_on_microcontrast_character_and_lens/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "clarification on micro-contrast, character, and lens iq. /!/ i am really getting deep into the rabbit hole of lens/glass quality and figured this is a good place to post this.\n\ni am somewhat mystified about older/vintage lenses and lenses with very high price -----> tags !!!  and what people say about that glass.\n\nso what do you guys think about micro-contrast, character, and lens iq?\n\nis micro-contrast part of lens iq, does it connect to character, is the character of a lens just how certain flaws in it's design make the image it produces look interesting, is this why many people fall in love with vintage glass, are these high priced lenses (cooke, zeiss, leica, etc.) really giving some extra etherial substance to their image beyond lens iq????\n\nany input would highly appriciated.", "sortedWord": "None", "identifyer": 14006, "year": "2019"}], "name": "tagleica2019"}