{"interestingcomments": [{"Unnamed: 0": 217754, "autor": "_hugerobots_", "date": 1591807351000, "content": "Is there a 'fair market value' database somewhere for used Leica? /!/ The buy-back program always sounds pretty good, but they base that on something called 'fair market value' and then drop 10-20% from your trade-in price.\n\nFor example, Leica Store Miami has a promotion going. But where are they getting their fair market value from?\n\nJust looking to find out what price a used M body would be with a price tag of fair market value.", "link": "https://www.reddit.com/r/Leica/comments/h0el8l/is_there_a_fair_market_value_database_somewhere/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there a 'fair market value' database somewhere for used leica? /!/ the buy-back program always sounds pretty good, but they base that on something called 'fair market value' and then drop 10-20% from your trade-in price.\n\nfor example, leica store miami has a promotion going. but where are they getting their fair market value from?\n\njust looking to find out what price a used m body would be with a price -----> tag !!!  of fair market value.", "sortedWord": "None", "identifyer": 12217, "year": "2020"}, {"Unnamed: 0": 217981, "autor": "Milleniador", "date": 1604857131000, "content": "Leica instagram influencer 👍 /!/ Yo #redditors! I'm a instagram influencer  looking to purchase a Lieca as fashion accessory to post with my #OOTD. Am currently #travel influencer sh*t out of luck in lockdown 🔒. Maybe gonna relaunch myself with #foodporn as I notice you all get Reddit gold for your photos of Lieca gear with coffee. Looks like a way of getting lots of #IGer followers. What Lieca and lense should I get for most #likes👍.\n\nAlso, do any of you have knowledge if Lieca brand sponsor IGers? As I will need many followers to pay for the gear. I recently read u/wedidntmeantogotosea pushing a yet unavailable 75mm collapsible summicron. Can anyone connect me with Lieca, so I can also become brand sponsor for new products?\n\nI won't use the Lieca for taking actual photos, but Looking at this sub, I see it's not really cool to do that and anyway photos not as sharp as iPhone, so no point.\n\nAlso what #tags are best to attract users?\nI watched #JCH and he used #Liecawanker so will start with that, but suggestions welcome?\n\nAny of you wanna trade #likeforlike please insta me...", "link": "https://www.reddit.com/r/Leica/comments/jqfsbt/leica_instagram_influencer/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "leica instagram influencer 👍 /!/ yo #redditors! i'm a instagram influencer  looking to purchase a lieca as fashion accessory to post with my #ootd. am currently #travel influencer sh*t out of luck in lockdown 🔒. maybe gonna relaunch myself with #foodporn as i notice you all get reddit gold for your photos of lieca gear with coffee. looks like a way of getting lots of #iger followers. what lieca and lense should i get for most #likes👍.\n\nalso, do any of you have knowledge if lieca brand sponsor igers? as i will need many followers to pay for the gear. i recently read u/wedidntmeantogotosea pushing a yet unavailable 75mm collapsible summicron. can anyone connect me with lieca, so i can also become brand sponsor for new products?\n\ni won't use the lieca for taking actual photos, but looking at this sub, i see it's not really cool to do that and anyway photos not as sharp as iphone, so no point.\n\nalso what #-----> tags !!!  are best to attract users?\ni watched #jch and he used #liecawanker so will start with that, but suggestions welcome?\n\nany of you wanna trade #likeforlike please insta me...", "sortedWord": "None", "identifyer": 12452, "year": "2020"}, {"Unnamed: 0": 218098, "autor": "bullit2shot", "date": 1600430336000, "content": "Leica CL lenses, questions and differences /!/ About 3 weeks ago I got myself a second hand CL and I'm very happy with it. A new lens that would fit into my buget and good for street was the Sigma 30mm f1.4 contemp:\n\n[https://www.bhphotovideo.com/c/product/1570251-REG/sigma\\_302969\\_30mm\\_f\\_1\\_4\\_dc\\_dn.html?sts=pi&amp;pim=Y](https://www.bhphotovideo.com/c/product/1570251-REG/sigma_302969_30mm_f_1_4_dc_dn.html?sts=pi&amp;pim=Y)\n\nI do like the lense, to me as a beginner it seems sharp and I'm having fun with it :) I do wonder what difference I would notice if I would get the art lens from sigma:\n\n[**https://www.bhphotovideo.com/c/product/1463167-REG/sigma\\_35mm\\_f\\_1\\_4\\_dg\\_hsm.html**](https://www.bhphotovideo.com/c/product/1463167-REG/sigma_35mm_f_1_4_dg_hsm.html)\n\nWhat would be the advantages? will the photos be sharper?\n\nFor now, I'm gonna stick with prime lenses, I don't moving around to get the right shot :) \n\nIn comparison with the 2 lenses above, the lens from Leica, the 35mm with a lot bigger price tag, what are the advantages over the sigma lenses? will the colors/sharpness be better?\n\n[https://www.bhphotovideo.com/c/product/1200805-REG/leica\\_11084\\_summilux\\_tl\\_35mm\\_f\\_1\\_4\\_asph.html](https://www.bhphotovideo.com/c/product/1200805-REG/leica_11084_summilux_tl_35mm_f_1_4_asph.html)\n\njust trying to understand the different options, for now, not buying. The basic lens is good enough for me now, perhaps a good deal on black friday or something like that :)", "link": "https://www.reddit.com/r/Leica/comments/iv4p05/leica_cl_lenses_questions_and_differences/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "leica cl lenses, questions and differences /!/ about 3 weeks ago i got myself a second hand cl and i'm very happy with it. a new lens that would fit into my buget and good for street was the sigma 30mm f1.4 contemp:\n\n[https://www.bhphotovideo.com/c/product/1570251-reg/sigma\\_302969\\_30mm\\_f\\_1\\_4\\_dc\\_dn.html?sts=pi&amp;pim=y](https://www.bhphotovideo.com/c/product/1570251-reg/sigma_302969_30mm_f_1_4_dc_dn.html?sts=pi&amp;pim=y)\n\ni do like the lense, to me as a beginner it seems sharp and i'm having fun with it :) i do wonder what difference i would notice if i would get the art lens from sigma:\n\n[**https://www.bhphotovideo.com/c/product/1463167-reg/sigma\\_35mm\\_f\\_1\\_4\\_dg\\_hsm.html**](https://www.bhphotovideo.com/c/product/1463167-reg/sigma_35mm_f_1_4_dg_hsm.html)\n\nwhat would be the advantages? will the photos be sharper?\n\nfor now, i'm gonna stick with prime lenses, i don't moving around to get the right shot :) \n\nin comparison with the 2 lenses above, the lens from leica, the 35mm with a lot bigger price -----> tag !!! , what are the advantages over the sigma lenses? will the colors/sharpness be better?\n\n[https://www.bhphotovideo.com/c/product/1200805-reg/leica\\_11084\\_summilux\\_tl\\_35mm\\_f\\_1\\_4\\_asph.html](https://www.bhphotovideo.com/c/product/1200805-reg/leica_11084_summilux_tl_35mm_f_1_4_asph.html)\n\njust trying to understand the different options, for now, not buying. the basic lens is good enough for me now, perhaps a good deal on black friday or something like that :)", "sortedWord": "None", "identifyer": 12571, "year": "2020"}], "name": "tagleica2020"}