{"interestingcomments": [{"autor": "GothamCityDemon", "date": "2020-10-15 11:15:15", "content": "Question about recording video with CL /!/ Hello,\n\nI'm still new to using Leica, with my CL being my first, and only having it a few days. So far I love it. It's small, takes beautiful pictures, and I love all around the building quality of the camera. \n\nI do have a question, however, about recording on the CL. Two things:\n\n1. I noticed when I want to record in 4k30fps, the camera crops the image? Why is this? Is this a setting in have yet to find? If I shoot in any lower quality I get an uncropped image. \n\n2. The camera doesn't come with audio jack, so I have to come up with a work around. Is there anything anyone would recommend when it comes to mics, or anything for audio? \n\nI love street photography and vlogging, so recording is a big one for me, but the rest of Leica's lineup doesn't really align with what I'm looking for, which is compact. \n\nThanks", "link": "https://www.reddit.com/r/Leica/comments/jbllj4/question_about_recording_video_with_cl/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "question about recording video with cl /!/ hello,\n\ni'm still new to using leica, with my cl being my first, and only having it a few days. so far i love it. it's small, takes beautiful pictures, and i love all around the building quality of the camera. \n\ni do have a question, however, about recording on the cl. two things:\n\n1. i noticed when i want to record in 4k30fps, the camera crops the image? why is this? is this a setting in have yet to find? if i shoot in any lower quality i get an uncropped image. \n\n2. the camera doesn't -----> come !!!  -----> with !!!  audio jack, so i have to -----> come !!!  -----> up !!!  -----> with !!!  a work around. is there anything anyone would recommend when it comes to mics, or anything for audio? \n\ni love street photography and vlogging, so recording is a big one for me, but the rest of leica's lineup doesn't really align with what i'm looking for, which is compact. \n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 11548, "year": "2020"}, {"autor": "mark_paterson", "date": "2020-08-26 19:33:17", "content": "I came up with a cheap and effective solution to stop my strap rings scratching my Q2 body. Guitar strap blocks! Mine say Fender (which the guitarist in me doesn't mind) but you can also buy non-branded ones. They're silicon and fit perfectly over the lugs!", "link": "https://www.reddit.com/r/Leica/comments/ih5o66/i_came_up_with_a_cheap_and_effective_solution_to/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i -----> came !!!  -----> up !!!  -----> with !!!  a cheap and effective solution to stop my strap rings scratching my q2 body. guitar strap blocks! mine say fender (which the guitarist in me doesn't mind) but you can also buy non-branded ones. they're silicon and fit perfectly over the lugs!", "sortedWord": "None", "Identifyer": null, "identifyer": 12729, "year": "2020"}, {"autor": "menofgrosserblood", "date": "2020-07-05 22:55:00", "content": "Should I upgrade from a Voigtlander 35 f/2.5 Color Skopar for a Zeiss Biogon T* 35mm f/2? /!/ I have two cameras: An M6 and a Hasselblad Five Hunno. I just love the way colors render on my Zeiss T* lenses for the Hassy. But maybe it’s just the negative size that brings out the detail?\n\nI can’t play with a Biogon locally to see, so I’ll have to order online. \n\nI tell myself the Skopar is too pancakey. I tell myself I don’t like the lens. That the Biogon or a ‘cron is really what I *need.* Perhaps I am coming up with reasons not to shoot and instead fester over gear.\n\nAny thoughts?", "link": "https://www.reddit.com/r/Leica/comments/hlw2yn/should_i_upgrade_from_a_voigtlander_35_f25_color/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "should i upgrade from a voigtlander 35 f/2.5 color skopar for a zeiss biogon t* 35mm f/2? /!/ i have two cameras: an m6 and a hasselblad five hunno. i just love the way colors render on my zeiss t* lenses for the hassy. but maybe it’s just the negative size that brings out the detail?\n\ni can’t play with a biogon locally to see, so i’ll have to order online. \n\ni tell myself the skopar is too pancakey. i tell myself i don’t like the lens. that the biogon or a ‘cron is really what i *need.* perhaps i am -----> coming !!!  -----> up !!!  -----> with !!!  reasons not to shoot and instead fester over gear.\n\nany thoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 13101, "year": "2020"}], "name": "withleica2020"}