{"interestingcomments": [{"Unnamed: 0": 221111, "autor": "Uter_Zorker_", "date": 1612081779000, "content": "Best option for a total beginner - X-T30 (body only) for US$820 OR X-T200 (w/ XC15-45 kit) for US$680 /!/ Per the title - note that the prices are converted from local currency and my options are somewhat limited by my location (Dubai). I understand the X-T30 is clearly a better camera but just interested in opinions on what kind of premium is worth paying for the upgrade.\n\n I'm weighing up my best option as a total beginner to proper photography. I'm not really interested in video, mainly interested in landscape and wildlife photography while I hike. Budget is not really an issue (i.e., neither option is going to break the bank) but I do want good value, and don't want to pay for something ridiculously unnecessary for a beginner.\n\nMy two options are:\n\n(1) X-T30 (body only) for US$820 - would then need to buy a lens or two separately.\n\n(2) X-T200 (w/ XC15-45 kit) for US$680.\n\nAny advice is much appreciated! :)", "link": "https://www.reddit.com/r/Cameras/comments/l987mo/best_option_for_a_total_beginner_xt30_body_only/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "best option for a total beginner - x-t30 (body only) for us$820 or x-t200 (w/ xc15-45 kit) for us$680 /!/ per the title - note that the prices are converted from local currency and my options are somewhat limited by my -----> location !!!  (dubai). i understand the x-t30 is clearly a better camera but just interested in opinions on what kind of premium is worth paying for the upgrade.\n\n i'm weighing up my best option as a total beginner to proper photography. i'm not really interested in video, mainly interested in landscape and wildlife photography while i hike. budget is not really an issue (i.e., neither option is going to break the bank) but i do want good value, and don't want to pay for something ridiculously unnecessary for a beginner.\n\nmy two options are:\n\n(1) x-t30 (body only) for us$820 - would then need to buy a lens or two separately.\n\n(2) x-t200 (w/ xc15-45 kit) for us$680.\n\nany advice is much appreciated! :)", "sortedWord": "None", "identifyer": 15649, "year": "2021"}, {"Unnamed: 0": 223847, "autor": "dapownap", "date": 1615330330000, "content": "URGENT: on location and C100m2 weird artefacts /!/ On location shooting a doc and out of the blue camera presents some weird, never seen artefacts, both on lcd while shooting and on clips. \n\nI've reset all settings, done ABB, changed lenses. Nothing. \n\nI hope it's not the sensor, but camera just came back from service only a couple of months ago and have used it for max a couple of hours since. \n\nThe only thing I can think of that's new is I've used a new non-canon battery, but it would seem strange. \n\nPlease find attached photos and a link.\n\nThanks in advance for your help!\n\n[https://vimeo.com/521612616/7eeffeb228](https://vimeo.com/521612616/7eeffeb228)", "link": "https://www.reddit.com/r/Cameras/comments/m1io1m/urgent_on_location_and_c100m2_weird_artefacts/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "urgent: on -----> location !!!  and c100m2 weird artefacts /!/ on -----> location !!!  shooting a doc and out of the blue camera presents some weird, never seen artefacts, both on lcd while shooting and on clips. \n\ni've reset all settings, done abb, changed lenses. nothing. \n\ni hope it's not the sensor, but camera just came back from service only a couple of months ago and have used it for max a couple of hours since. \n\nthe only thing i can think of that's new is i've used a new non-canon battery, but it would seem strange. \n\nplease find attached photos and a link.\n\nthanks in advance for your help!\n\n[https://vimeo.com/521612616/7eeffeb228](https://vimeo.com/521612616/7eeffeb228)", "sortedWord": "None", "identifyer": 18514, "year": "2021"}, {"Unnamed: 0": 223874, "autor": "Lamaskier", "date": 1612459751000, "content": "Gopro-TypeC-Phone /!/ Hi my fellow photon-headz  \nI was wondering:\nCan I transfer files from my gopro 9 to my phone if i get a typeC -typeC cable? \nConnecting the gopro via data cable to pc is normal. \nConnecting phone to typeC pendrives is normal. \nCan I preserve some battery by using a cable to transfer files instead of the normal bluetooth-wifi-location combo shit?", "link": "https://www.reddit.com/r/Cameras/comments/lckxme/goprotypecphone/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "gopro-typec-phone /!/ hi my fellow photon-headz  \ni was wondering:\ncan i transfer files from my gopro 9 to my phone if i get a typec -typec cable? \nconnecting the gopro via data cable to pc is normal. \nconnecting phone to typec pendrives is normal. \ncan i preserve some battery by using a cable to transfer files instead of the normal bluetooth-wifi------> location !!!  combo shit?", "sortedWord": "None", "identifyer": 18545, "year": "2021"}, {"Unnamed: 0": 224775, "autor": "pteriss", "date": 1611265612000, "content": "Camera gear storage? /!/ Hey guys!\nHow are you storing your camera gear while not in use? \nI’ve started picking up some vintage lenses to play around with my Fuji gear. At the moment I just have everything in a drawer and I hate that. I was thinking about picking up something similar to a pelican case and storing my camera bodies + lenses in that. \nWhat are your approaches? \n\nI guess my requirements are: \n-\trelatively compact. Can be picked up and put in a car’s trunk to take on location. \n-\tability to be locked. I got a 6 month old baby, who’s really curious about stuff and I need to keep him out of this one for a while still. \n-\tnot damaging for the gear. This includes some protections for when moving around, moisture build up, etc. \n-\texpandable/modifiable. My gear collection is still gonna change. I am just exploring some old lenses at the moment, but I am sure that I will also be buying some new Fuji lenses as well. \n\nAny tips welcome! :)\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/l28mvh/camera_gear_storage/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "camera gear storage? /!/ hey guys!\nhow are you storing your camera gear while not in use? \ni’ve started picking up some vintage lenses to play around with my fuji gear. at the moment i just have everything in a drawer and i hate that. i was thinking about picking up something similar to a pelican case and storing my camera bodies + lenses in that. \nwhat are your approaches? \n\ni guess my requirements are: \n-\trelatively compact. can be picked up and put in a car’s trunk to take on -----> location !!! . \n-\tability to be locked. i got a 6 month old baby, who’s really curious about stuff and i need to keep him out of this one for a while still. \n-\tnot damaging for the gear. this includes some protections for when moving around, moisture build up, etc. \n-\texpandable/modifiable. my gear collection is still gonna change. i am just exploring some old lenses at the moment, but i am sure that i will also be buying some new fuji lenses as well. \n\nany tips welcome! :)\nthanks!", "sortedWord": "None", "identifyer": 19484, "year": "2021"}, {"Unnamed: 0": 225023, "autor": "wfb0002", "date": 1620345132000, "content": "Looking For a Wifi or Bluetooth Controlled Camera /!/ Title pretty much says it all. I have a project I’m working on that I need to set up a camera to take images at precise moments based on a gps location. My computer that would control the camera would be able to communicate via wifi or Bluetooth, but I would prefer something that would be wifi. I am pretty handy at the wifi and Bluetooth protocols so hacking them won’t be too much of an issue hopefully...\n\nI appreciate any help!", "link": "https://www.reddit.com/r/Cameras/comments/n6lbc0/looking_for_a_wifi_or_bluetooth_controlled_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "looking for a wifi or bluetooth controlled camera /!/ title pretty much says it all. i have a project i’m working on that i need to set up a camera to take images at precise moments based on a gps -----> location !!! . my computer that would control the camera would be able to communicate via wifi or bluetooth, but i would prefer something that would be wifi. i am pretty handy at the wifi and bluetooth protocols so hacking them won’t be too much of an issue hopefully...\n\ni appreciate any help!", "sortedWord": "None", "identifyer": 19745, "year": "2021"}, {"Unnamed: 0": 225367, "autor": "Big_Wort", "date": 1623109989000, "content": "New job starting on Monday, looking for a &lt;$1300 camera. /!/ Hi all, \n\nI'm a novice photographer who just got hired for a 2 month location scouting job in the film industry. I'll be moving up to another position after the 2 months so I don't need anything too expensive (although I will probably be scouting again in the future).\n\nI know buying used is recommended but I don't even really know what I would be looking for although I might have some time to research. \n\n[Link to local craigslist](https://vancouver.craigslist.org/)\n\nI've been eying the [Fuji X-T30](https://www.visions.ca/product-detail/50140/fujifilm_x_t30_26_1mp_bsi_aps_c_mirrorless_digital_camera_with_xc15_45mm_lens_black?categoryId=0&amp;sku=600020767) which is $1299 CAD with a telephoto\n\nAny advice is appreciated.", "link": "https://www.reddit.com/r/Cameras/comments/nur75l/new_job_starting_on_monday_looking_for_a_1300/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new job starting on monday, looking for a &lt;$1300 camera. /!/ hi all, \n\ni'm a novice photographer who just got hired for a 2 month -----> location !!!  scouting job in the film industry. i'll be moving up to another position after the 2 months so i don't need anything too expensive (although i will probably be scouting again in the future).\n\ni know buying used is recommended but i don't even really know what i would be looking for although i might have some time to research. \n\n[link to local craigslist](https://vancouver.craigslist.org/)\n\ni've been eying the [fuji x-t30](https://www.visions.ca/product-detail/50140/fujifilm_x_t30_26_1mp_bsi_aps_c_mirrorless_digital_camera_with_xc15_45mm_lens_black?categoryid=0&amp;sku=600020767) which is $1299 cad with a telephoto\n\nany advice is appreciated.", "sortedWord": "None", "identifyer": 20098, "year": "2021"}, {"Unnamed: 0": 225636, "autor": "jimidiguana", "date": 1628137912000, "content": "Portable daily digital camera for a film shooter on a budget. /!/ I’m looking for suggestions on some compact digital cameras either used or new for under $400. I’m going to college and won’t be able to shoot film as much during school as I can’t access my home darkroom. I want something relatively portable, with a sharp lens and good low light performance. I don’t mind if it’s a zoom but also would be interested in any fixed lens options. I don’t care about sensor size as much because I usually prefer to have everything in focus but it needs to be able to perform in any situation without flash. I shoot a lot of landscapes and every day locations, some people and cars but if i’m doing anything serious I still have film. I just need something to get me to stop using my 35mm point and shoots so I can save some money.", "link": "https://www.reddit.com/r/Cameras/comments/oya5lk/portable_daily_digital_camera_for_a_film_shooter/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "portable daily digital camera for a film shooter on a budget. /!/ i’m looking for suggestions on some compact digital cameras either used or new for under $400. i’m going to college and won’t be able to shoot film as much during school as i can’t access my home darkroom. i want something relatively portable, with a sharp lens and good low light performance. i don’t mind if it’s a zoom but also would be interested in any fixed lens options. i don’t care about sensor size as much because i usually prefer to have everything in focus but it needs to be able to perform in any situation without flash. i shoot a lot of landscapes and every day -----> locations !!! , some people and cars but if i’m doing anything serious i still have film. i just need something to get me to stop using my 35mm point and shoots so i can save some money.", "sortedWord": "None", "identifyer": 20382, "year": "2021"}, {"Unnamed: 0": 227564, "autor": "zme94", "date": 1620072294000, "content": "Lens for Blackmagic???? /!/ Hi all,\n\nSorry for asking such a rudimentary question, but I’m trying to figure out which lens I should purchase for a video shoot.\n\nThe camera is a Blackmagic Cinema w/ EF mount (not pocket, model FBA_9338716001600). We’re looking to shoot a cheap, independent feature with mostly exterior locations. Budget is definitely a factor, but we’re willing to spend a little more for noticeably better quality.\n\nUnfortunately gear isn’t my area of expertise, so if there’s any additional info necessary to decide, let me know. Thankfully I won’t be the one operating the equipment, but I’m in charge of acquiring it. I’d be super grateful for any help.", "link": "https://www.reddit.com/r/Cameras/comments/n45v3d/lens_for_blackmagic/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "lens for blackmagic???? /!/ hi all,\n\nsorry for asking such a rudimentary question, but i’m trying to figure out which lens i should purchase for a video shoot.\n\nthe camera is a blackmagic cinema w/ ef mount (not pocket, model fba_9338716001600). we’re looking to shoot a cheap, independent feature with mostly exterior -----> locations !!! . budget is definitely a factor, but we’re willing to spend a little more for noticeably better quality.\n\nunfortunately gear isn’t my area of expertise, so if there’s any additional info necessary to decide, let me know. thankfully i won’t be the one operating the equipment, but i’m in charge of acquiring it. i’d be super grateful for any help.", "sortedWord": "None", "identifyer": 22400, "year": "2021"}, {"Unnamed: 0": 227677, "autor": "ThatNiceMan", "date": 1623003983000, "content": "Looking for a camera to watch carnivorous plants /!/ Hello,\n\nI'm looking for a camera to \"watch\" carnivorous plants.  I have no idea where to start so would appreciate being pointed in the right direction.  I'm very much a novice in this.\n\nFeatures I'm looking for:\n* High resolution (~4K?)\n* Video for when they catch bugs\n\nNice-to-have features:\n* Timelapse for general growth, I know this can be done by software but built-in would be easier\n* Wi-fi, but really not fussed if it's on a memory card.\n\nBudget: quite wide, but I'm aiming for a good-medium quality.  No cheap stuff.\n\nMakes/models: any decent, reputable make.\n\nLocation: I'm in the UK so it needs to be available here without too much fuss.", "link": "https://www.reddit.com/r/Cameras/comments/nts3yz/looking_for_a_camera_to_watch_carnivorous_plants/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "looking for a camera to watch carnivorous plants /!/ hello,\n\ni'm looking for a camera to \"watch\" carnivorous plants.  i have no idea where to start so would appreciate being pointed in the right direction.  i'm very much a novice in this.\n\nfeatures i'm looking for:\n* high resolution (~4k?)\n* video for when they catch bugs\n\nnice-to-have features:\n* timelapse for general growth, i know this can be done by software but built-in would be easier\n* wi-fi, but really not fussed if it's on a memory card.\n\nbudget: quite wide, but i'm aiming for a good-medium quality.  no cheap stuff.\n\nmakes/models: any decent, reputable make.\n\n-----> location !!! : i'm in the uk so it needs to be available here without too much fuss.", "sortedWord": "None", "identifyer": 22517, "year": "2021"}], "name": "locationCameras2021"}