{"interestingcomments": [{"Unnamed: 0": 177168, "autor": "sheepguy13", "date": 1518992365000, "content": "Advice on equipment for outdoor portrait photography /!/ A very close friend of mine has asked me to spend a day with her outdoors in nature to take her portraits. She love the Irish countryside so we're going to choose several locations, most of them outside the city. It's for her birthday so I really want these to turn out well but I'm just a hobbyist photographer and have never done portraiture.\n\nI have a Nikon D5300 with the f1.8 50mm prime and a Sigma 10-20mm wide angle. That's :) I've been wanting to purchase a Fujifilm X-T20 for quite while now. So I guess that's my first question. Should I use the D5300 for the shoot for buy the X-T20? Is there any advantage to either?\n\nMy second question is, what equipment should I rent? I guess the most obvious one is an 80mm prime portrait lens. Or should I get something like a 120mm prime? Is a tripod usually necessary for outdoors portraiture? Should I bring any accessories?\n\nAlso, any general tips for this? Camera settings, random accessories, posing, etc? This is really important to me so I appreciate any guidance you are willing to offer me.\n\nThanks in advance.", "link": "https://www.reddit.com/r/Cameras/comments/7yhv4f/advice_on_equipment_for_outdoor_portrait/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "advice on equipment for outdoor portrait photography /!/ a very close friend of mine has asked me to spend a day with her outdoors in nature to take her portraits. she love the irish countryside so we're going to choose several -----> locations !!! , most of them outside the city. it's for her birthday so i really want these to turn out well but i'm just a hobbyist photographer and have never done portraiture.\n\ni have a nikon d5300 with the f1.8 50mm prime and a sigma 10-20mm wide angle. that's :) i've been wanting to purchase a fujifilm x-t20 for quite while now. so i guess that's my first question. should i use the d5300 for the shoot for buy the x-t20? is there any advantage to either?\n\nmy second question is, what equipment should i rent? i guess the most obvious one is an 80mm prime portrait lens. or should i get something like a 120mm prime? is a tripod usually necessary for outdoors portraiture? should i bring any accessories?\n\nalso, any general tips for this? camera settings, random accessories, posing, etc? this is really important to me so i appreciate any guidance you are willing to offer me.\n\nthanks in advance.", "sortedWord": "None", "identifyer": 69591, "year": "2018"}, {"Unnamed: 0": 177382, "autor": "dracho", "date": 1522086718000, "content": "My \"new\" Nikon S9900 has GPS that tracks me even when the camera is powered off?! Except from manual: /!/ \"When Record Location Data in Location Data Options is set to ON or during log recording, record location data functions and log recording function will continue to operate even after the camera is turned off.\"\n\nAm I understanding this correctly?  The camera is going to track my location 24x7 if this option is enabled?\n\nSetting aside security risks, wouldn't this \"feature\" demolish my battery life?\n\nOther thoughts regarding this camera?  I just bought it on eBay, and I'm not an expert yet.", "link": "https://www.reddit.com/r/Cameras/comments/87b4jn/my_new_nikon_s9900_has_gps_that_tracks_me_even/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "my \"new\" nikon s9900 has gps that tracks me even when the camera is powered off?! except from manual: /!/ \"when record -----> location !!!  data in -----> location !!!  data options is set to on or during log recording, record -----> location !!!  data functions and log recording function will continue to operate even after the camera is turned off.\"\n\nam i understanding this correctly?  the camera is going to track my location 24x7 if this option is enabled?\n\nsetting aside security risks, wouldn't this \"feature\" demolish my battery life?\n\nother thoughts regarding this camera?  i just bought it on ebay, and i'm not an expert yet.", "sortedWord": "None", "identifyer": 69808, "year": "2018"}, {"Unnamed: 0": 179094, "autor": "nowayjoseTA", "date": 1538772247000, "content": "Good flea markets to buy analog cameras in the NY area? /!/ I’m looking to buy a cheap analog camera, can be a point and shoot or whatever (not looking for a very fine camera) around the NY area!\nThrift stores, flea markets or cheap shop locations!\n\nthank you", "link": "https://www.reddit.com/r/Cameras/comments/9lq1r0/good_flea_markets_to_buy_analog_cameras_in_the_ny/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "good flea markets to buy analog cameras in the ny area? /!/ i’m looking to buy a cheap analog camera, can be a point and shoot or whatever (not looking for a very fine camera) around the ny area!\nthrift stores, flea markets or cheap shop -----> locations !!! !\n\nthank you", "sortedWord": "None", "identifyer": 71544, "year": "2018"}, {"Unnamed: 0": 179256, "autor": "stb41", "date": 1519436627000, "content": "GoPro 6 and Sony rx100 iii /!/ So I do quite a bit of traveling and typically to tropical locations. I used a GoPro hero 4 for many of these trips and just recently upgraded to the hero 6. In the past I’ve mostly used the GoPro for videos and rarely for still photos. \n\nMy question is, has the GoPro hero 6 improved its ability to take still photos well enough to use this as my only camera on upcoming trips? \n\nOr would purchasing a Sony rx100 iii still be worth it. “Worth it” to me means that it will capture much better still photos than the hero 6 or my iPhone 7. \n\nI’ll still be using my GoPro hero 6 for videos and while in the water. Just thinking of purchasing something for essentially all other photos that aren’t in the water. \n\nAfter researching this forum, it seems rx100 iii is a good compromise instead of a DSLR that’s inconvenient on hikes and travel etc, and that the Sony will take only slightly lower quality photos than an entry level DSLR.\n\nAny suggestions or opinions are appreciated. ", "link": "https://www.reddit.com/r/Cameras/comments/7ztcya/gopro_6_and_sony_rx100_iii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "gopro 6 and sony rx100 iii /!/ so i do quite a bit of traveling and typically to tropical -----> locations !!! . i used a gopro hero 4 for many of these trips and just recently upgraded to the hero 6. in the past i’ve mostly used the gopro for videos and rarely for still photos. \n\nmy question is, has the gopro hero 6 improved its ability to take still photos well enough to use this as my only camera on upcoming trips? \n\nor would purchasing a sony rx100 iii still be worth it. “worth it” to me means that it will capture much better still photos than the hero 6 or my iphone 7. \n\ni’ll still be using my gopro hero 6 for videos and while in the water. just thinking of purchasing something for essentially all other photos that aren’t in the water. \n\nafter researching this forum, it seems rx100 iii is a good compromise instead of a dslr that’s inconvenient on hikes and travel etc, and that the sony will take only slightly lower quality photos than an entry level dslr.\n\nany suggestions or opinions are appreciated. ", "sortedWord": "None", "identifyer": 71707, "year": "2018"}, {"Unnamed: 0": 179383, "autor": "MaxMirow", "date": 1522917642000, "content": "Need camera with that I can put on my dog and live-stream to my phone /!/ Hi Reddit,\n\nNeed your help. I spend a lot of time in forests/fields with my dogs and as title says I am currently looking for camera that I can attach to my dogs back/collar and see the video on my phone of what exactly it is doing and also perfectly the dogs location on the map. Something very similar to what you get while flying drones. Range needed is at least 1km. Any advice? ", "link": "https://www.reddit.com/r/Cameras/comments/89y2hq/need_camera_with_that_i_can_put_on_my_dog_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "need camera with that i can put on my dog and live-stream to my phone /!/ hi reddit,\n\nneed your help. i spend a lot of time in forests/fields with my dogs and as title says i am currently looking for camera that i can attach to my dogs back/collar and see the video on my phone of what exactly it is doing and also perfectly the dogs -----> location !!!  on the map. something very similar to what you get while flying drones. range needed is at least 1km. any advice? ", "sortedWord": "None", "identifyer": 71838, "year": "2018"}, {"Unnamed: 0": 179557, "autor": "Evenfluxx", "date": 1524481636000, "content": "Olympus TG 5 - Travel Cameras! /!/ Thinking of getting one of these for backpacking around Europe for 6 months. I personally don't know enough about these sorts of things and would love to hear any advice you would all have to offer. Essentially i'm looking for something with GPS and Bluetooth. At the least i want to be able to record my location while backing up to my phone for further backup later.\n\nCheers ", "link": "https://www.reddit.com/r/Cameras/comments/8eammf/olympus_tg_5_travel_cameras/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "olympus tg 5 - travel cameras! /!/ thinking of getting one of these for backpacking around europe for 6 months. i personally don't know enough about these sorts of things and would love to hear any advice you would all have to offer. essentially i'm looking for something with gps and bluetooth. at the least i want to be able to record my -----> location !!!  while backing up to my phone for further backup later.\n\ncheers ", "sortedWord": "None", "identifyer": 72018, "year": "2018"}, {"Unnamed: 0": 180226, "autor": "MajorPharaoh", "date": 1531970938000, "content": "Blackmagic Pocket Cinema 4k or a used Full Frame Sony? /!/ Ive always wanted to get into full frame because I like the quality of the bokeh and low light capabilities. I currently own a Panasonic G7 and an old T2i but never use the T2i as much anymore because it's all worn out after all these years plus it's pretty heavy. The only canon lens I have are the Samyang/Rokinon 35mm and 80mm which are pretty heavy itself, which I sometimes use with my m43 adapted on Lens Turbo II adapter. \n\nI graduated film school last year but havent really gotten serious with making my own short films lately. I want to get into that again. I own some light sticks and microphones already but I pretty much don't even film anything serious at the moment. Not that motivated after I got the m43 camera. I just basically use my camera to take photos nowadays. I also own some of those cheap vintage lenses: helios 442 and takumar so I could adapt 4 of my lens to the Sony/Blackmagic I guess (if I wanted to). \n\nI dont like the low light of the G7. I pretty much take it with me on trips and indoor locations where I dont really want to take an extra light with me. I just shoot for fun nowadays. \n\nI'm missing automatic focus... A lot of my lenses are manual. \n\nThe sonys im looking at are A7/A7R. \n\nI really dont know what I want. I just want to upgrade from what I already have to something that holds up to better low light. I dont want to buy a new lens for my G7 because they cost a heck of a lot and I already own (enough) lenses: 35mm, 25mm, 50mm, 58mm, 85mm... \n\nThe only thing i hate about the rokinons are its super heavy and its a bother to bring. \n\nI was also looking at the fz1000 because im going on a trip this fall. The zoom would be great for outdoors. I only own primes... But the lens is f2.8 and is a smaller sensor. Like why buy a lens when I could get this camera for the same price?\n\nIt's so difficult. So many choices. \n\nAnd if I were to get a sony, Id have to buy the cheapest lens I could get. ", "link": "https://www.reddit.com/r/Cameras/comments/902a57/blackmagic_pocket_cinema_4k_or_a_used_full_frame/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "blackmagic pocket cinema 4k or a used full frame sony? /!/ ive always wanted to get into full frame because i like the quality of the bokeh and low light capabilities. i currently own a panasonic g7 and an old t2i but never use the t2i as much anymore because it's all worn out after all these years plus it's pretty heavy. the only canon lens i have are the samyang/rokinon 35mm and 80mm which are pretty heavy itself, which i sometimes use with my m43 adapted on lens turbo ii adapter. \n\ni graduated film school last year but havent really gotten serious with making my own short films lately. i want to get into that again. i own some light sticks and microphones already but i pretty much don't even film anything serious at the moment. not that motivated after i got the m43 camera. i just basically use my camera to take photos nowadays. i also own some of those cheap vintage lenses: helios 442 and takumar so i could adapt 4 of my lens to the sony/blackmagic i guess (if i wanted to). \n\ni dont like the low light of the g7. i pretty much take it with me on trips and indoor -----> locations !!!  where i dont really want to take an extra light with me. i just shoot for fun nowadays. \n\ni'm missing automatic focus... a lot of my lenses are manual. \n\nthe sonys im looking at are a7/a7r. \n\ni really dont know what i want. i just want to upgrade from what i already have to something that holds up to better low light. i dont want to buy a new lens for my g7 because they cost a heck of a lot and i already own (enough) lenses: 35mm, 25mm, 50mm, 58mm, 85mm... \n\nthe only thing i hate about the rokinons are its super heavy and its a bother to bring. \n\ni was also looking at the fz1000 because im going on a trip this fall. the zoom would be great for outdoors. i only own primes... but the lens is f2.8 and is a smaller sensor. like why buy a lens when i could get this camera for the same price?\n\nit's so difficult. so many choices. \n\nand if i were to get a sony, id have to buy the cheapest lens i could get. ", "sortedWord": "None", "identifyer": 72700, "year": "2018"}, {"Unnamed: 0": 180714, "autor": "scottM9623", "date": 1544631748000, "content": "What type of cameras for remote view? /!/ Hi All:\n\nThis is my first post on this sub, so thanks for having me. I'm not sure if this is the appropriate place for this question, so please bear with me. I appreciate any information you can provide.\n\nI'm part of a research team that is analyzing how children interact with fish in a tank at a local zoo. For this project, we are analyzing many different components - but one we would like to do that we don't currently have a solution for is to be able to view the fish remotely. We have recently discussed setting up a camera system that would allow us to view the fish tanks while we are not on location (i.e. like a home security system with the ability to view it remotely). We would also like the ability to record, but it doesn't have to be continuous, only when the kids are on location interacting with the fish. We honestly have no clue where to even start, but price is somewhat of a concern as this is all grant funded research.\n\nThanks again for any information you can provide.", "link": "https://www.reddit.com/r/Cameras/comments/a5jm8y/what_type_of_cameras_for_remote_view/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "what type of cameras for remote view? /!/ hi all:\n\nthis is my first post on this sub, so thanks for having me. i'm not sure if this is the appropriate place for this question, so please bear with me. i appreciate any information you can provide.\n\ni'm part of a research team that is analyzing how children interact with fish in a tank at a local zoo. for this project, we are analyzing many different components - but one we would like to do that we don't currently have a solution for is to be able to view the fish remotely. we have recently discussed setting up a camera system that would allow us to view the fish tanks while we are not on -----> location !!!  (i.e. like a home security system with the ability to view it remotely). we would also like the ability to record, but it doesn't have to be continuous, only when the kids are on location interacting with the fish. we honestly have no clue where to even start, but price is somewhat of a concern as this is all grant funded research.\n\nthanks again for any information you can provide.", "sortedWord": "None", "identifyer": 73202, "year": "2018"}, {"Unnamed: 0": 180754, "autor": "Hunt4answers", "date": 1544375270000, "content": "New and a bit lost (Camera suggestions) /!/ Apologies in advance as I’m sure this sub is inundated with these posts.  I have some minor experience with camera work but not a ton of technical know how. I’m looking to get deeper into the field with a focus on video and a bit of still work as well. I’ve been a life long fisherman and this will be 90% of my work (fly fishing). Here’s what’s on the wish list (feel free to correct any of these based on experience, as mine is minimal):\n\nWeather-shield/water resistant\n\nSolid battery life (I don’t mind carrying extras but I’m seldom out for longer than a day w/o charging access)\n\nAbility to capture quality slow motion while maintaining details like water droplets (seems that 60fps and higher could handle this requirement?)\n\nI’m not very well versed with resolution standards in terms of  media hosting but YouTube and Instagram will be my main posting locations \n\nIdeal price range would be 400-900$usd for a body but I’m willing to be sold on something more pricey if there’s valid backing to it. I’d prefer to get a bundle deal and for the right one I could go as high as 1,800ish. \n\nI know less about lenses than I do cameras so any advice in that field would be greatly appreciated. The farthest I imagine I’d be shooting would be 50yards max in terms of the fishing. Most would be closer to 3-20 yards. \n\nI have a close friend who is trying to sell me on a Panasonic gh5 which is proving very enticing. Does anyone have an opinion on such a high level starting camera? \n\nThanks for sticking with the long post. I really appreciate any advise and direction", "link": "https://www.reddit.com/r/Cameras/comments/a4mic4/new_and_a_bit_lost_camera_suggestions/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "new and a bit lost (camera suggestions) /!/ apologies in advance as i’m sure this sub is inundated with these posts.  i have some minor experience with camera work but not a ton of technical know how. i’m looking to get deeper into the field with a focus on video and a bit of still work as well. i’ve been a life long fisherman and this will be 90% of my work (fly fishing). here’s what’s on the wish list (feel free to correct any of these based on experience, as mine is minimal):\n\nweather-shield/water resistant\n\nsolid battery life (i don’t mind carrying extras but i’m seldom out for longer than a day w/o charging access)\n\nability to capture quality slow motion while maintaining details like water droplets (seems that 60fps and higher could handle this requirement?)\n\ni’m not very well versed with resolution standards in terms of  media hosting but youtube and instagram will be my main posting -----> locations !!!  \n\nideal price range would be 400-900$usd for a body but i’m willing to be sold on something more pricey if there’s valid backing to it. i’d prefer to get a bundle deal and for the right one i could go as high as 1,800ish. \n\ni know less about lenses than i do cameras so any advice in that field would be greatly appreciated. the farthest i imagine i’d be shooting would be 50yards max in terms of the fishing. most would be closer to 3-20 yards. \n\ni have a close friend who is trying to sell me on a panasonic gh5 which is proving very enticing. does anyone have an opinion on such a high level starting camera? \n\nthanks for sticking with the long post. i really appreciate any advise and direction", "sortedWord": "None", "identifyer": 73244, "year": "2018"}, {"Unnamed: 0": 180783, "autor": "darlinglightofmylife", "date": 1537095927000, "content": "Canon 1200D not saving photos? /!/ Hello all, apologies if this is the wrong sub but I am having a pretty worrying issue with my Canon 1200D.\n\n\n I've gone out today to shoot a new location and my camera is taking photos just fine, as normal, but when I try and view the photos a few minutes later they are gone? Like...I take a photo, press the button to view it, it's there, looks normal, and then a few minutes later it's no longer on the camera at all. \n\n\nI've also tried deleting all my old photos off the camera, it does that just fine, then a few minutes later they're all back and I can view them again! But any new images I've taken  are gone. I've turned it on and off again, taken the memory card out and put it back in, tried different settings, and nothing is working. \n\n\nAs I said I've come out today to do some shooting and am now unable to do anything! I'm panicking slightly as this is my only camera. I've not added anything new to it, my memory card is a few years old but it's always worked with no problems, and everything else seems to be working as normal. Has anyone else experienced this? Anyone know how to fix it? Thank you in advance! ", "link": "https://www.reddit.com/r/Cameras/comments/9g9rn3/canon_1200d_not_saving_photos/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon 1200d not saving photos? /!/ hello all, apologies if this is the wrong sub but i am having a pretty worrying issue with my canon 1200d.\n\n\n i've gone out today to shoot a new -----> location !!!  and my camera is taking photos just fine, as normal, but when i try and view the photos a few minutes later they are gone? like...i take a photo, press the button to view it, it's there, looks normal, and then a few minutes later it's no longer on the camera at all. \n\n\ni've also tried deleting all my old photos off the camera, it does that just fine, then a few minutes later they're all back and i can view them again! but any new images i've taken  are gone. i've turned it on and off again, taken the memory card out and put it back in, tried different settings, and nothing is working. \n\n\nas i said i've come out today to do some shooting and am now unable to do anything! i'm panicking slightly as this is my only camera. i've not added anything new to it, my memory card is a few years old but it's always worked with no problems, and everything else seems to be working as normal. has anyone else experienced this? anyone know how to fix it? thank you in advance! ", "sortedWord": "None", "identifyer": 73274, "year": "2018"}, {"Unnamed: 0": 180981, "autor": "Msft92", "date": 1522308909000, "content": "Free Film Locations!", "link": "https://www.reddit.com/r/Cameras/comments/87zegf/free_film_locations/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "free film -----> locations !!! !", "sortedWord": "None", "identifyer": 73485, "year": "2018"}, {"Unnamed: 0": 181101, "autor": "JPRdrummer", "date": 1531942666000, "content": "DiCAPac WP-S5 /!/ Hi there everyone.\n\nI’m going to Mexico soon and Europe next year. For Mexico I plan on snorkeling to a location that requires underwater travel in order to reach  some of the things I plan on photographing as there is no other way in. Therefore, I require a way to get my camera there safely. Is DiCAPac a good option for my Nikon D50 for a enduring long snorkeling excursion? For Europe I figure that having the DiCaPac will allow me to safely get my D5500 through the various elements and bodies of water just as a reassurance while it’s in my Timbuktu bag and while I’m out and about. \n\nThoughts, comments, concerns, advice, etc, please give me everything you’ve got haha", "link": "https://www.reddit.com/r/Cameras/comments/8zyoig/dicapac_wps5/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "dicapac wp-s5 /!/ hi there everyone.\n\ni’m going to mexico soon and europe next year. for mexico i plan on snorkeling to a -----> location !!!  that requires underwater travel in order to reach  some of the things i plan on photographing as there is no other way in. therefore, i require a way to get my camera there safely. is dicapac a good option for my nikon d50 for a enduring long snorkeling excursion? for europe i figure that having the dicapac will allow me to safely get my d5500 through the various elements and bodies of water just as a reassurance while it’s in my timbuktu bag and while i’m out and about. \n\nthoughts, comments, concerns, advice, etc, please give me everything you’ve got haha", "sortedWord": "None", "identifyer": 73606, "year": "2018"}], "name": "locationCameras2018"}