{"interestingcomments": [{"Unnamed: 0": 184212, "autor": "lightningsandwich", "date": 1552353137000, "content": "So I purchased a DSLR camera and they forgot to add the lens, this ever happen to you before? /!/ so I purchased a Canon EOS Rebel T6 and was surprised to see the S 18-55mm lens was missing from the box even though it is clearly labeled on multiple locations that the lens was indeed suppose to ship with the box. I was just curious being new to the camera game myself if this is something I should be looking out for in the future. \n\n&amp;#x200B;", "link": "https://www.reddit.com/r/Cameras/comments/b01lch/so_i_purchased_a_dslr_camera_and_they_forgot_to/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "so i purchased a dslr camera and they forgot to add the lens, this ever happen to you before? /!/ so i purchased a canon eos rebel t6 and was surprised to see the s 18-55mm lens was missing from the box even though it is clearly labeled on multiple -----> locations !!!  that the lens was indeed suppose to ship with the box. i was just curious being new to the camera game myself if this is something i should be looking out for in the future. \n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 76766, "year": "2019"}, {"Unnamed: 0": 185057, "autor": "mooretaylor", "date": 1547579763000, "content": "CCTV Camera Price in Bangladesh /!/ What are CCTV cameras? \n\n&amp;#x200B;\n\nCCTV is the shortened form for Closed Circuit Television. CCTV cameras are utilized to screen a specific region where they are introduced. Current CCTV frameworks are made out of a few sections that are utilized all the while to accomplish legitimate checking and location. These parts are the DVR, cameras, hard plate drive, links, screen, and power supply. \n\n&amp;#x200B;\n\n*Processing img 9350tq4pyma21...*\n\nThe DVR and its Functions \n\n&amp;#x200B;\n\nDVR or the Digital Video Recorder plays a vital in the entire CCTV camera framework. In layman's terms, it is the core of the CCTV framework. This is the place you record, playback and control your cameras. The DVR comes in various kinds yet has nearly similar capacities. \n\n&amp;#x200B;\n\nFull D1 \n\n&amp;#x200B;\n\nWhen you hear the word full D1, it implies that the DVR has the most noteworthy goals that some other CCTV framework brings to the table. Join this with high specs CCTV cameras and you'll have the best CCTV arrangement of all. Full D1 DVRs are ordinarily utilized for mechanical purposes that rehearse tight security, [CCTV Camera Price in Bangladesh](http://www.credible.com.bd/)  and settings wherein facial distinguishing proof is essential. The issue with this DVR is that it costs much higher than different sorts of DVRs yet with exceptionally negligible contrast in the picture with its partners. \n\n&amp;#x200B;\n\nHalf D1 Half CIF \n\n&amp;#x200B;\n\nFor private companies or for the not really strict condition, Half D1 is worthy. This is the most regularly utilized DVRs today since they are very reasonable yet offer top-notch pictures. When you state half D1 that implies that just 50% of the quantities of cameras introduced in the DVR can achieve its most extreme goals (480x320p), while the other half can just figure out how to give (360x280p). The motivation behind why numerous individuals settle on this sort is on the grounds that it additionally creates brilliant pictures yet does not accompany powerful sticker price. \n\n&amp;#x200B;\n\nFull CIF \n\n&amp;#x200B;\n\nCIF is another sort of DVR. This sort delivers the most reduced nature of all, however, to a few people it is as of now satisfactory. Full CIF DVRs create 360x280p goals in all cameras introduced. A few people probably won't see the distinction between these sorts of DVRs however to the individuals who have found information with CCTV or the individuals who have clear visual perception, this sort isn't great. They don't create fantastic pictures, which makes them the least expensive and the most seldom utilized DVRs of all. Full CIF DVRs are the most seasoned model of DVR. \n\n&amp;#x200B;\n\nDVR and its Features \n\n&amp;#x200B;\n\nPresent day sorts of Digital Video Recorder process the most minimal video pressure conceivable, the H.264. This is the reason chronicles and playback may presently be reached out to months rather than days. You can now likewise associate it to the web, so you can get to your cameras remotely or from another area utilizing your PC or your cell phones. These highlights make it less demanding to a few people to maintain their organizations even without really being there. There are other increasingly advanced highlights that CCTV camera brings to the table like movement location, video misfortune caution, influence misfortune alert, manual and booked chronicle and other more sections that mitigate your assurance and your own security. \n\n&amp;#x200B;\n\nIn case you're wondering where to get the most reasonable CCTV cameras in the Philippines, at that point essentially go to this site. This site offers a wide assortment of CCTV cameras in the Philippines just as all the data you have to pick the privilege CCTV camera for you. \n\n&amp;#x200B;", "link": "https://www.reddit.com/r/Cameras/comments/agc2k0/cctv_camera_price_in_bangladesh/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "cctv camera price in bangladesh /!/ what are cctv cameras? \n\n&amp;#x200b;\n\ncctv is the shortened form for closed circuit television. cctv cameras are utilized to screen a specific region where they are introduced. current cctv frameworks are made out of a few sections that are utilized all the while to accomplish legitimate checking and -----> location !!! . these parts are the dvr, cameras, hard plate drive, links, screen, and power supply. \n\n&amp;#x200b;\n\n*processing img 9350tq4pyma21...*\n\nthe dvr and its functions \n\n&amp;#x200b;\n\ndvr or the digital video recorder plays a vital in the entire cctv camera framework. in layman's terms, it is the core of the cctv framework. this is the place you record, playback and control your cameras. the dvr comes in various kinds yet has nearly similar capacities. \n\n&amp;#x200b;\n\nfull d1 \n\n&amp;#x200b;\n\nwhen you hear the word full d1, it implies that the dvr has the most noteworthy goals that some other cctv framework brings to the table. join this with high specs cctv cameras and you'll have the best cctv arrangement of all. full d1 dvrs are ordinarily utilized for mechanical purposes that rehearse tight security, [cctv camera price in bangladesh](http://www.credible.com.bd/)  and settings wherein facial distinguishing proof is essential. the issue with this dvr is that it costs much higher than different sorts of dvrs yet with exceptionally negligible contrast in the picture with its partners. \n\n&amp;#x200b;\n\nhalf d1 half cif \n\n&amp;#x200b;\n\nfor private companies or for the not really strict condition, half d1 is worthy. this is the most regularly utilized dvrs today since they are very reasonable yet offer top-notch pictures. when you state half d1 that implies that just 50% of the quantities of cameras introduced in the dvr can achieve its most extreme goals (480x320p), while the other half can just figure out how to give (360x280p). the motivation behind why numerous individuals settle on this sort is on the grounds that it additionally creates brilliant pictures yet does not accompany powerful sticker price. \n\n&amp;#x200b;\n\nfull cif \n\n&amp;#x200b;\n\ncif is another sort of dvr. this sort delivers the most reduced nature of all, however, to a few people it is as of now satisfactory. full cif dvrs create 360x280p goals in all cameras introduced. a few people probably won't see the distinction between these sorts of dvrs however to the individuals who have found information with cctv or the individuals who have clear visual perception, this sort isn't great. they don't create fantastic pictures, which makes them the least expensive and the most seldom utilized dvrs of all. full cif dvrs are the most seasoned model of dvr. \n\n&amp;#x200b;\n\ndvr and its features \n\n&amp;#x200b;\n\npresent day sorts of digital video recorder process the most minimal video pressure conceivable, the h.264. this is the reason chronicles and playback may presently be reached out to months rather than days. you can now likewise associate it to the web, so you can get to your cameras remotely or from another area utilizing your pc or your cell phones. these highlights make it less demanding to a few people to maintain their organizations even without really being there. there are other increasingly advanced highlights that cctv camera brings to the table like movement location, video misfortune caution, influence misfortune alert, manual and booked chronicle and other more sections that mitigate your assurance and your own security. \n\n&amp;#x200b;\n\nin case you're wondering where to get the most reasonable cctv cameras in the philippines, at that point essentially go to this site. this site offers a wide assortment of cctv cameras in the philippines just as all the data you have to pick the privilege cctv camera for you. \n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 77635, "year": "2019"}, {"Unnamed: 0": 185274, "autor": "PhatPandaMo", "date": 1551894521000, "content": "Camera Recommendations? /!/ I would like to find a nicer camera (SLR type) that is still easy to use but can shoot some higher quality as well.  One with Bluetooth would be nice…some way of directly downloading the photos if possible so what we take is available without needing to manually transfer.\n\nIt will be used for taking pictures of wood doors, windows, paint/stain samples and hardware in a manufacturing facility. Color consistency is very important, my customers often use these pictures to select wood grains and tones.  It may also go on occasional job site visits in locations like CA, HI, and WA. \n\nMedium range budget, we care about quality but no one here is a professional photographer. \n\nDoes anyone have any suggestions? Thank you in advance!", "link": "https://www.reddit.com/r/Cameras/comments/ay1mqj/camera_recommendations/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "camera recommendations? /!/ i would like to find a nicer camera (slr type) that is still easy to use but can shoot some higher quality as well.  one with bluetooth would be nice…some way of directly downloading the photos if possible so what we take is available without needing to manually transfer.\n\nit will be used for taking pictures of wood doors, windows, paint/stain samples and hardware in a manufacturing facility. color consistency is very important, my customers often use these pictures to select wood grains and tones.  it may also go on occasional job site visits in -----> locations !!!  like ca, hi, and wa. \n\nmedium range budget, we care about quality but no one here is a professional photographer. \n\ndoes anyone have any suggestions? thank you in advance!", "sortedWord": "None", "identifyer": 77857, "year": "2019"}, {"Unnamed: 0": 185632, "autor": "yyz89", "date": 1554688973000, "content": "Time for a new camera... Nikon D850 or Canon 5D Mk IV or... ? /!/ Professional shooter here shooting Nikon for the past decade (D90, D7000, D700, D800). Current camera (D800) is nearing end of life and I'm looking for a replacement. I'm pretty set on sticking to Nikon with the D850, but exploring other options as well. I'm wanting to do a bit more video and know Canon has always been better for that, so am considering the 5D Mk IV as well. I've looked at the Sony A7R III as well, but for the life of me cannot get into mirrorless cameras. I'm a big guy with huge hands and the big dinosaur DSLR's just feel so much better in my hand. Then there's the whole electronic viewfinder thing which I can't stand- it feels so strange and unnatural, and as if there's some slight latency (even though I'm sure there's not). I've tried a few times to handle the Sony, but every time I come away thinking it's just too foreign for me. I know that's the direction pro cameras are heading in, but I'm thinking I might stick to the older larger format DSLR's for the time being. Are there some other DSLR's worth considering? \n\nI shoot mainly fashion/portrait stuff, a split between studio (studio + natural light) and location (mostly natural light). Usually shoot f/4.5-11, so fast lenses don't matter to me at all. I shoot mostly primes- not because they're faster, I just prefer the look they give me. Also I take time to compose, so huge FPS rate is meaningless to me- 1fps is more than enough for me tbh. Don't need a million focus points either- one central one is fine, anything else is a bonus. ISO performance... would be nice to have something that can produce fairly clean images up to 3200, but I'm guessing some noise is inevitable past a certain point. But I also need the camera to be solid and doing video. Won't be shooting anything crazy important on it when it comes to video, but would be nice to have some solid supplementary footage to go with my editorials and such. \n\nIs the D850 my best bet or should I go Canon or some other route? Not really sure who else is currently in the DSLR market and all those review videos really bore me as it's mostly irrelevant to my needs. Not really a gearhead as I'm too busy shooting most of the time. Just need something solid that'll do the job well. Don't need a million crazy features, I like it to remain fairly primitive still. ", "link": "https://www.reddit.com/r/Cameras/comments/bao29f/time_for_a_new_camera_nikon_d850_or_canon_5d_mk/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "time for a new camera... nikon d850 or canon 5d mk iv or... ? /!/ professional shooter here shooting nikon for the past decade (d90, d7000, d700, d800). current camera (d800) is nearing end of life and i'm looking for a replacement. i'm pretty set on sticking to nikon with the d850, but exploring other options as well. i'm wanting to do a bit more video and know canon has always been better for that, so am considering the 5d mk iv as well. i've looked at the sony a7r iii as well, but for the life of me cannot get into mirrorless cameras. i'm a big guy with huge hands and the big dinosaur dslr's just feel so much better in my hand. then there's the whole electronic viewfinder thing which i can't stand- it feels so strange and unnatural, and as if there's some slight latency (even though i'm sure there's not). i've tried a few times to handle the sony, but every time i come away thinking it's just too foreign for me. i know that's the direction pro cameras are heading in, but i'm thinking i might stick to the older larger format dslr's for the time being. are there some other dslr's worth considering? \n\ni shoot mainly fashion/portrait stuff, a split between studio (studio + natural light) and -----> location !!!  (mostly natural light). usually shoot f/4.5-11, so fast lenses don't matter to me at all. i shoot mostly primes- not because they're faster, i just prefer the look they give me. also i take time to compose, so huge fps rate is meaningless to me- 1fps is more than enough for me tbh. don't need a million focus points either- one central one is fine, anything else is a bonus. iso performance... would be nice to have something that can produce fairly clean images up to 3200, but i'm guessing some noise is inevitable past a certain point. but i also need the camera to be solid and doing video. won't be shooting anything crazy important on it when it comes to video, but would be nice to have some solid supplementary footage to go with my editorials and such. \n\nis the d850 my best bet or should i go canon or some other route? not really sure who else is currently in the dslr market and all those review videos really bore me as it's mostly irrelevant to my needs. not really a gearhead as i'm too busy shooting most of the time. just need something solid that'll do the job well. don't need a million crazy features, i like it to remain fairly primitive still. ", "sortedWord": "None", "identifyer": 78222, "year": "2019"}, {"Unnamed: 0": 186278, "autor": "oldbooksandcandles", "date": 1566242121000, "content": "Remote activated Camera /!/ I'd like to set up a camera where people can take photos of themselves using some sort of remote/button activation and then have the photos send them selves to a monitor. The camera will be about 15ft away from the people's standing location and the monitor will be just below the camera.\n\nI'm looking for a camera with good battery life and that won't shut off on its own, unless the remote can turn it on (it will be high up and not easy to access to change batteries or swap cards). Quality should be good, but doesn't need to be the best out there.\n\nAny recommendations??", "link": "https://www.reddit.com/r/Cameras/comments/csltyh/remote_activated_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "remote activated camera /!/ i'd like to set up a camera where people can take photos of themselves using some sort of remote/button activation and then have the photos send them selves to a monitor. the camera will be about 15ft away from the people's standing -----> location !!!  and the monitor will be just below the camera.\n\ni'm looking for a camera with good battery life and that won't shut off on its own, unless the remote can turn it on (it will be high up and not easy to access to change batteries or swap cards). quality should be good, but doesn't need to be the best out there.\n\nany recommendations??", "sortedWord": "None", "identifyer": 78881, "year": "2019"}, {"Unnamed: 0": 186923, "autor": "Gabe0020", "date": 1577204971000, "content": "Upgrading from a Nikon D3400 /!/ My nikon D3400 recently broke and so I'm thinking of upgrading the camera body. I've been thinking of a Nikon d7500 but I was wondering if anyone had any recommendations. \n\nI typically do portraits, studio and location, but also do aninal photography as well. I want to stick to Nikon as I have multiple lens as well, if it has a built in auto focus motor that would be ideal", "link": "https://www.reddit.com/r/Cameras/comments/ef3j0g/upgrading_from_a_nikon_d3400/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "upgrading from a nikon d3400 /!/ my nikon d3400 recently broke and so i'm thinking of upgrading the camera body. i've been thinking of a nikon d7500 but i was wondering if anyone had any recommendations. \n\ni typically do portraits, studio and -----> location !!! , but also do aninal photography as well. i want to stick to nikon as i have multiple lens as well, if it has a built in auto focus motor that would be ideal", "sortedWord": "None", "identifyer": 79550, "year": "2019"}, {"Unnamed: 0": 187359, "autor": "Draydir", "date": 1552916029000, "content": "Choice of camera for portraits, landscape and astro/night photos /!/ Hi, new to photography and wanting a few tips please.\n\nI'd like a camera that does everything fairly well. A good general all-rounder if you will.  I don't have a big budget and am willing to start with preloved kit. (What important questions should I ask buying preowned cameras?)\n\nI want to take candid portrait shots and be able to capture detail and expression in faces.\n\nAlso, landscapes. I live near the English Lake District and therefore have access to hundreds of interesting locations.\n\nLastly, I'd like to experiment with long exposures, night photography and star tracking.\n\nI have read all about how Canon EOS model numbers work and figure I'm probably looking around the 60D - is this a good starter camera? Are other brands more suitable or more cost effective? Are lenses pretty much standard these days? Can the Nikon lens fit the Canon etc.? I don't want to buy better lenses then limit myself to what body/brand I can upgrade to.\n\nThanks in advance for your advice.", "link": "https://www.reddit.com/r/Cameras/comments/b2ism1/choice_of_camera_for_portraits_landscape_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "choice of camera for portraits, landscape and astro/night photos /!/ hi, new to photography and wanting a few tips please.\n\ni'd like a camera that does everything fairly well. a good general all-rounder if you will.  i don't have a big budget and am willing to start with preloved kit. (what important questions should i ask buying preowned cameras?)\n\ni want to take candid portrait shots and be able to capture detail and expression in faces.\n\nalso, landscapes. i live near the english lake district and therefore have access to hundreds of interesting -----> locations !!! .\n\nlastly, i'd like to experiment with long exposures, night photography and star tracking.\n\ni have read all about how canon eos model numbers work and figure i'm probably looking around the 60d - is this a good starter camera? are other brands more suitable or more cost effective? are lenses pretty much standard these days? can the nikon lens fit the canon etc.? i don't want to buy better lenses then limit myself to what body/brand i can upgrade to.\n\nthanks in advance for your advice.", "sortedWord": "None", "identifyer": 79997, "year": "2019"}, {"Unnamed: 0": 187436, "autor": "EducationalElephant6", "date": 1554346433000, "content": "Looking for a GPS Camera that stamps the GPS location onto the photo. /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/b97diw/looking_for_a_gps_camera_that_stamps_the_gps/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "looking for a gps camera that stamps the gps -----> location !!!  onto the photo. /!/ [removed]", "sortedWord": "None", "identifyer": 80076, "year": "2019"}, {"Unnamed: 0": 187970, "autor": "TheNapkinOfTruth", "date": 1560251374000, "content": "MBP 2018 / Dropping Tether /!/ Hello all.\n\nFirst post here and its an enquiry and an attempt to share an experience.\n\nI was recently Digital Operating on a location job on a late-2018 MacBook Pro (i9 - 32GB RAM - 1TB HD). The laptop was being powered via a Hyperjuice 222, and operating on High Sierra 10.3.6 w/ Capture One 10 tethered to a mint 5D Mark III via a 10cm USB MiniB 5 Pin, attached to a standard / 5m repeater (cannot recall brand which sucks).\n\nAbout an hour or two into the shoot the tether connection dropped.  I switched the set of cables and we continued. After lunch, the connection dropped again. \n\nI attempted to troubleshoot via all sorts of ways: \n\n\\- Restart Laptop\n\n\\- Switch off Automatic Graphics Switching\n\n\\- Restart Capture\n\n\\- Deselecting other Cameras in Capture preferences\n\n\\- Lowering preview resolutions in Capture preferences\n\n\\- Removing SD Card from 5D\n\n\\- Try tethering through the other ports\n\n&amp;#x200B;\n\nI was advised by the rental company that it may be a software/hardware issue with the laptop rather than the cables.\n\nAfter removing the repeater and attempting to tether with the much too short USB MiniB 5 Pin cables, I found that both worked absolutely fine, and that the repeaters were getting in the way of tethering.\n\nObviously we had to shoot to card as a 10cm tether cable was out of question, however a local rental place provided a standard 5m TetherTools cable. This worked absolutely fine for the remaining hour and a half however did not necessarily provide any answers.\n\n&amp;#x200B;\n\nDoes any of this sound familiar? \n\nCould this be a matter of the repeater attempting to draw too much power from the MBP port?\n\n&amp;#x200B;\n\nAny help, advice, or support would be greatly appreciated!\n\n&amp;#x200B;\n\nThis was extremely stressful to deal with and not sure what to do besides using tether cables that come as one unit.", "link": "https://www.reddit.com/r/Cameras/comments/bzb3lt/mbp_2018_dropping_tether/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "mbp 2018 / dropping tether /!/ hello all.\n\nfirst post here and its an enquiry and an attempt to share an experience.\n\ni was recently digital operating on a -----> location !!!  job on a late-2018 macbook pro (i9 - 32gb ram - 1tb hd). the laptop was being powered via a hyperjuice 222, and operating on high sierra 10.3.6 w/ capture one 10 tethered to a mint 5d mark iii via a 10cm usb minib 5 pin, attached to a standard / 5m repeater (cannot recall brand which sucks).\n\nabout an hour or two into the shoot the tether connection dropped.  i switched the set of cables and we continued. after lunch, the connection dropped again. \n\ni attempted to troubleshoot via all sorts of ways: \n\n\\- restart laptop\n\n\\- switch off automatic graphics switching\n\n\\- restart capture\n\n\\- deselecting other cameras in capture preferences\n\n\\- lowering preview resolutions in capture preferences\n\n\\- removing sd card from 5d\n\n\\- try tethering through the other ports\n\n&amp;#x200b;\n\ni was advised by the rental company that it may be a software/hardware issue with the laptop rather than the cables.\n\nafter removing the repeater and attempting to tether with the much too short usb minib 5 pin cables, i found that both worked absolutely fine, and that the repeaters were getting in the way of tethering.\n\nobviously we had to shoot to card as a 10cm tether cable was out of question, however a local rental place provided a standard 5m tethertools cable. this worked absolutely fine for the remaining hour and a half however did not necessarily provide any answers.\n\n&amp;#x200b;\n\ndoes any of this sound familiar? \n\ncould this be a matter of the repeater attempting to draw too much power from the mbp port?\n\n&amp;#x200b;\n\nany help, advice, or support would be greatly appreciated!\n\n&amp;#x200b;\n\nthis was extremely stressful to deal with and not sure what to do besides using tether cables that come as one unit.", "sortedWord": "None", "identifyer": 80626, "year": "2019"}, {"Unnamed: 0": 189560, "autor": "__sicko", "date": 1559021095000, "content": "next film camera; pentax 67ii, mamiya 7ii, or leica (and if so, which one?) /!/ i'm a full-time fashion/portrait photographer. have been shooting the nikon d800 since it came out (6-7 years?) and had great success with it- soon will be upgrading to the newer d850 and looking forward to it. previously i used to shoot 35mm, medium and large format, but got out of them all as i just wasn't shooting much film anymore- the vastly expedited workflow of digital was a major plus in my line of work. eventually i started missing film photography-- specifically, the more thoughtful/meticulous/slowed-down process of it-- and picked up a camera i'd always wanted, the hasselblad 503cw. it's great and i longed for it for many years, however the square format just isn't for me and i'm finding i just don't like the shooting style, from an ergonomic standpoint. i'm well aware of the 'workarounds' for this situation, but have no interest in getting the grip, 645 back, and viewfinder to make it more slr-like. i will keep it for studio stuff, but would like to add another camera to use for environmental portraiture done in the field/on-location, as well as for random captures (maybe some urban long exposure and nature/travel stuff too; really an all-around film camera). the pentax 67ii and mamiya 7ii are both cameras i've lusted after for as long as i did the hasselblad and i've a feeling i'll eventually own both, however i'd like your help in making a decision for which to get next. i'm also considering a leica after having handled one on a recent trip to europe, where i almost bought the camera i was shooting with (an m6). it felt incredibly solid- even more so than the hassy- and quite intuitive to use. i'm still not as at home with rangefinders as i am with slr's, however i'm a quick learner and would get to second nature level in a matter of a week or two. negative size isn't too much of a concern as the stuff i'll be shooting with this camera (any of these cameras) will be mainly for web and magazines, where the 35mm resolution (if going that route) is more than enough, especially with some of the scanners out there today. even in the event of publishing a photo book... it's not like thousands of people haven't done so with a 35mm. the thing with leica is that i don't know much/anything about them. i've thought about them several times through the years, and am aware of the different models, but not exactly sure how they translate to real world use. i do like the idea of a completely mechanical camera, as well as having something relatively modern, so that leaves me with the m6 and mp really, but then there's the issue of which serial number m6 and which magnification? i never really understood the magnification thing. i also understand the m6's were made of an alloy which can morph into an unattractive looking state, i'm assuming with exposure to higher temp/direct sun? i know the m3 has 'the' ideal viewfinder, but i'm not so hot on throwing money into vintage cameras. so, which one shall i go for?", "link": "https://www.reddit.com/r/Cameras/comments/btw4gx/next_film_camera_pentax_67ii_mamiya_7ii_or_leica/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "next film camera; pentax 67ii, mamiya 7ii, or leica (and if so, which one?) /!/ i'm a full-time fashion/portrait photographer. have been shooting the nikon d800 since it came out (6-7 years?) and had great success with it- soon will be upgrading to the newer d850 and looking forward to it. previously i used to shoot 35mm, medium and large format, but got out of them all as i just wasn't shooting much film anymore- the vastly expedited workflow of digital was a major plus in my line of work. eventually i started missing film photography-- specifically, the more thoughtful/meticulous/slowed-down process of it-- and picked up a camera i'd always wanted, the hasselblad 503cw. it's great and i longed for it for many years, however the square format just isn't for me and i'm finding i just don't like the shooting style, from an ergonomic standpoint. i'm well aware of the 'workarounds' for this situation, but have no interest in getting the grip, 645 back, and viewfinder to make it more slr-like. i will keep it for studio stuff, but would like to add another camera to use for environmental portraiture done in the field/on------> location !!! , as well as for random captures (maybe some urban long exposure and nature/travel stuff too; really an all-around film camera). the pentax 67ii and mamiya 7ii are both cameras i've lusted after for as long as i did the hasselblad and i've a feeling i'll eventually own both, however i'd like your help in making a decision for which to get next. i'm also considering a leica after having handled one on a recent trip to europe, where i almost bought the camera i was shooting with (an m6). it felt incredibly solid- even more so than the hassy- and quite intuitive to use. i'm still not as at home with rangefinders as i am with slr's, however i'm a quick learner and would get to second nature level in a matter of a week or two. negative size isn't too much of a concern as the stuff i'll be shooting with this camera (any of these cameras) will be mainly for web and magazines, where the 35mm resolution (if going that route) is more than enough, especially with some of the scanners out there today. even in the event of publishing a photo book... it's not like thousands of people haven't done so with a 35mm. the thing with leica is that i don't know much/anything about them. i've thought about them several times through the years, and am aware of the different models, but not exactly sure how they translate to real world use. i do like the idea of a completely mechanical camera, as well as having something relatively modern, so that leaves me with the m6 and mp really, but then there's the issue of which serial number m6 and which magnification? i never really understood the magnification thing. i also understand the m6's were made of an alloy which can morph into an unattractive looking state, i'm assuming with exposure to higher temp/direct sun? i know the m3 has 'the' ideal viewfinder, but i'm not so hot on throwing money into vintage cameras. so, which one shall i go for?", "sortedWord": "None", "identifyer": 82269, "year": "2019"}, {"Unnamed: 0": 189647, "autor": "goldking115", "date": 1562348951000, "content": "I’m thinking to buy a Song A7iii. Need some help from owners! /!/ Hello\nSo I’m a indie music artist and I want to buy a camera that will always last my musical journey.\nI’m hoping it’s good in these areas :\nShooting music videos (most important)\nShooting at night or dark locations (important)\nAlso good for vlogging\nI will be using the camera for :\nPhotos (Instagram)\nCreating music videos with a gimbal n cranes n such\nShooting st night for photos and videos\nI want something that will last me a long time and I can give to my friends for them to record me while I give direction.\nI’m thinking to buy this camera but I’m wondering..\nShould I wait till Black Friday time period for better deals\nI heard the package doesn’t come with batteries? What’s the best and fastest charger to use?\nLens. What is the first lens I need to get to shoot for most type of shots?\nIf you have any other tips please let me know and thank you 🙂", "link": "https://www.reddit.com/r/Cameras/comments/c9ixcg/im_thinking_to_buy_a_song_a7iii_need_some_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i’m thinking to buy a song a7iii. need some help from owners! /!/ hello\nso i’m a indie music artist and i want to buy a camera that will always last my musical journey.\ni’m hoping it’s good in these areas :\nshooting music videos (most important)\nshooting at night or dark -----> locations !!!  (important)\nalso good for vlogging\ni will be using the camera for :\nphotos (instagram)\ncreating music videos with a gimbal n cranes n such\nshooting st night for photos and videos\ni want something that will last me a long time and i can give to my friends for them to record me while i give direction.\ni’m thinking to buy this camera but i’m wondering..\nshould i wait till black friday time period for better deals\ni heard the package doesn’t come with batteries? what’s the best and fastest charger to use?\nlens. what is the first lens i need to get to shoot for most type of shots?\nif you have any other tips please let me know and thank you 🙂", "sortedWord": "None", "identifyer": 82359, "year": "2019"}, {"Unnamed: 0": 190200, "autor": "TheSaltyFox", "date": 1575184904000, "content": "Which is the best entry camera: Canon Rebel SL3 vs Nikon D3500 /!/ My wife just bought the Canon Rebel SL3 from Best Buy as she is getting ready for our upcoming trip and wants get the most high quality photos she can, unlike our phone photos. She mainly wants it for better quality landscapes, portraits of us are landscape locations, and for great pictures at night, which our phones have never been able to do.\n\nNow I take every bit of advise from Best Buy advisers with a grain of salt, but since we don’t know much about them in the first place, I figured I’d let you guys confirm/deny it.  They told us the Canon Rebel SL3 has slightly better megapixels and of course, the 4K video function.  The one thing that they said the Nikon has over the Canon is that the Nikon is more\nCompatible with other lenses, where as canon apparently uses a new mount almost every year forcing you to use specific lenses that are more expensive.  Though apparently the Nikon is harder to learn/use\n\nI did take some introduction photography classes a whole back, so I’ll be able to pick up on some of the terms you guys use, but give it to me straight as well. What makes which camera better? Or is there a different option she should be looking at? We did look at Mirrorless camera’s, but it seems some people say those are still in the works and that DSLR still beats them for landscape, low light, and movement shots.\n\nSo what do you guys think? Did she make the right choice? Or is there a better option? Is there another camera altogether that we should be looking at?\n\nTeach me about how to choose the best camera!", "link": "https://www.reddit.com/r/Cameras/comments/e4d25z/which_is_the_best_entry_camera_canon_rebel_sl3_vs/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "which is the best entry camera: canon rebel sl3 vs nikon d3500 /!/ my wife just bought the canon rebel sl3 from best buy as she is getting ready for our upcoming trip and wants get the most high quality photos she can, unlike our phone photos. she mainly wants it for better quality landscapes, portraits of us are landscape -----> locations !!! , and for great pictures at night, which our phones have never been able to do.\n\nnow i take every bit of advise from best buy advisers with a grain of salt, but since we don’t know much about them in the first place, i figured i’d let you guys confirm/deny it.  they told us the canon rebel sl3 has slightly better megapixels and of course, the 4k video function.  the one thing that they said the nikon has over the canon is that the nikon is more\ncompatible with other lenses, where as canon apparently uses a new mount almost every year forcing you to use specific lenses that are more expensive.  though apparently the nikon is harder to learn/use\n\ni did take some introduction photography classes a whole back, so i’ll be able to pick up on some of the terms you guys use, but give it to me straight as well. what makes which camera better? or is there a different option she should be looking at? we did look at mirrorless camera’s, but it seems some people say those are still in the works and that dslr still beats them for landscape, low light, and movement shots.\n\nso what do you guys think? did she make the right choice? or is there a better option? is there another camera altogether that we should be looking at?\n\nteach me about how to choose the best camera!", "sortedWord": "None", "identifyer": 82940, "year": "2019"}], "name": "locationCameras2019"}