{"interestingcomments": [{"Unnamed: 0": 208008, "autor": "himalayanpinksalts", "date": 1583873349000, "content": "Should I purchase a Sony RX100 III /!/ I'm a 20 year old student who travels to different locations frequently due to internships. I've drawn interest in purchasing a camera for a few reasons.\n\nFirstly, I'm interested in the possibility of adopting a new hobby. I think that having a camera could inspire me to get out more and take interest in the stuff going on around me rather than staying secluded. I also think it could help me document my life a bit more considering I move around a lot and don't really do much to be able to commemorate things.\n\nAlso, I think it would be convenient to separate some legitimate photos from all the junk that gets flooded on my phone. I currently have an iPhone XR, where the image quality is pretty solid. However, my photo library gets cluttered with dumb stuff like screenshots, etc. and I think having a seperate entity dedicated to more professional and legitimate photos could be very convenient.\n\nI'm also not opposed to the idea of using video, as well, to capture some stuff. I've never really worked with photography/videography at any point in my life but I think I'm still young and its not late to pickup a hobby.\n\nFor someone in my situation, how does a Sony RX100 III sound? Should I spend a little extra and get the IV? Or maybe should I go with another camera altogether? Due to my reasoning, am I better off just being more diligent with organizing my phone and just using that as a camera? Truly appreciate any and all replies/advice.", "link": "https://www.reddit.com/r/Cameras/comments/fgksru/should_i_purchase_a_sony_rx100_iii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "should i purchase a sony rx100 iii /!/ i'm a 20 year old student who travels to different -----> locations !!!  frequently due to internships. i've drawn interest in purchasing a camera for a few reasons.\n\nfirstly, i'm interested in the possibility of adopting a new hobby. i think that having a camera could inspire me to get out more and take interest in the stuff going on around me rather than staying secluded. i also think it could help me document my life a bit more considering i move around a lot and don't really do much to be able to commemorate things.\n\nalso, i think it would be convenient to separate some legitimate photos from all the junk that gets flooded on my phone. i currently have an iphone xr, where the image quality is pretty solid. however, my photo library gets cluttered with dumb stuff like screenshots, etc. and i think having a seperate entity dedicated to more professional and legitimate photos could be very convenient.\n\ni'm also not opposed to the idea of using video, as well, to capture some stuff. i've never really worked with photography/videography at any point in my life but i think i'm still young and its not late to pickup a hobby.\n\nfor someone in my situation, how does a sony rx100 iii sound? should i spend a little extra and get the iv? or maybe should i go with another camera altogether? due to my reasoning, am i better off just being more diligent with organizing my phone and just using that as a camera? truly appreciate any and all replies/advice.", "sortedWord": "None", "identifyer": 1556, "year": "2020"}, {"Unnamed: 0": 208310, "autor": "dleonard1122", "date": 1602675905000, "content": "Sony A6400 vs Fujifilm X-T30 /!/ This is my first post/comment here. I'm not a professional (or even amateur) photographer, but I do enjoy taking nice photos and having fun. I also have a terrible case of over-analyzing every purchase I make, so please bear with me while I try to talk through where I'm at with my decision making process, and what I could use advice on. I also realize that this sub probably gets a decent amount of these questions, so please excuse my rather lengthy post because I'm trying to show that I have in fact put effort into this.\n\n# Background\n\nMy primary uses for a dedicated camera (aside from a smartphone) are when my wife and I are traveling or portraits at family gatherings. We also have our first baby on the way and while I'm at home I would like to document a lot of those first few months, as well as have something to use as they grow up. I imagine we'll like to get things like the baby's first steps on video.\n\nOur current camera is a Nikon 1 J3 which, while nice and compact has left us wanting a little more out of our next camera. It has a 10-30mm (27-81mm FF equivalent) lens. I'd like to be able to get better photos indoors if possible. I'd also like access a cheaper prime lenses. A dedicated 50mm equivalent for portraits and a wide angle prime for landscapes when traveling would probably serve us well.\n\nI was dead set on upgrading to the Sony a6400 because I like the compact size, the lens lineup, and what sounds like a stupid-proof AF system. That was until I started reading about the Fujifilm XT-30 and how popular it is among enthusiasts and professionals alike. The idea of physical buttons sounds like it would make for a more fun experience, and might encourage me to bring it out more often.\n\n# Lenses\n\nFor the initial purchase, I was just hoping to buy a standard zoom kit lens. If we went with the Sony, I was planning on buying it with the 18-135 f/3.5-5.6. If we went with the Fuji, I'd get the 18-55 f/2.8-4. Both lenses have OIS/OSS and bring the price for the camera and lens to $1300.\n\nObviously the Sony has a longer zoom and the Fuji has a wider aperture. The Nikon lens we are coming from (10-30mm focal length) has the same equivalent focal length as the Fujifilm, so I'd probably be more familiar with that, but I'm unsure if the extra reach of the 18-135 would be useful for things like any future kids sporting events.\n\nAfter the standard zoom, I'd probably plan on buying a 50mm equivalent prime before the baby is born. The Sony lineup has both the Sigma 30 f/1.4 and the Sony 35 f/1.8 OSS. The Fuji has a 30 f/1.4. Pricing is similar, but the Sony options are cheaper.\n\n# Differences\n\nThe main differences between these cameras that I'm aware of that I'm trying to weigh in my head are the ergonomics, AF system, the SOOC image quality.\n\nObviously each camera has different design philosophies. Without having held either, I really don't know which I'd prefer. The Nikon J3 we are coming from is certainly more like the Sony. Are there in-store locations I can go to to try out the X-T30?\n\nThe AF system on the Sony is what initially drew me to the A6400. Neither my wife or I are great photographers, so the ability to be able to try and capture a moment and just get it right is important to us. I've read the X-T30 has received firmware updates which have improved the AF (I actually really like that Fuji seem to be supporting their APS-C lineup with frequent firmware and lens updates,) but it's still not on the same level as the Sony.\n\nThe SOOC image quality is also incredibly important to us. So far I haven't made the jump to shooting in RAW. I would like to at some point, but for a host of reasons I just haven't yet. In the future, if it were made easy to edit RAW in a mobile app like Snapseed I could see myself touching up key photos, but for now we've only messed with JPG. I've read the Fuji really shines in this area, and that their in camera image processing is great.\n\n# Conclusion\n\nI'm torn, and while I'm sure either option will serve me well, I'm not really sure where or how to go about deciding. Any insight or experiences, feedback, or other things to consider would be greatly appreciated.", "link": "https://www.reddit.com/r/Cameras/comments/jaz47i/sony_a6400_vs_fujifilm_xt30/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony a6400 vs fujifilm x-t30 /!/ this is my first post/comment here. i'm not a professional (or even amateur) photographer, but i do enjoy taking nice photos and having fun. i also have a terrible case of over-analyzing every purchase i make, so please bear with me while i try to talk through where i'm at with my decision making process, and what i could use advice on. i also realize that this sub probably gets a decent amount of these questions, so please excuse my rather lengthy post because i'm trying to show that i have in fact put effort into this.\n\n# background\n\nmy primary uses for a dedicated camera (aside from a smartphone) are when my wife and i are traveling or portraits at family gatherings. we also have our first baby on the way and while i'm at home i would like to document a lot of those first few months, as well as have something to use as they grow up. i imagine we'll like to get things like the baby's first steps on video.\n\nour current camera is a nikon 1 j3 which, while nice and compact has left us wanting a little more out of our next camera. it has a 10-30mm (27-81mm ff equivalent) lens. i'd like to be able to get better photos indoors if possible. i'd also like access a cheaper prime lenses. a dedicated 50mm equivalent for portraits and a wide angle prime for landscapes when traveling would probably serve us well.\n\ni was dead set on upgrading to the sony a6400 because i like the compact size, the lens lineup, and what sounds like a stupid-proof af system. that was until i started reading about the fujifilm xt-30 and how popular it is among enthusiasts and professionals alike. the idea of physical buttons sounds like it would make for a more fun experience, and might encourage me to bring it out more often.\n\n# lenses\n\nfor the initial purchase, i was just hoping to buy a standard zoom kit lens. if we went with the sony, i was planning on buying it with the 18-135 f/3.5-5.6. if we went with the fuji, i'd get the 18-55 f/2.8-4. both lenses have ois/oss and bring the price for the camera and lens to $1300.\n\nobviously the sony has a longer zoom and the fuji has a wider aperture. the nikon lens we are coming from (10-30mm focal length) has the same equivalent focal length as the fujifilm, so i'd probably be more familiar with that, but i'm unsure if the extra reach of the 18-135 would be useful for things like any future kids sporting events.\n\nafter the standard zoom, i'd probably plan on buying a 50mm equivalent prime before the baby is born. the sony lineup has both the sigma 30 f/1.4 and the sony 35 f/1.8 oss. the fuji has a 30 f/1.4. pricing is similar, but the sony options are cheaper.\n\n# differences\n\nthe main differences between these cameras that i'm aware of that i'm trying to weigh in my head are the ergonomics, af system, the sooc image quality.\n\nobviously each camera has different design philosophies. without having held either, i really don't know which i'd prefer. the nikon j3 we are coming from is certainly more like the sony. are there in-store -----> locations !!!  i can go to to try out the x-t30?\n\nthe af system on the sony is what initially drew me to the a6400. neither my wife or i are great photographers, so the ability to be able to try and capture a moment and just get it right is important to us. i've read the x-t30 has received firmware updates which have improved the af (i actually really like that fuji seem to be supporting their aps-c lineup with frequent firmware and lens updates,) but it's still not on the same level as the sony.\n\nthe sooc image quality is also incredibly important to us. so far i haven't made the jump to shooting in raw. i would like to at some point, but for a host of reasons i just haven't yet. in the future, if it were made easy to edit raw in a mobile app like snapseed i could see myself touching up key photos, but for now we've only messed with jpg. i've read the fuji really shines in this area, and that their in camera image processing is great.\n\n# conclusion\n\ni'm torn, and while i'm sure either option will serve me well, i'm not really sure where or how to go about deciding. any insight or experiences, feedback, or other things to consider would be greatly appreciated.", "sortedWord": "None", "identifyer": 1900, "year": "2020"}, {"Unnamed: 0": 208866, "autor": "rampaige0191", "date": 1582295786000, "content": "MFT Lens Purchase /!/ I've finallypicked a new camera body to replace my Olympus Pen E-P3 (LCD went out  )\n\nI'm sticking with Olympus and going with the OM-D EM10.II\n\nWith the cost savings of not getting the newest camera body, I'm going to reinvest that money into some solid lenses. They seem to hold their value more than the camera body itself.\n\nThat being said, here's what I'm looking for/what I will likely use it/them for:\n\nI shoot mostly:\n\nArchitecture (future architect in the works )\nInteriors\nLandscapes\nOccasional candid/portrait while on vacation\n\nI currently own:\n\nKit lens (from Pen): 14-42mm F3.5-5.6\nTelephoto: Olympus M. Zuiko 40-150mm F4.0-5.6R\nWide angle adapter\nA couple UV filters for the kit and tele plus 1-2 others (don't remember off the top of my head)\n\nI have almost exclusively left the adapter on for 99% of my photographing purposes. Which have included locations like: Italy, Morocco, Spain, France, Germany, Czech Rep., Austria, Hungary, Turkey, Belize, and Hawaii (when I got the tele because I wished I had it in Belize). This makes me think I need a wider standard lens?\n\nThis camera will be used for traveling, so light and compact are important (hence sticking with MFT in lieu of APSC), but I'm willing to spend some money on quality.\n\nI've been weighing a few options:\n\nWalk around/kit upgrade lens + fast prime for night/low light\nWalk around/kit upgrade + ultra wide zoom\n\"Travel lens\"\nJust an ultra wide or a fast prime, etc.\nObviously the combinations are endless.\n\nI don't think I want to bring more than two lenses on this upcoming trip to Israel and Petra, Jordan. We usually travel on our own (not part of a group), but in this case we will be part of a group guided tour, so I definitely don't want to spend a lot of time swapping lenses, especially in the desert. But as a whole, I want a setup that will get me through most situations, as I've listed above.\n\nAll that said, I have a couple more questions:\n\nIs it better to get a used camera body or used lens?\nWould it make more sense, given my current setup, to rent the lenses as opposed to buying them?\nI have 1 week to make all these decisions! eek!", "link": "https://www.reddit.com/r/Cameras/comments/f7bxy4/mft_lens_purchase/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "mft lens purchase /!/ i've finallypicked a new camera body to replace my olympus pen e-p3 (lcd went out  )\n\ni'm sticking with olympus and going with the om-d em10.ii\n\nwith the cost savings of not getting the newest camera body, i'm going to reinvest that money into some solid lenses. they seem to hold their value more than the camera body itself.\n\nthat being said, here's what i'm looking for/what i will likely use it/them for:\n\ni shoot mostly:\n\narchitecture (future architect in the works )\ninteriors\nlandscapes\noccasional candid/portrait while on vacation\n\ni currently own:\n\nkit lens (from pen): 14-42mm f3.5-5.6\ntelephoto: olympus m. zuiko 40-150mm f4.0-5.6r\nwide angle adapter\na couple uv filters for the kit and tele plus 1-2 others (don't remember off the top of my head)\n\ni have almost exclusively left the adapter on for 99% of my photographing purposes. which have included -----> locations !!!  like: italy, morocco, spain, france, germany, czech rep., austria, hungary, turkey, belize, and hawaii (when i got the tele because i wished i had it in belize). this makes me think i need a wider standard lens?\n\nthis camera will be used for traveling, so light and compact are important (hence sticking with mft in lieu of apsc), but i'm willing to spend some money on quality.\n\ni've been weighing a few options:\n\nwalk around/kit upgrade lens + fast prime for night/low light\nwalk around/kit upgrade + ultra wide zoom\n\"travel lens\"\njust an ultra wide or a fast prime, etc.\nobviously the combinations are endless.\n\ni don't think i want to bring more than two lenses on this upcoming trip to israel and petra, jordan. we usually travel on our own (not part of a group), but in this case we will be part of a group guided tour, so i definitely don't want to spend a lot of time swapping lenses, especially in the desert. but as a whole, i want a setup that will get me through most situations, as i've listed above.\n\nall that said, i have a couple more questions:\n\nis it better to get a used camera body or used lens?\nwould it make more sense, given my current setup, to rent the lenses as opposed to buying them?\ni have 1 week to make all these decisions! eek!", "sortedWord": "None", "identifyer": 2514, "year": "2020"}, {"Unnamed: 0": 208993, "autor": "firsttobelast", "date": 1579064645000, "content": "Camera suggestions for permanent wireless set up in top corner of a room /!/ looking for a camera to look down upon a room from the corner. The first one I can think of is a gopro, and I like the idea that it has an app you can control from your phone, and in this situation that is pretty much a necessity for ease of use day to day due to the location.\n\npreferably 4K, most security cameras are extremely more expensive in price it seems. any suggestions appreciated.", "link": "https://www.reddit.com/r/Cameras/comments/eoxspo/camera_suggestions_for_permanent_wireless_set_up/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "camera suggestions for permanent wireless set up in top corner of a room /!/ looking for a camera to look down upon a room from the corner. the first one i can think of is a gopro, and i like the idea that it has an app you can control from your phone, and in this situation that is pretty much a necessity for ease of use day to day due to the -----> location !!! .\n\npreferably 4k, most security cameras are extremely more expensive in price it seems. any suggestions appreciated.", "sortedWord": "None", "identifyer": 2643, "year": "2020"}, {"Unnamed: 0": 209007, "autor": "PhotoHelp2244", "date": 1579018922000, "content": "help me get wiser /!/ Help guide me please.\n\nI own a Nikon d5000 dslr, which is great I love it I have used better cameras but so be it.  I got it cause my dad stopped using it and its simple to use and quite alright, now the only thing I don't like about it is the fact that its so large (as a dslr is.. duhh) therefor I am considering buying a smaller more compact camera (second hand) and I found myself a Canon Powershot SX430 SI for 30$, it works completely fine and nothing is wrong with it however will this camera take better pictures than the iPhone 8/10/11?.\n\nBecause I'm looking for a camera that I can just throw in my backpack, not worry to much about breaking , and if I stumble upon a nice location Ill be able to take some nice outfit photos, long exposure city-nighttime photos etc..\n\nso I guess my questions are.\n\n\\-will the Canon Powershot SX430 SI beat the normal iPhone camera in terms of portrait, whole body, city lights, architecture photography &amp; quality\n\n\\-or will I achieve similar quality in my photos as the iPhone cameras", "link": "https://www.reddit.com/r/Cameras/comments/eonfl4/help_me_get_wiser/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help me get wiser /!/ help guide me please.\n\ni own a nikon d5000 dslr, which is great i love it i have used better cameras but so be it.  i got it cause my dad stopped using it and its simple to use and quite alright, now the only thing i don't like about it is the fact that its so large (as a dslr is.. duhh) therefor i am considering buying a smaller more compact camera (second hand) and i found myself a canon powershot sx430 si for 30$, it works completely fine and nothing is wrong with it however will this camera take better pictures than the iphone 8/10/11?.\n\nbecause i'm looking for a camera that i can just throw in my backpack, not worry to much about breaking , and if i stumble upon a nice -----> location !!!  ill be able to take some nice outfit photos, long exposure city-nighttime photos etc..\n\nso i guess my questions are.\n\n\\-will the canon powershot sx430 si beat the normal iphone camera in terms of portrait, whole body, city lights, architecture photography &amp; quality\n\n\\-or will i achieve similar quality in my photos as the iphone cameras", "sortedWord": "None", "identifyer": 2657, "year": "2020"}, {"Unnamed: 0": 209087, "autor": "MidnightCharette", "date": 1583600634000, "content": "camcorder (or dslr) recommendation for interviewing (+3o min) /!/ any recommendations for a good video camera for interviewing?\n\nwe use two canon HF R80s right now and they don't seem to be cutting it. we shoot and export at 1080p, but the quality is always a bit fuzzy and when we have three people the frame the camera goes blurry because of the autofocus.\n\nInterview length: our chats last at least 1.5 hrs and often go longer without breaks.\n\nLighting: We record in multiple locations so we don't always have full control over lighting, but typically our lighting setup is: the room light + a [fovitec](https://www.amazon.com/gp/product/B00V7V02YK/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1) studio light (we use one light per person... soo 525 watts per camera). We'd like to not resolve the video quality issues with more lighting anyways, since what we have currently already gives one of hosts headaches after. so i'm hoping a better camera setup will help get quality footage even in these cases. But, let me know if this lighting is truly what we need to change to fix our issues.\n\nHere's some reference footage:\n\n[https://www.youtube.com/watch?v=qRua1HHdX-I&amp;list=PLSgeCIocai-DK0kSuCSNA2iQ0oSKhmvtt&amp;index=4](https://www.youtube.com/watch?v=qRua1HHdX-I&amp;list=PLSgeCIocai-DK0kSuCSNA2iQ0oSKhmvtt&amp;index=4)\n\n[https://youtu.be/FH-6xdVgM8s](https://youtu.be/FH-6xdVgM8s)\n\nThe video quality of the podcasts of TFATK, Theo Von, and JRE are my point of reference. I assume their equipment is at a professional level. I'm hoping we can something close though... maybe for $500-$1000 (per camera).\n\nMany people have recommended using DSLRs for lens flexibility, but these have the 30min limit. Should i use a camcorder? will a camcorder give us the ability to have a low depth of field (blurred background effect)?\n\nmany thanks!", "link": "https://www.reddit.com/r/Cameras/comments/fexxhv/camcorder_or_dslr_recommendation_for_interviewing/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "camcorder (or dslr) recommendation for interviewing (+3o min) /!/ any recommendations for a good video camera for interviewing?\n\nwe use two canon hf r80s right now and they don't seem to be cutting it. we shoot and export at 1080p, but the quality is always a bit fuzzy and when we have three people the frame the camera goes blurry because of the autofocus.\n\ninterview length: our chats last at least 1.5 hrs and often go longer without breaks.\n\nlighting: we record in multiple -----> locations !!!  so we don't always have full control over lighting, but typically our lighting setup is: the room light + a [fovitec](https://www.amazon.com/gp/product/b00v7v02yk/ref=ppx_yo_dt_b_search_asin_title?ie=utf8&amp;psc=1) studio light (we use one light per person... soo 525 watts per camera). we'd like to not resolve the video quality issues with more lighting anyways, since what we have currently already gives one of hosts headaches after. so i'm hoping a better camera setup will help get quality footage even in these cases. but, let me know if this lighting is truly what we need to change to fix our issues.\n\nhere's some reference footage:\n\n[https://www.youtube.com/watch?v=qrua1hhdx-i&amp;list=plsgeciocai-dk0ksucsna2iq0oskhmvtt&amp;index=4](https://www.youtube.com/watch?v=qrua1hhdx-i&amp;list=plsgeciocai-dk0ksucsna2iq0oskhmvtt&amp;index=4)\n\n[https://youtu.be/fh-6xdvgm8s](https://youtu.be/fh-6xdvgm8s)\n\nthe video quality of the podcasts of tfatk, theo von, and jre are my point of reference. i assume their equipment is at a professional level. i'm hoping we can something close though... maybe for $500-$1000 (per camera).\n\nmany people have recommended using dslrs for lens flexibility, but these have the 30min limit. should i use a camcorder? will a camcorder give us the ability to have a low depth of field (blurred background effect)?\n\nmany thanks!", "sortedWord": "None", "identifyer": 2740, "year": "2020"}, {"Unnamed: 0": 209396, "autor": "REVOL7", "date": 1588697441000, "content": "Help to recommend camera for timelapse/photography /!/ Hi everyone, hopefully this is the right place to post for advice and help on camera recommendations.\n\nA little background info: I work as a project supervisor for retail store construction and I'm in charge of the social media as we are currently still a small team. I would like to record the different aspects of what we do during the entire construction process, relevant location/scenery shots of the city wherever the project is and various lifestyle/architecture design.\n\nI have no experience in photography outside of your typical phone camera (not even iphone btw) &amp; instagram/VSCO filtering app. Here are the following points to note:\n\n1. able to take a timelapse of a segment of the construction work (eg. paint job of a wall, installation of certain facets) the process may last up to quite a couple of hours (&gt;6hrs)\n2. able to take a wide angle photo image of the store / scenery / architecture\n3. able to work well under low light conditions\n4. not too sophisticated technically and component-wise as i'm unlikely to have the time to delve into the technicality of photography\n5. compactibility; not too bulky as I travel between countries and cities very often\n6. image must obviously be of great quality, sharp enough for digital/print media\n7. please recommend the type of accessories i may require to go along as well (tripods etc)\n8. budget-wise including accessories, probably up to 1.5k USD. may be able to stretch it further depending.\n\nPlease recommend the type/model of cameras that would be suitable to my needs. If there isn't a single type of camera that is suitable, please advise on the camera combo etc that will address my requirements.\n\nThank you very much in advance for reading up to this point, I appreciate any kind of advice anyone can provide. I apologise once again if this is not the right sub to post this. Stay safe!", "link": "https://www.reddit.com/r/Cameras/comments/ge1d9a/help_to_recommend_camera_for_timelapsephotography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help to recommend camera for timelapse/photography /!/ hi everyone, hopefully this is the right place to post for advice and help on camera recommendations.\n\na little background info: i work as a project supervisor for retail store construction and i'm in charge of the social media as we are currently still a small team. i would like to record the different aspects of what we do during the entire construction process, relevant -----> location !!! /scenery shots of the city wherever the project is and various lifestyle/architecture design.\n\ni have no experience in photography outside of your typical phone camera (not even iphone btw) &amp; instagram/vsco filtering app. here are the following points to note:\n\n1. able to take a timelapse of a segment of the construction work (eg. paint job of a wall, installation of certain facets) the process may last up to quite a couple of hours (&gt;6hrs)\n2. able to take a wide angle photo image of the store / scenery / architecture\n3. able to work well under low light conditions\n4. not too sophisticated technically and component-wise as i'm unlikely to have the time to delve into the technicality of photography\n5. compactibility; not too bulky as i travel between countries and cities very often\n6. image must obviously be of great quality, sharp enough for digital/print media\n7. please recommend the type of accessories i may require to go along as well (tripods etc)\n8. budget-wise including accessories, probably up to 1.5k usd. may be able to stretch it further depending.\n\nplease recommend the type/model of cameras that would be suitable to my needs. if there isn't a single type of camera that is suitable, please advise on the camera combo etc that will address my requirements.\n\nthank you very much in advance for reading up to this point, i appreciate any kind of advice anyone can provide. i apologise once again if this is not the right sub to post this. stay safe!", "sortedWord": "None", "identifyer": 3106, "year": "2020"}, {"Unnamed: 0": 210396, "autor": "touret789", "date": 1596220183000, "content": "Need a new camera! /!/ I need a new camera, what are your suggestions? I'd like a full frame, capable of 4K video, which lenses? My budget is $2-4k. I would mainly use it for studio, on location at the beach. Telephoto is a must as an option lense.", "link": "https://www.reddit.com/r/Cameras/comments/i1cs9e/need_a_new_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "need a new camera! /!/ i need a new camera, what are your suggestions? i'd like a full frame, capable of 4k video, which lenses? my budget is $2-4k. i would mainly use it for studio, on -----> location !!!  at the beach. telephoto is a must as an option lense.", "sortedWord": "None", "identifyer": 4185, "year": "2020"}, {"Unnamed: 0": 211179, "autor": "italianopeperoni", "date": 1583335873000, "content": "Need CCTV cameras powered by a battery. /!/ Does anyone know any good spy/cctv cameras that last around a week or two and are powered with batteries/wifi? I need to observe a certain location from quite far, around 5 miles. I want the camera to record in like 480p, so that it lasts longer. I want to be able to see the recording on my computer which is like 5 miles away.", "link": "https://www.reddit.com/r/Cameras/comments/fdemle/need_cctv_cameras_powered_by_a_battery/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "need cctv cameras powered by a battery. /!/ does anyone know any good spy/cctv cameras that last around a week or two and are powered with batteries/wifi? i need to observe a certain -----> location !!!  from quite far, around 5 miles. i want the camera to record in like 480p, so that it lasts longer. i want to be able to see the recording on my computer which is like 5 miles away.", "sortedWord": "None", "identifyer": 5003, "year": "2020"}, {"Unnamed: 0": 212782, "autor": "mybutterisclean", "date": 1603242507000, "content": "Best compact camera with insanely long battery while filming /!/ Hello!\nThis is probably the wrong subreddit and I am sorry.\nI am moving to Germany in 6 months and this trip involves an 8 hour flight in which I will be bringing my dog. I am extremely protective of her and she will be towed away in a \"premium\" pet safe location in the plane. \n\nNow, I am protective and am very worried about this flight with her. She is a young dog so I know she will survive the journey, but reading all the horror stories with pets and flights has me a bit scared.\n\nSo this is where this subreddit comes in.\nI am thinking about installing a small security camera in her crate.\nIt has to be fairly discreet, but able to film fairly low res video for up to 9 hours.\n\nI dont believe something like this exists, but I am believe I can get away with it with some sort of game-cam. Something that only activates with motion.\n\nIf you have any ideas, great.\n\nThank you for your time!", "link": "https://www.reddit.com/r/Cameras/comments/jf31rm/best_compact_camera_with_insanely_long_battery/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "best compact camera with insanely long battery while filming /!/ hello!\nthis is probably the wrong subreddit and i am sorry.\ni am moving to germany in 6 months and this trip involves an 8 hour flight in which i will be bringing my dog. i am extremely protective of her and she will be towed away in a \"premium\" pet safe -----> location !!!  in the plane. \n\nnow, i am protective and am very worried about this flight with her. she is a young dog so i know she will survive the journey, but reading all the horror stories with pets and flights has me a bit scared.\n\nso this is where this subreddit comes in.\ni am thinking about installing a small security camera in her crate.\nit has to be fairly discreet, but able to film fairly low res video for up to 9 hours.\n\ni dont believe something like this exists, but i am believe i can get away with it with some sort of game-cam. something that only activates with motion.\n\nif you have any ideas, great.\n\nthank you for your time!", "sortedWord": "None", "identifyer": 6875, "year": "2020"}, {"Unnamed: 0": 213826, "autor": "Agent_441", "date": 1595989453000, "content": "I need help shipping spare rechargeable lithium ion battery for Nikon camera...internationally /!/  \n\nOk  so I am having a really hard time trying to figure out how one could    possibly buy spare batteries. I live in Bermuda so middle of nowhere   and  stores bring in what sells quick. So how can I buy a preferably   Nikon  battery from a international online store. Amazon and B&amp;H   have been  unsuccessful and the thought of having to buy another camera   just to  ship a battery is crazy cause aviation rules say must come  with  device.  Is their a company that sells this type of stuff and is   dangerous goods  certified so that a courier can ship it? I find it   ridiculous amazon  would not have a special department that is certified   in shipping things  most people use i.e batteries etc Has anyone else   who is in a  international location that faced these type of issues?", "link": "https://www.reddit.com/r/Cameras/comments/hzsbng/i_need_help_shipping_spare_rechargeable_lithium/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i need help shipping spare rechargeable lithium ion battery for nikon camera...internationally /!/  \n\nok  so i am having a really hard time trying to figure out how one could    possibly buy spare batteries. i live in bermuda so middle of nowhere   and  stores bring in what sells quick. so how can i buy a preferably   nikon  battery from a international online store. amazon and b&amp;h   have been  unsuccessful and the thought of having to buy another camera   just to  ship a battery is crazy cause aviation rules say must come  with  device.  is their a company that sells this type of stuff and is   dangerous goods  certified so that a courier can ship it? i find it   ridiculous amazon  would not have a special department that is certified   in shipping things  most people use i.e batteries etc has anyone else   who is in a  international -----> location !!!  that faced these type of issues?", "sortedWord": "None", "identifyer": 7983, "year": "2020"}, {"Unnamed: 0": 215037, "autor": "naim519", "date": 1598215095000, "content": "Canon RP or R6 for my needs. Please advise. /!/ I'm sure there are bunch of questions on this already. But I haven't seen one that describes my use case and currently situation. Here goes.\n\nCurrently I own Canon T5i with kit lens, 10-18mm f4.5 wide angle, and the 50mm f1.8. I've rented the EF 16-35mm f2.8 and the 70-200mm f2.8 and loved it. I'm primarily interested in landscape, travel photography, astrophotography with occasional need for food photography. Don't care for portraits, still life, or anything else. \n\nI'm currently looking to buy this new set up:\nEOS RP, and the RF 70-200mm f2.8. I don't think I need the RF 15-35mm yet, as I can wait. I can use my 10-18mm in the meantime.\n\nThis is where I need help and advice. Should I just get the R6 instead of the RP? I'm a hobbyist photography and not doing this professionally. I'm not really concerned about printing any of my photos yet since I'm still learning. But I don't want to be limited by crappy dynamic range of RP as I learn. If I travel to a scenic location where I have limited time to capture what I want, I want to have all the specs of a camera guide me instead of limiting me. I won't be coming back to that exact location in the future so it's the only chance I have to take a good photo. So why save money on the RP? Why not also future proof myself and get the R6? But at the same time, I don't want to end up with a set up that's overpowered for my needs. Please help. Thanks.", "link": "https://www.reddit.com/r/Cameras/comments/ifarsr/canon_rp_or_r6_for_my_needs_please_advise/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon rp or r6 for my needs. please advise. /!/ i'm sure there are bunch of questions on this already. but i haven't seen one that describes my use case and currently situation. here goes.\n\ncurrently i own canon t5i with kit lens, 10-18mm f4.5 wide angle, and the 50mm f1.8. i've rented the ef 16-35mm f2.8 and the 70-200mm f2.8 and loved it. i'm primarily interested in landscape, travel photography, astrophotography with occasional need for food photography. don't care for portraits, still life, or anything else. \n\ni'm currently looking to buy this new set up:\neos rp, and the rf 70-200mm f2.8. i don't think i need the rf 15-35mm yet, as i can wait. i can use my 10-18mm in the meantime.\n\nthis is where i need help and advice. should i just get the r6 instead of the rp? i'm a hobbyist photography and not doing this professionally. i'm not really concerned about printing any of my photos yet since i'm still learning. but i don't want to be limited by crappy dynamic range of rp as i learn. if i travel to a scenic -----> location !!!  where i have limited time to capture what i want, i want to have all the specs of a camera guide me instead of limiting me. i won't be coming back to that exact location in the future so it's the only chance i have to take a good photo. so why save money on the rp? why not also future proof myself and get the r6? but at the same time, i don't want to end up with a set up that's overpowered for my needs. please help. thanks.", "sortedWord": "None", "identifyer": 9339, "year": "2020"}, {"Unnamed: 0": 215054, "autor": "justinitforthesnacks", "date": 1598155229000, "content": "Can the (Canon EOS 90D) do what I need it to? /!/ Hey everyone,\n\nQuestion for the subreddit.\n\nI am a professional writer and blogger with a focus on travel and wine, particularly in places that are a bit more off the beaten path. Many of the traditional wine writers (and the few publications that still pay) focus on the known locations which makes getting a photographer involved pretty easy. But when it comes to harder to tell stories in out of the way locations I'd like to be able to offer photography.\n\nI know that print-worthy means a lot of things to a lot of people, but for me, it means that I'd like to be able to grab raw files that could be used in indie magazines, possibly newspapers, or second tier-glossy magazines (and online but that's easy). Bigger publications that I've worked with *always* provide photographers, so this is for some moonshot articles that are more passion projects. It also wouldn't hurt to start adding more professional photography and video to my blog / social properties.\n\nMy Needs:\n\n* Landscapes (vineyards and restaurant exteriors).\n* Portraits of winemakers in the winery, sommeliers in restaurants, and occasional shooting in the cellar which can be low light.\n* Occasional bottle / wine glass shots (but these will always veer towards lifestyle as opposed to product shots.\n\nCan I capture these types of photos in any semi-professional (and even publication-worthy) quality short of a full-frame camera? I've owned canons in the past but haven't shot anything in the past few years. I've been looking at Canon EOS 90D. The mp seem a bit artificially inflated, but some of the images and reviews I've seen look pretty alright. Would the downfall be low-light here? Could this camera capture publication-worthy raw photos? I'm familiar with lightroom and the recent updates make it easier than ever to edit, so not worried on that front.\n\nMy timeline:\n\nWith COVID quarantine in place my travels have all been pushed to 2021, so there's no rush to buy. I'm trying to use this as a time to research, brush up on some technical wine vocab in languages from regions I plan on visiting, contacting wineries and tourism boards, and working on other writing.\n\nAny tips on purchasing for the best price? Lenses? Will it be obsolete by the time I buy it? Do I really have to pony up for 5d to get the type of photo I need? Should I be looking at another camera altogether?\n\nThanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/iewox8/can_the_canon_eos_90d_do_what_i_need_it_to/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "can the (canon eos 90d) do what i need it to? /!/ hey everyone,\n\nquestion for the subreddit.\n\ni am a professional writer and blogger with a focus on travel and wine, particularly in places that are a bit more off the beaten path. many of the traditional wine writers (and the few publications that still pay) focus on the known -----> locations !!!  which makes getting a photographer involved pretty easy. but when it comes to harder to tell stories in out of the way locations i'd like to be able to offer photography.\n\ni know that print-worthy means a lot of things to a lot of people, but for me, it means that i'd like to be able to grab raw files that could be used in indie magazines, possibly newspapers, or second tier-glossy magazines (and online but that's easy). bigger publications that i've worked with *always* provide photographers, so this is for some moonshot articles that are more passion projects. it also wouldn't hurt to start adding more professional photography and video to my blog / social properties.\n\nmy needs:\n\n* landscapes (vineyards and restaurant exteriors).\n* portraits of winemakers in the winery, sommeliers in restaurants, and occasional shooting in the cellar which can be low light.\n* occasional bottle / wine glass shots (but these will always veer towards lifestyle as opposed to product shots.\n\ncan i capture these types of photos in any semi-professional (and even publication-worthy) quality short of a full-frame camera? i've owned canons in the past but haven't shot anything in the past few years. i've been looking at canon eos 90d. the mp seem a bit artificially inflated, but some of the images and reviews i've seen look pretty alright. would the downfall be low-light here? could this camera capture publication-worthy raw photos? i'm familiar with lightroom and the recent updates make it easier than ever to edit, so not worried on that front.\n\nmy timeline:\n\nwith covid quarantine in place my travels have all been pushed to 2021, so there's no rush to buy. i'm trying to use this as a time to research, brush up on some technical wine vocab in languages from regions i plan on visiting, contacting wineries and tourism boards, and working on other writing.\n\nany tips on purchasing for the best price? lenses? will it be obsolete by the time i buy it? do i really have to pony up for 5d to get the type of photo i need? should i be looking at another camera altogether?\n\nthanks in advance!", "sortedWord": "None", "identifyer": 9359, "year": "2020"}, {"Unnamed: 0": 215055, "autor": "justinitforthesnacks", "date": 1598155070000, "content": "Need some confirmation on a camera choice and maybe a lens recommendation /!/ Hey everyone, \n\nQuestion for the subreddit. \n\nI am a professional writer and blogger with a focus on travel and wine, particularly in places that are a bit more off the beaten path. Many of the traditional wine writers (and the few publications that still pay) focus on the known locations which makes getting a photographer involved pretty easy. But when it comes to harder to tell stories in out of the way locations I'd like to be able to offer photography. \n\nI know that print-worthy means a lot of things to a lot of people, but for me it means that I'd like to be able to grab raw files that could be used in indie magazines, possibly newspapers, or second tier-glossy magazines (and online but that's easy). Bigger publications that I've worked with *always* provide photographers, so this is for some moonshot articles that are more passion projects. It also wouldn't hurt to start adding more professional photography and video to my blog / social properties. \n\nMy Needs: \n\n* Landscapes (vineyards and restaurant exteriors).\n* Portraits of winemakers in the winery, sommeliers in restaurants, and occasional shooting in the cellar which can be low light.\n* Occasional bottle / wine glass shots (but these will always veer towards lifestyle as opposed to product shots. \n\nCan I capture these types of photos in any semi-professional (and even publication-worthy) quality short of a full-frame camera? I've owned canons in the past but haven't shot anything in the past few years. **I've been looking at Canon EOS 90D**. The mp seem a bit artificially inflated, but some of the images and reviews I've seen look pretty alright. Would the downfall be low-light here? Could this camera capture publication-worthy raw photos? I'm familiar with lightroom and the recent updates make it easier than ever to edit, so not worried on that front.  \n\nMy timeline:\n\nWith COVID quarantine in place my travels have all been pushed to 2021, so there's no rush to buy. I'm trying to use this as a time to research, brush up on some technical wine vocab in languages from regions I plan on visiting, contacting wineries and tourism boards, and working on other writing. \n\nAny tips on purchasing for the best price? Lenses? Will it be obsolete by the time I buy it? Do I really have to pony up for 5d to get the type of photo I need? Should I be looking at another camera altogether? \n\nThanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/iewnmy/need_some_confirmation_on_a_camera_choice_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "need some confirmation on a camera choice and maybe a lens recommendation /!/ hey everyone, \n\nquestion for the subreddit. \n\ni am a professional writer and blogger with a focus on travel and wine, particularly in places that are a bit more off the beaten path. many of the traditional wine writers (and the few publications that still pay) focus on the known -----> locations !!!  which makes getting a photographer involved pretty easy. but when it comes to harder to tell stories in out of the way locations i'd like to be able to offer photography. \n\ni know that print-worthy means a lot of things to a lot of people, but for me it means that i'd like to be able to grab raw files that could be used in indie magazines, possibly newspapers, or second tier-glossy magazines (and online but that's easy). bigger publications that i've worked with *always* provide photographers, so this is for some moonshot articles that are more passion projects. it also wouldn't hurt to start adding more professional photography and video to my blog / social properties. \n\nmy needs: \n\n* landscapes (vineyards and restaurant exteriors).\n* portraits of winemakers in the winery, sommeliers in restaurants, and occasional shooting in the cellar which can be low light.\n* occasional bottle / wine glass shots (but these will always veer towards lifestyle as opposed to product shots. \n\ncan i capture these types of photos in any semi-professional (and even publication-worthy) quality short of a full-frame camera? i've owned canons in the past but haven't shot anything in the past few years. **i've been looking at canon eos 90d**. the mp seem a bit artificially inflated, but some of the images and reviews i've seen look pretty alright. would the downfall be low-light here? could this camera capture publication-worthy raw photos? i'm familiar with lightroom and the recent updates make it easier than ever to edit, so not worried on that front.  \n\nmy timeline:\n\nwith covid quarantine in place my travels have all been pushed to 2021, so there's no rush to buy. i'm trying to use this as a time to research, brush up on some technical wine vocab in languages from regions i plan on visiting, contacting wineries and tourism boards, and working on other writing. \n\nany tips on purchasing for the best price? lenses? will it be obsolete by the time i buy it? do i really have to pony up for 5d to get the type of photo i need? should i be looking at another camera altogether? \n\nthanks in advance!", "sortedWord": "None", "identifyer": 9360, "year": "2020"}], "name": "locationCameras2020"}