{"interestingcomments": [{"Unnamed: 0": 224042, "autor": "895501", "date": 1613165290000, "content": "Can anyone identify the type of camera in this video? /!/ The person who filed this theorized that it was a thermal imaging camera used to \"map\" the interior of his house. Whether a type of camera that can even do this, I am not sure. Any experts able to identify the camera seen in the video? Specifically the camera rig seen inside the van. Thanks", "link": "https://www.reddit.com/r/Cameras/comments/lil897/can_anyone_identify_the_type_of_camera_in_this/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "can anyone identify the type of camera in this video? /!/ the person who filed this theorized that it was a thermal imaging camera used to \"-----> map !!! \" the interior of his house. whether a type of camera that can even do this, i am not sure. any experts able to identify the camera seen in the video? specifically the camera rig seen inside the van. thanks", "sortedWord": "None", "identifyer": 18721, "year": "2021"}, {"Unnamed: 0": 226548, "autor": "SalmonSnail", "date": 1632054408000, "content": "I would love to do camera repairs, and I hear there's a shortage of technicians. But how do I find these people? Where are they? /!/ You type in 'camera repair' in google maps or google search and you really don't find much. So I guess there really is a shortage. Oof.\n\nI'm also really kinda nervous because i'm so SO new to photography but i've been consuming knowledge on how they work since I first picked up a camera... which was like 4 months ago. Yeah, very new. Much to learn.\n\nI can absolutely work for free or maybe idk they can pay me in Velvia 50 LMAO. No really i'm so excited to learn everything I can about how to problem solve a sticky lever and I can't wait to use those tiny screwdrivers!\n\nPlease don't try to say not to do it. I'm really just wondering where to find some really knowledgeable people who do what they do REALLY WELL. Also wondering how to contact them? Is email not formal enough? Just cold call the guys?\n\nThanks! For what its worth im in NY metro.", "link": "https://www.reddit.com/r/Cameras/comments/pr6zya/i_would_love_to_do_camera_repairs_and_i_hear/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "i would love to do camera repairs, and i hear there's a shortage of technicians. but how do i find these people? where are they? /!/ you type in 'camera repair' in -----> google !!!  -----> maps !!!  or -----> google !!!  search and you really don't find much. so i guess there really is a shortage. oof.\n\ni'm also really kinda nervous because i'm so so new to photography but i've been consuming knowledge on how they work since i first picked up a camera... which was like 4 months ago. yeah, very new. much to learn.\n\ni can absolutely work for free or maybe idk they can pay me in velvia 50 lmao. no really i'm so excited to learn everything i can about how to problem solve a sticky lever and i can't wait to use those tiny screwdrivers!\n\nplease don't try to say not to do it. i'm really just wondering where to find some really knowledgeable people who do what they do really well. also wondering how to contact them? is email not formal enough? just cold call the guys?\n\nthanks! for what its worth im in ny metro.", "sortedWord": "None", "identifyer": 21337, "year": "2021"}, {"Unnamed: 0": 227587, "autor": "ponyboarder", "date": 1620018902000, "content": "Sony a7riii kit vs Om-d E-m1x/m1 iii kit, What to do? /!/ Hello everyone! \n\nIve been shooting since I was about 6, and rarely upgrade my gear untill I feel too limited by what I have. \n\nCameras Ive used are: Nikon n6006, n8008, Eos Elans etc, old .3mp cams, etc. \n\nDigital SLR wise I shot with a Canon 10d for about a decade, bought an olympus om-d e-m5 with manual glass for fun, Nikon N95 for reasons, eventually getting a first gen Sony A7. I also have a samsung nx300m, but thats more for video.\n\n&amp;#x200B;\n\nSo long and short: I mostly shoot Landscapes, Portraits, some Macro for floral and small objects, as well as some HDR style and long exposure. Not a big video guy, as I prefer to take a shot and enjoy the moment over outright recording. I want good burst and AF, as well some flexibility and the ability to save decent jpegs. (prefer RAW, but sometimes jpeg is necessary for speed)\n\n&amp;#x200B;\n\nI recently gave a bunch of my kit to the local Village PR guy so I feel more compelled to move on, leaving me only the sony 24-240, kamlan 50 1.1, a ton of old canon glass (50mm 1.4, 135 2.5, etc).\n\nHere is the kit to compare:\n\n&amp;#x200B;\n\nA7riii \n\n\\+Tamron 28-70 2.8\n\n\\+Tamron 70-300 4.5-6.3\n\nTOTAL COST: 2851.02 USD\n\n&amp;#x200B;\n\nOm-d e-m1x \n\n\\+Olympus 12-40 2.8 Pro\n\n\\+Olympus 40-150 2.8 Pro\n\nTOTAL COST: 2997.03 USD\n\n&amp;#x200B;\n\nOm-d E-m1 iii\n\n\\+Olympus 12-40 2.8 Pro\n\n\\+Olympus 40-150 2.8 Pro\n\nTOTAL COST: 2861.97\n\n&amp;#x200B;\n\nReasons these two are here is, great range of good glass for AF, and the ability to adapt. Olympus Hirez mode solves resolution issues of most my landscapes or items Id want more detail (static) while having slightly getter range and more balanced light setup. Sony a7riii gives me enough burst, with great resolution, new colour science, third gen upgrades (battery etc). \n\nOpen to other suggestions, ill be using Map Camera Japan for purchase (located in Japan), so prices are USD equivilent.", "link": "https://www.reddit.com/r/Cameras/comments/n3ojb6/sony_a7riii_kit_vs_omd_em1xm1_iii_kit_what_to_do/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "sony a7riii kit vs om-d e-m1x/m1 iii kit, what to do? /!/ hello everyone! \n\nive been shooting since i was about 6, and rarely upgrade my gear untill i feel too limited by what i have. \n\ncameras ive used are: nikon n6006, n8008, eos elans etc, old .3mp cams, etc. \n\ndigital slr wise i shot with a canon 10d for about a decade, bought an olympus om-d e-m5 with manual glass for fun, nikon n95 for reasons, eventually getting a first gen sony a7. i also have a samsung nx300m, but thats more for video.\n\n&amp;#x200b;\n\nso long and short: i mostly shoot landscapes, portraits, some macro for floral and small objects, as well as some hdr style and long exposure. not a big video guy, as i prefer to take a shot and enjoy the moment over outright recording. i want good burst and af, as well some flexibility and the ability to save decent jpegs. (prefer raw, but sometimes jpeg is necessary for speed)\n\n&amp;#x200b;\n\ni recently gave a bunch of my kit to the local village pr guy so i feel more compelled to move on, leaving me only the sony 24-240, kamlan 50 1.1, a ton of old canon glass (50mm 1.4, 135 2.5, etc).\n\nhere is the kit to compare:\n\n&amp;#x200b;\n\na7riii \n\n\\+tamron 28-70 2.8\n\n\\+tamron 70-300 4.5-6.3\n\ntotal cost: 2851.02 usd\n\n&amp;#x200b;\n\nom-d e-m1x \n\n\\+olympus 12-40 2.8 pro\n\n\\+olympus 40-150 2.8 pro\n\ntotal cost: 2997.03 usd\n\n&amp;#x200b;\n\nom-d e-m1 iii\n\n\\+olympus 12-40 2.8 pro\n\n\\+olympus 40-150 2.8 pro\n\ntotal cost: 2861.97\n\n&amp;#x200b;\n\nreasons these two are here is, great range of good glass for af, and the ability to adapt. olympus hirez mode solves resolution issues of most my landscapes or items id want more detail (static) while having slightly getter range and more balanced light setup. sony a7riii gives me enough burst, with great resolution, new colour science, third gen upgrades (battery etc). \n\nopen to other suggestions, ill be using -----> map !!!  camera japan for purchase (located in japan), so prices are usd equivilent.", "sortedWord": "None", "identifyer": 22424, "year": "2021"}], "name": "mapCameras2021"}