{"interestingcomments": [{"Unnamed: 0": 179987, "autor": "Dentifrice", "date": 1528915654000, "content": "Camera for travel /!/ Hi,\n\nI've been using a D600 for a long time with my favorite lens : 24-70 f2.8.\n\nNow, when I travel, I'm REALLY tired of the size and weight of this gear and the backpack.\n\nI'm a amateur, I don't need professional gear but I don't want crappy quality neither.\n\nI understand I will not have the same quality but for travel, I accept that.\n\nSo I'm looking for a second camera for this and I'm totally lost.\n\nHere's some features I'd like to have\n\nSensor : APS-C (well, if there is a very good camera with a small one it's ok)\nDecent low light noise\nIf it's a fixed lens, zoom capability. Lens interchangeable is OK if lenses aren't too big. I plan to buy only one lens.\nI shoot 90% of my photos between 24 and 70mm\nHas a viewfinder\nPossibility to plug an external flash or you can change the orientation of the integrated flash\nHybrid/bridge/mirrorless (or really good point-and-shoot)\nManual controls (as least be able to blur the background when shooting for decent sensor size and fast lens)\nI don't care about the brand.\n\nI though about the Sony A6000 with kit lens (faster lenses are expensive...)\n\nany idea ? Canon ? Fuji ? Olympus ?\n\nthanks", "link": "https://www.reddit.com/r/Cameras/comments/8quxm2/camera_for_travel/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "camera for travel /!/ hi,\n\ni've been using a d600 for a long time with my favorite lens : 24-70 f2.8.\n\nnow, when i travel, i'm really tired of the size and weight of this gear and the backpack.\n\ni'm a amateur, i don't need professional gear but i don't want crappy quality neither.\n\ni understand i will not have the same quality but for travel, i accept that.\n\nso i'm looking for a second camera for this and i'm totally lost.\n\nhere's some features i'd like to have\n\nsensor : aps-c (well, if there is a very good camera with a small one it's ok)\ndecent low light noise\nif it's a fixed lens, zoom capability. lens interchangeable is ok if lenses aren't too big. i plan to buy only one lens.\ni shoot 90% of my photos between 24 and 70mm\nhas a viewfinder\npossibility to plug an external flash or you can change the -----> orientation !!!  of the integrated flash\nhybrid/bridge/mirrorless (or really good point-and-shoot)\nmanual controls (as least be able to blur the background when shooting for decent sensor size and fast lens)\ni don't care about the brand.\n\ni though about the sony a6000 with kit lens (faster lenses are expensive...)\n\nany idea ? canon ? fuji ? olympus ?\n\nthanks", "sortedWord": "None", "identifyer": 72455, "year": "2018"}], "name": "orientationCameras2018"}