{"interestingcomments": [{"Unnamed: 0": 184207, "autor": "steeltoenail", "date": 1552391445000, "content": "RE: Looking to buy a new camera! /!/ Hey guys\n\nI currently own a Canon 6D + 24-105 f/4 lens (bought in 2017, my only piece of gear) and have been using it since. I have evolved as a photographer and now I find myself landing freelancing gigs.\n\nI have gone for the longest amount of time without ever buying a lens or new pieces of gear because I wanted to focus more on the art of photography rather than the technicalities of it and I didn't want to be in a position where I'd say \"Dammit, if only I had that lens to capture that shot\"\n\nBut right now, I find myself at a crossroads - to upgrade or to not (and buy new lenses of course)\n\nHere's what I usually shoot:\n\n* Urban/ street (photo)\n* Portraits (photo)\n* Timelapse and short montages (video)\n\n&amp;#x200B;\n\nAnd here's what I'll be doing at my gigs:\n\n* Covering events - photo and video\n* Shooting theatre - video only\n* Some portraits as well\n\n&amp;#x200B;\n\nI want your advice people - to upgrade or not. I have a budget of USD 3000 and am looking at FULL FRAME only and NO NIKON.\n\n&amp;#x200B;\n\nCheers lads, hope y'all come thru\n\n&amp;#x200B;\n\nx", "link": "https://www.reddit.com/r/Cameras/comments/b06vfb/re_looking_to_buy_a_new_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "re: looking to buy a new camera! /!/ hey guys\n\ni currently own a canon 6d + 24-105 f/4 lens (bought in 2017, my only piece of gear) and have been using it since. i have evolved as a photographer and now i find myself landing freelancing gigs.\n\ni have gone for the longest amount of time without ever buying a lens or new pieces of gear because i wanted to focus more on the art of photography rather than the technicalities of it and i didn't want to be in a -----> position !!!  where i'd say \"dammit, if only i had that lens to capture that shot\"\n\nbut right now, i find myself at a crossroads - to upgrade or to not (and buy new lenses of course)\n\nhere's what i usually shoot:\n\n* urban/ street (photo)\n* portraits (photo)\n* timelapse and short montages (video)\n\n&amp;#x200b;\n\nand here's what i'll be doing at my gigs:\n\n* covering events - photo and video\n* shooting theatre - video only\n* some portraits as well\n\n&amp;#x200b;\n\ni want your advice people - to upgrade or not. i have a budget of usd 3000 and am looking at full frame only and no nikon.\n\n&amp;#x200b;\n\ncheers lads, hope y'all come thru\n\n&amp;#x200b;\n\nx", "sortedWord": "None", "identifyer": 76761, "year": "2019"}, {"Unnamed: 0": 185299, "autor": "shitdashit", "date": 1551765988000, "content": "Advice on buying... should I go for an a6000? /!/ Right now, I only take pictures with my phone. Lately, I find myself thinking about what I'd like to shoot if I had something  more advanced.\n\n&amp;#x200B;\n\nI'm not especially interested in getting a fixed-lens p&amp;s, for several reasons including but not limited to the fact that I have a good feeling my cellphone will be surpassing it in the next few years.\n\n&amp;#x200B;\n\nI'd been coveting an Olympus Pen for the last several years, and now that I'm in a position to get one? I realize it has no freaking VF. So, that's out. I went to a store and looked at / fondled / test-shot with a few, and actually really liked the a6000. Now I just read an older post about the battery life being an issue.\n\nI do want something compact for travel. Is there anything besides the a6000 I should be considering; or, perhaps, a \"solution\" to the battery life issue?\n\n&amp;#x200B;\n\nI appreciate any real advice offered. Thank you.", "link": "https://www.reddit.com/r/Cameras/comments/axhrol/advice_on_buying_should_i_go_for_an_a6000/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice on buying... should i go for an a6000? /!/ right now, i only take pictures with my phone. lately, i find myself thinking about what i'd like to shoot if i had something  more advanced.\n\n&amp;#x200b;\n\ni'm not especially interested in getting a fixed-lens p&amp;s, for several reasons including but not limited to the fact that i have a good feeling my cellphone will be surpassing it in the next few years.\n\n&amp;#x200b;\n\ni'd been coveting an olympus pen for the last several years, and now that i'm in a -----> position !!!  to get one? i realize it has no freaking vf. so, that's out. i went to a store and looked at / fondled / test-shot with a few, and actually really liked the a6000. now i just read an older post about the battery life being an issue.\n\ni do want something compact for travel. is there anything besides the a6000 i should be considering; or, perhaps, a \"solution\" to the battery life issue?\n\n&amp;#x200b;\n\ni appreciate any real advice offered. thank you.", "sortedWord": "None", "identifyer": 77882, "year": "2019"}, {"Unnamed: 0": 185488, "autor": "derpherde", "date": 1548617538000, "content": "Lost (Stolen) Canon 6D, Lufthansa to blame /!/ Hey everyone. I guess I'm making this post because I'm frustrated in the system that exists that allowed for my camera to be stolen from me in a legal way. I'll try to keep it short.\n\nI took business class from Seattle to Frankfurt for my study abroad program (my dad used to work for an airline, thus the benefits), and tried to sleep the majority of the way. When I reclined my seat, I didn't think about my camera bag (which I had placed at my feet) being trapped under the seat when I returned my seat to its upright position. I woke up groggy in the morning, and got off the plane and onto the shuttle on the tarmac. Right as the shuttle started moving, I remembered I didn't have my bag with me, but the driver did not stop or let me off, and told me I had to go to Lufthansa lost and found. I arrived there about 20 minutes later, and waited for an hour with the service agents, who told me the cleaning crews would bring in all lost and found promptly at the end of their shift. The camera never arrived. I emailed them for 5 days, sent them the serial number, but still nothing. They have officially terminated my case, and are no longer looking for it. I know another passenger couldn't have seen it because it was under my reclined seat at the front of the plane where the agents stand, so it leaves me only to believe that a worker (engineer or cleaner) found it and kept it. Googling the matter has revealed others who believe this happened to their lost belongings as well.\n\nDo you guys have any advice as to what I can do to get it back or look for it? I'm a broke college student, and I put lots of money into it (Canon 6D w/ 24-70mm lens). I'm kicking myself because forgetting it for 5 minutes as I got off the plane ultimately led me to losing it, and someone else benefitting from my melatonin induced grogginess. I even put my phone number on the case that the camera was in, but I have received no calls. What do you guys think I should do?", "link": "https://www.reddit.com/r/Cameras/comments/akf3gp/lost_stolen_canon_6d_lufthansa_to_blame/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lost (stolen) canon 6d, lufthansa to blame /!/ hey everyone. i guess i'm making this post because i'm frustrated in the system that exists that allowed for my camera to be stolen from me in a legal way. i'll try to keep it short.\n\ni took business class from seattle to frankfurt for my study abroad program (my dad used to work for an airline, thus the benefits), and tried to sleep the majority of the way. when i reclined my seat, i didn't think about my camera bag (which i had placed at my feet) being trapped under the seat when i returned my seat to its upright -----> position !!! . i woke up groggy in the morning, and got off the plane and onto the shuttle on the tarmac. right as the shuttle started moving, i remembered i didn't have my bag with me, but the driver did not stop or let me off, and told me i had to go to lufthansa lost and found. i arrived there about 20 minutes later, and waited for an hour with the service agents, who told me the cleaning crews would bring in all lost and found promptly at the end of their shift. the camera never arrived. i emailed them for 5 days, sent them the serial number, but still nothing. they have officially terminated my case, and are no longer looking for it. i know another passenger couldn't have seen it because it was under my reclined seat at the front of the plane where the agents stand, so it leaves me only to believe that a worker (engineer or cleaner) found it and kept it. googling the matter has revealed others who believe this happened to their lost belongings as well.\n\ndo you guys have any advice as to what i can do to get it back or look for it? i'm a broke college student, and i put lots of money into it (canon 6d w/ 24-70mm lens). i'm kicking myself because forgetting it for 5 minutes as i got off the plane ultimately led me to losing it, and someone else benefitting from my melatonin induced grogginess. i even put my phone number on the case that the camera was in, but i have received no calls. what do you guys think i should do?", "sortedWord": "None", "identifyer": 78077, "year": "2019"}, {"Unnamed: 0": 185962, "autor": "lystellion", "date": 1561206703000, "content": "What camera body to pair with Canon MPE 65 macro lens? /!/ I'm in the weird position of having come into possession of a very good macro lens (Canon MPE 65) but having no camera body to go with it, or indeed any real experience with DSLR photography.  \n\n\nWhat kinds of camera body might I be able to pair with it? I think that it needs a 'full sensor' to get the best out of the lens?  \n\n\nI'd like to get into photography more, in particular outdoors photography, landscapes, that sort of thing. Happy to invest a lot to make the most of the lens.", "link": "https://www.reddit.com/r/Cameras/comments/c3p5uz/what_camera_body_to_pair_with_canon_mpe_65_macro/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what camera body to pair with canon mpe 65 macro lens? /!/ i'm in the weird -----> position !!!  of having come into possession of a very good macro lens (canon mpe 65) but having no camera body to go with it, or indeed any real experience with dslr photography.  \n\n\nwhat kinds of camera body might i be able to pair with it? i think that it needs a 'full sensor' to get the best out of the lens?  \n\n\ni'd like to get into photography more, in particular outdoors photography, landscapes, that sort of thing. happy to invest a lot to make the most of the lens.", "sortedWord": "None", "identifyer": 78560, "year": "2019"}, {"Unnamed: 0": 186216, "autor": "UncleSpoons", "date": 1564205415000, "content": "Sony a5000 and the dreaded \"Cannot recognize lens -please attach it properly\" error. /!/ Hey!\n\nI'm out and about using the Sony a5000 as a travel camera. A few days ago I managed to drop the camera from a couple feet onto a dirt floor.\n\nWhen I turn the camera on, the lens extends about a centimeter, stops short of the fully extended ON position, then retracts back in. It usually attempts to fully extend a few times before giving up and displaying the error.\n\nIt's still very early on in the trip and I'm not in the sorts of countries where I can just buy a new lens, or get it repaired.\n\nI have tried every fix I can find on the internet, including vigorously shaking the lens, manually pulling the lens to the fully extended position, and messing with the settings.\n\nI would greatly appreciate any suggestions!", "link": "https://www.reddit.com/r/Cameras/comments/cido3e/sony_a5000_and_the_dreaded_cannot_recognize_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony a5000 and the dreaded \"cannot recognize lens -please attach it properly\" error. /!/ hey!\n\ni'm out and about using the sony a5000 as a travel camera. a few days ago i managed to drop the camera from a couple feet onto a dirt floor.\n\nwhen i turn the camera on, the lens extends about a centimeter, stops short of the fully extended on -----> position !!! , then retracts back in. it usually attempts to fully extend a few times before giving up and displaying the error.\n\nit's still very early on in the trip and i'm not in the sorts of countries where i can just buy a new lens, or get it repaired.\n\ni have tried every fix i can find on the internet, including vigorously shaking the lens, manually pulling the lens to the fully extended position, and messing with the settings.\n\ni would greatly appreciate any suggestions!", "sortedWord": "None", "identifyer": 78818, "year": "2019"}, {"Unnamed: 0": 186315, "autor": "crepuscopoli", "date": 1566029517000, "content": "Where could I position my camera to get this angle? /!/ Hi guys where do i position my camera to get this angle? \n\n[https://www.youtube.com/watch?v=wB0XtmLTMtI](https://www.youtube.com/watch?v=wB0XtmLTMtI) go to 9:22 for the angle i have mentioning.\n\nI really find difficult to record my drawing just because i do not draw flat on the table but i use a 30 or 20 grade vertical stand table top to not stay with my neck curved for hours.. But since i would like to record my process, how to i put the camera? Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/crjglb/where_could_i_position_my_camera_to_get_this_angle/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "where could i -----> position !!!  my camera to get this angle? /!/ hi guys where do i position my camera to get this angle? \n\n[https://www.youtube.com/watch?v=wb0xtmltmti](https://www.youtube.com/watch?v=wb0xtmltmti) go to 9:22 for the angle i have mentioning.\n\ni really find difficult to record my drawing just because i do not draw flat on the table but i use a 30 or 20 grade vertical stand table top to not stay with my neck curved for hours.. but since i would like to record my process, how to i put the camera? thanks!", "sortedWord": "None", "identifyer": 78919, "year": "2019"}, {"Unnamed: 0": 186386, "autor": "Mraebb", "date": 1567645820000, "content": "Need Some Advice between Sony a6000, Nikon d5600, and Fujifilm xt20 /!/ Hi, I'm so sorry it's another post from some newb who can't make a decision. \nI'm on a rather tight budget, and I'm looking for a general camera that's portable enough to take with me hiking/ backpacking, and on various travels and can take really nice stills of landscape, and maybe street art/ architecture/ portrait/ etc. \nAnyways, I've boiled my search down to either a Sony a6000 bundle with two lenses (16-50mm and 55-210mm) for $580, or a Nikon D5600 with 18-55mm lens for $340. Both of these are Craigslist ads as well. Obviously the D5600 seems like the clear winner, but I'm a little concerned it may be too large to carry everywhere. Additionally, I've been really interested in the Fujifilm xt20 but mannn new lenses are insanely expensive. \n\nIn my position what would you do? Any advice would be greatly appreciated.", "link": "https://www.reddit.com/r/Cameras/comments/cztuu4/need_some_advice_between_sony_a6000_nikon_d5600/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need some advice between sony a6000, nikon d5600, and fujifilm xt20 /!/ hi, i'm so sorry it's another post from some newb who can't make a decision. \ni'm on a rather tight budget, and i'm looking for a general camera that's portable enough to take with me hiking/ backpacking, and on various travels and can take really nice stills of landscape, and maybe street art/ architecture/ portrait/ etc. \nanyways, i've boiled my search down to either a sony a6000 bundle with two lenses (16-50mm and 55-210mm) for $580, or a nikon d5600 with 18-55mm lens for $340. both of these are craigslist ads as well. obviously the d5600 seems like the clear winner, but i'm a little concerned it may be too large to carry everywhere. additionally, i've been really interested in the fujifilm xt20 but mannn new lenses are insanely expensive. \n\nin my -----> position !!!  what would you do? any advice would be greatly appreciated.", "sortedWord": "None", "identifyer": 78992, "year": "2019"}, {"Unnamed: 0": 186656, "autor": "greenkomodo", "date": 1570530046000, "content": "Sony A6000 connector pin won't stay up? /!/ Just got on holiday and my camera doesn't work.\n\nLooking a the pins on the body, one seems lower than the others. This seems to cause my problem that the lens doesn't autofocus and I don't see F stop.\n\nI've made sure everything is clean and I tried to pull this pin up but it just goes back down to its position after putting the lens back on and removing it. It doesn't temporarily solve the issue either.", "link": "https://www.reddit.com/r/Cameras/comments/dey0sd/sony_a6000_connector_pin_wont_stay_up/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony a6000 connector pin won't stay up? /!/ just got on holiday and my camera doesn't work.\n\nlooking a the pins on the body, one seems lower than the others. this seems to cause my problem that the lens doesn't autofocus and i don't see f stop.\n\ni've made sure everything is clean and i tried to pull this pin up but it just goes back down to its -----> position !!!  after putting the lens back on and removing it. it doesn't temporarily solve the issue either.", "sortedWord": "None", "identifyer": 79273, "year": "2019"}, {"Unnamed: 0": 187165, "autor": "Bombofoto", "date": 1549993237000, "content": "2019 Stabil LSIII - L Plate (Bracket) for Sony A7RIII; A7III &amp; A9 - New Design /!/  \n\n# 2019 Stabil LSIII - Đế máy ảnh L Plate cho Sony A7RIII; A7III &amp; A9 - Thiết kế mới\n\n&amp;#x200B;\n\n![img](seo61moca6g21)\n\n&amp;#x200B;\n\n![video](undpvm0va6g21)\n\nStabil LSIII L plates are all custom designed for Sony A7RIII, A7III &amp; A9 camera body and precision machined from solid blocks of 6061-T6 aluminum. Stabil LSIII L plates feature precisely contoured anti-twist flanges for a perfect fit that prevents twisting between the camera and L plate with soft matterial. With its Arca-type compatible dovetail, it enables the camera to mount in a vertical or horizontal position.\n\n&amp;#x200B;\n\n![img](0yx97cega6g21)\n\nThe Stabil L plate LSIII does not block the LCD monitor from tilting, it easy access to the battery door as original design, a 1/4\"-20 mounting hole is located on the bottom and sensor centering lines are on the back, so the camera can be aligned on a tripod head.\n\n1. Custom fit with dedicated design for Sony A7RIII/ A7III/ A9 camera\n2. Made of aviation aluminum alloy which has been anodized Stable construct when change to vertical orientation\n3. Free moving monitor without remove L plate\n4. Vertical part can be slide out for more flexible connection\n5. Extra 1/4″ hole for extension equipment.\n6. Built-in Magnetic Allen Wrench Holder\n7. Compatible with other major manufacturers’ Arca-Swiss style and Cullmann clamps\n8. Stronger construction and anti scratch for Army version with Aviation Hard Anodized Aluminum Alloy processing\n\n&amp;#x200B;\n\n![img](3f4s66pja6g21)\n\n&amp;#x200B;\n\n![img](8w6enrxma6g21)\n\n&amp;#x200B;\n\n![img](ewtvv76oa6g21)\n\n&amp;#x200B;\n\n![img](5day7e7pa6g21)\n\n&amp;#x200B;\n\n![img](4kmtw0kra6g21)\n\n[https://youtu.be/Mvz-MLbcIeI](https://youtu.be/Mvz-MLbcIeI)\n\nSee more:  https://goo.gl/MszPTN ", "link": "https://www.reddit.com/r/Cameras/comments/apvx8g/2019_stabil_lsiii_l_plate_bracket_for_sony_a7riii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "2019 stabil lsiii - l plate (bracket) for sony a7riii; a7iii &amp; a9 - new design /!/  \n\n# 2019 stabil lsiii - đế máy ảnh l plate cho sony a7riii; a7iii &amp; a9 - thiết kế mới\n\n&amp;#x200b;\n\n![img](seo61moca6g21)\n\n&amp;#x200b;\n\n![video](undpvm0va6g21)\n\nstabil lsiii l plates are all custom designed for sony a7riii, a7iii &amp; a9 camera body and precision machined from solid blocks of 6061-t6 aluminum. stabil lsiii l plates feature precisely contoured anti-twist flanges for a perfect fit that prevents twisting between the camera and l plate with soft matterial. with its arca-type compatible dovetail, it enables the camera to mount in a vertical or horizontal -----> position !!! .\n\n&amp;#x200b;\n\n![img](0yx97cega6g21)\n\nthe stabil l plate lsiii does not block the lcd monitor from tilting, it easy access to the battery door as original design, a 1/4\"-20 mounting hole is located on the bottom and sensor centering lines are on the back, so the camera can be aligned on a tripod head.\n\n1. custom fit with dedicated design for sony a7riii/ a7iii/ a9 camera\n2. made of aviation aluminum alloy which has been anodized stable construct when change to vertical orientation\n3. free moving monitor without remove l plate\n4. vertical part can be slide out for more flexible connection\n5. extra 1/4″ hole for extension equipment.\n6. built-in magnetic allen wrench holder\n7. compatible with other major manufacturers’ arca-swiss style and cullmann clamps\n8. stronger construction and anti scratch for army version with aviation hard anodized aluminum alloy processing\n\n&amp;#x200b;\n\n![img](3f4s66pja6g21)\n\n&amp;#x200b;\n\n![img](8w6enrxma6g21)\n\n&amp;#x200b;\n\n![img](ewtvv76oa6g21)\n\n&amp;#x200b;\n\n![img](5day7e7pa6g21)\n\n&amp;#x200b;\n\n![img](4kmtw0kra6g21)\n\n[https://youtu.be/mvz-mlbciei](https://youtu.be/mvz-mlbciei)\n\nsee more:  https://goo.gl/mszptn ", "sortedWord": "None", "identifyer": 79796, "year": "2019"}, {"Unnamed: 0": 187836, "autor": "lurklark", "date": 1547956769000, "content": "Camera Damage Help (Nikon Coolpix p900) /!/ Hi all, \n\nI have a Nikon Coolpix p900 that I bought new in 2015. Today I went to turn my camera on and an error message came up: “Mode dial not in proper position.” \n\nThis has happened to me before when the mode dial was in between settings, but this time that wasn’t the case. I’ve turned it off and back on, removed the battery and reinserted it, tried changing modes, etc. the mode dial is properly aligned. \n\nAdditionally, while the camera displays this error message you can do nothing else with the camera, including reviewing pictures on the memory card. But when I leave the camera turned on displaying the error message, the camera will eventually enter “power-saving mode” and if I press the shutter button halfway down it will review the pictures on the memory card as if I had pressed the playback button. Exiting playback mode returns to the error message. \n\nI’m fearing this may be water damage but I’m unsure of how to proceed. Is there anything I can do myself or is this a repair shop job? OR is the thing toast? \nThere was  another minor issue before this happened. When I zoomed in on a subject, it would zoom a bit even after I released the zoom toggle. \n\nI’m a bit hesitant to send it to Nikon for a month or more for what could be a costly (or impossible) repair. Any suggestions? Thanks! ", "link": "https://www.reddit.com/r/Cameras/comments/ahtzgp/camera_damage_help_nikon_coolpix_p900/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera damage help (nikon coolpix p900) /!/ hi all, \n\ni have a nikon coolpix p900 that i bought new in 2015. today i went to turn my camera on and an error message came up: “mode dial not in proper -----> position !!! .” \n\nthis has happened to me before when the mode dial was in between settings, but this time that wasn’t the case. i’ve turned it off and back on, removed the battery and reinserted it, tried changing modes, etc. the mode dial is properly aligned. \n\nadditionally, while the camera displays this error message you can do nothing else with the camera, including reviewing pictures on the memory card. but when i leave the camera turned on displaying the error message, the camera will eventually enter “power-saving mode” and if i press the shutter button halfway down it will review the pictures on the memory card as if i had pressed the playback button. exiting playback mode returns to the error message. \n\ni’m fearing this may be water damage but i’m unsure of how to proceed. is there anything i can do myself or is this a repair shop job? or is the thing toast? \nthere was  another minor issue before this happened. when i zoomed in on a subject, it would zoom a bit even after i released the zoom toggle. \n\ni’m a bit hesitant to send it to nikon for a month or more for what could be a costly (or impossible) repair. any suggestions? thanks! ", "sortedWord": "None", "identifyer": 80490, "year": "2019"}, {"Unnamed: 0": 187853, "autor": "wpsty", "date": 1547859766000, "content": "New Camera? /!/ I’m in the very fortunate position where my initial photography work has led to me being able to work my way up through the sony alpha range (~3 years ago I bought my first interchangeable lens camera - sony A5000, now on A7iii). ~95% of my work is social media based, with my stills shooting being mostly portraiture and I also do some video work (hoping to increase this amount). I’m looking at possibly branching out into landscape and street photography, as I’ve developed a massive interest in the process and craft of photography, and I’m thinking of purchasing my first dslr. I’ve been very lucky in that my current work has put me in the position where I can afford a dslr in the rough range of a canon 1D mark 2. The reason that I mention the 1Dmk2 is that from the minute I bought my first camera, this was the camera that I had heard everyone rave about. However, I’ve as I’ve done more research I’ve come to a bit of a crossroads. The cameras that I’ve got in my crosshairs are the 1Dmk2, the Nikon D850, the 5Dm4 and the Fuji GFX-50S. I know that these cameras are all vastly different, and that the camera I currently have is an absolutely amazing piece of technology, however I really want to buy a camera that allows me to delve deeper into the actual art of photography but at the same time can be used as a professional tool for the work that I’ve been thrust into. This camera should be used as a hobby/tool camera, rather than my A7iii which I use solely as a tool. \n\nI know there are a million videos on YouTube describing the pros and cons of each camera, but I want some real life user feedback, and if possible some factors that have made you guys choose one or the other, and any small little details that you love or hate about any of the cameras mentioned. Also, if anyone else has any other cameras that they absolutely love, please drop a reply so I can consider those.\n\np.s. I’ve thought about renting each for a week and comparing in real life, but I can’t seem to find any good rental sites (UK), if anyone could point me in the right direction that would be very appreciated. Also, I have considered the possibility that this entire dilemma might just be me wanting what I don’t have or just having a new expensive “toy”, however I’ve been wanting a dslr for months now and I really like the idea of changing up my workflow and whole image-capturing process.\n\nTLDR:\nCan’t decide on a new camera, current favs are 1DX-II, 5D-IV, D850, GFX-50S. ", "link": "https://www.reddit.com/r/Cameras/comments/ahh79t/new_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new camera? /!/ i’m in the very fortunate -----> position !!!  where my initial photography work has led to me being able to work my way up through the sony alpha range (~3 years ago i bought my first interchangeable lens camera - sony a5000, now on a7iii). ~95% of my work is social media based, with my stills shooting being mostly portraiture and i also do some video work (hoping to increase this amount). i’m looking at possibly branching out into landscape and street photography, as i’ve developed a massive interest in the process and craft of photography, and i’m thinking of purchasing my first dslr. i’ve been very lucky in that my current work has put me in the position where i can afford a dslr in the rough range of a canon 1d mark 2. the reason that i mention the 1dmk2 is that from the minute i bought my first camera, this was the camera that i had heard everyone rave about. however, i’ve as i’ve done more research i’ve come to a bit of a crossroads. the cameras that i’ve got in my crosshairs are the 1dmk2, the nikon d850, the 5dm4 and the fuji gfx-50s. i know that these cameras are all vastly different, and that the camera i currently have is an absolutely amazing piece of technology, however i really want to buy a camera that allows me to delve deeper into the actual art of photography but at the same time can be used as a professional tool for the work that i’ve been thrust into. this camera should be used as a hobby/tool camera, rather than my a7iii which i use solely as a tool. \n\ni know there are a million videos on youtube describing the pros and cons of each camera, but i want some real life user feedback, and if possible some factors that have made you guys choose one or the other, and any small little details that you love or hate about any of the cameras mentioned. also, if anyone else has any other cameras that they absolutely love, please drop a reply so i can consider those.\n\np.s. i’ve thought about renting each for a week and comparing in real life, but i can’t seem to find any good rental sites (uk), if anyone could point me in the right direction that would be very appreciated. also, i have considered the possibility that this entire dilemma might just be me wanting what i don’t have or just having a new expensive “toy”, however i’ve been wanting a dslr for months now and i really like the idea of changing up my workflow and whole image-capturing process.\n\ntldr:\ncan’t decide on a new camera, current favs are 1dx-ii, 5d-iv, d850, gfx-50s. ", "sortedWord": "None", "identifyer": 80507, "year": "2019"}, {"Unnamed: 0": 188028, "autor": "golddiggergoose", "date": 1563870123000, "content": "DJI Ronin-SC vs Zhiyun Weebill Lab Comparison and In-depth Review /!/ After one year, DJI is releasing another professional gimbal product — Ronin-SC, which is only half the size and weight of Ronin-S. Comparing to the other competling 3-axis gimbal, Zhiyun, you may be wondering which is the better one to choose? I will proceed to compare these two products, listing their pros and cons. \n\n&amp;#x200B;\n\n First, product specs. \n\n **Ronin-SC vs Zhiyun Weebill Lab** \n\n&amp;#x200B;\n\nhttps://i.redd.it/6gspqufri0c31.png\n\n**1.Camera Compability**\n\nAlthough these two gimbals are quite similar, it’s worth mentioning that DJI’s Ronin-SC is compatible with a wider range of mirrorless cameras as you can see in above comparison form.\n\n**2. Payload**\n\nThere is also a slight difference in the payload of these 2 gimbals. The maximum payload of DJI Ronin-SC is up to 2kg. It is less than the 3kg payload as claimed by Zhiyun Weebill Lab, but as some of Zhiyun's users said only under the most ideal conditions can 3kg be achieved, and you'llhave to balance the gimabl perfectly to get the best performance out of it. And in this case, DJI is understating its payload a bit, it can actually go a little higher.\n\n**3. Object Tracking System**\n\nDJI Ronin-SC has revolutionized its tracking system in its latest **ActiveTrack 3.0**. Advanced algorithms is used to lock and track subjects. You can just mount your phone to your gimbal-mounted camera using the included phone holder, or you can use the Ronin App and your smartphone’s camera to select and track any object in your frame.\n\nOn the other hand, Zhiyun has actually launched their Object Tracking function in gimbals since its early products, but it's quite awkward that no visible development had been made to their Object Tracking function since launch. It's definitly not a selling point for Zhiyun.\n\n**4. Stability**\n\nI'll say if it's a DJI product, the last thing you need to worry about is their stabilization algorithm. DJI Ronin-SC's new **Sport Mode** has faster tracking speed and more advanced algotithm than Zhiyun's Phonego Mode. But actually these two products are both doing great job on stability, and they are almost equally matched in this industry.\n\n&amp;#x200B;\n\n**5. Underslung mode**\n\nBoth of Ronin-SC and Weebill Lab have underslung mode, but there's still some difference how these two machine work in underslung modes. With DJI Ronin-SC, you can just flip gimbal handle upside down, and then it's above your camera in vertical position. You can get ground-level low-angle with this. But with Weebill lab, when it's working in underslung mode, it won't turn left and right when flipped over. It's actually more comfortable to carry with a Weebill, but it's rather a knee- level shot rather than low angle.\n\n&amp;#x200B;\n\nUp to this point, I say it’s obvious that Ronin-SC is the superior product. And you can check out more detailed comparison video between these two products on Youtube. There are also some other key points about Ronin-SC I’d like to highlight:\n\n* Compatible Camera List\n\nAs most of you already know, the new Ronin SC is mainly compatible with mirrorless cameras, it's also suitable for professional level photographers now, and you can check if your camera is compatible with Ronin-SC in below list:\n\n&amp;#x200B;\n\nhttps://i.redd.it/4urc9hkyi0c31.png\n\n* **Quick Release and Easy-to-Setup**\n\nWhile DJI’s Ronin-S and Ronin-SC both have a detachable design that allows users to easily dissemble and transport, Ronin-SC offers even easier setup with its “positioning block”, which allows quick switch back to the previous position.\n\nIn addition, Ronin-SC has 2 locks for each axis that makes gimbal balancing much easier. While moving from one shooting spot to another, you can easily lock and unlock all the axes. It can save up a lot of time.\n\n* **Intelligent Functions**\n\n① ActiveTrack 3.0\n\nDJI has added a new intelligent function “ActiveTrack” into Ronin-SC. It’s used to select and track your subject during filming process super effectively. This is even better than Ronin-S’s SmoothTrack function. But this probably has pissed off some old DJI Ronin-S users as this function is not availble on Ronin-S yet.\n\n② ForceMobile\n\nThis function is definitely designed for professional users who want to have the most accurate control of frames, by allowing users to control Ronin-SC by simply moving their smartphones. It's totally like Freefly movie system. So for a small team shooting a video that involves complcated camera movements this feature could come in handy.\n\nLastly, the price of Ronin-SC is quite reasonable and competitive among all the gimbal products and plus DJI Ronin-SC is also covered by DJI Care Refresh plan. It is likely that Zhiyun will also drop in price before long, but as a big fan of DJI, truth is I will still pick Ronin-SC even if the price is becoming higher than WL...", "link": "https://www.reddit.com/r/Cameras/comments/cgpv0j/dji_roninsc_vs_zhiyun_weebill_lab_comparison_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "dji ronin-sc vs zhiyun weebill lab comparison and in-depth review /!/ after one year, dji is releasing another professional gimbal product — ronin-sc, which is only half the size and weight of ronin-s. comparing to the other competling 3-axis gimbal, zhiyun, you may be wondering which is the better one to choose? i will proceed to compare these two products, listing their pros and cons. \n\n&amp;#x200b;\n\n first, product specs. \n\n **ronin-sc vs zhiyun weebill lab** \n\n&amp;#x200b;\n\nhttps://i.redd.it/6gspqufri0c31.png\n\n**1.camera compability**\n\nalthough these two gimbals are quite similar, it’s worth mentioning that dji’s ronin-sc is compatible with a wider range of mirrorless cameras as you can see in above comparison form.\n\n**2. payload**\n\nthere is also a slight difference in the payload of these 2 gimbals. the maximum payload of dji ronin-sc is up to 2kg. it is less than the 3kg payload as claimed by zhiyun weebill lab, but as some of zhiyun's users said only under the most ideal conditions can 3kg be achieved, and you'llhave to balance the gimabl perfectly to get the best performance out of it. and in this case, dji is understating its payload a bit, it can actually go a little higher.\n\n**3. object tracking system**\n\ndji ronin-sc has revolutionized its tracking system in its latest **activetrack 3.0**. advanced algorithms is used to lock and track subjects. you can just mount your phone to your gimbal-mounted camera using the included phone holder, or you can use the ronin app and your smartphone’s camera to select and track any object in your frame.\n\non the other hand, zhiyun has actually launched their object tracking function in gimbals since its early products, but it's quite awkward that no visible development had been made to their object tracking function since launch. it's definitly not a selling point for zhiyun.\n\n**4. stability**\n\ni'll say if it's a dji product, the last thing you need to worry about is their stabilization algorithm. dji ronin-sc's new **sport mode** has faster tracking speed and more advanced algotithm than zhiyun's phonego mode. but actually these two products are both doing great job on stability, and they are almost equally matched in this industry.\n\n&amp;#x200b;\n\n**5. underslung mode**\n\nboth of ronin-sc and weebill lab have underslung mode, but there's still some difference how these two machine work in underslung modes. with dji ronin-sc, you can just flip gimbal handle upside down, and then it's above your camera in vertical -----> position !!! . you can get ground-level low-angle with this. but with weebill lab, when it's working in underslung mode, it won't turn left and right when flipped over. it's actually more comfortable to carry with a weebill, but it's rather a knee- level shot rather than low angle.\n\n&amp;#x200b;\n\nup to this point, i say it’s obvious that ronin-sc is the superior product. and you can check out more detailed comparison video between these two products on youtube. there are also some other key points about ronin-sc i’d like to highlight:\n\n* compatible camera list\n\nas most of you already know, the new ronin sc is mainly compatible with mirrorless cameras, it's also suitable for professional level photographers now, and you can check if your camera is compatible with ronin-sc in below list:\n\n&amp;#x200b;\n\nhttps://i.redd.it/4urc9hkyi0c31.png\n\n* **quick release and easy-to-setup**\n\nwhile dji’s ronin-s and ronin-sc both have a detachable design that allows users to easily dissemble and transport, ronin-sc offers even easier setup with its “positioning block”, which allows quick switch back to the previous position.\n\nin addition, ronin-sc has 2 locks for each axis that makes gimbal balancing much easier. while moving from one shooting spot to another, you can easily lock and unlock all the axes. it can save up a lot of time.\n\n* **intelligent functions**\n\n① activetrack 3.0\n\ndji has added a new intelligent function “activetrack” into ronin-sc. it’s used to select and track your subject during filming process super effectively. this is even better than ronin-s’s smoothtrack function. but this probably has pissed off some old dji ronin-s users as this function is not availble on ronin-s yet.\n\n② forcemobile\n\nthis function is definitely designed for professional users who want to have the most accurate control of frames, by allowing users to control ronin-sc by simply moving their smartphones. it's totally like freefly movie system. so for a small team shooting a video that involves complcated camera movements this feature could come in handy.\n\nlastly, the price of ronin-sc is quite reasonable and competitive among all the gimbal products and plus dji ronin-sc is also covered by dji care refresh plan. it is likely that zhiyun will also drop in price before long, but as a big fan of dji, truth is i will still pick ronin-sc even if the price is becoming higher than wl...", "sortedWord": "None", "identifyer": 80688, "year": "2019"}, {"Unnamed: 0": 188045, "autor": "darrow_l", "date": 1563765248000, "content": "Self sufficient Camera Suggestion with 30 or more FPS. /!/ Hey guys,   \n\n\nI can really use your recommendations. The purpose is to record any activity (workouts, sport and what not). I would like it to be little inexpensive because I'll have to purchase multiple cameras. Here are the specs that fit my needs:\n\n* 720p/1080p recording\n* at least 30 FPS. 60 FPS preferred.\n* Self sufficient. Either with inbuilt battery or connected to an external battery pack ([Like wyze cam](https://forums.wyzecam.com/t/battery-operated-wyze-cam/6764)).\n* 3-5 hrs of recording time is ideal.\n* Has memory to record without any external computer attached (No computer + webcam please!).\n* Gets entire scene in focus. I mean I need focus for at least 40 Feet from camera position. I know this last one is bit wage or I'm probably not doing a good job explaining it.\n\n&amp;#x200B;\n\nThanks in Advance.  \n\n\nP.S: I have posted [here](https://www.reddit.com/r/wyzecam/comments/cem8ts/camera_suggestion_with_higher_fps/?utm_source=share&amp;utm_medium=web2x) but didn't get any reasonable responses.", "link": "https://www.reddit.com/r/Cameras/comments/cg7wes/self_sufficient_camera_suggestion_with_30_or_more/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "self sufficient camera suggestion with 30 or more fps. /!/ hey guys,   \n\n\ni can really use your recommendations. the purpose is to record any activity (workouts, sport and what not). i would like it to be little inexpensive because i'll have to purchase multiple cameras. here are the specs that fit my needs:\n\n* 720p/1080p recording\n* at least 30 fps. 60 fps preferred.\n* self sufficient. either with inbuilt battery or connected to an external battery pack ([like wyze cam](https://forums.wyzecam.com/t/battery-operated-wyze-cam/6764)).\n* 3-5 hrs of recording time is ideal.\n* has memory to record without any external computer attached (no computer + webcam please!).\n* gets entire scene in focus. i mean i need focus for at least 40 feet from camera -----> position !!! . i know this last one is bit wage or i'm probably not doing a good job explaining it.\n\n&amp;#x200b;\n\nthanks in advance.  \n\n\np.s: i have posted [here](https://www.reddit.com/r/wyzecam/comments/cem8ts/camera_suggestion_with_higher_fps/?utm_source=share&amp;utm_medium=web2x) but didn't get any reasonable responses.", "sortedWord": "None", "identifyer": 80706, "year": "2019"}, {"Unnamed: 0": 188400, "autor": "Yohijiro", "date": 1567219530000, "content": "Im looking for a mount of certain specifications. /!/ Im looking for a single joint camera armature mount with ball joints on a both ends that lock (the ball joints lock in position and dont rely on friction to remain in place)  can withstand a good amount of weight, and is about 2 and a 1/2 feet long.", "link": "https://www.reddit.com/r/Cameras/comments/cxqpu3/im_looking_for_a_mount_of_certain_specifications/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "im looking for a mount of certain specifications. /!/ im looking for a single joint camera armature mount with ball joints on a both ends that lock (the ball joints lock in -----> position !!!  and dont rely on friction to remain in place)  can withstand a good amount of weight, and is about 2 and a 1/2 feet long.", "sortedWord": "None", "identifyer": 81070, "year": "2019"}, {"Unnamed: 0": 188543, "autor": "mysecondaccount151", "date": 1568629508000, "content": "Help! My Olympus lens isn't working! /!/ Hi guys! Firstly, I apologize if I'm in the wrong subreddit, I'm kinda desperate lol!\n\nSo I bought an Olympus E-M10 mirrorless camera plus two lenses from a pawn shop a couple of weeks ago, the camera's working great but today one of the lenses, an Olympus 14-42mm 1:3.5-5.6 EZ ED MSC (I've seen it referred to as the 'pancake' lens), stopped working. When I turn the camera on, the lens will zoom in and out three times (though sometimes it doesn't do this completely) before flashing the message 'Please check the status of the lens'. This message doesn't go away and I can't use the lens at all. Since my other lens is continuing to work perfectly, I doubt this is the camera's fault.\nI have tried:\n- Updating the firmware of the camera\n- 'Basic' resetting the camera\n- Cleaning the contacts on both the lens and the camera\n- Seeing if anything is preventing the lens from locking\nNothing has worked. Is there any saving my lens?\nConsidering I bought the camera and both lenses for AUD 200 I'm not in a position to spend a lot of money on a new one...\n\nThanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/d4yqhi/help_my_olympus_lens_isnt_working/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help! my olympus lens isn't working! /!/ hi guys! firstly, i apologize if i'm in the wrong subreddit, i'm kinda desperate lol!\n\nso i bought an olympus e-m10 mirrorless camera plus two lenses from a pawn shop a couple of weeks ago, the camera's working great but today one of the lenses, an olympus 14-42mm 1:3.5-5.6 ez ed msc (i've seen it referred to as the 'pancake' lens), stopped working. when i turn the camera on, the lens will zoom in and out three times (though sometimes it doesn't do this completely) before flashing the message 'please check the status of the lens'. this message doesn't go away and i can't use the lens at all. since my other lens is continuing to work perfectly, i doubt this is the camera's fault.\ni have tried:\n- updating the firmware of the camera\n- 'basic' resetting the camera\n- cleaning the contacts on both the lens and the camera\n- seeing if anything is preventing the lens from locking\nnothing has worked. is there any saving my lens?\nconsidering i bought the camera and both lenses for aud 200 i'm not in a -----> position !!!  to spend a lot of money on a new one...\n\nthanks in advance!", "sortedWord": "None", "identifyer": 81219, "year": "2019"}, {"Unnamed: 0": 188727, "autor": "ChiefWhiteHalfoat", "date": 1569770355000, "content": "On/Off Toggle Stuck /!/ Hello,  I have a Sony RX1R whose on/off toggle switch is seized up.  I really don't know how this would have happened.  It takes a great deal of force to move it from off to on and it goes very very slowly.  Then it pops right back to the off position with minimal force.  \n\nAny ideas on how to fix this?  Can it be dismantled for cleaning?\n\nThanks,\nC", "link": "https://www.reddit.com/r/Cameras/comments/dawh7n/onoff_toggle_stuck/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on/off toggle stuck /!/ hello,  i have a sony rx1r whose on/off toggle switch is seized up.  i really don't know how this would have happened.  it takes a great deal of force to move it from off to on and it goes very very slowly.  then it pops right back to the off -----> position !!!  with minimal force.  \n\nany ideas on how to fix this?  can it be dismantled for cleaning?\n\nthanks,\nc", "sortedWord": "None", "identifyer": 81410, "year": "2019"}, {"Unnamed: 0": 188885, "autor": "NA__Scrubbed", "date": 1574871708000, "content": "Quick Buying Guide for FF mirrorless /!/ Saw this [video](https://www.youtube.com/watch?v=LhFhDgKfK7s) from Three Blind Men and thought I'd throw in my 2 cents in case someone wanted a quick and dirty guide.\n\n**Sony**\n\nPros:\n\n* Third party support means lenses like the famous [Tamron 28-75](https://www.tamron.eu/lenses/28-75mm-f28-di-iii-rxd/) and the world first [35mm f1.2 AF](https://www.sigma-global.com/en/lenses/cas/product/art/a019_35_12/), as well as the only [apochromatic lenses](https://www.voigtlaender.de/lenses/e-mount/?lang=en) (see APO lanthar) you'll find outside of Leica. Additionally, there are starting to be a few excellent cheaper primes, such as the [Samyang 45](https://dustinabbott.net/2019/08/samyang-af-45mm-f1-8-fe-review/).\n* Best in class AF\n* Best battery life\n* A7III (current production model) [has perhaps marginally](https://www.dxomark.com/sony-a7-iii-low-light-performer/) the best high ISO of any model.\n\nCons: \n\n* Though Sony cameras certainly can take a [bit of abuse](https://www.youtube.com/watch?v=Ric_RH-Xm1Q) ([example 2](https://www.youtube.com/watch?v=JmrjI0-9KJs)) they do have [tested](https://www.lensrentals.com/blog/2018/02/taking-apart-the-sony-a7riii-in-search-of-better-weather-sealing/) ([example 2](https://blog.kasson.com/a7iii/sony-a7iii-battery-door-weather-sealing/)) shortcomings in regards to sealing.\n* While recent lenses are certainly [good performers](https://www.cameralabs.com/sony-fe-35mm-f1-8-review/2/), the only non G or GM lens that has any sealing is the 35mm. As most modern lenses perform well optically, this can lower the value proposition of much of their native enthusiast glass.  \n* Arguably the worst ergonomics unless you have small hands. \n\n**Nikon**\n\nPros:\n\n* Their S line has some real gems ([see 50mm vs Otus](https://blog.kasson.com/nikon-z6-7/nikon-50-1-8-s-otus-55-on-z7-zony-55-on-a7riii/), [24-70 2.8](https://www.cameralabs.com/nikon-z-24-70mm-f2-8-s-review/2/)) and all are at the very least excellent lenses. Furthermore, the S line and the Z bodies are probably [neck and neck](https://www.lensrentals.com/blog/2018/10/teardown-of-the-nikon-z7-mirrorless-camera/) with L-mount offerings for best weather sealing for non-Pentax cameras. Additionally, as the S line lenses are all cheaper than the Batis line I'd say they're probably the best value proposition for high end enthusiasts.\n* The Z line is the only line to release [10-bit video for free](https://www.cinema5d.com/nikon-z6-z7-focusing-on-video-quality-explained/). You can even capture 10-bit internal! \n* Theoretically, as the Z line has the least restrictive mount they can make the best lenses. However, while the 58 0.95 might just be the [best lens ever made for that focal length](https://www.cameralabs.com/nikon-z-58mm-f0-95-noct-review/2/) actual lens design plays a part. The aforementioned 50 1.8s certainly seems to be following that promise, but they don't seem to have the best lens for every focal length. Still, you might see more crazy things done for this mount than any other. \n* Lightest, smallest, and best performing 24-70 2.8 on the market atm. The title of optical quality king might be taken away when someone releases tests (haven't found any) for the Canon RF 24-70 or if Sigma's new offering for E and L mount cameras delivers on the promise of [GOAT standard zoom](https://www.sigma-global.com/en/lenses/cas/product/art/a019_24_70_28/features/), but it will always be the lightest and smallest 24-70 2.8. \n\nCons:\n\n* Arguably worst AF for any modern offering. This isn't to say that it's *bad* or *unusable*, but it's still disappointing. \n* While CF Express cards are undeniably the most advanced, they're also the most expensive. \n\n**Canon**\n\nPros:\n\n* While their native glass isn't as extensive as that available for the E-mount, their professional line (re: f 1.2 lenses) is probably the best on market for any system. \n* All of their professional zooms have built in OIS that will be a boon when they one day also have IBIS (and *maaaaaaybe* no crop in 4k). This will give an advantage in terms of shake reduction over most modern systems that only have IBIS. \n* Dual pixel AF is great for video focus pulling.\n* World's only f2 zoom.(!)\n* Close second in terms of mirrorless AF.\n\nCons: \n\n* Huge crop in 4k.\n* Like Sony, no sealing for non-L lenses. Also like Sony, [battery door issue](https://www.lensrentals.com/blog/2018/10/teardown-of-the-canon-eos-r-mirrorless-camera/).\n* While their new 2.8 and 4 zooms are reasonably sized, all of their other L-mount lenses at this point are just straight up behemoths. \n* They make you buy lens caps and declickable lenses. \n\n**L-mount alliance:**\n\nPros:\n\n* Arguably the biggest flexes for deep pocketed enthusiasts. This is in regards to the Panasonic or Leica SL mount lenses, or anyone who buys a Sigma fp to have the world's smallest FF camera. \n* The SL 2 literally designed new technology in terms of magnetic dials to have better build quality. \n* The only other mount with access to native Sigma glass. \n* The only mount to have [AF APO lenses](https://en.leica-camera.com/Photography/Leica-SL/SL-Lenses/Prime-Lenses/APO-Summicron-SL-50) (at some admittedly YIKES pricing). \n* Definitely ahead of Canon and Sony in terms of sealing.\n* Pansonic S1 line is incredibly feature rich.\n\nCons: \n\n* While Pansonic's DFD is great for stills photography it is undoubtedly the worst when it comes to video due to constant contrast hunting.\n* Leica and Sigma cameras are in the unfortunate position of having neither DFD or phase detect, making them a bit worse than the Nikon line in terms of AF.\n* Leica and Panasonic lenses, while *very* well built are also *very* heavy and expensive.\n\nAnywhoo, happy holiday shopping. Let me know if you have any questions.", "link": "https://www.reddit.com/r/Cameras/comments/e2ibkd/quick_buying_guide_for_ff_mirrorless/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "quick buying guide for ff mirrorless /!/ saw this [video](https://www.youtube.com/watch?v=lhfhdgkfk7s) from three blind men and thought i'd throw in my 2 cents in case someone wanted a quick and dirty guide.\n\n**sony**\n\npros:\n\n* third party support means lenses like the famous [tamron 28-75](https://www.tamron.eu/lenses/28-75mm-f28-di-iii-rxd/) and the world first [35mm f1.2 af](https://www.sigma-global.com/en/lenses/cas/product/art/a019_35_12/), as well as the only [apochromatic lenses](https://www.voigtlaender.de/lenses/e-mount/?lang=en) (see apo lanthar) you'll find outside of leica. additionally, there are starting to be a few excellent cheaper primes, such as the [samyang 45](https://dustinabbott.net/2019/08/samyang-af-45mm-f1-8-fe-review/).\n* best in class af\n* best battery life\n* a7iii (current production model) [has perhaps marginally](https://www.dxomark.com/sony-a7-iii-low-light-performer/) the best high iso of any model.\n\ncons: \n\n* though sony cameras certainly can take a [bit of abuse](https://www.youtube.com/watch?v=ric_rh-xm1q) ([example 2](https://www.youtube.com/watch?v=jmrji0-9kjs)) they do have [tested](https://www.lensrentals.com/blog/2018/02/taking-apart-the-sony-a7riii-in-search-of-better-weather-sealing/) ([example 2](https://blog.kasson.com/a7iii/sony-a7iii-battery-door-weather-sealing/)) shortcomings in regards to sealing.\n* while recent lenses are certainly [good performers](https://www.cameralabs.com/sony-fe-35mm-f1-8-review/2/), the only non g or gm lens that has any sealing is the 35mm. as most modern lenses perform well optically, this can lower the value proposition of much of their native enthusiast glass.  \n* arguably the worst ergonomics unless you have small hands. \n\n**nikon**\n\npros:\n\n* their s line has some real gems ([see 50mm vs otus](https://blog.kasson.com/nikon-z6-7/nikon-50-1-8-s-otus-55-on-z7-zony-55-on-a7riii/), [24-70 2.8](https://www.cameralabs.com/nikon-z-24-70mm-f2-8-s-review/2/)) and all are at the very least excellent lenses. furthermore, the s line and the z bodies are probably [neck and neck](https://www.lensrentals.com/blog/2018/10/teardown-of-the-nikon-z7-mirrorless-camera/) with l-mount offerings for best weather sealing for non-pentax cameras. additionally, as the s line lenses are all cheaper than the batis line i'd say they're probably the best value proposition for high end enthusiasts.\n* the z line is the only line to release [10-bit video for free](https://www.cinema5d.com/nikon-z6-z7-focusing-on-video-quality-explained/). you can even capture 10-bit internal! \n* theoretically, as the z line has the least restrictive mount they can make the best lenses. however, while the 58 0.95 might just be the [best lens ever made for that focal length](https://www.cameralabs.com/nikon-z-58mm-f0-95-noct-review/2/) actual lens design plays a part. the aforementioned 50 1.8s certainly seems to be following that promise, but they don't seem to have the best lens for every focal length. still, you might see more crazy things done for this mount than any other. \n* lightest, smallest, and best performing 24-70 2.8 on the market atm. the title of optical quality king might be taken away when someone releases tests (haven't found any) for the canon rf 24-70 or if sigma's new offering for e and l mount cameras delivers on the promise of [goat standard zoom](https://www.sigma-global.com/en/lenses/cas/product/art/a019_24_70_28/features/), but it will always be the lightest and smallest 24-70 2.8. \n\ncons:\n\n* arguably worst af for any modern offering. this isn't to say that it's *bad* or *unusable*, but it's still disappointing. \n* while cf express cards are undeniably the most advanced, they're also the most expensive. \n\n**canon**\n\npros:\n\n* while their native glass isn't as extensive as that available for the e-mount, their professional line (re: f 1.2 lenses) is probably the best on market for any system. \n* all of their professional zooms have built in ois that will be a boon when they one day also have ibis (and *maaaaaaybe* no crop in 4k). this will give an advantage in terms of shake reduction over most modern systems that only have ibis. \n* dual pixel af is great for video focus pulling.\n* world's only f2 zoom.(!)\n* close second in terms of mirrorless af.\n\ncons: \n\n* huge crop in 4k.\n* like sony, no sealing for non-l lenses. also like sony, [battery door issue](https://www.lensrentals.com/blog/2018/10/teardown-of-the-canon-eos-r-mirrorless-camera/).\n* while their new 2.8 and 4 zooms are reasonably sized, all of their other l-mount lenses at this point are just straight up behemoths. \n* they make you buy lens caps and declickable lenses. \n\n**l-mount alliance:**\n\npros:\n\n* arguably the biggest flexes for deep pocketed enthusiasts. this is in regards to the panasonic or leica sl mount lenses, or anyone who buys a sigma fp to have the world's smallest ff camera. \n* the sl 2 literally designed new technology in terms of magnetic dials to have better build quality. \n* the only other mount with access to native sigma glass. \n* the only mount to have [af apo lenses](https://en.leica-camera.com/photography/leica-sl/sl-lenses/prime-lenses/apo-summicron-sl-50) (at some admittedly yikes pricing). \n* definitely ahead of canon and sony in terms of sealing.\n* pansonic s1 line is incredibly feature rich.\n\ncons: \n\n* while pansonic's dfd is great for stills photography it is undoubtedly the worst when it comes to video due to constant contrast hunting.\n* leica and sigma cameras are in the unfortunate -----> position !!!  of having neither dfd or phase detect, making them a bit worse than the nikon line in terms of af.\n* leica and panasonic lenses, while *very* well built are also *very* heavy and expensive.\n\nanywhoo, happy holiday shopping. let me know if you have any questions.", "sortedWord": "None", "identifyer": 81573, "year": "2019"}, {"Unnamed: 0": 189034, "autor": "Stressed_pandaboy", "date": 1576368477000, "content": "Sending Good Vibes to all /!/ Hello everyone my name is Jorge and I am an inspiring engineering student, however I also have a passion for photography I haven’t been able to pursue, if you are in a position to help, that would be greatly appreciated \n\nhttps://www.gofundme.com/f/1ub0tvdtg0?utm_medium=copy_link&amp;utm_source=customer&amp;utm_campaign=p_na+share-sheet&amp;rcid=6ef352f05bcc4e919258133ae3bf26b8", "link": "https://www.reddit.com/r/Cameras/comments/earkta/sending_good_vibes_to_all/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sending good vibes to all /!/ hello everyone my name is jorge and i am an inspiring engineering student, however i also have a passion for photography i haven’t been able to pursue, if you are in a -----> position !!!  to help, that would be greatly appreciated \n\nhttps://www.gofundme.com/f/1ub0tvdtg0?utm_medium=copy_link&amp;utm_source=customer&amp;utm_campaign=p_na+share-sheet&amp;rcid=6ef352f05bcc4e919258133ae3bf26b8", "sortedWord": "None", "identifyer": 81727, "year": "2019"}, {"Unnamed: 0": 189158, "autor": "Themastermind8", "date": 1576671051000, "content": "Fix for Pentax S3 sticky shutter /!/ I’m posting this solution here so no one else has to do the level of research I did. \n\nIf you have a Pentax S3 that’s cloth shutter would get stuck close to the end, has a clean shutter path, and no alignment problems, here’s a solution for you!\n\nWhat’s happened is the oil has dried. Simple as that. Even simpler is the fix. \n\nTake off the bottom, you will see three small cogs (AKA pinions). 2 will be positioned right from front of lens, and one will be positioned to the left engaged with a larger cog. Apply a *smidge* of oil to these three cogs. I did this by taking the end off a cotton stick and dipping it in sewing machine oil before lightly spreading it on the top of the three cogs. Work the shutter at a high speed for a little while, then reassemble. It should stop jamming. \n\n*Be aware that the service manual does recommend using watchmakers oil* but since I found my S3 in the rubbish, I didn’t want to spend any cash on it. Also, just in case someone thinks they could, whatever you do *DO NOT USE WD40!!*\n\n_This solution was brought to you free of charge by a guy who became an expert in cloth shutters so you don’t have to_", "link": "https://www.reddit.com/r/Cameras/comments/ecbsrg/fix_for_pentax_s3_sticky_shutter/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "fix for pentax s3 sticky shutter /!/ i’m posting this solution here so no one else has to do the level of research i did. \n\nif you have a pentax s3 that’s cloth shutter would get stuck close to the end, has a clean shutter path, and no alignment problems, here’s a solution for you!\n\nwhat’s happened is the oil has dried. simple as that. even simpler is the fix. \n\ntake off the bottom, you will see three small cogs (aka pinions). 2 will be -----> positioned !!!  right from front of lens, and one will be -----> positioned !!!  to the left engaged with a larger cog. apply a *smidge* of oil to these three cogs. i did this by taking the end off a cotton stick and dipping it in sewing machine oil before lightly spreading it on the top of the three cogs. work the shutter at a high speed for a little while, then reassemble. it should stop jamming. \n\n*be aware that the service manual does recommend using watchmakers oil* but since i found my s3 in the rubbish, i didn’t want to spend any cash on it. also, just in case someone thinks they could, whatever you do *do not use wd40!!*\n\n_this solution was brought to you free of charge by a guy who became an expert in cloth shutters so you don’t have to_", "sortedWord": "None", "identifyer": 81854, "year": "2019"}, {"Unnamed: 0": 189201, "autor": "HarleyDaggerson", "date": 1576509638000, "content": "Returning the A6600 /!/ Been on a quest to find the ultimate small form factor future proof camera.  I bought an A6600 but when compared to the Z50 it's just awkward to hold and shoot.  The Z50 has a deeper grip and better position of the buttons.  However, it has horrible battery life.  Maybe a Z6?  Another disappointment with the A6600 is that I didn't even realize it had no flash!  But now the XT3 has my attention.  First World Problems...", "link": "https://www.reddit.com/r/Cameras/comments/ebgfs9/returning_the_a6600/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "returning the a6600 /!/ been on a quest to find the ultimate small form factor future proof camera.  i bought an a6600 but when compared to the z50 it's just awkward to hold and shoot.  the z50 has a deeper grip and better -----> position !!!  of the buttons.  however, it has horrible battery life.  maybe a z6?  another disappointment with the a6600 is that i didn't even realize it had no flash!  but now the xt3 has my attention.  first world problems...", "sortedWord": "None", "identifyer": 81897, "year": "2019"}, {"Unnamed: 0": 189493, "autor": "zilla_darling", "date": 1554022044000, "content": "Canon 7D Mark II or 6D Mark II? /!/ My beloved 50D stopped working around 3 years ago, and long story short, I'm now in a position to buy a new one, with the 6D in mind. However, I've got 4 EF-S lenses and only 2 EF lenses and having done some research, it seems like I won't be able to use them.\n\nThe two EF lenses I have are a macro 50mm and a 17-50mm. The other Canon EF-S lenses I have are 17-85, 10-22 wide angle, a 18-55 and 55-250. \n\nI used my camera for food blogging and travel photography (non-professional) so the only non-EF lens I would still use would be a zoom lens. I work full time where I have work camera supplied, so I won't need to upgrade my camera until this new one breaks. \n\nWhat am I best off doing?   \nMy thoughts are sell some of the EF-S lenses and buy a Tamron zoom lens - one that is EF compatible. \n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/b7lnyg/canon_7d_mark_ii_or_6d_mark_ii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon 7d mark ii or 6d mark ii? /!/ my beloved 50d stopped working around 3 years ago, and long story short, i'm now in a -----> position !!!  to buy a new one, with the 6d in mind. however, i've got 4 ef-s lenses and only 2 ef lenses and having done some research, it seems like i won't be able to use them.\n\nthe two ef lenses i have are a macro 50mm and a 17-50mm. the other canon ef-s lenses i have are 17-85, 10-22 wide angle, a 18-55 and 55-250. \n\ni used my camera for food blogging and travel photography (non-professional) so the only non-ef lens i would still use would be a zoom lens. i work full time where i have work camera supplied, so i won't need to upgrade my camera until this new one breaks. \n\nwhat am i best off doing?   \nmy thoughts are sell some of the ef-s lenses and buy a tamron zoom lens - one that is ef compatible. \n\nthanks!", "sortedWord": "None", "identifyer": 82202, "year": "2019"}], "name": "positionCameras2019"}