{"interestingcomments": [{"Unnamed: 0": 176364, "autor": "Kytes7", "date": 1517825704000, "content": "[Help] Camera stopped working. Sony DSC-RX100 /!/ Hi, I was hoping someone here could help me. I know people do not appreciate this camera, but I´ve had it for a lot of time and it just stopped working now. I do not have the money to buy a new one for now so I do need to look for a solution as quick as possible.\n\nFrom time to time it did this kind of buzz-y noise, but it did not affect it at all. The only other issue it had was that the lens would expand and come back to its original position now and again. But again, that caused no real problem to me. The big issue came this weekend, when suddenly the battery (recently charged) appeared in the camera as not charged and it turned off in barely 10 minutes. From that moment, it does not charge. Not even the charging light turns on. I´ve tried buying a new battery but even then, it won´t charge/work whatsoever. \n\nIf someone in here could help me, I´d be so so happy. Thank you all!", "link": "https://www.reddit.com/r/Cameras/comments/7vdvhv/help_camera_stopped_working_sony_dscrx100/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[help] camera stopped working. sony dsc-rx100 /!/ hi, i was hoping someone here could help me. i know people do not appreciate this camera, but i´ve had it for a lot of time and it just stopped working now. i do not have the money to buy a new one for now so i do need to look for a solution as quick as possible.\n\nfrom time to time it did this kind of buzz-y noise, but it did not affect it at all. the only other issue it had was that the lens would expand and come back to its original -----> position !!!  now and again. but again, that caused no real problem to me. the big issue came this weekend, when suddenly the battery (recently charged) appeared in the camera as not charged and it turned off in barely 10 minutes. from that moment, it does not charge. not even the charging light turns on. i´ve tried buying a new battery but even then, it won´t charge/work whatsoever. \n\nif someone in here could help me, i´d be so so happy. thank you all!", "sortedWord": "None", "identifyer": 68778, "year": "2018"}, {"Unnamed: 0": 176433, "autor": "scorr14", "date": 1517367725000, "content": "Wide comfy camera strap /!/ I am looking for recommendation on a wide long and comfy camera strap.\n\nMost of the straps I see on amazon are wide only for about half the length of less, then then reduce to a tiny thin little strap with uncomfortable buckles.\n\nI like to rotate my camera resting position from over my shoulder and in the front on my stomach, to sometimes all the way around resting on my lower back. If the strap is not wide for the whole length, I end up with the thin uncomfortable part bugging me when rotated.\n\nThanks for any recommendations!!", "link": "https://www.reddit.com/r/Cameras/comments/7u6qri/wide_comfy_camera_strap/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wide comfy camera strap /!/ i am looking for recommendation on a wide long and comfy camera strap.\n\nmost of the straps i see on amazon are wide only for about half the length of less, then then reduce to a tiny thin little strap with uncomfortable buckles.\n\ni like to rotate my camera resting -----> position !!!  from over my shoulder and in the front on my stomach, to sometimes all the way around resting on my lower back. if the strap is not wide for the whole length, i end up with the thin uncomfortable part bugging me when rotated.\n\nthanks for any recommendations!!", "sortedWord": "None", "identifyer": 68847, "year": "2018"}, {"Unnamed: 0": 177490, "autor": "no-good_beans", "date": 1523249426000, "content": "Buy a camera, or just use a phone? /!/ Complete noob here. I've been wanting to get a video camera for awhile now. I had been planning to use it for a couple tasks,  such as documenting personal projects, instructional videos, maybe making a youtube video or two, etc. I decided I liked the camcorder form factor better than that of the DSLR because easy single-hand operation and the ability to position the screen to be front facing (or other directions, like if filming a top-down view of something, for instance) seemed appealing. After a bit of research, I had settled on the [Canon Vixia HF R800](https://www.amazon.com/gp/product/B01N7OAH3I/ref=ox_sc_act_title_6?smid=A1BOQWC2XF5W4I&amp;psc=1). \n\nSo I had been saving up the money for this, and was getting ready to pull the trigger, but then my terrible, infuriating, piece of garbage cellphone finally gave up the ghost. This was also a cost I had been saving for, and having been tortured by a shitty phone for so long, I decided to spoil myself and get a refurbished pixel 2. \n\nDoes it even make sense to get a camcorder at this point? As I far as I understand, my phone has a superior sensor to the R800, or anything in a similar price range. I'd prefer not to have my phone filled with footage (not super important, but eh). I would also like to be able to leave my camera set up as is, should I have to take a break or leave in the middle of filming something, which I couldn't do if I were using my phone. \n\nHelp me out, random internet people. Is the camcorder worth it/does it make sense? Am I dumb for not just using my phone? Thoughts? Advice? m̶e̶m̶e̶s̶?̶  *saw rule #3", "link": "https://www.reddit.com/r/Cameras/comments/8avxsr/buy_a_camera_or_just_use_a_phone/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "buy a camera, or just use a phone? /!/ complete noob here. i've been wanting to get a video camera for awhile now. i had been planning to use it for a couple tasks,  such as documenting personal projects, instructional videos, maybe making a youtube video or two, etc. i decided i liked the camcorder form factor better than that of the dslr because easy single-hand operation and the ability to -----> position !!!  the screen to be front facing (or other directions, like if filming a top-down view of something, for instance) seemed appealing. after a bit of research, i had settled on the [canon vixia hf r800](https://www.amazon.com/gp/product/b01n7oah3i/ref=ox_sc_act_title_6?smid=a1boqwc2xf5w4i&amp;psc=1). \n\nso i had been saving up the money for this, and was getting ready to pull the trigger, but then my terrible, infuriating, piece of garbage cellphone finally gave up the ghost. this was also a cost i had been saving for, and having been tortured by a shitty phone for so long, i decided to spoil myself and get a refurbished pixel 2. \n\ndoes it even make sense to get a camcorder at this point? as i far as i understand, my phone has a superior sensor to the r800, or anything in a similar price range. i'd prefer not to have my phone filled with footage (not super important, but eh). i would also like to be able to leave my camera set up as is, should i have to take a break or leave in the middle of filming something, which i couldn't do if i were using my phone. \n\nhelp me out, random internet people. is the camcorder worth it/does it make sense? am i dumb for not just using my phone? thoughts? advice? m̶e̶m̶e̶s̶?̶  *saw rule #3", "sortedWord": "None", "identifyer": 69917, "year": "2018"}, {"Unnamed: 0": 177564, "autor": "Danmann7", "date": 1515783471000, "content": "Best equipment for pictures and videos of me playing music? /!/ I realized I need to get a higher quality camera to take profile and other pictures for my socials, so I started looking into DSLRs. The Nikon D3100 looked budget friendly and high quality for photos: https://www.amazon.com/dp/B003ZYF3LO/ref=cm_sw_r_cp_api_GvnwAbT7MEKX9\n\nHowever I also want a better solution for shooting videos of myself playing guitar and keys, and my webcam doesn’t cut it due to quality issues and also awkward positioning, and I realized that some dslrs offer flipping screens and high quality video so I could position it well and see how the video is turning out while playing. Good example: \nhttps://www.amazon.com/dp/B071K62DPN/ref=cm_sw_r_cp_api_gynwAbGM7MT9X\n\nThere’s a $300 difference between these 2 cameras however. \n\nShould I shell out for the DSLR with the flipping screen for video? Or would the cheaper DSLR with a separate camcorder be a better option? Any recommendations on specific equipment would be great too. Looking for “good enough” for a reasonable price/budget.\n\nThanks so much any advice! \n\nEdit:\nTl;Dr Expensive DSLR with good video capability and rotating screen VS cheaper DSLR and camcorder for video", "link": "https://www.reddit.com/r/Cameras/comments/7pys3l/best_equipment_for_pictures_and_videos_of_me/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best equipment for pictures and videos of me playing music? /!/ i realized i need to get a higher quality camera to take profile and other pictures for my socials, so i started looking into dslrs. the nikon d3100 looked budget friendly and high quality for photos: https://www.amazon.com/dp/b003zyf3lo/ref=cm_sw_r_cp_api_gvnwabt7mekx9\n\nhowever i also want a better solution for shooting videos of myself playing guitar and keys, and my webcam doesn’t cut it due to quality issues and also awkward positioning, and i realized that some dslrs offer flipping screens and high quality video so i could -----> position !!!  it well and see how the video is turning out while playing. good example: \nhttps://www.amazon.com/dp/b071k62dpn/ref=cm_sw_r_cp_api_gynwabgm7mt9x\n\nthere’s a $300 difference between these 2 cameras however. \n\nshould i shell out for the dslr with the flipping screen for video? or would the cheaper dslr with a separate camcorder be a better option? any recommendations on specific equipment would be great too. looking for “good enough” for a reasonable price/budget.\n\nthanks so much any advice! \n\nedit:\ntl;dr expensive dslr with good video capability and rotating screen vs cheaper dslr and camcorder for video", "sortedWord": "None", "identifyer": 69992, "year": "2018"}, {"Unnamed: 0": 177600, "autor": "UBCkid", "date": 1515537389000, "content": "What 360 camera(s) do you recommend? /!/ Hi everyone. I'm looking to get a 360 camera to capture moments when I go hiking, surfing, or simply exploring a city. I did a quick surf through Amazon but nothing really stuck out. I also came across the new Fusion 360 camera GoPro just launched but the reviews don't look to impressive (in regards to the software). I've also used the Samsung Gear but it's kind of weird in terms of how you have to position it and hold it. What 360 cameras do you use or have you used. What do you recommend? Thanks ", "link": "https://www.reddit.com/r/Cameras/comments/7paxco/what_360_cameras_do_you_recommend/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what 360 camera(s) do you recommend? /!/ hi everyone. i'm looking to get a 360 camera to capture moments when i go hiking, surfing, or simply exploring a city. i did a quick surf through amazon but nothing really stuck out. i also came across the new fusion 360 camera gopro just launched but the reviews don't look to impressive (in regards to the software). i've also used the samsung gear but it's kind of weird in terms of how you have to -----> position !!!  it and hold it. what 360 cameras do you use or have you used. what do you recommend? thanks ", "sortedWord": "None", "identifyer": 70029, "year": "2018"}, {"Unnamed: 0": 177707, "autor": "Majofan", "date": 1516730794000, "content": "Minolta X700 Problems /!/ I recently got a Minolta X700.\n\nIt has got some problems:\n\nFirst of all, I can not set my lenses to the smallest aperture (for example f22) because the little metal thing on the camera is not moving and is stuck in that position, however when I take the lens off, it works just fine. \n\nX700 https://imgur.com/gallery/K7G9W\n\nThe second problem is that the the little ring which gets moved by the lens when you change the aperture doesn't move back, when I change the aperture again to a lower value.\n\nhttps://imgur.com/gallery/W3YQb\n\n\nI can take the lens off and move it, but it makes scratchy noises as if it was really dirty or there is some sand.\n\n\nCan I fix these problems without special tools?\n\nIf so, how? Can I just unscrew the screws on the lens mount and clean it or is it more complicated.\n\nAlso, the mirror is really dirty and I heard it is bad to move it, is there some easy way to clean it? ", "link": "https://www.reddit.com/r/Cameras/comments/7sgbhu/minolta_x700_problems/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta x700 problems /!/ i recently got a minolta x700.\n\nit has got some problems:\n\nfirst of all, i can not set my lenses to the smallest aperture (for example f22) because the little metal thing on the camera is not moving and is stuck in that -----> position !!! , however when i take the lens off, it works just fine. \n\nx700 https://imgur.com/gallery/k7g9w\n\nthe second problem is that the the little ring which gets moved by the lens when you change the aperture doesn't move back, when i change the aperture again to a lower value.\n\nhttps://imgur.com/gallery/w3yqb\n\n\ni can take the lens off and move it, but it makes scratchy noises as if it was really dirty or there is some sand.\n\n\ncan i fix these problems without special tools?\n\nif so, how? can i just unscrew the screws on the lens mount and clean it or is it more complicated.\n\nalso, the mirror is really dirty and i heard it is bad to move it, is there some easy way to clean it? ", "sortedWord": "None", "identifyer": 70137, "year": "2018"}, {"Unnamed: 0": 180848, "autor": "viper0771", "date": 1538518230000, "content": "Any alternative to Canon soft video? /!/ I often use a Canon 70D and 6D Mark II, both of them with L Glass. Even at the maximum quality possible, i stil find the video output really really soft.    \n    \n  Is this my fault?, is there any easy way to fix this in post-production? \n\nI'm seriously thinking about going rogue and jump into the Sony or Panasonic path, but i'm not in a good financial position to buy a expensive camera like the GH5 right now.   \n\n\n  What should i do? is the Canon Footage really soft compared to other cameras or is just me? ", "link": "https://www.reddit.com/r/Cameras/comments/9kv6n0/any_alternative_to_canon_soft_video/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any alternative to canon soft video? /!/ i often use a canon 70d and 6d mark ii, both of them with l glass. even at the maximum quality possible, i stil find the video output really really soft.    \n    \n  is this my fault?, is there any easy way to fix this in post-production? \n\ni'm seriously thinking about going rogue and jump into the sony or panasonic path, but i'm not in a good financial -----> position !!!  to buy a expensive camera like the gh5 right now.   \n\n\n  what should i do? is the canon footage really soft compared to other cameras or is just me? ", "sortedWord": "None", "identifyer": 73345, "year": "2018"}, {"Unnamed: 0": 181200, "autor": "zilla_darling", "date": 1534982101000, "content": "Canon user - buying a new DSLR /!/ A couple of years ago, my beloved 50D broke - possibly could have been due to a copious amount of water  spilled on it (but that's another story). \n\n&amp;#x200B;\n\nI'm hoping to soon be in a position where I can buy a replacement, but I bought this camera 10 years ago, so it's been a while!   \n\n\nI've always loved the 5D, however, there is quite a price jump and I have about 4 lenses that won't work, so it's probably a little out of reach at the moment. \n\n&amp;#x200B;\n\nOverall I was really happy with my 50D, I did a couple of weddings and head shots jobs, and took it over the world and was really happy with the quality of images, so I would really like to find a camera either similar quality or slightly better, without moving up to the 5D. \n\n&amp;#x200B;\n\nI'd be really using the photos to go along side a blog I'm working on - so a fair bit of photojournalism style, and of course, travel shots.\n\n&amp;#x200B;\n\nAnd, I live in Australia in case the location makes any difference.\n\n&amp;#x200B;\n\nThanks in advance!\n\n  \n\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/Cameras/comments/99igp7/canon_user_buying_a_new_dslr/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon user - buying a new dslr /!/ a couple of years ago, my beloved 50d broke - possibly could have been due to a copious amount of water  spilled on it (but that's another story). \n\n&amp;#x200b;\n\ni'm hoping to soon be in a -----> position !!!  where i can buy a replacement, but i bought this camera 10 years ago, so it's been a while!   \n\n\ni've always loved the 5d, however, there is quite a price jump and i have about 4 lenses that won't work, so it's probably a little out of reach at the moment. \n\n&amp;#x200b;\n\noverall i was really happy with my 50d, i did a couple of weddings and head shots jobs, and took it over the world and was really happy with the quality of images, so i would really like to find a camera either similar quality or slightly better, without moving up to the 5d. \n\n&amp;#x200b;\n\ni'd be really using the photos to go along side a blog i'm working on - so a fair bit of photojournalism style, and of course, travel shots.\n\n&amp;#x200b;\n\nand, i live in australia in case the location makes any difference.\n\n&amp;#x200b;\n\nthanks in advance!\n\n  \n\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 73706, "year": "2018"}], "name": "positionCameras2018"}