{"interestingcomments": [{"Unnamed: 0": 184414, "autor": "infinitenoodles", "date": 1558542542000, "content": "Bridge Camera Selection /!/ My wife enjoys birding and I'm looking to get a decent camera for her to snap pictures of what she spots without too much trouble. A high zoom bridge camera seems like a very good option; I have a relative with an Canon SX60 HS that seems to work well for this. My budget is around 500 USD.\n\nI'm looking at the newer Canon SX70 HS, but I've also seen good reviews for the Nikon P900 and some of the Lumix models. Any advice on which bridge camera is going to give me the best bang for my buck for birding? Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/brqvjl/bridge_camera_selection/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "bridge camera selection /!/ my wife enjoys birding and i'm looking to get a decent camera for her to snap pictures of what she -----> spots !!!  without too much trouble. a high zoom bridge camera seems like a very good option; i have a relative with an canon sx60 hs that seems to work well for this. my budget is around 500 usd.\n\ni'm looking at the newer canon sx70 hs, but i've also seen good reviews for the nikon p900 and some of the lumix models. any advice on which bridge camera is going to give me the best bang for my buck for birding? thanks!", "sortedWord": "None", "identifyer": 76975, "year": "2019"}, {"Unnamed: 0": 184429, "autor": "VPumbs", "date": 1558466571000, "content": "X-T20 vs X-T30 - Trading down on lenses? /!/ Hi all\n\nI'm looking to buy a new mirrorless camera to replace my aging Sony Alpha NEX-5.\n\nI wanted to buy the Fujifilm X-T20 with the 18-55mm lens kit. But, I note for the same price I can get the X-T30 with the shorter lens (15-45mm).\n\nI'm a bit dubious about trading down on lenses, my Sony has an 18-55mm on it and it seems to fit my needs. However, I did read that the X-T30 is slightly better than the X-T20 in most ways. \n\nThe camera will be used mainly for vacation shots: we spend a lot of time hiking/outdoors so it will be used for landscapes, sunsets, seascapes etc. plus photos of family on trips. Close ups (i.e. using the zoom) would be mainly if we spotted interesting wildlife in the middle distance. \n\nSo, I'm wondering if anyone can help me decide between the two cameras. Trading up on lenses would be a possibility later down the line but certainly not straight away. \n\nOf course, alternative camera suggestions very welcome as well! My amateur online research suggests these 2 cameras are very well thought of, but I'm open to any other ideas. My NEX-5 has stood me in good stead for 8 years but the new equivalent Sony cameras don't seem to be that well regarded.  \n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/brenkp/xt20_vs_xt30_trading_down_on_lenses/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "x-t20 vs x-t30 - trading down on lenses? /!/ hi all\n\ni'm looking to buy a new mirrorless camera to replace my aging sony alpha nex-5.\n\ni wanted to buy the fujifilm x-t20 with the 18-55mm lens kit. but, i note for the same price i can get the x-t30 with the shorter lens (15-45mm).\n\ni'm a bit dubious about trading down on lenses, my sony has an 18-55mm on it and it seems to fit my needs. however, i did read that the x-t30 is slightly better than the x-t20 in most ways. \n\nthe camera will be used mainly for vacation shots: we spend a lot of time hiking/outdoors so it will be used for landscapes, sunsets, seascapes etc. plus photos of family on trips. close ups (i.e. using the zoom) would be mainly if we -----> spotted !!!  interesting wildlife in the middle distance. \n\nso, i'm wondering if anyone can help me decide between the two cameras. trading up on lenses would be a possibility later down the line but certainly not straight away. \n\nof course, alternative camera suggestions very welcome as well! my amateur online research suggests these 2 cameras are very well thought of, but i'm open to any other ideas. my nex-5 has stood me in good stead for 8 years but the new equivalent sony cameras don't seem to be that well regarded.  \n\nthanks!", "sortedWord": "None", "identifyer": 76990, "year": "2019"}, {"Unnamed: 0": 184802, "autor": "thebestgayIcanbe", "date": 1571088701000, "content": "Removing the finish from camera body? /!/ I have an old Panasonic G1 that I use for work. The rubber material they coated the body in has become kinda sticky and is wearing off in spots. \n\nDoes anybody know a way to remove it completely without scraping it off?", "link": "https://www.reddit.com/r/Cameras/comments/dhxgv0/removing_the_finish_from_camera_body/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "removing the finish from camera body? /!/ i have an old panasonic g1 that i use for work. the rubber material they coated the body in has become kinda sticky and is wearing off in -----> spots !!! . \n\ndoes anybody know a way to remove it completely without scraping it off?", "sortedWord": "None", "identifyer": 77375, "year": "2019"}, {"Unnamed: 0": 185204, "autor": "hallienothailey", "date": 1550504706000, "content": "Pentax K-1 mark ii v. Sony A7 iii /!/ What are y'alls opinions on which would be the better investment? I currently have a Pentax K5 that is finally giving out on me, and as much as I enjoy my Pentax, I'm at a spot where i could change systems if desired. My concern with the Sony is the digital viewfinder and how different this may be than what I've used in the past as well as the fact that Pentax is an optical company that Sony just isn't. However, I've been having trouble with the Pentax AF lately, and really since getting the K-5, so my frustration may just be getting the best of me at the moment. It continuously gets \"stuck\" to where it can never AF and the lens will just spin back and forth endlessly. From what I understand now, the fix would cost more than the camera is worth and who knows how long it would take given you have to send Pentaxes in to the compnay get any sort of work done on them(No camera shops near me will even touch a Pentax). Has anyone made the switch one way or the other and what are your thoughts about it? ", "link": "https://www.reddit.com/r/Cameras/comments/aryh5n/pentax_k1_mark_ii_v_sony_a7_iii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pentax k-1 mark ii v. sony a7 iii /!/ what are y'alls opinions on which would be the better investment? i currently have a pentax k5 that is finally giving out on me, and as much as i enjoy my pentax, i'm at a -----> spot !!!  where i could change systems if desired. my concern with the sony is the digital viewfinder and how different this may be than what i've used in the past as well as the fact that pentax is an optical company that sony just isn't. however, i've been having trouble with the pentax af lately, and really since getting the k-5, so my frustration may just be getting the best of me at the moment. it continuously gets \"stuck\" to where it can never af and the lens will just spin back and forth endlessly. from what i understand now, the fix would cost more than the camera is worth and who knows how long it would take given you have to send pentaxes in to the compnay get any sort of work done on them(no camera shops near me will even touch a pentax). has anyone made the switch one way or the other and what are your thoughts about it? ", "sortedWord": "None", "identifyer": 77783, "year": "2019"}, {"Unnamed: 0": 185365, "autor": "angstmind", "date": 1553743246000, "content": "Looking to buy a camera. /!/ I need a hobby, and I've always been interested in photography. I go out to some beautiful spots at times and wish I could capture the moment. I'm looking for something around $1,000 or under. Any recommendations would be appreciated. ", "link": "https://www.reddit.com/r/Cameras/comments/b6dt16/looking_to_buy_a_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looking to buy a camera. /!/ i need a hobby, and i've always been interested in photography. i go out to some beautiful -----> spots !!!  at times and wish i could capture the moment. i'm looking for something around $1,000 or under. any recommendations would be appreciated. ", "sortedWord": "None", "identifyer": 77950, "year": "2019"}, {"Unnamed: 0": 185536, "autor": "AntonOz", "date": 1548279149000, "content": "First camera /!/ Hello I’m looking to purchase my first camera and I don’t know which one to get. I was looking around and I spotted multiple camera but the recent Sony a6400 caught my attention. The camera looks great but I heard that it’s a bad first camera to go for:(. Then I came across the DSLRs there are so many but I have no clue which one to get, everyone I know who is into photography tell me that the Sony is good and canon. I’m just asking for some help deciding my first camera. :)", "link": "https://www.reddit.com/r/Cameras/comments/aj4smt/first_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "first camera /!/ hello i’m looking to purchase my first camera and i don’t know which one to get. i was looking around and i -----> spotted !!!  multiple camera but the recent sony a6400 caught my attention. the camera looks great but i heard that it’s a bad first camera to go for:(. then i came across the dslrs there are so many but i have no clue which one to get, everyone i know who is into photography tell me that the sony is good and canon. i’m just asking for some help deciding my first camera. :)", "sortedWord": "None", "identifyer": 78125, "year": "2019"}, {"Unnamed: 0": 185721, "autor": "graydalmation", "date": 1556479668000, "content": "Recommendations for Weatherproofing a Canon Eos 6D /!/ I love my 6D and in two weeks I’m leaving for my study abroad in Costa Rica and I want to take pictures when I travel the country on the weekends, however, I’ve had trouble with my camera being ultra sensitive in the past. A drop of water once hit just the right spot on the control panel and messed up the controls for a while (until I stuck it in rice 🙄). So my camera is doing great now, but I will be in Costa Rica during the rainy season where it rains for hours every day and don’t want to have any trouble with it breaking. Is there any kind of protective case I can get that will allow me to take photos when it’s raining but won’t be super expensive? I’m considering a plastic-y waterproof thing but I’d love suggestions!", "link": "https://www.reddit.com/r/Cameras/comments/bieykn/recommendations_for_weatherproofing_a_canon_eos_6d/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "recommendations for weatherproofing a canon eos 6d /!/ i love my 6d and in two weeks i’m leaving for my study abroad in costa rica and i want to take pictures when i travel the country on the weekends, however, i’ve had trouble with my camera being ultra sensitive in the past. a drop of water once hit just the right -----> spot !!!  on the control panel and messed up the controls for a while (until i stuck it in rice 🙄). so my camera is doing great now, but i will be in costa rica during the rainy season where it rains for hours every day and don’t want to have any trouble with it breaking. is there any kind of protective case i can get that will allow me to take photos when it’s raining but won’t be super expensive? i’m considering a plastic-y waterproof thing but i’d love suggestions!", "sortedWord": "None", "identifyer": 78313, "year": "2019"}, {"Unnamed: 0": 186032, "autor": "mlipkin", "date": 1563285284000, "content": "Any reason to keep a D90? /!/ Hi all,   \n\n\nI've had a Nikon D90 for about seven years, with a few non-kit lenses (a 50mm prime and a wide angle). It's been in that perfect not-professional/better-than-point-and-shoot spot for me, as a non-pro enthusiast. But, I'm now thinking of upgrading and have been looking at the Fuji X-T20 as a replacement. \n\n&amp;#x200B;\n\nHere is my question--is there any reason to keep the D90 around, instead of selling it? It's not as if the D90 has a  better sensor, and I understand there are adapters to let me keep using those Nikon lenses.   \n\n\nOr have I gotten something wrong? Advice appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/cdxcfu/any_reason_to_keep_a_d90/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any reason to keep a d90? /!/ hi all,   \n\n\ni've had a nikon d90 for about seven years, with a few non-kit lenses (a 50mm prime and a wide angle). it's been in that perfect not-professional/better-than-point-and-shoot -----> spot !!!  for me, as a non-pro enthusiast. but, i'm now thinking of upgrading and have been looking at the fuji x-t20 as a replacement. \n\n&amp;#x200b;\n\nhere is my question--is there any reason to keep the d90 around, instead of selling it? it's not as if the d90 has a  better sensor, and i understand there are adapters to let me keep using those nikon lenses.   \n\n\nor have i gotten something wrong? advice appreciated!", "sortedWord": "None", "identifyer": 78631, "year": "2019"}, {"Unnamed: 0": 186297, "autor": "1d2a3v", "date": 1566149093000, "content": "Can you spot the bird", "link": "https://www.reddit.com/r/Cameras/comments/cs44cg/can_you_spot_the_bird/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you -----> spot !!!  the bird", "sortedWord": "None", "identifyer": 78901, "year": "2019"}, {"Unnamed: 0": 186342, "autor": "DelPrive235", "date": 1567793116000, "content": "a6500 Touch focus stopped working /!/ The touch screen focus on my a6500 has stopped working. When I tap the screen it says “Spot Focus” and an icon of a finger with an “x” next to it shows up. Does anyone know how I get touch focus back?", "link": "https://www.reddit.com/r/Cameras/comments/d0k86c/a6500_touch_focus_stopped_working/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6500 touch focus stopped working /!/ the touch screen focus on my a6500 has stopped working. when i tap the screen it says “-----> spot !!!  focus” and an icon of a finger with an “x” next to it shows up. does anyone know how i get touch focus back?", "sortedWord": "None", "identifyer": 78946, "year": "2019"}, {"Unnamed: 0": 186621, "autor": "Medguy1987", "date": 1570729532000, "content": "Be able to remotely control iPhone camera /!/ Sorry if I [A.](https://A.am) am in the wrong spot and/or B. I am not explaining this correctly... But i was looking to set up a makeshift security system in my home using old iPhone I have laying around. Aside from just mounting them to the wall, pointed to a room, I wanted to see if there was some sort of mount that is remote controlled. I.E. that can allow me to pan the room remotely.", "link": "https://www.reddit.com/r/Cameras/comments/dg1m4o/be_able_to_remotely_control_iphone_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "be able to remotely control iphone camera /!/ sorry if i [a.](https://a.am) am in the wrong -----> spot !!!  and/or b. i am not explaining this correctly... but i was looking to set up a makeshift security system in my home using old iphone i have laying around. aside from just mounting them to the wall, pointed to a room, i wanted to see if there was some sort of mount that is remote controlled. i.e. that can allow me to pan the room remotely.", "sortedWord": "None", "identifyer": 79238, "year": "2019"}, {"Unnamed: 0": 186698, "autor": "IghtBroImmaHeadOut", "date": 1570220596000, "content": "Can someone explain what that thing is in the center? It seems to be leaving a black spot in my shots", "link": "https://www.reddit.com/r/Cameras/comments/ddcy34/can_someone_explain_what_that_thing_is_in_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone explain what that thing is in the center? it seems to be leaving a black -----> spot !!!  in my shots", "sortedWord": "None", "identifyer": 79317, "year": "2019"}, {"Unnamed: 0": 186958, "autor": "cbdhalkyard", "date": 1577020035000, "content": "Spotted an ad for my Nikon L35AF in a copy of National Geographic from 1985", "link": "https://www.reddit.com/r/Cameras/comments/ee4p55/spotted_an_ad_for_my_nikon_l35af_in_a_copy_of/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  an ad for my nikon l35af in a copy of national geographic from 1985", "sortedWord": "None", "identifyer": 79585, "year": "2019"}, {"Unnamed: 0": 187019, "autor": "Srsthsushil", "date": 1547033413000, "content": "Dslr or Compact camera for screen printing? /!/  \n\nMost dslr cameras seem to have low megapixels and big sensor while compact cameras seem to have high megapixels but small sensor. So my most important question is which camera will yeild much details(forget about color accuracy or other things which are not related to hairy details) in a photo. as i will turn the photo into spot colors for screen printing but i want the image with spot colors with huge amount of much clear details.\n\nSo, my concerns are --\n\n\\&gt;&gt;will the 10 mp dslr get more fine details(hairy) than the 14 mp compact?\n\n\\&gt;&gt;(Optional) will the 1080p video(30fps) shot on 10 mp dslr will be of higher quality and detail than the 1080p video(60fps) shot on 14 mp compact?", "link": "https://www.reddit.com/r/Cameras/comments/ae5z8f/dslr_or_compact_camera_for_screen_printing/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dslr or compact camera for screen printing? /!/  \n\nmost dslr cameras seem to have low megapixels and big sensor while compact cameras seem to have high megapixels but small sensor. so my most important question is which camera will yeild much details(forget about color accuracy or other things which are not related to hairy details) in a photo. as i will turn the photo into -----> spot !!!  colors for screen printing but i want the image with spot colors with huge amount of much clear details.\n\nso, my concerns are --\n\n\\&gt;&gt;will the 10 mp dslr get more fine details(hairy) than the 14 mp compact?\n\n\\&gt;&gt;(optional) will the 1080p video(30fps) shot on 10 mp dslr will be of higher quality and detail than the 1080p video(60fps) shot on 14 mp compact?", "sortedWord": "None", "identifyer": 79648, "year": "2019"}, {"Unnamed: 0": 187157, "autor": "ExESGO", "date": 1550029339000, "content": "Need some camera help (black line running across my photos, always in the same spot, dumped photos and it's still there). Camera is a Canon 60D.", "link": "https://www.reddit.com/r/Cameras/comments/aq282r/need_some_camera_help_black_line_running_across/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need some camera help (black line running across my photos, always in the same -----> spot !!! , dumped photos and it's still there). camera is a canon 60d.", "sortedWord": "None", "identifyer": 79788, "year": "2019"}, {"Unnamed: 0": 187782, "autor": "Duderin-o", "date": 1548236162000, "content": "Dilemma /!/ Hey r/Cameras, I was hoping I could get some advice on what should I do next gear-wise.  \n\n\nSo here's a bit of background, I started photography as a hobby 1 year ago, mainly urban / street photography. I am now looking to kind of step up my game with new stuff as I've increasingly felt limited with what I currently own, which is:\n\n* Nikon D3100 with kit Lens. Nothing else.\n\nNow my dilemma is whether I should get a prime lens (looking at a 35mm AF/S f/1.8 as it's pretty affordable on amazon) Or if I should instead save the money for a new camera, since the D3100 although it's alright, does lack some modern features like WiFi / Bluetooth connectivity.\n\nBesides, at 14.2MP I feel I have to nail the composition on the spot otherwise cropping/zooming in post processing will make it lose a ton of detail.  Furthermore, the sensitivity is also not great, you really can't push it past 800-1600ISO depending on the light. \n\nSo, in your experience, does a good starter lens really steps up your camera's capabilities? Should I get a prime lens *after* getting a more capable camera? Any advice is welcome.", "link": "https://www.reddit.com/r/Cameras/comments/aiy21a/dilemma/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dilemma /!/ hey r/cameras, i was hoping i could get some advice on what should i do next gear-wise.  \n\n\nso here's a bit of background, i started photography as a hobby 1 year ago, mainly urban / street photography. i am now looking to kind of step up my game with new stuff as i've increasingly felt limited with what i currently own, which is:\n\n* nikon d3100 with kit lens. nothing else.\n\nnow my dilemma is whether i should get a prime lens (looking at a 35mm af/s f/1.8 as it's pretty affordable on amazon) or if i should instead save the money for a new camera, since the d3100 although it's alright, does lack some modern features like wifi / bluetooth connectivity.\n\nbesides, at 14.2mp i feel i have to nail the composition on the -----> spot !!!  otherwise cropping/zooming in post processing will make it lose a ton of detail.  furthermore, the sensitivity is also not great, you really can't push it past 800-1600iso depending on the light. \n\nso, in your experience, does a good starter lens really steps up your camera's capabilities? should i get a prime lens *after* getting a more capable camera? any advice is welcome.", "sortedWord": "None", "identifyer": 80432, "year": "2019"}, {"Unnamed: 0": 187940, "autor": "lawrence-of-aphasia", "date": 1560410957000, "content": "Upgrading (sic?) from Nikon D3100 to M4/3 Etc /!/ I’ve had a Nikon D3100, which I enjoy using and which gets me reasonably good results, although I’m the first to admit that I probably don’t get the best out of the camera. It has the 18-55mm kit lens and I have a 55-200mm, although I generally just use a Nikkor 35mm 1.8f on it\n\nI’m exploring the possibility of moving either to M4/3 (I’d love to think that a new Pen-F may be in the pipeline) or to something else smaller, such as the Fujifilm X100F or Fujifilm X-T20.\n\nI’m sorry if this is a daft question, but I’m keen to know if the cameras I’ve just mentioned would be a step up in terms of image quality or whether I would be trading size and convenience for quality. I know that an up-to-date DSLR would beat these smaller formats at a similar price point, but just wonder if my eight or so years old DSLR is now behind the curve compared with these.\n\nBy analogy, I usually buy a new computer every four or five years or so, alternating between replacing my laptop and replacing my desktop. As a rule, I only buy a new laptop when the price and power developments are such that the laptop is now a more capable model than my desktop, aside from portability. So while I’d appreciate the move from my DSLR to a more compact and portable model, I only want to do this if the camera will be a better proposition aside from the size convenience.\n\nMost of the photos I take are just for on-screen consumption and I certainly don’t need something bursting with pixels so that I can make unfeasibly huge prints from my pictures. If I’m honest, my photographic “needs” could probably be largely met by current phone camera but aside from anything else there’s something I like about having a dedicated camera — I like having a proper viewfinder, and separately there’s something about getting hold of one’s camera to take pictures rather than just slipping my phone out of a pocket that I enjoy.\n\nCould I bank on each of the cameras I’ve mentioned having better focusing than the old DSLR I’m currently using? A lot of my shots come out unfocused (and I don’t doubt that some of this is my own lack of proficiency) so will this situation be improved by some of the new eye-recognition focus developments, or will the general truism that DSLR autofocus is better than compact autofocus hold true, with me being disappointed by any new purchase.\n\nIf it helps for any recommendations, I should mention that most of the photographs I take are just portraits or everyday snaps. I would like to get into street photography, but live in a country where there’s a general wariness of people photographing on the streets. As a result a small camera could be a plus, although a possible irony is that it’s perhaps better to be snapping with a big DSLR that says “I’m doing nothing furtive” rather than a discreet camera that when spotted gives the possible impression of sneakiness. I’m not sure.\n\nAnyhow, sorry that this is a bit of a ramble. Essentially I just want to know if moving from a Nikon D3100 to a M4/3, probably just using a prime that isn’t too expensive, would be a move up or down in terms of overall photographic experience, again putting aside the issues of weight. (I really don’t mind carrying my current camera around, or at least I don’t mind it enough to want to spend $800 to $1200 for something lighter but less capable.) I’ve tried searching here and elsewhere, but don’t really find anything that quite answers this.\n\nI’m posting this in more than one subreddit. I don’t know if doing so is a breach of Reddit etiquette as I’m new to this, but apologies if so.\n\nMany thanks for any thoughts.", "link": "https://www.reddit.com/r/Cameras/comments/c02svx/upgrading_sic_from_nikon_d3100_to_m43_etc/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "upgrading (sic?) from nikon d3100 to m4/3 etc /!/ i’ve had a nikon d3100, which i enjoy using and which gets me reasonably good results, although i’m the first to admit that i probably don’t get the best out of the camera. it has the 18-55mm kit lens and i have a 55-200mm, although i generally just use a nikkor 35mm 1.8f on it\n\ni’m exploring the possibility of moving either to m4/3 (i’d love to think that a new pen-f may be in the pipeline) or to something else smaller, such as the fujifilm x100f or fujifilm x-t20.\n\ni’m sorry if this is a daft question, but i’m keen to know if the cameras i’ve just mentioned would be a step up in terms of image quality or whether i would be trading size and convenience for quality. i know that an up-to-date dslr would beat these smaller formats at a similar price point, but just wonder if my eight or so years old dslr is now behind the curve compared with these.\n\nby analogy, i usually buy a new computer every four or five years or so, alternating between replacing my laptop and replacing my desktop. as a rule, i only buy a new laptop when the price and power developments are such that the laptop is now a more capable model than my desktop, aside from portability. so while i’d appreciate the move from my dslr to a more compact and portable model, i only want to do this if the camera will be a better proposition aside from the size convenience.\n\nmost of the photos i take are just for on-screen consumption and i certainly don’t need something bursting with pixels so that i can make unfeasibly huge prints from my pictures. if i’m honest, my photographic “needs” could probably be largely met by current phone camera but aside from anything else there’s something i like about having a dedicated camera — i like having a proper viewfinder, and separately there’s something about getting hold of one’s camera to take pictures rather than just slipping my phone out of a pocket that i enjoy.\n\ncould i bank on each of the cameras i’ve mentioned having better focusing than the old dslr i’m currently using? a lot of my shots come out unfocused (and i don’t doubt that some of this is my own lack of proficiency) so will this situation be improved by some of the new eye-recognition focus developments, or will the general truism that dslr autofocus is better than compact autofocus hold true, with me being disappointed by any new purchase.\n\nif it helps for any recommendations, i should mention that most of the photographs i take are just portraits or everyday snaps. i would like to get into street photography, but live in a country where there’s a general wariness of people photographing on the streets. as a result a small camera could be a plus, although a possible irony is that it’s perhaps better to be snapping with a big dslr that says “i’m doing nothing furtive” rather than a discreet camera that when -----> spotted !!!  gives the possible impression of sneakiness. i’m not sure.\n\nanyhow, sorry that this is a bit of a ramble. essentially i just want to know if moving from a nikon d3100 to a m4/3, probably just using a prime that isn’t too expensive, would be a move up or down in terms of overall photographic experience, again putting aside the issues of weight. (i really don’t mind carrying my current camera around, or at least i don’t mind it enough to want to spend $800 to $1200 for something lighter but less capable.) i’ve tried searching here and elsewhere, but don’t really find anything that quite answers this.\n\ni’m posting this in more than one subreddit. i don’t know if doing so is a breach of reddit etiquette as i’m new to this, but apologies if so.\n\nmany thanks for any thoughts.", "sortedWord": "None", "identifyer": 80595, "year": "2019"}, {"Unnamed: 0": 188167, "autor": "ChaosLogicZero", "date": 1565964461000, "content": "[4K] Blind Spot Power Junkie | Unboxing", "link": "https://www.reddit.com/r/Cameras/comments/cr6uk7/4k_blind_spot_power_junkie_unboxing/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[4k] blind -----> spot !!!  power junkie | unboxing", "sortedWord": "None", "identifyer": 80830, "year": "2019"}, {"Unnamed: 0": 188333, "autor": "xaphextwinx", "date": 1566674270000, "content": "NIKKORMAT FT2 METER BOUNCES AROUND IN THIS SPOT REGARDLESS OF LIGHT QUALITY does anyone know if I need to load film in order for the metering system to work?", "link": "https://www.reddit.com/r/Cameras/comments/cuxrq1/nikkormat_ft2_meter_bounces_around_in_this_spot/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nikkormat ft2 meter bounces around in this -----> spot !!!  regardless of light quality does anyone know if i need to load film in order for the metering system to work?", "sortedWord": "None", "identifyer": 81002, "year": "2019"}, {"Unnamed: 0": 188878, "autor": "NerfCumLauncher2", "date": 1574884765000, "content": "What is this spot on my camera and how do I get rid of it?", "link": "https://www.reddit.com/r/Cameras/comments/e2ls4g/what_is_this_spot_on_my_camera_and_how_do_i_get/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is this -----> spot !!!  on my camera and how do i get rid of it?", "sortedWord": "None", "identifyer": 81566, "year": "2019"}, {"Unnamed: 0": 188997, "autor": "Drako288", "date": 1575318306000, "content": "Searching for any nice cameras with Cyber Monday deals /!/ I don't know much about cameras and I have been researching them very recently and decided to check out Cyber Monday deals. I want be able to take beautiful, clear pictures and be able to record myself without any latency or it getting \"laggy. (I don't know the correct terminology)\" If anyone has spotted any good deals today on cameras, please let me know.", "link": "https://www.reddit.com/r/Cameras/comments/e54wp3/searching_for_any_nice_cameras_with_cyber_monday/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "searching for any nice cameras with cyber monday deals /!/ i don't know much about cameras and i have been researching them very recently and decided to check out cyber monday deals. i want be able to take beautiful, clear pictures and be able to record myself without any latency or it getting \"laggy. (i don't know the correct terminology)\" if anyone has -----> spotted !!!  any good deals today on cameras, please let me know.", "sortedWord": "None", "identifyer": 81688, "year": "2019"}, {"Unnamed: 0": 189283, "autor": "Vanpuyer", "date": 1546375729000, "content": "What type of camera and lens help shoot at night? /!/ I would love to get into photography. I take tons of pictures with my iPhone(I know nothing amazing) and would love to explore better quality shooting. My interests would be nature, landscapes, and night time shooting( like parks, schools, cities, roads with just spot lights and stuff)\n\nBudget wise I would be at  700-1200 \n\n\nWould love hear your recommendations!", "link": "https://www.reddit.com/r/Cameras/comments/abltwe/what_type_of_camera_and_lens_help_shoot_at_night/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what type of camera and lens help shoot at night? /!/ i would love to get into photography. i take tons of pictures with my iphone(i know nothing amazing) and would love to explore better quality shooting. my interests would be nature, landscapes, and night time shooting( like parks, schools, cities, roads with just -----> spot !!!  lights and stuff)\n\nbudget wise i would be at  700-1200 \n\n\nwould love hear your recommendations!", "sortedWord": "None", "identifyer": 81984, "year": "2019"}, {"Unnamed: 0": 189358, "autor": "domcaoile", "date": 1549560512000, "content": "Recommendations for Camera/Lens? /!/ Hola. Just a college student looking to get into photography as a hobby. Any suggestions for a DSLR camera and/or lens?\n\nMy budget is around $400-500, but I am willing to go as high as the $800's for a good camera. \n\nI'm just planning to take pictures of vacations or tourist spots and maybe even some sport shots of some friends if this helps.\n\nI was looking at the Nikon D3400 for starters; but since I don't know very much about cameras, I would like some opinions.\n\nAlso, some starting tips would be much appreciated. Arigato! :)", "link": "https://www.reddit.com/r/Cameras/comments/ao64yl/recommendations_for_cameralens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "recommendations for camera/lens? /!/ hola. just a college student looking to get into photography as a hobby. any suggestions for a dslr camera and/or lens?\n\nmy budget is around $400-500, but i am willing to go as high as the $800's for a good camera. \n\ni'm just planning to take pictures of vacations or tourist -----> spots !!!  and maybe even some sport shots of some friends if this helps.\n\ni was looking at the nikon d3400 for starters; but since i don't know very much about cameras, i would like some opinions.\n\nalso, some starting tips would be much appreciated. arigato! :)", "sortedWord": "None", "identifyer": 82066, "year": "2019"}, {"Unnamed: 0": 189507, "autor": "superincommunicado", "date": 1553897966000, "content": "Cleaning advice for Asahi Pentax sp1000 /!/ After 5 years neglecting my passion, I started last month with the camera and used different lenses. After the roll was developed I discovered many “spots” on the pictures , same place and size. I expect there must be dirt in the camera .\nWhat could be the reason as the camera has not been in contact with dirt/dust\nCan I clean the camera myself? And then how? what cleaning agents etc? Or does it need repair?", "link": "https://www.reddit.com/r/Cameras/comments/b73j86/cleaning_advice_for_asahi_pentax_sp1000/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning advice for asahi pentax sp1000 /!/ after 5 years neglecting my passion, i started last month with the camera and used different lenses. after the roll was developed i discovered many “-----> spots !!! ” on the pictures , same place and size. i expect there must be dirt in the camera .\nwhat could be the reason as the camera has not been in contact with dirt/dust\ncan i clean the camera myself? and then how? what cleaning agents etc? or does it need repair?", "sortedWord": "None", "identifyer": 82216, "year": "2019"}, {"Unnamed: 0": 189510, "autor": "Owlattex3", "date": 1553887865000, "content": "Astrophotography and time lapse photography /!/ Hello reddit, I've been in search for a new camera for two features I'd like to pursue at some point. I'm into photography: nature, portraits, street art.\n\nI recently got asked to do photography for real estate, I'll be taking pictures of cabins in my home town.\n\nI currently own a Canon rebel t6. Great camera, sad part is I didn't take much care of the lens and lost the lens caps and now there are scratches and blemishes on the lens. (blemishes show up as spots on photos) I've had to edit them out of photos. They still work great, just unsure on how to get the blemishes out of the lens or if it's even in the mirror. \n\nIm interested in any brand, I feel like I should buy a kit due to the condition of my current lens and it gives me a better start. I've been taking pictures for roughly 2 years. My price zone is gonna be 12 hundred.\n\nThank you! :) ", "link": "https://www.reddit.com/r/Cameras/comments/b71lcc/astrophotography_and_time_lapse_photography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "astrophotography and time lapse photography /!/ hello reddit, i've been in search for a new camera for two features i'd like to pursue at some point. i'm into photography: nature, portraits, street art.\n\ni recently got asked to do photography for real estate, i'll be taking pictures of cabins in my home town.\n\ni currently own a canon rebel t6. great camera, sad part is i didn't take much care of the lens and lost the lens caps and now there are scratches and blemishes on the lens. (blemishes show up as -----> spots !!!  on photos) i've had to edit them out of photos. they still work great, just unsure on how to get the blemishes out of the lens or if it's even in the mirror. \n\nim interested in any brand, i feel like i should buy a kit due to the condition of my current lens and it gives me a better start. i've been taking pictures for roughly 2 years. my price zone is gonna be 12 hundred.\n\nthank you! :) ", "sortedWord": "None", "identifyer": 82219, "year": "2019"}, {"Unnamed: 0": 189667, "autor": "Srilightning", "date": 1562194484000, "content": "Know little to nothing about cameras, looking for beginner setup /!/ I'm looking for a camera that's good for filming interviews, especially in nighttime and low light settings. These would most likely be on the spot interviews and I'd be using an external wired microphone when asking questions.\n\nLater on I would also like to attempt to use wireless mics. If I needed to invest for more memory that would also be fine.\n\nMy budget is $400 - $550 and currently I was eyeing the  *Canon EOS Rebel T6i Digital SLR with EF-S 18-55mm IS STM Lens.*\n\nWould this be a good choice for what I'm trying to achieve? \n\nBTW, below is a pretty good example video of the kind of stuff I'd want to do.\n\n[https://www.youtube.com/watch?v=\\_0NifGkcYPw](https://www.youtube.com/watch?v=_0NifGkcYPw)", "link": "https://www.reddit.com/r/Cameras/comments/c8uxan/know_little_to_nothing_about_cameras_looking_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "know little to nothing about cameras, looking for beginner setup /!/ i'm looking for a camera that's good for filming interviews, especially in nighttime and low light settings. these would most likely be on the -----> spot !!!  interviews and i'd be using an external wired microphone when asking questions.\n\nlater on i would also like to attempt to use wireless mics. if i needed to invest for more memory that would also be fine.\n\nmy budget is $400 - $550 and currently i was eyeing the  *canon eos rebel t6i digital slr with ef-s 18-55mm is stm lens.*\n\nwould this be a good choice for what i'm trying to achieve? \n\nbtw, below is a pretty good example video of the kind of stuff i'd want to do.\n\n[https://www.youtube.com/watch?v=\\_0nifgkcypw](https://www.youtube.com/watch?v=_0nifgkcypw)", "sortedWord": "None", "identifyer": 82379, "year": "2019"}, {"Unnamed: 0": 189789, "autor": "ibuy2manysocks", "date": 1563392796000, "content": "The blur just to the left of center in this photo shows up in the same exact spot in all my newest photos no matter what focal length. Is this irreparable? Does anyone know of a fix? Nikon D200", "link": "https://www.reddit.com/r/Cameras/comments/cehrv9/the_blur_just_to_the_left_of_center_in_this_photo/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the blur just to the left of center in this photo shows up in the same exact -----> spot !!!  in all my newest photos no matter what focal length. is this irreparable? does anyone know of a fix? nikon d200", "sortedWord": "None", "identifyer": 82507, "year": "2019"}, {"Unnamed: 0": 189973, "autor": "Xen_0n", "date": 1568349147000, "content": "Just spotted in Bangkok... wtf is this thing?", "link": "https://www.reddit.com/r/Cameras/comments/d3k2if/just_spotted_in_bangkok_wtf_is_this_thing/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  in bangkok... wtf is this thing?", "sortedWord": "None", "identifyer": 82704, "year": "2019"}, {"Unnamed: 0": 190016, "autor": "sailorscovt", "date": 1571562842000, "content": "Camera suggestions for the clueless? /!/ Hello! I apologise if this isn't the right sub to ask this question, but I've really wanted to invest in a decent camera for a long while. There are so many options though so it's been a bit daunting and so I'd love some advice/suggestions. \n\nI want something that's a step up from your standard compact digital camera but not as advanced/expensive as a DSLR. I'd really like it if it had video capabilities too and if it also had the ability to bluetooth link to my phone/laptop so I can access my photos on the spot. But like I said I'm clueless so I don't know if what I'm asking for is reasonable or unreasonable. \n\nI would mainly just be using it to take photos when I'm traveling for my own personal collection and photos/videos of my pets. \n\nThank you in advanced!", "link": "https://www.reddit.com/r/Cameras/comments/dkhazz/camera_suggestions_for_the_clueless/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera suggestions for the clueless? /!/ hello! i apologise if this isn't the right sub to ask this question, but i've really wanted to invest in a decent camera for a long while. there are so many options though so it's been a bit daunting and so i'd love some advice/suggestions. \n\ni want something that's a step up from your standard compact digital camera but not as advanced/expensive as a dslr. i'd really like it if it had video capabilities too and if it also had the ability to bluetooth link to my phone/laptop so i can access my photos on the -----> spot !!! . but like i said i'm clueless so i don't know if what i'm asking for is reasonable or unreasonable. \n\ni would mainly just be using it to take photos when i'm traveling for my own personal collection and photos/videos of my pets. \n\nthank you in advanced!", "sortedWord": "None", "identifyer": 82748, "year": "2019"}], "name": "spotCameras2019"}