{"interestingcomments": [{"Unnamed: 0": 176246, "autor": "Archeob", "date": 1520445720000, "content": "Rugged cera for hiking and a Kilimandjaro trip? /!/ Hi, and thank for your help!\n\nI've been an avid hiker for a few years and after experimenting early-on with an older Canon Rebel XSi, I bought a Panasonic Lumix DMC-TS2 that I've been using for about five years.\n\nThis camera has survived scratches at the bottom of my bag, in my coat pocket, rain, mud, snow etc and still works pretty well... but compared to my phone pictures now don't look too great anymore. Nowadays when I reach the summit or a very scenic spot I take some time to fish my phone from my bag to do a few selfies, videos, panaromas and the very best shots. I use my smartphone (a Galaxy Note 5) for 99% of my photos, so I only use the TS2 on these hikes when on the trail.\n\nNow I'm leaving in a few months to go hiking in Africa and the Kilimandjaro and I'd like some advice on what I should do or buy.\n\nWhat I need:\n* Something that is easily pocketable\n* Weather resistance\n* A wide-angle lens\n* Good battery life\n* Under 500$\n\nThis is what I'm considering:\n\nOption A) Keep my setup using the TS2 for \"normal\" shots and my phone for \"keepers\" or videos.\n\nMy concern is that the TS2 is really dated and I don't want to regret anything when I look and these photos in 15 years. My Note 5 is in a very robust case but still battery life is a concern, and If I drop it I'll be in trouble.\n\nOption B) Only use my phone.\n\nThis means getting an ultra rugged case with a thick screen protector. Plus, I really doesn't fit too well in my coat pocket with a full case.\n\nOption C) Buy another hiking camera and only use that.\n\nI'm seriously looking at an Olympus TG-5, but it's expensive and is the picture quality better than my Note 5? This is something I'll probably not be using more than 10-12 times per year after the Kilimandjaro trip and honestly I've done some many hikes that I don't *really* look at the photos much afterwards. And if I do buy a new camera, it would really have to be a compact and rugged model because these are the two things and newer smartphones don't do too well.\n\nI'd appreciate any suggestions, thank you!\n\nEdit: It just occured to me that for the price of the TG-5 I could probably upgrade my phone for the Note 5 to the Note 8 and get a better phone AND camera. Maybe with a really good case it would work out, what do you all think?", "link": "https://www.reddit.com/r/Cameras/comments/82qaoc/rugged_cera_for_hiking_and_a_kilimandjaro_trip/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "rugged cera for hiking and a kilimandjaro trip? /!/ hi, and thank for your help!\n\ni've been an avid hiker for a few years and after experimenting early-on with an older canon rebel xsi, i bought a panasonic lumix dmc-ts2 that i've been using for about five years.\n\nthis camera has survived scratches at the bottom of my bag, in my coat pocket, rain, mud, snow etc and still works pretty well... but compared to my phone pictures now don't look too great anymore. nowadays when i reach the summit or a very scenic -----> spot !!!  i take some time to fish my phone from my bag to do a few selfies, videos, panaromas and the very best shots. i use my smartphone (a galaxy note 5) for 99% of my photos, so i only use the ts2 on these hikes when on the trail.\n\nnow i'm leaving in a few months to go hiking in africa and the kilimandjaro and i'd like some advice on what i should do or buy.\n\nwhat i need:\n* something that is easily pocketable\n* weather resistance\n* a wide-angle lens\n* good battery life\n* under 500$\n\nthis is what i'm considering:\n\noption a) keep my setup using the ts2 for \"normal\" shots and my phone for \"keepers\" or videos.\n\nmy concern is that the ts2 is really dated and i don't want to regret anything when i look and these photos in 15 years. my note 5 is in a very robust case but still battery life is a concern, and if i drop it i'll be in trouble.\n\noption b) only use my phone.\n\nthis means getting an ultra rugged case with a thick screen protector. plus, i really doesn't fit too well in my coat pocket with a full case.\n\noption c) buy another hiking camera and only use that.\n\ni'm seriously looking at an olympus tg-5, but it's expensive and is the picture quality better than my note 5? this is something i'll probably not be using more than 10-12 times per year after the kilimandjaro trip and honestly i've done some many hikes that i don't *really* look at the photos much afterwards. and if i do buy a new camera, it would really have to be a compact and rugged model because these are the two things and newer smartphones don't do too well.\n\ni'd appreciate any suggestions, thank you!\n\nedit: it just occured to me that for the price of the tg-5 i could probably upgrade my phone for the note 5 to the note 8 and get a better phone and camera. maybe with a really good case it would work out, what do you all think?", "sortedWord": "None", "identifyer": 68660, "year": "2018"}, {"Unnamed: 0": 176610, "autor": "NullandRandom", "date": 1530102698000, "content": "How to clean the spot/dust particle on sensor? /!/ I have a little weird situation. I have Nikon d5300 on which I can see a dust or some small particle from the view finder. But when I click a picture the spot doesn't come in the final picture. So I don't know how to remove it from there. Any help is appropriated.", "link": "https://www.reddit.com/r/Cameras/comments/8u97w1/how_to_clean_the_spotdust_particle_on_sensor/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to clean the -----> spot !!! /dust particle on sensor? /!/ i have a little weird situation. i have nikon d5300 on which i can see a dust or some small particle from the view finder. but when i click a picture the spot doesn't come in the final picture. so i don't know how to remove it from there. any help is appropriated.", "sortedWord": "None", "identifyer": 69024, "year": "2018"}, {"Unnamed: 0": 176645, "autor": "JustinGoldz", "date": 1529909706000, "content": "Good GoPro alternative? /!/ I'm not sure if this is the best spot to post or not, but I am looking to buy go pro alternatives, I likely will not be jumping off cliffs with it, or deep diving. Rather mounting it to my windshield (Probably 2) facing either seat for a car podcast sort of deal to put it simply. I will also be mounting them outside the car periodically during a drag strip night, or a canyon cruise. I was looking at the Akaso cameras. I am unfamiliar with them, but they also do not have an external mic plug in which is a downside but still workable. Are there any other options I should look into? I just do not want to drop $700 on just 2 GoPros and end up not getting my money worth. Especially since I am still playing with my current DSLR to determine if I am keeping it or getting another.", "link": "https://www.reddit.com/r/Cameras/comments/8tog4l/good_gopro_alternative/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good gopro alternative? /!/ i'm not sure if this is the best -----> spot !!!  to post or not, but i am looking to buy go pro alternatives, i likely will not be jumping off cliffs with it, or deep diving. rather mounting it to my windshield (probably 2) facing either seat for a car podcast sort of deal to put it simply. i will also be mounting them outside the car periodically during a drag strip night, or a canyon cruise. i was looking at the akaso cameras. i am unfamiliar with them, but they also do not have an external mic plug in which is a downside but still workable. are there any other options i should look into? i just do not want to drop $700 on just 2 gopros and end up not getting my money worth. especially since i am still playing with my current dslr to determine if i am keeping it or getting another.", "sortedWord": "None", "identifyer": 69059, "year": "2018"}, {"Unnamed: 0": 176666, "autor": "alexFriend", "date": 1533511707000, "content": "Can you spot what’s out of place?", "link": "https://www.reddit.com/r/Cameras/comments/94w8e3/can_you_spot_whats_out_of_place/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you -----> spot !!!  what’s out of place?", "sortedWord": "None", "identifyer": 69080, "year": "2018"}, {"Unnamed: 0": 176689, "autor": "gustavposts", "date": 1533396804000, "content": "Sigma Lens cleaning help - little smudge spots won't go away /!/ Hi,\n\nI'm a beginner to photography with a DSLR, and have naturally caused a few smudges on my Sigma lens. These have all gone away by cleaning with a microfiber cloth, but now there are a couple of small spots across one section of the lens. These look like regular grease smudges but are more like little dots, and won't go away when I scrub the lens.\n\nHave I scratched the lens by using a possibly dirty microfibre cloth, or do I need to apply a different solution?\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/94jyjz/sigma_lens_cleaning_help_little_smudge_spots_wont/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sigma lens cleaning help - little smudge -----> spots !!!  won't go away /!/ hi,\n\ni'm a beginner to photography with a dslr, and have naturally caused a few smudges on my sigma lens. these have all gone away by cleaning with a microfiber cloth, but now there are a couple of small spots across one section of the lens. these look like regular grease smudges but are more like little dots, and won't go away when i scrub the lens.\n\nhave i scratched the lens by using a possibly dirty microfibre cloth, or do i need to apply a different solution?\n\nthanks!", "sortedWord": "None", "identifyer": 69103, "year": "2018"}, {"Unnamed: 0": 176714, "autor": "new-day-will-dawn", "date": 1533307573000, "content": "What camera is this guy using? /!/ Hey guys,\n\nI came across [this YouTube video](https://youtu.be/3dqeZq1wJ6k?t=22s) and I thought it looked great. Don't mind the content, I have no idea who he is. But I couldn't find any information about what camera he used to record this video and couldn't spot like a reflection or anything.\n\nSo here I am, hoping you can point me in the right direction. I just thought it looks great (especially for night).\n\nIf this post is against the rules I apologize, but I didn't know where else to post.\n\nThanks!!", "link": "https://www.reddit.com/r/Cameras/comments/94a6nd/what_camera_is_this_guy_using/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what camera is this guy using? /!/ hey guys,\n\ni came across [this youtube video](https://youtu.be/3dqezq1wj6k?t=22s) and i thought it looked great. don't mind the content, i have no idea who he is. but i couldn't find any information about what camera he used to record this video and couldn't -----> spot !!!  like a reflection or anything.\n\nso here i am, hoping you can point me in the right direction. i just thought it looks great (especially for night).\n\nif this post is against the rules i apologize, but i didn't know where else to post.\n\nthanks!!", "sortedWord": "None", "identifyer": 69129, "year": "2018"}, {"Unnamed: 0": 176977, "autor": "vindellama", "date": 1545918300000, "content": "Trading a Panasonic G7 for a Galaxy Note 9??? Doable? /!/ Hi!\n\nI have a Panasonic G7 with the kit lens and the 25mm 1.7.\n\nI use it for trips, recording acoustic guitar videos, and for product/work pictures(RAW).\n\nMy complaints so far...\n\nCouldn't shoot a waterfall overflowing with rain water, since the G7 isn't waterproof.\n\nVideo skin tones are a bit off, going towards grey/green. \n\nRequiring you to be spot on with the white balance and using a white/grey/black card for fine tuning with the RGB curves.\n\nThe colors tend to be oversaturated when you increase the contrast.\n\nThe performance is poor in reduced light even with the 25mm 1.7 wide open requiring decent direct lighting even on 800 ISO .\n\nWith RAW pictures WB is also tricky (using the camera profiles in lightroom) with some weird colour cast with anything but natural lighting, requiring you to reduce the saturation of some colours.\n\nSo... I discovered the features of the note 9, and in theory I could do all my work directly on the phone... Take pictures/edit/post on instagram and answer clients. And with the 8gb version I could even edit 4k videos (I think) when adobe premiere rush is available. And it is water resistent... All that with 2 fixed focal lenghts and 1 zoom lens. (aperture seems to be fixed tough... 1 of them has 2 aperture settings?)\n\nMy only doubt is... How is the quality of the cameras on this phone comparable to the G7? The picture resolution seems to be the same, not sure about the pixel by pixel quality since I don't have a note 9 to compare.\n\nFrom reviews the auto-exposure for videos in the built-in app is mediocre. I wonder if you can set the exposure manually as you would with the G7 to avoid clipping on the highlights. The same with pictures.\n\nAnother complaint in the video part is that they are oversharpened. Any workaround for that also?\n\nSo what do you guys think? Would it be a good trade or would I just be trading off better quality for \"ease of use\"?", "link": "https://www.reddit.com/r/Cameras/comments/a9zbwh/trading_a_panasonic_g7_for_a_galaxy_note_9_doable/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "trading a panasonic g7 for a galaxy note 9??? doable? /!/ hi!\n\ni have a panasonic g7 with the kit lens and the 25mm 1.7.\n\ni use it for trips, recording acoustic guitar videos, and for product/work pictures(raw).\n\nmy complaints so far...\n\ncouldn't shoot a waterfall overflowing with rain water, since the g7 isn't waterproof.\n\nvideo skin tones are a bit off, going towards grey/green. \n\nrequiring you to be -----> spot !!!  on with the white balance and using a white/grey/black card for fine tuning with the rgb curves.\n\nthe colors tend to be oversaturated when you increase the contrast.\n\nthe performance is poor in reduced light even with the 25mm 1.7 wide open requiring decent direct lighting even on 800 iso .\n\nwith raw pictures wb is also tricky (using the camera profiles in lightroom) with some weird colour cast with anything but natural lighting, requiring you to reduce the saturation of some colours.\n\nso... i discovered the features of the note 9, and in theory i could do all my work directly on the phone... take pictures/edit/post on instagram and answer clients. and with the 8gb version i could even edit 4k videos (i think) when adobe premiere rush is available. and it is water resistent... all that with 2 fixed focal lenghts and 1 zoom lens. (aperture seems to be fixed tough... 1 of them has 2 aperture settings?)\n\nmy only doubt is... how is the quality of the cameras on this phone comparable to the g7? the picture resolution seems to be the same, not sure about the pixel by pixel quality since i don't have a note 9 to compare.\n\nfrom reviews the auto-exposure for videos in the built-in app is mediocre. i wonder if you can set the exposure manually as you would with the g7 to avoid clipping on the highlights. the same with pictures.\n\nanother complaint in the video part is that they are oversharpened. any workaround for that also?\n\nso what do you guys think? would it be a good trade or would i just be trading off better quality for \"ease of use\"?", "sortedWord": "None", "identifyer": 69397, "year": "2018"}, {"Unnamed: 0": 177177, "autor": "24karatcarrot", "date": 1518940554000, "content": "Need help choosing a zoom lens. /!/ My friend's birthday is coming up, and he's really into photography. He wants to be able to take pictures of his kids when they are out on an island off the shore of their favorite vacation spot, but needs a lens that can zoom far enough.\n\nHe has a Cannon Rebel T5i eos 700D, and the distance to the island is roughly 675 meters from the shore. I'd imagine he'd want the dimension of the frame to be something like 10ft by 10ft. Is there a reasonably priced zoom lens that can make this happen? I don't really know anything about cameras, I just know that this is something he'd be thrilled about.\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/7yczp1/need_help_choosing_a_zoom_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need help choosing a zoom lens. /!/ my friend's birthday is coming up, and he's really into photography. he wants to be able to take pictures of his kids when they are out on an island off the shore of their favorite vacation -----> spot !!! , but needs a lens that can zoom far enough.\n\nhe has a cannon rebel t5i eos 700d, and the distance to the island is roughly 675 meters from the shore. i'd imagine he'd want the dimension of the frame to be something like 10ft by 10ft. is there a reasonably priced zoom lens that can make this happen? i don't really know anything about cameras, i just know that this is something he'd be thrilled about.\n\nthanks!", "sortedWord": "None", "identifyer": 69600, "year": "2018"}, {"Unnamed: 0": 177538, "autor": "Fakent_", "date": 1522967786000, "content": "Sony hx20v - Dark spots Dark streaks? /!/ Not sure which is the issue tbh I was using the camera in the rain and it was pretty heavy rain so I guess some water got in and now when I go to take a photo and the flash setting is set to off the screen is super dark but when flash is set to always on the screen is back to normal anyone know whats wrong? ", "link": "https://www.reddit.com/r/Cameras/comments/8a49pq/sony_hx20v_dark_spots_dark_streaks/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sony hx20v - dark -----> spots !!!  dark streaks? /!/ not sure which is the issue tbh i was using the camera in the rain and it was pretty heavy rain so i guess some water got in and now when i go to take a photo and the flash setting is set to off the screen is super dark but when flash is set to always on the screen is back to normal anyone know whats wrong? ", "sortedWord": "None", "identifyer": 69965, "year": "2018"}, {"Unnamed: 0": 177989, "autor": "thefeuerfliege", "date": 1528289702000, "content": "Canon 600D or 650D? /!/ I've been after a Canon 600D, looking at around £215ish. However, just spotted a Canon 650D and they only want £250 for it. Great condition, low shutter count.  \n\n\nIs it worth the extra? Am I losing out on anything? Usually newer = better but this isn't always the case so I'd like to check with you folks! Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/8p0dbn/canon_600d_or_650d/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "canon 600d or 650d? /!/ i've been after a canon 600d, looking at around £215ish. however, just -----> spotted !!!  a canon 650d and they only want £250 for it. great condition, low shutter count.  \n\n\nis it worth the extra? am i losing out on anything? usually newer = better but this isn't always the case so i'd like to check with you folks! thanks!", "sortedWord": "None", "identifyer": 70422, "year": "2018"}, {"Unnamed: 0": 178144, "autor": "Giggmaster", "date": 1531710769000, "content": "Got two old lenses - looking for advice! /!/ Experts !\n\nLike many others I am around just learning with the best photographers here but I guess I need some experienced advice now!\n\nSo I dont have much experience with old lenses or old film cameras besides what I read here and in other places but definitely I am interested to adventure myself in some of the old cameras sooner or later but as I said in the title someone donated to me two lenses that I thought pretty cool ! They are:\n\n1.\tCanon FD200mm f/2.8 S.S.C. [From Canon Museum](https://global.canon/en/c-museum/product/fd172.html)\n2.\tCanon New FD35-70mm f/3.5-4.5 [From Canon Museum](https://global.canon/en/c-museum/product/nfd242.html)\n\nOf course when I got those lenses everything was so dirty so I spent a significant amount of time carefully cleaning up everything before I started to evaluate what was the real situation of those lenses... but I dont have a FD-type Camera to test if it is really working so here are my questions:\n\n1.\tI really wanted to return somehow that donation and I thought about gifting her with a picture using one of these lenses, but since I dont have a compatible Camera is it worth to get one of those FD&gt;EF adapter? I am more concerned with the overall photo quality here... am I going to lose anything important with that adapter?\n2.\tThe 200mm itself looks ok (no fungus, nothing apparently wrong) .. except if I look at the front of the lens it looks like it fell off (attached photo). Something I should worry about here?\n3.\tNow if I talk about the 35-70mm - it came with a Hoya filter and if you look at the filter (photo) the situation is not very nice (fungus, right?) .. ok just removed the filter, cleaning up everything again and apart from that the front looks ok but if I look at the back I really tried to clean everything but there is a spot I cannot clean from the outside (damn fungus again, right?) .. any thought there? is it $worth$ to fix that?\n4.\tWhen I was cleaning up those lenses I tried to use water and Isopropyl alcohol (trust me - no way to do a regular cleaning here) .. any other product I could or should use to clean up the exterior and give a better appearance?\n5.\tLast but not the least - anything I am missing here I should be concerned?\n\nAll pics are here: [](https://imgur.com/a/86TRjbm)\n\nTHANK YOU VERY MUCH EXPERTS !! :)", "link": "https://www.reddit.com/r/Cameras/comments/8z7i5c/got_two_old_lenses_looking_for_advice/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "got two old lenses - looking for advice! /!/ experts !\n\nlike many others i am around just learning with the best photographers here but i guess i need some experienced advice now!\n\nso i dont have much experience with old lenses or old film cameras besides what i read here and in other places but definitely i am interested to adventure myself in some of the old cameras sooner or later but as i said in the title someone donated to me two lenses that i thought pretty cool ! they are:\n\n1.\tcanon fd200mm f/2.8 s.s.c. [from canon museum](https://global.canon/en/c-museum/product/fd172.html)\n2.\tcanon new fd35-70mm f/3.5-4.5 [from canon museum](https://global.canon/en/c-museum/product/nfd242.html)\n\nof course when i got those lenses everything was so dirty so i spent a significant amount of time carefully cleaning up everything before i started to evaluate what was the real situation of those lenses... but i dont have a fd-type camera to test if it is really working so here are my questions:\n\n1.\ti really wanted to return somehow that donation and i thought about gifting her with a picture using one of these lenses, but since i dont have a compatible camera is it worth to get one of those fd&gt;ef adapter? i am more concerned with the overall photo quality here... am i going to lose anything important with that adapter?\n2.\tthe 200mm itself looks ok (no fungus, nothing apparently wrong) .. except if i look at the front of the lens it looks like it fell off (attached photo). something i should worry about here?\n3.\tnow if i talk about the 35-70mm - it came with a hoya filter and if you look at the filter (photo) the situation is not very nice (fungus, right?) .. ok just removed the filter, cleaning up everything again and apart from that the front looks ok but if i look at the back i really tried to clean everything but there is a -----> spot !!!  i cannot clean from the outside (damn fungus again, right?) .. any thought there? is it $worth$ to fix that?\n4.\twhen i was cleaning up those lenses i tried to use water and isopropyl alcohol (trust me - no way to do a regular cleaning here) .. any other product i could or should use to clean up the exterior and give a better appearance?\n5.\tlast but not the least - anything i am missing here i should be concerned?\n\nall pics are here: [](https://imgur.com/a/86trjbm)\n\nthank you very much experts !! :)", "sortedWord": "None", "identifyer": 70580, "year": "2018"}, {"Unnamed: 0": 178259, "autor": "DisgruntledLamp", "date": 1532928557000, "content": "Need camera suggestions /!/ I like taking photographys from low angles to make small things look like a new landscape. (puddles become lakes, holes become canyons, etc) I'm currently using my iPhone 6 which works well because I can fit it into different crevices, holes, spots and such. It's very convenient because I can hold my phone take the picture and everything with one hand.\n\nDoes anybody have any suggestions of actual camera that are better? The biggest thing for me is how low of an angle I can go and how detailed the camera can get.", "link": "https://www.reddit.com/r/Cameras/comments/931e7b/need_camera_suggestions/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need camera suggestions /!/ i like taking photographys from low angles to make small things look like a new landscape. (puddles become lakes, holes become canyons, etc) i'm currently using my iphone 6 which works well because i can fit it into different crevices, holes, -----> spots !!!  and such. it's very convenient because i can hold my phone take the picture and everything with one hand.\n\ndoes anybody have any suggestions of actual camera that are better? the biggest thing for me is how low of an angle i can go and how detailed the camera can get.", "sortedWord": "None", "identifyer": 70697, "year": "2018"}, {"Unnamed: 0": 178428, "autor": "JDFidelius", "date": 1541199209000, "content": "Resale value with scratch on front element that doesn't affect picture /!/ I bought a lens off of ebay that was in \"New - Other\" condition since it was only used once. The low resolution photos in the post showed what looked like some dust specs on the front element that would easily be blown off or wiped away. Anyway, I got the lens today and went to wipe off the dust but two spots remained - turns out they were actual scratches in the glass. Immediately I went to figure out if they affected the image, but even at f/22 I saw no evidence, so I tested to see if the light hitting the scratches even went to the sensor by placing my finger right over them and wiggling it and looking through the viewfinder.\n\nIt turns out that the scratches are actually right on the bottom of the front element, and the light that goes through them does not actually reach the sensor - it's in the part of the image circle that is not captured by the sensor. Of course the buyer had an inaccurate post (no mention of scratches; 'new - other' requires item to be in flawless condition) so I will most likely return it for a refund and buy a truly new one for about $15 more, but that's quite the hassle, hence my question: how much do scratches affect the resale value when they're cosmetic, even if they happen to be on the front element?\n\nI am following up with the seller to see if he was even aware of the scratches, and if not, how come he didn't even though he took photos of the front element. For reference it's a Tamron 24-70mm G2, which was released about a year ago, so there aren't that many used ones on the market.\n\ntldr; scratches on front element that only affect light not captured by the sensor since they're on the outside of the image circle. How is resale value affected?", "link": "https://www.reddit.com/r/Cameras/comments/9tp0lc/resale_value_with_scratch_on_front_element_that/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "resale value with scratch on front element that doesn't affect picture /!/ i bought a lens off of ebay that was in \"new - other\" condition since it was only used once. the low resolution photos in the post showed what looked like some dust specs on the front element that would easily be blown off or wiped away. anyway, i got the lens today and went to wipe off the dust but two -----> spots !!!  remained - turns out they were actual scratches in the glass. immediately i went to figure out if they affected the image, but even at f/22 i saw no evidence, so i tested to see if the light hitting the scratches even went to the sensor by placing my finger right over them and wiggling it and looking through the viewfinder.\n\nit turns out that the scratches are actually right on the bottom of the front element, and the light that goes through them does not actually reach the sensor - it's in the part of the image circle that is not captured by the sensor. of course the buyer had an inaccurate post (no mention of scratches; 'new - other' requires item to be in flawless condition) so i will most likely return it for a refund and buy a truly new one for about $15 more, but that's quite the hassle, hence my question: how much do scratches affect the resale value when they're cosmetic, even if they happen to be on the front element?\n\ni am following up with the seller to see if he was even aware of the scratches, and if not, how come he didn't even though he took photos of the front element. for reference it's a tamron 24-70mm g2, which was released about a year ago, so there aren't that many used ones on the market.\n\ntldr; scratches on front element that only affect light not captured by the sensor since they're on the outside of the image circle. how is resale value affected?", "sortedWord": "None", "identifyer": 70869, "year": "2018"}, {"Unnamed: 0": 178675, "autor": "dabnada", "date": 1542263409000, "content": "Need help with black spots showing up on images - more info in comments", "link": "https://www.reddit.com/r/Cameras/comments/9x8otr/need_help_with_black_spots_showing_up_on_images/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need help with black -----> spots !!!  showing up on images - more info in comments", "sortedWord": "None", "identifyer": 71120, "year": "2018"}, {"Unnamed: 0": 178712, "autor": "bshtick", "date": 1542062170000, "content": "dropped nikon 55mm f3.5 macro but it still works...I think? /!/ I dropped my {see above} lens face first on the pavement with a d3300 behind it.  I took a picture at min. focusing distance of a parallel wall and all seems fine, but the focus helical has a couple spots where there's ever so slightly more resistance than before; sort of like if there was more grease at some spots than others.  Anyone know what might cause this?  It's a unit focusing lens where all the elements are moved forward and backward in a sleeve within the lens body.", "link": "https://www.reddit.com/r/Cameras/comments/9wizce/dropped_nikon_55mm_f35_macro_but_it_still_worksi/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dropped nikon 55mm f3.5 macro but it still works...i think? /!/ i dropped my {see above} lens face first on the pavement with a d3300 behind it.  i took a picture at min. focusing distance of a parallel wall and all seems fine, but the focus helical has a couple -----> spots !!!  where there's ever so slightly more resistance than before; sort of like if there was more grease at some -----> spots !!!  than others.  anyone know what might cause this?  it's a unit focusing lens where all the elements are moved forward and backward in a sleeve within the lens body.", "sortedWord": "None", "identifyer": 71157, "year": "2018"}, {"Unnamed: 0": 179216, "autor": "Cuecast", "date": 1519706082000, "content": "Canon G7X Mark II alternatives? /!/ Hey, recently been wanting to dabble back into photography, not looking for an SLR but I am looking for an affordable digital camera that will do a good job taking photos. \n\nPerspective shots, Macro, Close ups, Shallow depth of field photos, colour vibrancy, low light photos (and one that is able to pick up the stars) is what im looking for in a camera for now to ease myself back in.\n\nI've done a bit of googling around and I've found the Canon G7X Mark II seems to pop up a lot for an affordable camera that is of a good quality. (Seeing them around £350-£400)\n\nAre there any alternatives to the Canon that are cheaper/ just as good/ better, or is the canon the best I'm going to get for my price range?\n\nI was looking at the Nikon Coolpix P900 for that zoom, but the canon still outclasses it in everything else other than zoom so the canon is still in top spot for now.\n\nI know digital cameras are limited with certain capabilities, but if anyone can give me a yes to the canon or a recommendation on another camera within what I'm looking for that'd be great.", "link": "https://www.reddit.com/r/Cameras/comments/80jnab/canon_g7x_mark_ii_alternatives/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon g7x mark ii alternatives? /!/ hey, recently been wanting to dabble back into photography, not looking for an slr but i am looking for an affordable digital camera that will do a good job taking photos. \n\nperspective shots, macro, close ups, shallow depth of field photos, colour vibrancy, low light photos (and one that is able to pick up the stars) is what im looking for in a camera for now to ease myself back in.\n\ni've done a bit of googling around and i've found the canon g7x mark ii seems to pop up a lot for an affordable camera that is of a good quality. (seeing them around £350-£400)\n\nare there any alternatives to the canon that are cheaper/ just as good/ better, or is the canon the best i'm going to get for my price range?\n\ni was looking at the nikon coolpix p900 for that zoom, but the canon still outclasses it in everything else other than zoom so the canon is still in top -----> spot !!!  for now.\n\ni know digital cameras are limited with certain capabilities, but if anyone can give me a yes to the canon or a recommendation on another camera within what i'm looking for that'd be great.", "sortedWord": "None", "identifyer": 71667, "year": "2018"}, {"Unnamed: 0": 179501, "autor": "poor-men-sworn-in", "date": 1524816597000, "content": "Does the common white spot problem on the Minolta m 28mm 2.8 affect image quality? Do lenses that dont have it now develop it in the future? /!/ Found a decent copy with a minor case of white spots for about £300 should i buy it or go for the good condition one for £400.", "link": "https://www.reddit.com/r/Cameras/comments/8fa0jf/does_the_common_white_spot_problem_on_the_minolta/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does the common white -----> spot !!!  problem on the minolta m 28mm 2.8 affect image quality? do lenses that dont have it now develop it in the future? /!/ found a decent copy with a minor case of white spots for about £300 should i buy it or go for the good condition one for £400.", "sortedWord": "None", "identifyer": 71959, "year": "2018"}, {"Unnamed: 0": 179809, "autor": "quintus000", "date": 1527674153000, "content": "New c920 HD webcam, vertical light stripes always showing... is it DOA? /!/ The image says everything. \n\n*Processing img toz2gsnsty011...*\n\nJust got it, new, from amazon.\n\nAny idea of what it is? It's always displaying on the same spot, I've got latest drivers and tried to see the view in different apps...", "link": "https://www.reddit.com/r/Cameras/comments/8n7buh/new_c920_hd_webcam_vertical_light_stripes_always/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "new c920 hd webcam, vertical light stripes always showing... is it doa? /!/ the image says everything. \n\n*processing img toz2gsnsty011...*\n\njust got it, new, from amazon.\n\nany idea of what it is? it's always displaying on the same -----> spot !!! , i've got latest drivers and tried to see the view in different apps...", "sortedWord": "None", "identifyer": 72275, "year": "2018"}, {"Unnamed: 0": 179956, "autor": "yzx321", "date": 1529117143000, "content": "Got a used camera for a good deal, there are these spots in the viewfinder when viewed from a distance, but you cant see them up close or in images. What are they / is this ok?", "link": "https://www.reddit.com/r/Cameras/comments/8rgic9/got_a_used_camera_for_a_good_deal_there_are_these/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "got a used camera for a good deal, there are these -----> spots !!!  in the viewfinder when viewed from a distance, but you cant see them up close or in images. what are they / is this ok?", "sortedWord": "None", "identifyer": 72424, "year": "2018"}, {"Unnamed: 0": 180075, "autor": "JCS-DOP", "date": 1530968177000, "content": "Commercial Spot for Mercedes, what do you guys think? Shot on ARRI ALEXA Mini &amp; Summicron C.", "link": "https://www.reddit.com/r/Cameras/comments/8wsyzd/commercial_spot_for_mercedes_what_do_you_guys/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "commercial -----> spot !!!  for mercedes, what do you guys think? shot on arri alexa mini &amp; summicron c.", "sortedWord": "None", "identifyer": 72544, "year": "2018"}, {"Unnamed: 0": 180442, "autor": "kyivstar", "date": 1535311789000, "content": "Compact zoom camera to replace lost Canon S120 PowerShot? /!/ Looking for a good compact point-and-shoot camera with optical zoom to replace the Canon S120 that I just lost. I loved that camera! Before that, I had another Canon compact zoom camera, so I'm partial to those. I noticed on Amazon that there are several newer models, going all the way up to model numbers in the 700s. However, some of the newer ones don't have great reviews (overly complicated, removed good features, etc.). \n\nI'm considering just buying a replacement S120 on ebay, but a) they're pretty pricey compared no new models that may be better, and b) if they're used, they could have spots on the sensor or other issues.\n\nAny advice? \nAlso, I would prefer to spend $300 or less, especially as these often get lost, dropped, dirty, etc.", "link": "https://www.reddit.com/r/Cameras/comments/9ai8qp/compact_zoom_camera_to_replace_lost_canon_s120/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "compact zoom camera to replace lost canon s120 powershot? /!/ looking for a good compact point-and-shoot camera with optical zoom to replace the canon s120 that i just lost. i loved that camera! before that, i had another canon compact zoom camera, so i'm partial to those. i noticed on amazon that there are several newer models, going all the way up to model numbers in the 700s. however, some of the newer ones don't have great reviews (overly complicated, removed good features, etc.). \n\ni'm considering just buying a replacement s120 on ebay, but a) they're pretty pricey compared no new models that may be better, and b) if they're used, they could have -----> spots !!!  on the sensor or other issues.\n\nany advice? \nalso, i would prefer to spend $300 or less, especially as these often get lost, dropped, dirty, etc.", "sortedWord": "None", "identifyer": 72924, "year": "2018"}, {"Unnamed: 0": 180644, "autor": "Stuzozo", "date": 1543298708000, "content": "Street Photography in HONG KONG || 4 Best Spots and Shots", "link": "https://www.reddit.com/r/Cameras/comments/a0s32p/street_photography_in_hong_kong_4_best_spots_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "street photography in hong kong || 4 best -----> spots !!!  and shots", "sortedWord": "None", "identifyer": 73128, "year": "2018"}, {"Unnamed: 0": 180655, "autor": "AlizaAlvares", "date": 1543246599000, "content": "FLIR TG165 Spot Thermal CameraIs Now Cyber Monday Deals Discount20%Off", "link": "https://www.reddit.com/r/Cameras/comments/a0kcbz/flir_tg165_spot_thermal_camerais_now_cyber_monday/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "flir tg165 -----> spot !!!  thermal camerais now cyber monday deals discount20%off", "sortedWord": "None", "identifyer": 73139, "year": "2018"}, {"Unnamed: 0": 180736, "autor": "rymc27", "date": 1544497394000, "content": "Camera for Christmas /!/ Hello Reddit! I have fallen in love with photography. I took a class during high school last year and one with a professional photographer. I only use my phone, GoPro and DJI Phantom drone, but I want to step it up with a DSLR. I was looking at some sort of Canon EOS Rebel, but I’m not sure. Max budget of 400, ideally $350. I know it’s not much, but I am looking for a decent camera atm. Thanks. \n\nI want to apologize if this is not the right spot for it, and thank you ahead of time for your help. Have a nice night", "link": "https://www.reddit.com/r/Cameras/comments/a52uve/camera_for_christmas/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera for christmas /!/ hello reddit! i have fallen in love with photography. i took a class during high school last year and one with a professional photographer. i only use my phone, gopro and dji phantom drone, but i want to step it up with a dslr. i was looking at some sort of canon eos rebel, but i’m not sure. max budget of 400, ideally $350. i know it’s not much, but i am looking for a decent camera atm. thanks. \n\ni want to apologize if this is not the right -----> spot !!!  for it, and thank you ahead of time for your help. have a nice night", "sortedWord": "None", "identifyer": 73224, "year": "2018"}, {"Unnamed: 0": 181008, "autor": "omgwtfbbqcake", "date": 1524296901000, "content": "Camera recommendation - $1000-$1500 /!/ Hi :)\n\nLooking for a camera that is relatively lightweight and easy to carry around as I really only use it to take photos while traveling. \nMainly to take photo of my SO and family.\n\nIm currently using a RX100V, I think its a great camera and theres still lots to learn. However with alot of popular tourist spots its a struggle to get enough distance between my SO and I to take a full body photo with something I want to catch in the background (such as towers, trees, or landmarks). So something with a bigger field of view (sorry if this isnt the right term) would be great. Also I’ve been struggling with backlight shots alot of the time, where either the background would be too bright to see or the person would be too dark to see. \n\nThanks in advance. \n", "link": "https://www.reddit.com/r/Cameras/comments/8dudya/camera_recommendation_10001500/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "camera recommendation - $1000-$1500 /!/ hi :)\n\nlooking for a camera that is relatively lightweight and easy to carry around as i really only use it to take photos while traveling. \nmainly to take photo of my so and family.\n\nim currently using a rx100v, i think its a great camera and theres still lots to learn. however with alot of popular tourist -----> spots !!!  its a struggle to get enough distance between my so and i to take a full body photo with something i want to catch in the background (such as towers, trees, or landmarks). so something with a bigger field of view (sorry if this isnt the right term) would be great. also i’ve been struggling with backlight shots alot of the time, where either the background would be too bright to see or the person would be too dark to see. \n\nthanks in advance. \n", "sortedWord": "None", "identifyer": 73512, "year": "2018"}], "name": "spotCameras2018"}