{"interestingcomments": [{"Unnamed: 0": 220841, "autor": "-ThewhiteDeath-", "date": 1617256515000, "content": "I found this small white spot on my Leica lens, is the lens chipped or is it some kind of small spot? and will it affect photos?", "link": "https://www.reddit.com/r/Cameras/comments/mhosvb/i_found_this_small_white_spot_on_my_leica_lens_is/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found this small white -----> spot !!!  on my leica lens, is the lens chipped or is it some kind of small -----> spot !!! ? and will it affect photos?", "sortedWord": "None", "identifyer": 15369, "year": "2021"}, {"Unnamed: 0": 220842, "autor": "-ThewhiteDeath-", "date": 1617254629000, "content": "I found this small spot on my Leica lens, is the lens chipped or is this some kind of spot?", "link": "https://www.reddit.com/r/Cameras/comments/mhocxw/i_found_this_small_spot_on_my_leica_lens_is_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found this small -----> spot !!!  on my leica lens, is the lens chipped or is this some kind of -----> spot !!! ?", "sortedWord": "None", "identifyer": 15370, "year": "2021"}, {"Unnamed: 0": 220843, "autor": "-ThewhiteDeath-", "date": 1617254431000, "content": "I found this small spot on my lens, is the lens chipped or is this just a small spot?", "link": "https://www.reddit.com/r/Cameras/comments/mhob89/i_found_this_small_spot_on_my_lens_is_the_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found this small -----> spot !!!  on my lens, is the lens chipped or is this just a small -----> spot !!! ?", "sortedWord": "None", "identifyer": 15371, "year": "2021"}, {"Unnamed: 0": 220897, "autor": "janederland93", "date": 1617098750000, "content": "Black spots on the photos / How can I clean it myself? I think it’s dust. Photos are in the link /!/ I use Canon 2000D. I saw many black spots on my sky photos. You can see here: [Black Spot 1](https://ibb.co/wy7HkC1) [ Black spot 2](https://ibb.co/MRh5N0f) [Black Spot 3](https://ibb.co/VgtWNYS)\nI cleaned lens and sensor last night Automatic and manuel too. I watch videos to do that. But when I look from the visor, Still I see 3 black points on white paper. I add photos here you can see [Canon black spots 1 ](https://ibb.co/P9SGttp) [ Canon black spots 2](https://ibb.co/4FPgYrc)\n\nHow can I clean it myself? I think it’s dust. \nToday I will buy air blower But I’m not sure  if it will work. Do you have any tips for me? \nThank you in advance for your help", "link": "https://www.reddit.com/r/Cameras/comments/mgcjim/black_spots_on_the_photos_how_can_i_clean_it/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  on the photos / how can i clean it myself? i think it’s dust. photos are in the link /!/ i use canon 2000d. i saw many black spots on my sky photos. you can see here: [black spot 1](https://ibb.co/wy7hkc1) [ black spot 2](https://ibb.co/mrh5n0f) [black spot 3](https://ibb.co/vgtwnys)\ni cleaned lens and sensor last night automatic and manuel too. i watch videos to do that. but when i look from the visor, still i see 3 black points on white paper. i add photos here you can see [canon black spots 1 ](https://ibb.co/p9sgttp) [ canon black spots 2](https://ibb.co/4fpgyrc)\n\nhow can i clean it myself? i think it’s dust. \ntoday i will buy air blower but i’m not sure  if it will work. do you have any tips for me? \nthank you in advance for your help", "sortedWord": "None", "identifyer": 15427, "year": "2021"}, {"Unnamed: 0": 220912, "autor": "janederland93", "date": 1617053457000, "content": "Black spots When take a photo with the sky- Hello I saw some black spots on the sky photos. I think it’s dust. Because its just happen for sometimes on the sky photos. How can I clean this dusts at home? I don’t have air pump", "link": "https://www.reddit.com/r/Cameras/comments/mg03u5/black_spots_when_take_a_photo_with_the_sky_hello/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  when take a photo with the sky- hello i saw some black spots on the sky photos. i think it’s dust. because its just happen for sometimes on the sky photos. how can i clean this dusts at home? i don’t have air pump", "sortedWord": "None", "identifyer": 15445, "year": "2021"}, {"Unnamed: 0": 220954, "autor": "arseniy25", "date": 1614384227000, "content": "My camera has a darkish spot. What should I do? /!/ My Iphone XR camera has this darkish spot (I circled it) when taking pictures with my rear camera. Is this dust or something inside the rear camera? How can I get it out? Can service get it out? Or is the only way to deal with it is by replacing phones?  \n\n\nThank You\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bhmz8ewivwj61.png?width=763&amp;format=png&amp;auto=webp&amp;s=13fc40feae4171fce590b51c2c8e6eeb729119c0", "link": "https://www.reddit.com/r/Cameras/comments/ltbgzk/my_camera_has_a_darkish_spot_what_should_i_do/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my camera has a darkish -----> spot !!! . what should i do? /!/ my iphone xr camera has this darkish spot (i circled it) when taking pictures with my rear camera. is this dust or something inside the rear camera? how can i get it out? can service get it out? or is the only way to deal with it is by replacing phones?  \n\n\nthank you\n\n&amp;#x200b;\n\nhttps://preview.redd.it/bhmz8ewivwj61.png?width=763&amp;format=png&amp;auto=webp&amp;s=13fc40feae4171fce590b51c2c8e6eeb729119c0", "sortedWord": "None", "identifyer": 15487, "year": "2021"}, {"Unnamed: 0": 221148, "autor": "MelleC1999", "date": 1611940152000, "content": "My horrible Olympus Service experience, would like to get it out there. /!/ This is a pretty long story so if you don't want to read everything, here's the TL;DR:\n\nTL;DR: Olympus service does not want anything to do with me, even though I've bought thousands worth of Olympus gear.\n\nStory time:\n\nFirst of all a couple disclaimers:\n\n* I am from the Netherlands (Europe), there may be some spelling mistakes in here. I apologize for that in advance;\n* This story is very recent (most recent development was 28th of January), relevant because of the sale of Olympus;\n* The camera grip was bought in Canada from Olympus Canada (in April of 2020);\n* The camera body was bought in the Netherlands from an independent camera store (late November 2019).\n\n&amp;#x200B;\n\nAlright so here we go:\n\nThe story started in April of 2020, I was in Canada for a few months and I decided to buy an Olympus HLD-8G camera grip for my Olympus OM-D E-M5 II. I bought it directly from Olympus CA (online) and everything was great.\n\nRight up until about August of 2020, by then I was already back in my home country of the Netherlands, when I started noticing that every so often the camera would not stop focusing until I took the picture (it was like the shutter was always half-pressed). Usually after a restart or a reseat of the grip it would be solved. I found it weird but did not think too much of it at that point.\n\nFast forward about a month, maybe six weeks... \n\nI started having the problem more and more up to the point where I'd have it practically every other time I switched the camera on. I tried everything from different (Olympus) lenses, batteries, using the touch screen, not using it... Nothing seemed to fix it. I updated the camera's firmware, the lenses' firmware but nothing worked. \n\nThat's when I contacted Olympus US/CA, asking if I \\*have\\* to send it to CA where I bought it or if I could just have it serviced where I live. This was October 22nd 2020 (keep this date in mind). \n\nGiven the circumstances, I also contacted my local Olympus service centre to see if they would have an answer for me.\n\nThe next day I got a reply from my local Olympus rep asking me to clarify some points, I sent a pretty specific email back saying exactly what my problems were and what I'd tried up until that point to try and fix it. \n\nA couple days later I get a response from the same rep saying that since I bought it in Canada they would possibly not be covered by warranty (even though it's under INTL warranty) but to register it for repair via their online form in the My Olympus dashboard anyway, he said they'll keep me posted before it would mean I'd have to pay for anything. \n\nThe same day I sign it up for repair through the online form (specifying it as an under warranty repair). I sent it out with their shipping label probably about a week later.\n\nA couple days later: the first response from the US/CA service department (mind you, it's already been about 3 weeks since I've sent the first email) stating that I'd have to return it to the CA service centre to have it fixed under any type of warranty. I leave the US/CA contact for what it is and focus on the 'local' rep from this point on.\n\nA few days later I get the notification from Olympus stating that my product has arrived at the service centre (I sent it to a local address, but that was actually not where it went in the end... It ended up in Portugal, over 2000 KM away). \n\n4 Days later, I get the notification that they've tested my grip and that they did not find any defects, requesting that if I wanted my grip tested properly I'd have to also send my camera in with it. They did not tell me how to make sure both repairs would get linked. I asked, it didn't work. I registered my camera as a repair, specifically saying in the notes to link both ticket IDs so that it would end up in the same spot as my grip.\n\nBecause the repair registration process did not let me link the both together I also sent an email asking for the two to be linked. \n\nI sent out my camera in it's original packaging (just like I did with my grip) and got the notification it was received at the service centre a couple days later. \n\nNow: NOTHING for a week. THEN: a notification from the shipping company saying there's a package on it's way back from Olympus (note that I have not received any updates either my request to link both repairs or status-updates for my camera or grip).\n\nA day later: the package arrives, it's my camera body with a note that said they 'cleaned' it and that there was nothing else done. The box reeked of smoke when I got it back, but at least my camera was back.\n\nI sent another email to the same rep as the one I had contact with before saying that I'd gotten my camera back but have not had any other form of contact or updates since (reached out this time December 18th 2020).\n\n&amp;#x200B;\n\nNOTHING FOR ANOTHER 3 WEEKS: I reach out again asking for an update about my grip, also mentioning that I've been waiting a very long time already with apparently nothing having been done to fix my issues and that if it were to take longer still they'd probably just send me a new one.\n\n&amp;#x200B;\n\nNOTHING FOR ANOTHER 2.5 WEEKS: I get a shipping notification a package from Olympus (Portugal) is arriving soon.\n\n&amp;#x200B;\n\nA couple days later, the package arrives, the original box in worse shape than when I sent it out, the plastic protection that was over the connector pins on the grip missing and the grip badly packed inside the box.\n\n&amp;#x200B;\n\n'Till this day, I have not had any updates regarding my tickets/repairs since November 23rd!\n\n&amp;#x200B;\n\nI would like to get this out there to show how horrible Olympus' service is (or has been to me at least) and if it gets enough attention, what they plan to do with it.\n\n&amp;#x200B;\n\nAlso, for the record: I LOVE MY OLYMPUS gear, it's amazing (if it works) and if I'd upgrade it would probably be an Olympus body as well, it's just that the service seems to just be absolutely horrible.\n\n&amp;#x200B;\n\nFor the ones interested, I'll also add the full contact log below:\n\n&amp;#x200B;\n\nContact log Olympus:\n\n22 october 2020, first contact with Olympus about whether to send it to CA or keep it in NL, sending to US/CA contact (Me)\n\n23 october 2020, first answer from Olympus asking me what the question actually is (Olympus)\n\n23 october 2020, responding with elaborate explanation (Me)\n\n26 october 2020, response that the grip bought in CA has intl warranty meaning that I'd likely have to pay for the repair and to sign it up for repair anyway (Olympus)\n\n26 october 2020, I sign it up for repair via the website (specifying repair under warranty) (Me)\n\n12 november 2020, response from \\*FIRST CONTACT\\*(22 october), saying that I'll have to return it to the country of origin to have any type of warranty (Olympus US/CA)\n\n16 november 2020, product arrived at Olympus service centre (Olympus)\n\n20 november 2020, product tested, no defect found. Request to send camera to test both (Olympus)\n\n21 november 2020, I respond confirming that the camera that was already linked to my Olympus account is the camera with which I had the problem, I ask how to link the repairs (Me)\n\n23 november 2020, response saying that I can send the camera as a separate repair, linking it to the original (does not specify how) (Olympus)\n\n24 november 2020, repair signed up confirmation (Olympus)\n\n10 december 2020, confirmation camera arrived at repair centre (Olympus)\n\n17 december 2020, DHL postal notification saying a package from Olympus is on it's way back to me (NOTE: no updates from Olympus, no other contact since my last response)\n\n18 december 2020, I reach out again saying that I have my camera back, nothing had been done to it and the box in which it came smelled horrible (heavy some scent), also asking for an update on my grip, linking repairs apparently didn't work (Me)\n\n9 january 2021, I reach out AGAIN asking for an update about my grip saying that I'd like to receive it back within a pretty short period or they'd be better off sending me a new one\n\n26 january 2021, DHL postal notification saying I have a package from Olympus (Portugal) arriving soon\n\n28 january 2021, parcel arrived, Olympus did not do anything to the grip and it seems to still occasionally have the same problem (the exact reason I sent it out for repair) (Me)\n\nUntil this day, I have not heard ANYTHING from them since november 23rd!", "link": "https://www.reddit.com/r/Cameras/comments/l7xxlj/my_horrible_olympus_service_experience_would_like/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my horrible olympus service experience, would like to get it out there. /!/ this is a pretty long story so if you don't want to read everything, here's the tl;dr:\n\ntl;dr: olympus service does not want anything to do with me, even though i've bought thousands worth of olympus gear.\n\nstory time:\n\nfirst of all a couple disclaimers:\n\n* i am from the netherlands (europe), there may be some spelling mistakes in here. i apologize for that in advance;\n* this story is very recent (most recent development was 28th of january), relevant because of the sale of olympus;\n* the camera grip was bought in canada from olympus canada (in april of 2020);\n* the camera body was bought in the netherlands from an independent camera store (late november 2019).\n\n&amp;#x200b;\n\nalright so here we go:\n\nthe story started in april of 2020, i was in canada for a few months and i decided to buy an olympus hld-8g camera grip for my olympus om-d e-m5 ii. i bought it directly from olympus ca (online) and everything was great.\n\nright up until about august of 2020, by then i was already back in my home country of the netherlands, when i started noticing that every so often the camera would not stop focusing until i took the picture (it was like the shutter was always half-pressed). usually after a restart or a reseat of the grip it would be solved. i found it weird but did not think too much of it at that point.\n\nfast forward about a month, maybe six weeks... \n\ni started having the problem more and more up to the point where i'd have it practically every other time i switched the camera on. i tried everything from different (olympus) lenses, batteries, using the touch screen, not using it... nothing seemed to fix it. i updated the camera's firmware, the lenses' firmware but nothing worked. \n\nthat's when i contacted olympus us/ca, asking if i \\*have\\* to send it to ca where i bought it or if i could just have it serviced where i live. this was october 22nd 2020 (keep this date in mind). \n\ngiven the circumstances, i also contacted my local olympus service centre to see if they would have an answer for me.\n\nthe next day i got a reply from my local olympus rep asking me to clarify some points, i sent a pretty specific email back saying exactly what my problems were and what i'd tried up until that point to try and fix it. \n\na couple days later i get a response from the same rep saying that since i bought it in canada they would possibly not be covered by warranty (even though it's under intl warranty) but to register it for repair via their online form in the my olympus dashboard anyway, he said they'll keep me posted before it would mean i'd have to pay for anything. \n\nthe same day i sign it up for repair through the online form (specifying it as an under warranty repair). i sent it out with their shipping label probably about a week later.\n\na couple days later: the first response from the us/ca service department (mind you, it's already been about 3 weeks since i've sent the first email) stating that i'd have to return it to the ca service centre to have it fixed under any type of warranty. i leave the us/ca contact for what it is and focus on the 'local' rep from this point on.\n\na few days later i get the notification from olympus stating that my product has arrived at the service centre (i sent it to a local address, but that was actually not where it went in the end... it ended up in portugal, over 2000 km away). \n\n4 days later, i get the notification that they've tested my grip and that they did not find any defects, requesting that if i wanted my grip tested properly i'd have to also send my camera in with it. they did not tell me how to make sure both repairs would get linked. i asked, it didn't work. i registered my camera as a repair, specifically saying in the notes to link both ticket ids so that it would end up in the same -----> spot !!!  as my grip.\n\nbecause the repair registration process did not let me link the both together i also sent an email asking for the two to be linked. \n\ni sent out my camera in it's original packaging (just like i did with my grip) and got the notification it was received at the service centre a couple days later. \n\nnow: nothing for a week. then: a notification from the shipping company saying there's a package on it's way back from olympus (note that i have not received any updates either my request to link both repairs or status-updates for my camera or grip).\n\na day later: the package arrives, it's my camera body with a note that said they 'cleaned' it and that there was nothing else done. the box reeked of smoke when i got it back, but at least my camera was back.\n\ni sent another email to the same rep as the one i had contact with before saying that i'd gotten my camera back but have not had any other form of contact or updates since (reached out this time december 18th 2020).\n\n&amp;#x200b;\n\nnothing for another 3 weeks: i reach out again asking for an update about my grip, also mentioning that i've been waiting a very long time already with apparently nothing having been done to fix my issues and that if it were to take longer still they'd probably just send me a new one.\n\n&amp;#x200b;\n\nnothing for another 2.5 weeks: i get a shipping notification a package from olympus (portugal) is arriving soon.\n\n&amp;#x200b;\n\na couple days later, the package arrives, the original box in worse shape than when i sent it out, the plastic protection that was over the connector pins on the grip missing and the grip badly packed inside the box.\n\n&amp;#x200b;\n\n'till this day, i have not had any updates regarding my tickets/repairs since november 23rd!\n\n&amp;#x200b;\n\ni would like to get this out there to show how horrible olympus' service is (or has been to me at least) and if it gets enough attention, what they plan to do with it.\n\n&amp;#x200b;\n\nalso, for the record: i love my olympus gear, it's amazing (if it works) and if i'd upgrade it would probably be an olympus body as well, it's just that the service seems to just be absolutely horrible.\n\n&amp;#x200b;\n\nfor the ones interested, i'll also add the full contact log below:\n\n&amp;#x200b;\n\ncontact log olympus:\n\n22 october 2020, first contact with olympus about whether to send it to ca or keep it in nl, sending to us/ca contact (me)\n\n23 october 2020, first answer from olympus asking me what the question actually is (olympus)\n\n23 october 2020, responding with elaborate explanation (me)\n\n26 october 2020, response that the grip bought in ca has intl warranty meaning that i'd likely have to pay for the repair and to sign it up for repair anyway (olympus)\n\n26 october 2020, i sign it up for repair via the website (specifying repair under warranty) (me)\n\n12 november 2020, response from \\*first contact\\*(22 october), saying that i'll have to return it to the country of origin to have any type of warranty (olympus us/ca)\n\n16 november 2020, product arrived at olympus service centre (olympus)\n\n20 november 2020, product tested, no defect found. request to send camera to test both (olympus)\n\n21 november 2020, i respond confirming that the camera that was already linked to my olympus account is the camera with which i had the problem, i ask how to link the repairs (me)\n\n23 november 2020, response saying that i can send the camera as a separate repair, linking it to the original (does not specify how) (olympus)\n\n24 november 2020, repair signed up confirmation (olympus)\n\n10 december 2020, confirmation camera arrived at repair centre (olympus)\n\n17 december 2020, dhl postal notification saying a package from olympus is on it's way back to me (note: no updates from olympus, no other contact since my last response)\n\n18 december 2020, i reach out again saying that i have my camera back, nothing had been done to it and the box in which it came smelled horrible (heavy some scent), also asking for an update on my grip, linking repairs apparently didn't work (me)\n\n9 january 2021, i reach out again asking for an update about my grip saying that i'd like to receive it back within a pretty short period or they'd be better off sending me a new one\n\n26 january 2021, dhl postal notification saying i have a package from olympus (portugal) arriving soon\n\n28 january 2021, parcel arrived, olympus did not do anything to the grip and it seems to still occasionally have the same problem (the exact reason i sent it out for repair) (me)\n\nuntil this day, i have not heard anything from them since november 23rd!", "sortedWord": "None", "identifyer": 15688, "year": "2021"}, {"Unnamed: 0": 221447, "autor": "inthemuseum", "date": 1630352895000, "content": "What’s a good camera for a nonprofit? (Pro photog on comms but not really pro budget) /!/ I shoot a D750 and have been very pleased with it for years. My 70-200 FL is the light of my life. Happy as I am, I have been very much out of the shopping and buying game for years, aside from my FL upgrade.\n\nI work at a nonprofit, and they want me to shoot for them. They’re not about to blow the thousands of dollars on full-frame gear that I know and love, and I don’t think that kind of glass is really appropriate in the long run. It’s too heavy, and the operations will just upset my colleagues. It’s also just not great for on-the-spot video to have such heavy glass, and quick testimonials are a biggy for us.\n\nOur Organizational Brand Overlords at Big Umbrella Nonprofit demand photography be of a shallow depth of field, soft natural lighting, and tight on the subject. We’re typically shooting in dim homes, an office with gross lighting, or out in the abysmal Texas sun. Fast continuous shooting is preferred (I just like that feature).\n\nSo I come to you fine folks. I’d like that balance of pretty and convenient video, ease of use for the novices, and satisfaction for me as a not-novice.\n\nI don’t have a firm budget because I’m writing this into the FY2022 marketing budget to tell my boss there is in fact money for it, but let’s stay under $2k for the whole kit, ideally less because small nonprofits are stingy and I want accessories.", "link": "https://www.reddit.com/r/Cameras/comments/pepmv6/whats_a_good_camera_for_a_nonprofit_pro_photog_on/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what’s a good camera for a nonprofit? (pro photog on comms but not really pro budget) /!/ i shoot a d750 and have been very pleased with it for years. my 70-200 fl is the light of my life. happy as i am, i have been very much out of the shopping and buying game for years, aside from my fl upgrade.\n\ni work at a nonprofit, and they want me to shoot for them. they’re not about to blow the thousands of dollars on full-frame gear that i know and love, and i don’t think that kind of glass is really appropriate in the long run. it’s too heavy, and the operations will just upset my colleagues. it’s also just not great for on-the------> spot !!!  video to have such heavy glass, and quick testimonials are a biggy for us.\n\nour organizational brand overlords at big umbrella nonprofit demand photography be of a shallow depth of field, soft natural lighting, and tight on the subject. we’re typically shooting in dim homes, an office with gross lighting, or out in the abysmal texas sun. fast continuous shooting is preferred (i just like that feature).\n\nso i come to you fine folks. i’d like that balance of pretty and convenient video, ease of use for the novices, and satisfaction for me as a not-novice.\n\ni don’t have a firm budget because i’m writing this into the fy2022 marketing budget to tell my boss there is in fact money for it, but let’s stay under $2k for the whole kit, ideally less because small nonprofits are stingy and i want accessories.", "sortedWord": "None", "identifyer": 15997, "year": "2021"}, {"Unnamed: 0": 221682, "autor": "Illustrious-Web9850", "date": 1632789857000, "content": "Saw this at Best Buy. What is it? I don’t think it’s a camera but wasn’t sure. (Btw I’m new to Reddit and I’m sure this is the wrong spot for this post but the couple other subreddits I tried didn’t allow pictures)", "link": "https://www.reddit.com/r/Cameras/comments/pwupnb/saw_this_at_best_buy_what_is_it_i_dont_think_its/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "saw this at best buy. what is it? i don’t think it’s a camera but wasn’t sure. (btw i’m new to reddit and i’m sure this is the wrong -----> spot !!!  for this post but the couple other subreddits i tried didn’t allow pictures)", "sortedWord": "None", "identifyer": 16242, "year": "2021"}, {"Unnamed: 0": 221907, "autor": "Oz_Von_Toco", "date": 1613062595000, "content": "Advice on motion camera to protect my car /!/ Explaining my situation in case it helps with what kind of camera I need\n\nI recently moved and I do not have driveway, it’s permit street parking. I’m also on a main road where I can’t park while the road is covered in snow so right now I’m parking out back\n\n3 times now in 24 hours when I’ve or my wife parked in front of his house, he’s Vaselined my car door handle. I tried ringing his doorbell with my wife to talk and he literally turned off his lights and hid (lol really?).\n\nThis morning he was literally shoveling snow on and in front of my car. So I ran out to finally talk to him. \n\nHe literally denies screams at me for “terrifying him and his family” and makes a huge scene saying I came at 3am. I came when my wife got home at 9pm from work and found my door handle COVERED in Vaseline, I had gotten home from getting groceries 8 pm. No other car has has had Vaseline and I’ve checked, 3 times is beyond reasonable doubt.\n\nLike the guy is clearly a liar. And normally I mix up where I park but at this point I kinda think I’m gonna make that my spot out of principle.\n\nSo I was wondering, does anyone know of a reasonably priced motion camera I can point toward my door so if it happens again I can get him on video??\n\nI simply won’t be bullied out of parking where I have permit to park.", "link": "https://www.reddit.com/r/Cameras/comments/lhoypz/advice_on_motion_camera_to_protect_my_car/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "advice on motion camera to protect my car /!/ explaining my situation in case it helps with what kind of camera i need\n\ni recently moved and i do not have driveway, it’s permit street parking. i’m also on a main road where i can’t park while the road is covered in snow so right now i’m parking out back\n\n3 times now in 24 hours when i’ve or my wife parked in front of his house, he’s vaselined my car door handle. i tried ringing his doorbell with my wife to talk and he literally turned off his lights and hid (lol really?).\n\nthis morning he was literally shoveling snow on and in front of my car. so i ran out to finally talk to him. \n\nhe literally denies screams at me for “terrifying him and his family” and makes a huge scene saying i came at 3am. i came when my wife got home at 9pm from work and found my door handle covered in vaseline, i had gotten home from getting groceries 8 pm. no other car has has had vaseline and i’ve checked, 3 times is beyond reasonable doubt.\n\nlike the guy is clearly a liar. and normally i mix up where i park but at this point i kinda think i’m gonna make that my -----> spot !!!  out of principle.\n\nso i was wondering, does anyone know of a reasonably priced motion camera i can point toward my door so if it happens again i can get him on video??\n\ni simply won’t be bullied out of parking where i have permit to park.", "sortedWord": "None", "identifyer": 16476, "year": "2021"}, {"Unnamed: 0": 222078, "autor": "devctxt", "date": 1614184610000, "content": "I have a heavy doubt about my choice today /!/ Guys , story time , today , i bought a6500 and to be honest , i want happy with my choice considering i did my research on the a6400 that i targeted , now im having breakdown and dont know what to do , i scratched up a tiny spots on the body and i hope i can downgrade to a6400 for the flip screen and the real time tracking af , if you know any solution , just comment down below 😔😞", "link": "https://www.reddit.com/r/Cameras/comments/lrh0ye/i_have_a_heavy_doubt_about_my_choice_today/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i have a heavy doubt about my choice today /!/ guys , story time , today , i bought a6500 and to be honest , i want happy with my choice considering i did my research on the a6400 that i targeted , now im having breakdown and dont know what to do , i scratched up a tiny -----> spots !!!  on the body and i hope i can downgrade to a6400 for the flip screen and the real time tracking af , if you know any solution , just comment down below 😔😞", "sortedWord": "None", "identifyer": 16654, "year": "2021"}, {"Unnamed: 0": 222329, "autor": "Kvogan710", "date": 1617853595000, "content": "what is this spot on my sensor", "link": "https://www.reddit.com/r/Cameras/comments/mmjbm3/what_is_this_spot_on_my_sensor/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is this -----> spot !!!  on my sensor", "sortedWord": "None", "identifyer": 16918, "year": "2021"}, {"Unnamed: 0": 222549, "autor": "kearney2000", "date": 1622286222000, "content": "Advice for cleaning this old point and shoot? /!/ As you can hopefully see there's a lot of muck under the cover here, as well as a spot in the viewfinder (it doesn't block my view as when I focus my eyes it's hardly a smudge). I've cleaned up the lens with a Q-tip and it's spotless but I am a complete beginner with film cameras. Is there any way to clean under the plastic here? And more importantly, is any of this gonna be of detriment to the photo quality? I've got a week to ask for a refund!\n\nhttps://preview.redd.it/t4bm49kvj1271.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=caed6aa12b8972b3fa85226f6ff8f5807bc945fc\n\nhttps://preview.redd.it/nzyh5gkvj1271.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=04636ff0ca594c5a6f27827dd7f8210be0ac385a", "link": "https://www.reddit.com/r/Cameras/comments/nnl55s/advice_for_cleaning_this_old_point_and_shoot/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "advice for cleaning this old point and shoot? /!/ as you can hopefully see there's a lot of muck under the cover here, as well as a -----> spot !!!  in the viewfinder (it doesn't block my view as when i focus my eyes it's hardly a smudge). i've cleaned up the lens with a q-tip and it's spotless but i am a complete beginner with film cameras. is there any way to clean under the plastic here? and more importantly, is any of this gonna be of detriment to the photo quality? i've got a week to ask for a refund!\n\nhttps://preview.redd.it/t4bm49kvj1271.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=caed6aa12b8972b3fa85226f6ff8f5807bc945fc\n\nhttps://preview.redd.it/nzyh5gkvj1271.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=04636ff0ca594c5a6f27827dd7f8210be0ac385a", "sortedWord": "None", "identifyer": 17152, "year": "2021"}, {"Unnamed: 0": 222767, "autor": "OKBOOMMERNERD", "date": 1623619790000, "content": "Old sdr-h80 night settings /!/ Hey I got a old blue sdr-h80 I think it’s from the early 2010. I’m taking vids outside with my friend on it because I love the way it looks but if there not tons of light you literally see almost nothing and it’s really blurry even with streets light. When the sun is up the quality is perfect and I love it b ur when is dark outside I can barely seen anything unless there like 25  street lights at 1 spot. Is there anything I could do to help that out ? Any settings ? I know nothing about cameras.  Thanks for the help and sorry for my bad English it’s not my main language", "link": "https://www.reddit.com/r/Cameras/comments/nz6i43/old_sdrh80_night_settings/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "old sdr-h80 night settings /!/ hey i got a old blue sdr-h80 i think it’s from the early 2010. i’m taking vids outside with my friend on it because i love the way it looks but if there not tons of light you literally see almost nothing and it’s really blurry even with streets light. when the sun is up the quality is perfect and i love it b ur when is dark outside i can barely seen anything unless there like 25  street lights at 1 -----> spot !!! . is there anything i could do to help that out ? any settings ? i know nothing about cameras.  thanks for the help and sorry for my bad english it’s not my main language", "sortedWord": "None", "identifyer": 17377, "year": "2021"}, {"Unnamed: 0": 222870, "autor": "MrMurse123", "date": 1624765984000, "content": "Yellow spots on eye piece viewport. Any clues? - Olympus OM-D EM-5 MK II", "link": "https://www.reddit.com/r/Cameras/comments/o8pjwz/yellow_spots_on_eye_piece_viewport_any_clues/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yellow -----> spots !!!  on eye piece viewport. any clues? - olympus om-d em-5 mk ii", "sortedWord": "None", "identifyer": 17486, "year": "2021"}, {"Unnamed: 0": 222904, "autor": "McRedditerFace", "date": 1624660041000, "content": "ProgramAE on Sony a55 giving intermittently strange settings... /!/ Hey all,  \n\n\nI've had this SLT a55 for some years, but I recently upgraded and handed it to my 7yo son who's just getting into photography.  I always shot full-manual, but obviously that's not something I can expect him to do out the gate.  So I suggested he use P (Program AE) since it at least allowed for exposure compensation.   \n\n\nWhile on vacation we were tinkering with it and checking the results and I noticed it was shooting with some really absurd settings.... ISO 12800, f/22, and 1/4000s in broad daylight.  So I set it to A+ and it resolved itself.  \n\n\nI'm now processing his raw images, and it seems like this issue just kept randomly recurring with no rhyme or reason.  It'd be doing just fine, having much more sane settings like ISO 400, f/4.5, 1/60s... and then suddenly with no real reason it would switch to these insane settings again.  \n\n\nI'm checking the metadata for clues, and coming up empty.  There's no exposure compensation, no flash compensation, no flash, exposure \"auto\", exposure program \"Program AE\"... metering is \"multi-segment\"... so it's not like he's got some spot meter skewing the metering or anything.  \n\n\nThe images themselves are mostly exposed correctly, with some overexposure, but it's hard to tell if that's actually overexposure or just drowning all the shadows in noise.   \n\n\nI'll suggest he keep using A or A+ for now, but I'd really like to know wtf is going on here.  \n\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/o7y3o9/programae_on_sony_a55_giving_intermittently/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "programae on sony a55 giving intermittently strange settings... /!/ hey all,  \n\n\ni've had this slt a55 for some years, but i recently upgraded and handed it to my 7yo son who's just getting into photography.  i always shot full-manual, but obviously that's not something i can expect him to do out the gate.  so i suggested he use p (program ae) since it at least allowed for exposure compensation.   \n\n\nwhile on vacation we were tinkering with it and checking the results and i noticed it was shooting with some really absurd settings.... iso 12800, f/22, and 1/4000s in broad daylight.  so i set it to a+ and it resolved itself.  \n\n\ni'm now processing his raw images, and it seems like this issue just kept randomly recurring with no rhyme or reason.  it'd be doing just fine, having much more sane settings like iso 400, f/4.5, 1/60s... and then suddenly with no real reason it would switch to these insane settings again.  \n\n\ni'm checking the metadata for clues, and coming up empty.  there's no exposure compensation, no flash compensation, no flash, exposure \"auto\", exposure program \"program ae\"... metering is \"multi-segment\"... so it's not like he's got some -----> spot !!!  meter skewing the metering or anything.  \n\n\nthe images themselves are mostly exposed correctly, with some overexposure, but it's hard to tell if that's actually overexposure or just drowning all the shadows in noise.   \n\n\ni'll suggest he keep using a or a+ for now, but i'd really like to know wtf is going on here.  \n\n\nthanks!", "sortedWord": "None", "identifyer": 17520, "year": "2021"}, {"Unnamed: 0": 223468, "autor": "Dragonjr97", "date": 1632625407000, "content": "Just turned on an old camera and there’s a black spot on the screen...what could it be? Is it an easy fix?", "link": "https://www.reddit.com/r/Cameras/comments/pvlii9/just_turned_on_an_old_camera_and_theres_a_black/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just turned on an old camera and there’s a black -----> spot !!!  on the screen...what could it be? is it an easy fix?", "sortedWord": "None", "identifyer": 18116, "year": "2021"}, {"Unnamed: 0": 223635, "autor": "Harrier46", "date": 1635244505000, "content": "Small and light sports camera option?? /!/ My Nikon D500 with 2.8 70-200 lens is my go to for shooting track and cross country meets. I’m looking for a (much) lighter option for CC meets where I must run from one spot to another for shots. suggestions?", "link": "https://www.reddit.com/r/Cameras/comments/qg3icb/small_and_light_sports_camera_option/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "small and light sports camera option?? /!/ my nikon d500 with 2.8 70-200 lens is my go to for shooting track and cross country meets. i’m looking for a (much) lighter option for cc meets where i must run from one -----> spot !!!  to another for shots. suggestions?", "sortedWord": "None", "identifyer": 18292, "year": "2021"}, {"Unnamed: 0": 224065, "autor": "Maybedoc1", "date": 1613865479000, "content": "How much of an upgrade would an A7III be over my Nikon D7100? Gear /!/ Hello all,\n\nI've been considering getting the A7iii for years now and I'm thinking about pulling the trigger with the reduced price on Sony's website. I  currently have a Nikon D7100 that I bought used about 4 or 5 years ago. I  mainly use the 18-140mm kit lens with it. I've gotten some great shots  (to me) with it, but lots of bad shots too. Not sure if it's the camera or me and I'm wondering if upgrading to the A7iii is worth the money.\n\nI  live out West and I mainly shoot nature-y landscape-type stuff. I like shooting in low/challenging-light and I also like shooting things with wide dynamic ranges (I think that's the right word?). Things like huge western landscapes where there are many different colors and shadows/highlights. For example, the sun might be hitting one spot of the canyon, but the rest is in shadows. I often see a great, complex picture in front of me, but I can't get it with my D7100 and it's frustrating. The picture may look bland or doesn't capture the grandiosity of what I'm looking at or I can't get the different light levels, etc. Again I'm not sure if it's the limitations of the camera or my skill.\n\nThoughts? Would the  A7iii be a worthy upgrade? I shoot manual and edit in lightroom. Even with that  I often struggle to get the shots that I see in front of me.", "link": "https://www.reddit.com/r/Cameras/comments/lok5uf/how_much_of_an_upgrade_would_an_a7iii_be_over_my/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much of an upgrade would an a7iii be over my nikon d7100? gear /!/ hello all,\n\ni've been considering getting the a7iii for years now and i'm thinking about pulling the trigger with the reduced price on sony's website. i  currently have a nikon d7100 that i bought used about 4 or 5 years ago. i  mainly use the 18-140mm kit lens with it. i've gotten some great shots  (to me) with it, but lots of bad shots too. not sure if it's the camera or me and i'm wondering if upgrading to the a7iii is worth the money.\n\ni  live out west and i mainly shoot nature-y landscape-type stuff. i like shooting in low/challenging-light and i also like shooting things with wide dynamic ranges (i think that's the right word?). things like huge western landscapes where there are many different colors and shadows/highlights. for example, the sun might be hitting one -----> spot !!!  of the canyon, but the rest is in shadows. i often see a great, complex picture in front of me, but i can't get it with my d7100 and it's frustrating. the picture may look bland or doesn't capture the grandiosity of what i'm looking at or i can't get the different light levels, etc. again i'm not sure if it's the limitations of the camera or my skill.\n\nthoughts? would the  a7iii be a worthy upgrade? i shoot manual and edit in lightroom. even with that  i often struggle to get the shots that i see in front of me.", "sortedWord": "None", "identifyer": 18744, "year": "2021"}, {"Unnamed: 0": 224208, "autor": "coma82021", "date": 1618676424000, "content": "Defect/Nick on the pentaprism /!/ Minolta X-300\n\nYesterday I cleaned my camera, especially the mirror and pentaprism on the inside. Used a micro-fibre cloth suitable for the purpose.\nNo dirt or \"lint\" left, so I mounted my lens and took a look through the viewfinder. There seems to be a dark spot, as if there was dirt left somewhere inside, but after multiple attempts to remove it - it is permanent.\nThere seems to be a foil on the pentaprism, directed towards the mirror, maybe I scratched it.\n\nSo my question is, should/could I replace pentaprism? A replacement camera would not be too expensive, it's just the emotional factor.", "link": "https://www.reddit.com/r/Cameras/comments/mstqgi/defectnick_on_the_pentaprism/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "defect/nick on the pentaprism /!/ minolta x-300\n\nyesterday i cleaned my camera, especially the mirror and pentaprism on the inside. used a micro-fibre cloth suitable for the purpose.\nno dirt or \"lint\" left, so i mounted my lens and took a look through the viewfinder. there seems to be a dark -----> spot !!! , as if there was dirt left somewhere inside, but after multiple attempts to remove it - it is permanent.\nthere seems to be a foil on the pentaprism, directed towards the mirror, maybe i scratched it.\n\nso my question is, should/could i replace pentaprism? a replacement camera would not be too expensive, it's just the emotional factor.", "sortedWord": "None", "identifyer": 18895, "year": "2021"}, {"Unnamed: 0": 224529, "autor": "callmemalachi", "date": 1610385883000, "content": "Fujifilm X-S10 having trouble transferring files /!/ Hey everyone!I just recently picked up a Fujifilm X-S10 and I truly love this camera.Video is clean and crisp and the photos remind me of exactly what made me fall in love with photos several years.\n\nHowever I've been having some issues transferring files from the camera to my computer.I bought an SanDisk Extreme Pro 128gb and I've been shooting with it since purchase, the 4k video playback on the camera works perfectly. I have the UGREEN SD Card reader from Amazon and my first time trying to pull video from the card, I tried to play it back on my computer VLC, Media Player, and Premiere and every time the video would hang up or glitch in spots to the point where the files were unusable.\n\nSo eventually I started plugging the Type C cable into the camera and transferring the files that way and everything was working great, however, now the camera won't let me move the files at all. I try to play them through the Windows Explorer while the camera is connected and it gives an error code: 0xc10100aa\n\nI try to drag the file to the desktop to play them natively from my computer and error window pops up stating, Error Copying File or Folder, Access is denied.I double checked to make sure the lock switch on the card was in the correct spot as well. Any thoughts or help would be incredble thanks!  \n\n\nedit: Extra bit of info, Photos also don't show when the camera is connected to the computer with text, It looks like you don't have permission to view this file, Check the permissions and try again.", "link": "https://www.reddit.com/r/Cameras/comments/kv79vz/fujifilm_xs10_having_trouble_transferring_files/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "fujifilm x-s10 having trouble transferring files /!/ hey everyone!i just recently picked up a fujifilm x-s10 and i truly love this camera.video is clean and crisp and the photos remind me of exactly what made me fall in love with photos several years.\n\nhowever i've been having some issues transferring files from the camera to my computer.i bought an sandisk extreme pro 128gb and i've been shooting with it since purchase, the 4k video playback on the camera works perfectly. i have the ugreen sd card reader from amazon and my first time trying to pull video from the card, i tried to play it back on my computer vlc, media player, and premiere and every time the video would hang up or glitch in -----> spots !!!  to the point where the files were unusable.\n\nso eventually i started plugging the type c cable into the camera and transferring the files that way and everything was working great, however, now the camera won't let me move the files at all. i try to play them through the windows explorer while the camera is connected and it gives an error code: 0xc10100aa\n\ni try to drag the file to the desktop to play them natively from my computer and error window pops up stating, error copying file or folder, access is denied.i double checked to make sure the lock switch on the card was in the correct spot as well. any thoughts or help would be incredble thanks!  \n\n\nedit: extra bit of info, photos also don't show when the camera is connected to the computer with text, it looks like you don't have permission to view this file, check the permissions and try again.", "sortedWord": "None", "identifyer": 19235, "year": "2021"}, {"Unnamed: 0": 224810, "autor": "ProjectAnalog", "date": 1611165631000, "content": "If your Hasselblad Lens also has white spots - here is how to fix it! [OC]", "link": "https://www.reddit.com/r/Cameras/comments/l1ej7v/if_your_hasselblad_lens_also_has_white_spots_here/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "if your hasselblad lens also has white -----> spots !!!  - here is how to fix it! [oc]", "sortedWord": "None", "identifyer": 19519, "year": "2021"}, {"Unnamed: 0": 225077, "autor": "Level_Visual_6407", "date": 1620193763000, "content": "Canon New F-1 /!/ I just got a Canon New F-1 a few weeks ago and I’ve been using it just fine. I have the standard Eye Level Viewfinder and I just ordered the AE Viewfinder, and later realized I have a PE focusing screen, and I’ve heard that the Spot metering focusing screens don’t work with the AE viewfinder when the shutter dial is set to automatic. Is this true? And if so, is it also true for the P type focusing screens? Will I need to order an AE focusing screen?", "link": "https://www.reddit.com/r/Cameras/comments/n58m1b/canon_new_f1/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon new f-1 /!/ i just got a canon new f-1 a few weeks ago and i’ve been using it just fine. i have the standard eye level viewfinder and i just ordered the ae viewfinder, and later realized i have a pe focusing screen, and i’ve heard that the -----> spot !!!  metering focusing screens don’t work with the ae viewfinder when the shutter dial is set to automatic. is this true? and if so, is it also true for the p type focusing screens? will i need to order an ae focusing screen?", "sortedWord": "None", "identifyer": 19799, "year": "2021"}, {"Unnamed: 0": 225631, "autor": "NaturalAlfalfa", "date": 1628159598000, "content": "Need advice /!/ I want to put a small  video camera in  the back of my van so I can keep an eye on my dog in her crate while we're driving. Doesn't have to be good quality, but I want to be able to see her in real time on my phone. Not sure how to do it since there won't be WiFi while driving obviously. Can I use my phone as a hot spot to connect to a camera? Or some kind of Bluetooth connection?", "link": "https://www.reddit.com/r/Cameras/comments/oyetza/need_advice/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need advice /!/ i want to put a small  video camera in  the back of my van so i can keep an eye on my dog in her crate while we're driving. doesn't have to be good quality, but i want to be able to see her in real time on my phone. not sure how to do it since there won't be wifi while driving obviously. can i use my phone as a hot -----> spot !!!  to connect to a camera? or some kind of bluetooth connection?", "sortedWord": "None", "identifyer": 20377, "year": "2021"}, {"Unnamed: 0": 226064, "autor": "BigNutzBlue", "date": 1629656159000, "content": "Small spot on inside? of lens. Im not sure what it is and if it’s even inside the lens. Any ideas and remedies? Thank you!", "link": "https://www.reddit.com/r/Cameras/comments/p9hovx/small_spot_on_inside_of_lens_im_not_sure_what_it/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "small -----> spot !!!  on inside? of lens. im not sure what it is and if it’s even inside the lens. any ideas and remedies? thank you!", "sortedWord": "None", "identifyer": 20822, "year": "2021"}, {"Unnamed: 0": 226147, "autor": "Power_of_Drew", "date": 1625767140000, "content": "Just posted this video battling a MFT versus a FF, which one will win, can you spot the MFT? /!/ Thank you all for supporting me by the way. Can you spot the MFT?\n\n[youtube.com/watch?v=pAn-29-xGFI](https://youtube.com/watch?v=pAn-29-xGFI)", "link": "https://www.reddit.com/r/Cameras/comments/ogcn98/just_posted_this_video_battling_a_mft_versus_a_ff/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just posted this video battling a mft versus a ff, which one will win, can you -----> spot !!!  the mft? /!/ thank you all for supporting me by the way. can you spot the mft?\n\n[youtube.com/watch?v=pan-29-xgfi](https://youtube.com/watch?v=pan-29-xgfi)", "sortedWord": "None", "identifyer": 20916, "year": "2021"}, {"Unnamed: 0": 226161, "autor": "mossboss77", "date": 1626733218000, "content": "Hiking camera bag help /!/ Im currently looking for a new camera bag to hike with, i only carry one body and 2 extra lens with me. Hoping to have something that is minimalistic, budget friendly. \n\nFeatures i would like to have is spot for water bladder.", "link": "https://www.reddit.com/r/Cameras/comments/onopu8/hiking_camera_bag_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hiking camera bag help /!/ im currently looking for a new camera bag to hike with, i only carry one body and 2 extra lens with me. hoping to have something that is minimalistic, budget friendly. \n\nfeatures i would like to have is -----> spot !!!  for water bladder.", "sortedWord": "None", "identifyer": 20930, "year": "2021"}, {"Unnamed: 0": 226304, "autor": "kez_no", "date": 1626971035000, "content": "Translucent Spots on Analogue Camera Lens /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/ophav5/translucent_spots_on_analogue_camera_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "translucent -----> spots !!!  on analogue camera lens /!/ [removed]", "sortedWord": "None", "identifyer": 21079, "year": "2021"}, {"Unnamed: 0": 226662, "autor": "cwzahn000", "date": 1632414286000, "content": "What could be causing this blue spot in bottom left corner of shot?", "link": "https://www.reddit.com/r/Cameras/comments/ptyv8b/what_could_be_causing_this_blue_spot_in_bottom/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what could be causing this blue -----> spot !!!  in bottom left corner of shot?", "sortedWord": "None", "identifyer": 21457, "year": "2021"}, {"Unnamed: 0": 226803, "autor": "Throwaway18077", "date": 1633308510000, "content": "Does anybody know how to spot a camera placed in the center of a ceiling fire sprinkler? /!/ Hi all. \n\nI live in a building that has maintenance. Recently the maintenance guy was in my apartment without my permission. \n\nHe creeps me the hell out. He looks at me like I’m a piece of meat and he makes me feel afraid. He looks like the stereotypical creep to spy on women. \n\nI had this strange thought about how he could easily be monitoring me and place a camera since he has access to my home without me here. \n\nThere’s a ceiling sprinkler by my shower in my bathroom. I used a flashlight on it and there’s a reflective look. I checked another one at a different location in my apt and there is not not a reflective look in the center. \n\nI am afraid to touch this thing because it could go off. I can’t just accuse this man of anything. So how can I figure out if there’s a camera?", "link": "https://www.reddit.com/r/Cameras/comments/q0usb9/does_anybody_know_how_to_spot_a_camera_placed_in/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anybody know how to -----> spot !!!  a camera placed in the center of a ceiling fire sprinkler? /!/ hi all. \n\ni live in a building that has maintenance. recently the maintenance guy was in my apartment without my permission. \n\nhe creeps me the hell out. he looks at me like i’m a piece of meat and he makes me feel afraid. he looks like the stereotypical creep to spy on women. \n\ni had this strange thought about how he could easily be monitoring me and place a camera since he has access to my home without me here. \n\nthere’s a ceiling sprinkler by my shower in my bathroom. i used a flashlight on it and there’s a reflective look. i checked another one at a different location in my apt and there is not not a reflective look in the center. \n\ni am afraid to touch this thing because it could go off. i can’t just accuse this man of anything. so how can i figure out if there’s a camera?", "sortedWord": "None", "identifyer": 21603, "year": "2021"}, {"Unnamed: 0": 226942, "autor": "tnfsoldier", "date": 1634585108000, "content": "ID on camera? /!/ Bit of a blurry portrait photo taken by the late Davide Sorrenti, but was wondering if anyone can spot what model it is?", "link": "https://www.reddit.com/r/Cameras/comments/qatyge/id_on_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "id on camera? /!/ bit of a blurry portrait photo taken by the late davide sorrenti, but was wondering if anyone can -----> spot !!!  what model it is?", "sortedWord": "None", "identifyer": 21749, "year": "2021"}, {"Unnamed: 0": 226948, "autor": "DangerousSandAlpaca", "date": 1634570143000, "content": "Anything similar to the Paper Shoot Camera? /!/ I seem to have fallen for the marketing campaigns on Tik Tok and found myself really liking the Paper Shoot cameras ([https://papershootcamera.com/](https://papershootcamera.com/)). I forever find myself trying to get into film photography as I am a keen photographer but with the hassle of buying film and then getting it processed (lazy I know), I always seem to forget or never get round to it.\n\nWhen I spotted the Paper Shoot cameras I thought they were they ideal in-between, something with a similar lofi 35mm film esque image quality, no need to faff or pay for extra film and the development, no screen so it has that element of surprise once you get round to viewing the image rather than having a screen but the more I look into them and think about purchasing one the more I am put off but only due to the fact they don't seem at all weatherproof and considering it would most likely live in my bag I'm sure dampness from any water bottles etc would completely ruin it, it doesn't have flash and costs $120 + international shipping. \n\nSo I was wondering does anyone know of any cameras that would produce film esque images that doesn't require film? If not, I think I just need to stop being lazy and get round to using my film cameras that seem to be collecting dust. If 35mm cameras are the recommendation is there any specific film you would recommend? Thank you in advance.", "link": "https://www.reddit.com/r/Cameras/comments/qaoq4l/anything_similar_to_the_paper_shoot_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "anything similar to the paper shoot camera? /!/ i seem to have fallen for the marketing campaigns on tik tok and found myself really liking the paper shoot cameras ([https://papershootcamera.com/](https://papershootcamera.com/)). i forever find myself trying to get into film photography as i am a keen photographer but with the hassle of buying film and then getting it processed (lazy i know), i always seem to forget or never get round to it.\n\nwhen i -----> spotted !!!  the paper shoot cameras i thought they were they ideal in-between, something with a similar lofi 35mm film esque image quality, no need to faff or pay for extra film and the development, no screen so it has that element of surprise once you get round to viewing the image rather than having a screen but the more i look into them and think about purchasing one the more i am put off but only due to the fact they don't seem at all weatherproof and considering it would most likely live in my bag i'm sure dampness from any water bottles etc would completely ruin it, it doesn't have flash and costs $120 + international shipping. \n\nso i was wondering does anyone know of any cameras that would produce film esque images that doesn't require film? if not, i think i just need to stop being lazy and get round to using my film cameras that seem to be collecting dust. if 35mm cameras are the recommendation is there any specific film you would recommend? thank you in advance.", "sortedWord": "None", "identifyer": 21755, "year": "2021"}, {"Unnamed: 0": 227090, "autor": "mandjasgrozde", "date": 1634906710000, "content": "Fungus or dust? I just bought this lens secondhand and sadly managed to see this little weird spot just as I got home, I am concerned it may be fungus. Can you advise me on that? What can I do if it is fungus? Thank you!!", "link": "https://www.reddit.com/r/Cameras/comments/qdg5ah/fungus_or_dust_i_just_bought_this_lens_secondhand/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fungus or dust? i just bought this lens secondhand and sadly managed to see this little weird -----> spot !!!  just as i got home, i am concerned it may be fungus. can you advise me on that? what can i do if it is fungus? thank you!!", "sortedWord": "None", "identifyer": 21905, "year": "2021"}, {"Unnamed: 0": 227211, "autor": "Dwez369", "date": 1618517090000, "content": "Should I get this camera??!! Or does any else have a better option? /!/ Hi!\n\nI’m thinking of getting the Panasonic lumix fz82, it’s got a good zoom, and in my very small budget. I am concerned that the image won’t be very good with the small sensor. \n\nIt’s a big compromise between a larger sensor and a good zoom, does anyone have any camera options that hits the sweet spot of a large sensor and zoom (min x20). (My budget is about £350/$500 - not an awful lot for decent camera i know (hence my trouble finding a suitable camera) , but I’m stretching my self with the budget I have) \n\nI’ve considered second hand but ideally a new one with warranty would be best.\n\nAny help would be much appreciated.\n\nThank you!!", "link": "https://www.reddit.com/r/Cameras/comments/mrmvna/should_i_get_this_camera_or_does_any_else_have_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "should i get this camera??!! or does any else have a better option? /!/ hi!\n\ni’m thinking of getting the panasonic lumix fz82, it’s got a good zoom, and in my very small budget. i am concerned that the image won’t be very good with the small sensor. \n\nit’s a big compromise between a larger sensor and a good zoom, does anyone have any camera options that hits the sweet -----> spot !!!  of a large sensor and zoom (min x20). (my budget is about £350/$500 - not an awful lot for decent camera i know (hence my trouble finding a suitable camera) , but i’m stretching my self with the budget i have) \n\ni’ve considered second hand but ideally a new one with warranty would be best.\n\nany help would be much appreciated.\n\nthank you!!", "sortedWord": "None", "identifyer": 22028, "year": "2021"}, {"Unnamed: 0": 227291, "autor": "andthatsalright", "date": 1617344814000, "content": "Alternatives to this \"Clip Mount\" /!/ Hey! I appologize if this is the wrong sub for this, but I've been looking a solution to mount my GoPro on to top of my ultrawide, so it is nearly eye-level. I've always thought the common webcam style would be enough, but weirdly it hardly exists. \n\nAfter a little investigation, I stumbled across [this](https://www.bhphotovideo.com/c/product/1336208-REG/marshall_electronics_cvm_5_universal_1_4_20_camera_clip.html), which seems like its absolutely perfect, except for the price is 50 bucks. I'm trying to essentially repurpose a gopro to use as a webcam, so buying a $50 mount for it is kind of silly. If it were like say $15-$25, I'd actually buy two so that I could also mount my light with it.\n\nAnyways, to my question. Does anyone have any suggestions on what to use in lieu of this product? Or alternatives of a similar design to this product? Greatly appreciate it, and once again apologies if this is not the correct spot for this.", "link": "https://www.reddit.com/r/Cameras/comments/miej08/alternatives_to_this_clip_mount/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "alternatives to this \"clip mount\" /!/ hey! i appologize if this is the wrong sub for this, but i've been looking a solution to mount my gopro on to top of my ultrawide, so it is nearly eye-level. i've always thought the common webcam style would be enough, but weirdly it hardly exists. \n\nafter a little investigation, i stumbled across [this](https://www.bhphotovideo.com/c/product/1336208-reg/marshall_electronics_cvm_5_universal_1_4_20_camera_clip.html), which seems like its absolutely perfect, except for the price is 50 bucks. i'm trying to essentially repurpose a gopro to use as a webcam, so buying a $50 mount for it is kind of silly. if it were like say $15-$25, i'd actually buy two so that i could also mount my light with it.\n\nanyways, to my question. does anyone have any suggestions on what to use in lieu of this product? or alternatives of a similar design to this product? greatly appreciate it, and once again apologies if this is not the correct -----> spot !!!  for this.", "sortedWord": "None", "identifyer": 22112, "year": "2021"}, {"Unnamed: 0": 227380, "autor": "Psychological_Salad_", "date": 1610031575000, "content": "Pretty good deal on an X-T1 on eBay. I asked the seller for a picture of the sensor and this was it. I see kind of a spot or something on it and I’m not sure that it is. Should I refrain from trying to get it?", "link": "https://www.reddit.com/r/Cameras/comments/ksewr4/pretty_good_deal_on_an_xt1_on_ebay_i_asked_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pretty good deal on an x-t1 on ebay. i asked the seller for a picture of the sensor and this was it. i see kind of a -----> spot !!!  or something on it and i’m not sure that it is. should i refrain from trying to get it?", "sortedWord": "None", "identifyer": 22205, "year": "2021"}, {"Unnamed: 0": 227443, "autor": "Evan__S", "date": 1611068996000, "content": "Dropped lens on rock :( anything I should do? Also, good second camera to buy? /!/ Lens pictures:\nhttps://imgur.com/gallery/M0mwOv9\n\n\nThe main thing I’m worried about is this chip towards the middle of the lens. I’ve taken pictures with the lens a few times and it’s led to this annoying spot whenever I shoot towards the sun with a smaller sized aperture... which since I shoot landscapes tends to be a situation I encounter a lot. \n\nIs it even possible to fix this lens, or would it just be worth getting another lens? I live an hour away from the nearest camera store so would be nice to know before making the trip. \n\n I’m also considering upgrading my camera (canon t5) which has god awful iso tolerance to the point where I can’t shoot above iso 400 without images having a shit ton of noise. Also, the mirror is annoyingly loud and FPS for continuous shooting is extremely slow. Other than that though it’s done everything I need it to, so not 100% sure if an upgrade is warranted, altho this is probably the best time to do so.\nI’m mainly considering this because if the lens isn’t worth fixing, then this is probs a good time for me to get a Sony camera or switch brands. \n\nDoes anyone have any suggestions on what type of camera might be good as a second camera to buy, if I were to upgrade? I’ve been shooting for 5ish years but I’d still consider myself an ameture and do it mainly has a hobby, so I wouldn’t want anything too special. I’m considering trying full frame, but also might wanna go mirror less because I take a lot of pictures hiking and don’t want something super heavy.\n\ntl;dr Is my lens screwed? Also, best camera upgrade for hobby photographer who has taken pics intermittently for 5 years?", "link": "https://www.reddit.com/r/Cameras/comments/l0lok9/dropped_lens_on_rock_anything_i_should_do_also/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dropped lens on rock :( anything i should do? also, good second camera to buy? /!/ lens pictures:\nhttps://imgur.com/gallery/m0mwov9\n\n\nthe main thing i’m worried about is this chip towards the middle of the lens. i’ve taken pictures with the lens a few times and it’s led to this annoying -----> spot !!!  whenever i shoot towards the sun with a smaller sized aperture... which since i shoot landscapes tends to be a situation i encounter a lot. \n\nis it even possible to fix this lens, or would it just be worth getting another lens? i live an hour away from the nearest camera store so would be nice to know before making the trip. \n\n i’m also considering upgrading my camera (canon t5) which has god awful iso tolerance to the point where i can’t shoot above iso 400 without images having a shit ton of noise. also, the mirror is annoyingly loud and fps for continuous shooting is extremely slow. other than that though it’s done everything i need it to, so not 100% sure if an upgrade is warranted, altho this is probably the best time to do so.\ni’m mainly considering this because if the lens isn’t worth fixing, then this is probs a good time for me to get a sony camera or switch brands. \n\ndoes anyone have any suggestions on what type of camera might be good as a second camera to buy, if i were to upgrade? i’ve been shooting for 5ish years but i’d still consider myself an ameture and do it mainly has a hobby, so i wouldn’t want anything too special. i’m considering trying full frame, but also might wanna go mirror less because i take a lot of pictures hiking and don’t want something super heavy.\n\ntl;dr is my lens screwed? also, best camera upgrade for hobby photographer who has taken pics intermittently for 5 years?", "sortedWord": "None", "identifyer": 22274, "year": "2021"}, {"Unnamed: 0": 227522, "autor": "Psychological_Salad_", "date": 1610637495000, "content": "Is this anything more than a bit of dust? The camera seems to be in great condition in general, however I’ve seen a few spots on the sensor where something is there. Is this anything to worry about?", "link": "https://www.reddit.com/r/Cameras/comments/kx7lec/is_this_anything_more_than_a_bit_of_dust_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is this anything more than a bit of dust? the camera seems to be in great condition in general, however i’ve seen a few -----> spots !!!  on the sensor where something is there. is this anything to worry about?", "sortedWord": "None", "identifyer": 22355, "year": "2021"}, {"Unnamed: 0": 227635, "autor": "mjapow5314", "date": 1620400376000, "content": "MIRRORLESS camera users, do you have trouble keeping your camera sensor clean? PLEASE ADVISE /!/ I just returned a faulty Nikon Z7II, because drops of grease or oil would appear on the camera sensor. I tested all of my lenses, this was a camera issue, and would happen even after I cleaned it with recommended products. I brought this up with Nikon, and they sent me a return shipping label. Although I assume this was a fault with the product and not with the model, I did notice that, apart from the oil/grease spots, DUST would get trapped on the sensor almost every time I changed lenses. When I signed up for Nikon's Yellow Program to try out the Z5, which I loved, I did not have any such issues with dust or other particles on the camera's sensor.\n\nTo all of the mirrorless camera users out there, have you had similar issues with dust or other matter on the sensor? Does the internal sensor cleaner in your camera take care of that, or not? Have you had to go to extreme lengths to keep your sensor clean? If so, have you found a solution? What model have you used, and has it been worth it in your experience? Have any of you used a Z7 or Z7II and had issues like this, or not?\n\nI'd be very happy to receive some input on your experiences and/or any recommendations on a new camera, as I am heavily questioning whether I should try again with the Z7II or find another camera, mirrorless or not. The Nikon D850 seems the most attractive to me so far. I shoot primarily landscape photography. Thank you.", "link": "https://www.reddit.com/r/Cameras/comments/n70su0/mirrorless_camera_users_do_you_have_trouble/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "mirrorless camera users, do you have trouble keeping your camera sensor clean? please advise /!/ i just returned a faulty nikon z7ii, because drops of grease or oil would appear on the camera sensor. i tested all of my lenses, this was a camera issue, and would happen even after i cleaned it with recommended products. i brought this up with nikon, and they sent me a return shipping label. although i assume this was a fault with the product and not with the model, i did notice that, apart from the oil/grease -----> spots !!! , dust would get trapped on the sensor almost every time i changed lenses. when i signed up for nikon's yellow program to try out the z5, which i loved, i did not have any such issues with dust or other particles on the camera's sensor.\n\nto all of the mirrorless camera users out there, have you had similar issues with dust or other matter on the sensor? does the internal sensor cleaner in your camera take care of that, or not? have you had to go to extreme lengths to keep your sensor clean? if so, have you found a solution? what model have you used, and has it been worth it in your experience? have any of you used a z7 or z7ii and had issues like this, or not?\n\ni'd be very happy to receive some input on your experiences and/or any recommendations on a new camera, as i am heavily questioning whether i should try again with the z7ii or find another camera, mirrorless or not. the nikon d850 seems the most attractive to me so far. i shoot primarily landscape photography. thank you.", "sortedWord": "None", "identifyer": 22474, "year": "2021"}, {"Unnamed: 0": 227680, "autor": "igores3601", "date": 1622996370000, "content": "Looking for a camera/webcam hybrid (+ digiscoping) /!/ I bought the Celestron C90 spotting scope a while back and I want to do some digiscoping with it. I would preffer a camera that I could plug into my PC and use as a webcam / watch things through my scope for hours without it heating up (something that runs off the power cable without the need to put in a battery)\n\n&amp;#x200B;\n\nWould be nice to have some examples in varying price ranges so I can choose one based on my needs and budget  \n\n\nThanks in advance :)", "link": "https://www.reddit.com/r/Cameras/comments/ntpchv/looking_for_a_camerawebcam_hybrid_digiscoping/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "looking for a camera/webcam hybrid (+ digiscoping) /!/ i bought the celestron c90 -----> spotting !!!  scope a while back and i want to do some digiscoping with it. i would preffer a camera that i could plug into my pc and use as a webcam / watch things through my scope for hours without it heating up (something that runs off the power cable without the need to put in a battery)\n\n&amp;#x200b;\n\nwould be nice to have some examples in varying price ranges so i can choose one based on my needs and budget  \n\n\nthanks in advance :)", "sortedWord": "None", "identifyer": 22520, "year": "2021"}, {"Unnamed: 0": 228015, "autor": "pedalposting", "date": 1626744100000, "content": "Is there a good way to guarantee a fast shutter speed when you can only set aperture? /!/ I have inherited an Olympus XA and am experimenting with shooting from a moving bicycle. The XA adjusts its shutter speed automatically based on aperture, so I'm wondering if there's a 'sweet spot' where I can be sure to minimise motion blur in varying light conditions. Maybe I need a different camera for this? (Sorry for newbie question!)\n\nCamera: [https://youtu.be/Bwm10mCvZck](https://youtu.be/Bwm10mCvZck)", "link": "https://www.reddit.com/r/Cameras/comments/onrvvr/is_there_a_good_way_to_guarantee_a_fast_shutter/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there a good way to guarantee a fast shutter speed when you can only set aperture? /!/ i have inherited an olympus xa and am experimenting with shooting from a moving bicycle. the xa adjusts its shutter speed automatically based on aperture, so i'm wondering if there's a 'sweet -----> spot !!! ' where i can be sure to minimise motion blur in varying light conditions. maybe i need a different camera for this? (sorry for newbie question!)\n\ncamera: [https://youtu.be/bwm10mcvzck](https://youtu.be/bwm10mcvzck)", "sortedWord": "None", "identifyer": 22874, "year": "2021"}, {"Unnamed: 0": 228027, "autor": "cherryMxMech", "date": 1630998744000, "content": "How to restore peeled off or worn out Photo paper /!/ I have several sticked photographs , which peeled off by my aunty and the surface or anything coating them was destroyed , im able to see the underlying white layer because the gelatine layer removed.\n\nThe point is , the moment when this damaged spot contact to water it smeared away , cleaning the photo paper back to its pure white.\n\nI'm looking for a solution to  \"lacquer\" or freeze it  state . \n\nI have bought Ilford ISOFLO without even knowing if this is a right solution or not . Looking for suggestion. thanks", "link": "https://www.reddit.com/r/Cameras/comments/pji1jp/how_to_restore_peeled_off_or_worn_out_photo_paper/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to restore peeled off or worn out photo paper /!/ i have several sticked photographs , which peeled off by my aunty and the surface or anything coating them was destroyed , im able to see the underlying white layer because the gelatine layer removed.\n\nthe point is , the moment when this damaged -----> spot !!!  contact to water it smeared away , cleaning the photo paper back to its pure white.\n\ni'm looking for a solution to  \"lacquer\" or freeze it  state . \n\ni have bought ilford isoflo without even knowing if this is a right solution or not . looking for suggestion. thanks", "sortedWord": "None", "identifyer": 22888, "year": "2021"}, {"Unnamed: 0": 228086, "autor": "TMR___", "date": 1630506727000, "content": "Camera maintenance /!/ I recently bought an old camera, its my first analog one. Is there anything specific i need to know about maintenance? With old i mean its built in the 50s-60s. Theres also 1 or 2 very small rust spots on the metal, any ideas of getting rid of it?", "link": "https://www.reddit.com/r/Cameras/comments/pfv3zx/camera_maintenance/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "camera maintenance /!/ i recently bought an old camera, its my first analog one. is there anything specific i need to know about maintenance? with old i mean its built in the 50s-60s. theres also 1 or 2 very small rust -----> spots !!!  on the metal, any ideas of getting rid of it?", "sortedWord": "None", "identifyer": 22951, "year": "2021"}, {"Unnamed: 0": 228227, "autor": "vinwin02", "date": 1633625152000, "content": "Spotting scope adapter for my Olympus camera? /!/ Hello people of reddit, I need help.\n\nI'm about to buy my first spotting scope for wildlife watching and I want to try out digiscoping with it, meaning using the camera through the scope. There are many specific adapters for it, and I'm just unsure which ones fit and which ones don't (the ones recommended there are for Nikon and Canon).\n\nCan anybody help me?\n\nI have an Olympus OM-D E-M5 camera and a the spotting scope is a [Vortex Viper HD 20-60x85](https://www.vortexoptik.de/vortex-viper-hd-spektiv-20-60x85-gewinkelt/).", "link": "https://www.reddit.com/r/Cameras/comments/q3d6bf/spotting_scope_adapter_for_my_olympus_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "-----> spotting !!!  scope adapter for my olympus camera? /!/ hello people of reddit, i need help.\n\ni'm about to buy my first spotting scope for wildlife watching and i want to try out digiscoping with it, meaning using the camera through the scope. there are many specific adapters for it, and i'm just unsure which ones fit and which ones don't (the ones recommended there are for nikon and canon).\n\ncan anybody help me?\n\ni have an olympus om-d e-m5 camera and a the spotting scope is a [vortex viper hd 20-60x85](https://www.vortexoptik.de/vortex-viper-hd-spektiv-20-60x85-gewinkelt/).", "sortedWord": "None", "identifyer": 23097, "year": "2021"}, {"Unnamed: 0": 228243, "autor": "Yammy_Lyfe", "date": 1633571376000, "content": "Is this specific Tokina lens functioning properly? It appears to have one possible transion spot on the focus clutch. I can always find the spot to click it to manual, but it's just one place. Is that normal? [video explination]", "link": "https://www.reddit.com/r/Cameras/comments/q2ype0/is_this_specific_tokina_lens_functioning_properly/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this specific tokina lens functioning properly? it appears to have one possible transion -----> spot !!!  on the focus clutch. i can always find the spot to click it to manual, but it's just one place. is that normal? [video explination]", "sortedWord": "None", "identifyer": 23114, "year": "2021"}, {"Unnamed: 0": 228285, "autor": "Mystery_Asian", "date": 1634269276000, "content": "Hot pixels on new camera /!/ I just got a Nikon Z6 and the first I did with it is night photography (because I needed the camera in the upcoming days, and the only time I had to try the camera was during an evening). (I'm fairly new to photography. I mainly do videography.)\n\nI was using the body with the FTZ adapter and the Nikkor 24-85mm f/3.5-4.5G ED VR lens.\n\nBack on the computer, I noticed a lot of my pictures had a white dot at the same spot. Some of them had more than one dot. I thought it might be hot pixels since it was shot at a long exposure and high ISO. So, I tested it again in low light and the white dots did show up.\n\n&amp;#x200B;\n\nMy question is:\n\n# Is it normal for a brand new camera to have multiple hot pixels?\n\nAnd, should I file a warranty claim about it?\n\n&amp;#x200B;\n\nMaybe I am wrong and it's not hot pixels. Anyway, it is a small white dot about the size of a pixel. When, in low light (slow shutter, high ISO), I can notice a heck of a lot of dots on the screen, but there are at most 5 to 8 white dots in the pictures. Under normal lighting, there are no dots.\n\nI don't know what I should do. So, I'm asking you guys, who no doubt have more knowledge than me, for help and opinion about it.", "link": "https://www.reddit.com/r/Cameras/comments/q8fv6c/hot_pixels_on_new_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hot pixels on new camera /!/ i just got a nikon z6 and the first i did with it is night photography (because i needed the camera in the upcoming days, and the only time i had to try the camera was during an evening). (i'm fairly new to photography. i mainly do videography.)\n\ni was using the body with the ftz adapter and the nikkor 24-85mm f/3.5-4.5g ed vr lens.\n\nback on the computer, i noticed a lot of my pictures had a white dot at the same -----> spot !!! . some of them had more than one dot. i thought it might be hot pixels since it was shot at a long exposure and high iso. so, i tested it again in low light and the white dots did show up.\n\n&amp;#x200b;\n\nmy question is:\n\n# is it normal for a brand new camera to have multiple hot pixels?\n\nand, should i file a warranty claim about it?\n\n&amp;#x200b;\n\nmaybe i am wrong and it's not hot pixels. anyway, it is a small white dot about the size of a pixel. when, in low light (slow shutter, high iso), i can notice a heck of a lot of dots on the screen, but there are at most 5 to 8 white dots in the pictures. under normal lighting, there are no dots.\n\ni don't know what i should do. so, i'm asking you guys, who no doubt have more knowledge than me, for help and opinion about it.", "sortedWord": "None", "identifyer": 23158, "year": "2021"}, {"Unnamed: 0": 228290, "autor": "Jonathancrincoli", "date": 1634261871000, "content": "Lens help /!/ I’m a newb, I have a k1000 Pentax I’m having fun with I have a 50mm lens now. I’m looking into a wider angle lens I see two I have my eye on one is 28mm with a f2.8 the other is 28mm with a f3.5 is having the smaller f spot a better choice ?", "link": "https://www.reddit.com/r/Cameras/comments/q8dpvr/lens_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens help /!/ i’m a newb, i have a k1000 pentax i’m having fun with i have a 50mm lens now. i’m looking into a wider angle lens i see two i have my eye on one is 28mm with a f2.8 the other is 28mm with a f3.5 is having the smaller f -----> spot !!!  a better choice ?", "sortedWord": "None", "identifyer": 23163, "year": "2021"}], "name": "spotCameras2021"}