{"interestingcomments": [{"Unnamed: 0": 208081, "autor": "896359", "date": 1587083419000, "content": "D7500 vs D7200 /!/ I currently have a Nikon D7200 however it has a spot that shows up in photos and has a serial number that starts with a 8 (means it was intended for UK and as far as I understand and Nikon won't service it because it is considered grey market) that combined with the fact that it is an older camera has me looking at the D7500, I primarily shoot landscape and car photography so the lack of a second SD card shouldn't effect me. What are your thoughts?\n\n[View Poll](https://www.reddit.com/poll/g2rdov)", "link": "https://www.reddit.com/r/Cameras/comments/g2rdov/d7500_vs_d7200/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d7500 vs d7200 /!/ i currently have a nikon d7200 however it has a -----> spot !!!  that shows up in photos and has a serial number that starts with a 8 (means it was intended for uk and as far as i understand and nikon won't service it because it is considered grey market) that combined with the fact that it is an older camera has me looking at the d7500, i primarily shoot landscape and car photography so the lack of a second sd card shouldn't effect me. what are your thoughts?\n\n[view poll](https://www.reddit.com/poll/g2rdov)", "sortedWord": "None", "identifyer": 1646, "year": "2020"}, {"Unnamed: 0": 208415, "autor": "watsonthecat", "date": 1606077260000, "content": "Help Choosing Mirrorless Camera? (Canon vs Sony) /!/ I've been using a 60D for since 2011 and I finally want to treat myself and upgrade my camera body. I've ultimately decided I want to go mirrorless because of the increased focus points compared to DSLRs. \n\nI shoot autofocus the majority of the time except I love to choose what to focus on. After using the 60D with 9 focus points for so long, getting to choose a focus spot almost anywhere in the viewfinder sounds amazing.\n\nI'm just an amateur photographer who takes pictures of the family around the house, friend/family gatherings, and hiking.\n\nMy budget is ~$2,000. I was always planning on going with a Canon body as I have Canon glass but the Sony A7iii is on sale for $1,700. Add in the metabones adapter for $400 and that is close enough to budget for me. So I've been debating between the R vs RP vs a7ii. \n\nJust looking for any helpful information about my decision. I think the main thing I'm concern about is if my Canon Lenses will work well on the Sony. From what I've researched, the A7iii is the better camera but is it worth it to switch with Canon glass?\n\nHere are my lenses I have\n* Tamron 24-70 f/2.8 g2\n* Canon 50 f/1.4\n* Canon 24 f/2.8\n* Canon 24-105 f/4\n\nThanks", "link": "https://www.reddit.com/r/Cameras/comments/jz2y0l/help_choosing_mirrorless_camera_canon_vs_sony/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help choosing mirrorless camera? (canon vs sony) /!/ i've been using a 60d for since 2011 and i finally want to treat myself and upgrade my camera body. i've ultimately decided i want to go mirrorless because of the increased focus points compared to dslrs. \n\ni shoot autofocus the majority of the time except i love to choose what to focus on. after using the 60d with 9 focus points for so long, getting to choose a focus -----> spot !!!  almost anywhere in the viewfinder sounds amazing.\n\ni'm just an amateur photographer who takes pictures of the family around the house, friend/family gatherings, and hiking.\n\nmy budget is ~$2,000. i was always planning on going with a canon body as i have canon glass but the sony a7iii is on sale for $1,700. add in the metabones adapter for $400 and that is close enough to budget for me. so i've been debating between the r vs rp vs a7ii. \n\njust looking for any helpful information about my decision. i think the main thing i'm concern about is if my canon lenses will work well on the sony. from what i've researched, the a7iii is the better camera but is it worth it to switch with canon glass?\n\nhere are my lenses i have\n* tamron 24-70 f/2.8 g2\n* canon 50 f/1.4\n* canon 24 f/2.8\n* canon 24-105 f/4\n\nthanks", "sortedWord": "None", "identifyer": 2024, "year": "2020"}, {"Unnamed: 0": 208893, "autor": "silverarrrowamg", "date": 1582162653000, "content": "Any idea on the spot middle far left? Canon 80d 55-250", "link": "https://www.reddit.com/r/Cameras/comments/f6lbrr/any_idea_on_the_spot_middle_far_left_canon_80d/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any idea on the -----> spot !!!  middle far left? canon 80d 55-250", "sortedWord": "None", "identifyer": 2542, "year": "2020"}, {"Unnamed: 0": 208956, "autor": "DragonQueen1203", "date": 1579227404000, "content": "All the photos that I take with my old Polaroid camera have these white/light blue spots on the tops and bottoms of the pictures. What is causing this, and can I fix it? Thanks! :)", "link": "https://www.reddit.com/r/Cameras/comments/eptt48/all_the_photos_that_i_take_with_my_old_polaroid/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "all the photos that i take with my old polaroid camera have these white/light blue -----> spots !!!  on the tops and bottoms of the pictures. what is causing this, and can i fix it? thanks! :)", "sortedWord": "None", "identifyer": 2606, "year": "2020"}, {"Unnamed: 0": 209015, "autor": "photoexperts", "date": 1578999944000, "content": "Light &amp;amp; Motion SOLA Dive 1200 Spot Underwater Light", "link": "https://www.reddit.com/r/Cameras/comments/eojvbe/light_amp_motion_sola_dive_1200_spot_underwater/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light &amp;amp; motion sola dive 1200 -----> spot !!!  underwater light", "sortedWord": "None", "identifyer": 2666, "year": "2020"}, {"Unnamed: 0": 209134, "autor": "its-leah", "date": 1583365017000, "content": "Sos! I need a good Sensor cleaning /!/ Hey everyone, so i have the canon 5d mkiii and I’ve noticed a speck on my sensor. It always shows up if i use a lens at 50 mm, same spot, even with different lenses. I’ve tried (very gently) manually cleaning it but my photo professor says I’ll either have to keep retouching it out of my photos or get it cleaned/ replaced, and i could try myself but there’s a risk of making it worse. Any advice?", "link": "https://www.reddit.com/r/Cameras/comments/fdm1dw/sos_i_need_a_good_sensor_cleaning/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sos! i need a good sensor cleaning /!/ hey everyone, so i have the canon 5d mkiii and i’ve noticed a speck on my sensor. it always shows up if i use a lens at 50 mm, same -----> spot !!! , even with different lenses. i’ve tried (very gently) manually cleaning it but my photo professor says i’ll either have to keep retouching it out of my photos or get it cleaned/ replaced, and i could try myself but there’s a risk of making it worse. any advice?", "sortedWord": "None", "identifyer": 2793, "year": "2020"}, {"Unnamed: 0": 209291, "autor": "896359", "date": 1585177844000, "content": "New camera spots /!/ I purchased a camera off a guy on craigslist and he advertised it with a sensor scratch, after using it a little bit and looking at photos of sensor scratches I don't think that is what it has. For those of you who know cameras what is this and is it fixable? (I am talking about the light spots in the right portion of the photo, it is consistently there so it isn't lens flare from the sun)\n\n&amp;#x200B;\n\nThank you for your time!\n\n*Processing img j1bi1hhrhwo41...*", "link": "https://www.reddit.com/r/Cameras/comments/fp0emt/new_camera_spots/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "new camera -----> spots !!!  /!/ i purchased a camera off a guy on craigslist and he advertised it with a sensor scratch, after using it a little bit and looking at photos of sensor scratches i don't think that is what it has. for those of you who know cameras what is this and is it fixable? (i am talking about the light spots in the right portion of the photo, it is consistently there so it isn't lens flare from the sun)\n\n&amp;#x200b;\n\nthank you for your time!\n\n*processing img j1bi1hhrhwo41...*", "sortedWord": "None", "identifyer": 2985, "year": "2020"}, {"Unnamed: 0": 209427, "autor": "cut_the_fat", "date": 1588561908000, "content": "Creating Video Content - Deciding on which Camera to buy. Sony A6400? A6600? Panasonic G85? /!/ I'm looking to create content that will go on YouTube and also accompany some teaching videos for courses. It will mostly be me right in front of the camera.  I can spend $600-1200, or maybe up to 2k if it means the device will get me some more distance.  Here are my thoughts:  \n• I like what I've seen from the Sony A6400 with a Sigma 16mm 1.4 lens with continuous auto-focus. Only hesitation is that I've heard about overheating and that there is no IBIS. Not sure I'll be walking around at all with this thing, mostly on a tripod in one spot.  \n• The Sony A6600 has IBIS.. with a Sigma 16mm 1.4 is it hands down worth the $ over the A6400 or the...  \n• Panasonic G85 has been suggested. Not sure what lens I'd look at with it, and there is no continuous autofocus.\n  \nWhat are the thoughts? Any recommendations in this price range, or major players I should look at by bumping up a price range??  \n  \nFinale question- can either of these or suggestions made be utilized and streamed as a webcam for live courses?", "link": "https://www.reddit.com/r/Cameras/comments/gd3ufx/creating_video_content_deciding_on_which_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "creating video content - deciding on which camera to buy. sony a6400? a6600? panasonic g85? /!/ i'm looking to create content that will go on youtube and also accompany some teaching videos for courses. it will mostly be me right in front of the camera.  i can spend $600-1200, or maybe up to 2k if it means the device will get me some more distance.  here are my thoughts:  \n• i like what i've seen from the sony a6400 with a sigma 16mm 1.4 lens with continuous auto-focus. only hesitation is that i've heard about overheating and that there is no ibis. not sure i'll be walking around at all with this thing, mostly on a tripod in one -----> spot !!! .  \n• the sony a6600 has ibis.. with a sigma 16mm 1.4 is it hands down worth the $ over the a6400 or the...  \n• panasonic g85 has been suggested. not sure what lens i'd look at with it, and there is no continuous autofocus.\n  \nwhat are the thoughts? any recommendations in this price range, or major players i should look at by bumping up a price range??  \n  \nfinale question- can either of these or suggestions made be utilized and streamed as a webcam for live courses?", "sortedWord": "None", "identifyer": 3144, "year": "2020"}, {"Unnamed: 0": 209997, "autor": "tacos-alpastor", "date": 1605726346000, "content": "Should I upgrade? /!/ So I was introduced to the world of photography about 2 years ago. I had a friend in college that happened to have a red Nikon D3300 available, and that she offered to sell at a relatively cheap price. I had zero knowledge about cameras, lenses, brands, etc. So I agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now I know he had a Canon with even lower specs than the camera I bought - so he convinced me to go for it since it would perform just fine for the work I was doing and because of the quality/price balance I was being offered. \n\nSo now 2 years after, I've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. So I've gotta say that my friend was right, the D3300 is way more than what meets the eye. I still have the kit lens and about a year ago I bought the 85mm f1.8 lens. My photography has improved a whole lot since (I do a bit of everything: street, architecture and portrait photography).\n\nSo now that I'm a bit more experienced, I've also gotten to notice the faults the camera also possesses, for example:\n• While recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• Autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• LCD screen is fixed, also limiting the flexibility that some of the shots should have.\n\nSo now that I'm not necessarily an amateur, I've really started to think about upgrading. I don't know if I should sell all my gear to switch brands, or if I should stick with Nikon to keep the 85mm lens. The Nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one I currently have for the 85. I've checked Canon and Fujifilm cameras but I've really grown a soft spot for Nikon because of my buddy, the D3300.\n\nBottom line: I don't know what I should do next. The amount of cameras and specs still overwhelms me, so I need guidance, also, I live in a third world country (Mexico), so saving money to buy/switch gear can be a bit of a challenge. So I need something that is budget friendly.\n\nAnyway, that's about it. I'd really appreciate some feedback since I feel kinda stuck!", "link": "https://www.reddit.com/r/Cameras/comments/jwm119/should_i_upgrade/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "should i upgrade? /!/ so i was introduced to the world of photography about 2 years ago. i had a friend in college that happened to have a red nikon d3300 available, and that she offered to sell at a relatively cheap price. i had zero knowledge about cameras, lenses, brands, etc. so i agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now i know he had a canon with even lower specs than the camera i bought - so he convinced me to go for it since it would perform just fine for the work i was doing and because of the quality/price balance i was being offered. \n\nso now 2 years after, i've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. so i've gotta say that my friend was right, the d3300 is way more than what meets the eye. i still have the kit lens and about a year ago i bought the 85mm f1.8 lens. my photography has improved a whole lot since (i do a bit of everything: street, architecture and portrait photography).\n\nso now that i'm a bit more experienced, i've also gotten to notice the faults the camera also possesses, for example:\n• while recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• lcd screen is fixed, also limiting the flexibility that some of the shots should have.\n\nso now that i'm not necessarily an amateur, i've really started to think about upgrading. i don't know if i should sell all my gear to switch brands, or if i should stick with nikon to keep the 85mm lens. the nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one i currently have for the 85. i've checked canon and fujifilm cameras but i've really grown a soft -----> spot !!!  for nikon because of my buddy, the d3300.\n\nbottom line: i don't know what i should do next. the amount of cameras and specs still overwhelms me, so i need guidance, also, i live in a third world country (mexico), so saving money to buy/switch gear can be a bit of a challenge. so i need something that is budget friendly.\n\nanyway, that's about it. i'd really appreciate some feedback since i feel kinda stuck!", "sortedWord": "None", "identifyer": 3764, "year": "2020"}, {"Unnamed: 0": 210382, "autor": "baronapple", "date": 1596258602000, "content": "Black spot changes after using blower, what's the issue?", "link": "https://www.reddit.com/r/Cameras/comments/i1mshk/black_spot_changes_after_using_blower_whats_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "black -----> spot !!!  changes after using blower, what's the issue?", "sortedWord": "None", "identifyer": 4168, "year": "2020"}, {"Unnamed: 0": 210478, "autor": "G7TAO", "date": 1591552611000, "content": "Tripod fitting questions /!/ Hello,\n\nI've got a cheap tripod, bought in a junk sale, and doesn't have any attachment on top. Other than the plastic 23mm diameter 'mushroom' piece shown in my picture.  I think it was once a camera tripod, where the pan/tilt head is missing. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/8lacz95xyi351.jpg?width=387&amp;format=pjpg&amp;auto=webp&amp;s=0a8d0fdb25459393672ec8ebda9cc3ce5bc39829\n\nCan anyone help me with where I could get something to fit over the 'mushroom' piece? or what that fitting is properly known as? \n\n&amp;#x200B;\n\nFWIW, I don't want to use this tripod for anything camera related, but want to use it to support a home brew ham radio aerial. I was considering trying to find some PVC pipe to slide over and from there fix my aerial to it but couldn't spot PVC pipe around 23mm ID.\n\n&amp;#x200B;\n\nAnyway a long shot perhaps, but I thought id ask you before I drill/butcher the plastic piece.\n\n&amp;#x200B;\n\nThanks,", "link": "https://www.reddit.com/r/Cameras/comments/gygzd1/tripod_fitting_questions/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tripod fitting questions /!/ hello,\n\ni've got a cheap tripod, bought in a junk sale, and doesn't have any attachment on top. other than the plastic 23mm diameter 'mushroom' piece shown in my picture.  i think it was once a camera tripod, where the pan/tilt head is missing. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/8lacz95xyi351.jpg?width=387&amp;format=pjpg&amp;auto=webp&amp;s=0a8d0fdb25459393672ec8ebda9cc3ce5bc39829\n\ncan anyone help me with where i could get something to fit over the 'mushroom' piece? or what that fitting is properly known as? \n\n&amp;#x200b;\n\nfwiw, i don't want to use this tripod for anything camera related, but want to use it to support a home brew ham radio aerial. i was considering trying to find some pvc pipe to slide over and from there fix my aerial to it but couldn't -----> spot !!!  pvc pipe around 23mm id.\n\n&amp;#x200b;\n\nanyway a long shot perhaps, but i thought id ask you before i drill/butcher the plastic piece.\n\n&amp;#x200b;\n\nthanks,", "sortedWord": "None", "identifyer": 4270, "year": "2020"}, {"Unnamed: 0": 210521, "autor": "Kaddaman701", "date": 1593080332000, "content": "Why can't I see the Milky Way? /!/ Hello guys!\n\nSince a few weeks, I want to get nice shots of the Milky Way, but it doesn't work somehow and I don't know why. \n\nI've done some planning, choosing a good spot in my area, no clouds, no moon, locate some nebula with Photopills, Star Walk 2, took around 400 photos, dark frames, flat frames, bias frames and stacked them with DeepSkyStacker. I also watched some videos of how to edit the photos in Photoshop to make a nebula more visible, but neither of that showed something.\n\nThe only problem I could imagine: There is still too much light where I took the photos. I used [https://lightpollutionmap.info](https://lightpollutionmap.info) to choose my spot, but if I don't want to drive hundreds of kilometers, the best light pollution level is yellow to greenish according to the legend. Is this still too bright?", "link": "https://www.reddit.com/r/Cameras/comments/hfjofh/why_cant_i_see_the_milky_way/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why can't i see the milky way? /!/ hello guys!\n\nsince a few weeks, i want to get nice shots of the milky way, but it doesn't work somehow and i don't know why. \n\ni've done some planning, choosing a good -----> spot !!!  in my area, no clouds, no moon, locate some nebula with photopills, star walk 2, took around 400 photos, dark frames, flat frames, bias frames and stacked them with deepskystacker. i also watched some videos of how to edit the photos in photoshop to make a nebula more visible, but neither of that showed something.\n\nthe only problem i could imagine: there is still too much light where i took the photos. i used [https://lightpollutionmap.info](https://lightpollutionmap.info) to choose my spot, but if i don't want to drive hundreds of kilometers, the best light pollution level is yellow to greenish according to the legend. is this still too bright?", "sortedWord": "None", "identifyer": 4315, "year": "2020"}, {"Unnamed: 0": 210537, "autor": "Bishop_99", "date": 1593009077000, "content": "I need suggestions for a camera to shoot product images. /!/ Hi. I'm in a spot where now I need an actual camera for work and I need some suggestions because I don't know where to start and which camera may be best for me. I honestly need to learn this aspect and all the camera features can be a lot to take in at first.\n\nPrimarily, I have come across some work where I need to take pictures of highly reflective coins or pins. I have a Sony Point and shoot, an LG G8 and an iPhone 11. Along with setting up the lighting as best as I can, the image really isn't great, and with no real optical zoom, it makes this a very hard job to say the least.\n\nI have to do a tremendous amount of editing in Photoshop to make these images seem professional, but I need to cut so much Photoshop workflow.\n\nI just need a few suggestion of a couple of cameras that may work best for my situation and give the best results. Optical zoom is very important as I need to fight against my own reflection. I'm open to price, suggestions between $600 and $2000 are welcomed. If it's complicated to do all the in camera settings, at least I can learn that aspect before I possibly get another job of this nature.\n\nThank you and I would appreciate any feedback.", "link": "https://www.reddit.com/r/Cameras/comments/hf20on/i_need_suggestions_for_a_camera_to_shoot_product/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i need suggestions for a camera to shoot product images. /!/ hi. i'm in a -----> spot !!!  where now i need an actual camera for work and i need some suggestions because i don't know where to start and which camera may be best for me. i honestly need to learn this aspect and all the camera features can be a lot to take in at first.\n\nprimarily, i have come across some work where i need to take pictures of highly reflective coins or pins. i have a sony point and shoot, an lg g8 and an iphone 11. along with setting up the lighting as best as i can, the image really isn't great, and with no real optical zoom, it makes this a very hard job to say the least.\n\ni have to do a tremendous amount of editing in photoshop to make these images seem professional, but i need to cut so much photoshop workflow.\n\ni just need a few suggestion of a couple of cameras that may work best for my situation and give the best results. optical zoom is very important as i need to fight against my own reflection. i'm open to price, suggestions between $600 and $2000 are welcomed. if it's complicated to do all the in camera settings, at least i can learn that aspect before i possibly get another job of this nature.\n\nthank you and i would appreciate any feedback.", "sortedWord": "None", "identifyer": 4333, "year": "2020"}, {"Unnamed: 0": 210748, "autor": "pergeedix", "date": 1581301789000, "content": "10 Best Valentine’s Day Photo Ideas You Need to Know /!/ What is the most significant and romantic day of the year for lovers? 14th, February, it is Valentines’ Day. it is a perfect day for you and your love and it is also great for confessing love to your beloved one. On this special day, you need to make a difference in your love life. It is believed that taking photos is a good choice to deepen your relationship and show how much you love each other. So here are 10 [photo](https://www.pergear.com/blogs/news/6-tips-ideas-for-diy-christmas-holiday-family-photos-2019) ideas that inspire you at the valentine’s day.\n\n**Know Each Other Very Well**\n\n&amp;#x200B;\n\n The cutest and the most beautiful couples’ [pictures](https://www.pergear.com/blogs/news/wildlife-photography-10-stunning-animal-images-of-2019) will warm your heart and bring you unforgettable memories. So, you need to get to know your lovers better before taking photos. Some great photos will be taken.\n\n1. Need to know your life stories;\n2. Need to know how you feel in front of the [camera](https://www.pergear.com/collections/lens);\n3. Need to know what makes you comfortable and nice.\n\n…\n\nIf you have no idea, it is suggested that you can make a questionnaire.\n\n1. **Recreate the First Date**\n\n&amp;#x200B;\n\nRe-create the initial moment of falling in love with each other is a fun and touching idea. The spot you met each other for the first time is in particular. Go back to the location where you had the first date. You can wear the first date outfit and put some beautiful flowers. So, the romantic environment.\n\n1. **Kissing in the Sunset**\n\n&amp;#x200B;\n\nIt is proved that kissing is good for your health and can move the world. On valentine’s day, kissing also expresses your love for your soulmate. But you can make a big difference. You can find a good location like a beach and when the sun will set, you can kiss your lovers in the sunset. So fantastic.\n\n1. **Sleeping Pictures**\n\n&amp;#x200B;\n\n In my view, sleeping pictures are pretty and so interesting. If you are sleeping in your bed with your soulmate in the morning, it will even great. You can pretend to have a rest and you are lying in bed while the boy is gently hugging the girl. So sweet.\n\n1. **Show your Children**\n\n&amp;#x200B;\n\nHaving a child will make your home and your love life fun and interesting.\n\nA little kid is a big piece of your heart. On valentine’s day, it is a good time to show them how loved they are and you also confess your love to your baby. Kissing your baby in front of the camera will be great.\n\n1. **Do Things that They Both Love**\n\n&amp;#x200B;\n\n When you ask couples’ mutual hobbies, they will respond to you quickly. It indicates that they know each other very well. So, need to figure out the themed-idea about the special day. \n\nFor example, you enjoy the sport, and you can shoot pictures of running, playing badminton and something else. Make sure all things are related to valentine’s day \n\n1. **Hand-Holding**\n\n&amp;#x200B;\n\nIf you love your wife or husband, you may know how great it feels to walk with your soulmate holding your hands. In reality, hand-holding says a lot about the couple’s relationship. So, you can take some pictures of hand-holding. here are different types you can try:\n\n1. Down-Facing Palms;\n2. Interlocked Fingers;\n3. The one-finger hold;\n4. Linked Arms\n\nThese types of hand-holding mean your strong connection and passion.\n\n1. **Dance**\n\n&amp;#x200B;\n\nIf you have no idea how to pose perfectly when taking photos. You can try to dance. It is easy and joyful. You can choose one of the songs you both love the most. You don’t need to know some difficult dance moves and you only do some easy dance steps, such as swing or waltz. You have lots of chances to capture the beautiful moment. You can use a long exposure to photograph people’s body movements.\n\n1. **Use Some Tiny and Lovely Things**\n\n&amp;#x200B;\n\nSmall things, for lovers, tend to reveal how much they love each other and it also enriches and stimulates your romantic loving relationship. So, the tiny things (such as rings, tattoos) need to be included when shooting some pretty [portraits](https://www.pergear.com/blogs/news/wedding-photography-lighting-tips-how-to-take-unique-wedding-portraits). Your friends or your family members will happy when seeing these photos.\n\n1. **A hug from the Behind**\n\n&amp;#x200B;\n\n Different types of hugs mean different messages between people, but the hugging from behind is the most exciting type where guys can hug you from behind and put his arms around you. It shows that they want to cover your body and protect you from any injuries. You will feel secure and wanted. people get this back hug while looking in the same direction, showing a sense of togetherness. \n\n1. **Capture Surprise Moment**\n\n&amp;#x200B;\n\nNo matter what kinds of woman you are dating, planning a little surprise for your love. A surprise not only shows how much affection you show but also your romantic side. On Valentines’ day, you can give some cute things to your girlfriend, such as flowers, a box of chocolates, some teddy bears. Girls will feel amazed when getting these good [presents](https://www.pergear.com/collections/gimbals). It is good to capture the moment.\n\nValentine's day is a romantic holiday to celebrate love, friendship, and affection. I hope that these ideas can inspire you and have creative pictures with your lovers.", "link": "https://www.reddit.com/r/Cameras/comments/f1jkot/10_best_valentines_day_photo_ideas_you_need_to/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "10 best valentine’s day photo ideas you need to know /!/ what is the most significant and romantic day of the year for lovers? 14th, february, it is valentines’ day. it is a perfect day for you and your love and it is also great for confessing love to your beloved one. on this special day, you need to make a difference in your love life. it is believed that taking photos is a good choice to deepen your relationship and show how much you love each other. so here are 10 [photo](https://www.pergear.com/blogs/news/6-tips-ideas-for-diy-christmas-holiday-family-photos-2019) ideas that inspire you at the valentine’s day.\n\n**know each other very well**\n\n&amp;#x200b;\n\n the cutest and the most beautiful couples’ [pictures](https://www.pergear.com/blogs/news/wildlife-photography-10-stunning-animal-images-of-2019) will warm your heart and bring you unforgettable memories. so, you need to get to know your lovers better before taking photos. some great photos will be taken.\n\n1. need to know your life stories;\n2. need to know how you feel in front of the [camera](https://www.pergear.com/collections/lens);\n3. need to know what makes you comfortable and nice.\n\n…\n\nif you have no idea, it is suggested that you can make a questionnaire.\n\n1. **recreate the first date**\n\n&amp;#x200b;\n\nre-create the initial moment of falling in love with each other is a fun and touching idea. the -----> spot !!!  you met each other for the first time is in particular. go back to the location where you had the first date. you can wear the first date outfit and put some beautiful flowers. so, the romantic environment.\n\n1. **kissing in the sunset**\n\n&amp;#x200b;\n\nit is proved that kissing is good for your health and can move the world. on valentine’s day, kissing also expresses your love for your soulmate. but you can make a big difference. you can find a good location like a beach and when the sun will set, you can kiss your lovers in the sunset. so fantastic.\n\n1. **sleeping pictures**\n\n&amp;#x200b;\n\n in my view, sleeping pictures are pretty and so interesting. if you are sleeping in your bed with your soulmate in the morning, it will even great. you can pretend to have a rest and you are lying in bed while the boy is gently hugging the girl. so sweet.\n\n1. **show your children**\n\n&amp;#x200b;\n\nhaving a child will make your home and your love life fun and interesting.\n\na little kid is a big piece of your heart. on valentine’s day, it is a good time to show them how loved they are and you also confess your love to your baby. kissing your baby in front of the camera will be great.\n\n1. **do things that they both love**\n\n&amp;#x200b;\n\n when you ask couples’ mutual hobbies, they will respond to you quickly. it indicates that they know each other very well. so, need to figure out the themed-idea about the special day. \n\nfor example, you enjoy the sport, and you can shoot pictures of running, playing badminton and something else. make sure all things are related to valentine’s day \n\n1. **hand-holding**\n\n&amp;#x200b;\n\nif you love your wife or husband, you may know how great it feels to walk with your soulmate holding your hands. in reality, hand-holding says a lot about the couple’s relationship. so, you can take some pictures of hand-holding. here are different types you can try:\n\n1. down-facing palms;\n2. interlocked fingers;\n3. the one-finger hold;\n4. linked arms\n\nthese types of hand-holding mean your strong connection and passion.\n\n1. **dance**\n\n&amp;#x200b;\n\nif you have no idea how to pose perfectly when taking photos. you can try to dance. it is easy and joyful. you can choose one of the songs you both love the most. you don’t need to know some difficult dance moves and you only do some easy dance steps, such as swing or waltz. you have lots of chances to capture the beautiful moment. you can use a long exposure to photograph people’s body movements.\n\n1. **use some tiny and lovely things**\n\n&amp;#x200b;\n\nsmall things, for lovers, tend to reveal how much they love each other and it also enriches and stimulates your romantic loving relationship. so, the tiny things (such as rings, tattoos) need to be included when shooting some pretty [portraits](https://www.pergear.com/blogs/news/wedding-photography-lighting-tips-how-to-take-unique-wedding-portraits). your friends or your family members will happy when seeing these photos.\n\n1. **a hug from the behind**\n\n&amp;#x200b;\n\n different types of hugs mean different messages between people, but the hugging from behind is the most exciting type where guys can hug you from behind and put his arms around you. it shows that they want to cover your body and protect you from any injuries. you will feel secure and wanted. people get this back hug while looking in the same direction, showing a sense of togetherness. \n\n1. **capture surprise moment**\n\n&amp;#x200b;\n\nno matter what kinds of woman you are dating, planning a little surprise for your love. a surprise not only shows how much affection you show but also your romantic side. on valentines’ day, you can give some cute things to your girlfriend, such as flowers, a box of chocolates, some teddy bears. girls will feel amazed when getting these good [presents](https://www.pergear.com/collections/gimbals). it is good to capture the moment.\n\nvalentine's day is a romantic holiday to celebrate love, friendship, and affection. i hope that these ideas can inspire you and have creative pictures with your lovers.", "sortedWord": "None", "identifyer": 4555, "year": "2020"}, {"Unnamed: 0": 211065, "autor": "iperblaster", "date": 1577989658000, "content": "Used Sony RX100. Is there any model to avoid? /!/ I need to purchase a compact camera, and I am impressed by the good reviews the RX100 gets every year. Seems to me there is no enormous differences in every iteration of the camera, and on eBay it's very difficult to spot which generation is for sale.\nAny tips? Or I will just buy the cheapest..\n\nhttps://www.dpreview.com/reviews/sony-cybershot-dsc-rx100", "link": "https://www.reddit.com/r/Cameras/comments/ej2004/used_sony_rx100_is_there_any_model_to_avoid/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "used sony rx100. is there any model to avoid? /!/ i need to purchase a compact camera, and i am impressed by the good reviews the rx100 gets every year. seems to me there is no enormous differences in every iteration of the camera, and on ebay it's very difficult to -----> spot !!!  which generation is for sale.\nany tips? or i will just buy the cheapest..\n\nhttps://www.dpreview.com/reviews/sony-cybershot-dsc-rx100", "sortedWord": "None", "identifyer": 4886, "year": "2020"}, {"Unnamed: 0": 211207, "autor": "aangsparents", "date": 1583218594000, "content": "Does anyone know what those black spots are? Could it be fungus?", "link": "https://www.reddit.com/r/Cameras/comments/fcqts8/does_anyone_know_what_those_black_spots_are_could/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does anyone know what those black -----> spots !!!  are? could it be fungus?", "sortedWord": "None", "identifyer": 5034, "year": "2020"}, {"Unnamed: 0": 211386, "autor": "Braiden_patrick", "date": 1585860850000, "content": "Sensor Saliva Spot /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/ftuchy/sensor_saliva_spot/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sensor saliva -----> spot !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 5234, "year": "2020"}, {"Unnamed: 0": 211625, "autor": "photoexperts", "date": 1584943416000, "content": "Tabletop Tripod with Mount Adapter Portable Compact Tripod Folded Tripod for Spotting Scopes DLSR Camera Monocular Binocular Medium-Sized Telescopes", "link": "https://www.reddit.com/r/Cameras/comments/fnf13e/tabletop_tripod_with_mount_adapter_portable/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "tabletop tripod with mount adapter portable compact tripod folded tripod for -----> spotting !!!  scopes dlsr camera monocular binocular medium-sized telescopes", "sortedWord": "None", "identifyer": 5525, "year": "2020"}, {"Unnamed: 0": 211677, "autor": "FolkPhilosopher", "date": 1584714826000, "content": "One last time, help me choose a Fuji digital camera /!/ A month ago I posted the below on this community as I was looking for a film and a digital camera:\n\n [https://www.reddit.com/r/Cameras/comments/f5ck8k/recommendations\\_one\\_film\\_camera\\_and\\_one\\_digital/](https://www.reddit.com/r/Cameras/comments/f5ck8k/recommendations_one_film_camera_and_one_digital/) \n\nI've now hit the spot for the film camera but feel that the need for a digital is now even more important as COVID19 has now seriously depleted options to get film developed (ie. my favourite lab is closed until further notice). Plus, it would be good to have something to use even round the house which I can just use to document self-isolation and coming lock-down.\n\nI am pretty set on a Fuji system and the recommendations that came out of the thread were the X-Pro2 and the X100T. They are still both great options which feature high on my list but when researching more the Fuji ecosystem, I thought to expand my horizon a little.\n\nI will begin by saying that being a film guy, I'm necessarily going to take a slower approach to shooting as that is just how I shoot. That is to say that I don't need the fastest autofocus in the world but I do care about easy manual controls, a good VF and a great lens.\n\nFor that reason, I've been exploring the possibility of an XE2s a it's the smaller sibling of the XPro2 or even an original XPro1 as at the current going rate, I could pick a body and the 35mm f/2 lens for the price of an XPro2 body only or an X100T. One big reason why the XPro and the XE2s are in contention is that they are not fixed lens cameras.\n\nSo, after all that, is an XE2s worth it over an XPro2 for someone on a tight budget and is the XPro1 still a good camera (again, remember I don't care for fast autofocus) in 2020 as a used proposition?", "link": "https://www.reddit.com/r/Cameras/comments/flvzpl/one_last_time_help_me_choose_a_fuji_digital_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "one last time, help me choose a fuji digital camera /!/ a month ago i posted the below on this community as i was looking for a film and a digital camera:\n\n [https://www.reddit.com/r/cameras/comments/f5ck8k/recommendations\\_one\\_film\\_camera\\_and\\_one\\_digital/](https://www.reddit.com/r/cameras/comments/f5ck8k/recommendations_one_film_camera_and_one_digital/) \n\ni've now hit the -----> spot !!!  for the film camera but feel that the need for a digital is now even more important as covid19 has now seriously depleted options to get film developed (ie. my favourite lab is closed until further notice). plus, it would be good to have something to use even round the house which i can just use to document self-isolation and coming lock-down.\n\ni am pretty set on a fuji system and the recommendations that came out of the thread were the x-pro2 and the x100t. they are still both great options which feature high on my list but when researching more the fuji ecosystem, i thought to expand my horizon a little.\n\ni will begin by saying that being a film guy, i'm necessarily going to take a slower approach to shooting as that is just how i shoot. that is to say that i don't need the fastest autofocus in the world but i do care about easy manual controls, a good vf and a great lens.\n\nfor that reason, i've been exploring the possibility of an xe2s a it's the smaller sibling of the xpro2 or even an original xpro1 as at the current going rate, i could pick a body and the 35mm f/2 lens for the price of an xpro2 body only or an x100t. one big reason why the xpro and the xe2s are in contention is that they are not fixed lens cameras.\n\nso, after all that, is an xe2s worth it over an xpro2 for someone on a tight budget and is the xpro1 still a good camera (again, remember i don't care for fast autofocus) in 2020 as a used proposition?", "sortedWord": "None", "identifyer": 5587, "year": "2020"}, {"Unnamed: 0": 211680, "autor": "Polcio", "date": 1584710232000, "content": "Sensor cleaning: did something go wrong? /!/ Hi all,\n\nI just purchased a full frame sensor cleaning kit. My D700 sensor was pretty dusty and needed some cleaning. I tried blowing some air on it using a rocket blower, but I think I just made it worse, pushing even more dust onto the sensor.\n\nThis is a shot taken before cleaning (clarity and dehaze set to maximum to highlight the specks):\n\n https://imgur.com/kk9mNpO \n\nThis is a shot taken after cleaning:\n\n https://imgur.com/uIPeJHI \n\nIt's my first time cleaning a sensor. I've used three swabs with 2/3 drops of cleaning liquid each time and followed all the instructions.\n\nNevertheless, some specks still remain and streaks have formed. Should I move vertically across the sensor this time? Should I give it another go?\n\nI should clarify that I bought my D700 used in great condition from a reputable store, I've been using it for more than a year now and after seeing that some spots and specks have always been there, I'm starting to think that maybe the sensor was dirty or scratched from the start...\n\nThanks in advance.", "link": "https://www.reddit.com/r/Cameras/comments/fluuve/sensor_cleaning_did_something_go_wrong/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sensor cleaning: did something go wrong? /!/ hi all,\n\ni just purchased a full frame sensor cleaning kit. my d700 sensor was pretty dusty and needed some cleaning. i tried blowing some air on it using a rocket blower, but i think i just made it worse, pushing even more dust onto the sensor.\n\nthis is a shot taken before cleaning (clarity and dehaze set to maximum to highlight the specks):\n\n https://imgur.com/kk9mnpo \n\nthis is a shot taken after cleaning:\n\n https://imgur.com/uipejhi \n\nit's my first time cleaning a sensor. i've used three swabs with 2/3 drops of cleaning liquid each time and followed all the instructions.\n\nnevertheless, some specks still remain and streaks have formed. should i move vertically across the sensor this time? should i give it another go?\n\ni should clarify that i bought my d700 used in great condition from a reputable store, i've been using it for more than a year now and after seeing that some -----> spots !!!  and specks have always been there, i'm starting to think that maybe the sensor was dirty or scratched from the start...\n\nthanks in advance.", "sortedWord": "None", "identifyer": 5590, "year": "2020"}, {"Unnamed: 0": 212367, "autor": "Snoo33369", "date": 1601897357000, "content": "I just bought a Used A7. The sensor has spots? Air doesn’t remove them. Return or keep?", "link": "https://www.reddit.com/r/Cameras/comments/j5hpcw/i_just_bought_a_used_a7_the_sensor_has_spots_air/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i just bought a used a7. the sensor has -----> spots !!! ? air doesn’t remove them. return or keep?", "sortedWord": "None", "identifyer": 6390, "year": "2020"}, {"Unnamed: 0": 212394, "autor": "bigmidichlorian", "date": 1598647813000, "content": "Hybrid Camera Recommendation for Rock Band? /!/ TL;DR: Just read the title\n\nI'm looking for the most versatile camera I can get for my band. I understand no camera is perfect, but I am willing to compromise to keep it all in one camera. We would use it for... music videos, instrument play throughs, behind the scenes footage, interviews, live performances, and concerts.\n\nBeing a rock band, lots of these shoots will involve crowds of people, fast movements, and low lighting.\n\nI've put my needs into 2 tiers of importance...  \n\n\nTier 1:  \n4k (with as many fps as I can get) and 1080 (with as many fps as I can get).\n\nGood low light performance (whether thats full frame or aps-c with a fast lens.)\n\nDecent Video autofocus.\n\nPhotos that can be acceptable enough for an instagram feed or website, but photos are not nearly as important as video.\n\n  \nTier 2:  \nA flippy screen would be nice\n\nOk battery life would be nice\n\nEase of use is important but I'm sure with practice that could apply to any camera (hence it's spot in tier 2)\n\nPortability\n\n&amp;#x200B;\n\nPossibly the most important things for me is to get something I can stick with. I want to have it, know it's limitations, and get good with it. I'm definitely not looking to upgrade regularly or ever. That being said, I'm in the consumer budget range, and I have listed my current favorites below.\n\n&amp;#x200B;\n\nCurrent Favorites:\n\nFuji XT-4 (covers ALL of my needs but I keep hearing that the autofocus is completely unusable? Is this true?)\n\nNikon Z6 (covers MOST of my needs, some of them even better than the XT4 cause it's full frame, but it's not quite perfect.)\n\n&amp;#x200B;\n\nTier 2:\n\na7iii (basically the same as Z6 BUT more expensive)\n\n&amp;#x200B;\n\nHave considered:\n\nPanasonic GH5s\n\n&amp;#x200B;\n\nDISCLAIMER:  \nI understand that the A7Siii is the perfect camera that would cover all my needs perfectly and make everything easier but it's too expensive.\n\n&amp;#x200B;\n\nThanks for the help!", "link": "https://www.reddit.com/r/Cameras/comments/iif943/hybrid_camera_recommendation_for_rock_band/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hybrid camera recommendation for rock band? /!/ tl;dr: just read the title\n\ni'm looking for the most versatile camera i can get for my band. i understand no camera is perfect, but i am willing to compromise to keep it all in one camera. we would use it for... music videos, instrument play throughs, behind the scenes footage, interviews, live performances, and concerts.\n\nbeing a rock band, lots of these shoots will involve crowds of people, fast movements, and low lighting.\n\ni've put my needs into 2 tiers of importance...  \n\n\ntier 1:  \n4k (with as many fps as i can get) and 1080 (with as many fps as i can get).\n\ngood low light performance (whether thats full frame or aps-c with a fast lens.)\n\ndecent video autofocus.\n\nphotos that can be acceptable enough for an instagram feed or website, but photos are not nearly as important as video.\n\n  \ntier 2:  \na flippy screen would be nice\n\nok battery life would be nice\n\nease of use is important but i'm sure with practice that could apply to any camera (hence it's -----> spot !!!  in tier 2)\n\nportability\n\n&amp;#x200b;\n\npossibly the most important things for me is to get something i can stick with. i want to have it, know it's limitations, and get good with it. i'm definitely not looking to upgrade regularly or ever. that being said, i'm in the consumer budget range, and i have listed my current favorites below.\n\n&amp;#x200b;\n\ncurrent favorites:\n\nfuji xt-4 (covers all of my needs but i keep hearing that the autofocus is completely unusable? is this true?)\n\nnikon z6 (covers most of my needs, some of them even better than the xt4 cause it's full frame, but it's not quite perfect.)\n\n&amp;#x200b;\n\ntier 2:\n\na7iii (basically the same as z6 but more expensive)\n\n&amp;#x200b;\n\nhave considered:\n\npanasonic gh5s\n\n&amp;#x200b;\n\ndisclaimer:  \ni understand that the a7siii is the perfect camera that would cover all my needs perfectly and make everything easier but it's too expensive.\n\n&amp;#x200b;\n\nthanks for the help!", "sortedWord": "None", "identifyer": 6422, "year": "2020"}, {"Unnamed: 0": 212453, "autor": "mac4321", "date": 1598414516000, "content": "Interested in Plane-spotting - What should I start with? /!/ I have never owned a camera before and want to get into Plane-spotting. What kind of setup should I be looking for?", "link": "https://www.reddit.com/r/Cameras/comments/igrwvg/interested_in_planespotting_what_should_i_start/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "interested in plane------> spotting !!!  - what should i start with? /!/ i have never owned a camera before and want to get into plane-spotting. what kind of setup should i be looking for?", "sortedWord": "None", "identifyer": 6496, "year": "2020"}, {"Unnamed: 0": 212561, "autor": "carnageasada91", "date": 1597216861000, "content": "What’s in my viewfinder? Had this camera for 10 days, went to shoot today and noticed these two spots have appeared in the viewfinder.", "link": "https://www.reddit.com/r/Cameras/comments/i89bu5/whats_in_my_viewfinder_had_this_camera_for_10/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what’s in my viewfinder? had this camera for 10 days, went to shoot today and noticed these two -----> spots !!!  have appeared in the viewfinder.", "sortedWord": "None", "identifyer": 6618, "year": "2020"}, {"Unnamed: 0": 212584, "autor": "MarshmallowBro62", "date": 1597124594000, "content": "My ex-fh25 isn’t working, the only thing it does is backlight the screen when plugged in and when all the batteries are in their spots it makes a tiny coil whine. Any thoughts? I’d love to get this back working because it’s in such good condition.", "link": "https://www.reddit.com/r/Cameras/comments/i7m40w/my_exfh25_isnt_working_the_only_thing_it_does_is/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my ex-fh25 isn’t working, the only thing it does is backlight the screen when plugged in and when all the batteries are in their -----> spots !!!  it makes a tiny coil whine. any thoughts? i’d love to get this back working because it’s in such good condition.", "sortedWord": "None", "identifyer": 6648, "year": "2020"}, {"Unnamed: 0": 212806, "autor": "kieran75_", "date": 1603106716000, "content": "Olympus or Sony /!/ Just a general question, which company overall makes the better cameras, Olympus or Sony?  Not putting any specific models under the spot light just in general", "link": "https://www.reddit.com/r/Cameras/comments/jdzukm/olympus_or_sony/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "olympus or sony /!/ just a general question, which company overall makes the better cameras, olympus or sony?  not putting any specific models under the -----> spot !!!  light just in general", "sortedWord": "None", "identifyer": 6899, "year": "2020"}, {"Unnamed: 0": 212897, "autor": "caspertheghost", "date": 1603735517000, "content": "DJI Mavic Mini 2- Renamed to 'Mini 2', specs leaked, spotted at Best Buy /!/ [https://dronedj.com/2020/10/26/dji-mavic-mini-2-unboxing-with-new-features-revealed](https://dronedj.com/2020/10/26/dji-mavic-mini-2-unboxing-with-new-features-revealed/)", "link": "https://www.reddit.com/r/Cameras/comments/jijn8x/dji_mavic_mini_2_renamed_to_mini_2_specs_leaked/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "dji mavic mini 2- renamed to 'mini 2', specs leaked, -----> spotted !!!  at best buy /!/ [https://dronedj.com/2020/10/26/dji-mavic-mini-2-unboxing-with-new-features-revealed](https://dronedj.com/2020/10/26/dji-mavic-mini-2-unboxing-with-new-features-revealed/)", "sortedWord": "None", "identifyer": 6996, "year": "2020"}, {"Unnamed: 0": 212942, "autor": "AaronSteed", "date": 1604929370000, "content": "The Coffee Gallery Is The Perfect Spot If You Are Looking To Rent Filming Locations", "link": "https://www.reddit.com/r/Cameras/comments/jqxt3a/the_coffee_gallery_is_the_perfect_spot_if_you_are/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the coffee gallery is the perfect -----> spot !!!  if you are looking to rent filming locations", "sortedWord": "None", "identifyer": 7046, "year": "2020"}, {"Unnamed: 0": 213241, "autor": "rickybooksMtb", "date": 1607148125000, "content": "In need of lens for plane spotting /!/ I have a Sony alpha A 6000 (I think) and I am looking for a lens that’s would would be able to zoom in far. But, I have two problems number one is I don’t know ANYTHING about cameras. Number two is I don’t want to spend anymore that’s $200 on it. Any help would be awesome!", "link": "https://www.reddit.com/r/Cameras/comments/k72awj/in_need_of_lens_for_plane_spotting/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "in need of lens for plane -----> spotting !!!  /!/ i have a sony alpha a 6000 (i think) and i am looking for a lens that’s would would be able to zoom in far. but, i have two problems number one is i don’t know anything about cameras. number two is i don’t want to spend anymore that’s $200 on it. any help would be awesome!", "sortedWord": "None", "identifyer": 7360, "year": "2020"}, {"Unnamed: 0": 214194, "autor": "Second0pinion", "date": 1591967676000, "content": "Is it worth it to buy a super zoom camera? /!/ I have a GoPro I use for action Shots, and My IPhone I typically take portraits or selfies or landscapes with, but the zoom sucks on the phones.\n\nI was looking into getting one of the following for their “superzoom” capabilities:\n\nNikon P900\n(83x optical)\n\nPanasonic Lumix FZ300\n(24x zoom, I like this one least)\n\nNikon COOLPIX B600\n(60x optical)\n\nKodak PIXPRO Astro Zoom AZ652-BK \n(65X optical)\n\n\nbut I don’t like the fact that lenses can’t be changed like a DSLR would.\n\nIf something breaks, it would essentially be turned into an expensive paperweight, as the repair would surely be almost as my as a new camera.\n\nI just wondered if anyone had any recommendations from this list, or if you advise against a bridge camera all together?\n\nI wanted the Nikon P900 for the 83X optical zoom, but don’t want to spend $500 and then something happen and be stuck with an expensive paperweight.\n\nI’m leaning towards either the Nikon P900, or one of the cheaper models around $200 in case something happens.\n\nI will be using this primarily for the “superzoom” functionality, I don’t do professional photography or print pictures or anything, everything would be shared on a mobile device or laptop.\n\nI’ll be taking a trip to Yellowstone &amp; Grand Tetons and want to have something with a nice zoom feature so we could spot wildlife or take some cool mountain peek photos, or the stars at night.\n\nI almost went with a sighting scope and a cell phone adapter but figured that would be a disaster, and it ended up being $150+ anyway\n\nAny recommendations are appreciated!\n\nThank you.", "link": "https://www.reddit.com/r/Cameras/comments/h7kh4a/is_it_worth_it_to_buy_a_super_zoom_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is it worth it to buy a super zoom camera? /!/ i have a gopro i use for action shots, and my iphone i typically take portraits or selfies or landscapes with, but the zoom sucks on the phones.\n\ni was looking into getting one of the following for their “superzoom” capabilities:\n\nnikon p900\n(83x optical)\n\npanasonic lumix fz300\n(24x zoom, i like this one least)\n\nnikon coolpix b600\n(60x optical)\n\nkodak pixpro astro zoom az652-bk \n(65x optical)\n\n\nbut i don’t like the fact that lenses can’t be changed like a dslr would.\n\nif something breaks, it would essentially be turned into an expensive paperweight, as the repair would surely be almost as my as a new camera.\n\ni just wondered if anyone had any recommendations from this list, or if you advise against a bridge camera all together?\n\ni wanted the nikon p900 for the 83x optical zoom, but don’t want to spend $500 and then something happen and be stuck with an expensive paperweight.\n\ni’m leaning towards either the nikon p900, or one of the cheaper models around $200 in case something happens.\n\ni will be using this primarily for the “superzoom” functionality, i don’t do professional photography or print pictures or anything, everything would be shared on a mobile device or laptop.\n\ni’ll be taking a trip to yellowstone &amp; grand tetons and want to have something with a nice zoom feature so we could -----> spot !!!  wildlife or take some cool mountain peek photos, or the stars at night.\n\ni almost went with a sighting scope and a cell phone adapter but figured that would be a disaster, and it ended up being $150+ anyway\n\nany recommendations are appreciated!\n\nthank you.", "sortedWord": "None", "identifyer": 8380, "year": "2020"}, {"Unnamed: 0": 214997, "autor": "dontpokebearz", "date": 1598361377000, "content": "Is the Fuji hype real? G9 vs X-H1 /!/ Hi All, \n\nI'm in that terrible spot of camera buying decision making. Recently I purchased a used Panasonic GH-4 bundle for a mere $500. I like the camera, but want a newer camera. Also, I got it at a steal so I can make money buy selling. Regardless...\n\nMy research has led me to the G9 (Which I can buy used for $680 locally), and the H-H1 for roughly $750 USD. These are body only.\n\nMy wants/needs:\n\n* At least 20 MP - check \n* IBIS - check\n* Capable video cameras - check\n\nEverything else these camera's offer is just a nice to have in my opinion. I cannot find a review that compare these two cameras directly so this is why I'm asking your opinion. I'm not necessarily drawn to the X-H1 at the moment - It's bigger than I want and for my video needs requires the battery grip. Not a deal breaker, but an added expense and item to carry. YouTube reviewers would have me believe that being a Fuji shooter nominates me for a Nobel prize and that It will reinvigorate my creativity to inhuman levels. Of course I'm exaggerating, but Fuji is very hyped. \n\nIs Fuji the Fuji hype deserved? Is a X-H1 and ultimately the X ecosystem that much better than the competition?", "link": "https://www.reddit.com/r/Cameras/comments/igbzcy/is_the_fuji_hype_real_g9_vs_xh1/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is the fuji hype real? g9 vs x-h1 /!/ hi all, \n\ni'm in that terrible -----> spot !!!  of camera buying decision making. recently i purchased a used panasonic gh-4 bundle for a mere $500. i like the camera, but want a newer camera. also, i got it at a steal so i can make money buy selling. regardless...\n\nmy research has led me to the g9 (which i can buy used for $680 locally), and the h-h1 for roughly $750 usd. these are body only.\n\nmy wants/needs:\n\n* at least 20 mp - check \n* ibis - check\n* capable video cameras - check\n\neverything else these camera's offer is just a nice to have in my opinion. i cannot find a review that compare these two cameras directly so this is why i'm asking your opinion. i'm not necessarily drawn to the x-h1 at the moment - it's bigger than i want and for my video needs requires the battery grip. not a deal breaker, but an added expense and item to carry. youtube reviewers would have me believe that being a fuji shooter nominates me for a nobel prize and that it will reinvigorate my creativity to inhuman levels. of course i'm exaggerating, but fuji is very hyped. \n\nis fuji the fuji hype deserved? is a x-h1 and ultimately the x ecosystem that much better than the competition?", "sortedWord": "None", "identifyer": 9294, "year": "2020"}, {"Unnamed: 0": 215021, "autor": "iturnedintoanewt", "date": 1598272267000, "content": "Looking for a Gopro replacement! /!/ So...last weekend my GoPro Hero 3 took a dive and is currently sleeping under the sea... I guess it was time to replace it anyway. I'd like something on the cheap. My needs would be mostly basic, I think, but I don't know if there's something available with what I want:    \n    \n1080p@30fps/60fps. That's it, no need for 120fps, no need for 4k.\nPhysical buttons to choose mode and start/stop recording. I prefer it over touch screen. \nRemovable batteries, SD card slot (I've seen some with internal memory only? That would be a definitely not!). Compatible with gopro mount.\nFront display b/w would be nice to see what's the camera status, no need to see the images nor the video on the spot...No need for a color display if it makes it cheaper.    \n    \nWhat do you guys think? Any suggestions?", "link": "https://www.reddit.com/r/Cameras/comments/ifo1qp/looking_for_a_gopro_replacement/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for a gopro replacement! /!/ so...last weekend my gopro hero 3 took a dive and is currently sleeping under the sea... i guess it was time to replace it anyway. i'd like something on the cheap. my needs would be mostly basic, i think, but i don't know if there's something available with what i want:    \n    \n1080p@30fps/60fps. that's it, no need for 120fps, no need for 4k.\nphysical buttons to choose mode and start/stop recording. i prefer it over touch screen. \nremovable batteries, sd card slot (i've seen some with internal memory only? that would be a definitely not!). compatible with gopro mount.\nfront display b/w would be nice to see what's the camera status, no need to see the images nor the video on the -----> spot !!! ...no need for a color display if it makes it cheaper.    \n    \nwhat do you guys think? any suggestions?", "sortedWord": "None", "identifyer": 9320, "year": "2020"}, {"Unnamed: 0": 215171, "autor": "brokesnob", "date": 1596948387000, "content": "My favourite lens ever... Carl Zeiss Apo Sonnar T* 135mm f/2... the king of sharpness, contrast, bokeh, 3D pop... /!/ I have owned some amazing gear in my 10+ years of shooting. Some pieces that immediately spring to mind: Nikon 105mm f/1.4E ED, Nikon 135mm f/2DC, Nikon 58mm f/1.4G, and not least, the APO-Summicron 50mm (for M-mount) among my favourite 35mm lenses, and then some legendary medium format glass that was mounted on the Pentax 67II, Mamiya RZ67 Pro II, Hasselblad 503cw... \n\nZeiss glass had always been on my radar if for no reason other than their optics coming standard with many legendary kits (Hasselblad, Contax, Sony, etc.), but I never gave much thought to owning their Nikon-mount stuff. I wasn't really stoked about the idea of owning a big and heavy manual focus lens for my digital rig. But the guy I purchased my Nikon 105 1.4 from tipped me off, suggesting that the older Classic ZF2 line 135 2 Apo Sonnar by Zeiss was easily the best lens he'd ever used (and that's including the much more expensive Zeiss Otus 85 he owned)- of course such high praise lit a fire under my arse to go and find one. This actually proved to be a deceptively easy task... you can find much of the ZF2 line for sale at any time, but the 135 specifically proved to be quite difficult to track down- especially in good condition. Well, as luck would have it, not a week into my search, one popped up a few hours away from me. I negotiated the price down a bit and organized an exchange with the (now former) owner at a spot between our two cities- a couple hours out for me. Deal done, I was now the owner of this lens which was so highly regarded by the random Craigslist bloke I mentioned earlier. \n\nWhat immediately struck me on handling the lens was how incredibly solid it felt. This very well could be the best feeling product I have ever purchased- and the includes even the much, much more expensive Leica APO-Summicron 50... I saved firing off any shots with it until the next day when I had a shoot scheduled, but even just testing it out in the parking lot I was amazed at how much easier it was to focus with this thing than I had anticipated. \n\nAnyways, fast forward to the very next day, and I'm at my portrait shoot. I was eager to see how the image looked right after the first shot, and remember letting out a \"Holy shit!\" even after just reviewing it on the tiny screen. The model came over to see what I was fussing about, and even she remarked how incredibly detailed everything was, and how there seemed to be a \"3D pop\". I admittedly only used it for a few minutes at a time, because on my D850 with grip attached, it is an extremely heavy package, and arm fatigue is a very real thing while wielding this beast. Upon arriving back home and viewing the files on my 27\" monitor, I was surprised to see that I achieved perfect focus on about 90% of the images- pretty good for an mf lens, I thought. But what really blew my mind away in a way no other piece of gear has ever blown my mind away previously or since, was the unprecedented sharpness, the incredibly lush bokeh, the contrast/microcontrast, colour rendition, and the amazing 3D pop. I had been used to some pretty nice glass by this point, but this really blew everything else out of the water- I was genuinely not expecting to be *this* wowed by this lens. \n\nEach and every time I use this lens, I count my blessings... I am so lucky to be able to use such a superlative piece of equipment to help execute my visions. I'm also very fortunate to have gotten such a clean one at a very fair price (around $900 USD, maybe slightly less). All that said, I simply don't use it near enough, because A) despite doing lots of portrait stuff, 135mm is simply too tight for most stuff I shoot, and B) it's just too heavy a lens. That doesn't take away from the fact that I absolutely adore every frame I've ever shot on it, and see it as a special treat anytime I use it. \n\nAnyways, I apologize for the long-winding post, but I just wanted to share my enthusiasm for this truly incredible piece of equipment, which I cannot recommend highly enough. I'd love to someday own their Otus 100 1.4, but that is a tough one to justify. As fantastic as Nikon glass is, this Zeiss has made it difficult to \"settle\" after seeing/comparing files.", "link": "https://www.reddit.com/r/Cameras/comments/i6dle6/my_favourite_lens_ever_carl_zeiss_apo_sonnar_t/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my favourite lens ever... carl zeiss apo sonnar t* 135mm f/2... the king of sharpness, contrast, bokeh, 3d pop... /!/ i have owned some amazing gear in my 10+ years of shooting. some pieces that immediately spring to mind: nikon 105mm f/1.4e ed, nikon 135mm f/2dc, nikon 58mm f/1.4g, and not least, the apo-summicron 50mm (for m-mount) among my favourite 35mm lenses, and then some legendary medium format glass that was mounted on the pentax 67ii, mamiya rz67 pro ii, hasselblad 503cw... \n\nzeiss glass had always been on my radar if for no reason other than their optics coming standard with many legendary kits (hasselblad, contax, sony, etc.), but i never gave much thought to owning their nikon-mount stuff. i wasn't really stoked about the idea of owning a big and heavy manual focus lens for my digital rig. but the guy i purchased my nikon 105 1.4 from tipped me off, suggesting that the older classic zf2 line 135 2 apo sonnar by zeiss was easily the best lens he'd ever used (and that's including the much more expensive zeiss otus 85 he owned)- of course such high praise lit a fire under my arse to go and find one. this actually proved to be a deceptively easy task... you can find much of the zf2 line for sale at any time, but the 135 specifically proved to be quite difficult to track down- especially in good condition. well, as luck would have it, not a week into my search, one popped up a few hours away from me. i negotiated the price down a bit and organized an exchange with the (now former) owner at a -----> spot !!!  between our two cities- a couple hours out for me. deal done, i was now the owner of this lens which was so highly regarded by the random craigslist bloke i mentioned earlier. \n\nwhat immediately struck me on handling the lens was how incredibly solid it felt. this very well could be the best feeling product i have ever purchased- and the includes even the much, much more expensive leica apo-summicron 50... i saved firing off any shots with it until the next day when i had a shoot scheduled, but even just testing it out in the parking lot i was amazed at how much easier it was to focus with this thing than i had anticipated. \n\nanyways, fast forward to the very next day, and i'm at my portrait shoot. i was eager to see how the image looked right after the first shot, and remember letting out a \"holy shit!\" even after just reviewing it on the tiny screen. the model came over to see what i was fussing about, and even she remarked how incredibly detailed everything was, and how there seemed to be a \"3d pop\". i admittedly only used it for a few minutes at a time, because on my d850 with grip attached, it is an extremely heavy package, and arm fatigue is a very real thing while wielding this beast. upon arriving back home and viewing the files on my 27\" monitor, i was surprised to see that i achieved perfect focus on about 90% of the images- pretty good for an mf lens, i thought. but what really blew my mind away in a way no other piece of gear has ever blown my mind away previously or since, was the unprecedented sharpness, the incredibly lush bokeh, the contrast/microcontrast, colour rendition, and the amazing 3d pop. i had been used to some pretty nice glass by this point, but this really blew everything else out of the water- i was genuinely not expecting to be *this* wowed by this lens. \n\neach and every time i use this lens, i count my blessings... i am so lucky to be able to use such a superlative piece of equipment to help execute my visions. i'm also very fortunate to have gotten such a clean one at a very fair price (around $900 usd, maybe slightly less). all that said, i simply don't use it near enough, because a) despite doing lots of portrait stuff, 135mm is simply too tight for most stuff i shoot, and b) it's just too heavy a lens. that doesn't take away from the fact that i absolutely adore every frame i've ever shot on it, and see it as a special treat anytime i use it. \n\nanyways, i apologize for the long-winding post, but i just wanted to share my enthusiasm for this truly incredible piece of equipment, which i cannot recommend highly enough. i'd love to someday own their otus 100 1.4, but that is a tough one to justify. as fantastic as nikon glass is, this zeiss has made it difficult to \"settle\" after seeing/comparing files.", "sortedWord": "None", "identifyer": 9494, "year": "2020"}, {"Unnamed: 0": 215232, "autor": "Klauslee", "date": 1596763383000, "content": "How do I auto focus on my camera?(d7100) /!/ I have tried flipping every single switch on to Auto focus but nothing seems to work. I have the AF turned on in three spots AF/AF/A. It seems like it has the settings auto focused (ISO,aperature, shutter) but the actual lens focusing doesn't occur. Help appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/i54lny/how_do_i_auto_focus_on_my_camerad7100/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do i auto focus on my camera?(d7100) /!/ i have tried flipping every single switch on to auto focus but nothing seems to work. i have the af turned on in three -----> spots !!!  af/af/a. it seems like it has the settings auto focused (iso,aperature, shutter) but the actual lens focusing doesn't occur. help appreciated!", "sortedWord": "None", "identifyer": 9567, "year": "2020"}, {"Unnamed: 0": 215676, "autor": "JosiahB8675", "date": 1606769468000, "content": "Can't find serial number on Canon PowerShot ELPH 350 HS /!/ So I posted this on the Canon Support page but no one replied and I called Canon Support but then the bot told me to get the Serial Number and call back. [There is a spot on the bottom](https://support.usa.canon.com/kb/index?page=content&amp;id=ART162181) where it would say it but its just grey. I saw that it could be because it was from the grey market but I bought it from Walmart with a Black Friday deal. I also saw that if you take an image then look at EXIF info it would tell you but it doesn't say it for me. Is there any way for me to see the serial number like maybe its in the files or smn? I just need help.", "link": "https://www.reddit.com/r/Cameras/comments/k44xh6/cant_find_serial_number_on_canon_powershot_elph/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can't find serial number on canon powershot elph 350 hs /!/ so i posted this on the canon support page but no one replied and i called canon support but then the bot told me to get the serial number and call back. [there is a -----> spot !!!  on the bottom](https://support.usa.canon.com/kb/index?page=content&amp;id=art162181) where it would say it but its just grey. i saw that it could be because it was from the grey market but i bought it from walmart with a black friday deal. i also saw that if you take an image then look at exif info it would tell you but it doesn't say it for me. is there any way for me to see the serial number like maybe its in the files or smn? i just need help.", "sortedWord": "None", "identifyer": 10056, "year": "2020"}, {"Unnamed: 0": 215709, "autor": "coureybrooks", "date": 1607797512000, "content": "Cleaning fungus and haze from an old lens /!/ Has anyone tried to clean fungus or haze from a camera lens? I bought an Olympus 35 SP and there is a few small spots of fungus on the lens and haze that is noticeable in the photos I have taken. I know I can send the camera to be cleaned by professionals but I was wondering if anyone here has had success cleaning a lens themselves. If you have any tips, please let me know!", "link": "https://www.reddit.com/r/Cameras/comments/kbu052/cleaning_fungus_and_haze_from_an_old_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning fungus and haze from an old lens /!/ has anyone tried to clean fungus or haze from a camera lens? i bought an olympus 35 sp and there is a few small -----> spots !!!  of fungus on the lens and haze that is noticeable in the photos i have taken. i know i can send the camera to be cleaned by professionals but i was wondering if anyone here has had success cleaning a lens themselves. if you have any tips, please let me know!", "sortedWord": "None", "identifyer": 10090, "year": "2020"}, {"Unnamed: 0": 216130, "autor": "radillap", "date": 1590974564000, "content": "Sensor spots /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/gub9h9/sensor_spots/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sensor -----> spots !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 10534, "year": "2020"}, {"Unnamed: 0": 216345, "autor": "demirdelenbaris", "date": 1596745638000, "content": "Fujifilm X-T4 Movie Mode Metering and Framing Guidelines /!/ Hello, I recently bought an x-t4, I've been meddling with the camera but there are two things I wonder that I couldn't find the answers anywhere.\n\n1. Can I control the metering movie mode? Like changing its mode to spot. Or if I can't control it, what is the fixed mode of the metering / photometry. It looks like center weighted but I'm not sure.\n2. Since I'm working on short films, I often need to use framing guidelines for aspect ratios like 2.35. Is there an option to do that, or am I stuck with the 9 grid-24 grid-HD framing options?", "link": "https://www.reddit.com/r/Cameras/comments/i4zibq/fujifilm_xt4_movie_mode_metering_and_framing/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fujifilm x-t4 movie mode metering and framing guidelines /!/ hello, i recently bought an x-t4, i've been meddling with the camera but there are two things i wonder that i couldn't find the answers anywhere.\n\n1. can i control the metering movie mode? like changing its mode to -----> spot !!! . or if i can't control it, what is the fixed mode of the metering / photometry. it looks like center weighted but i'm not sure.\n2. since i'm working on short films, i often need to use framing guidelines for aspect ratios like 2.35. is there an option to do that, or am i stuck with the 9 grid-24 grid-hd framing options?", "sortedWord": "None", "identifyer": 10770, "year": "2020"}], "name": "spotCameras2020"}