{"interestingcomments": [{"Unnamed: 0": 221039, "autor": "CreateForCreator", "date": 1619834130000, "content": "Camera + Laser Tag= Death? /!/ Hope y'all can help me. Would anybody happen to know if the laser from laser tag is strong enough to damage a camera sensor? I know lasers from many concerts could damage your camera and I've seen the clip of the Sony camera sensor melting from recording a powerful laser. \n\nThere's a potential gig for me at a laser tag event, but I wouldn't want to take it if kids keep shining lasers at my camera and my sensor is damaged. I would be shooting with the pocket 4k. Thanks", "link": "https://www.reddit.com/r/Cameras/comments/n28nmj/camera_laser_tag_death/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "camera + laser tag= death? /!/ hope y'all can help me. would anybody happen to know if the laser from laser -----> tag !!!  is strong enough to damage a camera sensor? i know lasers from many concerts could damage your camera and i've seen the clip of the sony camera sensor melting from recording a powerful laser. \n\nthere's a potential gig for me at a laser tag event, but i wouldn't want to take it if kids keep shining lasers at my camera and my sensor is damaged. i would be shooting with the pocket 4k. thanks", "sortedWord": "None", "identifyer": 15575, "year": "2021"}, {"Unnamed: 0": 221349, "autor": "sifren2", "date": 1625075624000, "content": "Canon EF 24-70 2.8II vs Sigma Art 24-70 2.8 OS /!/ Hey /Cameras  \n\n\nRecently the older Canon 24-70 2.8 v1 at my office broke and I'm looking to pick up another 24-70 to replace it. Does anyone have any insight regarding the Canon V2 vs Sigma Art for the 24-70 2.8? At my local camera store the difference in price is substantial (Sigma is almost 900 dollars cheaper) Budgetarily speaking I don't really mind Canon's price tag, but is the Canon 2.8 v2 really worth it? or am I better served picking up a Sigma Art prime with the price difference?  \n\n\nLet me know what you think, thanks in advance.", "link": "https://www.reddit.com/r/Cameras/comments/ob2mv9/canon_ef_2470_28ii_vs_sigma_art_2470_28_os/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon ef 24-70 2.8ii vs sigma art 24-70 2.8 os /!/ hey /cameras  \n\n\nrecently the older canon 24-70 2.8 v1 at my office broke and i'm looking to pick up another 24-70 to replace it. does anyone have any insight regarding the canon v2 vs sigma art for the 24-70 2.8? at my local camera store the difference in price is substantial (sigma is almost 900 dollars cheaper) budgetarily speaking i don't really mind canon's price -----> tag !!! , but is the canon 2.8 v2 really worth it? or am i better served picking up a sigma art prime with the price difference?  \n\n\nlet me know what you think, thanks in advance.", "sortedWord": "None", "identifyer": 15895, "year": "2021"}, {"Unnamed: 0": 221846, "autor": "seeleeburtee", "date": 1615704083000, "content": "1st Camera Purchase: A7C or a6600 /!/ Hello,\n\nI'm looking to upgrade from my A7ii, which I've owned for a couple of months. I'm relatively new to photography and am looking to upgrade to either the A7C or a6600. I'm very much still a beginner and am trying to figure out which camera would be best for my needs. \n\nMy budget isn't super tight, but I like the idea of the a6600 due to the versatility of lenses with relation to price. At present, I'm eyeing the a6600 body (\\~$1400 USD) with the 16-55mm f/2.8 G Lens at a start–purely for that lens's versatility. I plan on expanding my kit to include a portrait lens (Sigma 30mm f/1.4) and possibly a telephoto (Sony 70-350mm f/4.5-6.3) down the road, as I love sports photography. Macro has always been an interest of mine, but I think portraits and action shots would take providence as of now. \n\nMy issue is with Sony's future with APS-C. I come from a line of photographers (a handful of family members have taken up the profession), and all suggest I just invest in FF now, considering that's where Sony seems to be heading. I consider myself an enthused hobbiest at most right now, but I'm not sure if opting for the modern FF camera body &amp; glass will help me further develop any talent. The low price of APS-C lenses is super attractive, but I don't know if that's best for the long-run, you know?\n\nI can bear the cost of the A7C + 24-105mm f/4, but part of me questions that \\~$3000 price tag for the a6600 with my choice of lenses. Does Sony seem to be at all invested in their crop sensor line throughout the future? Should I just accept the quality of the A7C and recognize that I'm \"dating the body but marrying the glass\"? I'd appreciate any help you all can offer me.", "link": "https://www.reddit.com/r/Cameras/comments/m4pxht/1st_camera_purchase_a7c_or_a6600/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1st camera purchase: a7c or a6600 /!/ hello,\n\ni'm looking to upgrade from my a7ii, which i've owned for a couple of months. i'm relatively new to photography and am looking to upgrade to either the a7c or a6600. i'm very much still a beginner and am trying to figure out which camera would be best for my needs. \n\nmy budget isn't super tight, but i like the idea of the a6600 due to the versatility of lenses with relation to price. at present, i'm eyeing the a6600 body (\\~$1400 usd) with the 16-55mm f/2.8 g lens at a start–purely for that lens's versatility. i plan on expanding my kit to include a portrait lens (sigma 30mm f/1.4) and possibly a telephoto (sony 70-350mm f/4.5-6.3) down the road, as i love sports photography. macro has always been an interest of mine, but i think portraits and action shots would take providence as of now. \n\nmy issue is with sony's future with aps-c. i come from a line of photographers (a handful of family members have taken up the profession), and all suggest i just invest in ff now, considering that's where sony seems to be heading. i consider myself an enthused hobbiest at most right now, but i'm not sure if opting for the modern ff camera body &amp; glass will help me further develop any talent. the low price of aps-c lenses is super attractive, but i don't know if that's best for the long-run, you know?\n\ni can bear the cost of the a7c + 24-105mm f/4, but part of me questions that \\~$3000 price -----> tag !!!  for the a6600 with my choice of lenses. does sony seem to be at all invested in their crop sensor line throughout the future? should i just accept the quality of the a7c and recognize that i'm \"dating the body but marrying the glass\"? i'd appreciate any help you all can offer me.", "sortedWord": "None", "identifyer": 16412, "year": "2021"}, {"Unnamed: 0": 222724, "autor": "Bunbunny_", "date": 1620843562000, "content": "Can anyone tell me anything about this? I found it in a charity shop for £7.50. Tag claims to have a shutter fault. What film should I buy to test it out?", "link": "https://www.reddit.com/r/Cameras/comments/navjah/can_anyone_tell_me_anything_about_this_i_found_it/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "can anyone tell me anything about this? i found it in a charity shop for £7.50. -----> tag !!!  claims to have a shutter fault. what film should i buy to test it out?", "sortedWord": "None", "identifyer": 17333, "year": "2021"}, {"Unnamed: 0": 222932, "autor": "iamlosingmymarbles", "date": 1628953513000, "content": "Looking for my first digital camera. Have only taken pictures on my phone my whole life. I want a beginner-friendly challenge. /!/ Hey there!\n\nI love taking pictures, go figure. Don't we all? I just want to step it up from my phone, but really want to avoid point and shoots.\n\nI have no brand preference, but i'd like something durable.\n\nHere's the thing. I really just love the look of the metal vintage cameras. Makes me feel like i'm shootin' in 1962. Theres a lot of black plastic cameras that I know i'd probably love the pictures from, but I'm just superficial enough to care what the outside of the camera looks like. For instance, I love the look of the A-1, but I can't afford the developing costs. I also feel like i'd like to learn technique while having instant feedback seeing what I did right or wrong... probably at first, what i'm doing wrong... right on screen, rather than waiting for film to be developed and not really knowing what settings or circumstance was going on at the time of the shot. I don't know how they did it back in the day.\n\nWhat do I want to take pictures of? No idea yet. I want to find out. I'm curious to jump into street photography, like most beginners. I've spent enough time with my phone photographing national parks, you could say i'm a little tired of nature... Still objects don't interest me at all. :( and there's nobody I know who would consent to having photos taken.\n\nI love candid photography. I really do. Anything off-guard and authentically human just speaks to me. But I know that cameras that capture movement extremely well have a super high price tag. Or so I imagine.\n\nAnyone have any insight with the info given from my rambling? I'd like to spend less than $800. Preferably, far less than that.", "link": "https://www.reddit.com/r/Cameras/comments/p49nm5/looking_for_my_first_digital_camera_have_only/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for my first digital camera. have only taken pictures on my phone my whole life. i want a beginner-friendly challenge. /!/ hey there!\n\ni love taking pictures, go figure. don't we all? i just want to step it up from my phone, but really want to avoid point and shoots.\n\ni have no brand preference, but i'd like something durable.\n\nhere's the thing. i really just love the look of the metal vintage cameras. makes me feel like i'm shootin' in 1962. theres a lot of black plastic cameras that i know i'd probably love the pictures from, but i'm just superficial enough to care what the outside of the camera looks like. for instance, i love the look of the a-1, but i can't afford the developing costs. i also feel like i'd like to learn technique while having instant feedback seeing what i did right or wrong... probably at first, what i'm doing wrong... right on screen, rather than waiting for film to be developed and not really knowing what settings or circumstance was going on at the time of the shot. i don't know how they did it back in the day.\n\nwhat do i want to take pictures of? no idea yet. i want to find out. i'm curious to jump into street photography, like most beginners. i've spent enough time with my phone photographing national parks, you could say i'm a little tired of nature... still objects don't interest me at all. :( and there's nobody i know who would consent to having photos taken.\n\ni love candid photography. i really do. anything off-guard and authentically human just speaks to me. but i know that cameras that capture movement extremely well have a super high price -----> tag !!! . or so i imagine.\n\nanyone have any insight with the info given from my rambling? i'd like to spend less than $800. preferably, far less than that.", "sortedWord": "None", "identifyer": 17551, "year": "2021"}, {"Unnamed: 0": 224123, "autor": "-Shinra_Tensei-", "date": 1613688666000, "content": "Canon Eos-R5 EVF. /!/ With the announcement of the new Sony-A1 and early reviews, it seems to be a beast but with a really HEFTY price tag, I have been seeing a lot of side by side comparisons with the Eos-R5 and it seems that the sony has the best EVF in the market with virtually no blackout at 30fps. But I want to ask all of you who have used the R5 at high fps. Does it have any blackout period? Or does it work smoothly while tracking a fast moving subject (flying birds)? Because even though A1 wins on paper, the R5 seems to be keeping up with it IRL for stills at least. I want to move to a mirrorless system from my old Nikon D750, but Nikon doesnt seem to have a mirrorless that compares to these cameras at the moment. I can wait for a few more months but Nikon does not seem to have any comparable mirrorless coming out anytime soon. R5 is way cheaper than the A1 and for me the only reason to even consider the A1 at that price is its 30fps no blackout SS. But, if the R5 can keep up at 20fps without any blackout then id rather invest that extra $$ in good glass.\n\nLet me know what you all have to say about it. Thanks!!", "link": "https://www.reddit.com/r/Cameras/comments/lmzpph/canon_eosr5_evf/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon eos-r5 evf. /!/ with the announcement of the new sony-a1 and early reviews, it seems to be a beast but with a really hefty price -----> tag !!! , i have been seeing a lot of side by side comparisons with the eos-r5 and it seems that the sony has the best evf in the market with virtually no blackout at 30fps. but i want to ask all of you who have used the r5 at high fps. does it have any blackout period? or does it work smoothly while tracking a fast moving subject (flying birds)? because even though a1 wins on paper, the r5 seems to be keeping up with it irl for stills at least. i want to move to a mirrorless system from my old nikon d750, but nikon doesnt seem to have a mirrorless that compares to these cameras at the moment. i can wait for a few more months but nikon does not seem to have any comparable mirrorless coming out anytime soon. r5 is way cheaper than the a1 and for me the only reason to even consider the a1 at that price is its 30fps no blackout ss. but, if the r5 can keep up at 20fps without any blackout then id rather invest that extra $$ in good glass.\n\nlet me know what you all have to say about it. thanks!!", "sortedWord": "None", "identifyer": 18803, "year": "2021"}, {"Unnamed: 0": 224787, "autor": "SomeAsianDudeII", "date": 1611244345000, "content": "What's a good entry-level camera I can get under the price tag of $500? /!/ I want to start out a new hobby for 2021, and wanted to try photography and video for my YouTube channel and just for my own liking. It seems like a cool hobby to try, but I'm financially stuck with $500, I've seen a lot of cameras that could fit this price, such as the M50 and A5100, but I could use a bit of help so I could be more open about other and potentially better options.", "link": "https://www.reddit.com/r/Cameras/comments/l211zf/whats_a_good_entrylevel_camera_i_can_get_under/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what's a good entry-level camera i can get under the price -----> tag !!!  of $500? /!/ i want to start out a new hobby for 2021, and wanted to try photography and video for my youtube channel and just for my own liking. it seems like a cool hobby to try, but i'm financially stuck with $500, i've seen a lot of cameras that could fit this price, such as the m50 and a5100, but i could use a bit of help so i could be more open about other and potentially better options.", "sortedWord": "None", "identifyer": 19496, "year": "2021"}, {"Unnamed: 0": 224846, "autor": "jz1127", "date": 1621461379000, "content": "6D Mark II, EOS RP or EOS R? /!/ Want to replace 6D mark I and looking forward to a rotating touch screen. 4K video is nice tho I usually just shoot in FULL HD. Would you bother with the 6D Mark II or just go ahead and move into R series? Cant afford the R5, the R6 looked enticing but, not sure if is worth the price tag so was thinking of the RP or R.", "link": "https://www.reddit.com/r/Cameras/comments/ngie75/6d_mark_ii_eos_rp_or_eos_r/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "6d mark ii, eos rp or eos r? /!/ want to replace 6d mark i and looking forward to a rotating touch screen. 4k video is nice tho i usually just shoot in full hd. would you bother with the 6d mark ii or just go ahead and move into r series? cant afford the r5, the r6 looked enticing but, not sure if is worth the price -----> tag !!!  so was thinking of the rp or r.", "sortedWord": "None", "identifyer": 19558, "year": "2021"}, {"Unnamed: 0": 224924, "autor": "feelworld", "date": 1621930091000, "content": "The process of setting up the camera equipment /!/    \nShow the process of setting up the camera equipment in a fun way.🔥  \n\n\nRepost by INS [@rock\\_n\\_roll\\_\\_a](https://www.instagram.com/rock_n_roll__a/)  \n\n\n[\\#feelworld](https://www.instagram.com/explore/tags/feelworld/) [\\#feelworldmonitor](https://www.instagram.com/explore/tags/feelworldmonitor/) [\\#feelworldf6plus](https://www.instagram.com/explore/tags/feelworldf6plus/)\n\n7 小时", "link": "https://www.reddit.com/r/Cameras/comments/nkkfx8/the_process_of_setting_up_the_camera_equipment/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "the process of setting up the camera equipment /!/    \nshow the process of setting up the camera equipment in a fun way.🔥  \n\n\nrepost by ins [@rock\\_n\\_roll\\_\\_a](https://www.instagram.com/rock_n_roll__a/)  \n\n\n[\\#feelworld](https://www.instagram.com/explore/-----> tags !!! /feelworld/) [\\#feelworldmonitor](https://www.instagram.com/explore/tags/feelworldmonitor/) [\\#feelworldf6plus](https://www.instagram.com/explore/tags/feelworldf6plus/)\n\n7 小时", "sortedWord": "None", "identifyer": 19642, "year": "2021"}, {"Unnamed: 0": 225524, "autor": "No_Sail6290", "date": 1624487540000, "content": "Help me choose the right starter camera for me! (warning: lengthy post) /!/ ### Intro\n\n* Hi everyone! I just graduated college and I'm looking to buy myself a graduation gift. \n* I originally thought I was going to buy the Sony ZV-1 but quickly realized it wouldn't provide the *look* I'm going for. I want something a little more advanced than your typical iphone/point+shoot.\n* This is my first *significant* purchase so it's important for me to make the right decision so that I'm not wasting money in the long run.\n* I need help choosing the best system AND lenses (I am truly clueless about how to pick out a lens)\n* My family currently has a 2008 Nikon D40 with a Tamron 18-200mm lens. The lens is broken, slides down on its own, and is probably scratched due to poor handling by my family. The camera focuses poorly and there''s a lot of blur when I take a photo. \n* I've used another family member's Canon 60D and I never enjoyed the ergonomics. Canon and Nikon are so damn bulky. I have small hands.\n\n### Use Case / Needs / Wants\n\n\n* Hybrid -- more emphasis on photography, with some video clips \n* Pure hobbyist, starting out (but not super entry level)\n* Portable -- something I can throw in a medium sized handbag \n* I mainly want to shoot advanced selfies with a pixel intervalometer when I go on an *adventure* \n* Biking, hiking, day trips into the countryside/city, travel, pets at the pet park, family/friends, candids\n* Will not be used for studio. Purely outdoor and natural lighting \n* I also want to make b-roll style short video clips (slowmo panning, etc) so some *stabilization* is important to me. Probably won't do any walking+talking vlogs ever. \n* I need it to connect to my phone's app so I can frame my shot and see myself on the cell phone from far away\n* I'd like to maybe do time lapses so that I can photograph movement, so that it can continuously take pictures as I dance around, then I can just pick out a frame within the time lapse. Or am I thinking of this wrong?\n* Some kind of flipping screen so I can see/frame myself with the camera \n\n### Budget\n\n* Because I'm just a hobbyist and don't plan on making any money or doing anything serious, I can't justify spending $2000+ on a body and lens\n* I technically *can* spend more. I've saved enough. But it would make feel bad if I did (unless convinced otherwise) I hope that makes sense.\n* My ideal budget is around $1000-$1500 USD plus minus a few hundred for both body AND lens \n* I don't know if 6 months from now I'll stop the hobby and end up using the camera twice a year. \n* I don't know if I'll completely fall in love and end up itching to upgrade, thus making a low quality purchase a waste of money\n* One thing is for sure: I want to be *more serious* about traveling, especially alone. And I would love to capture those moments on a *good quality camera.*\n\n### Crop or Full Frame\n\n* Okay so here is the thing. I've watched over 300 youtube videos on my quest to research the best camera for me. \n* I quickly realized that I really enjoyed *the look* of higher end full frame cameras. \n* Canon backgrounds are smooth like butter *chefs kiss*\n* Sony A7iii (S/R) also produced ideal photographs \n* But I think they are out of my budget\n* I can't justify the $3000 price tag on the Canon\n* Or $2000+ for the Sony\n* These cameras have the *ideal* photo look and I may upgrade to them in the future if I do become more serious / find a job a save up to upgrade\n* But do I really want to waste $1400 on the a6600 crop sensor when I can just pay a few hundred more for a full frame? This is my dilemma. Where do I draw the line? This is where I need your help\n* I don't know what I don't know. So all of your advice and insights are appreciated for helping me consider all my options. Perhaps I overlooked a feature that I didn't know I needed that a specific camera has?\n\n### Cameras and Lenses\n\n* Here is a link of how I envision my photos to look like: \n* https://imgur.com/a/6vKeNML\n* **What body and lenses do I need to buy to achieve that kind of look?** (obviously excluding the editing)\n* Example of what I don't like (typical iphone style): https://i.imgur.com/waA7bJV.png\n* Top 3 Examples of my ideal \"look\": 1) https://i.imgur.com/skjgg97.png 2) https://i.imgur.com/5ey2mjR.png 3) https://i.imgur.com/4XYZIyQ.png\n* Video clip example of the look I like (first 17 seconds only): https://www.youtube.com/watch?v=-UsZMbHhZTk\n* Cameras I've considered:\n* Sony a7iii (a little too pricey), Sony a6600, Sony a6400\n* Olympus EM1 Mark ii/iii - but they're going out of business so I don't want an obsolete camera \n* Fuji XS10, XT3, XT4 (pricey, also they're upgrading the sensor with the next model)\n* Canon EOS RP (bulky)\n\nIf $3000 was my budget I would without a doubt buy the Sony A7iii in a heartbeat. But IDK if I can justify that price point right now as someone who is starting out. Should I? Should I just bite the bullet without dipping my toes first with a $1000 camera instead? \n\nI need your help reddit! Any insight and recommendations will be helpful in my consideration.", "link": "https://www.reddit.com/r/Cameras/comments/o6no7g/help_me_choose_the_right_starter_camera_for_me/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "help me choose the right starter camera for me! (warning: lengthy post) /!/ ### intro\n\n* hi everyone! i just graduated college and i'm looking to buy myself a graduation gift. \n* i originally thought i was going to buy the sony zv-1 but quickly realized it wouldn't provide the *look* i'm going for. i want something a little more advanced than your typical iphone/point+shoot.\n* this is my first *significant* purchase so it's important for me to make the right decision so that i'm not wasting money in the long run.\n* i need help choosing the best system and lenses (i am truly clueless about how to pick out a lens)\n* my family currently has a 2008 nikon d40 with a tamron 18-200mm lens. the lens is broken, slides down on its own, and is probably scratched due to poor handling by my family. the camera focuses poorly and there''s a lot of blur when i take a photo. \n* i've used another family member's canon 60d and i never enjoyed the ergonomics. canon and nikon are so damn bulky. i have small hands.\n\n### use case / needs / wants\n\n\n* hybrid -- more emphasis on photography, with some video clips \n* pure hobbyist, starting out (but not super entry level)\n* portable -- something i can throw in a medium sized handbag \n* i mainly want to shoot advanced selfies with a pixel intervalometer when i go on an *adventure* \n* biking, hiking, day trips into the countryside/city, travel, pets at the pet park, family/friends, candids\n* will not be used for studio. purely outdoor and natural lighting \n* i also want to make b-roll style short video clips (slowmo panning, etc) so some *stabilization* is important to me. probably won't do any walking+talking vlogs ever. \n* i need it to connect to my phone's app so i can frame my shot and see myself on the cell phone from far away\n* i'd like to maybe do time lapses so that i can photograph movement, so that it can continuously take pictures as i dance around, then i can just pick out a frame within the time lapse. or am i thinking of this wrong?\n* some kind of flipping screen so i can see/frame myself with the camera \n\n### budget\n\n* because i'm just a hobbyist and don't plan on making any money or doing anything serious, i can't justify spending $2000+ on a body and lens\n* i technically *can* spend more. i've saved enough. but it would make feel bad if i did (unless convinced otherwise) i hope that makes sense.\n* my ideal budget is around $1000-$1500 usd plus minus a few hundred for both body and lens \n* i don't know if 6 months from now i'll stop the hobby and end up using the camera twice a year. \n* i don't know if i'll completely fall in love and end up itching to upgrade, thus making a low quality purchase a waste of money\n* one thing is for sure: i want to be *more serious* about traveling, especially alone. and i would love to capture those moments on a *good quality camera.*\n\n### crop or full frame\n\n* okay so here is the thing. i've watched over 300 youtube videos on my quest to research the best camera for me. \n* i quickly realized that i really enjoyed *the look* of higher end full frame cameras. \n* canon backgrounds are smooth like butter *chefs kiss*\n* sony a7iii (s/r) also produced ideal photographs \n* but i think they are out of my budget\n* i can't justify the $3000 price -----> tag !!!  on the canon\n* or $2000+ for the sony\n* these cameras have the *ideal* photo look and i may upgrade to them in the future if i do become more serious / find a job a save up to upgrade\n* but do i really want to waste $1400 on the a6600 crop sensor when i can just pay a few hundred more for a full frame? this is my dilemma. where do i draw the line? this is where i need your help\n* i don't know what i don't know. so all of your advice and insights are appreciated for helping me consider all my options. perhaps i overlooked a feature that i didn't know i needed that a specific camera has?\n\n### cameras and lenses\n\n* here is a link of how i envision my photos to look like: \n* https://imgur.com/a/6vkenml\n* **what body and lenses do i need to buy to achieve that kind of look?** (obviously excluding the editing)\n* example of what i don't like (typical iphone style): https://i.imgur.com/waa7bjv.png\n* top 3 examples of my ideal \"look\": 1) https://i.imgur.com/skjgg97.png 2) https://i.imgur.com/5ey2mjr.png 3) https://i.imgur.com/4xyziyq.png\n* video clip example of the look i like (first 17 seconds only): https://www.youtube.com/watch?v=-uszmbhhztk\n* cameras i've considered:\n* sony a7iii (a little too pricey), sony a6600, sony a6400\n* olympus em1 mark ii/iii - but they're going out of business so i don't want an obsolete camera \n* fuji xs10, xt3, xt4 (pricey, also they're upgrading the sensor with the next model)\n* canon eos rp (bulky)\n\nif $3000 was my budget i would without a doubt buy the sony a7iii in a heartbeat. but idk if i can justify that price point right now as someone who is starting out. should i? should i just bite the bullet without dipping my toes first with a $1000 camera instead? \n\ni need your help reddit! any insight and recommendations will be helpful in my consideration.", "sortedWord": "None", "identifyer": 20261, "year": "2021"}, {"Unnamed: 0": 226204, "autor": "Fun_Client_6232", "date": 1626575182000, "content": "Camera similar to iPhone 12 Pro Max? /!/ What’s a regular point and shoot camera that’s has similar features as the iPhone 12 Pro Max? I’m looking for a camera like this that doesn’t have the same price tag but also has mounts for a tripod and for a hot shoe flash.", "link": "https://www.reddit.com/r/Cameras/comments/omhtu2/camera_similar_to_iphone_12_pro_max/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "camera similar to iphone 12 pro max? /!/ what’s a regular point and shoot camera that’s has similar features as the iphone 12 pro max? i’m looking for a camera like this that doesn’t have the same price -----> tag !!!  but also has mounts for a tripod and for a hot shoe flash.", "sortedWord": "None", "identifyer": 20974, "year": "2021"}, {"Unnamed: 0": 226640, "autor": "Notorious_Fluffy_G", "date": 1632511204000, "content": "Please help me chose my first camera! /!/ I am looking for a versatile camera that is capable of making quality video and photographs.  I will use the camera mainly for landscape photography and videos, but also for city scapes and family photos / videos.  With that being said, I do value compactness and lighter weight options.\n\nMy budget is $2,000 for the camera body, starting lens(es), and a decent tripod. I can go up a bit in budget if there is a worthwhile upgrade for future proofing the set up. I am the type that likes to jump in head first into my hobbies and have the buy it for life mentality most of the time and try to avoid needless upgrades (though I gather this hobby often progresses to the point of being a money pit haha).\n\nCurrently not planning on doing post production, as I do not own any editing software, however I might decide to get into this in the future. Would prefer a camera that produces solid photos / videos without the need to perform post production editing.\n\nAfter thorough research, I am currently leaning towards the following options:\n  - Sony a6400 body only\n  - Tamron 17-70mm f/2.8\n\n\nQuestions:\n\n1) What do you guys think of the a6400? I see a lot of contrasting opinions - many praise it as having amazing bang for your buck and very versatile, while I’ve also seen people saying it is outdated and Sony will soon shift all their focus on the full frame line up. Also I see a lot of complaints regarding the clunky menu set up. Thoughts on this? Are there any other cameras I should be looking at?\n\n2) I want to get a zoom lens for my first lens, as I want a versatile lens that I can bring on hikes that can do nearly everything to avoid carrying multiple lens. I also figure it will be a good first lens because it will allow me to figure out what my favorite range to shoot at is, so that I can decide which Sigma prime lens I want to get first to supplement my tool kit. I was initially considering the Sony 18-105mm f/4.0 lens instead of the Tamron 17-70mm f/2.8, but from research it seems to me like I’d be better off with the Tamron. Seems as though the only benefit on the Sony would be the additional range (which I don’t believe I’ll miss the ability to zoom in that far), and the fact that the lens adjustment is internal, so if I decide to get a gimbal in the future it will be better suited for this.  Would you guys agree with my logic? Is there a different lens you’d recommend instead?\n\n3) My understanding is that there is speculation that the Sony a7iv will be released in October 2021. I would imagine that the release of this camera would result in price drops for the Sony a7iii and the a6400. Is this typically how that works out? I’d love to go full frame, but the a7iii is out of my price range\nFrom what I am seeing on the a6600, the improvements over the a6400 do not warrant the x2 price tag. Thoughts? The a6400 does not have IBIS but many of the available lenses (including Tamron lens I am planning on getting) have lens stabilization. Is lens stabilization equivalent to IBIS? If I have IBIS of the A6600, does having a lens with lens stabilization noticeably increase performance, or is it unnecessary at that point?\n\n4) What lightweight mini tri-pod would you recommend?\n\n5) Would the Sigma 30mm f/1.4 be a solid second lens? Is that a good range for my first prime lens, or should I go with the Sigma 56mm f/1.4?\n\n\nAppreciate your help and open to hear any other suggestions / input!", "link": "https://www.reddit.com/r/Cameras/comments/puqn6z/please_help_me_chose_my_first_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "please help me chose my first camera! /!/ i am looking for a versatile camera that is capable of making quality video and photographs.  i will use the camera mainly for landscape photography and videos, but also for city scapes and family photos / videos.  with that being said, i do value compactness and lighter weight options.\n\nmy budget is $2,000 for the camera body, starting lens(es), and a decent tripod. i can go up a bit in budget if there is a worthwhile upgrade for future proofing the set up. i am the type that likes to jump in head first into my hobbies and have the buy it for life mentality most of the time and try to avoid needless upgrades (though i gather this hobby often progresses to the point of being a money pit haha).\n\ncurrently not planning on doing post production, as i do not own any editing software, however i might decide to get into this in the future. would prefer a camera that produces solid photos / videos without the need to perform post production editing.\n\nafter thorough research, i am currently leaning towards the following options:\n  - sony a6400 body only\n  - tamron 17-70mm f/2.8\n\n\nquestions:\n\n1) what do you guys think of the a6400? i see a lot of contrasting opinions - many praise it as having amazing bang for your buck and very versatile, while i’ve also seen people saying it is outdated and sony will soon shift all their focus on the full frame line up. also i see a lot of complaints regarding the clunky menu set up. thoughts on this? are there any other cameras i should be looking at?\n\n2) i want to get a zoom lens for my first lens, as i want a versatile lens that i can bring on hikes that can do nearly everything to avoid carrying multiple lens. i also figure it will be a good first lens because it will allow me to figure out what my favorite range to shoot at is, so that i can decide which sigma prime lens i want to get first to supplement my tool kit. i was initially considering the sony 18-105mm f/4.0 lens instead of the tamron 17-70mm f/2.8, but from research it seems to me like i’d be better off with the tamron. seems as though the only benefit on the sony would be the additional range (which i don’t believe i’ll miss the ability to zoom in that far), and the fact that the lens adjustment is internal, so if i decide to get a gimbal in the future it will be better suited for this.  would you guys agree with my logic? is there a different lens you’d recommend instead?\n\n3) my understanding is that there is speculation that the sony a7iv will be released in october 2021. i would imagine that the release of this camera would result in price drops for the sony a7iii and the a6400. is this typically how that works out? i’d love to go full frame, but the a7iii is out of my price range\nfrom what i am seeing on the a6600, the improvements over the a6400 do not warrant the x2 price -----> tag !!! . thoughts? the a6400 does not have ibis but many of the available lenses (including tamron lens i am planning on getting) have lens stabilization. is lens stabilization equivalent to ibis? if i have ibis of the a6600, does having a lens with lens stabilization noticeably increase performance, or is it unnecessary at that point?\n\n4) what lightweight mini tri-pod would you recommend?\n\n5) would the sigma 30mm f/1.4 be a solid second lens? is that a good range for my first prime lens, or should i go with the sigma 56mm f/1.4?\n\n\nappreciate your help and open to hear any other suggestions / input!", "sortedWord": "None", "identifyer": 21434, "year": "2021"}, {"Unnamed: 0": 226902, "autor": "thetravelingpinecone", "date": 1633657900000, "content": "Nikon Z6 vs. Sony A7ii /!/ Hi there! My budget sits around $2,000 CAD so I can't afford the Sony A7ii but i've had a lot of recommendations from photographer friends to purchase it. I would love to try out a mirrorless for a number of reasons but also have the Nikon D750 as a solid option. I currently have an older Nikon DSLR, and have been looking at the Z5 and Z6. \n\nWhat am I really losing out on in terms of photo quality by not purchasing the A7? I mostly shoot in ideal lighting but have been frustrated with my older camera's inability to capture low light situations and animals clearly. I shoot a lot of sports, animals, and landscapes so I need a great autofocus and high shutter speed.\n\nI know they are worlds apart (the price tag tells me that before I even get into specs!) but for what i'm planning on shooting, will the Z6 still be a great upgrade?  Should I get the D750 instead? Thanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/q3nt7i/nikon_z6_vs_sony_a7ii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "nikon z6 vs. sony a7ii /!/ hi there! my budget sits around $2,000 cad so i can't afford the sony a7ii but i've had a lot of recommendations from photographer friends to purchase it. i would love to try out a mirrorless for a number of reasons but also have the nikon d750 as a solid option. i currently have an older nikon dslr, and have been looking at the z5 and z6. \n\nwhat am i really losing out on in terms of photo quality by not purchasing the a7? i mostly shoot in ideal lighting but have been frustrated with my older camera's inability to capture low light situations and animals clearly. i shoot a lot of sports, animals, and landscapes so i need a great autofocus and high shutter speed.\n\ni know they are worlds apart (the price -----> tag !!!  tells me that before i even get into specs!) but for what i'm planning on shooting, will the z6 still be a great upgrade?  should i get the d750 instead? thanks in advance!", "sortedWord": "None", "identifyer": 21705, "year": "2021"}, {"Unnamed: 0": 227788, "autor": "Tsconspiracy", "date": 1627858177000, "content": "Hi guys, new here. I have been antiquing recently and picked up a couple of older cameras and this one I’m having a difficult time finding any information. From what I can see, there’s a tag that says “Premo No. 8” but I can’t find this exact model online.", "link": "https://www.reddit.com/r/Cameras/comments/ow27ko/hi_guys_new_here_i_have_been_antiquing_recently/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hi guys, new here. i have been antiquing recently and picked up a couple of older cameras and this one i’m having a difficult time finding any information. from what i can see, there’s a -----> tag !!!  that says “premo no. 8” but i can’t find this exact model online.", "sortedWord": "None", "identifyer": 22634, "year": "2021"}, {"Unnamed: 0": 228121, "autor": "Neknoh", "date": 1631650509000, "content": "A camera for vlogs and macro photography? /!/ Long story short, I build a lot of miniatures, have a very small but growing Instagram with pictures off my phone camera and I've always wanted to get into the combo-style vlog of Maker + Lifestyle/Hangout.\n\nFor this, I'm looking for a mirrorless camera as I'd want it portable and able to mount on a limb hanging over my workspace. I'm after good, snappy autofocus and 4k shooting is not a requirement (although it is a nice bonus). Bonus points for decent lowlight and good access to a future macro-lens upgrade for those sweet, sweet Instagram shots.\n\nAnything between 14 and 28mm equivalent zooming up to a 70-85mm equivalent in the kit lens would be ideal.\n\nI have little to no experience with cameras outside of my phone and I'm looking for something I can grow with and possibly start going into the lense eco-system of the brand with if I get a tester for more.\n\nAfter a good several hours of researching, here are three cameras and some notes on budget and initial purchase:\n\n1. Cameras.\n\nSony a6400, recommended by most youtubers and reviews, access to a good series of lenses and seems to be a solid camera for several years to come, even if at the \"entry level point\" today.\n\nNikon Z fc; as far as I can tell, recommended by the cult of Nikon who could never go back to any other brand, supposedly has great (but few) lenses (though it can be adapted to take more) and, turns out, my family has a small set of lenses, from a prime 35 to a telephoto and a tamron alround zoom-lense of some sort.\n\nCanon EOS M50 mk ii: recommended by several youtubers, and in particular one who used to be a professional photographer and then went full-time as a hobby-tuber within the same hobby. Lower price tag also allows me to spend more on a tripod and other extras for the camera while still coming in at about the same price as a basic Sony or Nikon kit. Lawded for snappy autofocus and, being a Canon, good skin-tones. Seems to be more of an \"if you wanna get a camera and just, you know, have a decent camera\" kinda buy rather than a full-on \"I could dive into the ekosystem and grow with this camera\".\n\n\n2. Notes on extra stuff: no matter what camera I'll get, I won't spend any leftover cash on extra glass, I'd like to start out with the kit lens and find out what focal lengths I film and photograph the most at. I should also be able to borrow a Manfrotto tripod if I can't fit a decent one into the budget, and I've already got some decent (though not studio perfect) lighting that is at least passable for now.\n\n3. Budget cap: budget caps out around 1100 euro for the camera with kit lens, as extra battery, SD cards etc are gonna push it another 100 or so (not to mention a microphone for another 50-150 euro), so the RP + lens is out of the running due to local prices (kits from 1350 and up).", "link": "https://www.reddit.com/r/Cameras/comments/poanxd/a_camera_for_vlogs_and_macro_photography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a camera for vlogs and macro photography? /!/ long story short, i build a lot of miniatures, have a very small but growing instagram with pictures off my phone camera and i've always wanted to get into the combo-style vlog of maker + lifestyle/hangout.\n\nfor this, i'm looking for a mirrorless camera as i'd want it portable and able to mount on a limb hanging over my workspace. i'm after good, snappy autofocus and 4k shooting is not a requirement (although it is a nice bonus). bonus points for decent lowlight and good access to a future macro-lens upgrade for those sweet, sweet instagram shots.\n\nanything between 14 and 28mm equivalent zooming up to a 70-85mm equivalent in the kit lens would be ideal.\n\ni have little to no experience with cameras outside of my phone and i'm looking for something i can grow with and possibly start going into the lense eco-system of the brand with if i get a tester for more.\n\nafter a good several hours of researching, here are three cameras and some notes on budget and initial purchase:\n\n1. cameras.\n\nsony a6400, recommended by most youtubers and reviews, access to a good series of lenses and seems to be a solid camera for several years to come, even if at the \"entry level point\" today.\n\nnikon z fc; as far as i can tell, recommended by the cult of nikon who could never go back to any other brand, supposedly has great (but few) lenses (though it can be adapted to take more) and, turns out, my family has a small set of lenses, from a prime 35 to a telephoto and a tamron alround zoom-lense of some sort.\n\ncanon eos m50 mk ii: recommended by several youtubers, and in particular one who used to be a professional photographer and then went full-time as a hobby-tuber within the same hobby. lower price -----> tag !!!  also allows me to spend more on a tripod and other extras for the camera while still coming in at about the same price as a basic sony or nikon kit. lawded for snappy autofocus and, being a canon, good skin-tones. seems to be more of an \"if you wanna get a camera and just, you know, have a decent camera\" kinda buy rather than a full-on \"i could dive into the ekosystem and grow with this camera\".\n\n\n2. notes on extra stuff: no matter what camera i'll get, i won't spend any leftover cash on extra glass, i'd like to start out with the kit lens and find out what focal lengths i film and photograph the most at. i should also be able to borrow a manfrotto tripod if i can't fit a decent one into the budget, and i've already got some decent (though not studio perfect) lighting that is at least passable for now.\n\n3. budget cap: budget caps out around 1100 euro for the camera with kit lens, as extra battery, sd cards etc are gonna push it another 100 or so (not to mention a microphone for another 50-150 euro), so the rp + lens is out of the running due to local prices (kits from 1350 and up).", "sortedWord": "None", "identifyer": 22987, "year": "2021"}], "name": "tagCameras2021"}