{"interestingcomments": [{"Unnamed: 0": 208780, "autor": "HomeyworkeyYT", "date": 1580560507000, "content": "Looking for a camera that I could use for Youtube? Not too expensive (Less then $150?) /!/  Sorry if this gets posted all the time but I think you guys would be the best suited to answer my question\n\nI wouldn't need a camera which does better then 1080p60... now I put my price tag in the title but just spitball me any of them and I'll do my research from there.\n\nAlso I have no idea how audio works, but I'd like that to be good too? Might look into just getting mic's that I can move around with, and just sync the video with the audio in editing? Not really sure about that part I'll have to look into it. Thanks!!  \n\n\nnote: I don't have any way to record at the moment (my phone is trash quality) so thats not an option :P", "link": "https://www.reddit.com/r/Cameras/comments/ex5j1t/looking_for_a_camera_that_i_could_use_for_youtube/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for a camera that i could use for youtube? not too expensive (less then $150?) /!/  sorry if this gets posted all the time but i think you guys would be the best suited to answer my question\n\ni wouldn't need a camera which does better then 1080p60... now i put my price -----> tag !!!  in the title but just spitball me any of them and i'll do my research from there.\n\nalso i have no idea how audio works, but i'd like that to be good too? might look into just getting mic's that i can move around with, and just sync the video with the audio in editing? not really sure about that part i'll have to look into it. thanks!!  \n\n\nnote: i don't have any way to record at the moment (my phone is trash quality) so thats not an option :p", "sortedWord": "None", "identifyer": 2424, "year": "2020"}, {"Unnamed: 0": 209002, "autor": "xanas263", "date": 1579027554000, "content": "Looking for some beginner recommendations regarding Fuji xt 100 and xt 20. /!/ I'm looking to get into photography and have been eyeing Fuji as a brand worth investing in due to their style, size of cameras and reputation of their lenses. \n\nI'm got a max budget of $800- $900 USD and have been looking at two primary options. The first being trying to get a used/new xt20 which from what I've found I can get for around 600-800 USD with a kit lense. The second option would be going for a xt100 in which I sacrifice video quality for about a $400 USD price tag and the ability to possibly pick up a better lense with the remainder of my budget. \n\nWould really like some feedback on whether prioritizing the better lense would be worth it overall as besides video quality and motion tracking the two cameras seem the same? I'm also not too fussed about video and am mainly looking to use this to get into still photography.\n\nI'm also willing to check out other similar cameras from other brands that fit within that budget if you have further suggestions.", "link": "https://www.reddit.com/r/Cameras/comments/eopfw0/looking_for_some_beginner_recommendations/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for some beginner recommendations regarding fuji xt 100 and xt 20. /!/ i'm looking to get into photography and have been eyeing fuji as a brand worth investing in due to their style, size of cameras and reputation of their lenses. \n\ni'm got a max budget of $800- $900 usd and have been looking at two primary options. the first being trying to get a used/new xt20 which from what i've found i can get for around 600-800 usd with a kit lense. the second option would be going for a xt100 in which i sacrifice video quality for about a $400 usd price -----> tag !!!  and the ability to possibly pick up a better lense with the remainder of my budget. \n\nwould really like some feedback on whether prioritizing the better lense would be worth it overall as besides video quality and motion tracking the two cameras seem the same? i'm also not too fussed about video and am mainly looking to use this to get into still photography.\n\ni'm also willing to check out other similar cameras from other brands that fit within that budget if you have further suggestions.", "sortedWord": "None", "identifyer": 2652, "year": "2020"}, {"Unnamed: 0": 210127, "autor": "donq-11", "date": 1607360261000, "content": "Canon AE-1 or FUJIFILM XT-100 Alternatives /!/ Hello!\n\nI am a first-time camera buyer and was wondering if any of you had recommendations on which cameras to get. I love the feel of the canon AE-1 but I don't think I am ready for film photography yet. I also love the Fujifilm xt-100 but the price tag of the camera as well as the lenses is a little bit steep. Are there some sort of alternatives you would recommend? Thank you!", "link": "https://www.reddit.com/r/Cameras/comments/k8ke2y/canon_ae1_or_fujifilm_xt100_alternatives/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon ae-1 or fujifilm xt-100 alternatives /!/ hello!\n\ni am a first-time camera buyer and was wondering if any of you had recommendations on which cameras to get. i love the feel of the canon ae-1 but i don't think i am ready for film photography yet. i also love the fujifilm xt-100 but the price -----> tag !!!  of the camera as well as the lenses is a little bit steep. are there some sort of alternatives you would recommend? thank you!", "sortedWord": "None", "identifyer": 3897, "year": "2020"}, {"Unnamed: 0": 210652, "autor": "kaskii", "date": 1579556765000, "content": "300€ camera for photos and videos /!/ Our first baby is due in a few weeks and I'm looking to capture photos as well as some videos (a big plus for 4K@60 with decent bit rate if possible). Should I invest into cheap pocket camera (\\~200-300€) or does those have any significant difference for say, mobile phone camera (OnePlus 7 Pro) if we forget about the flash? If I should, any recommendations? DSLRs and others are also an option but I don't think there is anything worth buying at this price tag since I don't have any lenses. I can also throw little bit more money if that makes a huge difference.", "link": "https://www.reddit.com/r/Cameras/comments/erk9e7/300_camera_for_photos_and_videos/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "300€ camera for photos and videos /!/ our first baby is due in a few weeks and i'm looking to capture photos as well as some videos (a big plus for 4k@60 with decent bit rate if possible). should i invest into cheap pocket camera (\\~200-300€) or does those have any significant difference for say, mobile phone camera (oneplus 7 pro) if we forget about the flash? if i should, any recommendations? dslrs and others are also an option but i don't think there is anything worth buying at this price -----> tag !!!  since i don't have any lenses. i can also throw little bit more money if that makes a huge difference.", "sortedWord": "None", "identifyer": 4454, "year": "2020"}, {"Unnamed: 0": 211421, "autor": "Commie_Fag", "date": 1585758952000, "content": "About Fujifilm Camera lens and other Players in market. /!/ I have pre ordered the X-T4 and xf16-55 mm lens after months of so called research but recently i was using the same tags to see the images on different websites like 500px and flickr to see how good the inages are. \nBut somehow the images seem likw as if they were taken on smartphone. On the other hand using tags for sony alpha and a7 iii i saw beautiful sharp images .\nThe amount i have spent on xt 4 and 16 -55 lens i can get A7m3 and A7r2 in my country with tamron lens.\n\nCan you please tell me why the so much difference in image quality even though i searched for top glass of fujifilm .\nIf you guys want to check please go to 500px and flickr and use xf 16-55 tag to filter images and xompare to other sony alpha and canon and nikon similarly priced cameras.\nI was considering x-t4 because i love shooting videos and the manual dials and aesthetics appealed to me a lot.", "link": "https://www.reddit.com/r/Cameras/comments/ft35kv/about_fujifilm_camera_lens_and_other_players_in/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "about fujifilm camera lens and other players in market. /!/ i have pre ordered the x-t4 and xf16-55 mm lens after months of so called research but recently i was using the same -----> tags !!!  to see the images on different websites like 500px and flickr to see how good the inages are. \nbut somehow the images seem likw as if they were taken on smartphone. on the other hand using tags for sony alpha and a7 iii i saw beautiful sharp images .\nthe amount i have spent on xt 4 and 16 -55 lens i can get a7m3 and a7r2 in my country with tamron lens.\n\ncan you please tell me why the so much difference in image quality even though i searched for top glass of fujifilm .\nif you guys want to check please go to 500px and flickr and use xf 16-55 tag to filter images and xompare to other sony alpha and canon and nikon similarly priced cameras.\ni was considering x-t4 because i love shooting videos and the manual dials and aesthetics appealed to me a lot.", "sortedWord": "None", "identifyer": 5275, "year": "2020"}, {"Unnamed: 0": 212201, "autor": "TheFunkeyGibbon", "date": 1601720249000, "content": "Next jump up the range /!/ I currently have a Canon 1300D which was my first foray into \"proper\" cameras. I've had it around 4 years and I'm looking to take a jump up to something a little more capable. The problem is that that jump looks awfully far to anything that is going to be significantly better than what I have. In all honesty I want to go mirrorless if I can becuase this certainly offers the best features and is the way of the future and the Canon EOS R6 looks hot... if not for its £2500 price tag before lenses etc. I like Canon but the RP is super disappointing (in terms of specs at least) and so I'm considering a change to Sony and maybe a A7 iii. £1850 is still a lot but that £700 difference is at least one lens which I can't ignore.\n\nIs there any advice people can offer? Should I go for one of the cameras above or something a little different like a Fuji?", "link": "https://www.reddit.com/r/Cameras/comments/j4dfq2/next_jump_up_the_range/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "next jump up the range /!/ i currently have a canon 1300d which was my first foray into \"proper\" cameras. i've had it around 4 years and i'm looking to take a jump up to something a little more capable. the problem is that that jump looks awfully far to anything that is going to be significantly better than what i have. in all honesty i want to go mirrorless if i can becuase this certainly offers the best features and is the way of the future and the canon eos r6 looks hot... if not for its £2500 price -----> tag !!!  before lenses etc. i like canon but the rp is super disappointing (in terms of specs at least) and so i'm considering a change to sony and maybe a a7 iii. £1850 is still a lot but that £700 difference is at least one lens which i can't ignore.\n\nis there any advice people can offer? should i go for one of the cameras above or something a little different like a fuji?", "sortedWord": "None", "identifyer": 6218, "year": "2020"}, {"Unnamed: 0": 212300, "autor": "MikeC49", "date": 1602148293000, "content": "Anyone know if this is worth the £35 price tag?", "link": "https://www.reddit.com/r/Cameras/comments/j79upl/anyone_know_if_this_is_worth_the_35_price_tag/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "anyone know if this is worth the £35 price -----> tag !!! ?", "sortedWord": "None", "identifyer": 6322, "year": "2020"}, {"Unnamed: 0": 212910, "autor": "djacks15", "date": 1605017622000, "content": "Help with picking a camera /!/ I'm looking to buy a camera by the end of the year. Im unsure as to what I should get. I dont have a very large budget.  I could maybe do $1000. So first question.  Would it be better to buy the best camera I can afford with just a simple lens and then buy better lenses as I can? Or should I buy a cheaper camera like a nikon d3500 and use the leftover money to buy fair lenses? I use to do a fair amount of photography as a teenager but all I had was a coolpix l110. I plan to mostly do landscape and wildlife if I happen to stumble across some on a hike.  I've been doing a lot of research but it just seems a lot of camera are very very similar but with different price tags. Any recommendations would be amazing.", "link": "https://www.reddit.com/r/Cameras/comments/jrlmrc/help_with_picking_a_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "help with picking a camera /!/ i'm looking to buy a camera by the end of the year. im unsure as to what i should get. i dont have a very large budget.  i could maybe do $1000. so first question.  would it be better to buy the best camera i can afford with just a simple lens and then buy better lenses as i can? or should i buy a cheaper camera like a nikon d3500 and use the leftover money to buy fair lenses? i use to do a fair amount of photography as a teenager but all i had was a coolpix l110. i plan to mostly do landscape and wildlife if i happen to stumble across some on a hike.  i've been doing a lot of research but it just seems a lot of camera are very very similar but with different price -----> tags !!! . any recommendations would be amazing.", "sortedWord": "None", "identifyer": 7010, "year": "2020"}, {"Unnamed: 0": 213633, "autor": "Victorlungan", "date": 1594396096000, "content": "Good camera for shooting objects/items? /!/ Hello guys, \n\nI am looking for a camera that I can shoot sharp images with good color accuracy. I can use later Lightroom myself also. I will also want to shoot macro images, I will mostly shoot images of keyboards, phones, tech related and food. \n\nAny good compact not to big DSLR camera to recommend? Price tag with lenses and body from 600-1100$. \n\nThank you in advance (:", "link": "https://www.reddit.com/r/Cameras/comments/horbcd/good_camera_for_shooting_objectsitems/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "good camera for shooting objects/items? /!/ hello guys, \n\ni am looking for a camera that i can shoot sharp images with good color accuracy. i can use later lightroom myself also. i will also want to shoot macro images, i will mostly shoot images of keyboards, phones, tech related and food. \n\nany good compact not to big dslr camera to recommend? price -----> tag !!!  with lenses and body from 600-1100$. \n\nthank you in advance (:", "sortedWord": "None", "identifyer": 7769, "year": "2020"}, {"Unnamed: 0": 214220, "autor": "obxhead", "date": 1579320547000, "content": "I need a low light point and shoot. /!/ I need a point and shoot .jpg 12-20mp camera.  I'll be snapping pics of electronic equipment in a space that has dim fluorescent bulbs.  There will be tags with writing that must be readable.\n\nThis will be in and out of a work truck and worked hard.  300 to 700 pics a day and I'll be moving fast.  It will need to take some bumps and bruises. I also expect to replace it yearly.  It's gonna take bumps and bruises.\n\nBudget for a starter to last at least 9 months $400ish. I can push that a bit if I get some good recs.", "link": "https://www.reddit.com/r/Cameras/comments/eqbmlj/i_need_a_low_light_point_and_shoot/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i need a low light point and shoot. /!/ i need a point and shoot .jpg 12-20mp camera.  i'll be snapping pics of electronic equipment in a space that has dim fluorescent bulbs.  there will be -----> tags !!!  with writing that must be readable.\n\nthis will be in and out of a work truck and worked hard.  300 to 700 pics a day and i'll be moving fast.  it will need to take some bumps and bruises. i also expect to replace it yearly.  it's gonna take bumps and bruises.\n\nbudget for a starter to last at least 9 months $400ish. i can push that a bit if i get some good recs.", "sortedWord": "None", "identifyer": 8407, "year": "2020"}, {"Unnamed: 0": 215671, "autor": "mattjunes", "date": 1606771914000, "content": "Fuji x100f Cyber Monday deal /!/ A few major retailers are selling brand new Fuji x100f’s for $750 today. Can you please talk me in or out of this purchase? \n\nI already use an X-T2 as my primary camera, but have been thinking about picking up an x100 series to use more casually on a daily basis (family, travel, street, etc). Love the Fuji system and have heard great things about all x100 cameras. \n\nAre the upgrades on the x100v generally worth the $1400 price tag vs the x100f at $750?", "link": "https://www.reddit.com/r/Cameras/comments/k45s2x/fuji_x100f_cyber_monday_deal/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "fuji x100f cyber monday deal /!/ a few major retailers are selling brand new fuji x100f’s for $750 today. can you please talk me in or out of this purchase? \n\ni already use an x-t2 as my primary camera, but have been thinking about picking up an x100 series to use more casually on a daily basis (family, travel, street, etc). love the fuji system and have heard great things about all x100 cameras. \n\nare the upgrades on the x100v generally worth the $1400 price -----> tag !!!  vs the x100f at $750?", "sortedWord": "None", "identifyer": 10051, "year": "2020"}, {"Unnamed: 0": 216300, "autor": "maslow1", "date": 1590439938000, "content": "Is this manfrotto card a delkin rebrand? (Appears in webpage meta tag only)", "link": "https://www.reddit.com/r/Cameras/comments/gqj3jo/is_this_manfrotto_card_a_delkin_rebrand_appears/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is this manfrotto card a delkin rebrand? (appears in webpage meta -----> tag !!!  only)", "sortedWord": "None", "identifyer": 10718, "year": "2020"}], "name": "tagCameras2020"}