{"interestingcomments": [{"autor": "tacos-alpastor", "date": "2020-11-18 18:54:07", "content": "What should be my next camera? /!/ So I was introduced to the world of photography about 2 years ago. I had a friend in college that happened to have a red Nikon D3300 available, and that she offered to sell at a relatively cheap price. I had zero knowledge about cameras, lenses, brands, etc. So I agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now I know he had a Canon with even lower specs than the camera I bought - so he convinced me to go for it since it would perform just fine for the work I was doing and because of the quality/price balance I was being offered. \n\nSo now 2 years after, I've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. So I've gotta say that my friend was right, the D3300 is way more than what meets the eye. I still have the kit lens and about a year ago I bought the 85mm f1.8 lens. My photography has improved a whole lot since (I do a bit of everything: street, architecture and portrait photography).\n\nSo now that I'm a bit more experienced, I've also gotten to notice the faults the camera also possesses, for example:\n• While recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• Autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• LCD screen is fixed, also limiting the flexibility that some of the shots should have.\n\nSo now that I'm not necessarily an amateur, I've really started to think about upgrading. I don't know if I should sell all my gear to switch brands, or if I should stick with Nikon to keep the 85mm lens. The Nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one I currently have for the 85. I've checked Canon and Fujifilm cameras but I've really grown a soft spot for Nikon because of my buddy, the D3300.\n\nBottom line: I don't know what I should do next. The amount of cameras and specs still overwhelms me, so I need guidance, also, I live in a third world country (Mexico), so saving money to buy/switch gear can be a bit of a challenge. So I need something that is budget friendly.\n\nAnyway, that's about it. I'd really appreciate some feedback since I feel kinda stuck!", "link": "https://www.reddit.com/r/Nikon/comments/jwlscl/what_should_be_my_next_camera/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "what should be my next camera? /!/ so -----> i !!!  -----> was !!!  -----> introduced !!!  to the world of photography about 2 years ago. i had a friend in college that happened to have a red nikon d3300 available, and that she offered to sell at a relatively cheap price. i had zero knowledge about cameras, lenses, brands, etc. so i agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now i know he had a canon with even lower specs than the camera i bought - so he convinced me to go for it since it would perform just fine for the work i was doing and because of the quality/price balance i was being offered. \n\nso now 2 years after, i've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. so i've gotta say that my friend was right, the d3300 is way more than what meets the eye. i still have the kit lens and about a year ago i bought the 85mm f1.8 lens. my photography has improved a whole lot since (i do a bit of everything: street, architecture and portrait photography).\n\nso now that i'm a bit more experienced, i've also gotten to notice the faults the camera also possesses, for example:\n• while recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• lcd screen is fixed, also limiting the flexibility that some of the shots should have.\n\nso now that i'm not necessarily an amateur, i've really started to think about upgrading. i don't know if i should sell all my gear to switch brands, or if i should stick with nikon to keep the 85mm lens. the nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one i currently have for the 85. i've checked canon and fujifilm cameras but i've really grown a soft spot for nikon because of my buddy, the d3300.\n\nbottom line: i don't know what i should do next. the amount of cameras and specs still overwhelms me, so i need guidance, also, i live in a third world country (mexico), so saving money to buy/switch gear can be a bit of a challenge. so i need something that is budget friendly.\n\nanyway, that's about it. i'd really appreciate some feedback since i feel kinda stuck!", "sortedWord": "None", "Identifyer": null, "identifyer": 26128, "year": "2020"}, {"autor": "tylerxwright", "date": "2019-02-19 20:22:46", "content": "EOS M50 Audio Problems /!/  I've been using my M50 for vlogging in an isolated room in my house. My setup has my camera set up about 7 feet from myself. The M50 is mounted on a tripod and I have a RODE VideoMic Go running to the camera using the Rode Shielded connector. The sound I've been getting from this has been perfect for my purposes.\n\nYesterday, I decided to run a USB cable from the camera to my laptop on the desk I'm sitting behind. The usb cable is actually 2 cables linked. One is a standard usb extension and that is connected to a Samsung Usb Charging cable. I'm using the laptop for remote control. The laptop is probably 6 feet from the M50 and 2 feet from the mic. Once I introduced the USB into the setup, I've been getting a pretty significant hum in my audio. Has anyone else had issues with external mics and usb remote control? I'm assuming this is not just the M50, but I don't have access to other cameras to validate that.\n\nHere are the components at play:\n\n* Rode Stereo Mic Extension\n* Rode VideoMic Go\n* A standard USB Extension\n* A standard Micro USB Charging Cable", "link": "https://www.reddit.com/r/canon/comments/asex15/eos_m50_audio_problems/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i introduced", "selectorShort": "introduce", "MarkedSent": "eos m50 audio problems /!/  i've been using my m50 for vlogging in an isolated room in my house. my setup has my camera set up about 7 feet from myself. the m50 is mounted on a tripod and i have a rode videomic go running to the camera using the rode shielded connector. the sound i've been getting from this has been perfect for my purposes.\n\nyesterday, i decided to run a usb cable from the camera to my laptop on the desk i'm sitting behind. the usb cable is actually 2 cables linked. one is a standard usb extension and that is connected to a samsung usb charging cable. i'm using the laptop for remote control. the laptop is probably 6 feet from the m50 and 2 feet from the mic. once -----> i !!!  -----> introduced !!!  the usb into the setup, -----> i !!! 've been getting a pretty significant hum in my audio. has anyone else had issues with external mics and usb remote control? i'm assuming this is not just the m50, but i don't have access to other cameras to validate that.\n\nhere are the components at play:\n\n* rode stereo mic extension\n* rode videomic go\n* a standard usb extension\n* a standard micro usb charging cable", "sortedWord": "None", "Identifyer": null, "identifyer": 56209, "year": "2019"}, {"autor": "MeddlinQ", "date": "2020-02-13 19:16:33", "content": "Starting a photo project/story on introverts. Interested in /r/photography thoughts. /!/ Hello /r/photography.\n\nI am currently starting a new photography project/story, for which the topic will be “introverts”. As an introvert myself I have been fighting the perception of the society that introvert = asocial weird person in some shape and form for my whole life. Although the situation gets better lately I still think a lot of people are (or at least feel) forced to act extroverted which eventually leads to psychical exhaustion and burnout.\n\nI don’t think there is anything wrong in being an introvert. I love people, I just pick and choose the company of the few I really like over large gatherings. I don’t mind speaking up when I have an opiniom, I just prefer to be silent when I don’t. Last but not least, being alone (not to be confused with being lonely) from time to time is a very enjoyable thing for me as these are the moments when my social batteries recharge.\n\nI’d love to introduce introverts to people who might not understand us or our behaviour well and what better way to do that as a photographer than using our universal artsy language. I have some ideas but I would be interested in your opinions about what would you expect from this project, what this photo story should have so you (YOU personally) would enjoy it.\n\nThe general outline would be - black and white (as the emotions are the real subject here) and mix of candid street photography and dedicated portraits.\n\nI plan to show solitary people having good time, people lost in thoughts, people who are necesarilly not looking enjoying a big company and similar topics.\n\nIf you don’t mind spending few moments on me, what would make YOU interested in that topic?", "link": "https://www.reddit.com/r/photography/comments/f3f5nd/starting_a_photo_projectstory_on_introverts/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’d love to introduce", "selectorShort": "introduce", "MarkedSent": "starting a photo project/story on introverts. interested in /r/photography thoughts. /!/ hello /r/photography.\n\ni am currently starting a new photography project/story, for which the topic will be “introverts”. as an introvert myself i have been fighting the perception of the society that introvert = asocial weird person in some shape and form for my whole life. although the situation gets better lately i still think a lot of people are (or at least feel) forced to act extroverted which eventually leads to psychical exhaustion and burnout.\n\ni don’t think there is anything wrong in being an introvert. i love people, i just pick and choose the company of the few i really like over large gatherings. i don’t mind speaking up when i have an opiniom, i just prefer to be silent when i don’t. last but not least, being alone (not to be confused with being lonely) from time to time is a very enjoyable thing for me as these are the moments when my social batteries recharge.\n\n-----> i !!! -----> ’d !!!  -----> love !!!  -----> to !!!  -----> introduce !!!  introverts -----> to !!!  people who might not understand us or our behaviour well and what better way -----> to !!!  do that as a photographer than using our universal artsy language. i have some ideas but i would be interested in your opinions about what would you expect from this project, what this photo story should have so you (you personally) would enjoy it.\n\nthe general outline would be - black and white (as the emotions are the real subject here) and mix of candid street photography and dedicated portraits.\n\ni plan to show solitary people having good time, people lost in thoughts, people who are necesarilly not looking enjoying a big company and similar topics.\n\nif you don’t mind spending few moments on me, what would make you interested in that topic?", "sortedWord": "None", "Identifyer": null, "identifyer": 62197, "year": "2020"}, {"autor": "AmberSteak", "date": "2020-06-14 17:20:32", "content": "First outdoor event coming up, nervous /!/ Have my first event coming up, its a block party for Juneteenth. Any tips? or stories you guys have from your first event? This block party will have venders should I introduce myself  to them or just shoot them like the rest?", "link": "https://www.reddit.com/r/photography/comments/h8xr2t/first_outdoor_event_coming_up_nervous/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "first outdoor event coming up, nervous /!/ have my first event coming up, its a block party for juneteenth. any tips? or stories you guys have from your first event? this block party will have venders should -----> i !!!  -----> introduce !!!  myself  to them or just shoot them like the rest?", "sortedWord": "None", "Identifyer": null, "identifyer": 69807, "year": "2020"}, {"autor": "ccurzio", "date": "2020-07-24 19:23:09", "content": "Photography Lost &amp; Found (Late 2020) /!/ For earlier submissions, please see the [previous Lost &amp; Found post](https://www.reddit.com/r/photography/comments/emyn4y/photography_lost_found_early_2020//).\n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item(s) here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/hx87hh/photography_lost_found_late_2020/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (late 2020) /!/ for earlier submissions, please see the [previous lost &amp; found post](https://www.reddit.com/r/photography/comments/emyn4y/photography_lost_found_early_2020//).\n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item(s) here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 71852, "year": "2020"}, {"autor": "AutoModerator", "date": "2020-01-02 13:57:08", "content": "Photography Lost &amp; Found 2020 /!/ Photography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item(s) here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/eiyj0t/photography_lost_found_2020/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found 2020 /!/ photography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item(s) here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 77045, "year": "2020"}, {"autor": "ccurzio", "date": "2020-01-10 22:51:28", "content": "Photography Lost &amp; Found (Early 2020) /!/ For earlier submissions, please see the [previous Lost &amp; Found post](https://www.reddit.com/r/photography/comments/d5zzbh/photography_lost_found_late_2019/).\n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item(s) here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/emyn4y/photography_lost_found_early_2020/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (early 2020) /!/ for earlier submissions, please see the [previous lost &amp; found post](https://www.reddit.com/r/photography/comments/d5zzbh/photography_lost_found_late_2019/).\n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item(s) here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 77304, "year": "2020"}, {"autor": "OMARAHMED_AMER", "date": "2020-05-01 05:13:10", "content": "LET ME INTRODUCE TO YOU THE GREAT CAIRO", "link": "https://www.reddit.com/r/photography/comments/gbc4sj/let_me_introduce_to_you_the_great_cairo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "let -----> me !!!  -----> introduce !!!  to you the great cairo", "sortedWord": "None", "Identifyer": null, "identifyer": 88242, "year": "2020"}, {"autor": "justindustin", "date": "2021-03-30 14:06:41", "content": "Concerns Over Licensing and Pricing /!/ Let me introduce myself and my situation. I’m a semi-professional photographer (read: not my day job) who specializes in live events, architectural, and specialty photography. Most of my work is within my local city for private businesses and the city government itself. The use of my images is primarily for marketing purposes and centers around social media use and promotion of the businesses and events for those who hire me.\n\nRecently a “large corporate entity” (not to be named) has begun a campaign to advertise their presence in the city and is showcasing a lot of the businesses and events found here using some familiar images. I am fairly certain they obtained those images from the city, who originally hired me to to photograph them, even though I have a clause in my contract that limits use beyond the original licensee (no sub-licensing). The good news is that I’ve been put in touch with this larger entity and they are asking to directly license several images for use, and these include the photos that have already been shared on social media. (Yeah, I’m a little concerned that this happened in reverse though I’m not going to ruin a good relationship and I’m glad to have a proper path forward.)\n\nThat said, I am no stranger to licensing my images for various purposes though that is usually to a distinct person or entity for a very specific use. Also, I’ve provided images for exclusive use before, but not for the broad description that has been provided in the corporate contract I’m now reviewing. Here are the primary concerns I have over the terms and there are questions that I feel need to be brought up with this corporate entity before I can fulfill their request:\n\n1. I am the copyright holder of the images and owner of the images, though I still need to ensure the images will not violate the rights of any third party. Since all of the images to be licensed were created at public events I do not have model releases, even for stage performers. The chosen images do (or will) have crowd faces blurred as the people are not the sole subject, the ambiance of the event is what’s being used. I feel I may have to decline the performer images unless I can get a release from them if I can track down a contact. Is there anything I’m missing in this scenario that would pose a problem? I feel there is enough precedence regarding “reasonable expectation of privacy” and the voluntary presence at a public event that puts participants in a position of implicitly giving consent by their attendance.\n2. The requesting entity is asking for an “unlimited, perpetual, exclusive, irrevocable worldwide license to distribute, publicly display, alter, edit, retouch and create derivative works”. For the most part I don’t have an issue with this—the images are not on their own of any monetary value beyond what was already paid to capture them. Aside from my own portfolio, the contract does state that I cannot license the works to any other parties. However, there are a few which have already been licensed by other (or original) entities or I consider released as public domain (meaning enough people have stolen one image that I don’t have the time or energy to go after compensation). Does prior licensing exclude me from granting an exclusive license going forward—or should I simply inform the requesting entity and have them make the determination of whether they wish to proceed with certain images?\n3. The requesting entity intends to use the images for marketing and advertising purposes in digital and print media, and/or prints for framed photographs. There used to be a pricing calculator on Getty’s website, but they seem to have caught on to folks using it for free and now it just prompts you to call them for more info. How does one determine a fair and reasonable licensing price for mixed distribution when the usage seems open-ended? Should I just invest in some more trustworthy software to help get me in a ballpark range?\n\nSo my main concerns are fair pricing and obtaining releases. Are there any other concerns that I might need to consider based on the conditions above?", "link": "https://www.reddit.com/r/photography/comments/mggu99/concerns_over_licensing_and_pricing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "concerns over licensing and pricing /!/ let -----> me !!!  -----> introduce !!!  myself and my situation. i’m a semi-professional photographer (read: not my day job) who specializes in live events, architectural, and specialty photography. most of my work is within my local city for private businesses and the city government itself. the use of my images is primarily for marketing purposes and centers around social media use and promotion of the businesses and events for those who hire me.\n\nrecently a “large corporate entity” (not to be named) has begun a campaign to advertise their presence in the city and is showcasing a lot of the businesses and events found here using some familiar images. i am fairly certain they obtained those images from the city, who originally hired me to to photograph them, even though i have a clause in my contract that limits use beyond the original licensee (no sub-licensing). the good news is that i’ve been put in touch with this larger entity and they are asking to directly license several images for use, and these include the photos that have already been shared on social media. (yeah, i’m a little concerned that this happened in reverse though i’m not going to ruin a good relationship and i’m glad to have a proper path forward.)\n\nthat said, i am no stranger to licensing my images for various purposes though that is usually to a distinct person or entity for a very specific use. also, i’ve provided images for exclusive use before, but not for the broad description that has been provided in the corporate contract i’m now reviewing. here are the primary concerns i have over the terms and there are questions that i feel need to be brought up with this corporate entity before i can fulfill their request:\n\n1. i am the copyright holder of the images and owner of the images, though i still need to ensure the images will not violate the rights of any third party. since all of the images to be licensed were created at public events i do not have model releases, even for stage performers. the chosen images do (or will) have crowd faces blurred as the people are not the sole subject, the ambiance of the event is what’s being used. i feel i may have to decline the performer images unless i can get a release from them if i can track down a contact. is there anything i’m missing in this scenario that would pose a problem? i feel there is enough precedence regarding “reasonable expectation of privacy” and the voluntary presence at a public event that puts participants in a position of implicitly giving consent by their attendance.\n2. the requesting entity is asking for an “unlimited, perpetual, exclusive, irrevocable worldwide license to distribute, publicly display, alter, edit, retouch and create derivative works”. for the most part i don’t have an issue with this—the images are not on their own of any monetary value beyond what was already paid to capture them. aside from my own portfolio, the contract does state that i cannot license the works to any other parties. however, there are a few which have already been licensed by other (or original) entities or i consider released as public domain (meaning enough people have stolen one image that i don’t have the time or energy to go after compensation). does prior licensing exclude me from granting an exclusive license going forward—or should i simply inform the requesting entity and have them make the determination of whether they wish to proceed with certain images?\n3. the requesting entity intends to use the images for marketing and advertising purposes in digital and print media, and/or prints for framed photographs. there used to be a pricing calculator on getty’s website, but they seem to have caught on to folks using it for free and now it just prompts you to call them for more info. how does one determine a fair and reasonable licensing price for mixed distribution when the usage seems open-ended? should i just invest in some more trustworthy software to help get me in a ballpark range?\n\nso my main concerns are fair pricing and obtaining releases. are there any other concerns that i might need to consider based on the conditions above?", "sortedWord": "None", "Identifyer": null, "identifyer": 98409, "year": "2021"}, {"autor": "ccurzio", "date": "2019-01-02 13:09:02", "content": "Photography Lost &amp; Found (2019) /!/ Photography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/abt9bh/photography_lost_found_2019/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (2019) /!/ photography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 5019, "year": "2019"}, {"autor": "zladuric", "date": "2021-07-29 21:06:34", "content": "Lenses for beginner 7-year-old photographers /!/ Well, that was probably the most unhelpful google search results. \"Camera/lens for a kid photographer\". I don't want to photograph them, I want _them to photograph me_, dear Google!\n\nAnyway, as the title and my attempt at humor state, what would be a good lens for a beginner photographer who is seven years old, on a m43 system?\n\nPrime would likely be lighter and simpler to figure out, right? They just go around on full auto and shoot, and if it grows on them, we can see about more stuff.\n\nWhat focal length though? Something wider so they can just snap at anything without thought? Easier, but not always awesome results (if you're shooting an ant or something). Or maybe a bit longer prime, so they actually need to think a second about the framing? Better results, but takes more effort so they may not like it as much?\n\nOn the other hand, they see me changing lenses, zooming and similar (\"WOW! DID YOU SEE HOW BIG THAT LENS IS?\"), so they may want to play with a zoom like that. If they do, I can _lend_ them my camera to try and if the interest grows, we can get a zoom for them as well.\n\nBackground: I have twin 7-yo boys. I'd like to introduce them to photography (they already ask me sometimes to try to photograph something with my camera). Nothing serious like making them serious - just expose them a bit more to the experience and maybe help them learn a thing or two about light and perspective.\n\nI also have a spare Lumix GF2 but no lens. So I thought I'd just give them a lens and we can go on a few hikes over the summer and snap flowers and mountains together. Now I'm looking for a prime - I'm leaning towards the 20mm pancake the most - to help them get started.\n\nAny experiences to share or suggestions to make?", "link": "https://www.reddit.com/r/photography/comments/ou6cxz/lenses_for_beginner_7yearold_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'd like to introduce", "selectorShort": "introduce", "MarkedSent": "lenses for beginner 7-year-old photographers /!/ well, that was probably the most unhelpful google search results. \"camera/lens for a kid photographer\". i don't want to photograph them, i want _them to photograph me_, dear google!\n\nanyway, as the title and my attempt at humor state, what would be a good lens for a beginner photographer who is seven years old, on a m43 system?\n\nprime would likely be lighter and simpler to figure out, right? they just go around on full auto and shoot, and if it grows on them, we can see about more stuff.\n\nwhat focal length though? something wider so they can just snap at anything without thought? easier, but not always awesome results (if you're shooting an ant or something). or maybe a bit longer prime, so they actually need to think a second about the framing? better results, but takes more effort so they may not like it as much?\n\non the other hand, they see me changing lenses, zooming and similar (\"wow! did you see how big that lens is?\"), so they may want to play with a zoom like that. if they do, i can _lend_ them my camera to try and if the interest grows, we can get a zoom for them as well.\n\nbackground: i have twin 7-yo boys. -----> i !!! -----> 'd !!!  -----> like !!!  -----> to !!!  -----> introduce !!!  them -----> to !!!  photography (they already ask me sometimes -----> to !!!  try -----> to !!!  photograph something with my camera). nothing serious like making them serious - just expose them a bit more to the experience and maybe help them learn a thing or two about light and perspective.\n\ni also have a spare lumix gf2 but no lens. so i thought i'd just give them a lens and we can go on a few hikes over the summer and snap flowers and mountains together. now i'm looking for a prime - i'm leaning towards the 20mm pancake the most - to help them get started.\n\nany experiences to share or suggestions to make?", "sortedWord": "None", "Identifyer": null, "identifyer": 2566, "year": "2021"}, {"autor": "pranjallk1995", "date": "2021-10-28 02:50:52", "content": "Professional photographers will have a hard time in future and is a dying art. /!/ Hi,\n\nI would want to know your opinions on this topic, \"Professional photographers will have a hard time in future\". And I would go one step beyond and even claim that it is soon going to die.\n\nLet me explain my point of view and why I believe so. I will start with some trivial reasons and then move on the main reason in the latter half of this discussion post. \n\nFirst of all I am really worried with the advancement in camera technology happening these days and it getting cheaper and more accessible every day. There are so many hobbyist (like me) that are coming up due to this and they like to take their pictures themselves. They don't need a lot of fancy gear and can get what they want even from their smartphones and software techniques without much pain. There are already cameras in smartphones that can open up to f/1.4 (Vivo X60 pro) giving tremendous low light performance for example. So be it, but the most worrisome part is that they are ready to sell their pictures (again like me) for peanuts. I for example sell my photos for less than a dollar per picture. May be this doesn't pose a lot of threat to professionals but keep up with me.\n\nNext issue that I would like to point out is that of websites like unsplash and pexels. People including some top notch photographers post their pictures here for free. Individuals and more importantly major companies/industries now have an access to large amount of stock photos for free! I myself was shocked to see my photos reaching far and wide to websites like Buzzfeed, WordPress, Flickr etc and I gained nothing in return apart from come graphs and stats showing my reach, views and downloads.\n\nAll these things are eating up the photography market from inside out like a parasite I believe. But as if this was not enough, let me introduce you to GANs (Generative Adversarial Networks). So far you might be wondering that there is still scope for specialization in fields like weddings, fashion, product, food, landscape, wildlife, portraits etc. If so, then I request you to kindly read further into this discussion.\n\nGANs are a deep learning based set of algorithm that can literally do magic. They will change the dynamics completely. **Photos will soon be created** (not taken). Once trained against a large set of database (which is available for free as mentioned before), they can make new photos. restore old photos, include what you want in a scene (like yourself), replace something that you want in a scene and what not!\n\nSome applications already available are:\n\n* Generation of random realistic portraits/models completely wiping out fashion photography.\n* Generation of cartoon characters, wiping out graphics/vector designers.\n* Image to image translation. (restoring old photos as high definition new photos, black and white to color images, sketches to realistic images)\n* Text to image translation. wiping out landscape/wildlife photography. (literally converting text like, \"A small Indian ringneck sitting on a branch\" into multiple image choices.)\n* Face repositioning and regeneration. (generate/reorient a face into required position)\n\nGANs are no joke. The results are already staggering. You must have seen deepfake challenges inviting you to find the difference between fake and original images.\n\n I would like to know your thoughts on it. Are you concerned? or things are not as grim as I portray. These GANs are only gonna get better with time.", "link": "https://www.reddit.com/r/photography/comments/qhd7zr/professional_photographers_will_have_a_hard_time/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "professional photographers will have a hard time in future and is a dying art. /!/ hi,\n\ni would want to know your opinions on this topic, \"professional photographers will have a hard time in future\". and i would go one step beyond and even claim that it is soon going to die.\n\nlet me explain my point of view and why i believe so. i will start with some trivial reasons and then move on the main reason in the latter half of this discussion post. \n\nfirst of all i am really worried with the advancement in camera technology happening these days and it getting cheaper and more accessible every day. there are so many hobbyist (like me) that are coming up due to this and they like to take their pictures themselves. they don't need a lot of fancy gear and can get what they want even from their smartphones and software techniques without much pain. there are already cameras in smartphones that can open up to f/1.4 (vivo x60 pro) giving tremendous low light performance for example. so be it, but the most worrisome part is that they are ready to sell their pictures (again like me) for peanuts. i for example sell my photos for less than a dollar per picture. may be this doesn't pose a lot of threat to professionals but keep up with me.\n\nnext issue that i would like to point out is that of websites like unsplash and pexels. people including some top notch photographers post their pictures here for free. individuals and more importantly major companies/industries now have an access to large amount of stock photos for free! i myself was shocked to see my photos reaching far and wide to websites like buzzfeed, wordpress, flickr etc and i gained nothing in return apart from come graphs and stats showing my reach, views and downloads.\n\nall these things are eating up the photography market from inside out like a parasite i believe. but as if this was not enough, let -----> me !!!  -----> introduce !!!  you to gans (generative adversarial networks). so far you might be wondering that there is still scope for specialization in fields like weddings, fashion, product, food, landscape, wildlife, portraits etc. if so, then i request you to kindly read further into this discussion.\n\ngans are a deep learning based set of algorithm that can literally do magic. they will change the dynamics completely. **photos will soon be created** (not taken). once trained against a large set of database (which is available for free as mentioned before), they can make new photos. restore old photos, include what you want in a scene (like yourself), replace something that you want in a scene and what not!\n\nsome applications already available are:\n\n* generation of random realistic portraits/models completely wiping out fashion photography.\n* generation of cartoon characters, wiping out graphics/vector designers.\n* image to image translation. (restoring old photos as high definition new photos, black and white to color images, sketches to realistic images)\n* text to image translation. wiping out landscape/wildlife photography. (literally converting text like, \"a small indian ringneck sitting on a branch\" into multiple image choices.)\n* face repositioning and regeneration. (generate/reorient a face into required position)\n\ngans are no joke. the results are already staggering. you must have seen deepfake challenges inviting you to find the difference between fake and original images.\n\n i would like to know your thoughts on it. are you concerned? or things are not as grim as i portray. these gans are only gonna get better with time.", "sortedWord": "None", "Identifyer": null, "identifyer": 3834, "year": "2021"}, {"autor": "ccurzio", "date": "2021-03-04 13:00:08", "content": "Photography Lost &amp; Found (Early 2021) /!/ For earlier submissions, please see the [previous Lost &amp; Found post](https://www.reddit.com/r/photography/comments/hx87hh/photography_lost_found_late_2020/).\n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nLOST &amp; FOUND ITEM TEMPLATE\n\nWhen you lose or find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND/LOST:** Put the name of the lost or found item(s) here.\n\n**LOCATION FOUND/LOST:** Put the location of where you found or lost the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND/LOST:** The approximate date and time you found or lost the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/lxjxlp/photography_lost_found_early_2021/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (early 2021) /!/ for earlier submissions, please see the [previous lost &amp; found post](https://www.reddit.com/r/photography/comments/hx87hh/photography_lost_found_late_2020/).\n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nlost &amp; found item template\n\nwhen you lose or find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found/lost:** put the name of the lost or found item(s) here.\n\n**location found/lost:** put the location of where you found or lost the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found/lost:** the approximate date and time you found or lost the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 5538, "year": "2021"}, {"autor": "Sabi-95", "date": "2021-04-25 09:16:22", "content": "Losing interest and motivation from photography /!/ Hello guys ! hope you’re all good and safe. I know this kind of question has been posted a lot there, and i’m very sorry for that. \n\nFirst of all let me introduce myself, I’m Sabi, i’m 19 years old and I’m from Paris. So I mainly shoot football (soccer), portraits and landscapes sometimes on both digital and film.\n\nI’ve been enjoying photography a lot, it helped to go through the strange times that we all had during this pandemic. \n\nHowever lately, I’ve requested few accreditation to shoot some games and they all have been declined and because of this, my motivation and inspiration has been gone, I literally wanna stop everything, I know it’s overreaction, but still it makes me doubting about my work that i’ve been doing. \n\nI’m seeing people getting opportunities and stuff and i’m here getting nothing, of course everyone has their own time zone to shine, but i’m still doubting about everything…\n\nHave you guys ever experienced this ? If yes, what was your process in order to overcome this ? \n\nThanks a lot! (sorry for my bad english)", "link": "https://www.reddit.com/r/photography/comments/my4mqy/losing_interest_and_motivation_from_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "losing interest and motivation from photography /!/ hello guys ! hope you’re all good and safe. i know this kind of question has been posted a lot there, and i’m very sorry for that. \n\nfirst of all let -----> me !!!  -----> introduce !!!  myself, i’m sabi, i’m 19 years old and i’m from paris. so i mainly shoot football (soccer), portraits and landscapes sometimes on both digital and film.\n\ni’ve been enjoying photography a lot, it helped to go through the strange times that we all had during this pandemic. \n\nhowever lately, i’ve requested few accreditation to shoot some games and they all have been declined and because of this, my motivation and inspiration has been gone, i literally wanna stop everything, i know it’s overreaction, but still it makes me doubting about my work that i’ve been doing. \n\ni’m seeing people getting opportunities and stuff and i’m here getting nothing, of course everyone has their own time zone to shine, but i’m still doubting about everything…\n\nhave you guys ever experienced this ? if yes, what was your process in order to overcome this ? \n\nthanks a lot! (sorry for my bad english)", "sortedWord": "None", "Identifyer": null, "identifyer": 6358, "year": "2021"}, {"autor": "Mila_Stan", "date": "2021-04-27 20:12:09", "content": "Terrifying but beautiful: We are introducing you to the most impressive volcanoes on Earth | Survbible", "link": "https://www.reddit.com/r/photography/comments/mzxfs9/terrifying_but_beautiful_we_are_introducing_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "terrifying but beautiful: -----> we !!!  -----> are !!!  -----> introducing !!!  you to the most impressive volcanoes on earth | survbible", "sortedWord": "None", "Identifyer": null, "identifyer": 6448, "year": "2021"}, {"autor": "bbppbbpp", "date": "2021-05-11 16:12:05", "content": "A Photographer Friend is Taking Clients /!/ Wanted to post this here because I’m hoping to get some advice and feedback. I live in a very saturated market, and I’m friends with quite a few photographers. I have one friend in particular who is relatively new to the business, but she’s very talented and does a similar type of photography to me. There have been a couple instances over the past year where I have noticed that she has taken some of my business, clients who have used me in the past have now used her, and I was left to assume initially that it had to do with the fact that she was priced lower than me. Recently I learned that one of my closest friends hired her after she ran a promotion for a Mother’s Day event. This also happens to be a friend I recently introduced to my photographer friend, and they’ve been spending more time together lately. This close friend has hired me for several years, and I’ve also done several Photography favors for her family. I know that I don’t own my clients and they can hire whomever they want, but I can’t say it doesn’t sting. I’m feeling conflicted for the following reasons: First, since I introduced my Photographer friend to this person I am feeling kinda icky about how this session came to be in the first place. I’m curious if she is proactively pursuing my friends as clients now, attempting to get them to switch to her. Second, my feelings are hurt when it comes to my close friend. Again, I know I don’t own anyone, but I would’ve appreciated a heads up or something. How would you handle something like this? Am I being irrational? I know my ego is bruised, this industry can sometimes be really tough.", "link": "https://www.reddit.com/r/photography/comments/na0m9m/a_photographer_friend_is_taking_clients/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently introduced", "selectorShort": "introduce", "MarkedSent": "a photographer friend is taking clients /!/ wanted to post this here because i’m hoping to get some advice and feedback. i live in a very saturated market, and i’m friends with quite a few photographers. i have one friend in particular who is relatively new to the business, but she’s very talented and does a similar type of photography to me. there have been a couple instances over the past year where i have noticed that she has taken some of my business, clients who have used me in the past have now used her, and i was left to assume initially that it had to do with the fact that she was priced lower than me. recently i learned that one of my closest friends hired her after she ran a promotion for a mother’s day event. this also happens to be a friend -----> i !!!  -----> recently !!!  -----> introduced !!!  to my photographer friend, and they’ve been spending more time together lately. this close friend has hired me for several years, and i’ve also done several photography favors for her family. i know that i don’t own my clients and they can hire whomever they want, but i can’t say it doesn’t sting. i’m feeling conflicted for the following reasons: first, since i introduced my photographer friend to this person i am feeling kinda icky about how this session came to be in the first place. i’m curious if she is proactively pursuing my friends as clients now, attempting to get them to switch to her. second, my feelings are hurt when it comes to my close friend. again, i know i don’t own anyone, but i would’ve appreciated a heads up or something. how would you handle something like this? am i being irrational? i know my ego is bruised, this industry can sometimes be really tough.", "sortedWord": "None", "Identifyer": null, "identifyer": 6703, "year": "2021"}, {"autor": "IGoregrinder", "date": "2021-02-08 22:42:37", "content": "Choose a camera in 2021? /!/ Hey all. \n\nBefore asking my question, let me introduce myself : I love landscape photography, low-light photography (like astro or \"neon\") and shooting some portraits. I do a lot of videos. \n\nSeveral years ago I had to sell my Sony A7sII because I needed money (pretty hard times). \n\nNow I'm looking for a new camera, I'm considering going into the mirrorless world again mainly because of the massive tools that these cameras got. \n\nI was pretty disappointed of the A7sII, especially on the lenses. So I don't want to go with sony again. I used to work on Canon too so I was considering the Canon EOS R. \n\nBuuuuuuut! I heard of the Nikon Z6 which seems to be a serious contender. I'm interested in Fuji cams too but i heard these cameras are not so good in low light photography so, uh. Idk. \n\nSo here's my options : \n\nCanon EOS R - Looking really good, plus canon EF lenses are still widely used in cinemas so I could use them on a RED or Blackmagic Camera. \n\nNikon Z6 - I never really used Nikon but it look really good especially on the price range and seems really better than the EOS R on portrait or low light\n\nFuji X-T4 - Never used Fuji, I love the \"natural\" look we can get but it's APS-C, don't really familiar with that and bad on portrait/low-light.\n\nWhat do you think ? Are you one of these camera user ? Share your work and help me choose my new pokémon ! : D \n\n&amp;#x200B;\n\nCya", "link": "https://www.reddit.com/r/photography/comments/lfnzdi/choose_a_camera_in_2021/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "choose a camera in 2021? /!/ hey all. \n\nbefore asking my question, let -----> me !!!  -----> introduce !!!  myself : i love landscape photography, low-light photography (like astro or \"neon\") and shooting some portraits. i do a lot of videos. \n\nseveral years ago i had to sell my sony a7sii because i needed money (pretty hard times). \n\nnow i'm looking for a new camera, i'm considering going into the mirrorless world again mainly because of the massive tools that these cameras got. \n\ni was pretty disappointed of the a7sii, especially on the lenses. so i don't want to go with sony again. i used to work on canon too so i was considering the canon eos r. \n\nbuuuuuuut! i heard of the nikon z6 which seems to be a serious contender. i'm interested in fuji cams too but i heard these cameras are not so good in low light photography so, uh. idk. \n\nso here's my options : \n\ncanon eos r - looking really good, plus canon ef lenses are still widely used in cinemas so i could use them on a red or blackmagic camera. \n\nnikon z6 - i never really used nikon but it look really good especially on the price range and seems really better than the eos r on portrait or low light\n\nfuji x-t4 - never used fuji, i love the \"natural\" look we can get but it's aps-c, don't really familiar with that and bad on portrait/low-light.\n\nwhat do you think ? are you one of these camera user ? share your work and help me choose my new pokémon ! : d \n\n&amp;#x200b;\n\ncya", "sortedWord": "None", "Identifyer": null, "identifyer": 12284, "year": "2021"}, {"autor": "Jagrmeister_68", "date": "2021-07-17 17:40:22", "content": "New show to check out if available in your area... Icon- Music Through the Lens /!/ [Icon- Music through the Lens](https://www.sky.com/watch/title/series/21b342e0-211d-4e2b-ba59-9a6c551a74ff/icon-music-through-the-lens/episodes/season-1)  \n\n\n Takes viewers on a fascinating journey through the history and cultural impact of music photography.\n\n**Season 1, Episode 01 –**  “On Camera”  \n What defines an iconic image? This question provides the central theme  for episode one as we are introduced to some of music photography’s  greatest names.", "link": "https://www.reddit.com/r/photography/comments/om8w6h/new_show_to_check_out_if_available_in_your_area/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introduced", "selectorShort": "introduce", "MarkedSent": "new show to check out if available in your area... icon- music through the lens /!/ [icon- music through the lens](https://www.sky.com/watch/title/series/21b342e0-211d-4e2b-ba59-9a6c551a74ff/icon-music-through-the-lens/episodes/season-1)  \n\n\n takes viewers on a fascinating journey through the history and cultural impact of music photography.\n\n**season 1, episode 01 –**  “on camera”  \n what defines an iconic image? this question provides the central theme  for episode one as -----> we !!!  -----> are !!!  -----> introduced !!!  to some of music photography’s  greatest names.", "sortedWord": "None", "Identifyer": null, "identifyer": 15456, "year": "2021"}, {"autor": "ccurzio", "date": "2021-08-16 12:52:41", "content": "Photography Lost &amp; Found (Late 2021) /!/ For earlier submissions, please see the [previous Lost &amp; Found post](https://www.reddit.com/r/photography/comments/lxjxlp/photography_lost_found_early_2021/).\n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nLOST &amp; FOUND ITEM TEMPLATE\n\nWhen you lose or find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND/LOST:** Put the name of the lost or found item(s) here.\n\n**LOCATION FOUND/LOST:** Put the location of where you found or lost the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND/LOST:** The approximate date and time you found or lost the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/p5fg8v/photography_lost_found_late_2021/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (late 2021) /!/ for earlier submissions, please see the [previous lost &amp; found post](https://www.reddit.com/r/photography/comments/lxjxlp/photography_lost_found_early_2021/).\n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nlost &amp; found item template\n\nwhen you lose or find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found/lost:** put the name of the lost or found item(s) here.\n\n**location found/lost:** put the location of where you found or lost the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found/lost:** the approximate date and time you found or lost the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 17614, "year": "2021"}, {"autor": "RyanRCline", "date": "2021-05-21 22:57:02", "content": "Allow me to introduce myself!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ni55py/allow_me_to_introduce_myself/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "me to introduce", "selectorShort": "introduce", "MarkedSent": "allow -----> me !!!  -----> to !!!  -----> introduce !!!  myself!", "sortedWord": "None", "Identifyer": null, "identifyer": 35281, "year": "2021"}, {"autor": "nothingspecialva", "date": "2021-06-06 00:28:58", "content": "my little one likes to put her toy cameras next to mine...I would love to introduce her to the Ninon world, what would be a good kid (7 years) entry camera that could last a few years?", "link": "https://www.reddit.com/r/Nikon/comments/nt9e2b/my_little_one_likes_to_put_her_toy_cameras_next/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "i would love to introduce", "selectorShort": "introduce", "MarkedSent": "my little one likes to put her toy cameras next to mine...-----> i !!!  -----> would !!!  -----> love !!!  -----> to !!!  -----> introduce !!!  her -----> to !!!  the ninon world, what -----> would !!!  be a good kid (7 years) entry camera that could last a few years?", "sortedWord": "None", "Identifyer": null, "identifyer": 50543, "year": "2021"}, {"autor": "patiszejuicebox", "date": "2020-03-12 02:41:10", "content": "50mm f2 vs 60mm 2.4 Macro? /!/ Hiya!\n\n  \nA friend of my introduced me to the Fuji system, and I'm trying to figure out my setup. I currently have a budget of $1500 and plan on getting a used XT2. In regards for the lenses, I know I want a wide angle lens such as the 23mm f2. Currently right now, I want to compliment it with a short telephoto lens, but I can't decide between the 50 f2 or the 60mm f2.4 Macro.  \n\n\nFor better reference, I shoot portraits, street, travel, occasionally landscapes, textures, and food.", "link": "https://www.reddit.com/r/fujifilm/comments/fh9e53/50mm_f2_vs_60mm_24_macro/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "my introduced", "selectorShort": "introduce", "MarkedSent": "50mm f2 vs 60mm 2.4 macro? /!/ hiya!\n\n  \na friend of -----> my !!!  -----> introduced !!!  me to the fuji system, and i'm trying to figure out -----> my !!!  setup. i currently have a budget of $1500 and plan on getting a used xt2. in regards for the lenses, i know i want a wide angle lens such as the 23mm f2. currently right now, i want to compliment it with a short telephoto lens, but i can't decide between the 50 f2 or the 60mm f2.4 macro.  \n\n\nfor better reference, i shoot portraits, street, travel, occasionally landscapes, textures, and food.", "sortedWord": "None", "Identifyer": null, "identifyer": 57142, "year": "2020"}, {"autor": "rcdenn", "date": "2020-01-21 00:13:20", "content": "New to the system (sort of) /!/ Okay, I was introduced to FujiFilm with the X100F. I have (soon to be had) a Nikon DSLR with a variety of lenses. I am selling all that and the X100F and just bought an XT20 with the 35mm and 55-200mm lenses. So I am officially invested in the system. \n\nThese lens cover almost everything I do on the Nikon. I might get the 27mm in the future for a pancake lens. And I might get the 100-400 for birds. Otherwise, I think I am set. \n\nAny recommendations on accessories, lenses (not otherwise mentioned)? Also, I am going to the beach soon. My Nikon is weather sealed, but as I said I am selling it. I was wondering your thoughts on taking the XT20 to the beach with a WR prime taking precautions such as keeping it in a sealed bag when not in use. Would it be worth getting an XT1 to use just for this purpose?\n\nI like the size of the XT20 so I don’t want to just go up to the XT2 as my sole camera. I also know my wife will like the auto switch in the XT20 for her use (she hates using the X100F or Nikon, although she loves the Fuji images).", "link": "https://www.reddit.com/r/fujifilm/comments/ermcjp/new_to_the_system_sort_of/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "new to the system (sort of) /!/ okay, -----> i !!!  -----> was !!!  -----> introduced !!!  to fujifilm with the x100f. i have (soon to be had) a nikon dslr with a variety of lenses. i am selling all that and the x100f and just bought an xt20 with the 35mm and 55-200mm lenses. so i am officially invested in the system. \n\nthese lens cover almost everything i do on the nikon. i might get the 27mm in the future for a pancake lens. and i might get the 100-400 for birds. otherwise, i think i am set. \n\nany recommendations on accessories, lenses (not otherwise mentioned)? also, i am going to the beach soon. my nikon is weather sealed, but as i said i am selling it. i was wondering your thoughts on taking the xt20 to the beach with a wr prime taking precautions such as keeping it in a sealed bag when not in use. would it be worth getting an xt1 to use just for this purpose?\n\ni like the size of the xt20 so i don’t want to just go up to the xt2 as my sole camera. i also know my wife will like the auto switch in the xt20 for her use (she hates using the x100f or nikon, although she loves the fuji images).", "sortedWord": "None", "Identifyer": null, "identifyer": 61162, "year": "2020"}, {"autor": "1726060", "date": "2018-09-30 03:14:08", "content": "Looking to go mirrorless for travel. /!/ Hi,\n\nI currently have a Canon 6D. And want to go lighter for my travels sometime soon. I own 2 canon lenses, 24 to 105L f4 and a 50 f1.4. The image quality is splendid to my liking. I do however want to go smaller because frankly I don't have enough space. I want to upgrade! (I do semi professional quality stuff) So I initially was gonna go all in when I saw the Canon M50, it was amazing how small it was, but I got the gut feeling that it wasn't the right one for me. 1. It's APSC which tbh, isn't a deal breaker, I can sacrifice that. But! I can't use my lenses, it's some weird mount. 2. It feels so cheap, that's not why you want a camera, I keep reminding myself you buy it for you to use, and it's how you use it. But at the same time, if I feel unhappy with the quality of the product I'll get so annoyed. \n\nSo I held back. So then I was like, fk it, let's check out Sony and other brands, I went to the store, tried out the M50 on my hand. Nope, it's an instant no. Too uncomfortable. I then proceeded to try the Sony A6500, dam it felt much better in the hand. Just ergonomically. And the 4k recording is just so tempting, I've watched YouTube clips and the 4k quality is just day and night with M50 VS A6500. Then I got introduced to the flippy screens, oh my God those are a deal breaker for me. It's almost like a must have. And the M50 has that! 😒😒😒😩😩😩. Then I was like the A6500 came out like 2 ish years ago, surely a new one will come out soon (guessing A6700) and I'll just get that. But the sales person proceeded to show me the A7iii 😊😊😊mmmm that thing truly goes back to what I said before. \"I want to upgrade\". So now I'm like, the A6500 and the M50 is kinda like buying the same thing as my 6d, but just smaller. The A7iii isn't much lighter than the 6d, but it is much less conspicuous, and I have to go E mount. So I'm like maybe just wait til A6700, but again I need to go away soon so Sony please announce the A6700 Soon! Then the Canon Eos R came out, ohhh loooorrrddd. So many options. The budget is $3000AUD. Probably won't be able to get the Eos R, it does have the flip screen 😑😑😑 this is killing me. \n\nSo should I go Sony A7iii, or wait for A6700 or go Canon R? 🤔 It's so hard to decide. Or just be like take the 6d with the 50mm and fk it, take pics with that. Because it's truly way too heavy to bring the 24 to 105 with me. ", "link": "https://www.reddit.com/r/Cameras/comments/9k2zg7/looking_to_go_mirrorless_for_travel/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i got introduced", "selectorShort": "introduce", "MarkedSent": "looking to go mirrorless for travel. /!/ hi,\n\ni currently have a canon 6d. and want to go lighter for my travels sometime soon. i own 2 canon lenses, 24 to 105l f4 and a 50 f1.4. the image quality is splendid to my liking. i do however want to go smaller because frankly i don't have enough space. i want to upgrade! (i do semi professional quality stuff) so i initially was gonna go all in when i saw the canon m50, it was amazing how small it was, but i got the gut feeling that it wasn't the right one for me. 1. it's apsc which tbh, isn't a deal breaker, i can sacrifice that. but! i can't use my lenses, it's some weird mount. 2. it feels so cheap, that's not why you want a camera, i keep reminding myself you buy it for you to use, and it's how you use it. but at the same time, if i feel unhappy with the quality of the product i'll get so annoyed. \n\nso i held back. so then i was like, fk it, let's check out sony and other brands, i went to the store, tried out the m50 on my hand. nope, it's an instant no. too uncomfortable. i then proceeded to try the sony a6500, dam it felt much better in the hand. just ergonomically. and the 4k recording is just so tempting, i've watched youtube clips and the 4k quality is just day and night with m50 vs a6500. then -----> i !!!  -----> got !!!  -----> introduced !!!  to the flippy screens, oh my god those are a deal breaker for me. it's almost like a must have. and the m50 has that! 😒😒😒😩😩😩. then i was like the a6500 came out like 2 ish years ago, surely a new one will come out soon (guessing a6700) and i'll just get that. but the sales person proceeded to show me the a7iii 😊😊😊mmmm that thing truly goes back to what i said before. \"i want to upgrade\". so now i'm like, the a6500 and the m50 is kinda like buying the same thing as my 6d, but just smaller. the a7iii isn't much lighter than the 6d, but it is much less conspicuous, and i have to go e mount. so i'm like maybe just wait til a6700, but again i need to go away soon so sony please announce the a6700 soon! then the canon eos r came out, ohhh loooorrrddd. so many options. the budget is $3000aud. probably won't be able to get the eos r, it does have the flip screen 😑😑😑 this is killing me. \n\nso should i go sony a7iii, or wait for a6700 or go canon r? 🤔 it's so hard to decide. or just be like take the 6d with the 50mm and fk it, take pics with that. because it's truly way too heavy to bring the 24 to 105 with me. ", "sortedWord": "None", "Identifyer": null, "identifyer": 73385, "year": "2018"}, {"autor": "ripcreator", "date": "2021-06-21 18:33:40", "content": "Buy Leica M6 /!/ Good afternoon community I want to introduce me to analogous photography and I am interested in acquiring a Leica M6, I see that this community is experts and admirers, I would like you to give me some guide to buy the team and make sure, since I can not find a place to buy Leica \n\n\nI await your response thank you very much.", "link": "https://www.reddit.com/r/Leica/comments/o520ps/buy_leica_m6/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "i want to introduce", "selectorShort": "introduce", "MarkedSent": "buy leica m6 /!/ good afternoon community -----> i !!!  -----> want !!!  -----> to !!!  -----> introduce !!!  me -----> to !!!  analogous photography and -----> i !!!  am interested in acquiring a leica m6, -----> i !!!  see that this community is experts and admirers, -----> i !!!  would like you -----> to !!!  give me some guide -----> to !!!  buy the team and make sure, since -----> i !!!  can not find a place -----> to !!!  buy leica \n\n\ni await your response thank you very much.", "sortedWord": "None", "Identifyer": null, "identifyer": 74356, "year": "2021"}, {"autor": "Undecided_media", "date": "2019-02-05 16:22:09", "content": "Do i switch to sony?(70d to a7II /!/ First things first allow me to introduce myself,\nIm a 23y/o photographer/videographer from the Netherlands that mostly shoots in \"dark\" conditions, currently in shooting with a Canon 70d.\nI was browsing around on the local marketplace like i do everyday and i came across a Sony A7II for €500 (thats a bargain right?) So now im asking myself is it worth upgrading to this body? \nSo i have some questions that hopefully you guys can awsner,\nis it treu that the A7II autofocus had a hard time tracking objects in video/photo mode? (If so is it really as bad as people make it out to be).\nIve been a canon shooter for many years so i have alot of EF/EF-S glass i know sigma made a nice adaptor but how is the AF with this adaptor?.\nAnyhow what do you thing should i upgrade to A7II or am i better of staying with a Canon 70d/80d ?\n\n(Disclaimer, sorry if there are terrible spelling mistakes in this post i have really bad dyslexia and English isn't my main tongue)\n", "link": "https://www.reddit.com/r/Cameras/comments/anfpfm/do_i_switch_to_sony70d_to_a7ii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "me to introduce", "selectorShort": "introduce", "MarkedSent": "do i switch -----> to !!!  sony?(70d -----> to !!!  a7ii /!/ first things first allow -----> me !!!  -----> to !!!  -----> introduce !!!  myself,\nim a 23y/o photographer/videographer from the netherlands that mostly shoots in \"dark\" conditions, currently in shooting with a canon 70d.\ni was browsing around on the local marketplace like i do everyday and i came across a sony a7ii for €500 (thats a bargain right?) so now im asking myself is it worth upgrading to this body? \nso i have some questions that hopefully you guys can awsner,\nis it treu that the a7ii autofocus had a hard time tracking objects in video/photo mode? (if so is it really as bad as people make it out to be).\nive been a canon shooter for many years so i have alot of ef/ef-s glass i know sigma made a nice adaptor but how is the af with this adaptor?.\nanyhow what do you thing should i upgrade to a7ii or am i better of staying with a canon 70d/80d ?\n\n(disclaimer, sorry if there are terrible spelling mistakes in this post i have really bad dyslexia and english isn't my main tongue)\n", "sortedWord": "None", "Identifyer": null, "identifyer": 76641, "year": "2019"}, {"autor": "tacos-alpastor", "date": "2020-11-18 19:05:46", "content": "Should I upgrade? /!/ So I was introduced to the world of photography about 2 years ago. I had a friend in college that happened to have a red Nikon D3300 available, and that she offered to sell at a relatively cheap price. I had zero knowledge about cameras, lenses, brands, etc. So I agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now I know he had a Canon with even lower specs than the camera I bought - so he convinced me to go for it since it would perform just fine for the work I was doing and because of the quality/price balance I was being offered. \n\nSo now 2 years after, I've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. So I've gotta say that my friend was right, the D3300 is way more than what meets the eye. I still have the kit lens and about a year ago I bought the 85mm f1.8 lens. My photography has improved a whole lot since (I do a bit of everything: street, architecture and portrait photography).\n\nSo now that I'm a bit more experienced, I've also gotten to notice the faults the camera also possesses, for example:\n• While recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• Autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• LCD screen is fixed, also limiting the flexibility that some of the shots should have.\n\nSo now that I'm not necessarily an amateur, I've really started to think about upgrading. I don't know if I should sell all my gear to switch brands, or if I should stick with Nikon to keep the 85mm lens. The Nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one I currently have for the 85. I've checked Canon and Fujifilm cameras but I've really grown a soft spot for Nikon because of my buddy, the D3300.\n\nBottom line: I don't know what I should do next. The amount of cameras and specs still overwhelms me, so I need guidance, also, I live in a third world country (Mexico), so saving money to buy/switch gear can be a bit of a challenge. So I need something that is budget friendly.\n\nAnyway, that's about it. I'd really appreciate some feedback since I feel kinda stuck!", "link": "https://www.reddit.com/r/Cameras/comments/jwm119/should_i_upgrade/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "should i upgrade? /!/ so -----> i !!!  -----> was !!!  -----> introduced !!!  to the world of photography about 2 years ago. i had a friend in college that happened to have a red nikon d3300 available, and that she offered to sell at a relatively cheap price. i had zero knowledge about cameras, lenses, brands, etc. so i agreed at the time because a friend of mine suggested that it wasn't that bad of a camera for beginner photograpers - now i know he had a canon with even lower specs than the camera i bought - so he convinced me to go for it since it would perform just fine for the work i was doing and because of the quality/price balance i was being offered. \n\nso now 2 years after, i've gotten to know my camera a whole lot better, the camera's sensor really kicks butt when used properly, those 24mpx can give me some crispy clear shots. so i've gotta say that my friend was right, the d3300 is way more than what meets the eye. i still have the kit lens and about a year ago i bought the 85mm f1.8 lens. my photography has improved a whole lot since (i do a bit of everything: street, architecture and portrait photography).\n\nso now that i'm a bit more experienced, i've also gotten to notice the faults the camera also possesses, for example:\n• while recording (or movie mode), the camera really struggles dealing with blacks and shadows, limiting my possibilities of recording in low light situations.\n• autofocus is laughable, constantly popping in and out and forcing me to simpler shots that can only be handled with manual focus.\n• lcd screen is fixed, also limiting the flexibility that some of the shots should have.\n\nso now that i'm not necessarily an amateur, i've really started to think about upgrading. i don't know if i should sell all my gear to switch brands, or if i should stick with nikon to keep the 85mm lens. the nikon z50 has been the apple of my eye as of recently, but it bothers me that the mount is different to the one i currently have for the 85. i've checked canon and fujifilm cameras but i've really grown a soft spot for nikon because of my buddy, the d3300.\n\nbottom line: i don't know what i should do next. the amount of cameras and specs still overwhelms me, so i need guidance, also, i live in a third world country (mexico), so saving money to buy/switch gear can be a bit of a challenge. so i need something that is budget friendly.\n\nanyway, that's about it. i'd really appreciate some feedback since i feel kinda stuck!", "sortedWord": "None", "Identifyer": null, "identifyer": 3764, "year": "2020"}, {"autor": "cole_8888", "date": "2020-04-23 21:04:56", "content": "Reducing wear to a mechanical shutter. /!/ I have taken up the hobby of microchip photography and I am looking to upgrade to a camera that is not a smartphone. I will be taking hundreds to thousands of photos per chip so I am concerned about the wear I will be introducing to the shutter / mirror mechanism. Luckily I will be getting a microscope adapter that will attach directly to the camera body so it will not be jostled around very often.\n\nI am probably going to be getting a Canon EOS Rebel SL3.\n\nMy question is how can I prevent additional stresses to the camera and how long should I expect it to last?", "link": "https://www.reddit.com/r/Cameras/comments/g6ux7m/reducing_wear_to_a_mechanical_shutter/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i will be introducing", "selectorShort": "introduce", "MarkedSent": "reducing wear to a mechanical shutter. /!/ i have taken up the hobby of microchip photography and i am looking to upgrade to a camera that is not a smartphone. -----> i !!!  -----> will !!!  -----> be !!!  taking hundreds to thousands of photos per chip so -----> i !!!  am concerned about the wear -----> i !!!  -----> will !!!  -----> be !!!  -----> introducing !!!  to the shutter / mirror mechanism. luckily i will be getting a microscope adapter that will attach directly to the camera body so it will not be jostled around very often.\n\ni am probably going to be getting a canon eos rebel sl3.\n\nmy question is how can i prevent additional stresses to the camera and how long should i expect it to last?", "sortedWord": "None", "Identifyer": null, "identifyer": 5741, "year": "2020"}, {"autor": "moeljills", "date": "2020-12-22 11:46:01", "content": "Pinhole lens mod problem/solution? /!/ I love the look of pinhole on video. As an effect it's super interesting and as vintage aesthetic is a big part of my look it's also very useful to me. But I am aware that the pinhole seems to suck in dust which lands on the exposed sensor. (Not good) I don't want to have to clean my sensor anymore than I absolutely have to. So my thoughts are if I introduce an optical flat somewhere in the lens it should solve this problem. \n\nHas anyone done this? How is the character of the image affected?\n\nI understand that the look of the pinhole is down to the fact that it's not a lens but a hole. And so my concern is that it would make it soft by shifting the flange slightly, I suppose it would have to be located on the light convergence point (the hole itself) to create this issue. Maybe a UV screw in filter might work??? Or is the fact that I have to use it in relatively bright circumstances going to cause internal reflection issues?\n\nWhat are your thoughts? Does anyone have experience with this problem?", "link": "https://www.reddit.com/r/Cameras/comments/ki3tb5/pinhole_lens_mod_problemsolution/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "pinhole lens mod problem/solution? /!/ i love the look of pinhole on video. as an effect it's super interesting and as vintage aesthetic is a big part of my look it's also very useful to me. but i am aware that the pinhole seems to suck in dust which lands on the exposed sensor. (not good) i don't want to have to clean my sensor anymore than i absolutely have to. so my thoughts are if -----> i !!!  -----> introduce !!!  an optical flat somewhere in the lens it should solve this problem. \n\nhas anyone done this? how is the character of the image affected?\n\ni understand that the look of the pinhole is down to the fact that it's not a lens but a hole. and so my concern is that it would make it soft by shifting the flange slightly, i suppose it would have to be located on the light convergence point (the hole itself) to create this issue. maybe a uv screw in filter might work??? or is the fact that i have to use it in relatively bright circumstances going to cause internal reflection issues?\n\nwhat are your thoughts? does anyone have experience with this problem?", "sortedWord": "None", "Identifyer": null, "identifyer": 7547, "year": "2020"}, {"autor": "rhum-Forrest-rhum", "date": "2020-08-26 21:17:23", "content": "Let me introduce you the 1934 Leitz Oleyo, a single shot camera.", "link": "https://www.reddit.com/r/Leica/comments/ih7ohw/let_me_introduce_you_the_1934_leitz_oleyo_a/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "let -----> me !!!  -----> introduce !!!  you the 1934 leitz oleyo, a single shot camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 12725, "year": "2020"}, {"autor": "greenieman", "date": "2021-05-02 01:35:39", "content": "Must try film stocks that you probably don’t hear much about? /!/ We all know the Kodak Portra series, but what are some other film stocks that are worth checking out that majority of people probably never heard of? \n\nI’ve been recently introduced to [silbersalz35](https://silbersalz35.com) by [Jason from grainydays](https://m.youtube.com/watch?v=s2x0GbH_aJc) and it feels like it’s exactly what I’ve been searching for.  It had me thinking, what other rare film stocks are worth checking out?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n2wcmj/must_try_film_stocks_that_you_probably_dont_hear/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i’ve been recently introduced", "selectorShort": "introduce", "MarkedSent": "must try film stocks that you probably don’t hear much about? /!/ we all know the kodak portra series, but what are some other film stocks that are worth checking out that majority of people probably never heard of? \n\n-----> i !!! ’ve -----> been !!!  -----> recently !!!  -----> introduced !!!  to [silbersalz35](https://silbersalz35.com) by [jason from grainydays](https://m.youtube.com/watch?v=s2x0gbh_ajc) and it feels like it’s exactly what -----> i !!! ’ve -----> been !!!  searching for.  it had me thinking, what other rare film stocks are worth checking out?", "sortedWord": "None", "Identifyer": null, "identifyer": 49179, "year": "2021"}, {"autor": "hexeter88", "date": "2021-09-17 23:36:03", "content": "(Advice appreciated) Good price on Pentax 645 w/ 75mm f/2.8? /!/ Looking to buy a Pentax 645 as my first medium format camera and found one selling for $450. Is this a good price? I’d really appreciate some advice given that I’m just introducing myself to medium format. Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pqbfc7/advice_appreciated_good_price_on_pentax_645_w/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i’m just introducing", "selectorShort": "introduce", "MarkedSent": "(advice appreciated) good price on pentax 645 w/ 75mm f/2.8? /!/ looking to buy a pentax 645 as my first medium format camera and found one selling for $450. is this a good price? -----> i !!! ’d really appreciate some advice given that -----> i !!! ’m -----> just !!!  -----> introducing !!!  myself to medium format. thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 2774, "year": "2021"}, {"autor": "Itsjustadam1", "date": "2021-07-20 21:29:12", "content": "I introduce to you, as seen in a NYC store window, the Roilecfcsk, Leicc, and Canom. This is the future of analog photography.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oobkoz/i_introduce_to_you_as_seen_in_a_nyc_store_window/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "-----> i !!!  -----> introduce !!!  to you, as seen in a nyc store window, the roilecfcsk, leicc, and canom. this is the future of analog photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 4674, "year": "2021"}, {"autor": "AnalogueOutlaw", "date": "2021-06-09 05:10:34", "content": "I introduce the Zanza Bronica S2a a 6x6 medium format art deco beauty. Can't wait to run the first roll through it! Review to come.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nvnv5m/i_introduce_the_zanza_bronica_s2a_a_6x6_medium/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "-----> i !!!  -----> introduce !!!  the zanza bronica s2a a 6x6 medium format art deco beauty. can't wait to run the first roll through it! review to come.", "sortedWord": "None", "Identifyer": null, "identifyer": 9034, "year": "2021"}, {"autor": "swaagcaat", "date": "2021-04-06 01:13:01", "content": "KODAK 16mm + SUPER 8 - HOW I WOULD INTRODUCE MYSELF", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mkzxxv/kodak_16mm_super_8_how_i_would_introduce_myself/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i would introduce", "selectorShort": "introduce", "MarkedSent": "kodak 16mm + super 8 - how -----> i !!!  -----> would !!!  -----> introduce !!!  myself", "sortedWord": "None", "Identifyer": null, "identifyer": 9143, "year": "2021"}, {"autor": "anon-ny-moose", "date": "2018-02-23 16:23:53", "content": "Facebook or Bust ? /!/ Last year I implemented a fairly successful Facebook/Gram advertising strategy. We introduced it and tweaked it until we were able to see a reliable coorelation between advert spend and booking revenue. We were getting pretty consistent bookings from successful ads. This year, I am not seeing any bookings from the same amount of ad spend and the same ad copies.\n\nI keep going back to the Zuckerberg post that says that adverts will likely not see any impact from the FB algorithm changes - but obviously something is different. \n\nHas anyone developed any successful strategies or leveraging FB and Gram in this new environment ?", "link": "https://www.reddit.com/r/photography/comments/7zp8qh/facebook_or_bust/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we introduced", "selectorShort": "introduce", "MarkedSent": "facebook or bust ? /!/ last year i implemented a fairly successful facebook/gram advertising strategy. -----> we !!!  -----> introduced !!!  it and tweaked it until -----> we !!!  were able to see a reliable coorelation between advert spend and booking revenue. we were getting pretty consistent bookings from successful ads. this year, i am not seeing any bookings from the same amount of ad spend and the same ad copies.\n\ni keep going back to the zuckerberg post that says that adverts will likely not see any impact from the fb algorithm changes - but obviously something is different. \n\nhas anyone developed any successful strategies or leveraging fb and gram in this new environment ?", "sortedWord": "None", "Identifyer": null, "identifyer": 12508, "year": "2018"}, {"autor": "man2112", "date": "2018-09-19 00:12:05", "content": "camera sensors, and the affect that reflective objects have on video framerate. /!/ hey all.\n\n&amp;#x200B;\n\nI have a generic usb powered microscope/camera (just a cheap ebay one). I've noticed that while looking at the video output, there is no stutter in framerate under normal conditions,  but if i introduce something slightly reflective (i.e. stainless steel) it will bog down and freeze.\n\n&amp;#x200B;\n\nSo my question is: in general, is it difficult for electronic sensors to process reflective items? If so, why?", "link": "https://www.reddit.com/r/photography/comments/9h09oa/camera_sensors_and_the_affect_that_reflective/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "camera sensors, and the affect that reflective objects have on video framerate. /!/ hey all.\n\n&amp;#x200b;\n\ni have a generic usb powered microscope/camera (just a cheap ebay one). i've noticed that while looking at the video output, there is no stutter in framerate under normal conditions,  but if -----> i !!!  -----> introduce !!!  something slightly reflective (i.e. stainless steel) it will bog down and freeze.\n\n&amp;#x200b;\n\nso my question is: in general, is it difficult for electronic sensors to process reflective items? if so, why?", "sortedWord": "None", "Identifyer": null, "identifyer": 16794, "year": "2018"}, {"autor": "samcornwell", "date": "2018-12-26 14:05:25", "content": "Dear film photography world. I'd like to introduce you to my one of a kind Chroma camera, KanYe. It is surely the most beautiful photographic object I have ever laid eyes on, let alone owned.", "link": "https://www.reddit.com/r/photography/comments/a9ot0v/dear_film_photography_world_id_like_to_introduce/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'd like to introduce", "selectorShort": "introduce", "MarkedSent": "dear film photography world. -----> i !!! -----> 'd !!!  -----> like !!!  -----> to !!!  -----> introduce !!!  you -----> to !!!  my one of a kind chroma camera, kanye. it is surely the most beautiful photographic object i have ever laid eyes on, let alone owned.", "sortedWord": "None", "Identifyer": null, "identifyer": 25850, "year": "2018"}, {"autor": "Drokk81", "date": "2018-09-29 21:59:33", "content": "What is your opinion about this design? /!/ Hey Guys,\n\nIm new to reddit. So I just introduce myself. Im a photographer, designer from germany. \n\nI prefer nature and street photography. Its only my hobby but I love going on photo tours in my free time.\n\nI work as a designer in a small printing company, starting last year. \n\nPerhaps you can give me your opinion about my latest work. Its a t-shirt design for photographers, so I hope you like it...\n\nHave a nice day...\n\nDaniel\n\n&amp;#x200B;\n\n*Processing img d0sf3yc929p11...*\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9k0xxk/what_is_your_opinion_about_this_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i just introduce", "selectorShort": "introduce", "MarkedSent": "what is your opinion about this design? /!/ hey guys,\n\nim new to reddit. so -----> i !!!  -----> just !!!  -----> introduce !!!  myself. im a photographer, designer from germany. \n\ni prefer nature and street photography. its only my hobby but i love going on photo tours in my free time.\n\ni work as a designer in a small printing company, starting last year. \n\nperhaps you can give me your opinion about my latest work. its a t-shirt design for photographers, so i hope you like it...\n\nhave a nice day...\n\ndaniel\n\n&amp;#x200b;\n\n*processing img d0sf3yc929p11...*\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 32102, "year": "2018"}, {"autor": "detectivejetpack", "date": "2018-10-04 03:53:32", "content": "Boudoir Photoshoot /!/ So I think my friend got screwed.\n\nTLDR; A mostly wedding photographer does Boudoir shoots on the side. Theres a long story of him being a dick and giving poor customer service, but basically she paid $3,200 for 14 photos in a little photo book (10in x 7in I think. Ish.) and he liked, didn't edit, and posted &amp; tagged her mostly negative photos on his social media against her express wishes. Help?\n\nI introduced her to him because I had met him at a Street Fest and talked about the possibility of my partner and I doing a shoot for around $1,000 or $1,200.\n\nI've since gotten through his website and has seen that he charges $3000 for weddings of 150 people or less, so he's charging her more than having to go off location lasting a lot longer.\n\nHe states in his website that all editing and photoshopping is included in cost and done in house, but he was unable to slightly smooth a crease in her neck she found unflattering and to remove a small piece of hair splayed at the wrong angle on a solid colored pillow. He tried to charge them $75 to Outsource the work (???) and sent all the pictures off to the printer in the middle of this conversation without telling them until after anyway so nothing was fixed.\n\nAfter he said he was incapable of photoshopping, my friend said 'In that case that I've taken a Photoshop class A few years ago and was pretty decent and would like to do it herself that night. He said he had no way of sending those photos. He sent the photos later that night after he'd sent them to be printed.\n\nHe also posted some of the most risque photos on his Instagram after she explicitly stated that she wants to review what pictures he picked BEFORE he posted. We have text proof.\n\nHe also AFTER ALL THIS cajoled and asked repeatedly if she would make a video praising his work and recommending him to others. She had to tell him 3 times \"No, being on video makes me extremely uncomfortable.\"\n\nBasically, we are picking up the photo book this Sunday and I want to know if she's been messed with, overcharged, or is this is standard practice for the industry.", "link": "https://www.reddit.com/r/photography/comments/9l8hft/boudoir_photoshoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i introduced", "selectorShort": "introduce", "MarkedSent": "boudoir photoshoot /!/ so i think my friend got screwed.\n\ntldr; a mostly wedding photographer does boudoir shoots on the side. theres a long story of him being a dick and giving poor customer service, but basically she paid $3,200 for 14 photos in a little photo book (10in x 7in i think. ish.) and he liked, didn't edit, and posted &amp; tagged her mostly negative photos on his social media against her express wishes. help?\n\n-----> i !!!  -----> introduced !!!  her to him because -----> i !!!  had met him at a street fest and talked about the possibility of my partner and -----> i !!!  doing a shoot for around $1,000 or $1,200.\n\ni've since gotten through his website and has seen that he charges $3000 for weddings of 150 people or less, so he's charging her more than having to go off location lasting a lot longer.\n\nhe states in his website that all editing and photoshopping is included in cost and done in house, but he was unable to slightly smooth a crease in her neck she found unflattering and to remove a small piece of hair splayed at the wrong angle on a solid colored pillow. he tried to charge them $75 to outsource the work (???) and sent all the pictures off to the printer in the middle of this conversation without telling them until after anyway so nothing was fixed.\n\nafter he said he was incapable of photoshopping, my friend said 'in that case that i've taken a photoshop class a few years ago and was pretty decent and would like to do it herself that night. he said he had no way of sending those photos. he sent the photos later that night after he'd sent them to be printed.\n\nhe also posted some of the most risque photos on his instagram after she explicitly stated that she wants to review what pictures he picked before he posted. we have text proof.\n\nhe also after all this cajoled and asked repeatedly if she would make a video praising his work and recommending him to others. she had to tell him 3 times \"no, being on video makes me extremely uncomfortable.\"\n\nbasically, we are picking up the photo book this sunday and i want to know if she's been messed with, overcharged, or is this is standard practice for the industry.", "sortedWord": "None", "Identifyer": null, "identifyer": 32354, "year": "2018"}, {"autor": "johnbro27", "date": "2021-05-12 13:41:07", "content": "It's true. I'm in love. /!/ Gotta be the real thing. \n\nFind myself slipping into daydreams about our time together during boring Zoom meetings at work. Planning things we can do; wanting to spend every spare minute together. That twitter of excitement when I remember.\n\nI *thought* I was in a committed relationship. For years my partner and I have gotten along fine. Of course there were always some disappointments, missed expectations, the usual thing. But I knew the foundation was strong and we could always survive those little mishaps. \n\nBut still, me being me, I thought, well, *maybe I should just, you know, keep my options open.*\n\nThat first date, we just went for a walk. The things you did in our first 30 minutes together frankly astonished me. You showed me things I don't think I've ever seen before, at least not quite like that. And you're so easy to get along with! Next, I introduced you to a few of my closest friends, and you got along perfectly with them! \n\nWe spent far more time together in those first weeks than I ever expected; frankly I never spent that much time with my former partner that quickly. It's been heaven. \n\nHelp me, Beloved EOS R6, because I have one big problem:\n\n**How will I break the news to my 5D Mark IV?**", "link": "https://www.reddit.com/r/canon/comments/naoxgi/its_true_im_in_love/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i introduced", "selectorShort": "introduce", "MarkedSent": "it's true. i'm in love. /!/ gotta be the real thing. \n\nfind myself slipping into daydreams about our time together during boring zoom meetings at work. planning things we can do; wanting to spend every spare minute together. that twitter of excitement when i remember.\n\ni *thought* i was in a committed relationship. for years my partner and i have gotten along fine. of course there were always some disappointments, missed expectations, the usual thing. but i knew the foundation was strong and we could always survive those little mishaps. \n\nbut still, me being me, i thought, well, *maybe i should just, you know, keep my options open.*\n\nthat first date, we just went for a walk. the things you did in our first 30 minutes together frankly astonished me. you showed me things i don't think i've ever seen before, at least not quite like that. and you're so easy to get along with! next, -----> i !!!  -----> introduced !!!  you to a few of my closest friends, and you got along perfectly with them! \n\nwe spent far more time together in those first weeks than i ever expected; frankly i never spent that much time with my former partner that quickly. it's been heaven. \n\nhelp me, beloved eos r6, because i have one big problem:\n\n**how will i break the news to my 5d mark iv?**", "sortedWord": "None", "Identifyer": null, "identifyer": 39747, "year": "2021"}, {"autor": "qqShaa", "date": "2021-02-04 09:22:58", "content": "Canon Webcam Utility using Canon EOS 700D keeps stuttering and low FPS /!/ Hello Canon users! I am sorry if this is the wrong place to ask, but I'll give it a go and hope for the best.  \n\n\nI own a Canon EOS 700D, which has been used quite little. I was introduced to Canon Webcam Utility as I do not own a webcam. My camera is able to do 60FPS videoes, which is what I would expect to get when connecting to the computer. This is not the case, and I do not understand why. Is the software not up to date yet, on my camera? Or is there any other reason as to why it does not give 60fps. I am not sue what it really gives now, but it stutters alot, not a smooth shooting...  \n\n\nHope any of you have some clearity to this, and/or have experienced some of the same things and found a solution (which could be my camera).   \n\n\nThank you!!", "link": "https://www.reddit.com/r/canon/comments/lcc0ms/canon_webcam_utility_using_canon_eos_700d_keeps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "canon webcam utility using canon eos 700d keeps stuttering and low fps /!/ hello canon users! i am sorry if this is the wrong place to ask, but i'll give it a go and hope for the best.  \n\n\ni own a canon eos 700d, which has been used quite little. -----> i !!!  -----> was !!!  -----> introduced !!!  to canon webcam utility as -----> i !!!  do not own a webcam. my camera is able to do 60fps videoes, which is what i would expect to get when connecting to the computer. this is not the case, and i do not understand why. is the software not up to date yet, on my camera? or is there any other reason as to why it does not give 60fps. i am not sue what it really gives now, but it stutters alot, not a smooth shooting...  \n\n\nhope any of you have some clearity to this, and/or have experienced some of the same things and found a solution (which could be my camera).   \n\n\nthank you!!", "sortedWord": "None", "Identifyer": null, "identifyer": 40972, "year": "2021"}, {"autor": "dantose", "date": "2021-01-05 22:36:29", "content": "Since we're doing layouts again, I'll introduce the newest member of the family.", "link": "https://www.reddit.com/r/canon/comments/kr9oj9/since_were_doing_layouts_again_ill_introduce_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i'll introduce", "selectorShort": "introduce", "MarkedSent": "since we're doing layouts again, -----> i !!! -----> 'll !!!  -----> introduce !!!  the newest member of the family.", "sortedWord": "None", "Identifyer": null, "identifyer": 41151, "year": "2021"}, {"autor": "guitarf1", "date": "2020-01-23 09:17:44", "content": "Dust under scanner glass. Okay to just ignore? - Espon V600 /!/ I noticed a few tiny dust specks that are scanned into each photo print at the same locations. Should I just work around it by using a different corner of the scanner and fix all of the scans in post? Maybe with some kind of PS script or manually? Or would it be worth the effort to try remove the dust?  \n\n\nI feel like this is common and unavoidable. Dust will eventually creep in/under the scanner. And if it isn't too big of a deal to not bother? I'm thinking that doing so might even make things worse if I introduce more dust during the attempt to remove the current dust.  \n\n\nFor getting dust off of the top glass, does using a soft brush just push more dust into the scanner?  Is it better to use a anti-static towel instead of a brush?  \n\n\nWhat are your thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/esqna3/dust_under_scanner_glass_okay_to_just_ignore/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "dust under scanner glass. okay to just ignore? - espon v600 /!/ i noticed a few tiny dust specks that are scanned into each photo print at the same locations. should i just work around it by using a different corner of the scanner and fix all of the scans in post? maybe with some kind of ps script or manually? or would it be worth the effort to try remove the dust?  \n\n\ni feel like this is common and unavoidable. dust will eventually creep in/under the scanner. and if it isn't too big of a deal to not bother? -----> i !!! 'm thinking that doing so might even make things worse if -----> i !!!  -----> introduce !!!  more dust during the attempt to remove the current dust.  \n\n\nfor getting dust off of the top glass, does using a soft brush just push more dust into the scanner?  is it better to use a anti-static towel instead of a brush?  \n\n\nwhat are your thoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 62051, "year": "2020"}, {"autor": "ConfusedMan04", "date": "2020-05-09 22:47:02", "content": "Beginner question about shutter speeds and metering /!/ I've recently introduced myself to 35mm photography with a lovely Canon FTb which uses a needle for light metering where you match the aperture (a controllable circle/ring) with the needle which bounces around in the viewfinder.\n\nThe only question is - I'm confused as to which shutter speed I'm supposed to use in certain situations. For example, in one scene, 1/1000 puts the needle in the lower portion of the meter, 1/500 in the middle, and 1/250 in the upper region of the meter, however none are at extreme ends of the meter. I can match the aperture ring with each of these, but is there a 'best' option? I can't seem to find this answer online. Would all these options yield perfect exposures? Thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ggphxj/beginner_question_about_shutter_speeds_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i've recently introduced", "selectorShort": "introduce", "MarkedSent": "beginner question about shutter speeds and metering /!/ -----> i !!! 've -----> recently !!!  -----> introduced !!!  myself to 35mm photography with a lovely canon ftb which uses a needle for light metering where you match the aperture (a controllable circle/ring) with the needle which bounces around in the viewfinder.\n\nthe only question is - i'm confused as to which shutter speed i'm supposed to use in certain situations. for example, in one scene, 1/1000 puts the needle in the lower portion of the meter, 1/500 in the middle, and 1/250 in the upper region of the meter, however none are at extreme ends of the meter. i can match the aperture ring with each of these, but is there a 'best' option? i can't seem to find this answer online. would all these options yield perfect exposures? thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 64058, "year": "2020"}, {"autor": "rfphotographystudios", "date": "2019-03-30 17:05:23", "content": "I would like to introduce Myself,", "link": "https://www.reddit.com/r/photography/comments/b7dgtb/i_would_like_to_introduce_myself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would like to introduce", "selectorShort": "introduce", "MarkedSent": "-----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> introduce !!!  myself,", "sortedWord": "None", "Identifyer": null, "identifyer": 67321, "year": "2019"}, {"autor": "WinterIstVorbei", "date": "2019-03-06 22:08:17", "content": "Recommend photographers /!/ I have recently gained an interest in photography. I am learning the basics, and experimenting with my camera.\n\nI am mainly interested in what i believe is called \"fine art photography\", by which i just mean photography as a medium of art. (It seems that it's hard to pin down what fine art photography is, but perhaps you can inform me on this matter).\n\nI honestly don't know any well known/respected/admired photographers in this genre, so i ask if any of you could inform me of \"the greats\" of fine art photography.\n\nI already admire the photos of Jean Baudrillard, but i was introduced to him through his philosophy.  ", "link": "https://www.reddit.com/r/photography/comments/ay4oqs/recommend_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "recommend photographers /!/ i have recently gained an interest in photography. i am learning the basics, and experimenting with my camera.\n\ni am mainly interested in what i believe is called \"fine art photography\", by which i just mean photography as a medium of art. (it seems that it's hard to pin down what fine art photography is, but perhaps you can inform me on this matter).\n\ni honestly don't know any well known/respected/admired photographers in this genre, so i ask if any of you could inform me of \"the greats\" of fine art photography.\n\n-----> i !!!  already admire the photos of jean baudrillard, but -----> i !!!  -----> was !!!  -----> introduced !!!  to him through his philosophy.  ", "sortedWord": "None", "Identifyer": null, "identifyer": 72777, "year": "2019"}, {"autor": "BXC4", "date": "2019-09-18 16:08:23", "content": "Photography Lost &amp; Found (Late 2019) /!/ For earlier submissions, please see the [previous Lost &amp; Found post](https://www.reddit.com/r/photography/comments/abt9bh/photography_lost_found_2019/).\n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item(s) here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/d5zzbh/photography_lost_found_late_2019/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "photography lost &amp; found (late 2019) /!/ for earlier submissions, please see the [previous lost &amp; found post](https://www.reddit.com/r/photography/comments/abt9bh/photography_lost_found_2019/).\n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item(s) here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 76222, "year": "2019"}, {"autor": "BXC4", "date": "2019-09-18 16:07:02", "content": "New Post /!/ For previous submissions, please see the [last Lost &amp; Found post](https://www.reddit.com/r/photography/comments/abt9bh/photography_lost_found_2019/). \n\nPhotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. We understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, we are introducing a yearly \"Lost and Found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nPLEASE READ THE FOLLOWING GUIDELINES CAREFULLY:\n\n1. *This is not a place for discussion of any kind.* The only comments that should appear below are comments which follow the found-item template. Any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. This is not the place to ask the community in general if anyone has found a particular item. If a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. If your item does not appear here, it is safe to say that it has not been found. \n\n3. Please be considerate. This should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an SD card filled with vacation photos or a brand new Canon camera. So please don't sell it or keep it for yourself. Post about it here.\n\n4. *Do not post serial numbers!* This is what we'll use to verify ownership. That is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nFOUND ITEM TEMPLATE\n\nWhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**ITEM FOUND:** Put the name of the found item(s) here.\n\n**LOCATION FOUND:** Put the location of where you found the item. Start with the specific physical location, followed by the city, state, and country. \n\n**TIME/DATE FOUND:** The approximate date and time you found the item. \n\n**PHOTOS:** If any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (This also should go without saying, but if you discover a camera with \"sensitive\" photos, *DO NOT POST THEM AND DO NOT KEEP THEM*.) \n\n**CONTACT:** If you want a user to contact you via direct-message on Reddit, simply link your /u/username page. Otherwise, enter whatever contact information you want. (Please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nHere's an example:\n\n---\n\n**ITEM FOUND:** Nikon D5300 with 18-55mm Lens\n\n**LOCATION FOUND:** Historic Fourth Ward Park (by the waterfall), Atlanta Georgia, United States\n\n**TIME/DATE FOUND:** Saturday, November 5, 1955 10:00 PM\n\n**PHOTOS:** https://link.to.image_host/album\n\n**CONTACT:** user@email.tld\n\n---", "link": "https://www.reddit.com/r/photography/comments/d5zymo/new_post/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we are introducing", "selectorShort": "introduce", "MarkedSent": "new post /!/ for previous submissions, please see the [last lost &amp; found post](https://www.reddit.com/r/photography/comments/abt9bh/photography_lost_found_2019/). \n\nphotography gear, by its portable nature, does run the risk of getting lost or stolen just like anything else. -----> we !!!  understand that it sucks tremendously when this happens, so in an effort to help reunite lost gear with its owners, -----> we !!!  -----> are !!!  -----> introducing !!!  a yearly \"lost and found\" post which will be permanently linked in the sidebar and link menus throughout the sub. \n\nplease read the following guidelines carefully:\n\n1. *this is not a place for discussion of any kind.* the only comments that should appear below are comments which follow the found-item template. any discussion comments or found-item comments that do not follow the template will be removed. \n\n2. this is not the place to ask the community in general if anyone has found a particular item. if a user finds a piece of gear and posts about it, they will be redirected here to comment following the template for found items. if your item does not appear here, it is safe to say that it has not been found. \n\n3. please be considerate. this should go without saying, but if you find a piece of gear, do understand that it has an owner who would really like to have it back - whether it's simply an sd card filled with vacation photos or a brand new canon camera. so please don't sell it or keep it for yourself. post about it here.\n\n4. *do not post serial numbers!* this is what we'll use to verify ownership. that is, if you find a piece of gear the owner should be able to confirm the serial number on that piece of gear to prove it's theirs. \n\nfound item template\n\nwhen you find a piece of gear, please use this template when posting a comment to add it to the lost and found. \n\n---\n**item found:** put the name of the found item(s) here.\n\n**location found:** put the location of where you found the item. start with the specific physical location, followed by the city, state, and country. \n\n**time/date found:** the approximate date and time you found the item. \n\n**photos:** if any photos were recovered along with the gear - especially if they contain photos of identifiable people - upload a small handful of them to the image host of your choice and link them here. (this also should go without saying, but if you discover a camera with \"sensitive\" photos, *do not post them and do not keep them*.) \n\n**contact:** if you want a user to contact you via direct-message on reddit, simply link your /u/username page. otherwise, enter whatever contact information you want. (please don't post a phone number unless you absolutely understand the consequences of doing so.)\n\n---\n\nhere's an example:\n\n---\n\n**item found:** nikon d5300 with 18-55mm lens\n\n**location found:** historic fourth ward park (by the waterfall), atlanta georgia, united states\n\n**time/date found:** saturday, november 5, 1955 10:00 pm\n\n**photos:** https://link.to.image_host/album\n\n**contact:** user@email.tld\n\n---", "sortedWord": "None", "Identifyer": null, "identifyer": 76223, "year": "2019"}, {"autor": "franz_jo", "date": "2019-05-27 18:03:30", "content": "Analogic or digital? /!/ Hi everyone,I'm new on this thread and I want to introduce myself with this question.\nWhich are the pro and cons of analogic photography and digital photography? I know that It sounds pretty silly but I have this question from a bit because I'm into analogic since few time (almost into Polaroid).  Thank u for the answers.", "link": "https://www.reddit.com/r/photography/comments/btp5n9/analogic_or_digital/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to introduce", "selectorShort": "introduce", "MarkedSent": "analogic or digital? /!/ hi everyone,i'm new on this thread and -----> i !!!  -----> want !!!  -----> to !!!  -----> introduce !!!  myself with this question.\nwhich are the pro and cons of analogic photography and digital photography? i know that it sounds pretty silly but i have this question from a bit because i'm into analogic since few time (almost into polaroid).  thank u for the answers.", "sortedWord": "None", "Identifyer": null, "identifyer": 84343, "year": "2019"}], "name": "Cameras2020introduce"}