{"interestingcomments": [{"autor": "thewayoftoday", "date": "2020-04-19 02:49:13", "content": "Please help me decide between the EOS R, XT-3 and GH5 (for video). /!/ Hi guys, I'm a newer filmmaker. Right now shooting with a Canon EOS M1 that I got for $150 used about 10 months ago. I actually have loved it but it's definitely not as sharp and cinematic as I'd like. Definitely time to upgrade. Already spent lots of money on green screens and lighting and LCD screens, lenses, etc. Finally time to upgrade the camera!! \n\nMy dream camera has always been the EOS R. Every time I see footage from it I just melt. It looks so good to me. The stuff coming out of the XT-3 and GH5 looks great to me as well, definitely professional quality, but it just doesn't quite capture the wowness of the EOS R. Also many of my favorite camera Youtubers use the EOS R, like Peter Mckinnon and Potato Jet, among many others. And they make great looking content.\n\nFor me I create sketch comedy almost exclusively. So, quality might not seem that important, however, I think that high quality cinematic video makes comedy funnier (like Key and Peele and The Hangover, etc.).\n\nI should also mention that I'm shooting on pretty inexpensive glass. That may limit how much the EOS R will matter.\n\nFinally, I have about $1300 to spend right now, today on a camera. The EOS R is $1600 used, so I'd have to spend a few more weeks saving up. \n\nAnd double finally, I don't care that much about the XT-3 not having a flip out screen because I already have an LCD monitor I use and I don't vlog a ton and when I do I just shoot on my phone, a Galaxy S20 which shoots great video. \n\nThanks for reading I know it's long but I'm drunk on a Saturday night in the 2020 pandemic rambling and researching cameras on like 10 Chrome tabs. Lol!", "link": "https://www.reddit.com/r/Cameras/comments/g408ho/please_help_me_decide_between_the_eos_r_xt3_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "please help me decide between the eos r, xt-3 and gh5 (for video). /!/ hi guys, i'm a newer filmmaker. right now shooting with a canon eos m1 that i got for $150 used about 10 months ago. i actually have loved it but it's definitely not as sharp and cinematic as i'd like. definitely time to upgrade. already spent lots of money on green screens and lighting and lcd screens, lenses, etc. finally time to upgrade the camera!! \n\nmy dream camera has always been the eos r. every time i see footage from it i just melt. it looks so good to me. the stuff coming out of the xt-3 and gh5 looks great to me as well, definitely professional quality, but it just doesn't quite capture the wowness of the eos r. also many of my favorite camera youtubers use the eos r, like peter mckinnon and potato jet, among many others. and they make great looking content.\n\nfor me -----> i !!!  -----> create !!!  sketch comedy almost exclusively. so, quality might not seem that important, however, i think that high quality cinematic video makes comedy funnier (like key and peele and the hangover, etc.).\n\ni should also mention that i'm shooting on pretty inexpensive glass. that may limit how much the eos r will matter.\n\nfinally, i have about $1300 to spend right now, today on a camera. the eos r is $1600 used, so i'd have to spend a few more weeks saving up. \n\nand double finally, i don't care that much about the xt-3 not having a flip out screen because i already have an lcd monitor i use and i don't vlog a ton and when i do i just shoot on my phone, a galaxy s20 which shoots great video. \n\nthanks for reading i know it's long but i'm drunk on a saturday night in the 2020 pandemic rambling and researching cameras on like 10 chrome tabs. lol!", "sortedWord": "None", "Identifyer": null, "identifyer": 1602, "year": "2020"}, {"autor": "bumbim22", "date": "2020-12-29 22:22:36", "content": "Are the Cheap Cloth Backdrops any Good for Video? /!/ Need a large backdrop to cover a wall for video, If I didn't had some nice paneling on the wall I would just paint the wall and be done with it.\n\nNeed something to hang so I can create a seamless neutral grey background.\n\nI have some vinyl/pvc backdrop which are good however it's a bit too small for what I need for this.\n\nI'm looking at these cloth backdrops,however often I see the result just look awful when someone are using them- as they are all crumpled up/bent/creased.Example:\n\n[https://images-na.ssl-images-amazon.com/images/I/71PzkGyObuL.\\_AC\\_SL1500\\_.jpg](https://images-na.ssl-images-amazon.com/images/I/71PzkGyObuL._AC_SL1500_.jpg)\n\nThey seem dirt cheap and can be had in huge sizes, however am I correct that they will most probably look awful? Anyone have had any experience with these? I can see You can get a huge one that can cover a wall for only like $10 :D\n\nWhat's up with them in real life? Any better alternative? Are the large Paper backdrops the way to go?", "link": "https://www.reddit.com/r/Cameras/comments/kmog2q/are_the_cheap_cloth_backdrops_any_good_for_video/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "are the cheap cloth backdrops any good for video? /!/ need a large backdrop to cover a wall for video, if i didn't had some nice paneling on the wall i would just paint the wall and be done with it.\n\nneed something to hang so -----> i !!!  -----> can !!!  -----> create !!!  a seamless neutral grey background.\n\ni have some vinyl/pvc backdrop which are good however it's a bit too small for what i need for this.\n\ni'm looking at these cloth backdrops,however often i see the result just look awful when someone are using them- as they are all crumpled up/bent/creased.example:\n\n[https://images-na.ssl-images-amazon.com/images/i/71pzkgyobul.\\_ac\\_sl1500\\_.jpg](https://images-na.ssl-images-amazon.com/images/i/71pzkgyobul._ac_sl1500_.jpg)\n\nthey seem dirt cheap and can be had in huge sizes, however am i correct that they will most probably look awful? anyone have had any experience with these? i can see you can get a huge one that can cover a wall for only like $10 :d\n\nwhat's up with them in real life? any better alternative? are the large paper backdrops the way to go?", "sortedWord": "None", "Identifyer": null, "identifyer": 2102, "year": "2020"}, {"autor": "Belalmondeo", "date": "2020-02-19 11:45:07", "content": "Announcement: no spam intended, I'm pleased to tell I've lately created a sub dedicated for sharing Photography Gear deals and more ! /!/ Hello !  \nIt wasn't just intended to spam this post right here, only glad wanted to announce My lately created sub for the sake of somebody looking for a good deal for a piece of gear or some deal on other piece of tech they may need or to feel free to share it along with Me on this sub which is on the following link ( [https://www.reddit.com/r/TechDealsEmpire/](https://www.reddit.com/r/TechDealsEmpire/) ).", "link": "https://www.reddit.com/r/Cameras/comments/f69ror/announcement_no_spam_intended_im_pleased_to_tell/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i've lately created", "selectorShort": "create", "MarkedSent": "announcement: no spam intended, -----> i !!! 'm pleased to tell -----> i !!! 've -----> lately !!!  -----> created !!!  a sub dedicated for sharing photography gear deals and more ! /!/ hello !  \nit wasn't just intended to spam this post right here, only glad wanted to announce my lately created sub for the sake of somebody looking for a good deal for a piece of gear or some deal on other piece of tech they may need or to feel free to share it along with me on this sub which is on the following link ( [https://www.reddit.com/r/techdealsempire/](https://www.reddit.com/r/techdealsempire/) ).", "sortedWord": "None", "Identifyer": null, "identifyer": 2552, "year": "2020"}, {"autor": "thedaniellewis", "date": "2020-02-19 10:09:39", "content": "Opinions on Sony A6400 or Sony AX53 /!/ I am currently creating footage of my martial arts content, my seminars, lessons stuff like that and I am looking to upgrade my  video setup for better quality footage and I'd like a 4k option video wise.  At the moment my footage is shot with a Note 10 plus.\n\nAs you all know the range of information is huge so I thought I'd check in here any see what you thought.\n\nAfter a few searches and looking at online feedback I was maybe considering the Sony A6400 the benefits of this are removable lenses and also the benefit of good photography options with a bit of room to grow.  When I get more practiced with the camera.\n\nHowever my hesitation is if someone else is shooting me at a gym and they are not up to speed on that kind of camera.  Hence me then considering a camcorder that is more auto friendly and can just point and shoot.  Again with a bit of searching I looked at the Sony AX53.  The benefits seem to be easy if I am just giving it to someone to record the footage but lacks a bit of growth going forward and the lack of photography options.\n\n&amp;#x200B;\n\nAny thoughts on this would be great appreciated.", "link": "https://www.reddit.com/r/Cameras/comments/f68u6d/opinions_on_sony_a6400_or_sony_ax53/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i am currently creating", "selectorShort": "create", "MarkedSent": "opinions on sony a6400 or sony ax53 /!/ -----> i !!!  -----> am !!!  -----> currently !!!  -----> creating !!!  footage of my martial arts content, my seminars, lessons stuff like that and i am looking to upgrade my  video setup for better quality footage and i'd like a 4k option video wise.  at the moment my footage is shot with a note 10 plus.\n\nas you all know the range of information is huge so i thought i'd check in here any see what you thought.\n\nafter a few searches and looking at online feedback i was maybe considering the sony a6400 the benefits of this are removable lenses and also the benefit of good photography options with a bit of room to grow.  when i get more practiced with the camera.\n\nhowever my hesitation is if someone else is shooting me at a gym and they are not up to speed on that kind of camera.  hence me then considering a camcorder that is more auto friendly and can just point and shoot.  again with a bit of searching i looked at the sony ax53.  the benefits seem to be easy if i am just giving it to someone to record the footage but lacks a bit of growth going forward and the lack of photography options.\n\n&amp;#x200b;\n\nany thoughts on this would be great appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 2553, "year": "2020"}, {"autor": "hutchkey23", "date": "2020-09-07 20:53:33", "content": "Teacher Needing Some Advice /!/ Hello, everyone! I am a high school teacher who is currently teaching remotely. I also like to create videos as a hobby, so teaching remotely hasn't necessarily been the end of the world (yet). For my lessons, I have been creating mini-skits before actually teaching. They are pretty goofy, but I enjoy making them. That being said, I am using my smartphone to record so I often run into bad audio quality and stuttering when recording. I am looking for a camera which can record at a fairly high quality and either has a good microphone or external mic support. If you have any suggests for companion microphones with a camera, I am certainly all ears!\n\n&amp;#x200B;\n\n[Here](https://drive.google.com/file/d/1epgCjo1MBqUiJk80Oa69DILpNeSJAcby/view?usp=sharing) is an example of the type of video I am creating. You can see some stuttering around the 1:35 mark. \n\n&amp;#x200B;\n\nIf anyone has any advice, I would love to hear it!", "link": "https://www.reddit.com/r/Cameras/comments/iofvmm/teacher_needing_some_advice/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i have been creating", "selectorShort": "create", "MarkedSent": "teacher needing some advice /!/ hello, everyone! i am a high school teacher who is currently teaching remotely. i also like to create videos as a hobby, so teaching remotely hasn't necessarily been the end of the world (yet). for my lessons, -----> i !!!  -----> have !!!  -----> been !!!  -----> creating !!!  mini-skits before actually teaching. they are pretty goofy, but i enjoy making them. that being said, i am using my smartphone to record so i often run into bad audio quality and stuttering when recording. i am looking for a camera which can record at a fairly high quality and either has a good microphone or external mic support. if you have any suggests for companion microphones with a camera, i am certainly all ears!\n\n&amp;#x200b;\n\n[here](https://drive.google.com/file/d/1epgcjo1mbquijk80oa69dilpnesjacby/view?usp=sharing) is an example of the type of video i am creating. you can see some stuttering around the 1:35 mark. \n\n&amp;#x200b;\n\nif anyone has any advice, i would love to hear it!", "sortedWord": "None", "Identifyer": null, "identifyer": 3420, "year": "2020"}, {"autor": "turkeypr0", "date": "2020-02-15 15:58:11", "content": "I would like to buy a camera and i don't know where to start /!/ So I'm an artist and a cook. I create a lot of art (traditional included) and dishes and I would like to be able to take close-up pictures of them; I don't want anything fancy, just something that's better than my shit phone camera. I was thinking maybe something under 250-300 usd. No fancy zoom-ins, effects, nature shots, or other functions; I just want clean, close pictures of my stuff.\n\n&amp;#x200B;\n\nProblem is, I have no idea what anything means when I'm looking at specs and therefore I have no idea what to even look at. Would you have any recommendations? Videos that maybe explain the basics of camera specs? Maybe specific models that are meant for this kind of photography? Something I should try to avoid? Or anything else at all that could possibly be useful?\n\n&amp;#x200B;\n\nThank you.", "link": "https://www.reddit.com/r/Cameras/comments/f4b94t/i_would_like_to_buy_a_camera_and_i_dont_know/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "i would like to buy a camera and i don't know where to start /!/ so i'm an artist and a cook. -----> i !!!  -----> create !!!  a lot of art (traditional included) and dishes and -----> i !!!  would like to be able to take close-up pictures of them; -----> i !!!  don't want anything fancy, just something that's better than my shit phone camera. i was thinking maybe something under 250-300 usd. no fancy zoom-ins, effects, nature shots, or other functions; i just want clean, close pictures of my stuff.\n\n&amp;#x200b;\n\nproblem is, i have no idea what anything means when i'm looking at specs and therefore i have no idea what to even look at. would you have any recommendations? videos that maybe explain the basics of camera specs? maybe specific models that are meant for this kind of photography? something i should try to avoid? or anything else at all that could possibly be useful?\n\n&amp;#x200b;\n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 4742, "year": "2020"}, {"autor": "Princeaugust10", "date": "2020-04-23 17:15:18", "content": "Create and Dont Stop Creating /!/  [https://www.youtube.com/watch?v=LMUYA9JVCc8&amp;t=2s](https://www.youtube.com/watch?v=LMUYA9JVCc8&amp;t=2s)", "link": "https://www.reddit.com/r/Cameras/comments/g6qn0j/create_and_dont_stop_creating/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  and dont stop creating /!/  [https://www.youtube.com/watch?v=lmuya9jvcc8&amp;t=2s](https://www.youtube.com/watch?v=lmuya9jvcc8&amp;t=2s)", "sortedWord": "None", "Identifyer": null, "identifyer": 5745, "year": "2020"}, {"autor": "Tryndex", "date": "2020-05-11 23:17:08", "content": "Help me understand how to power my rig with external power /!/ I have a Nikon Z6 and an Atomos Ninja V.\n\nI want to power them both with a v-mount battery. But v-mount batteries are expensive. And np-f batteries are cheap.\n\nSo I'm thinking about getting a Neewer np-f to v-mount battery converter, which takes two np-f batteries and gives me a d-tap female output.\n\nI would then get a dummy battery to d-tap male, for both the Z6 and Ninja V respectively.\n\nI would connect these dummy batteries to a d-tap splitter, which would be connected to the Neewer converter.\n\nI get a feeling this was all too simple.\n\n  \nWhat I learned in my high school physics classes has long since faded away, so take me as being new to all this voltage and wattage and amps stuff. \n\nIs any of this going to work? If not, what knowledge do I need to create a setup which *I know* will work?", "link": "https://www.reddit.com/r/Cameras/comments/ghywwy/help_me_understand_how_to_power_my_rig_with/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "help me understand how to power my rig with external power /!/ i have a nikon z6 and an atomos ninja v.\n\ni want to power them both with a v-mount battery. but v-mount batteries are expensive. and np-f batteries are cheap.\n\nso i'm thinking about getting a neewer np-f to v-mount battery converter, which takes two np-f batteries and gives me a d-tap female output.\n\ni would then get a dummy battery to d-tap male, for both the z6 and ninja v respectively.\n\ni would connect these dummy batteries to a d-tap splitter, which would be connected to the neewer converter.\n\ni get a feeling this was all too simple.\n\n  \nwhat i learned in my high school physics classes has long since faded away, so take me as being new to all this voltage and wattage and amps stuff. \n\nis any of this going to work? if not, what knowledge do -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  a setup which *-----> i !!!  know* will work?", "sortedWord": "None", "Identifyer": null, "identifyer": 5916, "year": "2020"}, {"autor": "purplehayes0117", "date": "2020-12-22 22:30:42", "content": "Proprietary hot shoe has forced me to create this monstrosity", "link": "https://www.reddit.com/r/Cameras/comments/kifqbx/proprietary_hot_shoe_has_forced_me_to_create_this/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "proprietary hot shoe has forced -----> me !!!  -----> to !!!  -----> create !!!  this monstrosity", "sortedWord": "None", "Identifyer": null, "identifyer": 7529, "year": "2020"}, {"autor": "Hoan_K", "date": "2020-08-23 01:22:20", "content": "I have just created this wooden Sony A7 Mark III, I'm here to share it with you. Hope you enjoy it!", "link": "https://www.reddit.com/r/Cameras/comments/ieujxb/i_have_just_created_this_wooden_sony_a7_mark_iii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i have just created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> have !!!  -----> just !!!  -----> created !!!  this wooden sony a7 mark iii, -----> i !!! 'm here to share it with you. hope you enjoy it!", "sortedWord": "None", "Identifyer": null, "identifyer": 9366, "year": "2020"}, {"autor": "sourovdebmishu", "date": "2020-05-26 07:52:50", "content": "Why Silkypix developer is less talked about? I love the color rendering and highlight recovery better than the others. Although it's a little slower than LR &amp; C1 /!/ **I have posted this piece on another subs. If you have already seen it, then apologies. Hope mod will approve this post.\n_______\nI have tried capture pro, Dxo photolab, on1 photo raw for one month each for 3 months. \n\nWith each software, I have retouched about 2000 raw images from Fuji xt20, dng from my smartphone and raw files from Panasonic DMZ Bridge. I have created Color and BW images, panorama if available, and HDR.\n\nOn1 raw had hopes. But it's so slow to load images. Dxo photolab was not bad. Specially it had awesome user interface and noise reduction in phenomenal. But doesn't support Fuji or Pentax (not that I have).\nCapture was was in another league. The speed is unbeaten. Excellent for  productivity. \nI almost baught it. \n\nThen I have heard of Silkypix which I had installed but never used it. \n\nSo, just before I was about to take my wallet out for Capture One I gave silkypix a go. \n\nSo, I have edited about another 2000 images with files from Fuji RAF, Panasonic raw and dng from my smartphone.\nOne word. Color. It doesn't possess the speed of capture one or dxo. Local adjustment was not bad. \n\nBut, to recover highlights, NR it is as good as others if not better. Sharpness is not bad either. On top, \nSilkypix could produce literally exact same colors as jpegs with better details. And just because of that, I am sold. Plus it has different stacking options. The sliders are not to aggressive. I find it enough to professional work. If I really need to push the boundaries and need some more specific work then I use Affinity Photo.\n\nTheir manual is very well explained. Everything is pretty straightforward. Less is more\n\n So, I like it. \n I repeat, Capture is in another league when it comes to speed and retouching options. Even the free version is pretty awesome. But silkypix developer is fantastic for it's color rendition. It made me feel same way I felt with Fuji ergonomics and canon colors. It supports every camera brands and lens. They even make softwares for nikon, Fuji, Olympic and Panasonic and more. They work directly with the camera manufacturers.\n\nOnly one problem though, there aren't many tutorials available just in case if I need to find something specific. \nIs there anyone else out there who are also using Silkypix+Affinity Photo (Photoshop) combo? What is your workflow? Is there any in depth tutorials on the internet? \nWhat is your thoughts in general on this software if you ever have used it?", "link": "https://www.reddit.com/r/Cameras/comments/gqsqif/why_silkypix_developer_is_less_talked_about_i/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "why silkypix developer is less talked about? i love the color rendering and highlight recovery better than the others. although it's a little slower than lr &amp; c1 /!/ **i have posted this piece on another subs. if you have already seen it, then apologies. hope mod will approve this post.\n_______\ni have tried capture pro, dxo photolab, on1 photo raw for one month each for 3 months. \n\nwith each software, i have retouched about 2000 raw images from fuji xt20, dng from my smartphone and raw files from panasonic dmz bridge. -----> i !!!  -----> have !!!  -----> created !!!  color and bw images, panorama if available, and hdr.\n\non1 raw had hopes. but it's so slow to load images. dxo photolab was not bad. specially it had awesome user interface and noise reduction in phenomenal. but doesn't support fuji or pentax (not that i have).\ncapture was was in another league. the speed is unbeaten. excellent for  productivity. \ni almost baught it. \n\nthen i have heard of silkypix which i had installed but never used it. \n\nso, just before i was about to take my wallet out for capture one i gave silkypix a go. \n\nso, i have edited about another 2000 images with files from fuji raf, panasonic raw and dng from my smartphone.\none word. color. it doesn't possess the speed of capture one or dxo. local adjustment was not bad. \n\nbut, to recover highlights, nr it is as good as others if not better. sharpness is not bad either. on top, \nsilkypix could produce literally exact same colors as jpegs with better details. and just because of that, i am sold. plus it has different stacking options. the sliders are not to aggressive. i find it enough to professional work. if i really need to push the boundaries and need some more specific work then i use affinity photo.\n\ntheir manual is very well explained. everything is pretty straightforward. less is more\n\n so, i like it. \n i repeat, capture is in another league when it comes to speed and retouching options. even the free version is pretty awesome. but silkypix developer is fantastic for it's color rendition. it made me feel same way i felt with fuji ergonomics and canon colors. it supports every camera brands and lens. they even make softwares for nikon, fuji, olympic and panasonic and more. they work directly with the camera manufacturers.\n\nonly one problem though, there aren't many tutorials available just in case if i need to find something specific. \nis there anyone else out there who are also using silkypix+affinity photo (photoshop) combo? what is your workflow? is there any in depth tutorials on the internet? \nwhat is your thoughts in general on this software if you ever have used it?", "sortedWord": "None", "Identifyer": null, "identifyer": 10701, "year": "2020"}], "name": "createCameras2020"}