{"interestingcomments": [{"autor": "Leaf-Ninja", "date": "2021-07-01 04:00:07", "content": "Camera Advice for Video Making (Australia) /!/ Hey all!,\n\nIt's been a while coming but now I'm finally going to be pursuing my dream of creating videos. I'm looking to create \"documentaries\" around different topics similar to that of VICE and Great Big Story. Shots that I want to do are interviews both out on the street and in a studio, video of landscapes and other urban environments.\n\nI don't know too much about cameras but the research I've conducted has left me a bit confused as there seems to be quite a fair amount of information floating around. I'm looking to shoot video primarily, I'd like this camera to be able to record in 4k and the budget I'm looking at would be preferably under $1000 AUD and buying second hand is definitely an option (what I'm planning on buying).\n\nIf you guys have any advice/recommendations/things to consider on my adventure it would be appreciated. I'm really looking for one camera that's portable and I'll be able to use on a variety of shots with good quality. \n\nThankyou!", "link": "https://www.reddit.com/r/Cameras/comments/obdqh4/camera_advice_for_video_making_australia/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i'm looking to create", "selectorShort": "create", "MarkedSent": "camera advice for video making (australia) /!/ hey all!,\n\nit's been a while coming but now i'm finally going to be pursuing my dream of creating videos. -----> i !!! 'm -----> looking !!!  -----> to !!!  -----> create !!!  \"documentaries\" around different topics similar -----> to !!!  that of vice and great big story. shots that i want to do are interviews both out on the street and in a studio, video of landscapes and other urban environments.\n\ni don't know too much about cameras but the research i've conducted has left me a bit confused as there seems to be quite a fair amount of information floating around. i'm looking to shoot video primarily, i'd like this camera to be able to record in 4k and the budget i'm looking at would be preferably under $1000 aud and buying second hand is definitely an option (what i'm planning on buying).\n\nif you guys have any advice/recommendations/things to consider on my adventure it would be appreciated. i'm really looking for one camera that's portable and i'll be able to use on a variety of shots with good quality. \n\nthankyou!", "sortedWord": "None", "Identifyer": null, "identifyer": 15880, "year": "2021"}, {"autor": "Important-Leather624", "date": "2021-03-28 06:32:05", "content": "What are the best cameras for sellers? /!/ I've created a store on eBay. I am looking to buy a camera to take product photos. Can you suggest any best camera available?", "link": "https://www.reddit.com/r/Cameras/comments/mew39e/what_are_the_best_cameras_for_sellers/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "what are the best cameras for sellers? /!/ -----> i !!! 've -----> created !!!  a store on ebay. i am looking to buy a camera to take product photos. can you suggest any best camera available?", "sortedWord": "None", "Identifyer": null, "identifyer": 16590, "year": "2021"}, {"autor": "jancinematography", "date": "2021-01-13 19:45:25", "content": "Sony a7iii POV Photography /!/ In this [Video](https://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s) i am taking a few cool pictures out in Snowy Nature with my a7iii 28-70mm.\nGo have a quick look at what I created!\n\nhttps://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s", "link": "https://www.reddit.com/r/Cameras/comments/kwo78c/sony_a7iii_pov_photography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "sony a7iii pov photography /!/ in this [video](https://www.youtube.com/watch?v=1ol2h_5cy0w&amp;t=75s) i am taking a few cool pictures out in snowy nature with my a7iii 28-70mm.\ngo have a quick look at what -----> i !!!  -----> created !!! !\n\nhttps://www.youtube.com/watch?v=1ol2h_5cy0w&amp;t=75s", "sortedWord": "None", "Identifyer": null, "identifyer": 16964, "year": "2021"}, {"autor": "meandmyselfl", "date": "2021-06-25 10:29:01", "content": "Canon - can I record high quality documentary footage with it? /!/ Hi, I am new to cameras and everything that has to do with filming (except for with an iphone). \n\nI would like to create documentary type, material that I can later on send in to competitions and so on... But as I am new to this I would like to explore if the camera that I have is capable of doing this, and if it is \"better\" than an Iphone camera really? If anyone could in baby language explain the two differences between them two please go ahead :) \n\nThe camera is a canon canon eos 2000d. \n\nAlso what is really the difference between this one and more expensive ones, is it a matter of quality in the video footage?", "link": "https://www.reddit.com/r/Cameras/comments/o7l0bk/canon_can_i_record_high_quality_documentary/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i would like to create", "selectorShort": "create", "MarkedSent": "canon - can i record high quality documentary footage with it? /!/ hi, i am new to cameras and everything that has to do with filming (except for with an iphone). \n\n-----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> create !!!  documentary type, material that -----> i !!!  can later on send in -----> to !!!  competitions and so on... but as i am new to this i would like to explore if the camera that i have is capable of doing this, and if it is \"better\" than an iphone camera really? if anyone could in baby language explain the two differences between them two please go ahead :) \n\nthe camera is a canon canon eos 2000d. \n\nalso what is really the difference between this one and more expensive ones, is it a matter of quality in the video footage?", "sortedWord": "None", "Identifyer": null, "identifyer": 17532, "year": "2021"}, {"autor": "11mx16", "date": "2021-08-12 15:55:45", "content": "What kind of camera/equipment do I need to catch several days worth of caterpillar chrysalis process? (Inexperienced) /!/ Have no camera experience whatsoever, besides a phone camera. I have a few black swallowtail caterpillars getting ready to cocoon in my herb garden, is there anything that is relatively affordable I could go out and grab to catch this? I want to create a time-lapse. It would be roughly 20 days of constant filming, is that possible?", "link": "https://www.reddit.com/r/Cameras/comments/p32p4t/what_kind_of_cameraequipment_do_i_need_to_catch/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "what kind of camera/equipment do i need to catch several days worth of caterpillar chrysalis process? (inexperienced) /!/ have no camera experience whatsoever, besides a phone camera. i have a few black swallowtail caterpillars getting ready to cocoon in my herb garden, is there anything that is relatively affordable i could go out and grab to catch this? -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a time-lapse. it would be roughly 20 days of constant filming, is that possible?", "sortedWord": "None", "Identifyer": null, "identifyer": 17610, "year": "2021"}, {"autor": "robita233", "date": "2021-07-12 19:06:03", "content": "Canon M50 Mark II or other beginner setup /!/ Hello!\n\n&amp;#x200B;\n\nI want to get into photography, I am at the very beginning as this would be my very first \"professional\" camera.\n\nI won't take onto serious projects or shoot to far with my ambitions, I will be starting slow, taking some courses and maybe becoming a little helper on some bigger projects for other people; but firstly, I would love to have a camera that I won't regret buying.\n\nI have done my research, although I still don't know all I should about cameras and gear, but I got a general idea of how things are supposed to be, maybe. So, I have come to the conclusion that firstly, your gear depends more on how YOU use it rather than how good IT is. I know that a good photographer/videographer will make the best out of mostly all gear, so don't think I am coming here to say that I want the best camera possible but I don't have any skill. Secondly, I came to the conclusion that the M50 Mark II might be a good enough camera to start with, I want something that will hold on with the quality down the road, with good lenses and gear, it could be a powerful setup.\n\nI have seen a lot of pros and cons of this camera, but overall, I am thinking of buying it, so I came here to ask: What do you guys think about it?\n\n&amp;#x200B;\n\nIs it a good enough camera for beginners? I know a fair bit of photoshop and lightroom, I want to create some services that I've not seen very much in my country ( Basically have seen A LOT of photographers that are being hired for expensive prices and not delivering the quality I, a beginner, would expect ) so I know that I will have a fair chance of getting a few jobs. Also, I heard that I shouldn't go for weddings for a long time, I know how hard it is to shoot for weddings, how chaotic and demanding it can be, I won't bite more than I can chew, I promise! Haha. I will mostly take part into birthday parties or other events ( After I learn, of course, how to master the camera in a better way, I'm planning to, besides maybe taking some courses, do some street photography of people and the city ).\n\n&amp;#x200B;\n\nSorry if I wrote too much, but I hope you won't come down too hard on me if I did some mistakes in my thought process. I am open to any criticism, tips or advice in what I should focus on, what gear to buy and so on. Thank you for your time!", "link": "https://www.reddit.com/r/Cameras/comments/oiy1pq/canon_m50_mark_ii_or_other_beginner_setup/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "canon m50 mark ii or other beginner setup /!/ hello!\n\n&amp;#x200b;\n\ni want to get into photography, i am at the very beginning as this would be my very first \"professional\" camera.\n\ni won't take onto serious projects or shoot to far with my ambitions, i will be starting slow, taking some courses and maybe becoming a little helper on some bigger projects for other people; but firstly, i would love to have a camera that i won't regret buying.\n\ni have done my research, although i still don't know all i should about cameras and gear, but i got a general idea of how things are supposed to be, maybe. so, i have come to the conclusion that firstly, your gear depends more on how you use it rather than how good it is. i know that a good photographer/videographer will make the best out of mostly all gear, so don't think i am coming here to say that i want the best camera possible but i don't have any skill. secondly, i came to the conclusion that the m50 mark ii might be a good enough camera to start with, i want something that will hold on with the quality down the road, with good lenses and gear, it could be a powerful setup.\n\ni have seen a lot of pros and cons of this camera, but overall, i am thinking of buying it, so i came here to ask: what do you guys think about it?\n\n&amp;#x200b;\n\nis it a good enough camera for beginners? -----> i !!!  know a fair bit of photoshop and lightroom, -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  some services that -----> i !!! 've not seen very much in my country ( basically have seen a lot of photographers that are being hired for expensive prices and not delivering the quality -----> i !!! , a beginner, would expect ) so i know that i will have a fair chance of getting a few jobs. also, i heard that i shouldn't go for weddings for a long time, i know how hard it is to shoot for weddings, how chaotic and demanding it can be, i won't bite more than i can chew, i promise! haha. i will mostly take part into birthday parties or other events ( after i learn, of course, how to master the camera in a better way, i'm planning to, besides maybe taking some courses, do some street photography of people and the city ).\n\n&amp;#x200b;\n\nsorry if i wrote too much, but i hope you won't come down too hard on me if i did some mistakes in my thought process. i am open to any criticism, tips or advice in what i should focus on, what gear to buy and so on. thank you for your time!", "sortedWord": "None", "Identifyer": null, "identifyer": 17827, "year": "2021"}, {"autor": "foxcatdoll", "date": "2021-07-26 04:31:15", "content": "I found super super Awesome 4k Landscape Images Taken By Sony a6500. Created 4K Music With Them And These are also good for your big 4K display.", "link": "https://www.reddit.com/r/Cameras/comments/orrfwg/i_found_super_super_awesome_4k_landscape_images/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "i found super super awesome 4k landscape images taken by sony a6500. -----> created !!!  4k music with them and these are also good for your big 4k display.", "sortedWord": "None", "Identifyer": null, "identifyer": 17901, "year": "2021"}, {"autor": "PinkCuttlefish", "date": "2021-04-19 05:13:59", "content": "Buying a camera for our ROTC unit /!/ Hello r/Cameras!\n\nI am currently a midshipman in a Navy ROTC battalion and I have a bit of a dilemma. It's important that our battalion takes photographs of what we do to create a public image. Unfortunately, since many of us are busy engineering students, it is rare that we come across someone that is a good photographer, or someone who has even taken basic classes. Every semester our photographer position changes meaning that oftentimes, it's difficult to even prepare for the role.\n\nWe are currently searching for a new camera as our old one is starting to get outdated. The camera is an older Nikon D3100 and the age is starting to show.  My supervisor didn't give me an exact budget range, but told me \"I would suggest avoiding the cheapest option but also don’t think we need top-of-the-line either\". So the budget is a little flexible here.\n\nI'm asking for your help in suggestions of cameras that would fit our needs. What we're looking for is a camera with some of the following traits, listed in order of priority:\n\n1. **Ease of use**. We're looking for something that's easier to \"just pick up and shoot\" with. We realize that no camera makes you a perfect photographer, but whatever you guys think is on the more user-friendly side!\n\n2. **Still photography**. Many of the pictures we take are at events where the subjects can hold a pose, so high quality photos of non-moving subjects would be great.\n\n3. **Low light**. Oftentimes I've found myself in a situation where I struggle to get enough exposure without getting super blurry shots. I'm not quite sure if this is a trait that differs between cameras, but this would be a nice quality to have in our camera.\n\n4. **Moving photography**. I know this one contradicts #2 a little bit but I thought I'd throw it out there. We also like to take pictures of our midshipmen in action, such as PT, close order drill, field exercises, etc. Again, not a must-have but a nice addition.\n\n* We're also looking for some **lenses**! One or two is really all we can afford.\n\nI totally understand that good photography is the product of a *good photographer, not a good camera*. Unfortunately, we rarely have the time to give our midshipmen classes on photography, so we're kind of forced to rely on a good camera. \n\nAny suggestion helps my search! Ironically as the photographer I don't know too much about photography, especially since I'm trying to learn Illustrator and Photoshop at the same time, all on top of my regular workload. I really appreciate you guys for taking the time to respond, so thank you very much!\n\n-MIDN PinkCuttlefish", "link": "https://www.reddit.com/r/Cameras/comments/mttogh/buying_a_camera_for_our_rotc_unit/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "we do to create", "selectorShort": "create", "MarkedSent": "buying a camera for our rotc unit /!/ hello r/cameras!\n\ni am currently a midshipman in a navy rotc battalion and i have a bit of a dilemma. it's important that our battalion takes photographs of what -----> we !!!  -----> do !!!  -----> to !!!  -----> create !!!  a public image. unfortunately, since many of us are busy engineering students, it is rare that we come across someone that is a good photographer, or someone who has even taken basic classes. every semester our photographer position changes meaning that oftentimes, it's difficult to even prepare for the role.\n\nwe are currently searching for a new camera as our old one is starting to get outdated. the camera is an older nikon d3100 and the age is starting to show.  my supervisor didn't give me an exact budget range, but told me \"i would suggest avoiding the cheapest option but also don’t think we need top-of-the-line either\". so the budget is a little flexible here.\n\ni'm asking for your help in suggestions of cameras that would fit our needs. what we're looking for is a camera with some of the following traits, listed in order of priority:\n\n1. **ease of use**. we're looking for something that's easier to \"just pick up and shoot\" with. we realize that no camera makes you a perfect photographer, but whatever you guys think is on the more user-friendly side!\n\n2. **still photography**. many of the pictures we take are at events where the subjects can hold a pose, so high quality photos of non-moving subjects would be great.\n\n3. **low light**. oftentimes i've found myself in a situation where i struggle to get enough exposure without getting super blurry shots. i'm not quite sure if this is a trait that differs between cameras, but this would be a nice quality to have in our camera.\n\n4. **moving photography**. i know this one contradicts #2 a little bit but i thought i'd throw it out there. we also like to take pictures of our midshipmen in action, such as pt, close order drill, field exercises, etc. again, not a must-have but a nice addition.\n\n* we're also looking for some **lenses**! one or two is really all we can afford.\n\ni totally understand that good photography is the product of a *good photographer, not a good camera*. unfortunately, we rarely have the time to give our midshipmen classes on photography, so we're kind of forced to rely on a good camera. \n\nany suggestion helps my search! ironically as the photographer i don't know too much about photography, especially since i'm trying to learn illustrator and photoshop at the same time, all on top of my regular workload. i really appreciate you guys for taking the time to respond, so thank you very much!\n\n-midn pinkcuttlefish", "sortedWord": "None", "Identifyer": null, "identifyer": 18853, "year": "2021"}, {"autor": "Tdog1974", "date": "2021-01-22 01:23:01", "content": "r/flashphotography is up and running /!/ Hey r/cameras, I’d like to invite everyone interested in learning about how to use artificial light in photography (and video—why not?) to come join me over in r/flashphotography!  I just took over as mod and I want to create a welcoming community for anyone seeking to learn, teach, or otherwise contribute (constructively) to building a great subreddit. Using artificial light in photography can be a game changer for your work. \n\nThe site is just getting up and running, so bear with me (I’m the only mod right now). But I have high hopes and am open to any constructive feedback y’all might have.  I am working on a wiki (it’s weak, but bear with me), and already have some sticky posts for a question thread, learning resources, and book recs. I even want to creat an official subreddit IG, for those who use that platform. \n\nDISCLAIMER: I reached out to the mods at r/cameras and they approved me making this one post to get the word out! Thanks to the kids for helping get a new photo community off the ground!", "link": "https://www.reddit.com/r/Cameras/comments/l2cra4/rflashphotography_is_up_and_running/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "r/flashphotography is up and running /!/ hey r/cameras, i’d like to invite everyone interested in learning about how to use artificial light in photography (and video—why not?) to come join me over in r/flashphotography!  -----> i !!!  just took over as mod and -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a welcoming community for anyone seeking -----> to !!!  learn, teach, or otherwise contribute (constructively) -----> to !!!  building a great subreddit. using artificial light in photography can be a game changer for your work. \n\nthe site is just getting up and running, so bear with me (i’m the only mod right now). but i have high hopes and am open to any constructive feedback y’all might have.  i am working on a wiki (it’s weak, but bear with me), and already have some sticky posts for a question thread, learning resources, and book recs. i even want to creat an official subreddit ig, for those who use that platform. \n\ndisclaimer: i reached out to the mods at r/cameras and they approved me making this one post to get the word out! thanks to the kids for helping get a new photo community off the ground!", "sortedWord": "None", "Identifyer": null, "identifyer": 19482, "year": "2021"}, {"autor": "mdb1989", "date": "2021-05-04 16:47:27", "content": "Help Me Choose /!/ My first camera was a Nikon D5500. I absolutely loved it... Great stills, but lacking in AF and video. I'm looking to create content for my band. This is what I NEED out of the camera, but I personally enjoy shooting stills too. I wouldn't want to go below the quality of the D5500 in that department. I want a touchscreen that's fully articulating as well. The amount of lense options is very important to me as well. I can't justify spending more on lenses than I do on the camera at this point, but I do want a good video lense, and a decent prime lense. My budget is around $750, although I'd really like to have a couple lenses at that price, but I can be patient.", "link": "https://www.reddit.com/r/Cameras/comments/n4t33p/help_me_choose/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i'm looking to create", "selectorShort": "create", "MarkedSent": "help me choose /!/ my first camera was a nikon d5500. i absolutely loved it... great stills, but lacking in af and video. -----> i !!! 'm -----> looking !!!  -----> to !!!  -----> create !!!  content for my band. this is what i need out of the camera, but i personally enjoy shooting stills too. i wouldn't want to go below the quality of the d5500 in that department. i want a touchscreen that's fully articulating as well. the amount of lense options is very important to me as well. i can't justify spending more on lenses than i do on the camera at this point, but i do want a good video lense, and a decent prime lense. my budget is around $750, although i'd really like to have a couple lenses at that price, but i can be patient.", "sortedWord": "None", "Identifyer": null, "identifyer": 19824, "year": "2021"}, {"autor": "micaheatsass", "date": "2021-06-18 19:08:04", "content": "I want to create an optical feedback loop but my camera monitor display won't pick up on my crt tv or my projector, does anyone know why? /!/ Connecting a Canon PowerShot hdmi through a downscaler and into crt, tv will display my saved images but doesn't display my monitor (which is how you create an optical feedback loop) \n\nThanks in advance.", "link": "https://www.reddit.com/r/Cameras/comments/o2xpk2/i_want_to_create_an_optical_feedback_loop_but_my/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  an optical feedback loop but my camera monitor display won't pick up on my crt tv or my projector, does anyone know why? /!/ connecting a canon powershot hdmi through a downscaler and into crt, tv will display my saved images but doesn't display my monitor (which is how you create an optical feedback loop) \n\nthanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 20179, "year": "2021"}, {"autor": "elysiandusk", "date": "2021-07-22 06:10:45", "content": "Need help identifying what type of camera this character uses! (screenshots provided) /!/ I am going to create some artwork of Adam from the first Saw movie (2004) and it will involve his camera. I need a closer reference of the camera than what the movie provides, so I'd like some help with knowing what I should be looking up. Doesn't have to be an exact match, similar-looking ones will work just fine. I will provide some screenshots below. Thanks in advance!\n\nhttps://preview.redd.it/jlre8jnlfpc71.png?width=284&amp;format=png&amp;auto=webp&amp;s=e1832c1f83f8ddc53ee2dd8050fa339c34e6934a\n\nhttps://preview.redd.it/172bdqfkfpc71.png?width=250&amp;format=png&amp;auto=webp&amp;s=9893f62f03b4e37490eb04f67b34942599c8aa48", "link": "https://www.reddit.com/r/Cameras/comments/op821z/need_help_identifying_what_type_of_camera_this/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i am going to create", "selectorShort": "create", "MarkedSent": "need help identifying what type of camera this character uses! (screenshots provided) /!/ -----> i !!!  -----> am !!!  -----> going !!!  -----> to !!!  -----> create !!!  some artwork of adam from the first saw movie (2004) and it will involve his camera. i need a closer reference of the camera than what the movie provides, so i'd like some help with knowing what i should be looking up. doesn't have to be an exact match, similar-looking ones will work just fine. i will provide some screenshots below. thanks in advance!\n\nhttps://preview.redd.it/jlre8jnlfpc71.png?width=284&amp;format=png&amp;auto=webp&amp;s=e1832c1f83f8ddc53ee2dd8050fa339c34e6934a\n\nhttps://preview.redd.it/172bdqfkfpc71.png?width=250&amp;format=png&amp;auto=webp&amp;s=9893f62f03b4e37490eb04f67b34942599c8aa48", "sortedWord": "None", "Identifyer": null, "identifyer": 21092, "year": "2021"}, {"autor": "subliminalmms", "date": "2021-05-04 14:15:17", "content": "G7X ii vs. Smartphone vs. SL2/200D ?? /!/ Hey all, I've happened into the business of social media this year which means I'm expected to produce high quality photo and video on a regular basis. \n\nI already had on hand the G7X Mark II and I'm currently running a Galaxy Note 8 (but will likely be upgrading the phone within the next year or so). \n\nI'm somewhere between novice and intermediate when it comes to camera work so I'm not sure how much of it is user error but I just find that most of the footage I take for work these days with the G7X II is total ass unless im doing macro-ish stuff (and its not even a good macro camera) or casual vlogging (which doesnt serve any purpose in the content im creating as I run pages for brands). \n\nSome of my content is street photography and I can manage some really nice still shots with the G7x despite the limitations of the point and shoot, the issue is mostly video which is what the camera is supposed to be for?\n\nI find that the focus is unreliable as well as the quality though ive gone through my settings many times searching for the best options.\n\nI'll insert two links to posts Ive created with footage from the G7x that I feel are simply horrendous but I had no choice.\n\nhttps://www.instagram.com/tv/COTqJythhNa/?igshid=3eu966jf06wh\n\nhttps://www.instagram.com/p/CJbRfsZFvqQ/?igshid=qv4bz6us4vnm\n\nThe first one has no correction as i didnt have the time but it wouldnt have helped anyway. As you can see, the second video likely would have been better just left raw. \n\nThe audio alone is enough to make me want to upgrade, though, I do have access to a zoom mic, id much rather spend 30 bucks on a nice little camera mic that i dont have to rig seperately. \n\nHeres my dillemma:\n\nI'm interested in the Canon SL2/200D but the pricetag is steep for me in my current situation... I'd like to hold on to the G7x for out and about or situations where convenience of its size might outweigh the need for quality. The issue is, I could knock a few hundy off the SL2 if i sold my G7x and I'm thinking that if i'll be upgrading my Smartphone at some point in the near future, is there really any advantage to keeping the G7x II? I don't really even vlog personally anymore but the camera has a little bit of a nostalgia for me so I'm having a pretty hard time deciding what to do, i just can't stand to keep putting out this low quality content. \n\nAny thoughts or advice would be much appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/n4pcy7/g7x_ii_vs_smartphone_vs_sl2200d/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "im creating", "selectorShort": "create", "MarkedSent": "g7x ii vs. smartphone vs. sl2/200d ?? /!/ hey all, i've happened into the business of social media this year which means i'm expected to produce high quality photo and video on a regular basis. \n\ni already had on hand the g7x mark ii and i'm currently running a galaxy note 8 (but will likely be upgrading the phone within the next year or so). \n\ni'm somewhere between novice and intermediate when it comes to camera work so i'm not sure how much of it is user error but -----> i !!!  just find that most of the footage -----> i !!!  take for work these days with the g7x ii is total ass unless -----> i !!! -----> m !!!  doing macro-ish stuff (and its not even a good macro camera) or casual vlogging (which doesnt serve any purpose in the content -----> i !!! -----> m !!!  -----> creating !!!  as -----> i !!!  run pages for brands). \n\nsome of my content is street photography and i can manage some really nice still shots with the g7x despite the limitations of the point and shoot, the issue is mostly video which is what the camera is supposed to be for?\n\ni find that the focus is unreliable as well as the quality though ive gone through my settings many times searching for the best options.\n\ni'll insert two links to posts ive created with footage from the g7x that i feel are simply horrendous but i had no choice.\n\nhttps://www.instagram.com/tv/cotqjythhna/?igshid=3eu966jf06wh\n\nhttps://www.instagram.com/p/cjbrfszfvqq/?igshid=qv4bz6us4vnm\n\nthe first one has no correction as i didnt have the time but it wouldnt have helped anyway. as you can see, the second video likely would have been better just left raw. \n\nthe audio alone is enough to make me want to upgrade, though, i do have access to a zoom mic, id much rather spend 30 bucks on a nice little camera mic that i dont have to rig seperately. \n\nheres my dillemma:\n\ni'm interested in the canon sl2/200d but the pricetag is steep for me in my current situation... i'd like to hold on to the g7x for out and about or situations where convenience of its size might outweigh the need for quality. the issue is, i could knock a few hundy off the sl2 if i sold my g7x and i'm thinking that if i'll be upgrading my smartphone at some point in the near future, is there really any advantage to keeping the g7x ii? i don't really even vlog personally anymore but the camera has a little bit of a nostalgia for me so i'm having a pretty hard time deciding what to do, i just can't stand to keep putting out this low quality content. \n\nany thoughts or advice would be much appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 22381, "year": "2021"}], "name": "createCameras2021"}