{"interestingcomments": [{"autor": "Patchateeka", "date": "2018-03-25 02:40:57", "content": "Comparing the RX100V, RX100IV, HX90V and others: looking for a nice travel camera /!/ The last camera I owned was an old Polaroid back in the late 90s. Since then, I've gone with phone cameras. I'm about to go on a trip of a lifetime and I'm considering getting back into dedicated cameras to avoid a few issues I may encounter if I use my phone as my camera (namely limited storage space, uses up phone battery life, and also my Droid Maxx phone camera isn't the best especially at distances).\n\nMy trip is to Utah, Wyoming, Oregon, and Washington. I'll be experiencing desert and wet conditions so the camera should be at least resistant to the elements and easy to clean if some dust gets inside. I'll also be taking pictures in the Northwest so no doubt there will be rain.\n\nI'm seeking a camera with a higher resolution than my phone. I want to create desktop monitor backgrounds. I'm also likely going to make prints.\n\nI'm seeking a camera that can take some decent distance shots. I saw these cameras mentioned in the title have 10x-30x zoom, but I've read mixed comments about the results being blurry. I realise 30x zoom probably won't get amazing results on such a small camera that lacks certain bells and whistles, but is it capable?\n\nI'd also like to do some night time photography if it's possible. I want to see if I can take a picture of the full moon and later in the trip I want to see if I can take a picture of the galaxy in a low light environment. Are these cameras capable of this?\n\nThe ideal situation is a small camera that can fit in a pocket. I realise they won't be as powerful as a 2,000 dollar mirrorless or whatever else, but I'm not a professional either. If you have other suggestions I haven't seen, please list! I'm also considering the Lumix ZS200 but I saw it doesn't have weather protection which is a major downside.\n\nThoughts, comments? Anyone have any experience with these cameras?", "link": "https://www.reddit.com/r/Cameras/comments/86y1nr/comparing_the_rx100v_rx100iv_hx90v_and_others/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "comparing the rx100v, rx100iv, hx90v and others: looking for a nice travel camera /!/ the last camera i owned was an old polaroid back in the late 90s. since then, i've gone with phone cameras. i'm about to go on a trip of a lifetime and i'm considering getting back into dedicated cameras to avoid a few issues i may encounter if i use my phone as my camera (namely limited storage space, uses up phone battery life, and also my droid maxx phone camera isn't the best especially at distances).\n\nmy trip is to utah, wyoming, oregon, and washington. i'll be experiencing desert and wet conditions so the camera should be at least resistant to the elements and easy to clean if some dust gets inside. i'll also be taking pictures in the northwest so no doubt there will be rain.\n\ni'm seeking a camera with a higher resolution than my phone. -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  desktop monitor backgrounds. i'm also likely going to make prints.\n\ni'm seeking a camera that can take some decent distance shots. i saw these cameras mentioned in the title have 10x-30x zoom, but i've read mixed comments about the results being blurry. i realise 30x zoom probably won't get amazing results on such a small camera that lacks certain bells and whistles, but is it capable?\n\ni'd also like to do some night time photography if it's possible. i want to see if i can take a picture of the full moon and later in the trip i want to see if i can take a picture of the galaxy in a low light environment. are these cameras capable of this?\n\nthe ideal situation is a small camera that can fit in a pocket. i realise they won't be as powerful as a 2,000 dollar mirrorless or whatever else, but i'm not a professional either. if you have other suggestions i haven't seen, please list! i'm also considering the lumix zs200 but i saw it doesn't have weather protection which is a major downside.\n\nthoughts, comments? anyone have any experience with these cameras?", "sortedWord": "None", "Identifyer": null, "identifyer": 69834, "year": "2018"}, {"autor": "RedFoxThirteen", "date": "2018-04-09 13:59:44", "content": "How do I create stop motion effect over extended periods of time? /!/ Hello, What sort of camera do you use to make the stop motion. The shot at 3:00. I would really really love to create this effect. I want to re-create this with my house plants and film them growing. What is the best way to achieve this. I would also like to leave the camera filming the same plant for months, maybe even a year or something crazy. What is the best way to go about this as the camera would need to stay plugged in. \n\nhttps://youtu.be/0LETLLl6mxo\n\nCan someone who knows camera's / video editing well please give me some tips as this is not an area I am particularly educated on the latest. Thank you \n\nMy price range is anywhere from $100 - $890\n\n\nMore examples: \n\nhttps://youtu.be/jyRw597JBVg\n\nhttps://youtu.be/Z-iPp6yn0hw", "link": "https://www.reddit.com/r/Cameras/comments/8aym67/how_do_i_create_stop_motion_effect_over_extended/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "how do -----> i !!!  -----> create !!!  stop motion effect over extended periods of time? /!/ hello, what sort of camera do you use to make the stop motion. the shot at 3:00. i would really really love to create this effect. i want to re-create this with my house plants and film them growing. what is the best way to achieve this. i would also like to leave the camera filming the same plant for months, maybe even a year or something crazy. what is the best way to go about this as the camera would need to stay plugged in. \n\nhttps://youtu.be/0letlll6mxo\n\ncan someone who knows camera's / video editing well please give me some tips as this is not an area i am particularly educated on the latest. thank you \n\nmy price range is anywhere from $100 - $890\n\n\nmore examples: \n\nhttps://youtu.be/jyrw597jbvg\n\nhttps://youtu.be/z-ipp6yn0hw", "sortedWord": "None", "Identifyer": null, "identifyer": 69905, "year": "2018"}, {"autor": "Madclapper", "date": "2018-01-21 17:53:36", "content": "New to Photography, Looking for a Travel Camera /!/ So I know just about nothing about cameras &amp; photography. I want something for when I go on vacation to take really high quality pictures. I usually create photo books for each trip. I went to Banff and British Columbia recently and just used my phone. Some pictures really didn't turn out as good as I wanted them to especially when enlarged. Don't want to have the same regret when I go on my next trip. \n\nI've only ever used typical digital cameras before. So I'm looking for something friendly to beginners, durable, and that will take high quality pictures. I know it'll be more on the bulky side but thats okay with me. I was hoping to spend max $500. \n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/7rz6je/new_to_photography_looking_for_a_travel_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i usually create", "selectorShort": "create", "MarkedSent": "new to photography, looking for a travel camera /!/ so i know just about nothing about cameras &amp; photography. i want something for when i go on vacation to take really high quality pictures. -----> i !!!  -----> usually !!!  -----> create !!!  photo books for each trip. i went to banff and british columbia recently and just used my phone. some pictures really didn't turn out as good as i wanted them to especially when enlarged. don't want to have the same regret when i go on my next trip. \n\ni've only ever used typical digital cameras before. so i'm looking for something friendly to beginners, durable, and that will take high quality pictures. i know it'll be more on the bulky side but thats okay with me. i was hoping to spend max $500. \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 70157, "year": "2018"}, {"autor": "KiwiMajd", "date": "2018-06-08 08:22:52", "content": "How can I get create footage of an interview like this? /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/8pi837/how_can_i_get_create_footage_of_an_interview_like/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i get create", "selectorShort": "create", "MarkedSent": "how can -----> i !!!  -----> get !!!  -----> create !!!  footage of an interview like this? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 70391, "year": "2018"}, {"autor": "TheSixthVisitor", "date": "2018-06-18 18:16:26", "content": "Looking for a camera for a project /!/ I'm trying to find an appropriate camera for a project that allows me to create a 360 live feed. I can either put a camera on a gimbal or use a 360-degree camera. I'm struggling to find a 360-degree camera that can work as a webcam; the specs on this cameras tell me that the cameras can live stream but not if they can be used as a webcam.\n\nHelp please?", "link": "https://www.reddit.com/r/Cameras/comments/8s1q2y/looking_for_a_camera_for_a_project/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "looking for a camera for a project /!/ i'm trying -----> to !!!  find an appropriate camera for a project that allows -----> me !!!  -----> to !!!  -----> create !!!  a 360 live feed. i can either put a camera on a gimbal or use a 360-degree camera. i'm struggling to find a 360-degree camera that can work as a webcam; the specs on this cameras tell me that the cameras can live stream but not if they can be used as a webcam.\n\nhelp please?", "sortedWord": "None", "Identifyer": null, "identifyer": 70553, "year": "2018"}, {"autor": "Pluvz", "date": "2018-06-11 15:39:50", "content": "Canon 77D or 80D? Help! /!/ I am purchasing a new camera and stuck between the Canon 77D or the Canon 80D. I am focusing on mostly nature and macro photography along with filming, though I will definitely expand in the future. I have tried to create a pro/con list for both models and what they have or don't have to offer.\n\nCanon 77D:\n\nPro:\n\nBetter noise reduction\n\nHigher capabilities in ISO\n\nMore mobile and lightweight\n\n\\~$100 less\n\nBetter for filming with digital IS Axis Sensors\n\nCon:\n\nNot weatherproofed\n\n6FPS Burst\n\n\\~95&amp;#37; frame coverage\n\nLesser quality build\n\nCanon 80D:\n\nPro:\n\nWeatherproofed\n\n\\~100&amp;#37; frame coverage\n\n7FPS Burst\n\nHigher quality build\n\nCon:\n\nBulkier, less mobile\n\n\\~$100 more\n\nLess apt for filming (in comparison to 77D)\n\nNo Bluetooth and video stabilization\n\nAny other input, recommendations, and insight is ultimately appreciated as it all has influence on my decision! Thanks much!", "link": "https://www.reddit.com/r/Cameras/comments/8qaiao/canon_77d_or_80d_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i have tried to create", "selectorShort": "create", "MarkedSent": "canon 77d or 80d? help! /!/ i am purchasing a new camera and stuck between the canon 77d or the canon 80d. i am focusing on mostly nature and macro photography along with filming, though i will definitely expand in the future. -----> i !!!  -----> have !!!  -----> tried !!!  -----> to !!!  -----> create !!!  a pro/con list for both models and what they -----> have !!!  or don't -----> have !!!  -----> to !!!  offer.\n\ncanon 77d:\n\npro:\n\nbetter noise reduction\n\nhigher capabilities in iso\n\nmore mobile and lightweight\n\n\\~$100 less\n\nbetter for filming with digital is axis sensors\n\ncon:\n\nnot weatherproofed\n\n6fps burst\n\n\\~95&amp;#37; frame coverage\n\nlesser quality build\n\ncanon 80d:\n\npro:\n\nweatherproofed\n\n\\~100&amp;#37; frame coverage\n\n7fps burst\n\nhigher quality build\n\ncon:\n\nbulkier, less mobile\n\n\\~$100 more\n\nless apt for filming (in comparison to 77d)\n\nno bluetooth and video stabilization\n\nany other input, recommendations, and insight is ultimately appreciated as it all has influence on my decision! thanks much!", "sortedWord": "None", "Identifyer": null, "identifyer": 72481, "year": "2018"}, {"autor": "aRealUn1queUsername", "date": "2018-11-07 18:31:57", "content": "I will create a WordPress portfolio for your photography FREE. /!/  I will set you up a WordPress website for free because having your very own place to show off your photography is important. It's one of the most vital steps you could make to show others that you mean business. If you don't know where to start, just PM me and I'll help you through the process. It'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. I'll get the whole website set up and presentable! ", "link": "https://www.reddit.com/r/Cameras/comments/9v1z03/i_will_create_a_wordpress_portfolio_for_your/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> will !!!  -----> create !!!  a wordpress portfolio for your photography free. /!/  i will set you up a wordpress website for free because having your very own place to show off your photography is important. it's one of the most vital steps you could make to show others that you mean business. if you don't know where to start, just pm me and i'll help you through the process. it'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. i'll get the whole website set up and presentable! ", "sortedWord": "None", "Identifyer": null, "identifyer": 73036, "year": "2018"}, {"autor": "54zzig", "date": "2018-11-06 21:27:04", "content": "Digital to Analogue. Create enduring wet prints on quality photographic paper using your smartphone in any enlarger working or not. Broaden your skills and have some fun with it.", "link": "https://www.reddit.com/r/Cameras/comments/9usllv/digital_to_analogue_create_enduring_wet_prints_on/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "digital to analogue. -----> create !!!  enduring wet prints on quality photographic paper using your smartphone in any enlarger working or not. broaden your skills and have some fun with it.", "sortedWord": "None", "Identifyer": null, "identifyer": 73048, "year": "2018"}, {"autor": "pjkst", "date": "2018-10-02 22:37:48", "content": "Upgrading equipment - need help deciding /!/ Hello there,\n\n&amp;#x200B;\n\nI have always been on a low budget with my gear and only had two cameras since I started shooting. I began with Canon 500D and then upgraded to 650D when it came out. It was okay for hobby video and photo shooting, but now I am doing more professional work and need to upgrade my gear.\n\n&amp;#x200B;\n\nI do both video and photo work. I often shoot at restaurants, events and other places, where the light conditions are now always good. I am not doing any stuff that requires ultra high quality - no narrative films or the like. The content I create is mostly aimed at social media. \n\n&amp;#x200B;\n\nEver since I heard of BMPCC 4K coming out, I have been hyped and was waiting for it to be released. Now, when it is very soon to come to Europe, I started doubting. My plan was to stick with 650D for photo work and have the BMPCC for video tasks. But now more and more I think that my photos would benefit quite a lot from a new camera. Apart from many other things, the low light performance is quite bad.\n\n&amp;#x200B;\n\nSo now I am trying to decide whether to go with BMPCC + 650D or sell the 650D and buy an all-around camera. The ones I am thinking of are Sony A7 III or Lumix GH5, however I believe I would prefer A7 III due to its' low light abilities. \n\n&amp;#x200B;\n\nCan you guys help me decide which way to go? Please give me some input that could help me decide. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/9kveet/upgrading_equipment_need_help_deciding/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "upgrading equipment - need help deciding /!/ hello there,\n\n&amp;#x200b;\n\ni have always been on a low budget with my gear and only had two cameras since i started shooting. i began with canon 500d and then upgraded to 650d when it came out. it was okay for hobby video and photo shooting, but now i am doing more professional work and need to upgrade my gear.\n\n&amp;#x200b;\n\ni do both video and photo work. i often shoot at restaurants, events and other places, where the light conditions are now always good. i am not doing any stuff that requires ultra high quality - no narrative films or the like. the content -----> i !!!  -----> create !!!  is mostly aimed at social media. \n\n&amp;#x200b;\n\never since i heard of bmpcc 4k coming out, i have been hyped and was waiting for it to be released. now, when it is very soon to come to europe, i started doubting. my plan was to stick with 650d for photo work and have the bmpcc for video tasks. but now more and more i think that my photos would benefit quite a lot from a new camera. apart from many other things, the low light performance is quite bad.\n\n&amp;#x200b;\n\nso now i am trying to decide whether to go with bmpcc + 650d or sell the 650d and buy an all-around camera. the ones i am thinking of are sony a7 iii or lumix gh5, however i believe i would prefer a7 iii due to its' low light abilities. \n\n&amp;#x200b;\n\ncan you guys help me decide which way to go? please give me some input that could help me decide. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 73343, "year": "2018"}], "name": "createCameras2018"}