{"interestingcomments": [{"autor": "1assman", "date": "2019-02-20 21:19:01", "content": "Create JPG on camera vs computer /!/ I can set my Canon SLR to save both RAW and JPG images.\n\nI could also take the Canon's RAW file and use a computer (e.g., Photoshop) to it to a JPG. Let's assume for the moment that I'm not making any adjustments to the image. Just open RAW and save JPG.\n\nAre there any differences in picture / coloring / resolution / JPG quality / etc... between those generated by the camera vs converting RAW to JPG on a computer? Or are all JPGs essentially created equal?", "link": "https://www.reddit.com/r/Cameras/comments/astwtu/create_jpg_on_camera_vs_computer/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  jpg on camera vs computer /!/ i can set my canon slr to save both raw and jpg images.\n\ni could also take the canon's raw file and use a computer (e.g., photoshop) to it to a jpg. let's assume for the moment that i'm not making any adjustments to the image. just open raw and save jpg.\n\nare there any differences in picture / coloring / resolution / jpg quality / etc... between those generated by the camera vs converting raw to jpg on a computer? or are all jpgs essentially created equal?", "sortedWord": "None", "Identifyer": null, "identifyer": 77738, "year": "2019"}, {"autor": "TheBlueSuperNova", "date": "2019-06-24 05:56:21", "content": "I have finally decided on getting a Nikon, but need help /!/ TL;DR Trying to decide between a z6 or a z7 for sports/wildlife. \n\nSo awhile back I had purchased a Sony A77ii which was a fantastic camera. I got it for $1300 at the time and it came with a 16-50 f2.8 lens. My main passion was shooting sports (ultimate frisbee) and wildlife. I also ended up buying a g master 70-200 f2.8 for this purpose. I created lots of awesome photos, but at some point something happened to my system where parts of my picture seem blurry and I more than likely would need to take it in to get fixed. My main issue is there is very little support for a-mounts with Sony, and will be next to no support going forward so instead of spending a good amount of money to fix my system, I have decided to invest in a system with a bright future.\n\nI was constantly switching between Sony mirrorless and Nikon in general. The appeal of Nikons mirrorless wasn’t really there for me considering how new they were and didn’t look to great to me spec wise. As far was Sony goes I was debating either a a7iii or an a9 if I decided to save up for the more expensive body. After going to a local camera store, I got to hold a lot of these cameras to at least get somewhat of a feel for them. I was blown away by how good the Nikon mirrorless felt in my hand. It really felt like a smaller more compact DSLR and had as good of a grip of one. I tried holding some canons for good measure and my god the EOS R just feels like shit in my hands. Like a legit metal brick. Blech. Sony still felt nice, but I would’ve liked if they put the same rubber grip that Nikon does for its mirrorless.\n\nAfter this I felt more confident in my decision making as how a camera feels in hand does play a large part in what you choose. So now I’m debating either the Z6 which has more FPS, or the Z7 which has less FPS but more pixels, more autofocus points, and just more upgraded features for a bigger price. Only other factor which would make me not go Nikon is how Sony feels much lighter in hands, and already has a good array of lenses for what I need whereas I’d need to wait for Nikon to come out with wildlife/ sports lenses and not use an adapter for their F mounts.\n\n\nDo any of you have any thoughts or opinions on what you would choose?", "link": "https://www.reddit.com/r/Cameras/comments/c4izom/i_have_finally_decided_on_getting_a_nikon_but/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i have finally decided on getting a nikon, but need help /!/ tl;dr trying to decide between a z6 or a z7 for sports/wildlife. \n\nso awhile back i had purchased a sony a77ii which was a fantastic camera. i got it for $1300 at the time and it came with a 16-50 f2.8 lens. my main passion was shooting sports (ultimate frisbee) and wildlife. i also ended up buying a g master 70-200 f2.8 for this purpose. -----> i !!!  -----> created !!!  lots of awesome photos, but at some point something happened to my system where parts of my picture seem blurry and -----> i !!!  more than likely would need to take it in to get fixed. my main issue is there is very little support for a-mounts with sony, and will be next to no support going forward so instead of spending a good amount of money to fix my system, i have decided to invest in a system with a bright future.\n\ni was constantly switching between sony mirrorless and nikon in general. the appeal of nikons mirrorless wasn’t really there for me considering how new they were and didn’t look to great to me spec wise. as far was sony goes i was debating either a a7iii or an a9 if i decided to save up for the more expensive body. after going to a local camera store, i got to hold a lot of these cameras to at least get somewhat of a feel for them. i was blown away by how good the nikon mirrorless felt in my hand. it really felt like a smaller more compact dslr and had as good of a grip of one. i tried holding some canons for good measure and my god the eos r just feels like shit in my hands. like a legit metal brick. blech. sony still felt nice, but i would’ve liked if they put the same rubber grip that nikon does for its mirrorless.\n\nafter this i felt more confident in my decision making as how a camera feels in hand does play a large part in what you choose. so now i’m debating either the z6 which has more fps, or the z7 which has less fps but more pixels, more autofocus points, and just more upgraded features for a bigger price. only other factor which would make me not go nikon is how sony feels much lighter in hands, and already has a good array of lenses for what i need whereas i’d need to wait for nikon to come out with wildlife/ sports lenses and not use an adapter for their f mounts.\n\n\ndo any of you have any thoughts or opinions on what you would choose?", "sortedWord": "None", "Identifyer": null, "identifyer": 78538, "year": "2019"}, {"autor": "Icebearltu", "date": "2019-07-10 19:30:43", "content": "SELLING SERVICES&gt;&gt;&gt; Creating Clean Websites &lt;&lt;&lt;&lt;&lt; /!/ If you’re looking for a fully functional WordPress website that meets the needs of the ever-changing world-wide-web, then look no further!\n\nWhy you should work with us\n\nWe Highly Focus On:\n\n· Efficiency\n\n· Accuracy\n\n· On Time Delivery\n\n· Customer Satisfaction\n\n· Quality Product Delivery\n\nPrivate message me for more info or is interested to my services", "link": "https://www.reddit.com/r/Cameras/comments/cbl94s/selling_services_creating_clean_websites/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "selling services&gt;&gt;&gt; -----> creating !!!  clean websites &lt;&lt;&lt;&lt;&lt; /!/ if you’re looking for a fully functional wordpress website that meets the needs of the ever-changing world-wide-web, then look no further!\n\nwhy you should work with us\n\nwe highly focus on:\n\n· efficiency\n\n· accuracy\n\n· on time delivery\n\n· customer satisfaction\n\n· quality product delivery\n\nprivate message me for more info or is interested to my services", "sortedWord": "None", "Identifyer": null, "identifyer": 80756, "year": "2019"}, {"autor": "crepuscopoli", "date": "2019-08-12 20:29:05", "content": "Im not sure if i need 4k! Enter plz! /!/ Hi guys i wanna create content for youtube.\nSince i wanna record my drawing process, wanna do high quality content from drawing side, and also high quality video!\nCould i shot all in 1080p and then upscale with handbrake in 4K?\nOr should i shot native 4k?\nJust because i dont know the file size of a 3h recording every day.thanks!", "link": "https://www.reddit.com/r/Cameras/comments/cpi3n6/im_not_sure_if_i_need_4k_enter_plz/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i wanna create", "selectorShort": "create", "MarkedSent": "im not sure if i need 4k! enter plz! /!/ hi guys -----> i !!!  -----> wanna !!!  -----> create !!!  content for youtube.\nsince i wanna record my drawing process, wanna do high quality content from drawing side, and also high quality video!\ncould i shot all in 1080p and then upscale with handbrake in 4k?\nor should i shot native 4k?\njust because i dont know the file size of a 3h recording every day.thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 80909, "year": "2019"}, {"autor": "MikeGaitas", "date": "2019-10-22 11:16:05", "content": "What camera should I get? /!/   Hi everyone, I don't know if I'm allowed to create a post here asking for help or if you guys have a dedicated place for that, so I'm sorry in advance. But my question is simple anyway: \n\n  Just started Uni., basically It's an Audiovisual course. And now I'm going to buy a camera for daily common use and as a tool for my University projects. What do you recommend? Ideally I need something that has versatility because I like photos as much I enjoy recording video. I have a old CANON 1000D, bought a kit 10 years ago more or less and if I can use the pair of lenses that came with and a Flash (I dont have it right now, a friend of mine borrowed it but it is 9/10yrs old too) it would be nice because I could save some money and in the future buy better and more convenient lenses.\n\n  The models that caught my eye were: FUJIFILM X-T30; CANON M6 MARK II, LUMIX DC-GH5 (if you guys have something else in mind please let me know)\n\n  I still have several questions about which lense are compatible with these cameras, should i buy lenses in a camera bundle or separately. And what are the \"best overall starting lenses\" for those cameras.\n\nThanks a lot for your help", "link": "https://www.reddit.com/r/Cameras/comments/dlgfob/what_camera_should_i_get/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i'm allowed to create", "selectorShort": "create", "MarkedSent": "what camera should i get? /!/   hi everyone, -----> i !!!  don't know if -----> i !!! 'm -----> allowed !!!  -----> to !!!  -----> create !!!  a post here asking for help or if you guys have a dedicated place for that, so -----> i !!! 'm sorry in advance. but my question is simple anyway: \n\n  just started uni., basically it's an audiovisual course. and now i'm going to buy a camera for daily common use and as a tool for my university projects. what do you recommend? ideally i need something that has versatility because i like photos as much i enjoy recording video. i have a old canon 1000d, bought a kit 10 years ago more or less and if i can use the pair of lenses that came with and a flash (i dont have it right now, a friend of mine borrowed it but it is 9/10yrs old too) it would be nice because i could save some money and in the future buy better and more convenient lenses.\n\n  the models that caught my eye were: fujifilm x-t30; canon m6 mark ii, lumix dc-gh5 (if you guys have something else in mind please let me know)\n\n  i still have several questions about which lense are compatible with these cameras, should i buy lenses in a camera bundle or separately. and what are the \"best overall starting lenses\" for those cameras.\n\nthanks a lot for your help", "sortedWord": "None", "Identifyer": null, "identifyer": 81299, "year": "2019"}], "name": "createCameras2019"}