{"interestingcomments": [{"autor": "rapunKzel92", "date": "2019-04-05 15:26:00", "content": "[Academic Research] Usability Test about Online Ratings &amp; Reviews on Sandisk SDXC cards /!/ Hello kind strangers,\n\nI'm Hazel, a student in M. Sc. Usability Engineering at Rhine-Waal University of Applied Sciences, Germany and I'm conducting a thesis research on consumer behaviour on Amazon.com.\n\nThe aim is to understand how people read and write reviews online, given how we have turned to trust peers online on platforms such as Amazon, AirBnB, and Uber. For the results to be comparable to real review data, I've chosen to talk to people who own a Sandisk SDXC card who are willing to test my design of Amazon's review component. As it turns out, photography/film enthusiasts are fans of the SDXC card!\n\n**Full recruitment criteria:**\n\n* American / lives in USA 🇺🇸\n\n* Aged 21 and above\n\n* Working professional\n\n* Own a Sandisk SDXC card\n\n\n**I'm offering $10.00 Amazon vouchers as an incentive out of my student pockets** - if you're willing to join me in a 30-60 minute conference call which **will be recorded only for my eyes and ears**, drop me an email at [hello@hazeltan.my](mailto://hello@hazeltan.my) and I'll coordinate with you.\n\nIf you'd like more information, I'll be happy to answer in the comments or email :)\n\n* *No other personal data is collected. Recordings will be deleted within 3 months of the thesis submission. I will need a way to send you the voucher, an email address or other but it will not be recorded in any documents.*\n\n* *This study is NOT affiliated with Amazon.com Inc.*", "link": "https://www.reddit.com/r/Cameras/comments/b9sk45/academic_research_usability_test_about_online/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "[academic research] usability test about online ratings &amp; reviews on sandisk sdxc cards /!/ hello kind strangers,\n\ni'm hazel, a student in m. sc. usability engineering at rhine-waal university of applied sciences, germany and i'm conducting a thesis research on consumer behaviour on amazon.com.\n\nthe aim is to understand how people read and write reviews online, given how we have turned to trust peers online on platforms such as amazon, airbnb, and uber. for the results to be comparable to real review data, i've chosen to talk to people who own a sandisk sdxc card who are willing to test -----> my !!!  -----> design !!!  of amazon's review component. as it turns out, photography/film enthusiasts are fans of the sdxc card!\n\n**full recruitment criteria:**\n\n* american / lives in usa 🇺🇸\n\n* aged 21 and above\n\n* working professional\n\n* own a sandisk sdxc card\n\n\n**i'm offering $10.00 amazon vouchers as an incentive out of my student pockets** - if you're willing to join me in a 30-60 minute conference call which **will be recorded only for my eyes and ears**, drop me an email at [hello@hazeltan.my](mailto://hello@hazeltan.my) and i'll coordinate with you.\n\nif you'd like more information, i'll be happy to answer in the comments or email :)\n\n* *no other personal data is collected. recordings will be deleted within 3 months of the thesis submission. i will need a way to send you the voucher, an email address or other but it will not be recorded in any documents.*\n\n* *this study is not affiliated with amazon.com inc.*", "sortedWord": "None", "Identifyer": null, "identifyer": 80057, "year": "2019"}, {"autor": "nsandin88", "date": "2019-07-07 14:19:39", "content": "I designed &amp; 3D printed this adapter to use this 70 year old Kodak Retina IIIc lens on my Nikon Z7 (test shots in comments)", "link": "https://www.reddit.com/r/Cameras/comments/ca7b2p/i_designed_3d_printed_this_adapter_to_use_this_70/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  &amp; 3d printed this adapter to use this 70 year old kodak retina iiic lens on my nikon z7 (test shots in comments)", "sortedWord": "None", "Identifyer": null, "identifyer": 80814, "year": "2019"}], "name": "designCameras2019"}