{"interestingcomments": [{"autor": "baby_buttercup_18", "date": "2021-04-29 01:50:10", "content": "I am joining design foundations next year (perquisite to photography) then after that photography. Should I get a camera? I can always borrow the schools or use my phone (phone pics below, mainly food since that's what I'm good at). What should I do?", "link": "https://www.reddit.com/r/Cameras/comments/n0u6zz/i_am_joining_design_foundations_next_year/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i am joining design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> am !!!  -----> joining !!!  -----> design !!!  foundations next year (perquisite to photography) then after that photography. should i get a camera? i can always borrow the schools or use my phone (phone pics below, mainly food since that's what i'm good at). what should i do?", "sortedWord": "None", "Identifyer": null, "identifyer": 15627, "year": "2021"}, {"autor": "Silence_Corner", "date": "2021-01-14 05:42:28", "content": "I designed an automatic magnetic Buckle for camera, I want to know your opinion It name \"Squid system\" /!/ I designed an automatic magnetic Buckle for camera\"Squid system\", I want to know your opinion \n\nI know what you want to say. You want to say this is very similar to Peak Design’s Anchor Links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nThe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nAs long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200B;\n\n Tell me your opinion, good or bad \\^\\^", "link": "https://www.reddit.com/r/Cameras/comments/kwzgx9/i_designed_an_automatic_magnetic_buckle_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  an automatic magnetic buckle for camera, -----> i !!!  want to know your opinion it name \"squid system\" /!/ i designed an automatic magnetic buckle for camera\"squid system\", i want to know your opinion \n\ni know what you want to say. you want to say this is very similar to peak design’s anchor links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nthe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nas long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200b;\n\n tell me your opinion, good or bad \\^\\^", "sortedWord": "None", "Identifyer": null, "identifyer": 16941, "year": "2021"}, {"autor": "Traditional-Scale-42", "date": "2021-08-18 02:04:59", "content": "We designed PlateZ to expand the capabilities of your camera without having to purchase multiple expensive products. Our goal is to create the platform to add all your accessories and expand their functionality with PlateZ.", "link": "https://www.reddit.com/r/Cameras/comments/p6htem/we_designed_platez_to_expand_the_capabilities_of/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "we designed", "selectorShort": "design", "MarkedSent": "-----> we !!!  -----> designed !!!  platez to expand the capabilities of your camera without having to purchase multiple expensive products. our goal is to create the platform to add all your accessories and expand their functionality with platez.", "sortedWord": "None", "Identifyer": null, "identifyer": 20583, "year": "2021"}], "name": "designCameras2021"}