{"interestingcomments": [{"autor": "MadameBouffant", "date": "2018-02-19 17:49:24", "content": "Frame Counter on old Nikon FG stopped counting. Now light meter won't work. /!/ Hey All!\n\nI have a feeling the answer to this is going to be pretty straight forward (get a new camera) but I thought I'd give this a try because I'm quite attached to this one. \n\nI have an older Nikon FG (no idea what year, link to photos here https://imgur.com/a/UlZ3Y ) that works great except the frame counter has stopped working. I can no longer reset the camera when a new roll of film is inserted and since I can't get to frame 1 or 2 the light meter won't work.\n\nJust wondering if there's an easy DIY fix or something I can do to keep using this thing. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/7yohq3/frame_counter_on_old_nikon_fg_stopped_counting/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "frame counter on old nikon fg stopped counting. now light meter won't work. /!/ hey all!\n\ni have a feeling the answer to this is going to be pretty straight forward (get a new camera) but i thought i'd give this a try because i'm quite attached to this one. \n\ni have an older nikon fg (no idea what year, link to photos here https://imgur.com/a/ulz3y ) that works great except the frame counter has stopped working. i can no longer reset the camera when a new roll of film is inserted and since i can't get to frame 1 or 2 the light meter won't work.\n\njust wondering if there's an easy -----> diy !!!  fix or something i can do to keep using this thing. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 69576, "year": "2018"}, {"autor": "sf59062", "date": "2018-03-27 17:39:46", "content": "Protective camera skins for Nikon Coolpix A900? /!/ Hi All,\n\nQuick question. I recently had an accident with my company point-and-shoot camera, a Nikon Coolpix A900. Everything has been fixed thanks to the warranty, except my pride. \n\nIn an effort to create future damage control I thought it might be a good idea to invest/look into a protective camera cover skin that would fit our model. However, I'm having trouble finding ANYTHING that will fit this model exactly. I've found plenty of third party skins that are similar, but nothing for this specific camera. I even called Nikon and asked, they said they don't have anything for this specific camera. \n\nThis puts us into the realm of custom building, but all I can find are companies that will only custom build for a large stock order. I'm specifically looking for silicone, but I can be flexible on materials. So does anyone have any leads or ideas on what to do? \n\nIs there something I'm missing here? I can also probably do a little DIY make your own case if anyone has ideas for that?  ", "link": "https://www.reddit.com/r/Cameras/comments/87kex1/protective_camera_skins_for_nikon_coolpix_a900/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "protective camera skins for nikon coolpix a900? /!/ hi all,\n\nquick question. i recently had an accident with my company point-and-shoot camera, a nikon coolpix a900. everything has been fixed thanks to the warranty, except my pride. \n\nin an effort to create future damage control i thought it might be a good idea to invest/look into a protective camera cover skin that would fit our model. however, i'm having trouble finding anything that will fit this model exactly. i've found plenty of third party skins that are similar, but nothing for this specific camera. i even called nikon and asked, they said they don't have anything for this specific camera. \n\nthis puts us into the realm of custom building, but all i can find are companies that will only custom build for a large stock order. i'm specifically looking for silicone, but i can be flexible on materials. so does anyone have any leads or ideas on what to do? \n\nis there something i'm missing here? i can also probably do a little -----> diy !!!  make your own case if anyone has ideas for that?  ", "sortedWord": "None", "Identifyer": null, "identifyer": 69788, "year": "2018"}, {"autor": "Hende101", "date": "2018-04-11 19:52:21", "content": "DIY TimeLapse Camera Slider /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/8bk1k2/diy_timelapse_camera_slider/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  timelapse camera slider /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 69870, "year": "2018"}, {"autor": "table_for_1", "date": "2018-04-04 21:07:41", "content": "Repairing an Olympus XA3 /!/ I've got a sticky focus lever and taking it in will run me more than the cost of a new one ($70 or so). Figured since I've got some free time in the evenings I would like to try and DIY the thing.\n\nI've come across a couple nice youtube videos on repairing an xa, though I'm noticing differences while disassembling an XA3. Any ideas on where I can find a repair manual for an XA3 (or even XA2) at this point?\n\n", "link": "https://www.reddit.com/r/Cameras/comments/89tisl/repairing_an_olympus_xa3/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "repairing an olympus xa3 /!/ i've got a sticky focus lever and taking it in will run me more than the cost of a new one ($70 or so). figured since i've got some free time in the evenings i would like to try and -----> diy !!!  the thing.\n\ni've come across a couple nice youtube videos on repairing an xa, though i'm noticing differences while disassembling an xa3. any ideas on where i can find a repair manual for an xa3 (or even xa2) at this point?\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 71844, "year": "2018"}, {"autor": "joe_noone", "date": "2018-05-31 18:54:30", "content": "Sports Camera with external microphone /!/ Hi,\n\nI have been looking at all the great compact 4K sports cameras from many Chinese sellers \\(e.g. banggood, gearbest, etc\\) but I was wanting a small camera to use to record our band when we play out that had good audio.  I haven't been able to find any that have an external mic plug in them that I could either have a good external mic connected to it or that I could run a mix out to. Anyone have any recommendations of something that's under $100 that would fit the bill? Don't want to spend a fortune as it might get knocked around, and I don't want to have to do a DIY to put an audio jack into one.\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/8nl0qn/sports_camera_with_external_microphone/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "sports camera with external microphone /!/ hi,\n\ni have been looking at all the great compact 4k sports cameras from many chinese sellers \\(e.g. banggood, gearbest, etc\\) but i was wanting a small camera to use to record our band when we play out that had good audio.  i haven't been able to find any that have an external mic plug in them that i could either have a good external mic connected to it or that i could run a mix out to. anyone have any recommendations of something that's under $100 that would fit the bill? don't want to spend a fortune as it might get knocked around, and i don't want to have to do a -----> diy !!!  to put an audio jack into one.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 72249, "year": "2018"}], "name": "diyCameras2018"}