{"interestingcomments": [{"autor": "lokiplus", "date": "2020-02-03 01:26:59", "content": "DIY \"quick\" release strap idea for (most of) the strap(s) that comes with your camera (useful if you have two spare lanyards lying around i guess)", "link": "https://www.reddit.com/r/Cameras/comments/exz0x1/diy_quick_release_strap_idea_for_most_of_the/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  \"quick\" release strap idea for (most of) the strap(s) that comes with your camera (useful if you have two spare lanyards lying around i guess)", "sortedWord": "None", "Identifyer": null, "identifyer": 1486, "year": "2020"}, {"autor": "magicman21", "date": "2020-02-19 14:14:59", "content": "My $30 Pelican 1560 and DIY TrekPak! /!/ \nGot this HUGE Pelican and SKB case lot from a liquidation center that takes in pallets of merch. A lot of this was from military use that is no longer “usable.” I paid $300 for https://imgur.com/gallery/hyhBXVQ \n\nLeft to right starting in back is 2 SKB 2918-10’s, Pelican 1650, middle is Pelican 1620, Pelican 1560, front SKB 1813-7 and Pelican 1600. \n\nThe Pelican 1560, SKB 1813-7 and Pelican 1600 I got for $20 a piece and I spent like $8 on new wheels for the 1560. \n\nI really liked the TrekPak system but didn’t want to pay to outfit all the cases with them. So I went to Michales and got a couple sheets of corrugated black plastic (20x30” for $4.50) 1/4 EVA foam sheets (.99 each,) a pack of EVA foam mats from Harbor Freight ($8.00) and 1/8” armature wire ($4.50 for 20ft) and yellow ribbon for tabs and about half the cases are outfitted and ready to go! Probably spent $60 total on insert material so far. Now I have a system on how to make dividers\n\nA lot of the cases had VERY specific custom hard foam in them for what ever gear they were transporting. So I tried to save any bottom foam and scrapped the rest. Got some 1’ cushion foam for bottom liner on the rest and now I’m rolling in style! \n\nThis is a EXTREMELY time consuming project but the savings and protection is huge in the end.", "link": "https://www.reddit.com/r/Cameras/comments/f6b6vf/my_30_pelican_1560_and_diy_trekpak/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my $30 pelican 1560 and -----> diy !!!  trekpak! /!/ \ngot this huge pelican and skb case lot from a liquidation center that takes in pallets of merch. a lot of this was from military use that is no longer “usable.” i paid $300 for https://imgur.com/gallery/hyhbxvq \n\nleft to right starting in back is 2 skb 2918-10’s, pelican 1650, middle is pelican 1620, pelican 1560, front skb 1813-7 and pelican 1600. \n\nthe pelican 1560, skb 1813-7 and pelican 1600 i got for $20 a piece and i spent like $8 on new wheels for the 1560. \n\ni really liked the trekpak system but didn’t want to pay to outfit all the cases with them. so i went to michales and got a couple sheets of corrugated black plastic (20x30” for $4.50) 1/4 eva foam sheets (.99 each,) a pack of eva foam mats from harbor freight ($8.00) and 1/8” armature wire ($4.50 for 20ft) and yellow ribbon for tabs and about half the cases are outfitted and ready to go! probably spent $60 total on insert material so far. now i have a system on how to make dividers\n\na lot of the cases had very specific custom hard foam in them for what ever gear they were transporting. so i tried to save any bottom foam and scrapped the rest. got some 1’ cushion foam for bottom liner on the rest and now i’m rolling in style! \n\nthis is a extremely time consuming project but the savings and protection is huge in the end.", "sortedWord": "None", "Identifyer": null, "identifyer": 2549, "year": "2020"}, {"autor": "photoexperts", "date": "2020-03-07 15:06:31", "content": "A4 Size Ultra-Thin Portable LED Light Box Tracer LED Artcraft Tracing Light Pad Light Box w 3 Level Brightness for Artists Drawing Sketching Animation and 5D DIY Diamond Painting", "link": "https://www.reddit.com/r/Cameras/comments/fewaay/a4_size_ultrathin_portable_led_light_box_tracer/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a4 size ultra-thin portable led light box tracer led artcraft tracing light pad light box w 3 level brightness for artists drawing sketching animation and 5d -----> diy !!!  diamond painting", "sortedWord": "None", "Identifyer": null, "identifyer": 2745, "year": "2020"}, {"autor": "scissorkick_sk", "date": "2020-03-27 19:13:02", "content": "DIY rope tripod", "link": "https://www.reddit.com/r/Cameras/comments/fq3gp2/diy_rope_tripod/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  rope tripod", "sortedWord": "None", "Identifyer": null, "identifyer": 2946, "year": "2020"}, {"autor": "bachinblack1685", "date": "2020-10-11 03:36:51", "content": "What is the right kind of camera to look for on my budget? /!/ So I'm starting a YouTube music DIY channel where I will build and solder electronics, write tunes, all sorts of stuff, and most of it will be in a top down view of my workstation. I don't have a ton of money, I have about $100 to spend on a camera. What kind of camera should I look into?", "link": "https://www.reddit.com/r/Cameras/comments/j8yak7/what_is_the_right_kind_of_camera_to_look_for_on/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what is the right kind of camera to look for on my budget? /!/ so i'm starting a youtube music -----> diy !!!  channel where i will build and solder electronics, write tunes, all sorts of stuff, and most of it will be in a top down view of my workstation. i don't have a ton of money, i have about $100 to spend on a camera. what kind of camera should i look into?", "sortedWord": "None", "Identifyer": null, "identifyer": 3368, "year": "2020"}, {"autor": "Granimal-Boofluff", "date": "2020-11-17 21:15:28", "content": "Is there a DIY way to connect a CMOS Sensor to my computer? /!/ After Raspberry Pi released their HQ sensor that could work with DSLR camera lenses, I've been wondering if I could just take a professional camera sensor like Canon CMOS sensors and somehow connect that to my computer for video or photography. Are there any sorts of tutorials on this? Or would this be something I'd need a PhD to do?", "link": "https://www.reddit.com/r/Cameras/comments/jw1ofg/is_there_a_diy_way_to_connect_a_cmos_sensor_to_my/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "is there a -----> diy !!!  way to connect a cmos sensor to my computer? /!/ after raspberry pi released their hq sensor that could work with dslr camera lenses, i've been wondering if i could just take a professional camera sensor like canon cmos sensors and somehow connect that to my computer for video or photography. are there any sorts of tutorials on this? or would this be something i'd need a phd to do?", "sortedWord": "None", "Identifyer": null, "identifyer": 3792, "year": "2020"}, {"autor": "Robzombie900", "date": "2020-07-15 06:30:16", "content": "DIY VS Store bought /!/ Hey so I've been looking a new hobby and I found photography to be one that I really like. So far ive just been useing my phone camera, and I want to get into using a proper camera. The question is it worth bulding your own digital camera or should I just go out and buy one from a store?", "link": "https://www.reddit.com/r/Cameras/comments/hrij65/diy_vs_store_bought/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  vs store bought /!/ hey so i've been looking a new hobby and i found photography to be one that i really like. so far ive just been useing my phone camera, and i want to get into using a proper camera. the question is it worth bulding your own digital camera or should i just go out and buy one from a store?", "sortedWord": "None", "Identifyer": null, "identifyer": 4061, "year": "2020"}, {"autor": "SeeTheBridges", "date": "2020-06-24 19:35:17", "content": "Gotta keep my camera budget in check somehow: DIY Variable ND Filter", "link": "https://www.reddit.com/r/Cameras/comments/hf7qpd/gotta_keep_my_camera_budget_in_check_somehow_diy/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "gotta keep my camera budget in check somehow: -----> diy !!!  variable nd filter", "sortedWord": "None", "Identifyer": null, "identifyer": 4326, "year": "2020"}, {"autor": "pergeedix", "date": "2020-02-10 02:29:49", "content": "10 Best Valentine’s Day Photo Ideas You Need to Know /!/ What is the most significant and romantic day of the year for lovers? 14th, February, it is Valentines’ Day. it is a perfect day for you and your love and it is also great for confessing love to your beloved one. On this special day, you need to make a difference in your love life. It is believed that taking photos is a good choice to deepen your relationship and show how much you love each other. So here are 10 [photo](https://www.pergear.com/blogs/news/6-tips-ideas-for-diy-christmas-holiday-family-photos-2019) ideas that inspire you at the valentine’s day.\n\n**Know Each Other Very Well**\n\n&amp;#x200B;\n\n The cutest and the most beautiful couples’ [pictures](https://www.pergear.com/blogs/news/wildlife-photography-10-stunning-animal-images-of-2019) will warm your heart and bring you unforgettable memories. So, you need to get to know your lovers better before taking photos. Some great photos will be taken.\n\n1. Need to know your life stories;\n2. Need to know how you feel in front of the [camera](https://www.pergear.com/collections/lens);\n3. Need to know what makes you comfortable and nice.\n\n…\n\nIf you have no idea, it is suggested that you can make a questionnaire.\n\n1. **Recreate the First Date**\n\n&amp;#x200B;\n\nRe-create the initial moment of falling in love with each other is a fun and touching idea. The spot you met each other for the first time is in particular. Go back to the location where you had the first date. You can wear the first date outfit and put some beautiful flowers. So, the romantic environment.\n\n1. **Kissing in the Sunset**\n\n&amp;#x200B;\n\nIt is proved that kissing is good for your health and can move the world. On valentine’s day, kissing also expresses your love for your soulmate. But you can make a big difference. You can find a good location like a beach and when the sun will set, you can kiss your lovers in the sunset. So fantastic.\n\n1. **Sleeping Pictures**\n\n&amp;#x200B;\n\n In my view, sleeping pictures are pretty and so interesting. If you are sleeping in your bed with your soulmate in the morning, it will even great. You can pretend to have a rest and you are lying in bed while the boy is gently hugging the girl. So sweet.\n\n1. **Show your Children**\n\n&amp;#x200B;\n\nHaving a child will make your home and your love life fun and interesting.\n\nA little kid is a big piece of your heart. On valentine’s day, it is a good time to show them how loved they are and you also confess your love to your baby. Kissing your baby in front of the camera will be great.\n\n1. **Do Things that They Both Love**\n\n&amp;#x200B;\n\n When you ask couples’ mutual hobbies, they will respond to you quickly. It indicates that they know each other very well. So, need to figure out the themed-idea about the special day. \n\nFor example, you enjoy the sport, and you can shoot pictures of running, playing badminton and something else. Make sure all things are related to valentine’s day \n\n1. **Hand-Holding**\n\n&amp;#x200B;\n\nIf you love your wife or husband, you may know how great it feels to walk with your soulmate holding your hands. In reality, hand-holding says a lot about the couple’s relationship. So, you can take some pictures of hand-holding. here are different types you can try:\n\n1. Down-Facing Palms;\n2. Interlocked Fingers;\n3. The one-finger hold;\n4. Linked Arms\n\nThese types of hand-holding mean your strong connection and passion.\n\n1. **Dance**\n\n&amp;#x200B;\n\nIf you have no idea how to pose perfectly when taking photos. You can try to dance. It is easy and joyful. You can choose one of the songs you both love the most. You don’t need to know some difficult dance moves and you only do some easy dance steps, such as swing or waltz. You have lots of chances to capture the beautiful moment. You can use a long exposure to photograph people’s body movements.\n\n1. **Use Some Tiny and Lovely Things**\n\n&amp;#x200B;\n\nSmall things, for lovers, tend to reveal how much they love each other and it also enriches and stimulates your romantic loving relationship. So, the tiny things (such as rings, tattoos) need to be included when shooting some pretty [portraits](https://www.pergear.com/blogs/news/wedding-photography-lighting-tips-how-to-take-unique-wedding-portraits). Your friends or your family members will happy when seeing these photos.\n\n1. **A hug from the Behind**\n\n&amp;#x200B;\n\n Different types of hugs mean different messages between people, but the hugging from behind is the most exciting type where guys can hug you from behind and put his arms around you. It shows that they want to cover your body and protect you from any injuries. You will feel secure and wanted. people get this back hug while looking in the same direction, showing a sense of togetherness. \n\n1. **Capture Surprise Moment**\n\n&amp;#x200B;\n\nNo matter what kinds of woman you are dating, planning a little surprise for your love. A surprise not only shows how much affection you show but also your romantic side. On Valentines’ day, you can give some cute things to your girlfriend, such as flowers, a box of chocolates, some teddy bears. Girls will feel amazed when getting these good [presents](https://www.pergear.com/collections/gimbals). It is good to capture the moment.\n\nValentine's day is a romantic holiday to celebrate love, friendship, and affection. I hope that these ideas can inspire you and have creative pictures with your lovers.", "link": "https://www.reddit.com/r/Cameras/comments/f1jkot/10_best_valentines_day_photo_ideas_you_need_to/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "10 best valentine’s day photo ideas you need to know /!/ what is the most significant and romantic day of the year for lovers? 14th, february, it is valentines’ day. it is a perfect day for you and your love and it is also great for confessing love to your beloved one. on this special day, you need to make a difference in your love life. it is believed that taking photos is a good choice to deepen your relationship and show how much you love each other. so here are 10 [photo](https://www.pergear.com/blogs/news/6-tips-ideas-for------> diy !!! -christmas-holiday-family-photos-2019) ideas that inspire you at the valentine’s day.\n\n**know each other very well**\n\n&amp;#x200b;\n\n the cutest and the most beautiful couples’ [pictures](https://www.pergear.com/blogs/news/wildlife-photography-10-stunning-animal-images-of-2019) will warm your heart and bring you unforgettable memories. so, you need to get to know your lovers better before taking photos. some great photos will be taken.\n\n1. need to know your life stories;\n2. need to know how you feel in front of the [camera](https://www.pergear.com/collections/lens);\n3. need to know what makes you comfortable and nice.\n\n…\n\nif you have no idea, it is suggested that you can make a questionnaire.\n\n1. **recreate the first date**\n\n&amp;#x200b;\n\nre-create the initial moment of falling in love with each other is a fun and touching idea. the spot you met each other for the first time is in particular. go back to the location where you had the first date. you can wear the first date outfit and put some beautiful flowers. so, the romantic environment.\n\n1. **kissing in the sunset**\n\n&amp;#x200b;\n\nit is proved that kissing is good for your health and can move the world. on valentine’s day, kissing also expresses your love for your soulmate. but you can make a big difference. you can find a good location like a beach and when the sun will set, you can kiss your lovers in the sunset. so fantastic.\n\n1. **sleeping pictures**\n\n&amp;#x200b;\n\n in my view, sleeping pictures are pretty and so interesting. if you are sleeping in your bed with your soulmate in the morning, it will even great. you can pretend to have a rest and you are lying in bed while the boy is gently hugging the girl. so sweet.\n\n1. **show your children**\n\n&amp;#x200b;\n\nhaving a child will make your home and your love life fun and interesting.\n\na little kid is a big piece of your heart. on valentine’s day, it is a good time to show them how loved they are and you also confess your love to your baby. kissing your baby in front of the camera will be great.\n\n1. **do things that they both love**\n\n&amp;#x200b;\n\n when you ask couples’ mutual hobbies, they will respond to you quickly. it indicates that they know each other very well. so, need to figure out the themed-idea about the special day. \n\nfor example, you enjoy the sport, and you can shoot pictures of running, playing badminton and something else. make sure all things are related to valentine’s day \n\n1. **hand-holding**\n\n&amp;#x200b;\n\nif you love your wife or husband, you may know how great it feels to walk with your soulmate holding your hands. in reality, hand-holding says a lot about the couple’s relationship. so, you can take some pictures of hand-holding. here are different types you can try:\n\n1. down-facing palms;\n2. interlocked fingers;\n3. the one-finger hold;\n4. linked arms\n\nthese types of hand-holding mean your strong connection and passion.\n\n1. **dance**\n\n&amp;#x200b;\n\nif you have no idea how to pose perfectly when taking photos. you can try to dance. it is easy and joyful. you can choose one of the songs you both love the most. you don’t need to know some difficult dance moves and you only do some easy dance steps, such as swing or waltz. you have lots of chances to capture the beautiful moment. you can use a long exposure to photograph people’s body movements.\n\n1. **use some tiny and lovely things**\n\n&amp;#x200b;\n\nsmall things, for lovers, tend to reveal how much they love each other and it also enriches and stimulates your romantic loving relationship. so, the tiny things (such as rings, tattoos) need to be included when shooting some pretty [portraits](https://www.pergear.com/blogs/news/wedding-photography-lighting-tips-how-to-take-unique-wedding-portraits). your friends or your family members will happy when seeing these photos.\n\n1. **a hug from the behind**\n\n&amp;#x200b;\n\n different types of hugs mean different messages between people, but the hugging from behind is the most exciting type where guys can hug you from behind and put his arms around you. it shows that they want to cover your body and protect you from any injuries. you will feel secure and wanted. people get this back hug while looking in the same direction, showing a sense of togetherness. \n\n1. **capture surprise moment**\n\n&amp;#x200b;\n\nno matter what kinds of woman you are dating, planning a little surprise for your love. a surprise not only shows how much affection you show but also your romantic side. on valentines’ day, you can give some cute things to your girlfriend, such as flowers, a box of chocolates, some teddy bears. girls will feel amazed when getting these good [presents](https://www.pergear.com/collections/gimbals). it is good to capture the moment.\n\nvalentine's day is a romantic holiday to celebrate love, friendship, and affection. i hope that these ideas can inspire you and have creative pictures with your lovers.", "sortedWord": "None", "Identifyer": null, "identifyer": 4555, "year": "2020"}, {"autor": "ScotchyJ", "date": "2020-04-06 19:12:30", "content": "Dummy battery recommendations for Fujifilm X-T100? /!/ Tried looking on Amazon for a dummy battery for my X-T100 but the options I'm seeing have very shaky reviews. Any advice outside of DIY options would be appreciated, thank you!", "link": "https://www.reddit.com/r/Cameras/comments/fw4w6j/dummy_battery_recommendations_for_fujifilm_xt100/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "dummy battery recommendations for fujifilm x-t100? /!/ tried looking on amazon for a dummy battery for my x-t100 but the options i'm seeing have very shaky reviews. any advice outside of -----> diy !!!  options would be appreciated, thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 5372, "year": "2020"}, {"autor": "JudCasper", "date": "2020-04-29 12:20:30", "content": "DIY lens cap for analogue camera? /!/ I imagine like many used buys, my Chinon CG-5 came without a lens cap. Anyone out there made there own? Tips, ideas very welcome (I'm currently youtubing examples)", "link": "https://www.reddit.com/r/Cameras/comments/ga8ez2/diy_lens_cap_for_analogue_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  lens cap for analogue camera? /!/ i imagine like many used buys, my chinon cg-5 came without a lens cap. anyone out there made there own? tips, ideas very welcome (i'm currently youtubing examples)", "sortedWord": "None", "Identifyer": null, "identifyer": 5873, "year": "2020"}, {"autor": "twofacechas3", "date": "2020-04-29 06:54:06", "content": "Old family DSLR DIY? /!/ So i recently found my mums old family camera (Nikon D3000) and was saddened to find it did not record, it has a Sigma DC 18-250mm lens so it takes decent photos but as i said, unable to record. I cannot afford a new camera and was wondering if there was some kind of way i could modify it to record. I am happy to provide more info if needed.", "link": "https://www.reddit.com/r/Cameras/comments/ga4l2q/old_family_dslr_diy/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "old family dslr -----> diy !!! ? /!/ so i recently found my mums old family camera (nikon d3000) and was saddened to find it did not record, it has a sigma dc 18-250mm lens so it takes decent photos but as i said, unable to record. i cannot afford a new camera and was wondering if there was some kind of way i could modify it to record. i am happy to provide more info if needed.", "sortedWord": "None", "Identifyer": null, "identifyer": 5878, "year": "2020"}, {"autor": "BradyBessette", "date": "2020-08-26 16:43:15", "content": "This is a tutorial I did for video but applies for product photo too! Very low budget and DIY tips too! Give it a shot and let me know what you think!", "link": "https://www.reddit.com/r/Cameras/comments/ih2cuw/this_is_a_tutorial_i_did_for_video_but_applies/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "this is a tutorial i did for video but applies for product photo too! very low budget and -----> diy !!!  tips too! give it a shot and let me know what you think!", "sortedWord": "None", "Identifyer": null, "identifyer": 6486, "year": "2020"}, {"autor": "plentaldan58", "date": "2020-10-28 08:33:12", "content": "Shop rifle camera mount · SCOPE-MOUNT · DIY NIGHT VISION ACCESSORIES · MODERATOR 1/2 UNF ADAPTOR ·", "link": "https://www.reddit.com/r/Cameras/comments/jjk1rx/shop_rifle_camera_mount_scopemount_diy_night/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "shop rifle camera mount · scope-mount · -----> diy !!!  night vision accessories · moderator 1/2 unf adaptor ·", "sortedWord": "None", "Identifyer": null, "identifyer": 6970, "year": "2020"}, {"autor": "matthornstein", "date": "2020-11-10 19:30:08", "content": "Hey everyone, first time here. I’d like to know if anyone knows this XLR battery unit at the back of the camera. I’ve a friend that wants to build a DIY version of this but doesn’t know where to start.", "link": "https://www.reddit.com/r/Cameras/comments/jrrohg/hey_everyone_first_time_here_id_like_to_know_if/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hey everyone, first time here. i’d like to know if anyone knows this xlr battery unit at the back of the camera. i’ve a friend that wants to build a -----> diy !!!  version of this but doesn’t know where to start.", "sortedWord": "None", "Identifyer": null, "identifyer": 7001, "year": "2020"}, {"autor": "BuildThingsFromStuff", "date": "2020-07-12 22:28:52", "content": "DIY Camera Stabilizer - How To Make", "link": "https://www.reddit.com/r/Cameras/comments/hq3gxq/diy_camera_stabilizer_how_to_make/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  camera stabilizer - how to make", "sortedWord": "None", "Identifyer": null, "identifyer": 7710, "year": "2020"}, {"autor": "MHBStudio", "date": "2020-06-03 16:23:37", "content": "DIY Trekpak Pelican Case Divider System - Under $30!", "link": "https://www.reddit.com/r/Cameras/comments/gvx1bu/diy_trekpak_pelican_case_divider_system_under_30/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  trekpak pelican case divider system - under $30!", "sortedWord": "None", "Identifyer": null, "identifyer": 8161, "year": "2020"}, {"autor": "MHBStudio", "date": "2020-06-11 21:45:43", "content": "DIY Sounds Panels - Build Your Own for Cheap!", "link": "https://www.reddit.com/r/Cameras/comments/h77a9i/diy_sounds_panels_build_your_own_for_cheap/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  sounds panels - build your own for cheap!", "sortedWord": "None", "Identifyer": null, "identifyer": 8388, "year": "2020"}, {"autor": "photoexperts", "date": "2020-02-23 21:54:22", "content": "Diamond Painting A4 LED Light Pad, USB Power Adjustable Ultra-Thin Portable LED Light Box Tracer for Artists Drawing Sketching Animation Stencilling and 5D DIY Diamond Painting X-ray Viewi", "link": "https://www.reddit.com/r/Cameras/comments/f8glov/diamond_painting_a4_led_light_pad_usb_power/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diamond painting a4 led light pad, usb power adjustable ultra-thin portable led light box tracer for artists drawing sketching animation stencilling and 5d -----> diy !!!  diamond painting x-ray viewi", "sortedWord": "None", "Identifyer": null, "identifyer": 8669, "year": "2020"}, {"autor": "JudCasper", "date": "2020-04-27 22:14:53", "content": "Printing digital with a border? /!/ Might sound like an odd question (and I don't have a printer to test) but if I edited my digital photos to have a white border, before taking them to one of these DIY digital print services, would they print with the border or would the software ignore it and do them edge to edge?", "link": "https://www.reddit.com/r/Cameras/comments/g9aqdh/printing_digital_with_a_border/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "printing digital with a border? /!/ might sound like an odd question (and i don't have a printer to test) but if i edited my digital photos to have a white border, before taking them to one of these -----> diy !!!  digital print services, would they print with the border or would the software ignore it and do them edge to edge?", "sortedWord": "None", "Identifyer": null, "identifyer": 8921, "year": "2020"}, {"autor": "JoanofArc0531", "date": "2020-12-18 04:15:16", "content": "Flexible tripod suggestion? /!/ Hi folks, \n\nI want to get a flexible tripod, but the ones I've found on amazon and such have too short of legs for my interests. I discovered these things called gear ties, which would make for a decent DIY alternative, but I don't think they would be able to handle too much weight.\n\nAny suggestions and recommendations? Are there other products like gear ties, but more thick and robust?\n\nNote: I will be using a Canon EOS-M, and probably an external monitor.\n\nThanks! :)", "link": "https://www.reddit.com/r/Cameras/comments/kfdvdv/flexible_tripod_suggestion/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "flexible tripod suggestion? /!/ hi folks, \n\ni want to get a flexible tripod, but the ones i've found on amazon and such have too short of legs for my interests. i discovered these things called gear ties, which would make for a decent -----> diy !!!  alternative, but i don't think they would be able to handle too much weight.\n\nany suggestions and recommendations? are there other products like gear ties, but more thick and robust?\n\nnote: i will be using a canon eos-m, and probably an external monitor.\n\nthanks! :)", "sortedWord": "None", "Identifyer": null, "identifyer": 10228, "year": "2020"}, {"autor": "Jmdaemon", "date": "2020-05-27 05:04:10", "content": "Looking to get into a 3d STANDARD FOV camera. /!/ With VR like the oculus quest becoming more and more commonplace, viewing 3d movies are getting easier and easier. However available camera hardware has been shrinking more and more. Many buyers guides from over a year ago have already seen half their cameras go EOL. \n\nCan someone fill me in on what the current available solutions are, mainly for someone just getting into it as a hobby (tripod mounted \"scene\" recordings primarily)? Also if you have heard anything about DIY rigs, like packing 2 cell phones together?\n\nThere are many 180 and 360 degree cameras out the market now but there are still too many issues with those, image quality being one of them.  They are not what I am looking for.", "link": "https://www.reddit.com/r/Cameras/comments/grd9d4/looking_to_get_into_a_3d_standard_fov_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "looking to get into a 3d standard fov camera. /!/ with vr like the oculus quest becoming more and more commonplace, viewing 3d movies are getting easier and easier. however available camera hardware has been shrinking more and more. many buyers guides from over a year ago have already seen half their cameras go eol. \n\ncan someone fill me in on what the current available solutions are, mainly for someone just getting into it as a hobby (tripod mounted \"scene\" recordings primarily)? also if you have heard anything about -----> diy !!!  rigs, like packing 2 cell phones together?\n\nthere are many 180 and 360 degree cameras out the market now but there are still too many issues with those, image quality being one of them.  they are not what i am looking for.", "sortedWord": "None", "Identifyer": null, "identifyer": 10663, "year": "2020"}, {"autor": "PrintsAndPrints", "date": "2020-12-17 07:12:01", "content": "I finally finished the design of my DIY TINHOLE Camera. Of course there is still a lot of room for improvement, but this version works, shoots a full roll of 35mm film and can basically be made by everyone with a 3D printer and an empty tin can. Let me know if you like it!", "link": "https://www.reddit.com/r/Cameras/comments/kesnwt/i_finally_finished_the_design_of_my_diy_tinhole/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i finally finished the design of my -----> diy !!!  tinhole camera. of course there is still a lot of room for improvement, but this version works, shoots a full roll of 35mm film and can basically be made by everyone with a 3d printer and an empty tin can. let me know if you like it!", "sortedWord": "None", "Identifyer": null, "identifyer": 10914, "year": "2020"}], "name": "diyCameras2020"}