{"interestingcomments": [{"autor": "tequila_cube", "date": "2019-03-13 20:45:31", "content": "PANASONIC NV-M1 rare camcorder /!/  Hey VHSheads and camera enthusiasts! I really need some help, or at least an advice.\n\nLONG STORY SHORT, the power source (battery) detached from the camera while it just started buffering. And now does not even turn on.\n\nA couple of months ago I got myself an extremely rare panasonic vhs camcorder from 1985. It was in a perfect working condition, included stuff like battery pack charger, socket plug, and 2 12V battery packs (that of course do not hold any charge as they are 30+ years old).\n\nI found a way to “fix” the battery packs (i needed battery packs so i could film outside etc). So, I ordered a new 12V drill battery for £30 off ebay. Disassembled one of battery packs, detached old insides and rewired a new drill battery to it.\n\nI rewired it properly (positive to positive contact, and vice versa). HOWEVER i havent fixed the new battery on the old case before testing it out. This is where i cocked up.\n\nSo i attached a DIY battery pack onto the camera back and turned it on. JUST AS it started working (i heard sounds, it was actually buffering), the battery pack literally fell off. And detached from contacts. Meaning, while the camera was operating and setting up to turn on, the source of electricity suddenly detached.\n\nMy issue is: the camera does not turn on anymore. Not even if i plug it in the socket directly, not even if i use both DIY battery pack and the plug.\n\nWhat do i do now? I really, really love this camcorder and i cant accept such a loss tbh. There was no power overload, so how do i fix this?\n\nAsk for any details and please help me &lt;3", "link": "https://www.reddit.com/r/Cameras/comments/b0r3vn/panasonic_nvm1_rare_camcorder/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "panasonic nv-m1 rare camcorder /!/  hey vhsheads and camera enthusiasts! i really need some help, or at least an advice.\n\nlong story short, the power source (battery) detached from the camera while it just started buffering. and now does not even turn on.\n\na couple of months ago i got myself an extremely rare panasonic vhs camcorder from 1985. it was in a perfect working condition, included stuff like battery pack charger, socket plug, and 2 12v battery packs (that of course do not hold any charge as they are 30+ years old).\n\ni found a way to “fix” the battery packs (i needed battery packs so i could film outside etc). so, i ordered a new 12v drill battery for £30 off ebay. disassembled one of battery packs, detached old insides and rewired a new drill battery to it.\n\ni rewired it properly (positive to positive contact, and vice versa). however i havent fixed the new battery on the old case before testing it out. this is where i cocked up.\n\nso i attached a -----> diy !!!  battery pack onto the camera back and turned it on. just as it started working (i heard sounds, it was actually buffering), the battery pack literally fell off. and detached from contacts. meaning, while the camera was operating and setting up to turn on, the source of electricity suddenly detached.\n\nmy issue is: the camera does not turn on anymore. not even if i plug it in the socket directly, not even if i use both diy battery pack and the plug.\n\nwhat do i do now? i really, really love this camcorder and i cant accept such a loss tbh. there was no power overload, so how do i fix this?\n\nask for any details and please help me &lt;3", "sortedWord": "None", "Identifyer": null, "identifyer": 76742, "year": "2019"}, {"autor": "fisheveadventures", "date": "2019-03-10 23:28:03", "content": "DIY - Create Awesome Flash Diffuser for Macro Photography", "link": "https://www.reddit.com/r/Cameras/comments/azlzlw/diy_create_awesome_flash_diffuser_for_macro/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  - create awesome flash diffuser for macro photography", "sortedWord": "None", "Identifyer": null, "identifyer": 76785, "year": "2019"}, {"autor": "KD637orJoe", "date": "2019-04-30 14:06:58", "content": "Best camera lens bag/pouch/case for a videographer that runs? /!/ On days when I’m filming, I can clock up to 15 miles walking and running. I have a few choices for glass and wouldn’t mind being able to rotate lenses since neither me or my company have the budget for a 50-1000 lens like in Our Planet. Have you seen the Jungles episode?! With the birds!?!\n\n...Anyway, I could use a case that can take a beating. \n\nAnyone got any stories or DIY tricks or zippered cases made in Switzerland that are concussion-proof? \n\nSincere thanks ahead of time.", "link": "https://www.reddit.com/r/Cameras/comments/bj3pw8/best_camera_lens_bagpouchcase_for_a_videographer/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best camera lens bag/pouch/case for a videographer that runs? /!/ on days when i’m filming, i can clock up to 15 miles walking and running. i have a few choices for glass and wouldn’t mind being able to rotate lenses since neither me or my company have the budget for a 50-1000 lens like in our planet. have you seen the jungles episode?! with the birds!?!\n\n...anyway, i could use a case that can take a beating. \n\nanyone got any stories or -----> diy !!!  tricks or zippered cases made in switzerland that are concussion-proof? \n\nsincere thanks ahead of time.", "sortedWord": "None", "Identifyer": null, "identifyer": 78287, "year": "2019"}, {"autor": "fisheveadventures", "date": "2019-01-09 10:55:59", "content": "DIY - Flash Diffuser", "link": "https://www.reddit.com/r/Cameras/comments/ae5rc7/diy_flash_diffuser/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  - flash diffuser", "sortedWord": "None", "Identifyer": null, "identifyer": 79649, "year": "2019"}, {"autor": "centralplains", "date": "2019-03-02 15:56:14", "content": "DIY restoration ideas for camera case?", "link": "https://www.reddit.com/r/Cameras/comments/awj2af/diy_restoration_ideas_for_camera_case/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  restoration ideas for camera case?", "sortedWord": "None", "Identifyer": null, "identifyer": 79840, "year": "2019"}, {"autor": "centralplains", "date": "2019-03-02 15:53:39", "content": "DIY restoration ideas for camera bag?", "link": "https://www.reddit.com/r/Cameras/comments/awj1g9/diy_restoration_ideas_for_camera_bag/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  restoration ideas for camera bag?", "sortedWord": "None", "Identifyer": null, "identifyer": 79841, "year": "2019"}, {"autor": "badon_", "date": "2019-04-26 03:57:01", "content": "This long term time lapse camera can run for a month on 4 AA batteries - DIY Photography", "link": "https://www.reddit.com/r/Cameras/comments/bhhxup/this_long_term_time_lapse_camera_can_run_for_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "this long term time lapse camera can run for a month on 4 aa batteries - -----> diy !!!  photography", "sortedWord": "None", "Identifyer": null, "identifyer": 80148, "year": "2019"}, {"autor": "DAV3Y", "date": "2019-09-20 16:54:33", "content": "Anyone have experience with infrared DSLR conversions? /!/ [https://i.imgur.com/0vuNymh.jpg](https://i.imgur.com/0vuNymh.jpg)\n\nScored this Pentax k10d at a thrift store recently for $6. It came with a 50mm f1.4 and a 100mm f2.8 macro (both of which have fungus on the lenses). Was also missing the battery charger but I got a cheap one and it seems to work pretty well. I already have a better DSLR so I was considering an IR conversion. Does anyone here have experience with those? Is it expensive? Worth trying a DIY?", "link": "https://www.reddit.com/r/Cameras/comments/d6xq8i/anyone_have_experience_with_infrared_dslr/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "anyone have experience with infrared dslr conversions? /!/ [https://i.imgur.com/0vunymh.jpg](https://i.imgur.com/0vunymh.jpg)\n\nscored this pentax k10d at a thrift store recently for $6. it came with a 50mm f1.4 and a 100mm f2.8 macro (both of which have fungus on the lenses). was also missing the battery charger but i got a cheap one and it seems to work pretty well. i already have a better dslr so i was considering an ir conversion. does anyone here have experience with those? is it expensive? worth trying a -----> diy !!! ?", "sortedWord": "None", "Identifyer": null, "identifyer": 81145, "year": "2019"}, {"autor": "ferrisosseiran", "date": "2019-11-10 17:12:23", "content": "DIY CAMERA BUILD HELP /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/due4od/diy_camera_build_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  camera build help /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 81477, "year": "2019"}, {"autor": "Zippy9765", "date": "2019-12-03 15:25:00", "content": "I have this national m3 VHS camera, I was wondering if there’s a cheap or diy way to make a gimbal for it?", "link": "https://www.reddit.com/r/Cameras/comments/e5imr7/i_have_this_national_m3_vhs_camera_i_was/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i have this national m3 vhs camera, i was wondering if there’s a cheap or -----> diy !!!  way to make a gimbal for it?", "sortedWord": "None", "Identifyer": null, "identifyer": 81664, "year": "2019"}, {"autor": "DAV3Y", "date": "2019-09-12 19:15:31", "content": "Anyone have experience with infrared DSLR conversions? /!/ https://i.imgur.com/0vuNymh.jpg\n\nScored this Pentax k10d at a thrift store recently for $6. It came with a 50mm f1.4 and a 100mm f2.8 macro (both of which have fungus on the lenses). Was also missing the battery charger but I got a cheap one and it seems to work pretty well. I already have a better DSLR so I was considering an IR conversion. Does anyone here have experience with those? Is it expensive? Worth trying a DIY?", "link": "https://www.reddit.com/r/Cameras/comments/d3ctn7/anyone_have_experience_with_infrared_dslr/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "anyone have experience with infrared dslr conversions? /!/ https://i.imgur.com/0vunymh.jpg\n\nscored this pentax k10d at a thrift store recently for $6. it came with a 50mm f1.4 and a 100mm f2.8 macro (both of which have fungus on the lenses). was also missing the battery charger but i got a cheap one and it seems to work pretty well. i already have a better dslr so i was considering an ir conversion. does anyone here have experience with those? is it expensive? worth trying a -----> diy !!! ?", "sortedWord": "None", "Identifyer": null, "identifyer": 82712, "year": "2019"}, {"autor": "SirWafflemore", "date": "2019-10-20 21:34:01", "content": "Request: Camera &amp; Mount Recommendations for Rugged Recycling Applications /!/ Hello everyone,\n\nI have a rather unusual application, and so my frail knowledge in cameras calls for the cavalry that is this sub.\n\nI  am conducting research in recycling facilities. To keep it short, the  garbage stream needs to be studied in order to develop better machines  for sorting. There was no publicly available database of recyclable  stream footage, and so my group has to make their own footage. We need  to film a couple of hours of garbage stream.\n\n\\*\\*Essentially\\*\\*—I  have to select and install a camera in the industrial hellhole that is a  recycling facility. The camera may have to be mounted on giant machines  that vibrate. The goal is to record hours of incoming trash, before,  and after sorting. Naturally, two cameras needed. One prior to, and one  after sorting.\n\n\\*\\*Additionally\\*\\*—I  have to select not only a camera, but also an adequate mount/attachment  system. I might also need a damper to reduce vibrations. Perhaps you  know of a standard/conventional/better way of handling vibrations when  needing to shoot footage; a way that doesn't involve an ad-hoc DIY  solution using mechanical dampers.\n\nThe  camera won't exactly be punched, but it will be in a filthy  environment, where moisture, temperature, and cleanliness are  unpredictable.\n\nThe only thing we  could think of is a GoPro, since it is built for extreme conditions, yet  I have close to no idea if its mount is adequate, or if there is a way  to reduce vibrations without resorting to mechanical dampers.\n\nDoes anyone have any ideas? Or at least know which directions to point me to?\n\nYour help is immensely appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/dkq97j/request_camera_mount_recommendations_for_rugged/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "request: camera &amp; mount recommendations for rugged recycling applications /!/ hello everyone,\n\ni have a rather unusual application, and so my frail knowledge in cameras calls for the cavalry that is this sub.\n\ni  am conducting research in recycling facilities. to keep it short, the  garbage stream needs to be studied in order to develop better machines  for sorting. there was no publicly available database of recyclable  stream footage, and so my group has to make their own footage. we need  to film a couple of hours of garbage stream.\n\n\\*\\*essentially\\*\\*—i  have to select and install a camera in the industrial hellhole that is a  recycling facility. the camera may have to be mounted on giant machines  that vibrate. the goal is to record hours of incoming trash, before,  and after sorting. naturally, two cameras needed. one prior to, and one  after sorting.\n\n\\*\\*additionally\\*\\*—i  have to select not only a camera, but also an adequate mount/attachment  system. i might also need a damper to reduce vibrations. perhaps you  know of a standard/conventional/better way of handling vibrations when  needing to shoot footage; a way that doesn't involve an ad-hoc -----> diy !!!   solution using mechanical dampers.\n\nthe  camera won't exactly be punched, but it will be in a filthy  environment, where moisture, temperature, and cleanliness are  unpredictable.\n\nthe only thing we  could think of is a gopro, since it is built for extreme conditions, yet  i have close to no idea if its mount is adequate, or if there is a way  to reduce vibrations without resorting to mechanical dampers.\n\ndoes anyone have any ideas? or at least know which directions to point me to?\n\nyour help is immensely appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 82738, "year": "2019"}], "name": "diyCameras2019"}