{"interestingcomments": [{"Unnamed: 0": 216289, "autor": "9joshhernandez8", "date": 1590472959000, "content": "Looking for specific focus attachment for camera /!/ So I’m clueless when it comes to finding attachments that do exist but not knowing how to explain or trying to lookup a specific name for things. \n\nBasically I use a RED One Mysterium X camera for recording church services &amp; the biggest hassle is manually trying to focus the lens on specific people when we pan. I was hoping is someone could help me find, if possible, like an arm extension that has the same focus &amp; zoom functionality or something I can map it to so it eliminates the need &amp; time for going to the actual lens to change focus &amp; such. It’s a very large lens &amp; is almost arms length from the back of the camera to the focus wheel &amp; very annoying trying to reach to it for a small detail fix. \n\nThanks in advance! Hope I explained enough for it to make sense!", "link": "https://www.reddit.com/r/Cameras/comments/gqrfg1/looking_for_specific_focus_attachment_for_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "looking for specific focus attachment for camera /!/ so i’m clueless when it comes to finding attachments that do exist but not knowing how to explain or trying to lookup a specific name for things. \n\nbasically i use a red one mysterium x camera for recording church services &amp; the biggest hassle is manually trying to focus the lens on specific people when we pan. i was hoping is someone could help me find, if possible, like an arm extension that has the same focus &amp; zoom functionality or something i can -----> map !!!  it to so it eliminates the need &amp; time for going to the actual lens to change focus &amp; such. it’s a very large lens &amp; is almost arms length from the back of the camera to the focus wheel &amp; very annoying trying to reach to it for a small detail fix. \n\nthanks in advance! hope i explained enough for it to make sense!", "sortedWord": "None", "identifyer": 10706, "year": "2020"}], "name": "mapCameras2020"}