{"interestingcomments": [{"Unnamed: 0": 177415, "autor": "MichelleEllyn", "date": 1521910022000, "content": "Can you recommend a casual camera bag / day bag for travel that won't kill my shoulders? /!/ I'm personally not a fan of backpacks while traveling abroad. I'm very petite so they usually overtake my small frame, plus I like to be able to keep a good eye on my belongings.\n\nI usually just carry a medium size purse with my Nikon D40, water bottle, protein bar, passport stuff, and some maps, but this setup is not sustainable. My shoulders get pretty sore after a few hours. Any recommendations are helpful! Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/86u8fw/can_you_recommend_a_casual_camera_bag_day_bag_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "can you recommend a casual camera bag / day bag for travel that won't kill my shoulders? /!/ i'm personally not a fan of backpacks while traveling abroad. i'm very petite so they usually overtake my small frame, plus i like to be able to keep a good eye on my belongings.\n\ni usually just carry a medium size purse with my nikon d40, water bottle, protein bar, passport stuff, and some -----> maps !!! , but this setup is not sustainable. my shoulders get pretty sore after a few hours. any recommendations are helpful! thanks!", "sortedWord": "None", "identifyer": 69841, "year": "2018"}, {"Unnamed: 0": 180170, "autor": "e-consystems", "date": 1532331025000, "content": "Depth Measurement with Tara USB Stereo Camera at 50fps in NVIDIA Jetson TX2 /!/  A demo of depth measurement with Tara USB Stereo Camera in NVIDIA®  Jetson TX2 (Cuda Accelerated). GPU accelerated depth map at 50fps.  Tara is a UVC- compliant 3D Stereo camera based on MT9V024 stereo sensor from ON Semiconductor.  Watch &amp; Share : [https://youtu.be/alnD\\_bHhTJk](https://youtu.be/alnD_bHhTJk)", "link": "https://www.reddit.com/r/Cameras/comments/9151e7/depth_measurement_with_tara_usb_stereo_camera_at/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "depth measurement with tara usb stereo camera at 50fps in nvidia jetson tx2 /!/  a demo of depth measurement with tara usb stereo camera in nvidia®  jetson tx2 (cuda accelerated). gpu accelerated depth -----> map !!!  at 50fps.  tara is a uvc- compliant 3d stereo camera based on mt9v024 stereo sensor from on semiconductor.  watch &amp; share : [https://youtu.be/alnd\\_bhhtjk](https://youtu.be/alnd_bhhtjk)", "sortedWord": "None", "identifyer": 72641, "year": "2018"}], "name": "mapCameras2018"}