{"interestingcomments": [{"Unnamed: 0": 188813, "autor": "ceryssienna", "date": 1573283448000, "content": "Which camera? RX100 series /!/ Hi guys!\n\nI'm not sure if this is the right place to post this but I've been planning on getting a point and shoot camera (I currently have a mirrorless but I travel quite a lot and find it a pain to carry around with me). My phone is the Samsung s10 but tbh I don't really like draining my phone batt as I'm often out for a while so I use it for other things like maps/communicating.  I also have never really liked the Samsung phone camera that much (I know the specs say it's good but I've always found I didn't like the photos much compares with iphone and my other camera).\n\n&amp;#x200B;\n\nSo, I was looking at the RX100 series and was wondering which is the best to get? I was considering VI as I'm not that interested in a microphone port and I really like the zoom on it compared with lower marks. Do you think this camera is worth it or are there any better alternatives?\n\nMy main use will be for travel and just daily usage, I also go to a lot of nature areas a lot (mountains/temples etc.) so would also like to capture these. I probably won't be capturing anything overly fast moving, maybe animals/pets or nature type things but nothing too fast. \n\n&amp;#x200B;\n\nAny thoughts?", "link": "https://www.reddit.com/r/Cameras/comments/dtspnk/which_camera_rx100_series/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "which camera? rx100 series /!/ hi guys!\n\ni'm not sure if this is the right place to post this but i've been planning on getting a point and shoot camera (i currently have a mirrorless but i travel quite a lot and find it a pain to carry around with me). my phone is the samsung s10 but tbh i don't really like draining my phone batt as i'm often out for a while so i use it for other things like -----> maps !!! /communicating.  i also have never really liked the samsung phone camera that much (i know the specs say it's good but i've always found i didn't like the photos much compares with iphone and my other camera).\n\n&amp;#x200b;\n\nso, i was looking at the rx100 series and was wondering which is the best to get? i was considering vi as i'm not that interested in a microphone port and i really like the zoom on it compared with lower marks. do you think this camera is worth it or are there any better alternatives?\n\nmy main use will be for travel and just daily usage, i also go to a lot of nature areas a lot (mountains/temples etc.) so would also like to capture these. i probably won't be capturing anything overly fast moving, maybe animals/pets or nature type things but nothing too fast. \n\n&amp;#x200b;\n\nany thoughts?", "sortedWord": "None", "identifyer": 81497, "year": "2019"}, {"Unnamed: 0": 189285, "autor": "Syntaximus", "date": 1546370699000, "content": "I need a fisheye webcam for recording the night sky (particularly meteoroids). Any advice on what to buy? /!/  \n\nI'm kicking around the idea of setting up 2 webcams about 30 miles apart to record meteors so that I can use the data to generate their approximate 3-D paths through the atmosphere. After working out the bugs I'd like to have the real-time meteor paths visible online so people from my state can look up info on meteors they see in person. I got the idea after people were scrambling for information on the recent \\[Michigan Fireball\\]([https://www.youtube.com/watch?v=r6gYgFth7r8](https://www.youtube.com/watch?v=r6gYgFth7r8)) and where possible fragments might have landed. So you could see a meteor, go straight to your computer, and see a 3-D map of exactly where that meteor traveled in relation to your house.\n\nI figure I'll need a black and white camera with good enough resolution that I can see individual stars; I think I might use the stars (polaris is an obvious candidate) to calibrate the cameras so that they both agree which direction is north and which direction is straight up so that the calculated path of the burning meteor is somewhat accurate. I'll also need the camera to take 1-2 second time-lapse pictures so that they can record each meteor from beginning to end.\n\nIt's going to be a long project rife with programming hurdles to climb, which is why I like the idea. Any advice? Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/abl0qw/i_need_a_fisheye_webcam_for_recording_the_night/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i need a fisheye webcam for recording the night sky (particularly meteoroids). any advice on what to buy? /!/  \n\ni'm kicking around the idea of setting up 2 webcams about 30 miles apart to record meteors so that i can use the data to generate their approximate 3-d paths through the atmosphere. after working out the bugs i'd like to have the real-time meteor paths visible online so people from my state can look up info on meteors they see in person. i got the idea after people were scrambling for information on the recent \\[michigan fireball\\]([https://www.youtube.com/watch?v=r6gygfth7r8](https://www.youtube.com/watch?v=r6gygfth7r8)) and where possible fragments might have landed. so you could see a meteor, go straight to your computer, and see a 3-d -----> map !!!  of exactly where that meteor traveled in relation to your house.\n\ni figure i'll need a black and white camera with good enough resolution that i can see individual stars; i think i might use the stars (polaris is an obvious candidate) to calibrate the cameras so that they both agree which direction is north and which direction is straight up so that the calculated path of the burning meteor is somewhat accurate. i'll also need the camera to take 1-2 second time-lapse pictures so that they can record each meteor from beginning to end.\n\nit's going to be a long project rife with programming hurdles to climb, which is why i like the idea. any advice? thanks!", "sortedWord": "None", "identifyer": 81987, "year": "2019"}], "name": "mapCameras2019"}