{"interestingcomments": [{"Unnamed: 0": 212180, "autor": "secondhandweapon", "date": 1600537893000, "content": "Looking for a point-and-shoot that saves portrait images on disk as portrait (as opposed to \"landscape + EXIF metadata for orientation\") /!/ Bit of a weird ask, but I'm a software developer, not a camera guy, and I'm not sure how to look this up.\n\nA company that I do software development for has been using an iPod Touch for product photos. The problem is that iOS stores images on disk in landscape format, and uses EXIF metadata to set the orientation.\n\nThe legacy software that they use does not respect the EXIF metadata, so they see the pictures as \"sideways\", rotate them in Microsoft Office Photo Editor (which changes the image data but doesn't clear out the EXIF orientation flag)... and when they're uploaded to the web store, they show up sideways - because they've been rotated, but still have an orientation flag set.\n\nSo what I am looking for, is a point-and-shoot that will save photos taken in landscape, in a landscape format, without writing any EXIF metadata. Getting them a different camera will be much, much easier than changing their internal processes, so that's the route I want to go.\n\nThanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/ivx9v6/looking_for_a_pointandshoot_that_saves_portrait/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "looking for a point-and-shoot that saves portrait images on disk as portrait (as opposed to \"landscape + exif metadata for -----> orientation !!! \") /!/ bit of a weird ask, but i'm a software developer, not a camera guy, and i'm not sure how to look this up.\n\na company that i do software development for has been using an ipod touch for product photos. the problem is that ios stores images on disk in landscape format, and uses exif metadata to set the orientation.\n\nthe legacy software that they use does not respect the exif metadata, so they see the pictures as \"sideways\", rotate them in microsoft office photo editor (which changes the image data but doesn't clear out the exif orientation flag)... and when they're uploaded to the web store, they show up sideways - because they've been rotated, but still have an orientation flag set.\n\nso what i am looking for, is a point-and-shoot that will save photos taken in landscape, in a landscape format, without writing any exif metadata. getting them a different camera will be much, much easier than changing their internal processes, so that's the route i want to go.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 6195, "year": "2020"}, {"Unnamed: 0": 213121, "autor": "JarJarAwakens", "date": 1606672619000, "content": "Need help deciding which tripod to get /!/ Hi, I currently have a Slik Pro 500 HD tripod and feel I've outgrown it for my landscape photography. I want to upgrade to either the Arca Swiss or Manfrotto RC2 system. My main issues include the camera twisting on the plate that attaches to the tripod especially when the camera is in portrait orientation and the aim gradually creeps downward. I would also like something lighter and that I don't have to constantly switch the plate between lens and camera body while making sure it stays aligned.\n\nWhich system do you recommend and can you recommend a tripod/head, camera plate, and lens plate? I prefer a pan head and I would need plates for a Nikon D5500 DSLR and a Sigma 50-100mm f/1.8 DC HSM Art Lens. Budget $1000 USD and I live in the USA.", "link": "https://www.reddit.com/r/Cameras/comments/k3dv5t/need_help_deciding_which_tripod_to_get/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "need help deciding which tripod to get /!/ hi, i currently have a slik pro 500 hd tripod and feel i've outgrown it for my landscape photography. i want to upgrade to either the arca swiss or manfrotto rc2 system. my main issues include the camera twisting on the plate that attaches to the tripod especially when the camera is in portrait -----> orientation !!!  and the aim gradually creeps downward. i would also like something lighter and that i don't have to constantly switch the plate between lens and camera body while making sure it stays aligned.\n\nwhich system do you recommend and can you recommend a tripod/head, camera plate, and lens plate? i prefer a pan head and i would need plates for a nikon d5500 dslr and a sigma 50-100mm f/1.8 dc hsm art lens. budget $1000 usd and i live in the usa.", "sortedWord": "None", "identifyer": 7235, "year": "2020"}], "name": "orientationCameras2020"}