{"interestingcomments": [{"Unnamed: 0": 220951, "autor": "eighttfr", "date": 1614389652000, "content": "Looking for a Place to have my Camera Repaired - Sears, Roebuck and Co. Solid State VHS Camera /!/ I've been searching online but I can't seem to find a place where I could ship my camera off to have it repaired. \n\nSolid State VHS  Movie Camera\n\nSerial No. 80925922\n\nModel No. 934.53743850\n\nSears, Roebuck and Co.\n\n&amp;#x200B;\n\nI am looking to repair the above camera as the gears inside have \"melted\" away. I am looking to achieve full functionality of this camera as it will be used regularly. \n\nThe main issues are that the on-board microphone cage is corroded which leads me to believe that the microphone itself does not work. The eject button works but the part where the camera will open up for VHS tape will not open. Instead it makes a loud whurring noise that loops and it will not open. Some buttons on the camera will not press down or are hard to press in general. \n\nI have never been able to record anything on this camera so I am uncertain of any other issues that remain with it. I am also looking for any and all information that could be provided on the operational use of the camera as I do not have a manual for it on hand as I purchased it from a garage sale.", "link": "https://www.reddit.com/r/Cameras/comments/ltd3v3/looking_for_a_place_to_have_my_camera_repaired/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "looking for a place to have my camera repaired - sears, roebuck and co. solid state vhs camera /!/ i've been searching online but i can't seem to -----> find !!!  -----> a !!!  -----> place !!!  where i could ship my camera off to have it repaired. \n\nsolid state vhs  movie camera\n\nserial no. 80925922\n\nmodel no. 934.53743850\n\nsears, roebuck and co.\n\n&amp;#x200b;\n\ni am looking to repair the above camera as the gears inside have \"melted\" away. i am looking to achieve full functionality of this camera as it will be used regularly. \n\nthe main issues are that the on-board microphone cage is corroded which leads me to believe that the microphone itself does not work. the eject button works but the part where the camera will open up for vhs tape will not open. instead it makes a loud whurring noise that loops and it will not open. some buttons on the camera will not press down or are hard to press in general. \n\ni have never been able to record anything on this camera so i am uncertain of any other issues that remain with it. i am also looking for any and all information that could be provided on the operational use of the camera as i do not have a manual for it on hand as i purchased it from a garage sale.", "sortedWord": "None", "identifyer": 15484, "year": "2021"}, {"Unnamed: 0": 224603, "autor": "Schadenfreude_9", "date": 1610168784000, "content": "Hasselblad /!/ Hello, I’m trying to find a good place to get a hasselblad from. I know they can be found on eBay I’m just hoping to find a place with a bit more credibility around cameras (knowing it’s in good condition) considering the amount they cost. \nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/ktkg1i/hasselblad/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "hasselblad /!/ hello, i’m trying to find a good place to get a hasselblad from. i know they can be found on ebay i’m just hoping to -----> find !!!  -----> a !!!  -----> place !!!  with -----> a !!!  bit more credibility around cameras (knowing it’s in good condition) considering the amount they cost. \nthank you!", "sortedWord": "None", "identifyer": 19310, "year": "2021"}, {"Unnamed: 0": 225749, "autor": "Just4Questions9", "date": 1628469945000, "content": "Small cameras? /!/ I was hoping I could help one of my friends find a place or legit site where small cameras with good video and audio quality are available? She’s in a really tough situation and need proof of something. Thanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/p0qrlo/small_cameras/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "small cameras? /!/ i was hoping i could help one of my friends -----> find !!!  -----> a !!!  -----> place !!!  or legit site where small cameras with good video and audio quality are available? she’s in a really tough situation and need proof of something. thanks in advance!", "sortedWord": "None", "identifyer": 20498, "year": "2021"}], "name": "placeCameras2021"}