{"interestingcomments": [{"Unnamed: 0": 208153, "autor": "Zack_Akai", "date": 1590337220000, "content": "Help a newbie choose a camera for shooting video /!/ I'm not super knowledgeable about cameras so I figured I'd ask around here for advice.  I'm trying to find a relatively inexpensive camera primarily for recording video (still photography would also be nice but it's a secondary consideration).  My two primary use cases are:\n\n1:  for filming a human subject in a well-lit room from about the waist or chest up (think your typical YouTube vlogger setup)\n\n2: for streaming a DnD campaign where the camera will be positioned in a top-down view several feet above the game mat on a mount (again the table will be well-lit).  \n\nI'm not expecting ultra-high image quality, my primary concern is simply that it provides good image quality in a well-lit environment.  1080p @ 60fps is fine, 4k or higher framerates would be a bonus but certainly aren't required.  It should also be able to stream video real time onto a computer via a USB cable (I figure most new cameras these days can do that but just wanted to make sure).  I'm looking to spend around $600 or less on just the camera (and an appropriate lens if it's necessary), I've already got lighting, audio, etc already taken care of.", "link": "https://www.reddit.com/r/Cameras/comments/gpsgl0/help_a_newbie_choose_a_camera_for_shooting_video/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "help a newbie choose a camera for shooting video /!/ i'm not super knowledgeable about cameras so i figured i'd ask around here for advice.  i'm trying to find a relatively inexpensive camera primarily for recording video (still photography would also be nice but it's a secondary consideration).  my two primary use cases are:\n\n1:  for filming a human subject in a well-lit room from about the waist or chest up (think your typical youtube vlogger setup)\n\n2: for streaming a dnd campaign where the camera will be -----> positioned !!!  in a top-down view several feet above the game mat on a mount (again the table will be well-lit).  \n\ni'm not expecting ultra-high image quality, my primary concern is simply that it provides good image quality in a well-lit environment.  1080p @ 60fps is fine, 4k or higher framerates would be a bonus but certainly aren't required.  it should also be able to stream video real time onto a computer via a usb cable (i figure most new cameras these days can do that but just wanted to make sure).  i'm looking to spend around $600 or less on just the camera (and an appropriate lens if it's necessary), i've already got lighting, audio, etc already taken care of.", "sortedWord": "None", "identifyer": 1734, "year": "2020"}, {"Unnamed: 0": 208413, "autor": "Dupdopy", "date": 1606078209000, "content": "Sony ZV-1 owners - does your camera produce a strange hum/noise? /!/ Hi!\n\nGot brand new ZV-1 this summer and it's a great little beast for beginners!\n\nSome time ago I noticed that it produces strange noise/hum, so to speak. I don't remember it producing hum when I just got it. But I am not 100% sure it wasn't like that, because I have not paid attention to that until now.\n\nHere's the deal:  \n1. When the camera is turned on and the lens is in it's closed position, the device is dead silent.  \n2. When the camera is turned on and the lens is in it's open position (ready to shoot), noise/hum appears. I feel it's coming from the lens area. I can hear the hum if the device is in my hands, so maybe 20-30cm from my ears (the hum gets absolutely distinct, if I take the device closer to my ear).   \nIt's not the sound when camera adjusts focus - this is expected and understandable.\n\nThe sound I hear is constant low hum/noise coming from the lens area. And only when it is open.\n\nTechnically, everything works just fine and the camera has been kept very carefully. Never fell or received any physical damage.\n\nAnyone with a ZV-1 could listen to their device and let me know if it behaves in the same way?  \nI am trying to understand if this is normal or not. If not, will have to talk to my local dealer.\n\nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/jz38dc/sony_zv1_owners_does_your_camera_produce_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony zv-1 owners - does your camera produce a strange hum/noise? /!/ hi!\n\ngot brand new zv-1 this summer and it's a great little beast for beginners!\n\nsome time ago i noticed that it produces strange noise/hum, so to speak. i don't remember it producing hum when i just got it. but i am not 100% sure it wasn't like that, because i have not paid attention to that until now.\n\nhere's the deal:  \n1. when the camera is turned on and the lens is in it's closed -----> position !!! , the device is dead silent.  \n2. when the camera is turned on and the lens is in it's open position (ready to shoot), noise/hum appears. i feel it's coming from the lens area. i can hear the hum if the device is in my hands, so maybe 20-30cm from my ears (the hum gets absolutely distinct, if i take the device closer to my ear).   \nit's not the sound when camera adjusts focus - this is expected and understandable.\n\nthe sound i hear is constant low hum/noise coming from the lens area. and only when it is open.\n\ntechnically, everything works just fine and the camera has been kept very carefully. never fell or received any physical damage.\n\nanyone with a zv-1 could listen to their device and let me know if it behaves in the same way?  \ni am trying to understand if this is normal or not. if not, will have to talk to my local dealer.\n\nthank you!", "sortedWord": "None", "identifyer": 2022, "year": "2020"}, {"Unnamed: 0": 208980, "autor": "Auto_Fac", "date": 1579109929000, "content": "Canon M50 EVF sensitivity question /!/ Hey all,\n\nThis is a pretty specific question but hoping maybe an M50 user might have some insight.\n\nI just bought this camera a few weeks ago (Jan 1) and it's been great so far. Today on my way to work it was snowing. Where I parked on the street I had a nice view down the street with big fat flakes twirling in the air so I took out the camera and took some shots.\n\nI had the camera vertical and low, and positioned the big LCD screen so it was facing up toward the sky so I could see. Some snow flakes fell on it - not a lot, but some - and when I saw this I wiped them away with my dry shirt.\n\nA moment after the LCD screen went black and stopped working. I got worried and really cheesed that it would be *that* sensitive to weather, and thought about driving in tonight and returning it. I know that it is not weather sealed, but an LCD screen should be able to have a few flakes of snow fall on it and not be ruined.\n\nI took it inside and set it down for a while and when I came back to try it the screen worked.\n\nIt then occurred to me that it may not have been water on the screen but water on the EVF sensor. I am constantly frustrated by how sensitive it is and how it will black the screen out and show it through the EVF if my hand is near it but still a few inches away.\n\n**So...** I am wondering if anybody knows if water droplets on the EVF sensor (that determines whether your eye is front of it) could cause it to think my eye was in front of the EVF?\n\nBefore I put it down and walked away I had dried a little bit of water I saw in and around the eyepiece with my shirt and it clicked after that maybe the LCD screen was fine and that it was just the sensor being blocked by water.\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/ep5fmw/canon_m50_evf_sensitivity_question/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "canon m50 evf sensitivity question /!/ hey all,\n\nthis is a pretty specific question but hoping maybe an m50 user might have some insight.\n\ni just bought this camera a few weeks ago (jan 1) and it's been great so far. today on my way to work it was snowing. where i parked on the street i had a nice view down the street with big fat flakes twirling in the air so i took out the camera and took some shots.\n\ni had the camera vertical and low, and -----> positioned !!!  the big lcd screen so it was facing up toward the sky so i could see. some snow flakes fell on it - not a lot, but some - and when i saw this i wiped them away with my dry shirt.\n\na moment after the lcd screen went black and stopped working. i got worried and really cheesed that it would be *that* sensitive to weather, and thought about driving in tonight and returning it. i know that it is not weather sealed, but an lcd screen should be able to have a few flakes of snow fall on it and not be ruined.\n\ni took it inside and set it down for a while and when i came back to try it the screen worked.\n\nit then occurred to me that it may not have been water on the screen but water on the evf sensor. i am constantly frustrated by how sensitive it is and how it will black the screen out and show it through the evf if my hand is near it but still a few inches away.\n\n**so...** i am wondering if anybody knows if water droplets on the evf sensor (that determines whether your eye is front of it) could cause it to think my eye was in front of the evf?\n\nbefore i put it down and walked away i had dried a little bit of water i saw in and around the eyepiece with my shirt and it clicked after that maybe the lcd screen was fine and that it was just the sensor being blocked by water.\n\nthanks!", "sortedWord": "None", "identifyer": 2630, "year": "2020"}, {"Unnamed: 0": 209053, "autor": "Kurtisaurus-Rex", "date": 1583714278000, "content": "Newbie looking for advice on a new camera. /!/ Hey gang. Looking to purchase a new camera around $300 max. I dont even know what the good standard in quality is. I would like a nice complete package, sd card, case, accessories etc. Can anyone help me out? Marketing position where I'll be photoshopping a ton of photos so anything would be helpful!", "link": "https://www.reddit.com/r/Cameras/comments/ffm7sm/newbie_looking_for_advice_on_a_new_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "newbie looking for advice on a new camera. /!/ hey gang. looking to purchase a new camera around $300 max. i dont even know what the good standard in quality is. i would like a nice complete package, sd card, case, accessories etc. can anyone help me out? marketing -----> position !!!  where i'll be photoshopping a ton of photos so anything would be helpful!", "sortedWord": "None", "identifyer": 2705, "year": "2020"}, {"Unnamed: 0": 209246, "autor": "bisrondu", "date": 1585392189000, "content": "Hey guys,how would I go about with setting up a camera in a permanent position to take a few photos daily during certain times /!/ I'd like to set up a camera for a construction site to take progress photos every day for a long duration how would I go about with doing that?", "link": "https://www.reddit.com/r/Cameras/comments/fqhtqr/hey_guyshow_would_i_go_about_with_setting_up_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hey guys,how would i go about with setting up a camera in a permanent -----> position !!!  to take a few photos daily during certain times /!/ i'd like to set up a camera for a construction site to take progress photos every day for a long duration how would i go about with doing that?", "sortedWord": "None", "identifyer": 2931, "year": "2020"}, {"Unnamed: 0": 209893, "autor": "Formanent", "date": 1604294826000, "content": "This is my new to me Ricoh Super 44. Everything works perfectly but the shutter. When my grandfather gave it to me, the shutter was already wound up, which probably damaged the shutter spring. Now the shutter is stuck in the closed position. Is there any way to fix this at home?", "link": "https://www.reddit.com/r/Cameras/comments/jmht3g/this_is_my_new_to_me_ricoh_super_44_everything/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this is my new to me ricoh super 44. everything works perfectly but the shutter. when my grandfather gave it to me, the shutter was already wound up, which probably damaged the shutter spring. now the shutter is stuck in the closed -----> position !!! . is there any way to fix this at home?", "sortedWord": "None", "identifyer": 3658, "year": "2020"}, {"Unnamed: 0": 209988, "autor": "jxckyyy", "date": 1605774044000, "content": "Broken Mount on Fujifilm XT2 | any fix? /!/ Hey r/Cameras! \n\nWhen I looked at my Fuji XT2 the other day i noticed that the lenses dont lock in anymore. I also dont hear the usual click that the mount makes when the lens is in position.\n\nThe little pin that can be seen on the mount doesnt come out too far, which is the cause of this as far as I know.\n\nHas anyone ever had the same problem and how can I fix it? I really want to avoid sending it in for repair because I cant spend like 150€ on it, and also camera shops are closed due to lockdown right now.\n\nEvery comment appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/jwyzth/broken_mount_on_fujifilm_xt2_any_fix/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "broken mount on fujifilm xt2 | any fix? /!/ hey r/cameras! \n\nwhen i looked at my fuji xt2 the other day i noticed that the lenses dont lock in anymore. i also dont hear the usual click that the mount makes when the lens is in -----> position !!! .\n\nthe little pin that can be seen on the mount doesnt come out too far, which is the cause of this as far as i know.\n\nhas anyone ever had the same problem and how can i fix it? i really want to avoid sending it in for repair because i cant spend like 150€ on it, and also camera shops are closed due to lockdown right now.\n\nevery comment appreciated!", "sortedWord": "None", "identifyer": 3754, "year": "2020"}, {"Unnamed: 0": 210484, "autor": "andkablamo", "date": 1591540090000, "content": "Looking to trade my Canon for Nikon equivalent? /!/ Hi all,\n\nMassive thanks for reading! (Also apologies if I'm posting in the wrong sub)\n\nA few years ago I got a Canon E05 650D. I'd learned digital on a Nikon but thought I'd get used to the Canon. Anyway, after a few years of use I still absolutely hate it so I'm looking to trade. I'm not in a position to spend big bucks and have no problem using an old model so could anyone recommend something in a Nikon that would be an equivalent model (price-wise) to this?", "link": "https://www.reddit.com/r/Cameras/comments/gyddcw/looking_to_trade_my_canon_for_nikon_equivalent/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking to trade my canon for nikon equivalent? /!/ hi all,\n\nmassive thanks for reading! (also apologies if i'm posting in the wrong sub)\n\na few years ago i got a canon e05 650d. i'd learned digital on a nikon but thought i'd get used to the canon. anyway, after a few years of use i still absolutely hate it so i'm looking to trade. i'm not in a -----> position !!!  to spend big bucks and have no problem using an old model so could anyone recommend something in a nikon that would be an equivalent model (price-wise) to this?", "sortedWord": "None", "identifyer": 4277, "year": "2020"}, {"Unnamed: 0": 210526, "autor": "thegrandnil", "date": 1593039779000, "content": "d850 vs a7r4 for Adventure/Sports /!/ The other day I hiked up a mountain too get A good angle of a supercell storm as it hit a small town in a valley. After a while of capturing some good shots, a heavy wall of rain blew over my position and and completely destroyed my good 'ol non-water-resistant d80.\n\nThis sucks because I was really close too landing my first gig shooting local horse-riding events.\n\nI'm currently in college and Ive been saving up my pennies too buy a new camera for a while now. Basically what im asking is which camera suits my needs the best?\n\nIs the a7r4 tough enough?", "link": "https://www.reddit.com/r/Cameras/comments/hfbiym/d850_vs_a7r4_for_adventuresports/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d850 vs a7r4 for adventure/sports /!/ the other day i hiked up a mountain too get a good angle of a supercell storm as it hit a small town in a valley. after a while of capturing some good shots, a heavy wall of rain blew over my -----> position !!!  and and completely destroyed my good 'ol non-water-resistant d80.\n\nthis sucks because i was really close too landing my first gig shooting local horse-riding events.\n\ni'm currently in college and ive been saving up my pennies too buy a new camera for a while now. basically what im asking is which camera suits my needs the best?\n\nis the a7r4 tough enough?", "sortedWord": "None", "identifyer": 4322, "year": "2020"}, {"Unnamed: 0": 211159, "autor": "acescracked5280", "date": 1578511492000, "content": "New Crop Sensor (T7i, etc) or Used Full Frame? /!/ ello. I’ve been doing photography as a hobby for a longtime, but never really was able to expand on it because of financial restraints. I used to shoot with an old Sony a200, but sold it a while ago. So recently it’s just been my iPhone haha.\n\nI’m in a position now where I’ll be able to afford a new camera, so I’ve been researching option. I’m not stuck on Canon, but just using these models for example. \n\nThe first option that stood out to me is the Canon T7i. The 80D also caught my attention, but at that point I feel like it’d be better to just shell out the extra money on a full-frame.\n\nThis led me to start looking into full-frame bodies - which I don’t really need as I am still relatively new to photography - but I feel like it could allow more room for creativity, and I may want to upgrade to one eventually anyways.\n\nSince they’re outside my price range, I was looking for some used ones. I found some models like Canon 6d, 5d mark ii, etc. around the same price as a new T7i. \n\nWhat do you guys think? Would it make more sense to buy a new T7i, and get full-frame lenses overtime and eventually transition?\n\nOr to just get a used full-frame form the start? Are used cameras like this typically still in good condition?", "link": "https://www.reddit.com/r/Cameras/comments/elxg2q/new_crop_sensor_t7i_etc_or_used_full_frame/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new crop sensor (t7i, etc) or used full frame? /!/ ello. i’ve been doing photography as a hobby for a longtime, but never really was able to expand on it because of financial restraints. i used to shoot with an old sony a200, but sold it a while ago. so recently it’s just been my iphone haha.\n\ni’m in a -----> position !!!  now where i’ll be able to afford a new camera, so i’ve been researching option. i’m not stuck on canon, but just using these models for example. \n\nthe first option that stood out to me is the canon t7i. the 80d also caught my attention, but at that point i feel like it’d be better to just shell out the extra money on a full-frame.\n\nthis led me to start looking into full-frame bodies - which i don’t really need as i am still relatively new to photography - but i feel like it could allow more room for creativity, and i may want to upgrade to one eventually anyways.\n\nsince they’re outside my price range, i was looking for some used ones. i found some models like canon 6d, 5d mark ii, etc. around the same price as a new t7i. \n\nwhat do you guys think? would it make more sense to buy a new t7i, and get full-frame lenses overtime and eventually transition?\n\nor to just get a used full-frame form the start? are used cameras like this typically still in good condition?", "sortedWord": "None", "identifyer": 4983, "year": "2020"}, {"Unnamed: 0": 212149, "autor": "Exculpation", "date": 1600687244000, "content": "Looking for a videocamera /!/ Hi,\n\nI must be confess that I don't have a lot of knowledge about cameras so I'm looking towards the Reddit hivemind for help. \n\nDue to the coronavirus I'm trying to look into a videocamera to record meetings of my local philosophy club that also includes members of the age of 80+ and for that reason avoid physical meetings. Important for us is that the image quality and the sound will be recorded fine. Timing will be done from a static position (for example a tripod). The approximate budget is around €300, but should for example €400 give a much better result that would also be fine. Should it be relevant, I'm living in the Netherlands. \n\nSo far the only suggestion from the members has been a GoPro Hero, but those are action cameras and to my knowledge their mobility impacts the quality by a lot. \n\nThat you so much for your help!", "link": "https://www.reddit.com/r/Cameras/comments/iwyhbi/looking_for_a_videocamera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for a videocamera /!/ hi,\n\ni must be confess that i don't have a lot of knowledge about cameras so i'm looking towards the reddit hivemind for help. \n\ndue to the coronavirus i'm trying to look into a videocamera to record meetings of my local philosophy club that also includes members of the age of 80+ and for that reason avoid physical meetings. important for us is that the image quality and the sound will be recorded fine. timing will be done from a static -----> position !!!  (for example a tripod). the approximate budget is around €300, but should for example €400 give a much better result that would also be fine. should it be relevant, i'm living in the netherlands. \n\nso far the only suggestion from the members has been a gopro hero, but those are action cameras and to my knowledge their mobility impacts the quality by a lot. \n\nthat you so much for your help!", "sortedWord": "None", "identifyer": 6156, "year": "2020"}, {"Unnamed: 0": 212321, "autor": "ST3ALTHPSYCH0", "date": 1602087809000, "content": "Sony rx10 IV or Samsung S20+ for higher fps filming /!/ I figure that between these 2 choices that the overwhelming answer will be \"go with the Sony\", but I had a few other questions to help me with deciding.\n\n1. Do both still capture audio at high frame rates? Until I played with the high speed mode on my OnePlus 6T, I would've thought this was a dumb question, but here we are.\n\n2. Do either limit the length of a high speed capture?\n\n3. Do either/both save the capture as a lower framerate video? Again, I'm thinking of other cell phone cameras that record at higher FPS, but save to a 30 FPS file.\n\nI'm sure I have other questions, and I know that both options aren't necessarily the best choice for this application, but they seem to be my best budget options until I'm in a position to start looking at a Chronos.\n\nThank you for any help!", "link": "https://www.reddit.com/r/Cameras/comments/j6ty0p/sony_rx10_iv_or_samsung_s20_for_higher_fps_filming/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony rx10 iv or samsung s20+ for higher fps filming /!/ i figure that between these 2 choices that the overwhelming answer will be \"go with the sony\", but i had a few other questions to help me with deciding.\n\n1. do both still capture audio at high frame rates? until i played with the high speed mode on my oneplus 6t, i would've thought this was a dumb question, but here we are.\n\n2. do either limit the length of a high speed capture?\n\n3. do either/both save the capture as a lower framerate video? again, i'm thinking of other cell phone cameras that record at higher fps, but save to a 30 fps file.\n\ni'm sure i have other questions, and i know that both options aren't necessarily the best choice for this application, but they seem to be my best budget options until i'm in a -----> position !!!  to start looking at a chronos.\n\nthank you for any help!", "sortedWord": "None", "identifyer": 6343, "year": "2020"}, {"Unnamed: 0": 212893, "autor": "dieeabeetus", "date": 1603753605000, "content": "Upgrading Nikon D5600 to EOS RP /!/ Hello redditors,\n\nI am currently in a position where I can upgrade my Nikon D5600 paired with a sigma 17-50mm F 2.8 to an EOS RP with the kit lens (24-105mm F4-7.1). I am interested in astrophotography. Would this be a good upgrade? I know that full frame has a better sensor and better results when increasing ISO. Thank you in advance!", "link": "https://www.reddit.com/r/Cameras/comments/jipk1e/upgrading_nikon_d5600_to_eos_rp/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrading nikon d5600 to eos rp /!/ hello redditors,\n\ni am currently in a -----> position !!!  where i can upgrade my nikon d5600 paired with a sigma 17-50mm f 2.8 to an eos rp with the kit lens (24-105mm f4-7.1). i am interested in astrophotography. would this be a good upgrade? i know that full frame has a better sensor and better results when increasing iso. thank you in advance!", "sortedWord": "None", "identifyer": 6992, "year": "2020"}, {"Unnamed: 0": 213038, "autor": "jstopyra", "date": 1605471727000, "content": "Which mirrorless for an enthusiast? /!/ I have started with a Nikon D3400 about 4 years ago, and I'm ready to upgrade my camera because of the limitations of the D3400.\n\nI'm not a pro nor do I share my photos anywhere, I'm just doing it for my own pleasure/hobby. \n\nI like to take photos of nature(animals, plants, trees), astrophotography (moon, stars, time lapse, long exposure photos), cars(when I go on car rides to coastal roads), and portrait (I'm not great at it, but this is something I'm currently working on getting better at)\n\nAfter a very long and dreadful research, I have narrowed it down to 3 cameras:\n-Canon EOS R (or RP)\n-Nikon Z5\n-Sony a7iii\n\nI'm looking for suggestions on which of those cameras should I go for. The most important think I'm looking for is comfortability, and ease of use and access to features.\n\n-------------------\n\nNikon Z5:\nThe good:\nSince I've been using a Nikon for about 4 years now, playing around with the Z5 was super easy and intuitive.\nI've heard it's one of the best cameras for low light photography, which is nice for portrait photos and astrophotography.\n\nThe bad:\nI hate the fact that the rear screen is a tilt rather than a flip screen, especially for portrait photos, I love to take photos in a vertical position, so the tilt screen is useless here. Another somewhat big issue is the lens prices. I really like using prime lenses, but any lens I was looking at was about 2-3x the cost of the competitor brands.\n\nOverall: my number 1 pick, if it wasn't for the lens prices.\n\n-------------------\n\nCanon EOS R:\nThe good:\nGreat lens prices.\nI loved the fact that I can assign anything I want to any of the buttons.\n\nThe bad:\nSo many options within the camera menu, I kept getting lost in the menus.\nThe price of this camera is almost double the price of the other two.\nThe \"custom buttons\" we're more finicky than useful.\n\nOverall: I like the customizability, the prices of the lenses, and the rear screen, but the actual controls were not as impressive and the camera body is way more expensive than other picks.\n\n-------------------\n\nSony a7III:\nThe good:\nVery large lens selection at great prices.\n\nThe bad:\nThe controls of the camera were very confusing to me, took way longer to figure out how to change specific settings.\nThe only way to change ISO was through the digital screen, I was not able to change ISO using the dials on the camera body.\nIt is a somewhat old camera compared to the other two.\n\nOverall: The sony feels like it lands in between the Nikon and the Canon in comfortability, usability, and lens selection/pricing. \n\n\n----------------------------------------------\n\nIf you have any experience with those cameras, please let me know what you think, and please let me know if I'm wrong about any of my findings.\n\n\nEdit: (adding the main reasons I want to ditch the D3400)\nThe D3400 doesn't allow me to do time lapse and is pretty bad at long exposure photos. This camera does not support any external remotes so I cannot even shoot remotely with it.\nThe auto focus is the worst auto focus I've ever seen so I have to rely on my manual focus, which is fine for steady shots of stationary objects, but as soon as the object starts moving, I have very bad time focusing on the subject. Another issue with focusing is that I do not see it through the view finder so I have to use the rear screen to adjust my focus, and change the camera to view finder and hope the focus is still on the subject, since the dslr takes soooo much longer to snap a photo while using the rear screen.\n\nEdit 2: I'm trying to upgrade the camera so I can keep it for a few years, and not feel guilty spending more money on the gear for it.\nEvery time I've purchased anything for the D3400, I've felt like I was throwing away money, because I knew I will need to upgrade the camera at some point.", "link": "https://www.reddit.com/r/Cameras/comments/juspny/which_mirrorless_for_an_enthusiast/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "which mirrorless for an enthusiast? /!/ i have started with a nikon d3400 about 4 years ago, and i'm ready to upgrade my camera because of the limitations of the d3400.\n\ni'm not a pro nor do i share my photos anywhere, i'm just doing it for my own pleasure/hobby. \n\ni like to take photos of nature(animals, plants, trees), astrophotography (moon, stars, time lapse, long exposure photos), cars(when i go on car rides to coastal roads), and portrait (i'm not great at it, but this is something i'm currently working on getting better at)\n\nafter a very long and dreadful research, i have narrowed it down to 3 cameras:\n-canon eos r (or rp)\n-nikon z5\n-sony a7iii\n\ni'm looking for suggestions on which of those cameras should i go for. the most important think i'm looking for is comfortability, and ease of use and access to features.\n\n-------------------\n\nnikon z5:\nthe good:\nsince i've been using a nikon for about 4 years now, playing around with the z5 was super easy and intuitive.\ni've heard it's one of the best cameras for low light photography, which is nice for portrait photos and astrophotography.\n\nthe bad:\ni hate the fact that the rear screen is a tilt rather than a flip screen, especially for portrait photos, i love to take photos in a vertical -----> position !!! , so the tilt screen is useless here. another somewhat big issue is the lens prices. i really like using prime lenses, but any lens i was looking at was about 2-3x the cost of the competitor brands.\n\noverall: my number 1 pick, if it wasn't for the lens prices.\n\n-------------------\n\ncanon eos r:\nthe good:\ngreat lens prices.\ni loved the fact that i can assign anything i want to any of the buttons.\n\nthe bad:\nso many options within the camera menu, i kept getting lost in the menus.\nthe price of this camera is almost double the price of the other two.\nthe \"custom buttons\" we're more finicky than useful.\n\noverall: i like the customizability, the prices of the lenses, and the rear screen, but the actual controls were not as impressive and the camera body is way more expensive than other picks.\n\n-------------------\n\nsony a7iii:\nthe good:\nvery large lens selection at great prices.\n\nthe bad:\nthe controls of the camera were very confusing to me, took way longer to figure out how to change specific settings.\nthe only way to change iso was through the digital screen, i was not able to change iso using the dials on the camera body.\nit is a somewhat old camera compared to the other two.\n\noverall: the sony feels like it lands in between the nikon and the canon in comfortability, usability, and lens selection/pricing. \n\n\n----------------------------------------------\n\nif you have any experience with those cameras, please let me know what you think, and please let me know if i'm wrong about any of my findings.\n\n\nedit: (adding the main reasons i want to ditch the d3400)\nthe d3400 doesn't allow me to do time lapse and is pretty bad at long exposure photos. this camera does not support any external remotes so i cannot even shoot remotely with it.\nthe auto focus is the worst auto focus i've ever seen so i have to rely on my manual focus, which is fine for steady shots of stationary objects, but as soon as the object starts moving, i have very bad time focusing on the subject. another issue with focusing is that i do not see it through the view finder so i have to use the rear screen to adjust my focus, and change the camera to view finder and hope the focus is still on the subject, since the dslr takes soooo much longer to snap a photo while using the rear screen.\n\nedit 2: i'm trying to upgrade the camera so i can keep it for a few years, and not feel guilty spending more money on the gear for it.\nevery time i've purchased anything for the d3400, i've felt like i was throwing away money, because i knew i will need to upgrade the camera at some point.", "sortedWord": "None", "identifyer": 7145, "year": "2020"}, {"Unnamed: 0": 213641, "autor": "dearpisa", "date": 1594360846000, "content": "Is there any L-bracket that works with a fully articulating screen? /!/ As title says. I'm researching to buy my next camera mostly for landscape and I generally don't shoot videos. I'm leaning towards the Sony A7III because of the third party lens availability, but also because it has the tilting screen which works nicely with an L-bracket. Is there any solution for an L-bracket with a flippy screen that allows full rotation of the screen? The L-bracket is a must to me, so if the bracket blocks the flippy screen, it might as well be a fixed screen.\n\nIf someone finds it hard to understand, have a look at SmallRig L-Bracket for Canon EOS RP APL2350 - to get the screen flipped out from the 'fixed screen' position, you'd need to flip it out halfway, rotate it so that the screen faces you, and flip it out the remaining travel, and once flipped out it cannot be tilted.", "link": "https://www.reddit.com/r/Cameras/comments/hojmnr/is_there_any_lbracket_that_works_with_a_fully/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is there any l-bracket that works with a fully articulating screen? /!/ as title says. i'm researching to buy my next camera mostly for landscape and i generally don't shoot videos. i'm leaning towards the sony a7iii because of the third party lens availability, but also because it has the tilting screen which works nicely with an l-bracket. is there any solution for an l-bracket with a flippy screen that allows full rotation of the screen? the l-bracket is a must to me, so if the bracket blocks the flippy screen, it might as well be a fixed screen.\n\nif someone finds it hard to understand, have a look at smallrig l-bracket for canon eos rp apl2350 - to get the screen flipped out from the 'fixed screen' -----> position !!! , you'd need to flip it out halfway, rotate it so that the screen faces you, and flip it out the remaining travel, and once flipped out it cannot be tilted.", "sortedWord": "None", "identifyer": 7777, "year": "2020"}, {"Unnamed: 0": 213881, "autor": "SuddenGlass", "date": 1590769016000, "content": "Trying to decide on a beginner camera for portraits and self portraits. Sony a5100 or Nikon D5600? /!/ I've grown beyond taking pictures with my iPhone (some of which I've actually sold) and want to get into taking actual portraits and self portraits that look nice.\n\nI've been looking at the Nikon D5600 or the Sony Alpha a5100. Which one would you guys recommend? I'm considering these two because they have a flip screen that I can use to see what the camera sees from a position in front of the camera. There is also the a6100 that looks nice, but that's a little bit out of my budget range. I was hoping to stretch my dollar so I can spend on a tripod, lenses etc.\n\nThe Nikon with an 18-55mm lens is more expensive with a than the Sony with a 16-50mm lens. I really have no idea what the different lenses will do, so any input would be really appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/gsvx88/trying_to_decide_on_a_beginner_camera_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "trying to decide on a beginner camera for portraits and self portraits. sony a5100 or nikon d5600? /!/ i've grown beyond taking pictures with my iphone (some of which i've actually sold) and want to get into taking actual portraits and self portraits that look nice.\n\ni've been looking at the nikon d5600 or the sony alpha a5100. which one would you guys recommend? i'm considering these two because they have a flip screen that i can use to see what the camera sees from a -----> position !!!  in front of the camera. there is also the a6100 that looks nice, but that's a little bit out of my budget range. i was hoping to stretch my dollar so i can spend on a tripod, lenses etc.\n\nthe nikon with an 18-55mm lens is more expensive with a than the sony with a 16-50mm lens. i really have no idea what the different lenses will do, so any input would be really appreciated!", "sortedWord": "None", "identifyer": 8045, "year": "2020"}, {"Unnamed: 0": 214281, "autor": "TaviTV", "date": 1579890579000, "content": "Building a large format digital camera /!/ \nI was always interested in Large format cameras, wanted to build one myself and add a little tweak to it.\nSo I started this project having in my mind roughly how it will work. The idea is to put a normal camera on the back that will photograph the huge image circle that large format lenses have and then stitch the images together. \nSomething like this already exists, but you move the camera manually and I’ve seen it having like 6 to 8 positions.\nOn my camera I have attached 3 motors that will move the sensor across with precision and made it big enough to stitch about 100 shots. As a digital back I’m using a Fujifilm XE-3, 24 megapixel camera that x100 will generate an 2400 megapixel image, in theory.\nMy budget wasn’t too big so I’ve got an old Helios f4.5  300mm lens, made all the parts myself front and back standards, found a rail system, put it all together, even got a solenoid that triggers the shutter right after it moves to the next position, so it’s a fully automated process but still needed the bellows. \nAfter some testing and tweaking I found a company that makes custom bellows but they charge me a substantial amount.\n\nNow i’m stuck thinking if it’s even worth it.\nWill this camera have any use anywhere? It takes about 2-3 minutes to “scan” a picture so the subject matter needs to be motionless.\nWill put some pictures of the camera down bellow\nNeed some opinion on this project.\nAny questions are welcomed.\n\nhttps://imgur.com/gallery/eZQHJmk", "link": "https://www.reddit.com/r/Cameras/comments/eteelc/building_a_large_format_digital_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "building a large format digital camera /!/ \ni was always interested in large format cameras, wanted to build one myself and add a little tweak to it.\nso i started this project having in my mind roughly how it will work. the idea is to put a normal camera on the back that will photograph the huge image circle that large format lenses have and then stitch the images together. \nsomething like this already exists, but you move the camera manually and i’ve seen it having like 6 to 8 -----> positions !!! .\non my camera i have attached 3 motors that will move the sensor across with precision and made it big enough to stitch about 100 shots. as a digital back i’m using a fujifilm xe-3, 24 megapixel camera that x100 will generate an 2400 megapixel image, in theory.\nmy budget wasn’t too big so i’ve got an old helios f4.5  300mm lens, made all the parts myself front and back standards, found a rail system, put it all together, even got a solenoid that triggers the shutter right after it moves to the next position, so it’s a fully automated process but still needed the bellows. \nafter some testing and tweaking i found a company that makes custom bellows but they charge me a substantial amount.\n\nnow i’m stuck thinking if it’s even worth it.\nwill this camera have any use anywhere? it takes about 2-3 minutes to “scan” a picture so the subject matter needs to be motionless.\nwill put some pictures of the camera down bellow\nneed some opinion on this project.\nany questions are welcomed.\n\nhttps://imgur.com/gallery/ezqhjmk", "sortedWord": "None", "identifyer": 8475, "year": "2020"}, {"Unnamed: 0": 214331, "autor": "brokencarwheel", "date": 1581469191000, "content": "Jelco U8 ZOOM (8mm camera) /!/ Hi everyone,\n\nI recently picked up a Jelco U8 zoom (8mm cine camera) and the shutter release button doesn't seem to be working. I've wound the motor up a fair bit, but it's started to give me tension, so I've stopped in fear of breaking the spring - the lever on the side (which I will assume is the shutter release) is just returning to it's regular position after being pressed.\n\nThere is also a \"Type A filter\", which I'm not really sure of either - but I'm sure it just changes how the film is processed by the camera, I've just never seen it before.\n\nThere is also a \"hand\" that is used to keep the empty spool down (I assume that this is so that the empty spool doesn't come loose while filming, but I might be wrong)\n\nI might be able to access the motor through the film door if possible, but is this an easy fix? Or are there less radical measures I could take to restore it? There are approx 9 screws holding the spool reels in.\n\nI don't have a lot of experience with 8mm film cameras, but if anyone has any experience of any kind, it would be greatly appreciated :D\n\nHere are the pictures for reference:  [https://photos.google.com/album/AF1QipPJYjpq7Z76qN\\_vpG9O9FchG7OXmaqfdWG3h2pS](https://photos.google.com/album/AF1QipPJYjpq7Z76qN_vpG9O9FchG7OXmaqfdWG3h2pS)", "link": "https://www.reddit.com/r/Cameras/comments/f2ikx1/jelco_u8_zoom_8mm_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jelco u8 zoom (8mm camera) /!/ hi everyone,\n\ni recently picked up a jelco u8 zoom (8mm cine camera) and the shutter release button doesn't seem to be working. i've wound the motor up a fair bit, but it's started to give me tension, so i've stopped in fear of breaking the spring - the lever on the side (which i will assume is the shutter release) is just returning to it's regular -----> position !!!  after being pressed.\n\nthere is also a \"type a filter\", which i'm not really sure of either - but i'm sure it just changes how the film is processed by the camera, i've just never seen it before.\n\nthere is also a \"hand\" that is used to keep the empty spool down (i assume that this is so that the empty spool doesn't come loose while filming, but i might be wrong)\n\ni might be able to access the motor through the film door if possible, but is this an easy fix? or are there less radical measures i could take to restore it? there are approx 9 screws holding the spool reels in.\n\ni don't have a lot of experience with 8mm film cameras, but if anyone has any experience of any kind, it would be greatly appreciated :d\n\nhere are the pictures for reference:  [https://photos.google.com/album/af1qippjyjpq7z76qn\\_vpg9o9fchg7oxmaqfdwg3h2ps](https://photos.google.com/album/af1qippjyjpq7z76qn_vpg9o9fchg7oxmaqfdwg3h2ps)", "sortedWord": "None", "identifyer": 8530, "year": "2020"}, {"Unnamed: 0": 216332, "autor": "Just_Water_Please", "date": 1598727566000, "content": "Best Low Light Dash Cam? /!/ So I have a need for a camera with good low light ability that I'll be using strictly for recording purposes. I use my car for Uber, autocross, some night racing (in Mexico of course), &amp; for car interviews. \n\nI actually bought a G7x ii for this purpose and it works flawlessly but I had no clue these types of cameras stop recording after 20-30 minutes due to SD card filing limitations only allowing 4G per clip. The position for optimal angle in my car is out of reach so I can't just hit re-record every 20-30 minutes. \n\nI was considering just buying a budget dash-cam type camera that can also record next to my G7x to finish the videos since I typically don't need recordings longer than 45 minutes. I don't mind the drop in quality for the uber, autocross, and night racing. I just need something that can make out faces so it actually serves it's security purpose with Uber at night. I have footwell lights in my car that light up the faces in the back decently so that helps. \n\nAnyone know of any camera fitting this description that can film for \\~45 min straight or do I have to find a camcorder?\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/iiy1op/best_low_light_dash_cam/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best low light dash cam? /!/ so i have a need for a camera with good low light ability that i'll be using strictly for recording purposes. i use my car for uber, autocross, some night racing (in mexico of course), &amp; for car interviews. \n\ni actually bought a g7x ii for this purpose and it works flawlessly but i had no clue these types of cameras stop recording after 20-30 minutes due to sd card filing limitations only allowing 4g per clip. the -----> position !!!  for optimal angle in my car is out of reach so i can't just hit re-record every 20-30 minutes. \n\ni was considering just buying a budget dash-cam type camera that can also record next to my g7x to finish the videos since i typically don't need recordings longer than 45 minutes. i don't mind the drop in quality for the uber, autocross, and night racing. i just need something that can make out faces so it actually serves it's security purpose with uber at night. i have footwell lights in my car that light up the faces in the back decently so that helps. \n\nanyone know of any camera fitting this description that can film for \\~45 min straight or do i have to find a camcorder?\n\nthanks!", "sortedWord": "None", "identifyer": 10755, "year": "2020"}, {"Unnamed: 0": 216425, "autor": "BITCHAMIGO", "date": 1606237731000, "content": "I need help, please /!/ This is probably out of the topic but idk where to ask this. My Nikon Coolpix L810 zoom is making a loud and horrible sound. With the sound comes a shift in the picture.( like on the screen, the image shows like is being pulled to the side, but then recovers, taking a picture with zoom is difficult cuz the zoom changes the position and the picure comes out like is moving, even tho is perfectly still) this only happends when the zoom is fully extended. At a specific zoom it can be seen the shift in the picture. Is like is being cropped? But like still intact? I dont even know. I looked inside the lenses and i could've seen the shift, i thought that it was broken, but it looks intact. I have a video but dont know if im allowed to post it. Did this happened to anyone here? I tried to open the lense cap but i couldn't. Coud it be some dust moving the zoom in such position that it would disturb the aligned lenses? If so, how can i fix it? Im sorry if i didnt explain correctly or i didnt put is such way to be undesirable, if you have any ideea or suggestion i would be grateful! Thank you for your time and have a good day!", "link": "https://www.reddit.com/r/Cameras/comments/k091pm/i_need_help_please/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i need help, please /!/ this is probably out of the topic but idk where to ask this. my nikon coolpix l810 zoom is making a loud and horrible sound. with the sound comes a shift in the picture.( like on the screen, the image shows like is being pulled to the side, but then recovers, taking a picture with zoom is difficult cuz the zoom changes the -----> position !!!  and the picure comes out like is moving, even tho is perfectly still) this only happends when the zoom is fully extended. at a specific zoom it can be seen the shift in the picture. is like is being cropped? but like still intact? i dont even know. i looked inside the lenses and i could've seen the shift, i thought that it was broken, but it looks intact. i have a video but dont know if im allowed to post it. did this happened to anyone here? i tried to open the lense cap but i couldn't. coud it be some dust moving the zoom in such position that it would disturb the aligned lenses? if so, how can i fix it? im sorry if i didnt explain correctly or i didnt put is such way to be undesirable, if you have any ideea or suggestion i would be grateful! thank you for your time and have a good day!", "sortedWord": "None", "identifyer": 10855, "year": "2020"}], "name": "positionCameras2020"}