{"interestingcomments": [{"Unnamed: 0": 221174, "autor": "dumbnymph", "date": 1611861070000, "content": "Upgrading from a Lumix G7 to a...? /!/ *For starters I don't know a lot about cameras, I'm self taught and I learned everything I know on this camera - so, I don't know if autofocus on these lenses would work with another camera body, or if this is even a camera issue, or a lens issue, etc.* \n\nI bought a Lumix G7 nearly 5 years ago and it's been my go-to for self-portraits, and filming, ***but I've noticed the camera isn't always great with accurate colours, sharpness, etc***. I always have to edit everything, and even then sometimes I just can't fix the photos, although some turn out great and don't even need colour-correcting. I'm hoping to upgrade to a relatively similar Micro 4/3 camera that will work with these lenses (and autofocus), hopefully around or under $1,000 CAD. Looking at the line of other Lumix's I get confused trying to figure out which ones are newer, better, etc. it seems like some Lumix cameras are $5,000 but have less features than the G7 (like 4k filming), so why are they more expensive?\n\n[Lumix G7, 42.5mm f1.7](https://preview.redd.it/et4gscw1g4e61.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=5ba3f7d6109dba1343899344a41f3ed57780a39b)\n\nI use the **Panasonic 42.5mm 1.7** lens (85mm equivalent) and actually have the **25mm 1.7** showing up in the mail today (50mm equivalent). The 1.7 seems to help a lot in low-light, but it almost seems like it's not enough.  \nI only get super great, clear, colour-accurate photos on bright sunny days, if it's even slightly overcast or I'm not in the right position the photos get muddy, and the sharpness seems to go quite soft (and the in-camera sharpness ruins photos if I even have it set to +1)   \n***I always shoot f1.7***  \n***I try to use as high as a shutter speed as I can without making it too dark,***   \n***I try to always keep the ISO in the 100-200 range.***  \nThese issues don't seem to change even when it's RAW images.\n\nIs it possible to upgrade to something that works properly with these lenses and portrays a better image than the G7, but doesn't break the bank? - I bought the G7 for around $800 I believe 5 years ago, so I'm hoping by now there's something better around the same price.", "link": "https://www.reddit.com/r/Cameras/comments/l75n6w/upgrading_from_a_lumix_g7_to_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrading from a lumix g7 to a...? /!/ *for starters i don't know a lot about cameras, i'm self taught and i learned everything i know on this camera - so, i don't know if autofocus on these lenses would work with another camera body, or if this is even a camera issue, or a lens issue, etc.* \n\ni bought a lumix g7 nearly 5 years ago and it's been my go-to for self-portraits, and filming, ***but i've noticed the camera isn't always great with accurate colours, sharpness, etc***. i always have to edit everything, and even then sometimes i just can't fix the photos, although some turn out great and don't even need colour-correcting. i'm hoping to upgrade to a relatively similar micro 4/3 camera that will work with these lenses (and autofocus), hopefully around or under $1,000 cad. looking at the line of other lumix's i get confused trying to figure out which ones are newer, better, etc. it seems like some lumix cameras are $5,000 but have less features than the g7 (like 4k filming), so why are they more expensive?\n\n[lumix g7, 42.5mm f1.7](https://preview.redd.it/et4gscw1g4e61.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=5ba3f7d6109dba1343899344a41f3ed57780a39b)\n\ni use the **panasonic 42.5mm 1.7** lens (85mm equivalent) and actually have the **25mm 1.7** showing up in the mail today (50mm equivalent). the 1.7 seems to help a lot in low-light, but it almost seems like it's not enough.  \ni only get super great, clear, colour-accurate photos on bright sunny days, if it's even slightly overcast or i'm not in the right -----> position !!!  the photos get muddy, and the sharpness seems to go quite soft (and the in-camera sharpness ruins photos if i even have it set to +1)   \n***i always shoot f1.7***  \n***i try to use as high as a shutter speed as i can without making it too dark,***   \n***i try to always keep the iso in the 100-200 range.***  \nthese issues don't seem to change even when it's raw images.\n\nis it possible to upgrade to something that works properly with these lenses and portrays a better image than the g7, but doesn't break the bank? - i bought the g7 for around $800 i believe 5 years ago, so i'm hoping by now there's something better around the same price.", "sortedWord": "None", "identifyer": 15715, "year": "2021"}, {"Unnamed: 0": 221213, "autor": "agent_max_the_mick", "date": 1622569653000, "content": "Broken Yashica Electro 35 GSN /!/ TLDR:  My Yashica Electro 35's shutter doesn't work– the release button will reset, but it won't trip the shutter.\n\nSo I was digging around in some boxes out in my garage (spring cleaning), and I found my very first camera, a Yashica Electro 35 GSN!  I still remember opening it on my 12th birthday, my dad bought it practically new.  Man, I put so much film through it...\n\nAnyway, being used so much and then stuck in a box for 20 years has obviously taken its toll.  The self-timer lever is stuck in the wound position, and the shutter doesn't work.  I can advance the film, but when I press the shutter release, it makes a click and the shutter doesn't open.  I did purchase a new battery for it, and ll the lights and stuff work (brought back memories), but the shutter's still not working.\n\nAny ideas, suggestions, comments?\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/npzwr4/broken_yashica_electro_35_gsn/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "broken yashica electro 35 gsn /!/ tldr:  my yashica electro 35's shutter doesn't work– the release button will reset, but it won't trip the shutter.\n\nso i was digging around in some boxes out in my garage (spring cleaning), and i found my very first camera, a yashica electro 35 gsn!  i still remember opening it on my 12th birthday, my dad bought it practically new.  man, i put so much film through it...\n\nanyway, being used so much and then stuck in a box for 20 years has obviously taken its toll.  the self-timer lever is stuck in the wound -----> position !!! , and the shutter doesn't work.  i can advance the film, but when i press the shutter release, it makes a click and the shutter doesn't open.  i did purchase a new battery for it, and ll the lights and stuff work (brought back memories), but the shutter's still not working.\n\nany ideas, suggestions, comments?\n\nthanks!", "sortedWord": "None", "identifyer": 15756, "year": "2021"}, {"Unnamed: 0": 221461, "autor": "FinesseOs", "date": 1630288940000, "content": "Camera for casual guitar videos/lessons/streaming /!/ Hey peeps. (geddit?)\n\nSo I'm a guitar teacher/performer, but also a gamer and looking to get into streaming. Just as a preface I'm completely fresh to the video production environment outside of editing, I've never filmed video on a decent camera, nor approached the field in any serious respect, though I do have years of experience editing stills, using raw formats etc and thus I do have a lot of foundational knowledge on things like ISO/manual focus/exposure/aperture, trad camera stuff. \n\nSo- My needs. I'm going to be shooting videos of myself playing guitar in stationary positions in well lit environments, outside of the occasional gig video, but 95% of usage will be in my studio, camera mounted on a tripod type stuff. \n\n* I'm after something that's going to at least be capable of shooting 2k/60fps, 4k being a bonus.\n* I would appreciate the ability to rig my amp microphone (SM57-XLR) into the setup, or basically having any way to avoid having to sync audio in post, any ideas/other solutions on this I'm all ears\n* Ideally, have a flip screen to see myself during recording- not necessary, just someway to know that I'm in focus\n* Combining with the above point, a good autofocus option because I'm going to be the only one in the room recording/operating at a time and need the focus to be on point so I'm not micromanaging\n\nThanks in advance!", "link": "https://www.reddit.com/r/Cameras/comments/pe8qx3/camera_for_casual_guitar_videoslessonsstreaming/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "camera for casual guitar videos/lessons/streaming /!/ hey peeps. (geddit?)\n\nso i'm a guitar teacher/performer, but also a gamer and looking to get into streaming. just as a preface i'm completely fresh to the video production environment outside of editing, i've never filmed video on a decent camera, nor approached the field in any serious respect, though i do have years of experience editing stills, using raw formats etc and thus i do have a lot of foundational knowledge on things like iso/manual focus/exposure/aperture, trad camera stuff. \n\nso- my needs. i'm going to be shooting videos of myself playing guitar in stationary -----> positions !!!  in well lit environments, outside of the occasional gig video, but 95% of usage will be in my studio, camera mounted on a tripod type stuff. \n\n* i'm after something that's going to at least be capable of shooting 2k/60fps, 4k being a bonus.\n* i would appreciate the ability to rig my amp microphone (sm57-xlr) into the setup, or basically having any way to avoid having to sync audio in post, any ideas/other solutions on this i'm all ears\n* ideally, have a flip screen to see myself during recording- not necessary, just someway to know that i'm in focus\n* combining with the above point, a good autofocus option because i'm going to be the only one in the room recording/operating at a time and need the focus to be on point so i'm not micromanaging\n\nthanks in advance!", "sortedWord": "None", "identifyer": 16012, "year": "2021"}, {"Unnamed: 0": 221533, "autor": "EffectivePlus", "date": 1627730492000, "content": "Suggestions for First Person low light video ? /!/ New to this type of video but long term enthusist.. Basically my current project involves a foggy low light scene (picture foggy underworld vampire kind of set). I want something I can attach or even mod to a pair of glasses (doesnt need to look through the glasses lens, the glasses are just there to position the camera and get the first person perspective) could even use a headset. It needs to be able to capture the fog but also be sharp with edges, silloettes etc. Obviously low noise low light and lightweight. Dont know how to track down what I need. Thanks", "link": "https://www.reddit.com/r/Cameras/comments/ov5fbr/suggestions_for_first_person_low_light_video/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "suggestions for first person low light video ? /!/ new to this type of video but long term enthusist.. basically my current project involves a foggy low light scene (picture foggy underworld vampire kind of set). i want something i can attach or even mod to a pair of glasses (doesnt need to look through the glasses lens, the glasses are just there to -----> position !!!  the camera and get the first person perspective) could even use a headset. it needs to be able to capture the fog but also be sharp with edges, silloettes etc. obviously low noise low light and lightweight. dont know how to track down what i need. thanks", "sortedWord": "None", "identifyer": 16088, "year": "2021"}, {"Unnamed: 0": 221574, "autor": "Just_another_Dan", "date": 1627570657000, "content": "Canon 1973 50mm f1.4 /!/ I bought this lens recently and it arrived today - the focus ring moves well and the aperture blades do not seem to be oily they move very well, however when on the camera they do not engage when I take a photo and when taken off the camera I’ve pressed the necessary buttons to mimic as if the lens was on the camera and it’s still not responding, when I move the metal parts on the back side of the lens I can see the aperture blades moving freely although with it set to f22 the blades do not move into position or any of the f stops for that matter - could this be a mechanical fault with the lens? A simple spring change or is the lens possibly unfixable the seller has agreed to take refund if necessary but I don’t want to send back such a good lens if I don’t need to as it is in immaculate quality\n\nAny help would be great, happy to provide more information", "link": "https://www.reddit.com/r/Cameras/comments/otz3bl/canon_1973_50mm_f14/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon 1973 50mm f1.4 /!/ i bought this lens recently and it arrived today - the focus ring moves well and the aperture blades do not seem to be oily they move very well, however when on the camera they do not engage when i take a photo and when taken off the camera i’ve pressed the necessary buttons to mimic as if the lens was on the camera and it’s still not responding, when i move the metal parts on the back side of the lens i can see the aperture blades moving freely although with it set to f22 the blades do not move into -----> position !!!  or any of the f stops for that matter - could this be a mechanical fault with the lens? a simple spring change or is the lens possibly unfixable the seller has agreed to take refund if necessary but i don’t want to send back such a good lens if i don’t need to as it is in immaculate quality\n\nany help would be great, happy to provide more information", "sortedWord": "None", "identifyer": 16130, "year": "2021"}, {"Unnamed: 0": 221768, "autor": "randomguy22399", "date": 1635449974000, "content": "My smartphone camera vs entry level dslr? /!/ Hello everyone,\n\nI want to get my first DSLR but I have limited budget, so I'm looking at Canon EOS 2000D (Rebel T7) as my primary option (open for other recommendations in that price range).   \n\n\nI would be using camera mainly for photos, but I would like to shoot some videos occasionally too.  \n\n\nNow I read on some places that it's not really worth to buy  an entry level dslr if you own a smartphone with good cameras, and I have Samsung S21 with which cameras I'm pretty happy.  \n\n\nIs it worth to buy such a camera in my position? Or should I wait until I have bigger budget? I really want to get into \"real\" cameras world.", "link": "https://www.reddit.com/r/Cameras/comments/qhuttq/my_smartphone_camera_vs_entry_level_dslr/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my smartphone camera vs entry level dslr? /!/ hello everyone,\n\ni want to get my first dslr but i have limited budget, so i'm looking at canon eos 2000d (rebel t7) as my primary option (open for other recommendations in that price range).   \n\n\ni would be using camera mainly for photos, but i would like to shoot some videos occasionally too.  \n\n\nnow i read on some places that it's not really worth to buy  an entry level dslr if you own a smartphone with good cameras, and i have samsung s21 with which cameras i'm pretty happy.  \n\n\nis it worth to buy such a camera in my -----> position !!! ? or should i wait until i have bigger budget? i really want to get into \"real\" cameras world.", "sortedWord": "None", "identifyer": 16332, "year": "2021"}, {"Unnamed: 0": 222465, "autor": "SneakySneakz123", "date": 1611635982000, "content": "Best camera for landscape photography? /!/ Hey there, \n\nIm a videographer and got a new job in a marketing position for a landscaping company. Part of the job will be to take photos of big backyard makeovers, pool houses, elaborate decks, etc... \n\nAs I mentioned I'm primarily a videographer and shoot on an a7s ii, however I haven't been super pleased with the photos it puts out. The company is giving me whatever I need to get a new company camera, no budget as they want the best they can get. I've shot on pretty well all camera makes so make/model doesn't matter too much to me, just looking for advice from someone who may be more of an expert in the photography field than I currently am. \n\nWith no budget in 2021 what camera would you buy for this type of photography?", "link": "https://www.reddit.com/r/Cameras/comments/l56cng/best_camera_for_landscape_photography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best camera for landscape photography? /!/ hey there, \n\nim a videographer and got a new job in a marketing -----> position !!!  for a landscaping company. part of the job will be to take photos of big backyard makeovers, pool houses, elaborate decks, etc... \n\nas i mentioned i'm primarily a videographer and shoot on an a7s ii, however i haven't been super pleased with the photos it puts out. the company is giving me whatever i need to get a new company camera, no budget as they want the best they can get. i've shot on pretty well all camera makes so make/model doesn't matter too much to me, just looking for advice from someone who may be more of an expert in the photography field than i currently am. \n\nwith no budget in 2021 what camera would you buy for this type of photography?", "sortedWord": "None", "identifyer": 17066, "year": "2021"}, {"Unnamed: 0": 222521, "autor": "LaJeffrey3", "date": 1611503784000, "content": "Pan Tilt Mounts with Position Profiles? /!/ I’m looking for a good pan tilt mount for a camera I already own (currently sits on a tripod) that I could control either wirelessly or with a controller that stretches about 8 feet (which is why I think I’d need wireless). The part I can’t find in a mount is to be able to program it with position profiles, so that if I preprogrammed positions into the mount, that it will automatically pan and/or tilt to that position when I select it (either on the controller or in an app or however I would do it). Does anyone know of a good mount that can do this? Any info would be greatly appreciated. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/l41xgz/pan_tilt_mounts_with_position_profiles/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pan tilt mounts with -----> position !!!  profiles? /!/ i’m looking for a good pan tilt mount for a camera i already own (currently sits on a tripod) that i could control either wirelessly or with a controller that stretches about 8 feet (which is why i think i’d need wireless). the part i can’t find in a mount is to be able to program it with position profiles, so that if i preprogrammed positions into the mount, that it will automatically pan and/or tilt to that position when i select it (either on the controller or in an app or however i would do it). does anyone know of a good mount that can do this? any info would be greatly appreciated. thanks!", "sortedWord": "None", "identifyer": 17123, "year": "2021"}, {"Unnamed: 0": 223115, "autor": "ShellGadus", "date": 1626345120000, "content": "What is a good portable video camera for recoding from a static position? /!/ I want to buy a camera for my workplace. I need to move it to different places a lot. It would record from the same spot for up to 8 hours at a time.\n\nWhat I need from it:\n\n* battery that lasts up to 8 hours\n* ability to continuously record for up to 8 hours straight, preferably splitting the recording to smaller intervals\n* recording quality 1080p, at least 30fps - it is going to record parts of a production line so I need to be able to see what happened but I'm not looking to read license plates etc.\n* ability to mount it to different surfaces... mesh fences, poles, iron beams, tables...\n\nNot sure what to pick. GoPro seems like an overkill. Battery-powered IP cams only record detected motion. Tried using an old Android but it would overheat and corrupt the file.", "link": "https://www.reddit.com/r/Cameras/comments/okq576/what_is_a_good_portable_video_camera_for_recoding/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what is a good portable video camera for recoding from a static -----> position !!! ? /!/ i want to buy a camera for my workplace. i need to move it to different places a lot. it would record from the same spot for up to 8 hours at a time.\n\nwhat i need from it:\n\n* battery that lasts up to 8 hours\n* ability to continuously record for up to 8 hours straight, preferably splitting the recording to smaller intervals\n* recording quality 1080p, at least 30fps - it is going to record parts of a production line so i need to be able to see what happened but i'm not looking to read license plates etc.\n* ability to mount it to different surfaces... mesh fences, poles, iron beams, tables...\n\nnot sure what to pick. gopro seems like an overkill. battery-powered ip cams only record detected motion. tried using an old android but it would overheat and corrupt the file.", "sortedWord": "None", "identifyer": 17742, "year": "2021"}, {"Unnamed: 0": 223294, "autor": "Significant-Bar8048", "date": 1627147008000, "content": "FujiFilm X-S10 vs Sony Alpha a6600 /!/ Hi. I currently shoot on my phone and I'm in a position where I want to upgrade to a camera. I've used a camera almost 2-3 times that too mainly pointing and shooting. What would be a better choice out of the mentioned. If you have any other beginner recommendations do mention them below. Any and every piece of advice is appreciated.\n\nThank You", "link": "https://www.reddit.com/r/Cameras/comments/oqu5q2/fujifilm_xs10_vs_sony_alpha_a6600/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fujifilm x-s10 vs sony alpha a6600 /!/ hi. i currently shoot on my phone and i'm in a -----> position !!!  where i want to upgrade to a camera. i've used a camera almost 2-3 times that too mainly pointing and shooting. what would be a better choice out of the mentioned. if you have any other beginner recommendations do mention them below. any and every piece of advice is appreciated.\n\nthank you", "sortedWord": "None", "identifyer": 17934, "year": "2021"}, {"Unnamed: 0": 223414, "autor": "billjanderson", "date": 1632747587000, "content": "Should I get a point&amp;shoot? If so, which? /!/ Goal: The ability to document family memories (we have a new little guy, our first) and pictures can be blown up without losing a ton resolution quality AND take good quality video.\n\nCurrent state: iPhone 12, soon to be 13\n\nBackground: I’ve landed on exploring point&amp;shoot because I am not trying to get super technical so stopping short of changing lenses. Having said that, feel free to talk me into it, especially if you’ve been in my same position.\n\nSO, my first question is is it even worth it to get a point&amp;shoot? Is it a big enough difference from my iPhone?\n\nIf so, what is the best point&amp;shoot for my needs? Best at different price points (top/mid range)?\n\nThank you all ahead of time for your thoughts!!", "link": "https://www.reddit.com/r/Cameras/comments/pwgjd3/should_i_get_a_pointshoot_if_so_which/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i get a point&amp;shoot? if so, which? /!/ goal: the ability to document family memories (we have a new little guy, our first) and pictures can be blown up without losing a ton resolution quality and take good quality video.\n\ncurrent state: iphone 12, soon to be 13\n\nbackground: i’ve landed on exploring point&amp;shoot because i am not trying to get super technical so stopping short of changing lenses. having said that, feel free to talk me into it, especially if you’ve been in my same -----> position !!! .\n\nso, my first question is is it even worth it to get a point&amp;shoot? is it a big enough difference from my iphone?\n\nif so, what is the best point&amp;shoot for my needs? best at different price points (top/mid range)?\n\nthank you all ahead of time for your thoughts!!", "sortedWord": "None", "identifyer": 18060, "year": "2021"}, {"Unnamed: 0": 223448, "autor": "mendozaxmen", "date": 1632675131000, "content": "Little Help with Macro videos /!/ I'm using a macro lens but doing video this camera doesnt have the ability to auto focus on videos, in my youtube channel knightofbricks (lego review) if you have the time you can see the lastest video that I posted and during the 0:20 until 0:50 secs the product is in a rotating table but at the moment start rotating the movement changes a bit position and I'm having the results of maintaining the focus.  question  is there a way to solve this issue with the canon 5d mark 2? thank you for your time", "link": "https://www.reddit.com/r/Cameras/comments/pvxlnh/little_help_with_macro_videos/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "little help with macro videos /!/ i'm using a macro lens but doing video this camera doesnt have the ability to auto focus on videos, in my youtube channel knightofbricks (lego review) if you have the time you can see the lastest video that i posted and during the 0:20 until 0:50 secs the product is in a rotating table but at the moment start rotating the movement changes a bit -----> position !!!  and i'm having the results of maintaining the focus.  question  is there a way to solve this issue with the canon 5d mark 2? thank you for your time", "sortedWord": "None", "identifyer": 18096, "year": "2021"}, {"Unnamed: 0": 223500, "autor": "Kaldea", "date": 1634201168000, "content": "Camera recommendation (or confirmation) for home-studio art/sculpture creation capture &amp; B-roll /!/ Hi there!\n\nI'm looking to buy a camera and some equipment to record/stream myself making clay sculptures and artwork. I want something that will work well in a set-position, with slightly varying lighting, but would also be worth an investment to learn how to use for things outside my art studio (travel, photo shoots, professional videos of my showcase, etc).\n\nWhat I have found:\n\n[Lumix DC-GH5s] (https://www.scandinavianphoto.se/panasonic/lumix-dc-gh5s-kamerahus-1037823) about 2900 USD - 24990 EUR\n\n[Lumix G X Vario 12-35mm f/2,8 II ASPH Power](https://www.scandinavianphoto.se/panasonic/lumix-g-x-vario-12-35mm-f28-ii-asph-power-1031541) 1330 USD - 11490 SEK\n\nFor mount, I want something that can hold the camera above for a bird's eye, and ideally a light and/or phone, so I was looking at this [Master Mount &amp; friends from Elgato](https://www.elgato.com/en/master-mount) --\n\nIs a [Cam Link](https://www.inet.se/produkt/5406991/elgato-cam-link-4k) solely for streaming? I'm primarily looking at this for recording video to then import to my PC and touch up then make videos of my process to upload to Youtube. More projects later, but that's project #1. Would a Cal Link still be helpful so I don't need to worry about SD cards hitting their limit, or?\n\nWhat lights would be ideal? Would some basic old rim lights from Amazon work ,or are there any that would be best for doing deskwork to make sure there aren't soo many shadows (so 2-3 lights?)\n\nI'm aware I'm well down the curve on knowledge of cameras and have been avoidant for years from fear of not \"getting\" it, but I really, really want that to change. I finally think my artwork is starting to become good enough worth capturing and making tutorial videos, so I want to learn what I can with the right tools.\n\nMy computer/software are all high-end so no changes needed there (save maybe a new monitor). Money isn't too big of an issue, but if I could keep it under 5k USD for the entire setup initially I would love that.\n\nAlso, any online course suggestions that would help a noob leave layman status with terminology would be super welcomed as well!\n\nAny and all help would be greatly, gildedly appreciated! \n\nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/q7vo8n/camera_recommendation_or_confirmation_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera recommendation (or confirmation) for home-studio art/sculpture creation capture &amp; b-roll /!/ hi there!\n\ni'm looking to buy a camera and some equipment to record/stream myself making clay sculptures and artwork. i want something that will work well in a set------> position !!! , with slightly varying lighting, but would also be worth an investment to learn how to use for things outside my art studio (travel, photo shoots, professional videos of my showcase, etc).\n\nwhat i have found:\n\n[lumix dc-gh5s] (https://www.scandinavianphoto.se/panasonic/lumix-dc-gh5s-kamerahus-1037823) about 2900 usd - 24990 eur\n\n[lumix g x vario 12-35mm f/2,8 ii asph power](https://www.scandinavianphoto.se/panasonic/lumix-g-x-vario-12-35mm-f28-ii-asph-power-1031541) 1330 usd - 11490 sek\n\nfor mount, i want something that can hold the camera above for a bird's eye, and ideally a light and/or phone, so i was looking at this [master mount &amp; friends from elgato](https://www.elgato.com/en/master-mount) --\n\nis a [cam link](https://www.inet.se/produkt/5406991/elgato-cam-link-4k) solely for streaming? i'm primarily looking at this for recording video to then import to my pc and touch up then make videos of my process to upload to youtube. more projects later, but that's project #1. would a cal link still be helpful so i don't need to worry about sd cards hitting their limit, or?\n\nwhat lights would be ideal? would some basic old rim lights from amazon work ,or are there any that would be best for doing deskwork to make sure there aren't soo many shadows (so 2-3 lights?)\n\ni'm aware i'm well down the curve on knowledge of cameras and have been avoidant for years from fear of not \"getting\" it, but i really, really want that to change. i finally think my artwork is starting to become good enough worth capturing and making tutorial videos, so i want to learn what i can with the right tools.\n\nmy computer/software are all high-end so no changes needed there (save maybe a new monitor). money isn't too big of an issue, but if i could keep it under 5k usd for the entire setup initially i would love that.\n\nalso, any online course suggestions that would help a noob leave layman status with terminology would be super welcomed as well!\n\nany and all help would be greatly, gildedly appreciated! \n\nthank you!", "sortedWord": "None", "identifyer": 18149, "year": "2021"}, {"Unnamed: 0": 223521, "autor": "isawagoose", "date": 1634134928000, "content": "Nikon FM film advance lever problem /!/ I've never had any issues with this camera, and this happened out of nowhere with no apparent cause, and I'm hoping this is something minor I can fix myself. The advance lever only goes to the on position and no further, as if the shutter is ready to fire, but the shutter button does nothing, as if the shutter was already fired.", "link": "https://www.reddit.com/r/Cameras/comments/q7c898/nikon_fm_film_advance_lever_problem/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fm film advance lever problem /!/ i've never had any issues with this camera, and this happened out of nowhere with no apparent cause, and i'm hoping this is something minor i can fix myself. the advance lever only goes to the on -----> position !!!  and no further, as if the shutter is ready to fire, but the shutter button does nothing, as if the shutter was already fired.", "sortedWord": "None", "identifyer": 18172, "year": "2021"}, {"Unnamed: 0": 223823, "autor": "Iridescences1", "date": 1615413371000, "content": "Which camera to choose (Z7 II, AR7 IV, R6, R) /!/ Hi all, I am looking for recommendation for my next camera body w/ lens. While I could afford the R5 with the  24-105 f/4 I feel that it is too much money compared to the other options.\n\nWith the current prices I have broken down my list to this:\n\nhttps://preview.redd.it/lyblsbsrs9m61.png?width=1471&amp;format=png&amp;auto=webp&amp;s=9e519419bb940eaef461680fee72f6a94fc43774\n\nhttps://preview.redd.it/b69xdesrs9m61.png?width=1447&amp;format=png&amp;auto=webp&amp;s=1e88ba17f6037b173b4cf6af20420f80ccf7be9b\n\nI would even consider EOS R with a f/2.8  15-35 wide angle or versatile 24-70 f2.8\n\nI am not really interested in video capacity. I shoot mostly landscape and adventure sports (Rock climbing, hiking,...).\n\nI am geared toward canon as I own one (18MPX , Planning to sell it with it's only lens) but I am a good point where I could switch to an other brand without loosing money. \n\nWhile I like Nikon quality I have a hard time thinking about using a LCD that can't move around like canon's for climbing shots as I ended twisted in different positions.\n\nI would like to start doing prints and more cropping as needed and this is why I'm hesitating on the  20MPX of the R6 though using it for a year or so and move to a R5 later on could be an option.\n\nWould happy to see what suggestion you may have or for/against", "link": "https://www.reddit.com/r/Cameras/comments/m29ywr/which_camera_to_choose_z7_ii_ar7_iv_r6_r/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "which camera to choose (z7 ii, ar7 iv, r6, r) /!/ hi all, i am looking for recommendation for my next camera body w/ lens. while i could afford the r5 with the  24-105 f/4 i feel that it is too much money compared to the other options.\n\nwith the current prices i have broken down my list to this:\n\nhttps://preview.redd.it/lyblsbsrs9m61.png?width=1471&amp;format=png&amp;auto=webp&amp;s=9e519419bb940eaef461680fee72f6a94fc43774\n\nhttps://preview.redd.it/b69xdesrs9m61.png?width=1447&amp;format=png&amp;auto=webp&amp;s=1e88ba17f6037b173b4cf6af20420f80ccf7be9b\n\ni would even consider eos r with a f/2.8  15-35 wide angle or versatile 24-70 f2.8\n\ni am not really interested in video capacity. i shoot mostly landscape and adventure sports (rock climbing, hiking,...).\n\ni am geared toward canon as i own one (18mpx , planning to sell it with it's only lens) but i am a good point where i could switch to an other brand without loosing money. \n\nwhile i like nikon quality i have a hard time thinking about using a lcd that can't move around like canon's for climbing shots as i ended twisted in different -----> positions !!! .\n\ni would like to start doing prints and more cropping as needed and this is why i'm hesitating on the  20mpx of the r6 though using it for a year or so and move to a r5 later on could be an option.\n\nwould happy to see what suggestion you may have or for/against", "sortedWord": "None", "identifyer": 18490, "year": "2021"}, {"Unnamed: 0": 224008, "autor": "anomalySG", "date": 1613327137000, "content": "Canon m50 vs Sony a6100 vs Fujifilm xt-200 for sports/dance, cinematic and interview shoots /!/ I'm a complete beginner when it comes to cameras and videography. \nI have narrowed down my search to these three cameras.\nI live in India, here the m50 and xt-200 cost the same. Sony a6100 costs around 140 USD more.\n\nMy first question would be, is a6100 really worth the extra 140 USD? Because it is slightly out of my budget right now.\n\nSecond question would be, if I had to chose between m50 and Xt200, id go with the Xt200 because of no crop in 4k and 120 fps for 1080p (it will be useful for sports shoots). But I have a friend who has canon lenses that I can use with the m50 so I don't have to spend extra on those. I can't spend on Fujifilm lenses for another 5 months minimum because all the good ones are expensive. \n\nIf you were in my position, which camera would you buy?\nIs there any other camera that I should check?\n\nThis is my actual preference, sports/dance &gt; cinematic &gt; interviews.", "link": "https://www.reddit.com/r/Cameras/comments/lju0y7/canon_m50_vs_sony_a6100_vs_fujifilm_xt200_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon m50 vs sony a6100 vs fujifilm xt-200 for sports/dance, cinematic and interview shoots /!/ i'm a complete beginner when it comes to cameras and videography. \ni have narrowed down my search to these three cameras.\ni live in india, here the m50 and xt-200 cost the same. sony a6100 costs around 140 usd more.\n\nmy first question would be, is a6100 really worth the extra 140 usd? because it is slightly out of my budget right now.\n\nsecond question would be, if i had to chose between m50 and xt200, id go with the xt200 because of no crop in 4k and 120 fps for 1080p (it will be useful for sports shoots). but i have a friend who has canon lenses that i can use with the m50 so i don't have to spend extra on those. i can't spend on fujifilm lenses for another 5 months minimum because all the good ones are expensive. \n\nif you were in my -----> position !!! , which camera would you buy?\nis there any other camera that i should check?\n\nthis is my actual preference, sports/dance &gt; cinematic &gt; interviews.", "sortedWord": "None", "identifyer": 18682, "year": "2021"}, {"Unnamed: 0": 224171, "autor": "PinkCuttlefish", "date": 1618809239000, "content": "Buying a camera for our ROTC unit /!/ Hello r/Cameras!\n\nI am currently a midshipman in a Navy ROTC battalion and I have a bit of a dilemma. It's important that our battalion takes photographs of what we do to create a public image. Unfortunately, since many of us are busy engineering students, it is rare that we come across someone that is a good photographer, or someone who has even taken basic classes. Every semester our photographer position changes meaning that oftentimes, it's difficult to even prepare for the role.\n\nWe are currently searching for a new camera as our old one is starting to get outdated. The camera is an older Nikon D3100 and the age is starting to show.  My supervisor didn't give me an exact budget range, but told me \"I would suggest avoiding the cheapest option but also don’t think we need top-of-the-line either\". So the budget is a little flexible here.\n\nI'm asking for your help in suggestions of cameras that would fit our needs. What we're looking for is a camera with some of the following traits, listed in order of priority:\n\n1. **Ease of use**. We're looking for something that's easier to \"just pick up and shoot\" with. We realize that no camera makes you a perfect photographer, but whatever you guys think is on the more user-friendly side!\n\n2. **Still photography**. Many of the pictures we take are at events where the subjects can hold a pose, so high quality photos of non-moving subjects would be great.\n\n3. **Low light**. Oftentimes I've found myself in a situation where I struggle to get enough exposure without getting super blurry shots. I'm not quite sure if this is a trait that differs between cameras, but this would be a nice quality to have in our camera.\n\n4. **Moving photography**. I know this one contradicts #2 a little bit but I thought I'd throw it out there. We also like to take pictures of our midshipmen in action, such as PT, close order drill, field exercises, etc. Again, not a must-have but a nice addition.\n\n* We're also looking for some **lenses**! One or two is really all we can afford.\n\nI totally understand that good photography is the product of a *good photographer, not a good camera*. Unfortunately, we rarely have the time to give our midshipmen classes on photography, so we're kind of forced to rely on a good camera. \n\nAny suggestion helps my search! Ironically as the photographer I don't know too much about photography, especially since I'm trying to learn Illustrator and Photoshop at the same time, all on top of my regular workload. I really appreciate you guys for taking the time to respond, so thank you very much!\n\n-MIDN PinkCuttlefish", "link": "https://www.reddit.com/r/Cameras/comments/mttogh/buying_a_camera_for_our_rotc_unit/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "buying a camera for our rotc unit /!/ hello r/cameras!\n\ni am currently a midshipman in a navy rotc battalion and i have a bit of a dilemma. it's important that our battalion takes photographs of what we do to create a public image. unfortunately, since many of us are busy engineering students, it is rare that we come across someone that is a good photographer, or someone who has even taken basic classes. every semester our photographer -----> position !!!  changes meaning that oftentimes, it's difficult to even prepare for the role.\n\nwe are currently searching for a new camera as our old one is starting to get outdated. the camera is an older nikon d3100 and the age is starting to show.  my supervisor didn't give me an exact budget range, but told me \"i would suggest avoiding the cheapest option but also don’t think we need top-of-the-line either\". so the budget is a little flexible here.\n\ni'm asking for your help in suggestions of cameras that would fit our needs. what we're looking for is a camera with some of the following traits, listed in order of priority:\n\n1. **ease of use**. we're looking for something that's easier to \"just pick up and shoot\" with. we realize that no camera makes you a perfect photographer, but whatever you guys think is on the more user-friendly side!\n\n2. **still photography**. many of the pictures we take are at events where the subjects can hold a pose, so high quality photos of non-moving subjects would be great.\n\n3. **low light**. oftentimes i've found myself in a situation where i struggle to get enough exposure without getting super blurry shots. i'm not quite sure if this is a trait that differs between cameras, but this would be a nice quality to have in our camera.\n\n4. **moving photography**. i know this one contradicts #2 a little bit but i thought i'd throw it out there. we also like to take pictures of our midshipmen in action, such as pt, close order drill, field exercises, etc. again, not a must-have but a nice addition.\n\n* we're also looking for some **lenses**! one or two is really all we can afford.\n\ni totally understand that good photography is the product of a *good photographer, not a good camera*. unfortunately, we rarely have the time to give our midshipmen classes on photography, so we're kind of forced to rely on a good camera. \n\nany suggestion helps my search! ironically as the photographer i don't know too much about photography, especially since i'm trying to learn illustrator and photoshop at the same time, all on top of my regular workload. i really appreciate you guys for taking the time to respond, so thank you very much!\n\n-midn pinkcuttlefish", "sortedWord": "None", "identifyer": 18853, "year": "2021"}, {"Unnamed: 0": 224497, "autor": "SleepyYaoiGuy", "date": 1609728136000, "content": "Looking to get a camera for a means of making money. /!/ After a lot of research it seems my best option for making money while going college full time is to become a part time photographer/videographer.\n\nI really dont like buying things to upgrade from, but im also pretty damn poor. \n\nI'm looking to finance a camera, or possibly get a good deal on a used one if I can find one. \n(Saving isn't an option. I know people hate financing but im not going to be in a buying position for a while and traditional jobs dont really work for me, especially with the virus.)\n\n\nIf you know anyone that does quick financing that would be helpful, \n\nAlso what cameras I should get/what I should avoid.", "link": "https://www.reddit.com/r/Cameras/comments/kpzbh3/looking_to_get_a_camera_for_a_means_of_making/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking to get a camera for a means of making money. /!/ after a lot of research it seems my best option for making money while going college full time is to become a part time photographer/videographer.\n\ni really dont like buying things to upgrade from, but im also pretty damn poor. \n\ni'm looking to finance a camera, or possibly get a good deal on a used one if i can find one. \n(saving isn't an option. i know people hate financing but im not going to be in a buying -----> position !!!  for a while and traditional jobs dont really work for me, especially with the virus.)\n\n\nif you know anyone that does quick financing that would be helpful, \n\nalso what cameras i should get/what i should avoid.", "sortedWord": "None", "identifyer": 19202, "year": "2021"}, {"Unnamed: 0": 224499, "autor": "SL-Apparel", "date": 1609726123000, "content": "Camcorder or DSLR needed for skateboarding /!/ Hi all,\n\nLooking to purchase a camera to film skateboarding, budget is around £600-£1000\nAm pretty much a noob when it comes to cameras and don’t know much. I won’t really need to take photographs I’m more interested in filming moving shots with a fisheye lens and shooting some long lens/wide angle from stationary position. Would anyone have any recommendations for the above? \n\nThanks", "link": "https://www.reddit.com/r/Cameras/comments/kpypk1/camcorder_or_dslr_needed_for_skateboarding/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camcorder or dslr needed for skateboarding /!/ hi all,\n\nlooking to purchase a camera to film skateboarding, budget is around £600-£1000\nam pretty much a noob when it comes to cameras and don’t know much. i won’t really need to take photographs i’m more interested in filming moving shots with a fisheye lens and shooting some long lens/wide angle from stationary -----> position !!! . would anyone have any recommendations for the above? \n\nthanks", "sortedWord": "None", "identifyer": 19204, "year": "2021"}, {"Unnamed: 0": 224518, "autor": "christianbaines123", "date": 1609676246000, "content": "GoPro Gimbal that tracks a subject? /!/ Does any handheld gimbal exist where your gimbal can position itself to follow a subject for example if you are recording someone while following them, is there a receiver that the subject carries that the gimbal can follow? I've seen this sort of thing used on stationary cameras where it follows a receiver that the person carries and it records them as they walk around a room, but is there a gimbal that does this?", "link": "https://www.reddit.com/r/Cameras/comments/kpjon8/gopro_gimbal_that_tracks_a_subject/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "gopro gimbal that tracks a subject? /!/ does any handheld gimbal exist where your gimbal can -----> position !!!  itself to follow a subject for example if you are recording someone while following them, is there a receiver that the subject carries that the gimbal can follow? i've seen this sort of thing used on stationary cameras where it follows a receiver that the person carries and it records them as they walk around a room, but is there a gimbal that does this?", "sortedWord": "None", "identifyer": 19224, "year": "2021"}, {"Unnamed: 0": 224872, "autor": "auserhasnoname7", "date": 1621355324000, "content": "Go pro or ordro ep7 for pov streaming mostly stationary working with my hands indoors? /!/ I want to record what my eyes see while im working.\nGo pro has great reviews and is a popular well known product but it caters to action and idk if i need a fancy stabilizer and waterproofing. I also dont like the head mount for the go pro, im not sure if the forehead is gonna get the angle i want. \n\nThe ordro is sketchy, Ive seen what i think is the same model range in price from 130 to 250. The reviews are mixed. But the price point of 150 ish at walmart and the temple mounted position is ideal for my purposes. I cant get any straight answers about this camera. \n\nSome other factors: Id also like to be able to livestream, and the lighting in my workshop is less than ideal.\n\nIf there's a completely different camera you can suggest im open to alternatives.", "link": "https://www.reddit.com/r/Cameras/comments/nff59v/go_pro_or_ordro_ep7_for_pov_streaming_mostly/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "go pro or ordro ep7 for pov streaming mostly stationary working with my hands indoors? /!/ i want to record what my eyes see while im working.\ngo pro has great reviews and is a popular well known product but it caters to action and idk if i need a fancy stabilizer and waterproofing. i also dont like the head mount for the go pro, im not sure if the forehead is gonna get the angle i want. \n\nthe ordro is sketchy, ive seen what i think is the same model range in price from 130 to 250. the reviews are mixed. but the price point of 150 ish at walmart and the temple mounted -----> position !!!  is ideal for my purposes. i cant get any straight answers about this camera. \n\nsome other factors: id also like to be able to livestream, and the lighting in my workshop is less than ideal.\n\nif there's a completely different camera you can suggest im open to alternatives.", "sortedWord": "None", "identifyer": 19587, "year": "2021"}, {"Unnamed: 0": 225380, "autor": "helloworldCGN", "date": 1623077778000, "content": "Club Photography Lens recommendation /!/ Hi there,\n\nI just got the position to do photography in a nightclub, which means it's going to be dark inside.\n\nAt the moment I own a Canon 750D (I know it's not an amazing DSLR). \n\nI need some advice on the lens choice and flash light.\n\nDo you recommend on staying on that DSLR? Or should I upgrade after I get some money together?\n\nAlso which lens would be recommended for night club photography, I have read that the 17-50mm f2.8 is a good one.\n\nRegarding the flash I think a amazon one would do the job. \n\nThank you all!", "link": "https://www.reddit.com/r/Cameras/comments/nueif0/club_photography_lens_recommendation/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "club photography lens recommendation /!/ hi there,\n\ni just got the -----> position !!!  to do photography in a nightclub, which means it's going to be dark inside.\n\nat the moment i own a canon 750d (i know it's not an amazing dslr). \n\ni need some advice on the lens choice and flash light.\n\ndo you recommend on staying on that dslr? or should i upgrade after i get some money together?\n\nalso which lens would be recommended for night club photography, i have read that the 17-50mm f2.8 is a good one.\n\nregarding the flash i think a amazon one would do the job. \n\nthank you all!", "sortedWord": "None", "identifyer": 20111, "year": "2021"}, {"Unnamed: 0": 226437, "autor": "Ballsticseal", "date": 1630629439000, "content": "Looking for camera for real estate videography and personal film projects /!/ I am based in Australia and have been video editing as a hobby for around 5 years. 7 months ago, I started a high school certificate in media offered by a local uni and was inspired to pursue cinematography in college. \n\nI've always had a love of taking videos and photos and now that I'm in a position to afford a decent camera as i have landed a side gig filming houses for family friends in the real estate industry, I would like some suggestions on DSLR cameras. (assuming that's the type of camera I need)\n\nI don't really know a whole lot about cameras (I know the basics and how they work) but i would appreciate some help. My budget is around AUD$600 but going over is totally ok.\n\nThank you in advance and sorry for weird formatting, my OCD is wack.", "link": "https://www.reddit.com/r/Cameras/comments/pguebc/looking_for_camera_for_real_estate_videography/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for camera for real estate videography and personal film projects /!/ i am based in australia and have been video editing as a hobby for around 5 years. 7 months ago, i started a high school certificate in media offered by a local uni and was inspired to pursue cinematography in college. \n\ni've always had a love of taking videos and photos and now that i'm in a -----> position !!!  to afford a decent camera as i have landed a side gig filming houses for family friends in the real estate industry, i would like some suggestions on dslr cameras. (assuming that's the type of camera i need)\n\ni don't really know a whole lot about cameras (i know the basics and how they work) but i would appreciate some help. my budget is around aud$600 but going over is totally ok.\n\nthank you in advance and sorry for weird formatting, my ocd is wack.", "sortedWord": "None", "identifyer": 21221, "year": "2021"}, {"Unnamed: 0": 226800, "autor": "niall_b", "date": 1633310523000, "content": "This Tokina AT-X 17mm AF PRO lens is supposed to lock down into manual focus by pulling the focus ring back. It only seems to work in select places and sometimes needs to be turned while pulling it into posions. The position may even change. Is it broken or am I doing something wrong? Manual anyone?", "link": "https://www.reddit.com/r/Cameras/comments/q0vcb7/this_tokina_atx_17mm_af_pro_lens_is_supposed_to/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this tokina at-x 17mm af pro lens is supposed to lock down into manual focus by pulling the focus ring back. it only seems to work in select places and sometimes needs to be turned while pulling it into posions. the -----> position !!!  may even change. is it broken or am i doing something wrong? manual anyone?", "sortedWord": "None", "identifyer": 21600, "year": "2021"}, {"Unnamed: 0": 226808, "autor": "niall_b", "date": 1633301857000, "content": "My new to me, Tokina 17mm AT-X 17 AF PRO lens is not shifting to manual focus reliably. It usually shifts in one position close to 0.25 but sometimes I need to start higher like 4.0 and pull gently while turning in that direction. I can't find the manual, is there a trick to it? Is this a glitch?", "link": "https://www.reddit.com/r/Cameras/comments/q0sv6w/my_new_to_me_tokina_17mm_atx_17_af_pro_lens_is/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my new to me, tokina 17mm at-x 17 af pro lens is not shifting to manual focus reliably. it usually shifts in one -----> position !!!  close to 0.25 but sometimes i need to start higher like 4.0 and pull gently while turning in that direction. i can't find the manual, is there a trick to it? is this a glitch?", "sortedWord": "None", "identifyer": 21608, "year": "2021"}, {"Unnamed: 0": 227552, "autor": "OnirrapDivad", "date": 1620102147000, "content": "Baller on a Budget /!/ Hello All,\n\nI'm looking to snag a good deal on a used DSLR and I have found what I believe to be three pretty great deals on a used: Canon 6D, a Pentax K5ii, or Pentax KS2. Anybody want to talk me out of one and into another? \n\nI'm looking for weather sealing, affordable lenses, good low light, and relatively fast time between turning on the camera to shooting. I will be using it for travel, street photography, portraits, night sky (when traveling), hiking (mostly taking landscapes and pictures of birds (tele?) and insects (macro)), and using video to document family events and major milestones. I have no aspiration for professional (pro=paid?) photography, however, I do love tinkering with settings and pretending that I am pro - I already have a job that I love so this is a passion driven hobby. I have always loved photography and had an interest in taking artistic shots since I was a kid. My wife and I are renting a convertible to drive Route 66 starting near a friend's house in Oklahoma and ending at the Santa Monica Pier in California. She bought a Rt66 insider book (EZ66) and wants me to take some great pictures while we cross a nice portion of North America. We have discussed that we are planning to stop \"not trying\" to have kids and we both agree that now might be a good time to invest in another camera.  I normally shoot with a Sony RX100mk4 and am looking to get something much *different.* In college I had a canon G10 which I loved but it was stolen from my car's glove box (lock your car kids! - I will never get the photos of those aldabra tortoises back!) forcing me to search for something to fill the void. I ended up finding a kid who wanted to get rid of his mirrorless Olympus Pen EPL1 and its kit lens (I paid a ridiculously low $40 with memory card) which was a great load of fun but I was always too broke to invest in other lenses besides adapters for older lenses I found in the thrift store; things have changed and I'm in more of a position to invest in some glass. I do love my handy RX100mk4 for how powerful it is in such an inconspicuous package; i.e. great for street and museum because most people don't even notice it. It sees better than I do in the dark (fast lens) as long as I don't zoom in. It is perfect for traveling around places where a full size camera isn't too welcome and fits (*barely*) in my pocket when my wife and I are on a date. I love that there is very little delay between turning it on to when I can start shooting - I don't want to miss the chance to capture a moment because my camera is slow to wake up. I also like that it focuses pretty quickly and there is no noticeable delay between depressing the 2nd stop and the RX taking the picture.  The RX100 does have its shortcomings - it has no weather sealing which makes me very anxious - I hiked with it on the Inca trail and cut up a water bottle to make a special shield which clung to my neck strap and slid down over the camera when we were being rained on - this worked but the whole time I was thinking how I wish I had a weather sealed Pentax.  Pixel peeping isn't a good idea with the RX100mk4 as some pictures aren't as crisp as I'd like.   \nI'm interested in a bigger sandbox and looking to get one of the 3 previously mentioned cameras because: 1. First and foremost, I am a baller on a budget. As much as I would like a Sony a7siii, I cannot justify spending more than $500 on a camera body + first lens at this time. 2. I have romanced the idea of a larger sensor. 3. I have romanced the idea of the versatility of lenses. 4. I want the delay between turning on the camera to taking a picture to be reasonably short. 5. I am the kind of guy who likes to take pictures in bad lighting without using a flash. I'm that guy. 6. I want to take this thing outside and it rains a lot in Florida. 7. I tend to hold onto my cameras and expect to keep this thing for a long time. \n\nThe competition:\n\nThe Canon 6D is being offered for $450 with a 50mm lens. Seller says they bought it towards the end of the before-times with 12k actuations and hasn't used it much since. It needs a new eye-cup and the selector knob label is missing (can be replaced).  I like that it has a biiiiiiiig full frame sensor and am curious to learn to use the LCD screen on top of the body while shooting. While the 6D is weather sealed, the weather sealed lenses seem a lot more expensive compared to the Pentax offerings. \n\nI have romanced the idea of Pentax cameras for a while, starting with the K-01 which I always thought had a beautiful design, however, I don't think the K-01 ergonomics fit with what I am looking for. I *am* looking forward to the \"Legendary\" weather sealing and purist photography experience synonymous with Pentax. \n\nThe two Pentax deals I am considering are:\n\nK5ii -Seller is offering body only, but with added battery grip. Great APS-C sensor - \"semi-pro\" tier model. Has a LCD on top. Lots of \"weather sealed\" lenses available at reasonable prices and old manual focus K-mounts available. Supposedly good in low light. Seller offering for $200, so I'd need to spend some $$ to take my first picture. If I get this camera, I can afford a couple of cheap weather sealed e-bay lenses or one nicer lens before I hit the budget of the 6D\n\nKS2 - Seller is offering with a 50mm lens. Claims it has been babied. Looks babied.  It is the newest of the 3. Still weather sealed. Same benefits of lenses as the K5ii. Has some nice features like Wi-Fi. CON: no LCD on top (does anybody even use theirs? Am I focusing too much on this feature?). It looks more like a consumer grade but the specs are pretty nice and of the 3, [cameracompare.com](https://cameracompare.com) is telling me that it is a no-brainer  (whoopie! :P) Seller offering for $360\n\nReddit,  \n\n\nWhich camera do you think I should spring for? Any lens recommendations? Should I snap out of it and just be glad to have a RX100mk4 and spend the money I would have spent on these cameras on a bunch of Big Texan style giant steak challenges instead?  \n\n\nThank you in advance!", "link": "https://www.reddit.com/r/Cameras/comments/n4fu7g/baller_on_a_budget/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "baller on a budget /!/ hello all,\n\ni'm looking to snag a good deal on a used dslr and i have found what i believe to be three pretty great deals on a used: canon 6d, a pentax k5ii, or pentax ks2. anybody want to talk me out of one and into another? \n\ni'm looking for weather sealing, affordable lenses, good low light, and relatively fast time between turning on the camera to shooting. i will be using it for travel, street photography, portraits, night sky (when traveling), hiking (mostly taking landscapes and pictures of birds (tele?) and insects (macro)), and using video to document family events and major milestones. i have no aspiration for professional (pro=paid?) photography, however, i do love tinkering with settings and pretending that i am pro - i already have a job that i love so this is a passion driven hobby. i have always loved photography and had an interest in taking artistic shots since i was a kid. my wife and i are renting a convertible to drive route 66 starting near a friend's house in oklahoma and ending at the santa monica pier in california. she bought a rt66 insider book (ez66) and wants me to take some great pictures while we cross a nice portion of north america. we have discussed that we are planning to stop \"not trying\" to have kids and we both agree that now might be a good time to invest in another camera.  i normally shoot with a sony rx100mk4 and am looking to get something much *different.* in college i had a canon g10 which i loved but it was stolen from my car's glove box (lock your car kids! - i will never get the photos of those aldabra tortoises back!) forcing me to search for something to fill the void. i ended up finding a kid who wanted to get rid of his mirrorless olympus pen epl1 and its kit lens (i paid a ridiculously low $40 with memory card) which was a great load of fun but i was always too broke to invest in other lenses besides adapters for older lenses i found in the thrift store; things have changed and i'm in more of a -----> position !!!  to invest in some glass. i do love my handy rx100mk4 for how powerful it is in such an inconspicuous package; i.e. great for street and museum because most people don't even notice it. it sees better than i do in the dark (fast lens) as long as i don't zoom in. it is perfect for traveling around places where a full size camera isn't too welcome and fits (*barely*) in my pocket when my wife and i are on a date. i love that there is very little delay between turning it on to when i can start shooting - i don't want to miss the chance to capture a moment because my camera is slow to wake up. i also like that it focuses pretty quickly and there is no noticeable delay between depressing the 2nd stop and the rx taking the picture.  the rx100 does have its shortcomings - it has no weather sealing which makes me very anxious - i hiked with it on the inca trail and cut up a water bottle to make a special shield which clung to my neck strap and slid down over the camera when we were being rained on - this worked but the whole time i was thinking how i wish i had a weather sealed pentax.  pixel peeping isn't a good idea with the rx100mk4 as some pictures aren't as crisp as i'd like.   \ni'm interested in a bigger sandbox and looking to get one of the 3 previously mentioned cameras because: 1. first and foremost, i am a baller on a budget. as much as i would like a sony a7siii, i cannot justify spending more than $500 on a camera body + first lens at this time. 2. i have romanced the idea of a larger sensor. 3. i have romanced the idea of the versatility of lenses. 4. i want the delay between turning on the camera to taking a picture to be reasonably short. 5. i am the kind of guy who likes to take pictures in bad lighting without using a flash. i'm that guy. 6. i want to take this thing outside and it rains a lot in florida. 7. i tend to hold onto my cameras and expect to keep this thing for a long time. \n\nthe competition:\n\nthe canon 6d is being offered for $450 with a 50mm lens. seller says they bought it towards the end of the before-times with 12k actuations and hasn't used it much since. it needs a new eye-cup and the selector knob label is missing (can be replaced).  i like that it has a biiiiiiiig full frame sensor and am curious to learn to use the lcd screen on top of the body while shooting. while the 6d is weather sealed, the weather sealed lenses seem a lot more expensive compared to the pentax offerings. \n\ni have romanced the idea of pentax cameras for a while, starting with the k-01 which i always thought had a beautiful design, however, i don't think the k-01 ergonomics fit with what i am looking for. i *am* looking forward to the \"legendary\" weather sealing and purist photography experience synonymous with pentax. \n\nthe two pentax deals i am considering are:\n\nk5ii -seller is offering body only, but with added battery grip. great aps-c sensor - \"semi-pro\" tier model. has a lcd on top. lots of \"weather sealed\" lenses available at reasonable prices and old manual focus k-mounts available. supposedly good in low light. seller offering for $200, so i'd need to spend some $$ to take my first picture. if i get this camera, i can afford a couple of cheap weather sealed e-bay lenses or one nicer lens before i hit the budget of the 6d\n\nks2 - seller is offering with a 50mm lens. claims it has been babied. looks babied.  it is the newest of the 3. still weather sealed. same benefits of lenses as the k5ii. has some nice features like wi-fi. con: no lcd on top (does anybody even use theirs? am i focusing too much on this feature?). it looks more like a consumer grade but the specs are pretty nice and of the 3, [cameracompare.com](https://cameracompare.com) is telling me that it is a no-brainer  (whoopie! :p) seller offering for $360\n\nreddit,  \n\n\nwhich camera do you think i should spring for? any lens recommendations? should i snap out of it and just be glad to have a rx100mk4 and spend the money i would have spent on these cameras on a bunch of big texan style giant steak challenges instead?  \n\n\nthank you in advance!", "sortedWord": "None", "identifyer": 22388, "year": "2021"}], "name": "positionCameras2021"}