{"interestingcomments": [{"autor": "dwahzz", "date": "2020-11-21 00:35:18", "content": "Purchase advice for a beginner /!/ So am basically a noob to cameras but always had a fascination and eye for photography. \n\nI'm now in my second year of university doing design engineering, and I've already accumulated a substantial amount of work (3d printed models, metal work, wood work, blueprints/diagrams etc.). \nMy lecturers have all emphasised the importance of building a strong portfolio for future prospects and I aim to upload all my work to a website im creating. \n\nAs I want all my work to be viewable online, I want to make sure all the images taken of my models and designs are of good quality. Hence why I need camera advice.\n\nI was debating purchasing a Canon Powershot G7 X Mark 2 but I really am unsure as its alot of money for me but I can justify it for the amount of time I'll keep the camera. \nMy budget is around £500 and I mainly need the camera for still shots and the occasional video. I'm not worrying too much about accessories as I can 3D print things like tripod mounts or dolly's. I also have access to image editing software (Photoshop and Lightroom) which definitly helps.\n\nInitially I was debating just getting by with my smartphone (Samsung Note 9), but I would feel better if I heard some opinions of others who are more knowledgeable with cameras and photography than I am. \n\nAny advice is greatly appricated!", "link": "https://www.reddit.com/r/Cameras/comments/jy14ly/purchase_advice_for_a_beginner/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "purchase advice for a beginner /!/ so am basically a noob to cameras but always had a fascination and eye for photography. \n\ni'm now in my second year of university doing design engineering, and i've already accumulated a substantial amount of work (-----> 3d !!!  -----> printed !!!  models, metal work, wood work, blueprints/diagrams etc.). \nmy lecturers have all emphasised the importance of building a strong portfolio for future prospects and i aim to upload all my work to a website im creating. \n\nas i want all my work to be viewable online, i want to make sure all the images taken of my models and designs are of good quality. hence why i need camera advice.\n\ni was debating purchasing a canon powershot g7 x mark 2 but i really am unsure as its alot of money for me but i can justify it for the amount of time i'll keep the camera. \nmy budget is around £500 and i mainly need the camera for still shots and the occasional video. i'm not worrying too much about accessories as i can 3d print things like tripod mounts or dolly's. i also have access to image editing software (photoshop and lightroom) which definitly helps.\n\ninitially i was debating just getting by with my smartphone (samsung note 9), but i would feel better if i heard some opinions of others who are more knowledgeable with cameras and photography than i am. \n\nany advice is greatly appricated!", "sortedWord": "None", "Identifyer": null, "identifyer": 2096, "year": "2020"}, {"autor": "twvancamp", "date": "2020-01-29 15:58:24", "content": "3D printed tab for the Oly 35RC's impossibly small aperture ring", "link": "https://www.reddit.com/r/Cameras/comments/evoq87/3d_printed_tab_for_the_oly_35rcs_impossibly_small/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  tab for the oly 35rc's impossibly small aperture ring", "sortedWord": "None", "Identifyer": null, "identifyer": 2495, "year": "2020"}, {"autor": "nichofilm", "date": "2020-01-14 18:00:38", "content": "My 3D printed Goodman Zone Camera! It takes a RB67 Pro-S back and Mamiya Press Lenses.", "link": "https://www.reddit.com/r/Cameras/comments/eoosbz/my_3d_printed_goodman_zone_camera_it_takes_a_rb67/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "my -----> 3d !!!  -----> printed !!!  goodman zone camera! it takes a rb67 pro-s back and mamiya press lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 2654, "year": "2020"}, {"autor": "nikkimendezdesigns", "date": "2020-02-27 23:43:54", "content": "The original batteries needed for the ‘zeiss ikon voigtländer vitessa 500 se electronic’ camera are no longer made so i 3D printed a wedge to secure some 625A batteries in place", "link": "https://www.reddit.com/r/Cameras/comments/falbfj/the_original_batteries_needed_for_the_zeiss_ikon/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "the original batteries needed for the ‘zeiss ikon voigtländer vitessa 500 se electronic’ camera are no longer made so i -----> 3d !!!  -----> printed !!!  a wedge to secure some 625a batteries in place", "sortedWord": "None", "Identifyer": null, "identifyer": 5103, "year": "2020"}, {"autor": "freckled-boi", "date": "2020-04-23 20:35:12", "content": "Modified and 3D printed the Goodman Axis (Dora Goodman) to hold a 9x12 filmsheet holder", "link": "https://www.reddit.com/r/Cameras/comments/g6udfj/modified_and_3d_printed_the_goodman_axis_dora/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "modified and -----> 3d !!!  -----> printed !!!  the goodman axis (dora goodman) to hold a 9x12 filmsheet holder", "sortedWord": "None", "Identifyer": null, "identifyer": 5742, "year": "2020"}, {"autor": "AxFairy", "date": "2020-10-26 15:23:14", "content": "What type of camera am I looking for? /!/ Recently I've converted my walk in closet to a small woodworking shop. I'm planning to pickup some material and build myself an acoustic guitar in there, I built one a few years back but had far more space and a lot more tools at the time, so it should be interesting to do it with only handtools.\n\nI'm interested in mounting a camera to the ceiling and making a time lapse of the process. The lighting in the room isn't great, but I'll probably stick an extra lamp in there soon. \n\nI don't really know what the best way to go about this is. 3D print a mount for a GoPro and unload it every x hours? Something with an SD card? Would a dashcam for a car be enough for my purposes?\n\nI'm hesitant to give a budget without really knowing what I'm doing, if I can go cheap and get something functional perfect, but if it's a tool that will last me a while and let me do other projects in the future I'm open to spending more.", "link": "https://www.reddit.com/r/Cameras/comments/jigi0u/what_type_of_camera_am_i_looking_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "what type of camera am i looking for? /!/ recently i've converted my walk in closet to a small woodworking shop. i'm planning to pickup some material and build myself an acoustic guitar in there, i built one a few years back but had far more space and a lot more tools at the time, so it should be interesting to do it with only handtools.\n\ni'm interested in mounting a camera to the ceiling and making a time lapse of the process. the lighting in the room isn't great, but i'll probably stick an extra lamp in there soon. \n\ni don't really know what the best way to go about this is. -----> 3d !!!  -----> print !!!  a mount for a gopro and unload it every x hours? something with an sd card? would a dashcam for a car be enough for my purposes?\n\ni'm hesitant to give a budget without really knowing what i'm doing, if i can go cheap and get something functional perfect, but if it's a tool that will last me a while and let me do other projects in the future i'm open to spending more.", "sortedWord": "None", "Identifyer": null, "identifyer": 6998, "year": "2020"}, {"autor": "doitwheneverYT", "date": "2020-12-06 17:30:26", "content": "Open source 6 axis motion camera - 3D PRINTED", "link": "https://www.reddit.com/r/Cameras/comments/k7xxl2/open_source_6_axis_motion_camera_3d_printed/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "open source 6 axis motion camera - -----> 3d !!!  -----> printed !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 7323, "year": "2020"}], "name": "printCameras2020"}