{"interestingcomments": [{"Unnamed: 0": 184958, "autor": "plotynus", "date": 1577644459000, "content": "Advice on Panasonic G85 /!/ Hi there!\n\nI work in digital marketing for several small businesses here in my city. I'm looking to buy a good camera for video, as video content is always needed, and we tend to outsource it and it's a pain for me, both to work correctly and also because of the extra-cost my clients have. I have minimal experience with cameras, but very willing to learn. As most of it are small videos of just people talking to a camera, I think any camera might do the trick. But, I also do have a podcast and give lectures in my town, so I need a camera that can record longer than 30 minutes to record those. And since my budget is limited, I can only afford one good camera and that's all. \n\nSo, after researching a lot, I came to the conclusion that the G85 is what I'm looking for. But I want confirmation from you guys, as I don't want to buy something it might not be what I need.\n\n In summary, this is what I need:\n\n* Professional video quality for business production.\n* Must record more than 30 mins. I need at least one hour of straight recording (just press record and do my thing), and optimally, two hours. No internal limit, no overheating.\n* Can connect a mic jack onto it.\n* A plus: Good on low-light situations.\n* Also, I've heard that the autofocus is a thing in these cameras, is really that bad for what I need?\n\nAny help would be gladly appreciated! I've been thinking if a good camcorder would also do the trick, but honestly, I don't read a lot of good things about them in this price tag. Bear in mind that I'm not based on US, so prices here are expensive (because import duties).  This camera, for example, costs u$d 1000 here. And that's what I can afford.\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/eh9hio/advice_on_panasonic_g85/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "advice on panasonic g85 /!/ hi there!\n\ni work in digital marketing for several small businesses here in my city. i'm looking to buy a good camera for video, as video content is always needed, and we tend to outsource it and it's a pain for me, both to work correctly and also because of the extra-cost my clients have. i have minimal experience with cameras, but very willing to learn. as most of it are small videos of just people talking to a camera, i think any camera might do the trick. but, i also do have a podcast and give lectures in my town, so i need a camera that can record longer than 30 minutes to record those. and since my budget is limited, i can only afford one good camera and that's all. \n\nso, after researching a lot, i came to the conclusion that the g85 is what i'm looking for. but i want confirmation from you guys, as i don't want to buy something it might not be what i need.\n\n in summary, this is what i need:\n\n* professional video quality for business production.\n* must record more than 30 mins. i need at least one hour of straight recording (just press record and do my thing), and optimally, two hours. no internal limit, no overheating.\n* can connect a mic jack onto it.\n* a plus: good on low-light situations.\n* also, i've heard that the autofocus is a thing in these cameras, is really that bad for what i need?\n\nany help would be gladly appreciated! i've been thinking if a good camcorder would also do the trick, but honestly, i don't read a lot of good things about them in this price -----> tag !!! . bear in mind that i'm not based on us, so prices here are expensive (because import duties).  this camera, for example, costs u$d 1000 here. and that's what i can afford.\n\nthanks!", "sortedWord": "None", "identifyer": 77534, "year": "2019"}, {"Unnamed: 0": 185198, "autor": "cryospam", "date": 1550520251000, "content": "Looking for a weatherproof travel camera. /!/ Hello!!\n\nI am traveling to Bali in March, and am looking for a weathertight camera similar to the Olympus Tough TG-5, but wanted to make sure that it's the best option for something in this format. I loved the Nikon 1 design, but this isn't in production any more, and appears to be an abandoned product line so I'm hesitant to buy a new one now. \n\nThings I would like:\n\n1. Ability to capture in RAW format\n2. Fully weather tight so if it gets dunked into a stream while I'm hiking I'm not out a camera.\n3. The best optical zoom I can get for this. I have a Nikon AF-S DX NIKKOR 18-300mm for my DSLR, but I wasn't planning to bring that this trip due to concern over breaking it.\n4. Has a GPS to tag picture locations.\n5. Under ~1000 dollars.\nThanks!!\n\nCryo", "link": "https://www.reddit.com/r/Cameras/comments/as1diu/looking_for_a_weatherproof_travel_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for a weatherproof travel camera. /!/ hello!!\n\ni am traveling to bali in march, and am looking for a weathertight camera similar to the olympus tough tg-5, but wanted to make sure that it's the best option for something in this format. i loved the nikon 1 design, but this isn't in production any more, and appears to be an abandoned product line so i'm hesitant to buy a new one now. \n\nthings i would like:\n\n1. ability to capture in raw format\n2. fully weather tight so if it gets dunked into a stream while i'm hiking i'm not out a camera.\n3. the best optical zoom i can get for this. i have a nikon af-s dx nikkor 18-300mm for my dslr, but i wasn't planning to bring that this trip due to concern over breaking it.\n4. has a gps to -----> tag !!!  picture locations.\n5. under ~1000 dollars.\nthanks!!\n\ncryo", "sortedWord": "None", "identifyer": 77777, "year": "2019"}, {"Unnamed: 0": 185861, "autor": "hipsterstalker", "date": 1560022581000, "content": "I picked up this Minolta 7000 Maxxum at a tag sale today for absolutely nothing. Should be fun to play with!", "link": "https://www.reddit.com/r/Cameras/comments/bybo5d/i_picked_up_this_minolta_7000_maxxum_at_a_tag/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i picked up this minolta 7000 maxxum at a -----> tag !!!  sale today for absolutely nothing. should be fun to play with!", "sortedWord": "None", "identifyer": 78456, "year": "2019"}, {"Unnamed: 0": 186170, "autor": "SableDragonRook", "date": 1564424079000, "content": "Best Remote Camera for Watching Pets? /!/ Hey all! This might not be the right place to ask this, but I'm a streamer whose audience enjoys having my exotic pets on stream, so I've taken to using security cameras and the like to keep an eye on them and show them while I play. I was using just a cheap \"VINSION HD 1080p Pet Camera,\" but it has stopped working after only a few months. Even though it was cheap, I LOVED it. Nearly 360 views because I could swivel it remotely to follow my pets as they moved, and I could zoom. That's all I needed.\n\nDo you have any recommendations for what I might be able to replace it with? Options seem to either be \"my house is going to be invaded\"-level security cameras (and the related price tag) or \"I dug this out of a dumpster in China and am reselling it for $10\" (and the related longevity) and I'm wondering if I'm missing a reasonable middle option.", "link": "https://www.reddit.com/r/Cameras/comments/cjf21v/best_remote_camera_for_watching_pets/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best remote camera for watching pets? /!/ hey all! this might not be the right place to ask this, but i'm a streamer whose audience enjoys having my exotic pets on stream, so i've taken to using security cameras and the like to keep an eye on them and show them while i play. i was using just a cheap \"vinsion hd 1080p pet camera,\" but it has stopped working after only a few months. even though it was cheap, i loved it. nearly 360 views because i could swivel it remotely to follow my pets as they moved, and i could zoom. that's all i needed.\n\ndo you have any recommendations for what i might be able to replace it with? options seem to either be \"my house is going to be invaded\"-level security cameras (and the related price -----> tag !!! ) or \"i dug this out of a dumpster in china and am reselling it for $10\" (and the related longevity) and i'm wondering if i'm missing a reasonable middle option.", "sortedWord": "None", "identifyer": 78770, "year": "2019"}, {"Unnamed: 0": 188713, "autor": "omegasoft7", "date": 1569840724000, "content": "Is there any way to Tag people in photos right after taking them? /!/ Imagine that you are in an event as a photographer and wants to tag people that you are taking photos from to be able to send them their photos after the event.\nHow do you do it? Do you have any solution for this?", "link": "https://www.reddit.com/r/Cameras/comments/db9rq8/is_there_any_way_to_tag_people_in_photos_right/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there any way to -----> tag !!!  people in photos right after taking them? /!/ imagine that you are in an event as a photographer and wants to tag people that you are taking photos from to be able to send them their photos after the event.\nhow do you do it? do you have any solution for this?", "sortedWord": "None", "identifyer": 81394, "year": "2019"}, {"Unnamed: 0": 188919, "autor": "liamajitenshi", "date": 1574772530000, "content": "Sub $200 camera? Good for gigs/concerts and something that can do video and clip too. Or is a phone with decent camera will do? /!/ If I rate myself in the knowledge of photography from 1-100 I am for sure just around 10~ish but I've been in always in local gigs/concert here in my country. My phone sucks too and since I'm not a phone person as I am a PC person(pcmasterrace!) so I don't have knowledge on what good camera phone is and what are the good cameras are.\n\nBut I really wanna take some decent shots especially on gigs/concerts of my favourite local indie artists/bands and most importantly clip a minute or two video of my favourite parts of their songs.\n\nI am actually lurking and asking some recommendations on r/PickAnAndroidForMe and prioritizing the camera quality, they've been of good help and I am already eyeing on one they recommended. \n\nBut then, I remember on gigs seeing some guys having amazing cameras(yes for me they're all amazing despite me not knowing their specs or whatsoever but they look so damn cool) and generating good shots. I saw them posting it on social medias tagging the artists and man... damn those shots are amazing!! So it makes me kinda jelly and somehow want to pull those amazing shots too(no amazing as them but at least more decent that my blurry shots on phone)\n\nSo I've also read the r/photography FAQ and it seems getting a camera seems to be and expensive hobby if I maximized its performance but I think I'm not into that. Just want a \"decent to good\" shots on gigs/concerts.\n\nSo... are good camera phones enough or should I use a dedicated camera? I really don't want to spend much, I am actually eyeing on the sub $200 phone they suggested on r/PickAnAndroidForMe but I'm pretty sure camera do be hugely BETTER. \n\nSorry for the long text, just want some recommendations. My country is Philippines if that may help.", "link": "https://www.reddit.com/r/Cameras/comments/e1xi9d/sub_200_camera_good_for_gigsconcerts_and/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "sub $200 camera? good for gigs/concerts and something that can do video and clip too. or is a phone with decent camera will do? /!/ if i rate myself in the knowledge of photography from 1-100 i am for sure just around 10~ish but i've been in always in local gigs/concert here in my country. my phone sucks too and since i'm not a phone person as i am a pc person(pcmasterrace!) so i don't have knowledge on what good camera phone is and what are the good cameras are.\n\nbut i really wanna take some decent shots especially on gigs/concerts of my favourite local indie artists/bands and most importantly clip a minute or two video of my favourite parts of their songs.\n\ni am actually lurking and asking some recommendations on r/pickanandroidforme and prioritizing the camera quality, they've been of good help and i am already eyeing on one they recommended. \n\nbut then, i remember on gigs seeing some guys having amazing cameras(yes for me they're all amazing despite me not knowing their specs or whatsoever but they look so damn cool) and generating good shots. i saw them posting it on social medias -----> tagging !!!  the artists and man... damn those shots are amazing!! so it makes me kinda jelly and somehow want to pull those amazing shots too(no amazing as them but at least more decent that my blurry shots on phone)\n\nso i've also read the r/photography faq and it seems getting a camera seems to be and expensive hobby if i maximized its performance but i think i'm not into that. just want a \"decent to good\" shots on gigs/concerts.\n\nso... are good camera phones enough or should i use a dedicated camera? i really don't want to spend much, i am actually eyeing on the sub $200 phone they suggested on r/pickanandroidforme but i'm pretty sure camera do be hugely better. \n\nsorry for the long text, just want some recommendations. my country is philippines if that may help.", "sortedWord": "None", "identifyer": 81607, "year": "2019"}, {"Unnamed: 0": 189340, "autor": "Travistyse", "date": 1549660571000, "content": "Portable Camera To Replace Galaxy S9+ ? /!/ I'm not a photographer per se but I take photos of indoor and outdoor scenes that I find pleasant enough that I might one day want to recreate the atmosphere in a game, still image creation, or animation. I also take pictures and videos of loved ones (mainly my cat if we're being honest) and for references (3D models, textures, atmosphere for post processing effects / inspiration, and so on).\n\n&amp;#x200B;\n\nFor this reason I find that I might keep having to buy a high end phone. And don't get me wrong - I'm a tech nerd and I love having this device but I've gotten by with a cheap Moto G series phone for the entirety of my life up until this point. The difference in price is stark and I can't help but feel like I might be able to get a better camera and a more reasonable phone and wind up saving money in the long run if I could just be certain that I'll always have the camera when I need it.\n\n&amp;#x200B;\n\nThis doesn't mean that I need it to be pocket sized but I'd want to to be able to fit comfortably in a backpack and either connect to my phone or have a viewfinder of some sorts. I also REALLY appreciate being able to snap some sane looking photos without having to get into the nitty gritty advanced details for each shot.\n\n&amp;#x200B;\n\nMy search hasn't gone so well thus far. My current phone - because of its processor and the fact that Samsung know that the camera is a key selling point - can take BEAUTIFUL slow motion (240FPS iirc) videos, HDR, fantastic colors, much better than 720P photos and videos, the built in mic is fantastic, and best of all it's ALWAYS on me. It even automatically syncs to the Google Photos \"cloud\" so that even if I lose or break the device (I have insurance) / SD card inside of it I only lose the high quality photos not backed up to my computer. I still have REALLY nice looking compressed photos stored online - I'd lose at most a day's worth of photos. They're also WONDERFULLY tagged via the Ai and location and.. you get it.\n\n&amp;#x200B;\n\nIs there a device for me? Or is the right answer just to keep getting a high end phone every other year? Because thus far I just keep finding expensive cameras (like $500) that don't look like they'll give an experience on par with my nearly equal priced phone despite the larger lens. For texture recreation specifically color accuracy and proper detail capture REALLY matters. On my old phones, my cat would be a fairly blurred mess unless lit perfectly. On this one I can pick out every hair on her body even in a poorly lit room. I'm not trying to advertise this phone - I'm just really feeling \"stuck\" with it. Roughly $350 a year ($700 every 2 years) is roughly double what I'd like to be paying for a phone that I only use to take notes, photos, music, and basic web browsing. I'd only really be losing the Samsung Dark Mode and Samsung Pay (a magnetic strip spoofer basically). But for my work (still building my portfolio so nothing high stakes) these photos are important. I take pictures of dirty and broken objects just to have a library of references as to how things tend to break down, clutter, or \"get dirty\". The camera being as good as it is means that with just a couple of angles I can get a reference so good that I can recreate it near perfectly. \n\n&amp;#x200B;\n\nI'm aware that the convenience of backups will probably be dropped - as will slow motion - and that I'll have to be prepared to take photos - actually bringing my backpack, taking out the camera, and really taking the photo. Not just pulling my phone out excitedly on the bus when I realize a car backed into a building and this is a rare opportunity to capture an actually demolished building - albeit my backpack and camera would be there as well. I hope that I've provided enough information and that I'm not just 1 of 10,000 other people who've asked the same thing D:", "link": "https://www.reddit.com/r/Cameras/comments/aol7dw/portable_camera_to_replace_galaxy_s9/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "portable camera to replace galaxy s9+ ? /!/ i'm not a photographer per se but i take photos of indoor and outdoor scenes that i find pleasant enough that i might one day want to recreate the atmosphere in a game, still image creation, or animation. i also take pictures and videos of loved ones (mainly my cat if we're being honest) and for references (3d models, textures, atmosphere for post processing effects / inspiration, and so on).\n\n&amp;#x200b;\n\nfor this reason i find that i might keep having to buy a high end phone. and don't get me wrong - i'm a tech nerd and i love having this device but i've gotten by with a cheap moto g series phone for the entirety of my life up until this point. the difference in price is stark and i can't help but feel like i might be able to get a better camera and a more reasonable phone and wind up saving money in the long run if i could just be certain that i'll always have the camera when i need it.\n\n&amp;#x200b;\n\nthis doesn't mean that i need it to be pocket sized but i'd want to to be able to fit comfortably in a backpack and either connect to my phone or have a viewfinder of some sorts. i also really appreciate being able to snap some sane looking photos without having to get into the nitty gritty advanced details for each shot.\n\n&amp;#x200b;\n\nmy search hasn't gone so well thus far. my current phone - because of its processor and the fact that samsung know that the camera is a key selling point - can take beautiful slow motion (240fps iirc) videos, hdr, fantastic colors, much better than 720p photos and videos, the built in mic is fantastic, and best of all it's always on me. it even automatically syncs to the google photos \"cloud\" so that even if i lose or break the device (i have insurance) / sd card inside of it i only lose the high quality photos not backed up to my computer. i still have really nice looking compressed photos stored online - i'd lose at most a day's worth of photos. they're also wonderfully -----> tagged !!!  via the ai and location and.. you get it.\n\n&amp;#x200b;\n\nis there a device for me? or is the right answer just to keep getting a high end phone every other year? because thus far i just keep finding expensive cameras (like $500) that don't look like they'll give an experience on par with my nearly equal priced phone despite the larger lens. for texture recreation specifically color accuracy and proper detail capture really matters. on my old phones, my cat would be a fairly blurred mess unless lit perfectly. on this one i can pick out every hair on her body even in a poorly lit room. i'm not trying to advertise this phone - i'm just really feeling \"stuck\" with it. roughly $350 a year ($700 every 2 years) is roughly double what i'd like to be paying for a phone that i only use to take notes, photos, music, and basic web browsing. i'd only really be losing the samsung dark mode and samsung pay (a magnetic strip spoofer basically). but for my work (still building my portfolio so nothing high stakes) these photos are important. i take pictures of dirty and broken objects just to have a library of references as to how things tend to break down, clutter, or \"get dirty\". the camera being as good as it is means that with just a couple of angles i can get a reference so good that i can recreate it near perfectly. \n\n&amp;#x200b;\n\ni'm aware that the convenience of backups will probably be dropped - as will slow motion - and that i'll have to be prepared to take photos - actually bringing my backpack, taking out the camera, and really taking the photo. not just pulling my phone out excitedly on the bus when i realize a car backed into a building and this is a rare opportunity to capture an actually demolished building - albeit my backpack and camera would be there as well. i hope that i've provided enough information and that i'm not just 1 of 10,000 other people who've asked the same thing d:", "sortedWord": "None", "identifyer": 82046, "year": "2019"}, {"Unnamed: 0": 189613, "autor": "JfluxLy", "date": 1560183119000, "content": "Sigma lens vs Canon lens /!/ long time canon shooter, always loved my native L lens.\n\n&amp;#x200B;\n\nhowever ive always been curious about sigma and the ART series, why are the lens so much cheaper , 3rd party i know, but what am i sacrificing if i bought into them? \n\n&amp;#x200B;\n\nis it just the name? for example im looking to add a 35mm 1.4 ii L, but instead of the 1500 price tag, the sigma 35mm 1.4 i can find used for around $600\n\n&amp;#x200B;\n\nif i go with the sigma instead of the canon, whats the difference besides the price? is the canon IQ much better? build much better? what makes up that price point difference, im also because im also looking into a few other sigma lens too due to price\n\n&amp;#x200B;\n\nthanks!", "link": "https://www.reddit.com/r/Cameras/comments/byzpx2/sigma_lens_vs_canon_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sigma lens vs canon lens /!/ long time canon shooter, always loved my native l lens.\n\n&amp;#x200b;\n\nhowever ive always been curious about sigma and the art series, why are the lens so much cheaper , 3rd party i know, but what am i sacrificing if i bought into them? \n\n&amp;#x200b;\n\nis it just the name? for example im looking to add a 35mm 1.4 ii l, but instead of the 1500 price -----> tag !!! , the sigma 35mm 1.4 i can find used for around $600\n\n&amp;#x200b;\n\nif i go with the sigma instead of the canon, whats the difference besides the price? is the canon iq much better? build much better? what makes up that price point difference, im also because im also looking into a few other sigma lens too due to price\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 82324, "year": "2019"}], "name": "tagCameras2019"}