{"interestingcomments": [{"Unnamed: 0": 176734, "autor": "Anillem", "date": 1533146614000, "content": "I Haven't Purchased a New Camera in Almost 10 Years. What Should I get? /!/ tl;dr: I haven't had a new camera in almost 10 years, suggest me new ones (preferably point-and-shoot) less than $700 that would be good for nature photography, everyday situations, and travel.\n\nHello, all! First of all, I want to say thank you in advance to anyone who decides to help me in my quest to find a new camera. Any and all advice is appreciated!  \n\n\nAlso, this might be a long post, so bear with me. There is a tl;dr at the top, but I hope you read the full post anyway.   \n\n\nSo, like the title says, I haven't gotten a new camera in almost 10 years. I have a Nikon D60 that I got my sophomore year of high school and I have a Nikon S8200 point-and-shoot that I got in 2011, maybe? Anyway, they have always worked really well for me and I love them dearly, but I really need an upgrade. 10 years is a long time and there have been so many advances that I just want to try something new, even if there is nothing necessarily wrong with my current cameras. I am on a budget, though, so I'm really only looking to upgrade my point-and-shoot for now and the DSLR a little later down the line. I use my current cameras primarily for nature shots (so I need a good zoom and depth of field), everyday situations, travel, and daily outfit/blog post photos.  \n\n\nHere is what I am looking for:\n\n* something compact, preferably a point-and-shoot (I will upgrade my DLSR down the line)\n* a flip-out display (I take a lot of OOTD and blog photos)\n* built in Wi-Fi, NSF, bluetooth (GPS tags cool, but not necessary)\n* great zoom capability\n* takes quality photos in low-light situations\n* image stabalization\n* tripod mount (do they make cameras that *don't* have these anymore?)\n* high quality, high resolution images\n* macro mode (other built in effects a plus)\n* burst mode, panorama mode\n* manual and auto controls\n* viewfinder preferred (not totally necessary)\n* full HD video (4K not necessary)\n* any brand (I am partial to Nikon since it's all I've ever had, but I can branch out)\n\nI am willing to spend up to $700 on a new camera, if that helps narrow down suggestions. I have been doing some research, but there are so many options and it gets overwhelming! I haven't narrowed it down to anything yet, but some cameras that keep popping up are the Canon PowerShot G7 X Mark II (although, most of the reviews I've seen of it are from vloggers, not photographers), the Richor GR II (although the lower megapixels make me wary), and the Nikon CoolPix A900 (but it doesn't seem to have that great of reviews on Amazon).   \n\n\nAnyway, my thoughts are all over the place, so I came here seeking outside advice. Do you know of any cameras in that price range that fit my requirements? What cameras do you use? Any suggestions would be helpful (even if you say I'm being too picky or crazy because it's hard to find a camera in that price range with all those elements (because I know it is)). Thank you all in advance!! I really appreciate it!", "link": "https://www.reddit.com/r/Cameras/comments/93rdez/i_havent_purchased_a_new_camera_in_almost_10/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i haven't purchased a new camera in almost 10 years. what should i get? /!/ tl;dr: i haven't had a new camera in almost 10 years, suggest me new ones (preferably point-and-shoot) less than $700 that would be good for nature photography, everyday situations, and travel.\n\nhello, all! first of all, i want to say thank you in advance to anyone who decides to help me in my quest to find a new camera. any and all advice is appreciated!  \n\n\nalso, this might be a long post, so bear with me. there is a tl;dr at the top, but i hope you read the full post anyway.   \n\n\nso, like the title says, i haven't gotten a new camera in almost 10 years. i have a nikon d60 that i got my sophomore year of high school and i have a nikon s8200 point-and-shoot that i got in 2011, maybe? anyway, they have always worked really well for me and i love them dearly, but i really need an upgrade. 10 years is a long time and there have been so many advances that i just want to try something new, even if there is nothing necessarily wrong with my current cameras. i am on a budget, though, so i'm really only looking to upgrade my point-and-shoot for now and the dslr a little later down the line. i use my current cameras primarily for nature shots (so i need a good zoom and depth of field), everyday situations, travel, and daily outfit/blog post photos.  \n\n\nhere is what i am looking for:\n\n* something compact, preferably a point-and-shoot (i will upgrade my dlsr down the line)\n* a flip-out display (i take a lot of ootd and blog photos)\n* built in wi-fi, nsf, bluetooth (gps -----> tags !!!  cool, but not necessary)\n* great zoom capability\n* takes quality photos in low-light situations\n* image stabalization\n* tripod mount (do they make cameras that *don't* have these anymore?)\n* high quality, high resolution images\n* macro mode (other built in effects a plus)\n* burst mode, panorama mode\n* manual and auto controls\n* viewfinder preferred (not totally necessary)\n* full hd video (4k not necessary)\n* any brand (i am partial to nikon since it's all i've ever had, but i can branch out)\n\ni am willing to spend up to $700 on a new camera, if that helps narrow down suggestions. i have been doing some research, but there are so many options and it gets overwhelming! i haven't narrowed it down to anything yet, but some cameras that keep popping up are the canon powershot g7 x mark ii (although, most of the reviews i've seen of it are from vloggers, not photographers), the richor gr ii (although the lower megapixels make me wary), and the nikon coolpix a900 (but it doesn't seem to have that great of reviews on amazon).   \n\n\nanyway, my thoughts are all over the place, so i came here seeking outside advice. do you know of any cameras in that price range that fit my requirements? what cameras do you use? any suggestions would be helpful (even if you say i'm being too picky or crazy because it's hard to find a camera in that price range with all those elements (because i know it is)). thank you all in advance!! i really appreciate it!", "sortedWord": "None", "identifyer": 69149, "year": "2018"}, {"Unnamed: 0": 177582, "autor": "TheBeardedDen", "date": 1515656764000, "content": "Under $400 (used) mirrorless camera suggestions? /!/ Hi, I am actually not new to photography but am new to cheaper cameras. I think my cheapest is a Samsung NX1 currently. Haven't had a cheaper camera in 10 years now.\n\nI honestly did a good bit of research and think a Sony a6000 is the best choice, but I want some input form other camera people first on my two uses.\n\nFirst off I need something that is mirrorless (I actually want it to be mirrorless as I only own 2 out of my 11 cameras) but is also easier to use and feels more full featured and expandable (removable lens for example). So when I go on trips and have a tag along with no camera they can still feel like what they are shooting on is nice. I had an accident with a Hasselblad and refuse to let anyone touch my expensive stuff.\n\n\nSecond, I need clean hdmi out (no menus on hdmi output). As well as 1920x1080 60p output from the hdmi that I can use a laptop capture card with, to turn the camera into a super overpriced webcam of sorts. 4-6 times a year I do events like museum categorizing, portraits for workforce, and documenting. We currently use a Logitech Brio 2160p webcam, but the alternating framerate and inline software suck as well as overall quality even in outstanding lighting. Side note, The camera could potentially be doing this hdmi out to a capture card for 6-8 hours for days or weeks in a row, and in some cases 12+ hours for days in a row. Could this be bad for a mirrorless camera, like burn in on sensor and such? \n\n\nI have considered something like a Sony CX405 Handycam for my second task, but their quality seems lacking, and then I am buying two products for two tasks, when I really want to do one product for two tasks.\n\nI really think the a6000 is the best choice used. But that second task keeps me from pulling the trigger.\n\nThanks for all the replies ahead of time. I appreciate all of your input and knowledge.", "link": "https://www.reddit.com/r/Cameras/comments/7pmko2/under_400_used_mirrorless_camera_suggestions/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "under $400 (used) mirrorless camera suggestions? /!/ hi, i am actually not new to photography but am new to cheaper cameras. i think my cheapest is a samsung nx1 currently. haven't had a cheaper camera in 10 years now.\n\ni honestly did a good bit of research and think a sony a6000 is the best choice, but i want some input form other camera people first on my two uses.\n\nfirst off i need something that is mirrorless (i actually want it to be mirrorless as i only own 2 out of my 11 cameras) but is also easier to use and feels more full featured and expandable (removable lens for example). so when i go on trips and have a -----> tag !!!  along with no camera they can still feel like what they are shooting on is nice. i had an accident with a hasselblad and refuse to let anyone touch my expensive stuff.\n\n\nsecond, i need clean hdmi out (no menus on hdmi output). as well as 1920x1080 60p output from the hdmi that i can use a laptop capture card with, to turn the camera into a super overpriced webcam of sorts. 4-6 times a year i do events like museum categorizing, portraits for workforce, and documenting. we currently use a logitech brio 2160p webcam, but the alternating framerate and inline software suck as well as overall quality even in outstanding lighting. side note, the camera could potentially be doing this hdmi out to a capture card for 6-8 hours for days or weeks in a row, and in some cases 12+ hours for days in a row. could this be bad for a mirrorless camera, like burn in on sensor and such? \n\n\ni have considered something like a sony cx405 handycam for my second task, but their quality seems lacking, and then i am buying two products for two tasks, when i really want to do one product for two tasks.\n\ni really think the a6000 is the best choice used. but that second task keeps me from pulling the trigger.\n\nthanks for all the replies ahead of time. i appreciate all of your input and knowledge.", "sortedWord": "None", "identifyer": 70010, "year": "2018"}, {"Unnamed: 0": 178102, "autor": "veggie_tacos4life", "date": 1529434105000, "content": "Best 35mm Point and Shoot/Are Contax worth it? /!/ Hey y'all,\n\nI'm currently looking to buy a 35mm point and shoot camera after my Minolta Freedom Zoom 70 EX crapped out on me. I've always wanted a Contax or something with a similar build (titanium, glass lens) but they are so pricey that I could never justify buying one. \n\nAre they worth the hefty price tag? I want something that will last for years and won't die on me like cheaper point and shoots I've had in the past. I've been looking into Minolta Hi-Matic 2 (rangefinder I know, but they are rather compact) and Konica Big Mini but I would love to have something that was made in more recent years that would hopefully last longer.\n\nI also looked into the Lomo LC-A+ and LC Wide which were enticing simply because I could purchase them brand new with a warranty. These two seem super gimmicky though. Any thoughts?\n\nThanks! &lt;3", "link": "https://www.reddit.com/r/Cameras/comments/8sbdkw/best_35mm_point_and_shootare_contax_worth_it/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best 35mm point and shoot/are contax worth it? /!/ hey y'all,\n\ni'm currently looking to buy a 35mm point and shoot camera after my minolta freedom zoom 70 ex crapped out on me. i've always wanted a contax or something with a similar build (titanium, glass lens) but they are so pricey that i could never justify buying one. \n\nare they worth the hefty price -----> tag !!! ? i want something that will last for years and won't die on me like cheaper point and shoots i've had in the past. i've been looking into minolta hi-matic 2 (rangefinder i know, but they are rather compact) and konica big mini but i would love to have something that was made in more recent years that would hopefully last longer.\n\ni also looked into the lomo lc-a+ and lc wide which were enticing simply because i could purchase them brand new with a warranty. these two seem super gimmicky though. any thoughts?\n\nthanks! &lt;3", "sortedWord": "None", "identifyer": 70538, "year": "2018"}, {"Unnamed: 0": 178716, "autor": "EliHershey", "date": 1542042741000, "content": "How cheap can a really good quality camera get? /!/ I'm verrrryyyy new to cameras, I just thought I should preface that before continuing;\nI'm looking for a camera that records amazing shots in low light, retaining crisp, beautiful quality (4k isn't really necessary for me but i wouldn't turn it down)\nI was looking at the sony a7sii but that price tag makes my pockets cry.\nAre there any cheaper cameras which perform like the a7sii or is that camera virtually unmatchable? \nI understand the price matches the quality but I genuinely don't think it'd make sense for me to make that purchase unless I was an enthusiast or had a job as a photographer/videographer.", "link": "https://www.reddit.com/r/Cameras/comments/9wfunq/how_cheap_can_a_really_good_quality_camera_get/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how cheap can a really good quality camera get? /!/ i'm verrrryyyy new to cameras, i just thought i should preface that before continuing;\ni'm looking for a camera that records amazing shots in low light, retaining crisp, beautiful quality (4k isn't really necessary for me but i wouldn't turn it down)\ni was looking at the sony a7sii but that price -----> tag !!!  makes my pockets cry.\nare there any cheaper cameras which perform like the a7sii or is that camera virtually unmatchable? \ni understand the price matches the quality but i genuinely don't think it'd make sense for me to make that purchase unless i was an enthusiast or had a job as a photographer/videographer.", "sortedWord": "None", "identifyer": 71161, "year": "2018"}, {"Unnamed: 0": 178785, "autor": "Subject-v-2", "date": 1543767722000, "content": "Christmas present help /!/ Hey all! I’m looking to get my fiancé a film camera for Christmas as she’s wanted one for a while now. I’ve done some base research and I think I want to get her a Canon AE-1 as it comes highly recommended, has a good price tag and I hear is great for beginners. Do you believe this is a good choice? Also what is the difference between AE-1 and AE-1 Program? ", "link": "https://www.reddit.com/r/Cameras/comments/a2eir1/christmas_present_help/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "christmas present help /!/ hey all! i’m looking to get my fiancé a film camera for christmas as she’s wanted one for a while now. i’ve done some base research and i think i want to get her a canon ae-1 as it comes highly recommended, has a good price -----> tag !!!  and i hear is great for beginners. do you believe this is a good choice? also what is the difference between ae-1 and ae-1 program? ", "sortedWord": "None", "identifyer": 71232, "year": "2018"}, {"Unnamed: 0": 179971, "autor": "suicaf", "date": 1529005256000, "content": "I am trying to find the manual for this tag reader camera at my work /!/ I'm not sure if this is the right place but here it is.\n\nI am working for the security team and we do not have any of the packaging for this camera. The issue we have been having is that we used to get a better clear image of the tags, but randomly everything stopped. The camera has zoom and focusing options but neither are getting the same picture we used to. It's not very old either which is the concern. It also was not cheap. Our last place to turn is the manual, but I am unable to find it anywhere online. I can barely find the camera online itself. Please help. Thank you.\n\nCamera: [http://imgur.com/gallery/o79qh7x](http://imgur.com/gallery/o79qh7x)\n\nLabel: [http://imgur.com/gallery/iiiYwmL](http://imgur.com/gallery/iiiYwmL)\n\nThe label reads from top to bottom: CMC TECH CHITA25 12VDC CMC TECH *CHITA\\-25* *CHITA254122*", "link": "https://www.reddit.com/r/Cameras/comments/8r4q1i/i_am_trying_to_find_the_manual_for_this_tag/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i am trying to find the manual for this -----> tag !!!  reader camera at my work /!/ i'm not sure if this is the right place but here it is.\n\ni am working for the security team and we do not have any of the packaging for this camera. the issue we have been having is that we used to get a better clear image of the tags, but randomly everything stopped. the camera has zoom and focusing options but neither are getting the same picture we used to. it's not very old either which is the concern. it also was not cheap. our last place to turn is the manual, but i am unable to find it anywhere online. i can barely find the camera online itself. please help. thank you.\n\ncamera: [http://imgur.com/gallery/o79qh7x](http://imgur.com/gallery/o79qh7x)\n\nlabel: [http://imgur.com/gallery/iiiywml](http://imgur.com/gallery/iiiywml)\n\nthe label reads from top to bottom: cmc tech chita25 12vdc cmc tech *chita\\-25* *chita254122*", "sortedWord": "None", "identifyer": 72439, "year": "2018"}, {"Unnamed: 0": 180096, "autor": "suburbanmale", "date": 1530826915000, "content": "What Beta camera was used for this video? /!/ Hey everyone,\n\nI'm currently wondering what sony betcam sp was used to shoot the most recent palace skateboard video. I'd love to get it and just wondering the price tag. The camera is shown spinning at 1:14, 3:38, 5:16, 6:27, and many other occasions throughout the video. Hopefully it gives enough info and someone will know!\n\nhttps://www.youtube.com/watch?v=IsRtVxTLKww", "link": "https://www.reddit.com/r/Cameras/comments/8weevt/what_beta_camera_was_used_for_this_video/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what beta camera was used for this video? /!/ hey everyone,\n\ni'm currently wondering what sony betcam sp was used to shoot the most recent palace skateboard video. i'd love to get it and just wondering the price -----> tag !!! . the camera is shown spinning at 1:14, 3:38, 5:16, 6:27, and many other occasions throughout the video. hopefully it gives enough info and someone will know!\n\nhttps://www.youtube.com/watch?v=isrtvxtlkww", "sortedWord": "None", "identifyer": 72566, "year": "2018"}], "name": "tagCameras2018"}