{"interestingcomments": [{"Unnamed: 0": 208757, "autor": "PuzzleQuail", "date": 1593133300000, "content": "Cheap, small compact with strong optical zoom? (upgrade from Pentax Optio Z10) /!/ Hi there!\n\nI've had a couple Pentax Optio Z10 compact cameras that I really only need for getting clear pictures of things like lizards and frogs - things that are small but won't let you get too close. This model, needless to say, is getting pretty old, and my second one is starting to fail. Can anyone recommend some intermediate model that would be cheap on eBay (used is okay) but a bit of an upgrade from the Optio Z10?  The key must-haves:\n\n1. Small size, so I can fit it in a pocket\n2. Powerful optical zoom. The Z10 has 7x, though I could go a bit lower if other features are really worthwhile.\n3. Ability to focus at short distances even when zoomed in (the Z10 can focus down to about 30cm while zoomed to 7x)\n4. Flash\n5. Easy to adjust EV and ISO\n6. Decent battery life\n\nI also really appreciate the Z10's manual focus feature, for when the lighting is too low for autofocus. Dream features would be GPS tagging and ability to go underwater, but I don't expect to be able to get those for cheap.\n\nThanks in advance for any ideas!", "link": "https://www.reddit.com/r/Cameras/comments/hfy2b4/cheap_small_compact_with_strong_optical_zoom/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "cheap, small compact with strong optical zoom? (upgrade from pentax optio z10) /!/ hi there!\n\ni've had a couple pentax optio z10 compact cameras that i really only need for getting clear pictures of things like lizards and frogs - things that are small but won't let you get too close. this model, needless to say, is getting pretty old, and my second one is starting to fail. can anyone recommend some intermediate model that would be cheap on ebay (used is okay) but a bit of an upgrade from the optio z10?  the key must-haves:\n\n1. small size, so i can fit it in a pocket\n2. powerful optical zoom. the z10 has 7x, though i could go a bit lower if other features are really worthwhile.\n3. ability to focus at short distances even when zoomed in (the z10 can focus down to about 30cm while zoomed to 7x)\n4. flash\n5. easy to adjust ev and iso\n6. decent battery life\n\ni also really appreciate the z10's manual focus feature, for when the lighting is too low for autofocus. dream features would be gps -----> tagging !!!  and ability to go underwater, but i don't expect to be able to get those for cheap.\n\nthanks in advance for any ideas!", "sortedWord": "None", "identifyer": 2400, "year": "2020"}], "name": "taggingCameras2020"}