{"interestingcomments": [{"autor": "theflyingkiwi00", "date": "2018-08-04 10:19:52", "content": "First Analog film camera /!/ I just bought a Samoca MR for $25 of the net, it looked cool in the photos and the purchase was entirely impulse driven. Iv tried to do a Google search on the camera but it only comes up with very limited info. All I know is it was made in 1961 in Japan. Do you guys have any clue what happened to the company or what the cameras are like?", "link": "https://www.reddit.com/r/Cameras/comments/94i5w6/first_analog_film_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "first analog film camera /!/ i just bought a samoca mr for $25 of the net, it looked cool in the photos and the purchase was entirely impulse driven. iv tried to do a google search on the camera but it only -----> comes !!!  -----> up !!!  -----> with !!!  very limited info. all i know is it was made in 1961 in japan. do you guys have any clue what happened to the company or what the cameras are like?", "sortedWord": "None", "Identifyer": null, "identifyer": 69106, "year": "2018"}, {"autor": "ronenvelarde", "date": "2018-01-28 20:57:18", "content": "Camera advice please! /!/ My current setup is a T6s with an 18-135 IS STM lens and am considering something slightly more compact since I have a toddler now and twins on the way and really want to cut down on baggage. I spent an entire day organizing 15 years worth of my pictures and noticed so many holes which really bummed me out. The thought of missing out on my children is killing me so I'm really motivated to do this right.  \n\nI would love to be able to whip out my camera and take a great shot. I need durability because kids and travel. Image quality is extremely important and I'm willing to somewhat sacrifice size for this. I'm estimating I will have about 1k to spend. Before I bought my t6s I had a point and shoot canon elph that I put through absolute hell (jungle, desert, mountains, and oceans) and really took great pictures. \n\nWhat I like about the T6s is; weight, sturdiness, and image quality. \nWhat I don't like about the T6s is; size and complexity (I'm a novice and have ruined plenty of photo opportunities because I take a while with my settings).  \n\nThe potential solutions I have come up with on my own are:\n\n1- Keep my current setup and purchase Canon's travel &amp; portrait kit $350 which will give me better portability and more rounded lens choices. \n\n2- Sell my current setup and purchase a mirrorless such as: \n    Canon M5 with 15-45 lens. Pushes a little past my budget. \n    Sony a6300 with 16-50 lens\n    Fuji x-t20 with 16-50 OIS lens\n\nI'm open to other options and I have no brand affiliation. I purchased the canon travel and portrait lens kit but I can take it back as I haven't opened it yet. The sales guy was trying hard get me to play with the mirrorless but my pregnant wife was mad at me for who knows what so I didn't have time. Anyway, I appreciate any help pointing me in a good direction. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/7tn1m7/camera_advice_please/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "camera advice please! /!/ my current setup is a t6s with an 18-135 is stm lens and am considering something slightly more compact since i have a toddler now and twins on the way and really want to cut down on baggage. i spent an entire day organizing 15 years worth of my pictures and noticed so many holes which really bummed me out. the thought of missing out on my children is killing me so i'm really motivated to do this right.  \n\ni would love to be able to whip out my camera and take a great shot. i need durability because kids and travel. image quality is extremely important and i'm willing to somewhat sacrifice size for this. i'm estimating i will have about 1k to spend. before i bought my t6s i had a point and shoot canon elph that i put through absolute hell (jungle, desert, mountains, and oceans) and really took great pictures. \n\nwhat i like about the t6s is; weight, sturdiness, and image quality. \nwhat i don't like about the t6s is; size and complexity (i'm a novice and have ruined plenty of photo opportunities because i take a while with my settings).  \n\nthe potential solutions i have -----> come !!!  -----> up !!!  -----> with !!!  on my own are:\n\n1- keep my current setup and purchase canon's travel &amp; portrait kit $350 which will give me better portability and more rounded lens choices. \n\n2- sell my current setup and purchase a mirrorless such as: \n    canon m5 with 15-45 lens. pushes a little past my budget. \n    sony a6300 with 16-50 lens\n    fuji x-t20 with 16-50 ois lens\n\ni'm open to other options and i have no brand affiliation. i purchased the canon travel and portrait lens kit but i can take it back as i haven't opened it yet. the sales guy was trying hard get me to play with the mirrorless but my pregnant wife was mad at me for who knows what so i didn't have time. anyway, i appreciate any help pointing me in a good direction. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 70073, "year": "2018"}, {"autor": "vrotographer", "date": "2018-06-20 18:50:40", "content": "I want to buy a camera hand strap /!/ I want a camera strap more suited to travel than a neck strap. A neck strap makes the camera bounce around on my chest too much.\n\nSo I've been researching hand straps for the past hour. I've come up with two - the Peak Design Clutch and the SpiderLight hand strap. The Spiderlight seems to be easier to set up, but what matters to me is which one does its job better. Which one would you guys recommend?", "link": "https://www.reddit.com/r/Cameras/comments/8skw27/i_want_to_buy_a_camera_hand_strap/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i want to buy a camera hand strap /!/ i want a camera strap more suited to travel than a neck strap. a neck strap makes the camera bounce around on my chest too much.\n\nso i've been researching hand straps for the past hour. i've -----> come !!!  -----> up !!!  -----> with !!!  two - the peak design clutch and the spiderlight hand strap. the spiderlight seems to be easier to set up, but what matters to me is which one does its job better. which one would you guys recommend?", "sortedWord": "None", "Identifyer": null, "identifyer": 70523, "year": "2018"}, {"autor": "Pringles__", "date": "2018-08-16 14:08:43", "content": "Should I buy the Sony A7iii (+ kit lens ?) /!/ Hello guys.\n\nSo basically, I like taking a lot of photos and I have been doing this mainly with my phone (A5 2016) but I have lately realized that I wanted to get a camera.\n\nThis camera will be my first one and I'm therefore ready to go high for a good gear. That's how I came up with the A7 iii, affordable in my eyes and I love its specs. I have been reading a lot about cameras lately so I know what I'm buying.\n\nHowever, buying this camera means that I will not be able to spend a lot on a lens since my budget is not that high. That's why I was thinking about using the kit lens at the beginning until I can afford a pro lens later on.\n\nSo what are your opinions about this ? Should I get this camera or are there better specs / better camera-lens duos that will do better for a lower price ?\n\nHave a good day.", "link": "https://www.reddit.com/r/Cameras/comments/97sl5l/should_i_buy_the_sony_a7iii_kit_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "should i buy the sony a7iii (+ kit lens ?) /!/ hello guys.\n\nso basically, i like taking a lot of photos and i have been doing this mainly with my phone (a5 2016) but i have lately realized that i wanted to get a camera.\n\nthis camera will be my first one and i'm therefore ready to go high for a good gear. that's how i -----> came !!!  -----> up !!!  -----> with !!!  the a7 iii, affordable in my eyes and i love its specs. i have been reading a lot about cameras lately so i know what i'm buying.\n\nhowever, buying this camera means that i will not be able to spend a lot on a lens since my budget is not that high. that's why i was thinking about using the kit lens at the beginning until i can afford a pro lens later on.\n\nso what are your opinions about this ? should i get this camera or are there better specs / better camera-lens duos that will do better for a lower price ?\n\nhave a good day.", "sortedWord": "None", "Identifyer": null, "identifyer": 70839, "year": "2018"}, {"autor": "ars4l4n", "date": "2018-03-17 14:20:12", "content": "looking for a dslr that instantly shows camera feed when turned on while plugged into hdmi (instead of eg an error message) /!/ (deleted old thread because I changed my mind and came up with a solution for that other problem)\n\nmy sony a6000 has the issue that it doesn't instantly show live feed when turning it on while it is connected with hdmi and an AC adapter. You have to press a button first to remove the weird \"no images in this view\"-message https://i.imgur.com/iKTAIwZ.png Do you know cams for up to 400€ (body only) that don't have this issue and have a clean hdmi output?\n\n\nbest regards,\n\nars4l4n\n", "link": "https://www.reddit.com/r/Cameras/comments/853zxo/looking_for_a_dslr_that_instantly_shows_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "looking for a dslr that instantly shows camera feed when turned on while plugged into hdmi (instead of eg an error message) /!/ (deleted old thread because i changed my mind and -----> came !!!  -----> up !!!  -----> with !!!  a solution for that other problem)\n\nmy sony a6000 has the issue that it doesn't instantly show live feed when turning it on while it is connected -----> with !!!  hdmi and an ac adapter. you have to press a button first to remove the weird \"no images in this view\"-message https://i.imgur.com/iktaiwz.png do you know cams for up to 400€ (body only) that don't have this issue and have a clean hdmi output?\n\n\nbest regards,\n\nars4l4n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 71796, "year": "2018"}, {"autor": "MEGAT0N", "date": "2018-01-15 06:14:04", "content": "Looking for a video camera that will pre-record 30 seconds before I hit the record button. Does anything like that exist? /!/ I'm looking for a way to point a video camera at my daughter's volleyball game, and then after she does something exciting, I hit record and capture the last 30 seconds or so.\n\nI've tried [Sporfie](https://www.sporfie.com/) for my Android phone, but it doesn't work for me (the files are corrupted).  I've read a lot about Precorder for iPhone, but it hasn't been updated in about 5 years, and I don't have an iDevice.\n\nSo I was wondering if a hardware solution exists.  I know there are millions of parents who want to do the same thing I do, so I'm hoping someone came up with a way to do it.\n\nThanks for any replies.", "link": "https://www.reddit.com/r/Cameras/comments/7qhtf0/looking_for_a_video_camera_that_will_prerecord_30/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "looking for a video camera that will pre-record 30 seconds before i hit the record button. does anything like that exist? /!/ i'm looking for a way to point a video camera at my daughter's volleyball game, and then after she does something exciting, i hit record and capture the last 30 seconds or so.\n\ni've tried [sporfie](https://www.sporfie.com/) for my android phone, but it doesn't work for me (the files are corrupted).  i've read a lot about precorder for iphone, but it hasn't been updated in about 5 years, and i don't have an idevice.\n\nso i was wondering if a hardware solution exists.  i know there are millions of parents who want to do the same thing i do, so i'm hoping someone -----> came !!!  -----> up !!!  -----> with !!!  a way to do it.\n\nthanks for any replies.", "sortedWord": "None", "Identifyer": null, "identifyer": 72399, "year": "2018"}], "name": "withCameras2018"}