{"interestingcomments": [{"autor": "wojtejlo", "date": "2021-07-31 04:48:22", "content": "Advice on my first camera /!/ Hello!\n\nDuring past few months I decided to start learning how to edit video. For now on, I was mostly using my phone (s20 ultra) and drone footage, and managed to create few videos. They are mostly just my travel footage. I didn't realised how creative you can get and how fun this actually is. Now, I want to get deeper into it, spend some time and learn how to film properly. \n\nI want to buy my first camera, which I'm going to use for video. \nI have literally no experience when it comes to it, never used one, and I will have to learn it from the very very basic. I wanted to buy decent stuff that will serve me for a couple of years as I'm convinced that at some point I want to start doing little commercials and promo videos etc. I saw posts advising to buy cheaper stuff and learn from there as its easier but I do like challenges. Doing quite a lot of research online, I came up with them models\n\n\nSony a7iii with kit lenses 28-70mm\nBlackmagic 6k pro\nFujifilm xt4\nPanasonic gh5 and gh5s\nLumix s5\n\nMy budget is around £2000. \nWhich model would suit me best?have you got any other recommendations?\nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/ov10b3/advice_on_my_first_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "advice on my first camera /!/ hello!\n\nduring past few months i decided to start learning how to edit video. for now on, i was mostly using my phone (s20 ultra) and drone footage, and managed to create few videos. they are mostly just my travel footage. i didn't realised how creative you can get and how fun this actually is. now, i want to get deeper into it, spend some time and learn how to film properly. \n\ni want to buy my first camera, which i'm going to use for video. \ni have literally no experience when it comes to it, never used one, and i will have to learn it from the very very basic. i wanted to buy decent stuff that will serve me for a couple of years as i'm convinced that at some point i want to start doing little commercials and promo videos etc. i saw posts advising to buy cheaper stuff and learn from there as its easier but i do like challenges. doing quite a lot of research online, i -----> came !!!  -----> up !!!  -----> with !!!  them models\n\n\nsony a7iii -----> with !!!  kit lenses 28-70mm\nblackmagic 6k pro\nfujifilm xt4\npanasonic gh5 and gh5s\nlumix s5\n\nmy budget is around £2000. \nwhich model would suit me best?have you got any other recommendations?\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 16090, "year": "2021"}, {"autor": "Mixxleplix", "date": "2021-10-28 23:06:55", "content": "GoPro hero 10 vs a current high-end smartphone (Oppo Find X3 Pro) video quality? /!/ The results from my reddit search on this question failed to come up with any recent answers. \n\nWith the rapid improvement in phone cameras and I would assume with action cameras as well, I was curious what how it stands currently.\n\nAssuming one is using a gimbal with both the phone and the GoPro and not being used in a manner in which durability would play a factor, is there a clear cut advantage in video quality one way or another?", "link": "https://www.reddit.com/r/Cameras/comments/qhyyog/gopro_hero_10_vs_a_current_highend_smartphone/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "gopro hero 10 vs a current high-end smartphone (oppo find x3 pro) video quality? /!/ the results from my reddit search on this question failed to -----> come !!!  -----> up !!!  -----> with !!!  any recent answers. \n\nwith the rapid improvement in phone cameras and i would assume with action cameras as well, i was curious what how it stands currently.\n\nassuming one is using a gimbal with both the phone and the gopro and not being used in a manner in which durability would play a factor, is there a clear cut advantage in video quality one way or another?", "sortedWord": "None", "Identifyer": null, "identifyer": 16322, "year": "2021"}, {"autor": "feredinos", "date": "2021-01-26 12:55:08", "content": "Opinions/Recommendations for starter (&lt;600 EUR) filmmaking setup /!/ I've already done some research so I want your opinions on what I've found. That being said, if you have a tried and tested setup with camera and external recorder that comes below (and maybe a bit above) 600 euro then you can write it down in the comments.\n\nOne camera I found is the Nikon D3500 for 359. Problem is that it doesn't seem to have audio recording capabilities. I've also come across the G7 which though a bit more expensive at 625 seems like a good investment and can record audio. Thing is I don't really know the audios quality, and from what I've read audio matters. So if I were to buy it, I would have to wait some time before I bought a recorder. \n\nSo these are the two setups I've come up with. Nikon D3500 with an external recorded which I'll have to synch the audio with the video post production, and G7 where I'll use the in-built audio recorder until I get an external one. Which sounds like the better option? I should also add that I'm not being pressed by time. \n\nThanks in advance for your help!\n\nP.S. Sorry if this post belongs to another subreddit.", "link": "https://www.reddit.com/r/Cameras/comments/l5dfeq/opinionsrecommendations_for_starter_600_eur/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "opinions/recommendations for starter (&lt;600 eur) filmmaking setup /!/ i've already done some research so i want your opinions on what i've found. that being said, if you have a tried and tested setup with camera and external recorder that comes below (and maybe a bit above) 600 euro then you can write it down in the comments.\n\none camera i found is the nikon d3500 for 359. problem is that it doesn't seem to have audio recording capabilities. i've also come across the g7 which though a bit more expensive at 625 seems like a good investment and can record audio. thing is i don't really know the audios quality, and from what i've read audio matters. so if i were to buy it, i would have to wait some time before i bought a recorder. \n\nso these are the two setups i've -----> come !!!  -----> up !!!  -----> with !!! . nikon d3500 with an external recorded which i'll have to synch the audio with the video post production, and g7 where i'll use the in-built audio recorder until i get an external one. which sounds like the better option? i should also add that i'm not being pressed by time. \n\nthanks in advance for your help!\n\np.s. sorry if this post belongs to another subreddit.", "sortedWord": "None", "Identifyer": null, "identifyer": 17058, "year": "2021"}, {"autor": "Ozei1", "date": "2021-07-28 04:05:11", "content": "Question about using 35mm format light meter on a 6x6 medium format TLR /!/ I am aware that as compared to the standard full frame format, 6x6 120mm film has an approx. crop factor of 0.55x, which means f/3.5 on MF is around f/1.9 on full frame sensors. The problem, however, is:\n\n\nSay for example I set my ISO and shutter speed, and let the full frame light meter choose my aperture. if it came up with a reading of f/2.8 needed to properly expose the scene, would I have to set my\n6x6 medium format camera to f/2.8, or would I have to set it at ~f/1.5?\n\nHopefully I can get a bit of help with this. Thanks in advance", "link": "https://www.reddit.com/r/Cameras/comments/ot2ek7/question_about_using_35mm_format_light_meter_on_a/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "question about using 35mm format light meter on a 6x6 medium format tlr /!/ i am aware that as compared to the standard full frame format, 6x6 120mm film has an approx. crop factor of 0.55x, which means f/3.5 on mf is around f/1.9 on full frame sensors. the problem, however, is:\n\n\nsay for example i set my iso and shutter speed, and let the full frame light meter choose my aperture. if it -----> came !!!  -----> up !!!  -----> with !!!  a reading of f/2.8 needed to properly expose the scene, would i have to set my\n6x6 medium format camera to f/2.8, or would i have to set it at ~f/1.5?\n\nhopefully i can get a bit of help with this. thanks in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 17852, "year": "2021"}, {"autor": "Academic-Base1870", "date": "2021-10-26 07:10:19", "content": "Sunrise &amp; Sunset Shots /!/ I have a Fujifilm FinePix S9900W and whenever I search for how to setup sunrise &amp; sunset shots it never comes up with any results specific to my camera model. Does anyone have any tips?", "link": "https://www.reddit.com/r/Cameras/comments/qg0w21/sunrise_sunset_shots/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "sunrise &amp; sunset shots /!/ i have a fujifilm finepix s9900w and whenever i search for how to setup sunrise &amp; sunset shots it never -----> comes !!!  -----> up !!!  -----> with !!!  any results specific to my camera model. does anyone have any tips?", "sortedWord": "None", "Identifyer": null, "identifyer": 18296, "year": "2021"}, {"autor": "KingMigi", "date": "2021-01-18 05:07:58", "content": "Looking for advice on a camera, specific details inside! /!/ Hello friends. I'm sure you get a million of these types of posts, but I need some help.\n\nI'm looking to purchase my mom (54 y/o) a relatively nice camera, as she loves documenting her life experiences. I was hoping to get some suggestions from some experienced users, so I humbly turn to the r/Cameras community.\n\n- I know very little about cameras beyond the basics, and there's just so much information out there to parse through on my own and come up with an informed purchase decision.\n\n- I also don't know anything about lenses, so I definitely need guidance on a good, all-around starter lens.\n\n- This became much longer than I intended it to be. TL;DR at the bottom if you'd like to skip the details.\n\n---\n\n**Budget**\n\n- $400.00 to cover camera and lens. I will consider stretching the budget to $500.00 if given an extremely compelling option. I will cover taxes above this budget, so the whole budget can be allocated to the tech.\n- If I can get her one of those starter bundles that would be great, but if choosing between lower quality + bundle vs higher quality + starter lens, I would opt for the latter.\n- I will buy her secondary necessities, such as carry case basic tri-pod, extra memory cards, etc at a later date independent of the current budget, as I have plenty of time to do that before she leaves.\n\n---\n**Use-Case Details**\n\n- She will primarily be taking pictures, but she absolutely does like to take short videos from time to time, and I'd like her to be able to that with the camera we get. 30fps is ok, 60fps preferable but not make-or-break. Picture quality is the higher priority.\n- Subject matter is overall what you'd expect of someone who just wants to document their life and travel experiences in general. Nature, landscape, animals, people, and architecture would make up 90% of the subject matter.\n- In terms of photography skill, she would be considered \"amateur\". Definitely not inept by any means, just about what you'd expect of someone who enjoys taking photos of their family and life.\n- In terms of hardware technical know-how, this would be the biggest learning curve. She hasn't had much experience with modern cameras or hardware. She's relatively savvy with computers and technology though, knows how to seek out knowledge and troubleshooting resources via the internet and user manuals and such, and what she can't figure out, I can assist.\n\n---\n\n**TL;DR**\n\n- Looking for suggestions for a good starter camera + lens for my mom as I know fuck-all about camera tech.\n- Budget is $400.00, $500.00 if it's a *really* compelling choice. Budget can be allocated entirely to the camera and lens, I'll cover taxes above this.\n- Primarily will take photos, but will take videos.\n- Subject matter is what you'd expect of someone who wants to document their life experiences while at home and traveling the country.", "link": "https://www.reddit.com/r/Cameras/comments/kznre1/looking_for_advice_on_a_camera_specific_details/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking for advice on a camera, specific details inside! /!/ hello friends. i'm sure you get a million of these types of posts, but i need some help.\n\ni'm looking to purchase my mom (54 y/o) a relatively nice camera, as she loves documenting her life experiences. i was hoping to get some suggestions from some experienced users, so i humbly turn to the r/cameras community.\n\n- i know very little about cameras beyond the basics, and there's just so much information out there to parse through on my own and -----> come !!!  -----> up !!!  -----> with !!!  an informed purchase decision.\n\n- i also don't know anything about lenses, so i definitely need guidance on a good, all-around starter lens.\n\n- this became much longer than i intended it to be. tl;dr at the bottom if you'd like to skip the details.\n\n---\n\n**budget**\n\n- $400.00 to cover camera and lens. i will consider stretching the budget to $500.00 if given an extremely compelling option. i will cover taxes above this budget, so the whole budget can be allocated to the tech.\n- if i can get her one of those starter bundles that would be great, but if choosing between lower quality + bundle vs higher quality + starter lens, i would opt for the latter.\n- i will buy her secondary necessities, such as carry case basic tri-pod, extra memory cards, etc at a later date independent of the current budget, as i have plenty of time to do that before she leaves.\n\n---\n**use-case details**\n\n- she will primarily be taking pictures, but she absolutely does like to take short videos from time to time, and i'd like her to be able to that with the camera we get. 30fps is ok, 60fps preferable but not make-or-break. picture quality is the higher priority.\n- subject matter is overall what you'd expect of someone who just wants to document their life and travel experiences in general. nature, landscape, animals, people, and architecture would make up 90% of the subject matter.\n- in terms of photography skill, she would be considered \"amateur\". definitely not inept by any means, just about what you'd expect of someone who enjoys taking photos of their family and life.\n- in terms of hardware technical know-how, this would be the biggest learning curve. she hasn't had much experience with modern cameras or hardware. she's relatively savvy with computers and technology though, knows how to seek out knowledge and troubleshooting resources via the internet and user manuals and such, and what she can't figure out, i can assist.\n\n---\n\n**tl;dr**\n\n- looking for suggestions for a good starter camera + lens for my mom as i know fuck-all about camera tech.\n- budget is $400.00, $500.00 if it's a *really* compelling choice. budget can be allocated entirely to the camera and lens, i'll cover taxes above this.\n- primarily will take photos, but will take videos.\n- subject matter is what you'd expect of someone who wants to document their life experiences while at home and traveling the country.", "sortedWord": "None", "Identifyer": null, "identifyer": 19359, "year": "2021"}, {"autor": "Roshanxz1", "date": "2021-09-17 11:02:44", "content": "Sony A7 mark1 Lens /!/ Hey guys \n\nI recently bought used Sony A7 mark 1 from one guy and it came up with lense SONY FE 28-70MM F/3.5-5.6 OSS ( probably kitlens)\n\nIm looking to get some other new lenses too, because i wanna focus more into carphotography and portraits.\nCan u guys recommend me any cheap-midrange  lenses you were happy with?", "link": "https://www.reddit.com/r/Cameras/comments/ppy0a7/sony_a7_mark1_lens/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "sony a7 mark1 lens /!/ hey guys \n\ni recently bought used sony a7 mark 1 from one guy and it -----> came !!!  -----> up !!!  -----> with !!!  lense sony fe 28-70mm f/3.5-5.6 oss ( probably kitlens)\n\nim looking to get some other new lenses too, because i wanna focus more into carphotography and portraits.\ncan u guys recommend me any cheap-midrange  lenses you were happy with?", "sortedWord": "None", "Identifyer": null, "identifyer": 21387, "year": "2021"}, {"autor": "ArtHistoryCoffeeGirl", "date": "2021-01-19 04:09:50", "content": "Camera screen not working. Hi there everyone. My Canon Rebel T2i has been displaying this screen for sometime now. I use it mainly for filming. I have tried researching now to fix it but come up with nothing. Any idea what is wrong with my camera or if it is even fixable? Thank you!", "link": "https://www.reddit.com/r/Cameras/comments/l0buv5/camera_screen_not_working_hi_there_everyone_my/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "camera screen not working. hi there everyone. my canon rebel t2i has been displaying this screen for sometime now. i use it mainly for filming. i have tried researching now to fix it but -----> come !!!  -----> up !!!  -----> with !!!  nothing. any idea what is wrong with my camera or if it is even fixable? thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 22284, "year": "2021"}], "name": "withCameras2021"}