{"interestingcomments": [{"autor": "ErikMTL", "date": "2019-06-29 14:28:19", "content": "Looking for a digital camera recommendation (Canada) /!/ My wife and I are getting tired of the limitations our phone cameras for taking pictures of our daughter, so we're looking at getting an entry-level camera. The problem is that it seems like the entry-level space has been gutted because of phones, so I'm having trouble coming up with a camera that fits both our needs and budget. Reading mainstream tech review sites (CNet and the like) is unfulfilling because they seem to have varying judging criteria, while going to dedicated photography sites makes you feel like you're going to get a real piece of crap if you don't spend a lot of money. So the more I look around on my own the muddier the water seems to get.\n\nWhat we want:\n\n\\- Good optical zoom.\n\n\\- Good dim/indoor light performance.\n\n\\- Reasonable video taking ability, but doesn't need to be 4K.\n\n\\- Some form of wireless connectivity for picture transfer, preferably to phones.\n\nWhat we'd like, but isn't mandatory:\n\n\\- Touchscreen.\n\n\\- A good variety of shooting modes and filters.\n\n\\- Fast shutter speed (she's a toddler, it's hard to get a picture where she's not moving.)\n\n\\- Physical view finder (this one is the lowest priority, because my wife doesn't care at all about that, but I kind of want it.)\n\nWe'd like to keep the price under $300 CDN, but there's some flexibility if it's a really good deal or a camera with a must-have feature/function.\n\nThanks for any advice you can give! And if I'm expecting too much camera for too little money, feel free to tell me to go stuff myself. At least I'll know to lower my expectations.", "link": "https://www.reddit.com/r/Cameras/comments/c6zksy/looking_for_a_digital_camera_recommendation_canada/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "looking for a digital camera recommendation (canada) /!/ my wife and i are getting tired of the limitations our phone cameras for taking pictures of our daughter, so we're looking at getting an entry-level camera. the problem is that it seems like the entry-level space has been gutted because of phones, so i'm having trouble -----> coming !!!  -----> up !!!  -----> with !!!  a camera that fits both our needs and budget. reading mainstream tech review sites (cnet and the like) is unfulfilling because they seem to have varying judging criteria, while going to dedicated photography sites makes you feel like you're going to get a real piece of crap if you don't spend a lot of money. so the more i look around on my own the muddier the water seems to get.\n\nwhat we want:\n\n\\- good optical zoom.\n\n\\- good dim/indoor light performance.\n\n\\- reasonable video taking ability, but doesn't need to be 4k.\n\n\\- some form of wireless connectivity for picture transfer, preferably to phones.\n\nwhat we'd like, but isn't mandatory:\n\n\\- touchscreen.\n\n\\- a good variety of shooting modes and filters.\n\n\\- fast shutter speed (she's a toddler, it's hard to get a picture where she's not moving.)\n\n\\- physical view finder (this one is the lowest priority, because my wife doesn't care at all about that, but i kind of want it.)\n\nwe'd like to keep the price under $300 cdn, but there's some flexibility if it's a really good deal or a camera with a must-have feature/function.\n\nthanks for any advice you can give! and if i'm expecting too much camera for too little money, feel free to tell me to go stuff myself. at least i'll know to lower my expectations.", "sortedWord": "None", "Identifyer": null, "identifyer": 77068, "year": "2019"}, {"autor": "1096bimu", "date": "2019-05-16 18:23:55", "content": "Expensive versus cheap filter ROUND II /!/ Last time some snobs came up with a bunch of excuses so now I've fixed all of them, I'm testing exactly the kinds of things the snobs wanted.\n\nHere is B+W CPL filter, I think it's $100+, versus $15 Neewer CPL filter, cheapest on Amazon.\n\n[https://imgur.com/a/hrQ07XY](https://imgur.com/a/hrQ07XY)\n\nI got it all covered this time, we have a hug reflection on the table, which is cut by the filter, so snobs can please tell me how the expensive filter is cutting that reflection better, cuz I don't see any difference.\n\nWe also got the same white balance issue, I'm again using the same white balance where but one of them is clearly way more blue while the other is mostly neutral.\n\nWe also have flare test, even on the first set of images the bright widow is just outside of frame so you can tell me which one has more contrast. We also have worst case scenario test with a bright light straight into the lens, again you can tell me which one has the better unicorn blood infused anti-reflection MRC magic going on.\n\nI will say however, the B+W tunrs very smooth like a good lens where as the Neewer has no dampening going on it's just metal grinding against each other.", "link": "https://www.reddit.com/r/Cameras/comments/bpg3vw/expensive_versus_cheap_filter_round_ii/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "expensive versus cheap filter round ii /!/ last time some snobs -----> came !!!  -----> up !!!  -----> with !!!  a bunch of excuses so now i've fixed all of them, i'm testing exactly the kinds of things the snobs wanted.\n\nhere is b+w cpl filter, i think it's $100+, versus $15 neewer cpl filter, cheapest on amazon.\n\n[https://imgur.com/a/hrq07xy](https://imgur.com/a/hrq07xy)\n\ni got it all covered this time, we have a hug reflection on the table, which is cut by the filter, so snobs can please tell me how the expensive filter is cutting that reflection better, cuz i don't see any difference.\n\nwe also got the same white balance issue, i'm again using the same white balance where but one of them is clearly way more blue while the other is mostly neutral.\n\nwe also have flare test, even on the first set of images the bright widow is just outside of frame so you can tell me which one has more contrast. we also have worst case scenario test with a bright light straight into the lens, again you can tell me which one has the better unicorn blood infused anti-reflection mrc magic going on.\n\ni will say however, the b+w tunrs very smooth like a good lens where as the neewer has no dampening going on it's just metal grinding against each other.", "sortedWord": "None", "Identifyer": null, "identifyer": 78356, "year": "2019"}, {"autor": "DawidRocks18080", "date": "2019-10-31 18:38:31", "content": "Ball head stuck to camera... /!/ So i tightened my gorillapod to my g7x mk2 a bit too hard, and i am having a hard time getting out. Please so stupid me wont come up with stupid solutions.", "link": "https://www.reddit.com/r/Cameras/comments/dpru22/ball_head_stuck_to_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "ball head stuck to camera... /!/ so i tightened my gorillapod to my g7x mk2 a bit too hard, and i am having a hard time getting out. please so stupid me wont -----> come !!!  -----> up !!!  -----> with !!!  stupid solutions.", "sortedWord": "None", "Identifyer": null, "identifyer": 79153, "year": "2019"}, {"autor": "ElGofre", "date": "2019-01-08 17:27:34", "content": "I've been in a bit of rut for the last couple of years with my interest in photography waning, so I've set myself a challenge; go through the Reddit Photoclass with the best camera I could find for under £100. This is what I came up with.", "link": "https://www.reddit.com/r/Cameras/comments/adwl4f/ive_been_in_a_bit_of_rut_for_the_last_couple_of/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i've been in a bit of rut for the last couple of years with my interest in photography waning, so i've set myself a challenge; go through the reddit photoclass with the best camera i could find for under £100. this is what i -----> came !!!  -----> up !!!  -----> with !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 79658, "year": "2019"}, {"autor": "YogurtxPretzels", "date": "2019-12-17 17:15:16", "content": "Keep using old glass+adapter or native glass? /!/ Hello, I am at a particular crossroads at the moment. I am a recent EOS R purchaser and boy, it has been great. The teeny little problem however, I do not have any RF lenses at the moment (money is definitely tight after the R buy), and I have been subjected  to using the adapter. Currently, I use the Sigma 35/1.4 as my main go-to. Paired with the adapter.. I unfortunately have quite a bit of vignetting. It is nothing too outrageous, but it can be noticed, even after going through post. I did a little searching and came up with the Canon RF lens, 35/1.8 -  \n\n\nDo you guys think it is a good idea to sell the Sigma and buy the Canon RF?", "link": "https://www.reddit.com/r/Cameras/comments/ebynaj/keep_using_old_glassadapter_or_native_glass/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "keep using old glass+adapter or native glass? /!/ hello, i am at a particular crossroads at the moment. i am a recent eos r purchaser and boy, it has been great. the teeny little problem however, i do not have any rf lenses at the moment (money is definitely tight after the r buy), and i have been subjected  to using the adapter. currently, i use the sigma 35/1.4 as my main go-to. paired with the adapter.. i unfortunately have quite a bit of vignetting. it is nothing too outrageous, but it can be noticed, even after going through post. i did a little searching and -----> came !!!  -----> up !!!  -----> with !!!  the canon rf lens, 35/1.8 -  \n\n\ndo you guys think it is a good idea to sell the sigma and buy the canon rf?", "sortedWord": "None", "Identifyer": null, "identifyer": 81872, "year": "2019"}, {"autor": "LancasterDodd777", "date": "2019-07-02 02:17:50", "content": "How to white balance a DMC-FZ62? /!/ I’m super dumb at these types of things and there doesn’t seem to be a video or instructions online for how to white balance this particular model.\n\nThere’s a WB button which when pressed comes up with a grid at which point I have no idea what I’m doing.\n\nAny help would be appreciated! Thanks", "link": "https://www.reddit.com/r/Cameras/comments/c83igs/how_to_white_balance_a_dmcfz62/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "how to white balance a dmc-fz62? /!/ i’m super dumb at these types of things and there doesn’t seem to be a video or instructions online for how to white balance this particular model.\n\nthere’s a wb button which when pressed -----> comes !!!  -----> up !!!  -----> with !!!  a grid at which point i have no idea what i’m doing.\n\nany help would be appreciated! thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 82412, "year": "2019"}, {"autor": "pooolofvomit", "date": "2019-07-18 13:57:47", "content": "I'm looking for a camera that's, my style of recording, I like improvising there isen't a better feeling then coming up with something smart to say from on the fly, there isen't a better feeling then that /!/ Anyhow I have the rx100 v but I want a camera that you could improvise with stand there for practially how long as you want, but I be glad if I can like take it outside with and vlog too", "link": "https://www.reddit.com/r/Cameras/comments/cestqa/im_looking_for_a_camera_thats_my_style_of/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "i'm looking for a camera that's, my style of recording, i like improvising there isen't a better feeling then -----> coming !!!  -----> up !!!  -----> with !!!  something smart to say from on the fly, there isen't a better feeling then that /!/ anyhow i have the rx100 v but i want a camera that you could improvise with stand there for practially how long as you want, but i be glad if i can like take it outside with and vlog too", "sortedWord": "None", "Identifyer": null, "identifyer": 82491, "year": "2019"}], "name": "withCameras2019"}