{"interestingcomments": [{"autor": "thebamhurgler", "date": "2020-02-05 07:12:40", "content": "$4k challenge /!/ I’ve been shooting on a D600 for the past 6 months and have loved it. Really fallen in love with photography, and all things camera. I’ve set aside about $4000 for a new system. But not exactly sure what to get, because that budget can get used up incredibly fast. I have mainly been shooting landscapes and events, but as I’m about to start putting money into marketing myself, I feel like some updated gear is needed. So If you had $4k (give or take a couple hundred) what would you buy?(these are mostly eBay prices, and I’ve found eBay to be a decently reliable shopping source)\n\nI’ve looked at: canon eos r w/ 70-200 2.8 MK iii and a tamron 24-70 2.8 \n\nEos r with a 28-70 f2 rf \n\nSony a7iii/a7riii w/24-70 gm +accessories\n\nSony a7riv w/Sony 24-105 f4\n\nNikon D 850 w 24-70 \n\nNikon 24-70 2.8/Nikon 70-200 EDFL (or whatever the new model is) and a d750\n\n\nLet me know what other options you come up with! Thanks guys!", "link": "https://www.reddit.com/r/Cameras/comments/ez5nex/4k_challenge/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "$4k challenge /!/ i’ve been shooting on a d600 for the past 6 months and have loved it. really fallen in love with photography, and all things camera. i’ve set aside about $4000 for a new system. but not exactly sure what to get, because that budget can get used up incredibly fast. i have mainly been shooting landscapes and events, but as i’m about to start putting money into marketing myself, i feel like some updated gear is needed. so if you had $4k (give or take a couple hundred) what would you buy?(these are mostly ebay prices, and i’ve found ebay to be a decently reliable shopping source)\n\ni’ve looked at: canon eos r w/ 70-200 2.8 mk iii and a tamron 24-70 2.8 \n\neos r with a 28-70 f2 rf \n\nsony a7iii/a7riii w/24-70 gm +accessories\n\nsony a7riv w/sony 24-105 f4\n\nnikon d 850 w 24-70 \n\nnikon 24-70 2.8/nikon 70-200 edfl (or whatever the new model is) and a d750\n\n\nlet me know what other options you -----> come !!!  -----> up !!!  -----> with !!! ! thanks guys!", "sortedWord": "None", "Identifyer": null, "identifyer": 1427, "year": "2020"}, {"autor": "Hunter422", "date": "2020-03-10 15:17:36", "content": "Fujifilm X-T30 Lens Recommendations? /!/ Trouble deciding what should be my 1st lens for my Fujifilm X-T30 after the XF 18-55 f2.8-4.\n\nI know lenses are subjective and it’s hard to recommend one so I will try to explain my needs as best as I can, so please bare with me.\n\nI absolutely love the kit lens and the sharpness and versatility it provides. I am only a hobbyist and I don’t rely on photography as a source of income. I take mostly travel and street photography with some landscape and portrait that naturally occur while on travel. I have 2 main reasons why I want a new lens - 1st is low light performance. One example was when I was on a dinner cruise and couldn’t capture any photos without bumping the ISO up to 6400. I really think a fast Prime lens would have helped a lot in this case. 2nd is focal length although this might have been more situational. We went to an open zoo/reserve and 55mm was nowhere near enough to capture the animals and shows the way I wanted to. Here I feel like a longer zoom would have helped tremendously. On further reflection though, how often do I really go on zoos or watch theatrical performances from a distance - probably not so much. Then again, having the option of having a lens with a long focal length would be good to have.\n\nI am also struggling between the old Prime vs. Zoom argument. I do feel like I should get a Prime for both the practical aspects as well as for improving my own skill by being locked to a fixed focal point but I feel like I was “spoiled” by starting with a zoom lens and I feel like I would miss quite a lot of shots if I were to use a Prime.\n\nI really want something to compliment the 18-55 rather than replace it as I really love the lens. After a lot of research and thinking, I have come up with the following options in order of what I think is best for my situation:\n\n1. XC 35mm F2 and Viltrox 85mm F1.8 - 2 lenses for the price of 1 XF lens. Both are very fast lenses and from what I’ve read are very sharp. The only negatives here are neither are XF lenses and both are Primes but those aren’t really a negative.\n\n2. XF 55-200mm F3.5-4.8 - A zoom lens that would compliment the 18-55 beautifully. Negative is it’s a zoom so it’s not as fast or as sharp as Primes. Also I don’t get any low light advantages a Prime would provide.\n\n3. XF 16mm F1.4 - Lots of good reviews for this lens, the 16mm and F1.4 as well as super close min focus distance allow for a lot of creative and unique shots which I do wish to learn and experience. The big negative for this lens is it’s not very versatile. Super wide angle requires a lot of shot composition and no classic/lazy flattering portrait shots allowed. For landscape I feel the 18mm on the kit would also work similarly to this lens especially since the F1.4 aperture wouldn’t matter in this case though I could be wrong.\n\n4. XF 50-140mm F2.8 - This one is the red badge monster and a big part of me wanting this feels more emotional than anything practical. Feels like the opposite of my 1st option which is the most practical but less “exciting” option.\n\n5. 23mm F2 or 35mm F2 - The most common all-rounders. I just feel like the kit lens does well enough @23mm and the existence of the XC 35mm F2 for half the price really makes these lenses a tough buy for me.\n\nThese are my options. If you were in my situation, what would you get? Feel free to recommend other lenses as well. Another thing I might have glanced over is budget, I am willing to shell out as long as it gives the best results for the money It costs.\n\nSorry for the long post, if you have made it this far, thanks for your time and advice!", "link": "https://www.reddit.com/r/Cameras/comments/fgfdwe/fujifilm_xt30_lens_recommendations/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "fujifilm x-t30 lens recommendations? /!/ trouble deciding what should be my 1st lens for my fujifilm x-t30 after the xf 18-55 f2.8-4.\n\ni know lenses are subjective and it’s hard to recommend one so i will try to explain my needs as best as i can, so please bare with me.\n\ni absolutely love the kit lens and the sharpness and versatility it provides. i am only a hobbyist and i don’t rely on photography as a source of income. i take mostly travel and street photography with some landscape and portrait that naturally occur while on travel. i have 2 main reasons why i want a new lens - 1st is low light performance. one example was when i was on a dinner cruise and couldn’t capture any photos without bumping the iso up to 6400. i really think a fast prime lens would have helped a lot in this case. 2nd is focal length although this might have been more situational. we went to an open zoo/reserve and 55mm was nowhere near enough to capture the animals and shows the way i wanted to. here i feel like a longer zoom would have helped tremendously. on further reflection though, how often do i really go on zoos or watch theatrical performances from a distance - probably not so much. then again, having the option of having a lens with a long focal length would be good to have.\n\ni am also struggling between the old prime vs. zoom argument. i do feel like i should get a prime for both the practical aspects as well as for improving my own skill by being locked to a fixed focal point but i feel like i was “spoiled” by starting with a zoom lens and i feel like i would miss quite a lot of shots if i were to use a prime.\n\ni really want something to compliment the 18-55 rather than replace it as i really love the lens. after a lot of research and thinking, i have -----> come !!!  -----> up !!!  -----> with !!!  the following options in order of what i think is best for my situation:\n\n1. xc 35mm f2 and viltrox 85mm f1.8 - 2 lenses for the price of 1 xf lens. both are very fast lenses and from what i’ve read are very sharp. the only negatives here are neither are xf lenses and both are primes but those aren’t really a negative.\n\n2. xf 55-200mm f3.5-4.8 - a zoom lens that would compliment the 18-55 beautifully. negative is it’s a zoom so it’s not as fast or as sharp as primes. also i don’t get any low light advantages a prime would provide.\n\n3. xf 16mm f1.4 - lots of good reviews for this lens, the 16mm and f1.4 as well as super close min focus distance allow for a lot of creative and unique shots which i do wish to learn and experience. the big negative for this lens is it’s not very versatile. super wide angle requires a lot of shot composition and no classic/lazy flattering portrait shots allowed. for landscape i feel the 18mm on the kit would also work similarly to this lens especially since the f1.4 aperture wouldn’t matter in this case though i could be wrong.\n\n4. xf 50-140mm f2.8 - this one is the red badge monster and a big part of me wanting this feels more emotional than anything practical. feels like the opposite of my 1st option which is the most practical but less “exciting” option.\n\n5. 23mm f2 or 35mm f2 - the most common all-rounders. i just feel like the kit lens does well enough @23mm and the existence of the xc 35mm f2 for half the price really makes these lenses a tough buy for me.\n\nthese are my options. if you were in my situation, what would you get? feel free to recommend other lenses as well. another thing i might have glanced over is budget, i am willing to shell out as long as it gives the best results for the money it costs.\n\nsorry for the long post, if you have made it this far, thanks for your time and advice!", "sortedWord": "None", "Identifyer": null, "identifyer": 1560, "year": "2020"}, {"autor": "Robonellz", "date": "2020-01-13 07:35:51", "content": "Olympus OM-D EM10 ii -VS- Nikon D3500 /!/ I’m looking for a smaller lightweight capable digital camera under $500. I take casual photos on film mostly, but would like to save money by using digital for every day shooting. I’d also like to be able start using my photography as a side business(offering casual portraits or personal automotive shots). The two options I’ve come up with are the two in the title. I prefer the style and size of the OM10, but I know the Nikon has 24 Mp, which is a decent amount more than the 16 Mp offered by the Olympus. I have many vintage lenses from both brands as well as some others(Canon/Pentax/Konica/Minolta), which I’m sure even for the matching brands I’d still need adapter for. The kit lenses on both are plenty for my current needs. Someone please tell me why I should pick one over the other. I really want to go for the Olympus but the only thing stopping that choice is Mp. Olympus users.... convince me.", "link": "https://www.reddit.com/r/Cameras/comments/eo103h/olympus_omd_em10_ii_vs_nikon_d3500/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "olympus om-d em10 ii -vs- nikon d3500 /!/ i’m looking for a smaller lightweight capable digital camera under $500. i take casual photos on film mostly, but would like to save money by using digital for every day shooting. i’d also like to be able start using my photography as a side business(offering casual portraits or personal automotive shots). the two options i’ve -----> come !!!  -----> up !!!  -----> with !!!  are the two in the title. i prefer the style and size of the om10, but i know the nikon has 24 mp, which is a decent amount more than the 16 mp offered by the olympus. i have many vintage lenses from both brands as well as some others(canon/pentax/konica/minolta), which i’m sure even for the matching brands i’d still need adapter for. the kit lenses on both are plenty for my current needs. someone please tell me why i should pick one over the other. i really want to go for the olympus but the only thing stopping that choice is mp. olympus users.... convince me.", "sortedWord": "None", "Identifyer": null, "identifyer": 2689, "year": "2020"}, {"autor": "NullifyPirates", "date": "2020-10-10 03:52:46", "content": "Canon M50 vs Canon 200D mark II which one is better for youtube videos. /!/ I have small Youtube channel and currently making videos using my iphone 11 .I'm planning to upgrade my gears and buy a camera. I have come up with two cameras in my budget which are perfect for my shooting conditions. However i cannot decide between these two cameras-\n\ncanon 200D mark II and Canon M50.\n\nMy shooting condition- Indoor video with artificial lighting (GODOX SL60)  \nI have read a little about how DSLR and mirrorless cameras work. So i have a brief idea between the internal workings of 200D II and M50. and i'm aware of low battery life of M50. Since i won't be shooting vlogs and i'll shoot mostly in indoors so the form factor is concerned matter for me. I'm really new to these modern cameras. Can anyone help me to decide the best camera for my condition between these two cameras. (i know there are better cameras out there but these two well fits my budget) .I have scraped lumix G7 from this consideration due to it's poor autofocus. Thanks in advance.", "link": "https://www.reddit.com/r/Cameras/comments/j8dpep/canon_m50_vs_canon_200d_mark_ii_which_one_is/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "canon m50 vs canon 200d mark ii which one is better for youtube videos. /!/ i have small youtube channel and currently making videos using my iphone 11 .i'm planning to upgrade my gears and buy a camera. i have -----> come !!!  -----> up !!!  -----> with !!!  two cameras in my budget which are perfect for my shooting conditions. however i cannot decide between these two cameras-\n\ncanon 200d mark ii and canon m50.\n\nmy shooting condition- indoor video with artificial lighting (godox sl60)  \ni have read a little about how dslr and mirrorless cameras work. so i have a brief idea between the internal workings of 200d ii and m50. and i'm aware of low battery life of m50. since i won't be shooting vlogs and i'll shoot mostly in indoors so the form factor is concerned matter for me. i'm really new to these modern cameras. can anyone help me to decide the best camera for my condition between these two cameras. (i know there are better cameras out there but these two well fits my budget) .i have scraped lumix g7 from this consideration due to it's poor autofocus. thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 3385, "year": "2020"}, {"autor": "Five10Fiftyfold", "date": "2020-11-02 22:53:56", "content": "I just came up with a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. Thoughts? /!/ Looking at the market there seem to be two approaches, the MASP selection and fuji's dedicated dials each featuring an A option. Both having some advantages as some disadvantages.\n\nThere also 3 distinct setting scenarios.  \nThe full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.  \nFull manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.  \nHaving most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. This also means that camera would preferably have to control only one parameter at a time.\n\nThe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. So it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nWith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. The answer is simple.  \nInstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. While obviously still retaining the option of full manual and auto.\n\nFuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. You have to rotate the first one from A all the way to the preferred value and then rotate the other all the way to A, which is a slow two step process. As is with the regular mode selection where you had to go from Av with set iso, to Manual with auto iso.\n\nOne real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. In the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. Then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem.\n\nI would like to know your thoughts on that.", "link": "https://www.reddit.com/r/Cameras/comments/jmyb3o/i_just_came_up_with_a_better_and_more_logical/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i just -----> came !!!  -----> up !!!  -----> with !!!  a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. thoughts? /!/ looking at the market there seem to be two approaches, the masp selection and fuji's dedicated dials each featuring an a option. both having some advantages as some disadvantages.\n\nthere also 3 distinct setting scenarios.  \nthe full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.  \nfull manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.  \nhaving most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. this also means that camera would preferably have to control only one parameter at a time.\n\nthe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. so it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nwith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. the answer is simple.  \ninstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. while obviously still retaining the option of full manual and auto.\n\nfuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. you have to rotate the first one from a all the way to the preferred value and then rotate the other all the way to a, which is a slow two step process. as is with the regular mode selection where you had to go from av with set iso, to manual with auto iso.\n\none real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. in the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem.\n\ni would like to know your thoughts on that.", "sortedWord": "None", "Identifyer": null, "identifyer": 3634, "year": "2020"}, {"autor": "ToastedCrispies", "date": "2020-12-07 21:53:52", "content": "Is someone willing to help me correctly price out equipment for sale? /!/ I've been slowly going through my late mothers possessions, and found a few of her old cameras (a Nikon and Olympus). Since money is tight this year and the holiday is here, (and I know next to nothing about photography or the equipment), I figured I would put them up for sale in my local area.\n\nWhen I tried Googling used prices, they are all over the place! I came up with a price, but am now doubting myself. I would prefer not to rip someone off, or even rip myself off for that matter. So I am here seeking help from people who know these things.\n\nIf anyone is willing to help me out, that would be awesome! I can list out what I have, or take a photo to show what is there. I don't have much to offer in the way of thanks, aside from words, but I can make someone some decals for their time if they'd like!", "link": "https://www.reddit.com/r/Cameras/comments/k8qhdj/is_someone_willing_to_help_me_correctly_price_out/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "is someone willing to help me correctly price out equipment for sale? /!/ i've been slowly going through my late mothers possessions, and found a few of her old cameras (a nikon and olympus). since money is tight this year and the holiday is here, (and i know next to nothing about photography or the equipment), i figured i would put them up for sale in my local area.\n\nwhen i tried googling used prices, they are all over the place! i -----> came !!!  -----> up !!!  -----> with !!!  a price, but am now doubting myself. i would prefer not to rip someone off, or even rip myself off for that matter. so i am here seeking help from people who know these things.\n\nif anyone is willing to help me out, that would be awesome! i can list out what i have, or take a photo to show what is there. i don't have much to offer in the way of thanks, aside from words, but i can make someone some decals for their time if they'd like!", "sortedWord": "None", "Identifyer": null, "identifyer": 3887, "year": "2020"}, {"autor": "JonstrupDK", "date": "2020-01-05 19:24:57", "content": "Going full frame mirrorless /!/ Hi all, \n\nRecently my beloved 5-year old 70D with Sigma 18-30mm f1.8 recently got stolen. The insurance covered my loss, so I think it is a fair time to upgrade to full frame.\nI have been quite out of the loop regarding new camera gear, but my research tells me that mirrorless is the way to go.\nI loved the quality of my 18-35 f1.8, but I must admit that it did not cover all my needs, being a one lense type of guy. I'm therefore looking for a house+lense that can cover most needs ranging from landscape, street photography, and occasional video shooting.\nMy initial thought was the Canon EOS R with its RF 24-105 f4, mostly because I always have been a Canon guy, and the lense seems to be a perfect fit for me. Though I understand that Sony is strong in the mirrorless game with a variety of its A7 series. I'm just not really sure of the quality of its lenses. \nThe EOS R / 24-105 combo is my absolute limit regarding price. If anyone can come up with a better solution for me, for the same price, or lower, it will be much appreciated. \n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/ekhnq1/going_full_frame_mirrorless/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "going full frame mirrorless /!/ hi all, \n\nrecently my beloved 5-year old 70d with sigma 18-30mm f1.8 recently got stolen. the insurance covered my loss, so i think it is a fair time to upgrade to full frame.\ni have been quite out of the loop regarding new camera gear, but my research tells me that mirrorless is the way to go.\ni loved the quality of my 18-35 f1.8, but i must admit that it did not cover all my needs, being a one lense type of guy. i'm therefore looking for a house+lense that can cover most needs ranging from landscape, street photography, and occasional video shooting.\nmy initial thought was the canon eos r with its rf 24-105 f4, mostly because i always have been a canon guy, and the lense seems to be a perfect fit for me. though i understand that sony is strong in the mirrorless game with a variety of its a7 series. i'm just not really sure of the quality of its lenses. \nthe eos r / 24-105 combo is my absolute limit regarding price. if anyone can -----> come !!!  -----> up !!!  -----> with !!!  a better solution for me, for the same price, or lower, it will be much appreciated. \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 4829, "year": "2020"}, {"autor": "Tabletote", "date": "2020-03-01 02:28:32", "content": "Looking to move on from A6000... What to do? /!/ I currently own an A6000 that I bought a couple years back. I'd like to move on to something that's either a. smaller, lighter, and more portable or b. has a bit more IQ, longer battery, and improved specs in general. I'd like to spend no more than $800 after selling the whole kit or $500 after dumping the body. I generally use my gear for some light portrait work and a bunch of street photography.\n\nWith that in mind, I've come up with a few options:  \nFor the compact option, the RX100V  \n\n\nFor the \"better overall\" option, the A6300 or maybe the 6400/6500 if I can find one for under $500 (hard to do, I'm guessing)  \n\n\n  \nYour help is greatly appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/fbng8w/looking_to_move_on_from_a6000_what_to_do/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking to move on from a6000... what to do? /!/ i currently own an a6000 that i bought a couple years back. i'd like to move on to something that's either a. smaller, lighter, and more portable or b. has a bit more iq, longer battery, and improved specs in general. i'd like to spend no more than $800 after selling the whole kit or $500 after dumping the body. i generally use my gear for some light portrait work and a bunch of street photography.\n\n-----> with !!!  that in mind, i've -----> come !!!  -----> up !!!  -----> with !!!  a few options:  \nfor the compact option, the rx100v  \n\n\nfor the \"better overall\" option, the a6300 or maybe the 6400/6500 if i can find one for under $500 (hard to do, i'm guessing)  \n\n\n  \nyour help is greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 5080, "year": "2020"}, {"autor": "tokipoki64", "date": "2020-10-08 03:47:49", "content": "Recommended First Camera /!/ I’m looking to buy my first DLSR camera after doing some photography with an iPhone. After some research I’ve come up with the following list.\n\n- Nikon D3500\n- Canon T7\n- Nikon D5600\n- Canon SL3\n- Canon T7i\n\nI’m planning on using it primarily for still life, landscape and portraits, I’m not really interested in video. Any recommendations on which one of these would be best is appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/j76211/recommended_first_camera/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "recommended first camera /!/ i’m looking to buy my first dlsr camera after doing some photography with an iphone. after some research i’ve -----> come !!!  -----> up !!!  -----> with !!!  the following list.\n\n- nikon d3500\n- canon t7\n- nikon d5600\n- canon sl3\n- canon t7i\n\ni’m planning on using it primarily for still life, landscape and portraits, i’m not really interested in video. any recommendations on which one of these would be best is appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 6328, "year": "2020"}, {"autor": "charlie_is_a_cat", "date": "2020-11-10 18:27:02", "content": "I just got a Konica C35 AF and the ASA wheel seems to be stuck at 200. Google didn't come up with anything for me.", "link": "https://www.reddit.com/r/Cameras/comments/jrqemx/i_just_got_a_konica_c35_af_and_the_asa_wheel/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i just got a konica c35 af and the asa wheel seems to be stuck at 200. google didn't -----> come !!!  -----> up !!!  -----> with !!!  anything for me.", "sortedWord": "None", "Identifyer": null, "identifyer": 7002, "year": "2020"}, {"autor": "TomCatSniper", "date": "2020-06-19 02:55:02", "content": "Need help finding the right camera for my family /!/ I currently have a newborn and due to Coronavirus, my whole family still hasn't seen her yet.  We came up with the idea that we will create a small youtube channel just for our family members to view. She's only 3 months but shes having so many first moments that are currently being captured on my galaxy phone at a poor quality. I am looking for a camera that can take good quality pictures as well as something that can take excellent video with good audio as well. Another plus would be if it can take better quality video/pictures in darker lighting.  I currently have a budget of $800-$900 max, which I know is a drop in the bucket for some cameras. Thank you all in advance.", "link": "https://www.reddit.com/r/Cameras/comments/hbsqcn/need_help_finding_the_right_camera_for_my_family/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "need help finding the right camera for my family /!/ i currently have a newborn and due to coronavirus, my whole family still hasn't seen her yet.  we -----> came !!!  -----> up !!!  -----> with !!!  the idea that we will create a small youtube channel just for our family members to view. she's only 3 months but shes having so many first moments that are currently being captured on my galaxy phone at a poor quality. i am looking for a camera that can take good quality pictures as well as something that can take excellent video with good audio as well. another plus would be if it can take better quality video/pictures in darker lighting.  i currently have a budget of $800-$900 max, which i know is a drop in the bucket for some cameras. thank you all in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 8280, "year": "2020"}, {"autor": "tin_man_", "date": "2020-06-18 15:12:11", "content": "Can you help me with a faulty GX80? /!/  Hi, I'm trying to help a friend out with her camera that has stopped working. It's a Panasonic Lumix GX80, and when she turns it on it comes up with the message 'Please turn off and on again' continuously, and she can't take any photos.\n\nI've checked the camera manual and it has not mention of this. I've also googled the problem, and only one match came back for that phrase with this camera. Unfortunately in that case they didn't detail what the solution was other than getting it fixed under warranty, and my friend's warranty has expired.\n\nHas anyone come across this issue before, or can shed any light on what the problem might be? Ideally I'd love a way to fix it or an idea of what it would cost to get it fixed. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/hbgggv/can_you_help_me_with_a_faulty_gx80/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "can you help me with a faulty gx80? /!/  hi, i'm trying to help a friend out with her camera that has stopped working. it's a panasonic lumix gx80, and when she turns it on it -----> comes !!!  -----> up !!!  -----> with !!!  the message 'please turn off and on again' continuously, and she can't take any photos.\n\ni've checked the camera manual and it has not mention of this. i've also googled the problem, and only one match came back for that phrase with this camera. unfortunately in that case they didn't detail what the solution was other than getting it fixed under warranty, and my friend's warranty has expired.\n\nhas anyone come across this issue before, or can shed any light on what the problem might be? ideally i'd love a way to fix it or an idea of what it would cost to get it fixed. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 8298, "year": "2020"}], "name": "withCameras2020"}