{"interestingcomments": [{"Unnamed: 0": 395367, "autor": "areswalker8", "date": 1609688069000, "content": "[Meta] Can the moderators actually do their job an remove all the non specialized tools? Lets also add/edit a rule to more clearly define tools? /!/ I keep seeing things that don't fit this sub. Tools like improvised items, and chain wrench (yes you)\n\nSpecialized - adjective \n\ndesigned for a particular purpose\nconcentrating on a small area of a subject\n\nIts not that hard to understand what a Specialized tool is.\n\nSpecialized \nOil filter wrench, used to remove oil filters and nothing else.\n\nNot Specialized\nAdjustable wrench\n\nSpecialized\nFuel Rod container, holds nuclear fuel rods\n\nNot Specialized\nCargo containers, can be filled with basically anything.\n\nSpecialized\nScalpel, meant for clean cuts on bio-matter\n\nNot Specialized\nPocket knife.\n\nI can keep going.\n\nKeep these things in mind when posting\n1) Is it intended for a single use? If yes then its specialized.\n2) Has it been posted recently or many times?\n\n3) Is it actually a tool and not some thing someone threw together when it would have been more logical to just go grab the proper tool?\nNote: I'm not saying homemade tools don't fit, I'm say that if someone made something clearly just to post it for karma that it shouldn't be here, thats why r/DIY exists.", "link": "https://www.reddit.com/r/specializedtools/comments/kpmj60/meta_can_the_moderators_actually_do_their_job_an/", "origin": "Reddit", "suborigin": "specializedtools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[meta] can the moderators actually do their job an remove all the non specialized tools? lets also add/edit a rule to more clearly define tools? /!/ i keep seeing things that don't fit this sub. tools like improvised items, and chain wrench (yes you)\n\nspecialized - adjective \n\ndesigned for a particular purpose\nconcentrating on a small area of a subject\n\nits not that hard to understand what a specialized tool is.\n\nspecialized \noil filter wrench, used to remove oil filters and nothing else.\n\nnot specialized\nadjustable wrench\n\nspecialized\nfuel rod container, holds nuclear fuel rods\n\nnot specialized\ncargo containers, can be filled with basically anything.\n\nspecialized\nscalpel, meant for clean cuts on bio-matter\n\nnot specialized\npocket knife.\n\ni can keep going.\n\nkeep these things in mind when posting\n1) is it intended for a single use? if yes then its specialized.\n2) has it been posted recently or many times?\n\n3) is it actually a tool and not some thing someone threw together when it would have been more logical to just go grab the proper tool?\nnote: i'm not saying homemade tools don't fit, i'm say that if someone made something clearly just to post it for karma that it shouldn't be here, thats why r/-----> diy !!!  exists.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/specializedtools/comments/kpmj60/meta_can_the_moderators_actually_do_their_job_an/", "identifyer": 395367, "year": "2021"}, {"Unnamed: 0": 397648, "autor": "moostratet", "date": 1610817600000, "content": "Do diy tools count?", "link": "https://www.reddit.com/r/specializedtools/comments/kymymj/do_diy_tools_count/", "origin": "Reddit", "suborigin": "specializedtools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "do -----> diy !!!  tools count?", "sortedWord": "None", "removed": "reddit", "score": 1, "comments": 0, "media": "link", "medialink": "https://i.imgur.com/cXL8P7w.gifv", "identifyer": 397648, "year": "2021"}], "name": "diyspecializedtools2021"}