{"interestingcomments": [{"autor": "[deleted]", "date": 1586403993000, "content": "ROBERT the Robot Helps Patients Get Out of Bed Faster /!/ [deleted]", "link": "https://www.reddit.com/r/technology/comments/fxl8ji/robert_the_robot_helps_patients_get_out_of_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "robert the robot helps patients get out of -----> bed !!!  faster /!/ [deleted]", "sortedWord": "None", "removed": "('deleted',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.youtube.com/watch?v=7DI_EqRAkuQ',)", "identifyer": 5505198, "year": "2020"}, {"autor": "-AMARYANA-", "date": 1581716631000, "content": "Amazon is has a market valuation of $1.06 trillion. All these companies (Walmart, Best Buy, Macy’s, Target, Costco, Gap, Sears, Home Depot, Starbucks, Foot Locker, Lowe’s, Bed Bath Beyond, J.C. Penney, Office Depot, Nordstrom, Big Lots, Kohl’s) have a market valuation of $1.06 trillion. /!/ Thoughts?\n\nI'm fascinated by creative disruption and how the Internet has changed everything in my lifetime (since 1990). Amazon and Apple were once the butt of jokes in Wall Street and Silicon Valley, nobody is laughing at them now.", "link": "https://www.reddit.com/r/technology/comments/f3zc4k/amazon_is_has_a_market_valuation_of_106_trillion/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "amazon is has a market valuation of $1.06 trillion. all these companies (walmart, best buy, macy’s, target, costco, gap, sears, home depot, starbucks, foot locker, lowe’s, -----> bed !!!  bath beyond, j.c. penney, office depot, nordstrom, big lots, kohl’s) have a market valuation of $1.06 trillion. /!/ thoughts?\n\ni'm fascinated by creative disruption and how the internet has changed everything in my lifetime (since 1990). amazon and apple were once the butt of jokes in wall street and silicon valley, nobody is laughing at them now.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/f3zc4k/amazon_is_has_a_market_valuation_of_106_trillion/',)", "identifyer": 5505786, "year": "2020"}, {"autor": "Ordinary-Ad-7281", "date": 1606010929000, "content": "Government Dungar College Bikaner announced notification regarding PTET Counselling 2020 BEd 2nd Year. All candidates who want to take admission must attend the PTET Counseling process.", "link": "https://www.reddit.com/r/technology/comments/jynjfp/government_dungar_college_bikaner_announced/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "government dungar college bikaner announced notification regarding ptet counselling 2020 -----> bed !!!  2nd year. all candidates who want to take admission must attend the ptet counseling process.", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://gosarkariresult.co.in/ptet-counselling-bed-2nd-year-challan-fees-last-date/',)", "identifyer": 5508881, "year": "2020"}, {"autor": "tonitaken", "date": 1588382484000, "content": "My TV remote took control of my LED lights... HELP! /!/ Slast week I ordered those LED light strips, I only ordered one to go along the wall above my bed. First couple nights everything was normal, then they started changing colors randomly on their own. I would be sitting with my lights on red for example, and they would randomly turn white. Then on a different night, my TV was off and randomly turned on by itself so I decided to look up on Google why it would do that. I found that when remote batteries are low, they send delayed signals so if I tried to turn on and it didn't work it might still send that signal later on. So I changed the batteries in my TV remote, went to go turn my TV on, and as soon as I pressed the power button, not only did my TV turn on, my LED lights turned from blue to red. So basically, different buttons on my TV remote make my LED lights change certain colors. My up &amp; exit buttons turn them blue, as I said the power button makes them red, right and mute buttons make them purple, and select makes them white. So far, those are the only buttons that control the lights, but I only realized this recently. I have a Vizio smart TV, and these are the lights I bought off amazon: [LED](https://www.amazon.com/dp/B07PCR7LPS?ref=ppx_pop_mob_ap_share). If anyone else has this issue or knows how to fix it please let me know! I already tried unplugging my TV and lights and plugging them into different outlets, turning them on/off, keeping the LED lights off while I use the TV remote... It's kinda annoying more than anything to be honest. I wanna use the lights but if everytime I use my TV remote I don't want them changing colors I don't want and constantly having to change them back with the LED remote. The remote for the LED lights don't effect the TV though, as of now at least... It only works one way. So yeah if anyone can give me any info/advice I'd appreciate it!", "link": "https://www.reddit.com/r/technology/comments/gbwmb1/my_tv_remote_took_control_of_my_led_lights_help/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "my tv remote took control of my led lights... help! /!/ slast week i ordered those led light strips, i only ordered one to go along the wall above my -----> bed !!! . first couple nights everything was normal, then they started changing colors randomly on their own. i would be sitting with my lights on red for example, and they would randomly turn white. then on a different night, my tv was off and randomly turned on by itself so i decided to look up on google why it would do that. i found that when remote batteries are low, they send delayed signals so if i tried to turn on and it didn't work it might still send that signal later on. so i changed the batteries in my tv remote, went to go turn my tv on, and as soon as i pressed the power button, not only did my tv turn on, my led lights turned from blue to red. so basically, different buttons on my tv remote make my led lights change certain colors. my up &amp; exit buttons turn them blue, as i said the power button makes them red, right and mute buttons make them purple, and select makes them white. so far, those are the only buttons that control the lights, but i only realized this recently. i have a vizio smart tv, and these are the lights i bought off amazon: [led](https://www.amazon.com/dp/b07pcr7lps?ref=ppx_pop_mob_ap_share). if anyone else has this issue or knows how to fix it please let me know! i already tried unplugging my tv and lights and plugging them into different outlets, turning them on/off, keeping the led lights off while i use the tv remote... it's kinda annoying more than anything to be honest. i wanna use the lights but if everytime i use my tv remote i don't want them changing colors i don't want and constantly having to change them back with the led remote. the remote for the led lights don't effect the tv though, as of now at least... it only works one way. so yeah if anyone can give me any info/advice i'd appreciate it!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/gbwmb1/my_tv_remote_took_control_of_my_led_lights_help/',)", "identifyer": 5511993, "year": "2020"}, {"autor": "SCP-049Plaugeman", "date": 1604869523000, "content": "Sleep number is just the apple of beds prove me wrong(I guess it’s biotechnology I don’t know) /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/jqjkb5/sleep_number_is_just_the_apple_of_beds_prove_me/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "sleep number is just the apple of -----> beds !!!  prove me wrong(i guess it’s biotechnology i don’t know) /!/ [removed]", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/jqjkb5/sleep_number_is_just_the_apple_of_beds_prove_me/',)", "identifyer": 5516051, "year": "2020"}, {"autor": "GliAcountSonoInutili", "date": 1590768751000, "content": "Effort to join Silicon Valley tech giants including Facebook, Google, Microsoft and Amazon with the White House to fight the coronavirus stumbles: ‘An App Is Not Going to Fix This’ /!/ Tech’s First Big Plan to Tackle Covid-19 Stumbles: ‘An App Is Not Going to Fix This’\n\nEffort to join Silicon Valley tech giants including Facebook, Google, Microsoft and Amazon with the White House to fight the coronavirus is faltering\n\nSAN FRANCISCO—A heralded effort to bring together Silicon Valley tech giants, investors and the White House on tools to fight the new coronavirus is fizzling.\n\nIn March, a cohort of influential technology leaders formed a task force to devise tech solutions for the pandemic, a signal that the nation’s innovation engine was kicking into gear. Employees of Facebook Inc., FB -0.23% Alphabet Inc.’s GOOG +0.30% Google, Microsoft Corp. MSFT -0.08% and Amazon. AMZN +0.46% com Inc. were involved, along with the White House and famed venture investors.\n\nMonths later, the Technology and Research Task Force’s biggest plans, such as a hospital-bed tracker, contact-tracing tools and a project to ship Kindle devices to nursing-home residents, have failed to materialize amid what members say were disagreements over privacy and other issues. It has cycled through members and a leadership change, and some of the group’s biggest names, from Microsoft and Facebook to the White House, have dropped out or are playing minimal roles.\n\nMembers say that the experience has shown them that the tech industry can play an important supporting role as the world battles the coronavirus crisis, but technology alone won’t save the day.\n\n“An app is not going to fix this,” said John Borthwick, a New York-based venture capital investor who is now leading the group.\n\nJohn Borthwick, a venture capitalist who now heads the renamed Covid-19 Technology Task Force, said the group was ‘messy at the beginning.’\n\nThe task force had been working with developers building contact-tracing apps, one of its goals. When Apple Inc. AAPL -0.01% and Google later announced their own effort to help track infected people on behalf of governments, some members say they were taken aback. Some questioned its effectiveness and the companies’ ability to keep user information completely private, members said.\n\nMr. Borthwick took over the renamed Covid-19 Technology Task Force in late April. He said the group, formed amid the chaos of early March, was “messy at the beginning.” He is now refocusing its efforts on making connections and sharing information, rather than developing its own projects.\n\nThe group is organizing a virtual “hackathon,” to drive interest in tackling the issue of social isolation, and is hosting a series of online events on contact tracing with public health officials and other experts.\n\nAs they brought together representatives from tech giants and government in March, task force members harnessed the “save the world” ethos that for years has defined Silicon Valley.\n\nEveryone wanted to help. The biggest problem was managing the deluge of ideas pouring in from the tech community, members say.\n\nThe impetus for the task force came from Josh Mendelsohn, a former Google employee who founded the company’s disaster response program after Hurricane Katrina, working on a system that coordinated helicopter rescues across the Gulf states.\n\nNow a managing partner at the New York-based venture firm Hangar, Mr. Mendelsohn enlisted Ron Conway, an angel investor renowned in Silicon Valley for his early bets on Twitter Inc., Google and Facebook and his wide industry network.\n\nRon Conway, an angel investor renowned in Silicon Valley, was an early member of the task force.\n\nSome 45 people joined an early task force call in mid-March, including Michael Kratsios, the White House’s chief technology officer, and his deputy, Lynne Parker, along with representatives from the big tech companies.\n\nThe group soon ran into controversy: privacy. After seeing tech giants get hammered by regulators and lawmakers over data-collection practices pre-pandemic, conversations about tracking individuals’ virus exposure via cellphones and other initiatives got lost in policy and regulatory concerns.\n\nCaroline Buckee, a Harvard University epidemiologist and early member of the task force, said weekly Zoom meetings devolved into long discussions about privacy implications and best practices for data.\n\n“It was fragmented and it was unclear what the goals were,” Ms. Buckee said.\n\nShe and another early member, the geolocation startup Camber Systems, left the group to build a network of aggregated location data to help cities and states track how residents are moving around, called Covid-19 Mobility Data Network.\n\nPublic health authorities, developers and tech companies are working on apps to help us keep track of who we came in contact with and where we’ve been to aid in Covid-19 contact-tracing efforts. WSJ’s Joanna Stern explains the technologies using an 8-bit video game.\n\nThe April 10 announcement of the Apple-Google project further complicated efforts as members grew unsure about what to focus on next. Ms. Buckee of Harvard was among members who questioned whether the two companies’ opt-in system—which uses Bluetooth technology to track users’ cellphones and alert those who were exposed to virus carriers—would be effective as designed.\n\nMembers and executives at other companies contacted Apple and Google, skeptical that the effort would truly protect the privacy of users, or unsure that cities and states would opt for tech tools over human contact tracers.\n\nJulie Brill, privacy head at Microsoft, and Peter Lee, head of research and incubation, and not members of the task force, warned in a post on the company website that despite “rising excitement” about using technology to fight the pandemic, companies needed to consider evolving regulations as well as individuals’ comfort with sharing data.\n\n“Technical advances, such as the use of mobile phones to collect data of various kinds, need to be considered in the larger context of the complexity of the world,” the executives wrote.\n\nA Microsoft spokesman said, “nothing we’ve seen in the Apple and Google solution appears to violate the privacy principles in our blog post.”\n\nMr. Conway said he was “strongly in favor” of the Google and Apple project and said he wasn’t aware of anyone on the task force who wasn’t supportive of the companies’ efforts.\n\nA spokesman for Apple, speaking on behalf of both Apple and Google, said the technology isn’t a substitute for traditional, in-person contact tracing and “both companies are firmly grounded in the fact that it’s another tool at the disposal of public health agencies—not a silver bullet.”\n\nThe companies earlier this month released the technology supporting contact-tracing from mobile devices. Three states have requested access to the technology but no apps are available yet in the U.S. using the Apple-Google standard.\n\nStarting in late March, some task force members said they could no longer reach White House aides. Cities and states—not Washington—were making decisions over which technologies to use, making joint tech efforts even harder to manage.\n\nA spokeswoman for the White House said it hadn’t been involved with the group since the call in mid-March, noting that the administration is engaged with the tech industry, such as a partnership with International Business Machines Corp. and Amazon to offer free supercomputing resources to help develop virus treatments.\n\nThe group’s leader, Mr. Mendelsohn, was juggling volumes of email about the task force along with his day job—funding startups through Hangar—and family duties.\n\n“I finally had to cry uncle,” Mr. Mendelsohn said of his decision to step aside from running the group. “This is a job for people with grown kids.”\n\nThe task force now counts about 18 members in its working group in addition to Mr. Borthwick; 140 companies receive regular updates on its doings, Mr. Borthwick said. Everyone is a volunteer.\n\nIt has appointed a new advisory board, which includes Robert Iger, the former Walt Disney Company chief executive, and Leon Panetta, the former U.S. secretary of Defense. The board is involved “when they wish or when there’s something specific we need to ask them,” said Mr. Borthwick.\n\nA spokesman for Mr. Panetta said he was unavailable. A representative for Mr. Iger didn’t return a request for comment.\n\n“We are trying to bring a degree of modesty,” Mr. Borthwick said. “Less thinking of tech as a solution.”\n\n&amp;#x200B;\n\n[https://www.wsj.com/articles/techs-first-big-plan-to-tackle-covid-19-stumbles-an-app-is-not-going-to-fix-this-11590757102?mod=pls\\_whats\\_news\\_us\\_business\\_f](https://www.wsj.com/articles/techs-first-big-plan-to-tackle-covid-19-stumbles-an-app-is-not-going-to-fix-this-11590757102?mod=pls_whats_news_us_business_f)", "link": "https://www.reddit.com/r/technology/comments/gsvu59/effort_to_join_silicon_valley_tech_giants/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "effort to join silicon valley tech giants including facebook, google, microsoft and amazon with the white house to fight the coronavirus stumbles: ‘an app is not going to fix this’ /!/ tech’s first big plan to tackle covid-19 stumbles: ‘an app is not going to fix this’\n\neffort to join silicon valley tech giants including facebook, google, microsoft and amazon with the white house to fight the coronavirus is faltering\n\nsan francisco—a heralded effort to bring together silicon valley tech giants, investors and the white house on tools to fight the new coronavirus is fizzling.\n\nin march, a cohort of influential technology leaders formed a task force to devise tech solutions for the pandemic, a signal that the nation’s innovation engine was kicking into gear. employees of facebook inc., fb -0.23% alphabet inc.’s goog +0.30% google, microsoft corp. msft -0.08% and amazon. amzn +0.46% com inc. were involved, along with the white house and famed venture investors.\n\nmonths later, the technology and research task force’s biggest plans, such as a hospital------> bed !!!  tracker, contact-tracing tools and a project to ship kindle devices to nursing-home residents, have failed to materialize amid what members say were disagreements over privacy and other issues. it has cycled through members and a leadership change, and some of the group’s biggest names, from microsoft and facebook to the white house, have dropped out or are playing minimal roles.\n\nmembers say that the experience has shown them that the tech industry can play an important supporting role as the world battles the coronavirus crisis, but technology alone won’t save the day.\n\n“an app is not going to fix this,” said john borthwick, a new york-based venture capital investor who is now leading the group.\n\njohn borthwick, a venture capitalist who now heads the renamed covid-19 technology task force, said the group was ‘messy at the beginning.’\n\nthe task force had been working with developers building contact-tracing apps, one of its goals. when apple inc. aapl -0.01% and google later announced their own effort to help track infected people on behalf of governments, some members say they were taken aback. some questioned its effectiveness and the companies’ ability to keep user information completely private, members said.\n\nmr. borthwick took over the renamed covid-19 technology task force in late april. he said the group, formed amid the chaos of early march, was “messy at the beginning.” he is now refocusing its efforts on making connections and sharing information, rather than developing its own projects.\n\nthe group is organizing a virtual “hackathon,” to drive interest in tackling the issue of social isolation, and is hosting a series of online events on contact tracing with public health officials and other experts.\n\nas they brought together representatives from tech giants and government in march, task force members harnessed the “save the world” ethos that for years has defined silicon valley.\n\neveryone wanted to help. the biggest problem was managing the deluge of ideas pouring in from the tech community, members say.\n\nthe impetus for the task force came from josh mendelsohn, a former google employee who founded the company’s disaster response program after hurricane katrina, working on a system that coordinated helicopter rescues across the gulf states.\n\nnow a managing partner at the new york-based venture firm hangar, mr. mendelsohn enlisted ron conway, an angel investor renowned in silicon valley for his early bets on twitter inc., google and facebook and his wide industry network.\n\nron conway, an angel investor renowned in silicon valley, was an early member of the task force.\n\nsome 45 people joined an early task force call in mid-march, including michael kratsios, the white house’s chief technology officer, and his deputy, lynne parker, along with representatives from the big tech companies.\n\nthe group soon ran into controversy: privacy. after seeing tech giants get hammered by regulators and lawmakers over data-collection practices pre-pandemic, conversations about tracking individuals’ virus exposure via cellphones and other initiatives got lost in policy and regulatory concerns.\n\ncaroline buckee, a harvard university epidemiologist and early member of the task force, said weekly zoom meetings devolved into long discussions about privacy implications and best practices for data.\n\n“it was fragmented and it was unclear what the goals were,” ms. buckee said.\n\nshe and another early member, the geolocation startup camber systems, left the group to build a network of aggregated location data to help cities and states track how residents are moving around, called covid-19 mobility data network.\n\npublic health authorities, developers and tech companies are working on apps to help us keep track of who we came in contact with and where we’ve been to aid in covid-19 contact-tracing efforts. wsj’s joanna stern explains the technologies using an 8-bit video game.\n\nthe april 10 announcement of the apple-google project further complicated efforts as members grew unsure about what to focus on next. ms. buckee of harvard was among members who questioned whether the two companies’ opt-in system—which uses bluetooth technology to track users’ cellphones and alert those who were exposed to virus carriers—would be effective as designed.\n\nmembers and executives at other companies contacted apple and google, skeptical that the effort would truly protect the privacy of users, or unsure that cities and states would opt for tech tools over human contact tracers.\n\njulie brill, privacy head at microsoft, and peter lee, head of research and incubation, and not members of the task force, warned in a post on the company website that despite “rising excitement” about using technology to fight the pandemic, companies needed to consider evolving regulations as well as individuals’ comfort with sharing data.\n\n“technical advances, such as the use of mobile phones to collect data of various kinds, need to be considered in the larger context of the complexity of the world,” the executives wrote.\n\na microsoft spokesman said, “nothing we’ve seen in the apple and google solution appears to violate the privacy principles in our blog post.”\n\nmr. conway said he was “strongly in favor” of the google and apple project and said he wasn’t aware of anyone on the task force who wasn’t supportive of the companies’ efforts.\n\na spokesman for apple, speaking on behalf of both apple and google, said the technology isn’t a substitute for traditional, in-person contact tracing and “both companies are firmly grounded in the fact that it’s another tool at the disposal of public health agencies—not a silver bullet.”\n\nthe companies earlier this month released the technology supporting contact-tracing from mobile devices. three states have requested access to the technology but no apps are available yet in the u.s. using the apple-google standard.\n\nstarting in late march, some task force members said they could no longer reach white house aides. cities and states—not washington—were making decisions over which technologies to use, making joint tech efforts even harder to manage.\n\na spokeswoman for the white house said it hadn’t been involved with the group since the call in mid-march, noting that the administration is engaged with the tech industry, such as a partnership with international business machines corp. and amazon to offer free supercomputing resources to help develop virus treatments.\n\nthe group’s leader, mr. mendelsohn, was juggling volumes of email about the task force along with his day job—funding startups through hangar—and family duties.\n\n“i finally had to cry uncle,” mr. mendelsohn said of his decision to step aside from running the group. “this is a job for people with grown kids.”\n\nthe task force now counts about 18 members in its working group in addition to mr. borthwick; 140 companies receive regular updates on its doings, mr. borthwick said. everyone is a volunteer.\n\nit has appointed a new advisory board, which includes robert iger, the former walt disney company chief executive, and leon panetta, the former u.s. secretary of defense. the board is involved “when they wish or when there’s something specific we need to ask them,” said mr. borthwick.\n\na spokesman for mr. panetta said he was unavailable. a representative for mr. iger didn’t return a request for comment.\n\n“we are trying to bring a degree of modesty,” mr. borthwick said. “less thinking of tech as a solution.”\n\n&amp;#x200b;\n\n[https://www.wsj.com/articles/techs-first-big-plan-to-tackle-covid-19-stumbles-an-app-is-not-going-to-fix-this-11590757102?mod=pls\\_whats\\_news\\_us\\_business\\_f](https://www.wsj.com/articles/techs-first-big-plan-to-tackle-covid-19-stumbles-an-app-is-not-going-to-fix-this-11590757102?mod=pls_whats_news_us_business_f)", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/gsvu59/effort_to_join_silicon_valley_tech_giants/',)", "identifyer": 5516568, "year": "2020"}, {"autor": "frgedef", "date": 1598565127000, "content": "My dad says my laptop will overheat if I put I on my bed, will it? /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/ihuf4j/my_dad_says_my_laptop_will_overheat_if_i_put_i_on/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "my dad says my laptop will overheat if i put i on my -----> bed !!! , will it? /!/ [removed]", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ihuf4j/my_dad_says_my_laptop_will_overheat_if_i_put_i_on/',)", "identifyer": 5517524, "year": "2020"}, {"autor": "ndbutler", "date": 1596134115000, "content": "APPLE WATCH 4 SHIT THE BED /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/i0rge5/apple_watch_4_shit_the_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "apple watch 4 shit the -----> bed !!!  /!/ [removed]", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/i0rge5/apple_watch_4_shit_the_bed/',)", "identifyer": 5521916, "year": "2020"}, {"autor": "van_datascience", "date": 1584469254000, "content": "Homeless and on Tinder: I was using app just to get a bed, says tradie", "link": "https://www.reddit.com/r/technology/comments/fka6f0/homeless_and_on_tinder_i_was_using_app_just_to/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "homeless and on tinder: i was using app just to get a -----> bed !!! , says tradie", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('link',)", "medialink": "('https://www.abc.net.au/triplej/programs/hack/homeless-tradie-was-using-tinder-app-just-to-get-bed/8782640',)", "identifyer": 5532692, "year": "2020"}, {"autor": "cirkey", "date": 1585748099000, "content": "The AI coach for your bed room", "link": "https://www.reddit.com/r/technology/comments/fszvzz/the_ai_coach_for_your_bed_room/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "the ai coach for your -----> bed !!!  room", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://vay.ai/love.html',)", "identifyer": 5534809, "year": "2020"}, {"autor": "emio717", "date": 1591312501000, "content": "can anyone help me out? /!/ so  i got a problem\n\ni am using my laptop to listen to music when i am going to bed but when i close my laptop my airpods disconnect because the pc is shut down and i cant listen to music but how can i keep listening to my music?\n\njust like your phone you can still listen to music but on my laptop i cant does anyone have a slolution?", "link": "https://www.reddit.com/r/technology/comments/gwsokn/can_anyone_help_me_out/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "can anyone help me out? /!/ so  i got a problem\n\ni am using my laptop to listen to music when i am going to -----> bed !!!  but when i close my laptop my airpods disconnect because the pc is shut down and i cant listen to music but how can i keep listening to my music?\n\njust like your phone you can still listen to music but on my laptop i cant does anyone have a slolution?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 9, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/gwsokn/can_anyone_help_me_out/',)", "identifyer": 5535043, "year": "2020"}, {"autor": "TetsuOnii", "date": 1581193014000, "content": "3D Printer Question /!/ Hey everyone, I have a suggestion question. I am looking to get a 3D modeling printer. Just starting out right now and I am looking to spend around $400-500usd. Any suggestions would be very appreciated. I want something that has pretty good detail in modeling for the price, with a bed at least 6.5- 8inches. Thank you for your time.", "link": "https://www.reddit.com/r/technology/comments/f0x1ly/3d_printer_question/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "3d printer question /!/ hey everyone, i have a suggestion question. i am looking to get a 3d modeling printer. just starting out right now and i am looking to spend around $400-500usd. any suggestions would be very appreciated. i want something that has pretty good detail in modeling for the price, with a -----> bed !!!  at least 6.5- 8inches. thank you for your time.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/f0x1ly/3d_printer_question/',)", "identifyer": 5537609, "year": "2020"}, {"autor": "Gangliitis", "date": 1606348529000, "content": "Try This To Improve your Performance in Bed", "link": "https://www.reddit.com/r/technology/comments/k143x7/try_this_to_improve_your_performance_in_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "try this to improve your performance in -----> bed !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://cutt.ly/xhscCYj',)", "identifyer": 5548628, "year": "2020"}, {"autor": "SaltyTudor", "date": 1578754562000, "content": "OpenGL error /!/ \nI went to bed for like 2 hours and left Geometry Dash open. When i came back i tried to open it i got some weird Opengl error in chinese. I don’t visit weird sites and do virus scans pretty often. What is wrong?", "link": "https://www.reddit.com/r/technology/comments/en8ca0/opengl_error/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "opengl error /!/ \ni went to -----> bed !!!  for like 2 hours and left geometry dash open. when i came back i tried to open it i got some weird opengl error in chinese. i don’t visit weird sites and do virus scans pretty often. what is wrong?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/en8ca0/opengl_error/',)", "identifyer": 5549544, "year": "2020"}, {"autor": "this_is_a_throw_acc_", "date": 1583375079000, "content": "General Discussion: how many of you still use a computer for entertainment?? /!/ Hello, so let me explain, i have found that through my family, friends and even myself. I find most people have begun using a smartphone for most of their general computing. Obviously, if you need a computer for work purposes or something that you can't really do on a phone. But when it comes to general tasks, web browsing, YouTube / Netflix / Spotify. Other forms of just general entertainment things. How many of you actually still sit at a desk and use you're laptop and desktop ??\n\nI am kinda a little worried with the world going this way we will lose the classic desktop and laptop form factors. Whilst i do find myself using my phone quite a bit, i do love to sit at my desk, YouTube on a second screen with Reddit or Instagram on the main. Just sit and spend hours after school or work listening to music or watching YouTube and endlessly scrolling on Reddit.\n\nIs anyone else the same ?? i'm not saying phones are terrible. I love my phone and could not live without it. I spend many hours in bed scrolling. However, there is just something nice about the good old laptop and desktops at a desk.\n\nSo basically, i'm just wondering what people think about this whole idea of smartphones becoming way more popular than PC's. thankssssssssss.", "link": "https://www.reddit.com/r/technology/comments/fdo9wg/general_discussion_how_many_of_you_still_use_a/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "general discussion: how many of you still use a computer for entertainment?? /!/ hello, so let me explain, i have found that through my family, friends and even myself. i find most people have begun using a smartphone for most of their general computing. obviously, if you need a computer for work purposes or something that you can't really do on a phone. but when it comes to general tasks, web browsing, youtube / netflix / spotify. other forms of just general entertainment things. how many of you actually still sit at a desk and use you're laptop and desktop ??\n\ni am kinda a little worried with the world going this way we will lose the classic desktop and laptop form factors. whilst i do find myself using my phone quite a bit, i do love to sit at my desk, youtube on a second screen with reddit or instagram on the main. just sit and spend hours after school or work listening to music or watching youtube and endlessly scrolling on reddit.\n\nis anyone else the same ?? i'm not saying phones are terrible. i love my phone and could not live without it. i spend many hours in -----> bed !!!  scrolling. however, there is just something nice about the good old laptop and desktops at a desk.\n\nso basically, i'm just wondering what people think about this whole idea of smartphones becoming way more popular than pc's. thankssssssssss.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 28, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/fdo9wg/general_discussion_how_many_of_you_still_use_a/',)", "identifyer": 5550031, "year": "2020"}, {"autor": "DelayedProcessing", "date": 1591377815000, "content": "Is iPhone camera able to be monitored if I visit sketchy sites ? /!/ Recently I have been going on to different websites to read books and watch movies on those sites. I did not download any malware or anything and when the websites in particular directed to me to another site I got rid of the tab before it loaded. And I did not click on any links as well. I haven’t noticed any suspicious behaviour like losing photos, weird texts sending links, my phone freezes maybe one a week ? my phone froze once and a while before this. My phone battery gets drained but I think that’s normal because I’m always on it 24/7 with the brightness up high. So what happened was they were lots of annoying pop up ads that I chose to ignore. I do not use anti virus or Adblock on my phone. Are hackers able to get into my phone and access and monitor me through the camera. The other day I was getting off my bed and I unknowingly placed my phone under my skirt at certain angle..the thing is I was not wearing any panties :-/ \nTL:DR what is the likey hood my cooch could be hacked considering I going on dodgy sites ?", "link": "https://www.reddit.com/r/technology/comments/gx8uho/is_iphone_camera_able_to_be_monitored_if_i_visit/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "is iphone camera able to be monitored if i visit sketchy sites ? /!/ recently i have been going on to different websites to read books and watch movies on those sites. i did not download any malware or anything and when the websites in particular directed to me to another site i got rid of the tab before it loaded. and i did not click on any links as well. i haven’t noticed any suspicious behaviour like losing photos, weird texts sending links, my phone freezes maybe one a week ? my phone froze once and a while before this. my phone battery gets drained but i think that’s normal because i’m always on it 24/7 with the brightness up high. so what happened was they were lots of annoying pop up ads that i chose to ignore. i do not use anti virus or adblock on my phone. are hackers able to get into my phone and access and monitor me through the camera. the other day i was getting off my -----> bed !!!  and i unknowingly placed my phone under my skirt at certain angle..the thing is i was not wearing any panties :-/ \ntl:dr what is the likey hood my cooch could be hacked considering i going on dodgy sites ?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/gx8uho/is_iphone_camera_able_to_be_monitored_if_i_visit/',)", "identifyer": 5559997, "year": "2020"}, {"autor": "gadgetgets", "date": 1604046864000, "content": "Furhaven Orthopedic Dog Bed Plush Faux Fur", "link": "https://www.reddit.com/r/technology/comments/jkt0zw/furhaven_orthopedic_dog_bed_plush_faux_fur/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "furhaven orthopedic dog -----> bed !!!  plush faux fur", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/furhaven-orthopedic-dog-bed-plush-faux-fur/',)", "identifyer": 5562039, "year": "2020"}, {"autor": "Ordinary-Ad-7281", "date": 1603853192000, "content": "Deen Dayal Upadhyaya Gorakhpur University has declared a notification regarding DDU Gorakhpur entrance exam result 2020 for UG/PG/Bed courses. All students who want to take admission in the DDUGU Gorakhpur all attend this examination.", "link": "https://www.reddit.com/r/technology/comments/jjfuny/deen_dayal_upadhyaya_gorakhpur_university_has/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "deen dayal upadhyaya gorakhpur university has declared a notification regarding ddu gorakhpur entrance exam result 2020 for ug/pg/-----> bed !!!  courses. all students who want to take admission in the ddugu gorakhpur all attend this examination.", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://gosarkariresult.co.in/ddu-gorakhpur-entrance-exam-result-ddugu-entrance-exam-sarkari-result/',)", "identifyer": 5562322, "year": "2020"}, {"autor": "DocAndersen", "date": 1586426621000, "content": "So what does it mean when you awake to a box of goldfish in your bed?", "link": "https://www.reddit.com/r/technology/comments/fxpt9o/so_what_does_it_mean_when_you_awake_to_a_box_of/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "so what does it mean when you awake to a box of goldfish in your -----> bed !!! ?", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://virily.com/virily_poll/so-what-does-it-mean-when-you-awake-to-a-box-of-goldfish-in-your-bed/',)", "identifyer": 5564102, "year": "2020"}, {"autor": "gadgetgets", "date": 1600871662000, "content": "AmazonBasics Cool Elevated Pet Bed", "link": "https://www.reddit.com/r/technology/comments/iyb9uq/amazonbasics_cool_elevated_pet_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "amazonbasics cool elevated pet -----> bed !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/amazonbasics-cool-elevated-pet-bed/',)", "identifyer": 5567622, "year": "2020"}, {"autor": "bradgeorge", "date": 1606530627000, "content": "GAME CHANGING USB CABLE! I have always wished my phone charging cable wouldn't get in the way all time. Watching shows in bed at night, playing games on my phone, at work or in the car. This cable is awesome!!!", "link": "https://www.reddit.com/r/technology/comments/k2f84f/game_changing_usb_cable_i_have_always_wished_my/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "game changing usb cable! i have always wished my phone charging cable wouldn't get in the way all time. watching shows in -----> bed !!!  at night, playing games on my phone, at work or in the car. this cable is awesome!!!", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('link',)", "medialink": "('http://www.powerUP-charging.com',)", "identifyer": 5568616, "year": "2020"}, {"autor": "iammarksmith", "date": 1578604622000, "content": "Sleep Number’s Climate360 smart bed warms and cools sleepers for better comfort", "link": "https://www.reddit.com/r/technology/comments/emg44c/sleep_numbers_climate360_smart_bed_warms_and/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "sleep number’s climate360 smart -----> bed !!!  warms and cools sleepers for better comfort", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.digitaltrends.com/news/sleep-numbers-climate360-smart-bed-at-ces-2020/',)", "identifyer": 5572681, "year": "2020"}], "name": "bedtechnology2020"}