{"interestingcomments": [{"autor": "crazyibuy", "date": 1563520350000, "content": "Affinity Complete Bed with Metal Spindle Panels and Detailed Castings, Blackened Taupe Finish, Queen", "link": "https://www.reddit.com/r/technology/comments/cf4eq5/affinity_complete_bed_with_metal_spindle_panels/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "affinity complete -----> bed !!!  with metal spindle panels and detailed castings, blackened taupe finish, queen", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.crazyibuy.com/beds/headboards-footboards/affinity-complete-bed-with-metal-spindle-panels-and-detailed-castings-blackened-taupe-finish-queen/',)", "identifyer": 5761455, "year": "2019"}, {"autor": "ourlifeintoronto", "date": 1554472976000, "content": "Study Shows Screen Time Before Bed Is Not Bad For Teenagers", "link": "https://www.reddit.com/r/technology/comments/b9rkql/study_shows_screen_time_before_bed_is_not_bad_for/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "study shows screen time before -----> bed !!!  is not bad for teenagers", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 3, "media": "('nan',)", "medialink": "('https://www.bleepingcomputer.com/news/technology/study-shows-screen-time-before-bed-is-not-bad-for-teenagers/',)", "identifyer": 5765127, "year": "2019"}, {"autor": "tnn_media", "date": 1549795050000, "content": "Thailand launches 5G test bed with Huawei equipments, going against US advice|AB Web", "link": "https://www.reddit.com/r/technology/comments/ap2uwt/thailand_launches_5g_test_bed_with_huawei/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "thailand launches 5g test -----> bed !!!  with huawei equipments, going against us advice|ab web", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.asimblogger.com/2019/02/Thailand-launch-5G-test-bed-with-Huawei-equipments-going-agains-US-advice.html?m=1',)", "identifyer": 5765624, "year": "2019"}, {"autor": "spider_brain_guy", "date": 1550330469000, "content": "I'm a neuroscientist / former brain bank manager who's developing an app to help researchers spend less time glued to microscopes in the lab. Ask me anything! /!/ Hello reddit,\n\nI'm Dr Matthew Williams, a neuroscientist in the UK who has recently been developing [Segmentum Imaging](https://segmentumanalysisltd.com/), an attempt to move the slow and cumbersome methods of cell measurement into a more streamlined and neat system that you can use on a mobile device (meaning you can do it while lying in bed, watching TV or in the bar, rather than in a room with no windows and awful fluorescent lighting). We're hoping to launch our first version soon and are looking for people to try it and let us know what they think, or just people who've been stuck in lonely microscope rooms for untold hours to say what sort of features they'd like on such a system.  \n\nWhat's my background, though? \n\nSo after being a regular old neuroscientist for a few years I went up to full-on creepy neuroscientist when I inherited a huge human brain bank - a brief overview of this was described in a [Cracked article a few years ago](http://www.cracked.com/personal-experiences-1402-pe-brain-bank.html). More recently I got some very minor proxy fame in this parish by finding a tropical-spider egg sack on a banana and taking it to the local arachnid lab (as documented in a series of posts by /u/lagoon83, who's helping me stay on top of the AMA this evening: [1](https://www.reddit.com/r/whatsthisbug/comments/a0tvbb/midlands_uk_partners_brother_found_this_in_the/) [2](https://www.reddit.com/r/whatsthisbug/comments/a1mf97/update_spiderlab_got_back_to_us_with_a_photo_of/) [3](https://www.reddit.com/r/whatsthisbug/comments/adgsmj/update_the_banana_spiders_from_a_month_ago/) [4](https://www.reddit.com/r/whatsthisbug/comments/aqnkyc/another_update_the_banana_spiders_from_a_couple/)). \nMore recently, as well as developing some digital biotech as a startup, I'm now working on creating another brain bank - but this time, for much of the animal kingdom as part of an international collaboration.\n\nAs suggested by the mods, I've posted this ahead of time so people can start adding comments - I'll be  on here from 6pm GMT (1pm EST) and will stick around for a few hours to answer any questions you have about our app, digital pathology, my background, neuroscience in general, and whether I've summoned the strength of will to eat a banana recently. \n\nAsk me anything!   ", "link": "https://www.reddit.com/r/technology/comments/ar9oja/im_a_neuroscientist_former_brain_bank_manager/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "i'm a neuroscientist / former brain bank manager who's developing an app to help researchers spend less time glued to microscopes in the lab. ask me anything! /!/ hello reddit,\n\ni'm dr matthew williams, a neuroscientist in the uk who has recently been developing [segmentum imaging](https://segmentumanalysisltd.com/), an attempt to move the slow and cumbersome methods of cell measurement into a more streamlined and neat system that you can use on a mobile device (meaning you can do it while lying in -----> bed !!! , watching tv or in the bar, rather than in a room with no windows and awful fluorescent lighting). we're hoping to launch our first version soon and are looking for people to try it and let us know what they think, or just people who've been stuck in lonely microscope rooms for untold hours to say what sort of features they'd like on such a system.  \n\nwhat's my background, though? \n\nso after being a regular old neuroscientist for a few years i went up to full-on creepy neuroscientist when i inherited a huge human brain bank - a brief overview of this was described in a [cracked article a few years ago](http://www.cracked.com/personal-experiences-1402-pe-brain-bank.html). more recently i got some very minor proxy fame in this parish by finding a tropical-spider egg sack on a banana and taking it to the local arachnid lab (as documented in a series of posts by /u/lagoon83, who's helping me stay on top of the ama this evening: [1](https://www.reddit.com/r/whatsthisbug/comments/a0tvbb/midlands_uk_partners_brother_found_this_in_the/) [2](https://www.reddit.com/r/whatsthisbug/comments/a1mf97/update_spiderlab_got_back_to_us_with_a_photo_of/) [3](https://www.reddit.com/r/whatsthisbug/comments/adgsmj/update_the_banana_spiders_from_a_month_ago/) [4](https://www.reddit.com/r/whatsthisbug/comments/aqnkyc/another_update_the_banana_spiders_from_a_couple/)). \nmore recently, as well as developing some digital biotech as a startup, i'm now working on creating another brain bank - but this time, for much of the animal kingdom as part of an international collaboration.\n\nas suggested by the mods, i've posted this ahead of time so people can start adding comments - i'll be  on here from 6pm gmt (1pm est) and will stick around for a few hours to answer any questions you have about our app, digital pathology, my background, neuroscience in general, and whether i've summoned the strength of will to eat a banana recently. \n\nask me anything!   ", "sortedWord": "None", "removed": "('nan',)", "score": 256, "comments": 316, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ar9oja/im_a_neuroscientist_former_brain_bank_manager/',)", "identifyer": 5771664, "year": "2019"}, {"autor": "bettorworse", "date": 1550326840000, "content": "Stay in your bed lane", "link": "https://www.reddit.com/r/technology/comments/ar967g/stay_in_your_bed_lane/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "stay in your -----> bed !!!  lane", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('link',)", "medialink": "('https://www.theverge.com/2019/2/13/18223829/ford-lane-keeping-bed-mattress-couples',)", "identifyer": 5771672, "year": "2019"}, {"autor": "gop_15279", "date": 1552845890000, "content": "प्राथमिक शैक्षिक खबर -:- Bed Entrance exam 2019: बीएड प्रवेश परीक्षा में रिकॉर्ड 6 लाख 22 हजार आवेदन https://prathamikshaikshikkhabar.blogspot.com/2019/03/bed-entrance-exam-2019-6-22.html?m=1", "link": "https://www.reddit.com/r/technology/comments/b27yup/परथमक_शकषक_खबर_bed_entrance_exam_2019_बएड_परवश/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "प्राथमिक शैक्षिक खबर -:- -----> bed !!!  entrance exam 2019: बीएड प्रवेश परीक्षा में रिकॉर्ड 6 लाख 22 हजार आवेदन https://prathamikshaikshikkhabar.blogspot.com/2019/03/bed-entrance-exam-2019-6-22.html?m=1", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://prathamikshaikshikkhabar.blogspot.com/2019/03/bed-entrance-exam-2019-6-22.html?m=1',)", "identifyer": 5772208, "year": "2019"}, {"autor": "Adamscots", "date": 1550136292000, "content": "Is sofa cum bed good option for small space?", "link": "https://www.reddit.com/r/technology/comments/aqhzyd/is_sofa_cum_bed_good_option_for_small_space/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "is sofa cum -----> bed !!!  good option for small space?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.letsdiskuss.com/is-sofa-cum-bed-good-option-for-small-space',)", "identifyer": 5772652, "year": "2019"}, {"autor": "AnonManBot", "date": 1551294029000, "content": "Microsoft Defends Jumping in AR Bed With Military", "link": "https://www.reddit.com/r/technology/comments/avh01b/microsoft_defends_jumping_in_ar_bed_with_military/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "microsoft defends jumping in ar -----> bed !!!  with military", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://ronsortech.blogspot.com/2019/02/microsoft-defends-jumping-in-ar-bed.html',)", "identifyer": 5775609, "year": "2019"}, {"autor": "verylittlemrmushnik", "date": 1566163562000, "content": "Router/ WIFI Password changed on its own? /!/ Last night before bed my thermostat sent me a notification saying “invalid WiFi password”. Went and checked everything and none of my devices would connect. Tried to connect to the WiFi on my phone and it wouldn’t take the old password. No problem and went online and changed it immediately. But I’m still wondering how this could have happened.", "link": "https://www.reddit.com/r/technology/comments/cs7cn7/router_wifi_password_changed_on_its_own/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "router/ wifi password changed on its own? /!/ last night before -----> bed !!!  my thermostat sent me a notification saying “invalid wifi password”. went and checked everything and none of my devices would connect. tried to connect to the wifi on my phone and it wouldn’t take the old password. no problem and went online and changed it immediately. but i’m still wondering how this could have happened.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/cs7cn7/router_wifi_password_changed_on_its_own/',)", "identifyer": 5776362, "year": "2019"}, {"autor": "lucypinho", "date": 1577102302000, "content": "Rapidly Growing Telemedicine has Investors on their Heels /!/ The concept of telemedicine has evolved in recent years. As people are demanding easier ways to avail medical treatment and diagnosis, there have been several advances in telemedicine. Telemedicine is a method that involves providing clinical services through a distance. Through telemedicine, the user doesn’t necessarily have to be present at the hospital or clinic and can avail medical consultation through the comfort of his home.\n\nEarlier, telemedicine was used for treating people in remote places as well as people who could not afford or access modes of hospital visits. But as time progressed and telemedicine systems advanced, analysts were able to unfold the true potential held by these systems.\n\n**Cloud Access and Smartphones Have Laid a Collaborative Foundation for Telemedicine**\n\nAs the number of smartphone users has risen significantly in the past decade, almost all computer-operating software are being integrated into mobile OS as well. The advancements in smartphones have been exceptional, so much so that people would now prefer to have a smartphone that would do the work of a computer, rather than using the actual computer. Technology has played a key role in the recent surge in the adoption of smartphones. Cloud integration is among the long lists of benefits offered by smartphones.\n\nCloud integration, combined with the availability of fast data networks among many regions in the world, has opened up a broader scope of advancements for telemedicine. Could-integrated systems enable the elimination of a locally installed physical drive. These factors significantly reduce the cost and space associated with the functioning of telemedicine.\n\n**‘Remote Patient Monitoring’ Among the Key Benefits Offered by Telemedicine Services**\n\nTelemedicine allows medical examination and consultation of patients residing almost anywhere in the world. With minimal operational pre-requisites, telemedicine services offer massive benefits such as improved efficiency, faster diagnosis, precise medication, and consultation. Remote patient monitoring is one of the primary benefits of telemedicine. Through video-enabled platforms, doctors or related personnel can interact with the patient residing almost anywhere in the world.\n\nConcepts such as constant monitoring and updates allow more frequent consultation. Patients do not necessarily have to travel longer distances again and again. These benefits save a huge amount of time and money, which would have been much higher in cases of hospital visits. Patients who are bed-ridden and physically disabled can benefit hugely from remote patient monitoring. As a result, telemedicine services are gaining more popularity in the coming years.\n\nBesides remote patient monitoring, telemedicine possesses several other benefits. The main reason behind the rise of the telemedicine industry is the flexibility and comfort that it offers. The advances in telemedicine largely favor geriatric population. Additionally, people who cannot afford services such as hospital visits, high costs of in-hospital stays, and on-the-stop doctor consultation will also contribute to the growing popularity of telemedicine.\n\n**A few of the other benefits offered by telemedicine include:**\n\n·        Reimbursement policies\n\n·        Flexibility in scheduling doctor consultation\n\n·        Improved access to care\n\n·        Reduced administrative tasks\n\n·        Patient tracking and monitoring\n\n·        Cases of natural disasters\n\n**Telemedicine Holds Massive Potential in Disaster Management**\n\nThe use of telemedicine is not just limited to bed-ridden patients. Events such as natural disasters hold a huge potential for telemedicine and telemedicine consultation services. In cases of floods, earthquakes, and other disasters, it is difficult for people to travel to the hospital or even consult doctors in clinics, for that matter. Moreover, natural disasters such as tsunamis leave people exposed to viral diseases.\n\nThe chances of epidemics are higher during these events. In such cases, telemedicine can help people avail medical services at the comfort of their homes and avoid outdoor hospital visits. This helps in reducing the risks associated with infections and epidemic diseases. With technology at the fore of several telemedicine services, there is a significant rise in the efficacies associated with these services.\n\n**As Telemedicine Are Gaining Popularity, Diverse Healthcare Markets to Open Up**\n\nAs telemedicine is growing in popularity, investors are likely to hover around. Telemedicine will open up several markets in the healthcare industry, pertaining to nurses, insurers, therapists, and physicians. The advances in technologies, backing from governments, high investment, and a growing R&amp;D emphasis will all contribute to the development of telemedicine in the forthcoming years.\n\n**Sources:**\n\n1. **Fortune Business Insights-** Telemedicine Market Research Report 2026\n2. **Marketwatch-** Telemedicine Market Global Leading Players, Industry Updates, Future Growth, Business Prospects, Developments by Forecast to 2026", "link": "https://www.reddit.com/r/technology/comments/eejqmh/rapidly_growing_telemedicine_has_investors_on/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "rapidly growing telemedicine has investors on their heels /!/ the concept of telemedicine has evolved in recent years. as people are demanding easier ways to avail medical treatment and diagnosis, there have been several advances in telemedicine. telemedicine is a method that involves providing clinical services through a distance. through telemedicine, the user doesn’t necessarily have to be present at the hospital or clinic and can avail medical consultation through the comfort of his home.\n\nearlier, telemedicine was used for treating people in remote places as well as people who could not afford or access modes of hospital visits. but as time progressed and telemedicine systems advanced, analysts were able to unfold the true potential held by these systems.\n\n**cloud access and smartphones have laid a collaborative foundation for telemedicine**\n\nas the number of smartphone users has risen significantly in the past decade, almost all computer-operating software are being integrated into mobile os as well. the advancements in smartphones have been exceptional, so much so that people would now prefer to have a smartphone that would do the work of a computer, rather than using the actual computer. technology has played a key role in the recent surge in the adoption of smartphones. cloud integration is among the long lists of benefits offered by smartphones.\n\ncloud integration, combined with the availability of fast data networks among many regions in the world, has opened up a broader scope of advancements for telemedicine. could-integrated systems enable the elimination of a locally installed physical drive. these factors significantly reduce the cost and space associated with the functioning of telemedicine.\n\n**‘remote patient monitoring’ among the key benefits offered by telemedicine services**\n\ntelemedicine allows medical examination and consultation of patients residing almost anywhere in the world. with minimal operational pre-requisites, telemedicine services offer massive benefits such as improved efficiency, faster diagnosis, precise medication, and consultation. remote patient monitoring is one of the primary benefits of telemedicine. through video-enabled platforms, doctors or related personnel can interact with the patient residing almost anywhere in the world.\n\nconcepts such as constant monitoring and updates allow more frequent consultation. patients do not necessarily have to travel longer distances again and again. these benefits save a huge amount of time and money, which would have been much higher in cases of hospital visits. patients who are -----> bed !!! -ridden and physically disabled can benefit hugely from remote patient monitoring. as a result, telemedicine services are gaining more popularity in the coming years.\n\nbesides remote patient monitoring, telemedicine possesses several other benefits. the main reason behind the rise of the telemedicine industry is the flexibility and comfort that it offers. the advances in telemedicine largely favor geriatric population. additionally, people who cannot afford services such as hospital visits, high costs of in-hospital stays, and on-the-stop doctor consultation will also contribute to the growing popularity of telemedicine.\n\n**a few of the other benefits offered by telemedicine include:**\n\n·        reimbursement policies\n\n·        flexibility in scheduling doctor consultation\n\n·        improved access to care\n\n·        reduced administrative tasks\n\n·        patient tracking and monitoring\n\n·        cases of natural disasters\n\n**telemedicine holds massive potential in disaster management**\n\nthe use of telemedicine is not just limited to bed-ridden patients. events such as natural disasters hold a huge potential for telemedicine and telemedicine consultation services. in cases of floods, earthquakes, and other disasters, it is difficult for people to travel to the hospital or even consult doctors in clinics, for that matter. moreover, natural disasters such as tsunamis leave people exposed to viral diseases.\n\nthe chances of epidemics are higher during these events. in such cases, telemedicine can help people avail medical services at the comfort of their homes and avoid outdoor hospital visits. this helps in reducing the risks associated with infections and epidemic diseases. with technology at the fore of several telemedicine services, there is a significant rise in the efficacies associated with these services.\n\n**as telemedicine are gaining popularity, diverse healthcare markets to open up**\n\nas telemedicine is growing in popularity, investors are likely to hover around. telemedicine will open up several markets in the healthcare industry, pertaining to nurses, insurers, therapists, and physicians. the advances in technologies, backing from governments, high investment, and a growing r&amp;d emphasis will all contribute to the development of telemedicine in the forthcoming years.\n\n**sources:**\n\n1. **fortune business insights-** telemedicine market research report 2026\n2. **marketwatch-** telemedicine market global leading players, industry updates, future growth, business prospects, developments by forecast to 2026", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/eejqmh/rapidly_growing_telemedicine_has_investors_on/',)", "identifyer": 5778070, "year": "2019"}, {"autor": "TwistedMilkMan", "date": 1560118620000, "content": "Bugs in the walls not my balls /!/ Looking for any videos or personal help with K18 GPS/spy/monitor detector. I keep getting hits on same spot above my bed. I have device set to very low setting for RF.  I have video showing this along with me moving meters antenna less than an inch away and it goes from full on alert to nothing (repeated many times). I’m disabled and have to live with parents (I can’t get to small hole I covered with painters tape I applied with long stick). Dealing with gaslighting, also no longer aloud to have friends to parents house on large property (for no reason, honestly). Any help/advice is appreciated thanks for hanging in and reading long post.", "link": "https://www.reddit.com/r/technology/comments/bypwcs/bugs_in_the_walls_not_my_balls/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "bugs in the walls not my balls /!/ looking for any videos or personal help with k18 gps/spy/monitor detector. i keep getting hits on same spot above my -----> bed !!! . i have device set to very low setting for rf.  i have video showing this along with me moving meters antenna less than an inch away and it goes from full on alert to nothing (repeated many times). i’m disabled and have to live with parents (i can’t get to small hole i covered with painters tape i applied with long stick). dealing with gaslighting, also no longer aloud to have friends to parents house on large property (for no reason, honestly). any help/advice is appreciated thanks for hanging in and reading long post.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bypwcs/bugs_in_the_walls_not_my_balls/',)", "identifyer": 5778315, "year": "2019"}, {"autor": "ourlifeintoronto", "date": 1554524234000, "content": "Screen time -- even before bed -- has little impact on teen well-being", "link": "https://www.reddit.com/r/technology/comments/ba0ncv/screen_time_even_before_bed_has_little_impact_on/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "screen time -- even before -----> bed !!!  -- has little impact on teen well-being", "sortedWord": "None", "removed": "('nan',)", "score": 34, "comments": 12, "media": "('nan',)", "medialink": "('https://www.sciencedaily.com/releases/2019/04/190405080922.htm',)", "identifyer": 5783783, "year": "2019"}, {"autor": "SottileDesign", "date": 1554524011000, "content": "How will Chatbots in Hotel Enhance Guest Experiences? Pro &amp; Cons? /!/ Hi there -\n\nI am researching on how **Chatbots** could improve Hotels guest experience and simplifies concierge daily tasks.\n\n&amp;#x200B;\n\nThe language barriers have a negative *impact* on the customer's experience and concierge time-consuming. Am I right?\n\n&amp;#x200B;\n\nWould you be happy to ask or book anything while you laying on the bed?\n\n* Find the nearest restaurant - *recommends* from the Hotel\n* Book a car service, tours or spa - *recommends* from the Hotel\n* Late Checkout or extend your stay.\n\n&amp;#x200B;\n\nWould you be happy if a Chabot could speak perfect Chinese, Japanese, Russian, English...??\n\n&amp;#x200B;\n\nLet’s image you just arrived in NYC and you are in your comfortable hotel room relaxing after taking a nice shower. What’s the next? \n\n* You hungry and you are looking for a restaurant?\n* You want to sleep.\n* Want you find a cocktails bar?\n* You need to know where is the nearest Pharmacy\n\n&amp;#x200B;\n\nWould you be happy to Chat with the Hotel Virtual Assistance and ask: *Where is the nearest Sushi restaurant?* \n\nOr do you prefer to get out of the room and go ask to the concierge? \n\n&amp;#x200B;\n\nYour **feedback** will be very important. Let me know what do you think, please. Be honest :)\n\nThank you all!\n\nP.", "link": "https://www.reddit.com/r/technology/comments/ba0m9l/how_will_chatbots_in_hotel_enhance_guest/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "how will chatbots in hotel enhance guest experiences? pro &amp; cons? /!/ hi there -\n\ni am researching on how **chatbots** could improve hotels guest experience and simplifies concierge daily tasks.\n\n&amp;#x200b;\n\nthe language barriers have a negative *impact* on the customer's experience and concierge time-consuming. am i right?\n\n&amp;#x200b;\n\nwould you be happy to ask or book anything while you laying on the -----> bed !!! ?\n\n* find the nearest restaurant - *recommends* from the hotel\n* book a car service, tours or spa - *recommends* from the hotel\n* late checkout or extend your stay.\n\n&amp;#x200b;\n\nwould you be happy if a chabot could speak perfect chinese, japanese, russian, english...??\n\n&amp;#x200b;\n\nlet’s image you just arrived in nyc and you are in your comfortable hotel room relaxing after taking a nice shower. what’s the next? \n\n* you hungry and you are looking for a restaurant?\n* you want to sleep.\n* want you find a cocktails bar?\n* you need to know where is the nearest pharmacy\n\n&amp;#x200b;\n\nwould you be happy to chat with the hotel virtual assistance and ask: *where is the nearest sushi restaurant?* \n\nor do you prefer to get out of the room and go ask to the concierge? \n\n&amp;#x200b;\n\nyour **feedback** will be very important. let me know what do you think, please. be honest :)\n\nthank you all!\n\np.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ba0m9l/how_will_chatbots_in_hotel_enhance_guest/',)", "identifyer": 5783785, "year": "2019"}, {"autor": "nirnfruit", "date": 1550283263000, "content": "please help me with fixing my video editor /!/  i got a video editor and i used it a lot and i made a lot of stuff with  it but one day a video was rendering but it froze so i  did ctrl alt  delete but after i closed it i went to bed because it was like 1:00 am  when i woke up i found that it would not open like at all i deleted the  file that froze it but it still wont open then i uninstalled it and  reinstalled but that did not work then i use system restore but that did  not work i don't know what to do please help (the video editor i was  using was move studio 15 platinum) ", "link": "https://www.reddit.com/r/technology/comments/ar466e/please_help_me_with_fixing_my_video_editor/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "please help me with fixing my video editor /!/  i got a video editor and i used it a lot and i made a lot of stuff with  it but one day a video was rendering but it froze so i  did ctrl alt  delete but after i closed it i went to -----> bed !!!  because it was like 1:00 am  when i woke up i found that it would not open like at all i deleted the  file that froze it but it still wont open then i uninstalled it and  reinstalled but that did not work then i use system restore but that did  not work i don't know what to do please help (the video editor i was  using was move studio 15 platinum) ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ar466e/please_help_me_with_fixing_my_video_editor/',)", "identifyer": 5785749, "year": "2019"}, {"autor": "AAAReviews", "date": 1546736852000, "content": "Turn off children's gadgets an hour before bed, parents warned", "link": "https://www.reddit.com/r/technology/comments/ad0leh/turn_off_childrens_gadgets_an_hour_before_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "turn off children's gadgets an hour before -----> bed !!! , parents warned", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://aaareviews.website/2019/01/06/turn-off-childrens-gadgets-an-hour-before-bed-parents-warned/',)", "identifyer": 5789184, "year": "2019"}, {"autor": "ladster9600", "date": 1565588712000, "content": "Pretty nice bed you got there.", "link": "https://www.reddit.com/r/technology/comments/cp85ou/pretty_nice_bed_you_got_there/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "pretty nice -----> bed !!!  you got there.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://i.imgur.com/p36bMP2.gifv',)", "identifyer": 5789787, "year": "2019"}, {"autor": "LizMcIntyre", "date": 1547566660000, "content": "Google Play / Apple Store App promises to make duplicates of all kinds of keys and even RFID access badges, then mail them to you /!/ I ran into this app while checking out this OnComp column that talks about Startpage.com. It's in the section titled \"App Happy.\" The author writes:\n\n    “KeyMe” lets users scan their house or car keys and order a duplicate to be sent in the mail. They also have kiosks in places like 7-Eleven and Bed Bath and Beyond, where the key is duplicated on the spot.\n\nThe App website has an interesting FAQ section that addresses \"do not duplicate\" keys:\n\n    Can I copy \"Do Not Duplicate\" keys?\n\n    Yes, KeyMe can copy any key marked 'Do Not Duplicate.' The reason is that the 'Do Not Duplicate' marking carries with it no greater security than any other brass key. The Associated Locksmiths of America (ALOA) has gone so far as to call the use of such markings \"deceptive\" because they provide \"a false sense of security.\" It further advises its members to handle these keys in the same manner as any other key. The only exception to this is within the Los Angeles city limits. Due to a city ordinance, these keys may not be copied. For more information about Do Not Duplicate keys, and other secure key varieties, visit our blog today! Read More!\n\nThe App also advertises the following regarding RFID keys/access:\n\n    We Copy Access Cards and Key Fobs\n\n    We can clone and duplicate most RFID Keys that are commonly used today\n\n    Turn Your Fob into a Sticker\n\n    If you are sick of carrying around your keys, KeyMe can make your RFID into a sticker. With a sticker about the size of a silver dollar, you can turn your phone or wallet into a house key!\n\n    We simply code your RFID into a sticker instead of a fob or card, that works just like the original.\n\nHere's how they reportedly prevent fraud:\n\n    How does KeyMe prevent fraudulent key copying?\n\n    KeyMe is the most convenient and secure way to duplicate keys. Our kiosks require a fingerprint scan and/or a credit card swipe to access scanned keys. Like an ATM, all transactions are recorded to provide an added layer of security. Our mobile app requires keys be scanned on both sides on a white paper background from 4 inches away to prevent \"flyby\" scans of your keys. We provide real-time notifications any time new activity occurs on your account so you can monitor &amp; manage the security of your keys. When ordering keys, we store only the necessary personal information on file and keep no information that could be used to link your key with a location or lock. If you have any additional questions regarding security, contact us!\n\nThoughts?\n", "link": "https://www.reddit.com/r/technology/comments/ag9poa/google_play_apple_store_app_promises_to_make/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "google play / apple store app promises to make duplicates of all kinds of keys and even rfid access badges, then mail them to you /!/ i ran into this app while checking out this oncomp column that talks about startpage.com. it's in the section titled \"app happy.\" the author writes:\n\n    “keyme” lets users scan their house or car keys and order a duplicate to be sent in the mail. they also have kiosks in places like 7-eleven and -----> bed !!!  bath and beyond, where the key is duplicated on the spot.\n\nthe app website has an interesting faq section that addresses \"do not duplicate\" keys:\n\n    can i copy \"do not duplicate\" keys?\n\n    yes, keyme can copy any key marked 'do not duplicate.' the reason is that the 'do not duplicate' marking carries with it no greater security than any other brass key. the associated locksmiths of america (aloa) has gone so far as to call the use of such markings \"deceptive\" because they provide \"a false sense of security.\" it further advises its members to handle these keys in the same manner as any other key. the only exception to this is within the los angeles city limits. due to a city ordinance, these keys may not be copied. for more information about do not duplicate keys, and other secure key varieties, visit our blog today! read more!\n\nthe app also advertises the following regarding rfid keys/access:\n\n    we copy access cards and key fobs\n\n    we can clone and duplicate most rfid keys that are commonly used today\n\n    turn your fob into a sticker\n\n    if you are sick of carrying around your keys, keyme can make your rfid into a sticker. with a sticker about the size of a silver dollar, you can turn your phone or wallet into a house key!\n\n    we simply code your rfid into a sticker instead of a fob or card, that works just like the original.\n\nhere's how they reportedly prevent fraud:\n\n    how does keyme prevent fraudulent key copying?\n\n    keyme is the most convenient and secure way to duplicate keys. our kiosks require a fingerprint scan and/or a credit card swipe to access scanned keys. like an atm, all transactions are recorded to provide an added layer of security. our mobile app requires keys be scanned on both sides on a white paper background from 4 inches away to prevent \"flyby\" scans of your keys. we provide real-time notifications any time new activity occurs on your account so you can monitor &amp; manage the security of your keys. when ordering keys, we store only the necessary personal information on file and keep no information that could be used to link your key with a location or lock. if you have any additional questions regarding security, contact us!\n\nthoughts?\n", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ag9poa/google_play_apple_store_app_promises_to_make/',)", "identifyer": 5789920, "year": "2019"}, {"autor": "trot-trot", "date": 1571216495000, "content": "Somnox sleep robot – like being in bed with a baby Darth Vader", "link": "https://www.reddit.com/r/technology/comments/diml2l/somnox_sleep_robot_like_being_in_bed_with_a_baby/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "somnox sleep robot – like being in -----> bed !!!  with a baby darth vader", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 2, "media": "('link',)", "medialink": "('https://www.theguardian.com/lifeandstyle/2019/oct/15/somnox-sleep-robot-like-being-in-bed-with-a-baby-darth-vader',)", "identifyer": 5793026, "year": "2019"}, {"autor": "sasquatchoo", "date": 1573579300000, "content": "Need help choosing way to play music in son's room /!/ Hi all,  I have a 5 year old son,  and I want to be able to play music for him in his room at night when he goes to bed to help him sleep.  I need help figuring out a good way to do this.  I'm sure there's an obvious simple answer to this, but I can't really think of something simple.    My best solution is to get him a tablet, install spotify on it, and then play it thru a bluetooth speaker.   This seems like it could get expensive tho unless I could find something relatively inexpensive, although I still want good sound.  I don't want to have to play music through my phone or laptop because then I wouldn't be able to use them after he goes to bed.   Anybody have any suggestions and any recommendations on decent bluetooth speakers under $100? If I get him a tablet I would want to get a kid friendly one as well.  Thanks for any input!", "link": "https://www.reddit.com/r/technology/comments/dvd2bu/need_help_choosing_way_to_play_music_in_sons_room/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "need help choosing way to play music in son's room /!/ hi all,  i have a 5 year old son,  and i want to be able to play music for him in his room at night when he goes to -----> bed !!!  to help him sleep.  i need help figuring out a good way to do this.  i'm sure there's an obvious simple answer to this, but i can't really think of something simple.    my best solution is to get him a tablet, install spotify on it, and then play it thru a bluetooth speaker.   this seems like it could get expensive tho unless i could find something relatively inexpensive, although i still want good sound.  i don't want to have to play music through my phone or laptop because then i wouldn't be able to use them after he goes to bed.   anybody have any suggestions and any recommendations on decent bluetooth speakers under $100? if i get him a tablet i would want to get a kid friendly one as well.  thanks for any input!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dvd2bu/need_help_choosing_way_to_play_music_in_sons_room/',)", "identifyer": 5797871, "year": "2019"}, {"autor": "bryan_ripj", "date": 1573400726000, "content": "How long does a LED light last /!/ so I bought a Bed the other day with one of those installed LED lights and a controller for the different colors and settings\n\nand was wondering since there doesnt seem to be an opening to switch batteries in my bed somewhere \n\nhow long will that bed light last? can it be replaced/recharged?", "link": "https://www.reddit.com/r/technology/comments/dud0ki/how_long_does_a_led_light_last/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "how long does a led light last /!/ so i bought a -----> bed !!!  the other day with one of those installed led lights and a controller for the different colors and settings\n\nand was wondering since there doesnt seem to be an opening to switch batteries in my -----> bed !!!  somewhere \n\nhow long will that -----> bed !!!  light last? can it be replaced/recharged?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dud0ki/how_long_does_a_led_light_last/',)", "identifyer": 5797959, "year": "2019"}, {"autor": "Zemarkio", "date": 1548729727000, "content": "Tablet Mount /!/ Hello!\n\nI’ve recently become acutely disabled. As my symptoms have progressed, sitting at a desk causes significant pain within 30 minutes. I’ve been using my 12.9” iPad Pro in bed, but it is challenging because I cannot hold my tablet up for extended periods of time. Even just sitting it on my body, my hand hurts from overuse. I also lose maybe 20-30% of the bottom portion of the screen because I cannot move my neck. \n\nI’ve been trying to locate a holder of some sort that would, hopefully, attach to my bed and allow me to easily watch videos without having to hold the iPad. I am not opposed to a floor standing mount, but I’m not sure if a wall mount solution would work or not (it would need to extend at least 36”). My search has been somewhat fruitless (low quality reviews or does not support 12.9”). \n\nDoes anyone have any suggestions or knowledge of alternatives? I’m sorry if this is the wrong place. I didn’t know where to post or try to find information. If this is the inappropriate place, please let me know and I’ll try to post in the right forum. \n\nThank you for any assistance. It’s appreciated. ", "link": "https://www.reddit.com/r/technology/comments/akvfg3/tablet_mount/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "tablet mount /!/ hello!\n\ni’ve recently become acutely disabled. as my symptoms have progressed, sitting at a desk causes significant pain within 30 minutes. i’ve been using my 12.9” ipad pro in -----> bed !!! , but it is challenging because i cannot hold my tablet up for extended periods of time. even just sitting it on my body, my hand hurts from overuse. i also lose maybe 20-30% of the bottom portion of the screen because i cannot move my neck. \n\ni’ve been trying to locate a holder of some sort that would, hopefully, attach to my bed and allow me to easily watch videos without having to hold the ipad. i am not opposed to a floor standing mount, but i’m not sure if a wall mount solution would work or not (it would need to extend at least 36”). my search has been somewhat fruitless (low quality reviews or does not support 12.9”). \n\ndoes anyone have any suggestions or knowledge of alternatives? i’m sorry if this is the wrong place. i didn’t know where to post or try to find information. if this is the inappropriate place, please let me know and i’ll try to post in the right forum. \n\nthank you for any assistance. it’s appreciated. ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/akvfg3/tablet_mount/',)", "identifyer": 5798585, "year": "2019"}, {"autor": "everocks", "date": 1560428689000, "content": "Weird beeping? /!/ This happened just now.\n\nSo I’m laying in bed watching YouTube  and suddenly I hear beeping. its also high pitched. \n\nIt goes: *beep........... beep........ beep........beep........beep.....beep.....beep....beep..beep..beep. Beep. Beep. Beep beep beep beepbeepbeepbeepbeep.*\n\nI low key thought I was gonna die cos I thought maybe it was a bomb or something lol. Ik it wasn’t my YouTube video coz I paused it and *beep*. Ik i wasn’t just hearing things either. It sounded like it was coming from my blanket. But it wasn’t muffled. It was clear as day. Please help figure this out. I’m also gonna post this on r/whatisthis", "link": "https://www.reddit.com/r/technology/comments/c0562v/weird_beeping/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "weird beeping? /!/ this happened just now.\n\nso i’m laying in -----> bed !!!  watching youtube  and suddenly i hear beeping. its also high pitched. \n\nit goes: *beep........... beep........ beep........beep........beep.....beep.....beep....beep..beep..beep. beep. beep. beep beep beep beepbeepbeepbeepbeep.*\n\ni low key thought i was gonna die cos i thought maybe it was a bomb or something lol. ik it wasn’t my youtube video coz i paused it and *beep*. ik i wasn’t just hearing things either. it sounded like it was coming from my blanket. but it wasn’t muffled. it was clear as day. please help figure this out. i’m also gonna post this on r/whatisthis", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 16, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/c0562v/weird_beeping/',)", "identifyer": 5800777, "year": "2019"}, {"autor": "EmergencyReference", "date": 1556506097000, "content": "AITA for asking my friend to be weary of all of the dandruff he leaves on my bed? He's a vindictive person and now I'm afraid he may have infiltrated my PC /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/bijeme/aita_for_asking_my_friend_to_be_weary_of_all_of/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "aita for asking my friend to be weary of all of the dandruff he leaves on my -----> bed !!! ? he's a vindictive person and now i'm afraid he may have infiltrated my pc /!/ [removed]", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bijeme/aita_for_asking_my_friend_to_be_weary_of_all_of/',)", "identifyer": 5802226, "year": "2019"}, {"autor": "vngeringlau02748", "date": 1563594602000, "content": "Kira Bed Girls - Fairy Tales Story in Hindi - बच्चों की नयी हिंदी कहानि...", "link": "https://www.reddit.com/r/technology/comments/cfhf2u/kira_bed_girls_fairy_tales_story_in_hindi_बचच_क/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "kira -----> bed !!!  girls - fairy tales story in hindi - बच्चों की नयी हिंदी कहानि...", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.youtube.com/attribution_link?a=5J92jtkMcKg&amp;u=%2Fwatch%3Fv%3DdYV1-rdEUMg%26feature%3Dshare',)", "identifyer": 5803961, "year": "2019"}, {"autor": "cooloxux", "date": 1553734065000, "content": "The 5 Best Social Alarm Apps to Help You Get Out of Bed", "link": "https://www.reddit.com/r/technology/comments/b6cajx/the_5_best_social_alarm_apps_to_help_you_get_out/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "the 5 best social alarm apps to help you get out of -----> bed !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://techtipsnext.blogspot.com/2019/03/the-5-best-social-alarm-apps-to-help.html',)", "identifyer": 5806572, "year": "2019"}, {"autor": "Ab_Web", "date": 1549807594000, "content": "Thailand launches 5G test bed with Huawei equipments, going against US advice", "link": "https://www.reddit.com/r/technology/comments/ap45vi/thailand_launches_5g_test_bed_with_huawei/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "thailand launches 5g test -----> bed !!!  with huawei equipments, going against us advice", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.asimblogger.com/2019/02/Thailand-launch-5G-test-bed-with-Huawei-equipments-going-agains-US-advice.html?m=',)", "identifyer": 5809769, "year": "2019"}, {"autor": "Doc_Who_or_Holiday", "date": 1549997274000, "content": "Ford made a lane keeping bed", "link": "https://www.reddit.com/r/technology/comments/apwp0c/ford_made_a_lane_keeping_bed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "ford made a lane keeping -----> bed !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('nan',)", "medialink": "('https://www.autoblog.com/2019/02/12/fords-smart-bed-unruly-sleepers/',)", "identifyer": 5810258, "year": "2019"}, {"autor": "Keleko828", "date": 1565492927000, "content": "Interesting Bluetooth question... /!/ So here is the context...\nI have a JBL Bluetooth speaker.  My phone (iPhone SE) was disconnected from the device, my wife’s phone (iPhone X) was connected to the speaker playing music.  Kids go to bed, wife and I are still up.  Baby monitor won’t connect, so I take my wife’s phone upstairs (on speaker with the kids), and call my phone (down with us, muted so the kids can’t hear us, on speaker).  Her phone is CLEARLY connected to mine through the phone call (can hear the barking dog and everything).  I hit Bluetooth button on the speaker to connect another phone to play music.  When I hit Bluetooth button, my phone goes silent (no more dog barking), and the noise is replaced by tapping (which was the buttons on the speaker pushing).  After some investigation, we realize the speaker is projecting sound to my wife’s phone, which should have only been connected to my phone through the phone call.  I was able to talk into the speaker and my voice would project out of my wife’s phone.\n\nDo Bluetooth speakers have a “mouthpiece” or something that can detect sound and project it to another device?  Is there some entity that records/monitors voices or conversations that happen around a speaker?\n\nTL:DR, my Bluetooth speaker was projecting my voice to another phone like it had a microphone or something.  Do regular Bluetooth speakers listen to us too?", "link": "https://www.reddit.com/r/technology/comments/cornce/interesting_bluetooth_question/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "interesting bluetooth question... /!/ so here is the context...\ni have a jbl bluetooth speaker.  my phone (iphone se) was disconnected from the device, my wife’s phone (iphone x) was connected to the speaker playing music.  kids go to -----> bed !!! , wife and i are still up.  baby monitor won’t connect, so i take my wife’s phone upstairs (on speaker with the kids), and call my phone (down with us, muted so the kids can’t hear us, on speaker).  her phone is clearly connected to mine through the phone call (can hear the barking dog and everything).  i hit bluetooth button on the speaker to connect another phone to play music.  when i hit bluetooth button, my phone goes silent (no more dog barking), and the noise is replaced by tapping (which was the buttons on the speaker pushing).  after some investigation, we realize the speaker is projecting sound to my wife’s phone, which should have only been connected to my phone through the phone call.  i was able to talk into the speaker and my voice would project out of my wife’s phone.\n\ndo bluetooth speakers have a “mouthpiece” or something that can detect sound and project it to another device?  is there some entity that records/monitors voices or conversations that happen around a speaker?\n\ntl:dr, my bluetooth speaker was projecting my voice to another phone like it had a microphone or something.  do regular bluetooth speakers listen to us too?", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/cornce/interesting_bluetooth_question/',)", "identifyer": 5812428, "year": "2019"}, {"autor": "arnambiar", "date": 1568304138000, "content": "(Best) Recron Certified Bed Pillows Pack of 2 In Just ₹349 (Worth ₹1399)", "link": "https://www.reddit.com/r/technology/comments/d3a0pg/best_recron_certified_bed_pillows_pack_of_2_in/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "(best) recron certified -----> bed !!!  pillows pack of 2 in just ₹349 (worth ₹1399)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://timesoftecknology.blogspot.com/2019/09/best-recron-certified-bed-pillows-pack.html',)", "identifyer": 5812942, "year": "2019"}, {"autor": "mattatinternet", "date": 1567820197000, "content": "There was a lot of noise a few years ago about computer game reviewers being in bed - sometimes literally - with developers and publishers, and their reviews not being trustworthy or free of bias. What about the wider technology review industry? /!/ I'm looking at getting a dash cam, so I'm reading reviews online. But it occurs to me that I don't know anything about the websites I'm reading reviews on. How do you find out if websites or reviewers have links to the tech industry that could bias them for or against certain products? How do you know who to trust? We all have a built in bullshit radar, but it's easy to get overwhelmed. Is the fact that a particular make or model appears as a top pick a sign of the quality of the product, or a sign that the manufacturer has the reviewers under their thumb? Or in their pocket?\n\nI'm not sure how to flair this post. Business maybe? General discussion?", "link": "https://www.reddit.com/r/technology/comments/d0pv2i/there_was_a_lot_of_noise_a_few_years_ago_about/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "there was a lot of noise a few years ago about computer game reviewers being in -----> bed !!!  - sometimes literally - with developers and publishers, and their reviews not being trustworthy or free of bias. what about the wider technology review industry? /!/ i'm looking at getting a dash cam, so i'm reading reviews online. but it occurs to me that i don't know anything about the websites i'm reading reviews on. how do you find out if websites or reviewers have links to the tech industry that could bias them for or against certain products? how do you know who to trust? we all have a built in bullshit radar, but it's easy to get overwhelmed. is the fact that a particular make or model appears as a top pick a sign of the quality of the product, or a sign that the manufacturer has the reviewers under their thumb? or in their pocket?\n\ni'm not sure how to flair this post. business maybe? general discussion?", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/d0pv2i/there_was_a_lot_of_noise_a_few_years_ago_about/',)", "identifyer": 5814005, "year": "2019"}, {"autor": "jpmellojr", "date": 1551368639000, "content": "Microsoft Defends Jumping in AR Bed With Military /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/avsi1b/microsoft_defends_jumping_in_ar_bed_with_military/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "microsoft defends jumping in ar -----> bed !!!  with military /!/ [removed]", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/avsi1b/microsoft_defends_jumping_in_ar_bed_with_military/',)", "identifyer": 5815021, "year": "2019"}, {"autor": "123designSRQ", "date": 1570239276000, "content": "AMAZING LOOKING TV BED WITH ENTERTAINMENT SYSTEM", "link": "https://www.reddit.com/r/technology/comments/ddgtc4/amazing_looking_tv_bed_with_entertainment_system/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "amazing looking tv -----> bed !!!  with entertainment system", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://blog.123.design/furniture-2/amazing-looking-tv-bed-with-entertainment-system/',)", "identifyer": 5816173, "year": "2019"}, {"autor": "morningcommuter", "date": 1567002113000, "content": "The perfect alarm clock /!/ Hi,\nI want to get out of the habit of having my phone beside my bed overnight. To help me, I want to get a small alarm clock instead. The thing is that I hate led lights/screens in an otherwise dark room. Does anyone know of any small alarm clock that lights up briefly on demand, say with a light tap or something?\nRadio not necessary, just an unobtrusive display and alarm.", "link": "https://www.reddit.com/r/technology/comments/cwlhik/the_perfect_alarm_clock/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "the perfect alarm clock /!/ hi,\ni want to get out of the habit of having my phone beside my -----> bed !!!  overnight. to help me, i want to get a small alarm clock instead. the thing is that i hate led lights/screens in an otherwise dark room. does anyone know of any small alarm clock that lights up briefly on demand, say with a light tap or something?\nradio not necessary, just an unobtrusive display and alarm.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/cwlhik/the_perfect_alarm_clock/',)", "identifyer": 5818777, "year": "2019"}, {"autor": "Temlek", "date": 1573574940000, "content": "Disney+: How would you handle millions of users at launch? /!/ With today's much-anticipated launch of Disney+, I couldn't help to think about the technical hurdles their engineers must have had to go through to prepare for the influx of traffic. So sitting in bed with the kids this morning, I wanted to click around and see how the service was performing. To my surprise, I couldn't even log in without running into an \"Unexpected Error\". \n\nAfter a couple of searches, it looks like the auth provider is struggling with traffic load, proving that even with ample resources, this is still an enormous engineering challenge.\n\nSo putting yourself in the same position, how would you handle this situation?", "link": "https://www.reddit.com/r/technology/comments/dvc18s/disney_how_would_you_handle_millions_of_users_at/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "disney+: how would you handle millions of users at launch? /!/ with today's much-anticipated launch of disney+, i couldn't help to think about the technical hurdles their engineers must have had to go through to prepare for the influx of traffic. so sitting in -----> bed !!!  with the kids this morning, i wanted to click around and see how the service was performing. to my surprise, i couldn't even log in without running into an \"unexpected error\". \n\nafter a couple of searches, it looks like the auth provider is struggling with traffic load, proving that even with ample resources, this is still an enormous engineering challenge.\n\nso putting yourself in the same position, how would you handle this situation?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dvc18s/disney_how_would_you_handle_millions_of_users_at/',)", "identifyer": 5821816, "year": "2019"}, {"autor": "Wyatt850", "date": 1556637584000, "content": "[Discussion] After seeing the way smartphones have changed our society and how phone-centric we've become, do you think the original inventors of the modern smartphone regret it? /!/ I've held this question for a while now, and I just thought it would be an interesting discussion topic.\n\n(My opinion:)\nSmartphones are amazing machines, and have truly changed society forever. They've connected people, helped us find information, and are convenient. In my opinion, that's where the good things end. Smartphones were supposed to assist with our life, not be it. People are addicted to their phones. \"I'll just scroll through my friend's Instagram, when he's right in front of me and we could have a meaningful conversation right now.\" The average American spends up to 11 hours on their phone. Not to be some Hardcore patriot or anything, but smartphones are really ruining the economy. People are too lazy to  go to actual brick -and-mortar places anymore because of their MOBILE phones. Don't agree with me? I bet you a crisp five that there won't be any physical stores left in 15 years. Look how quick these physical stores are dying. Sears, Bed Bath And Beyond... Stores aren't just gone with the snap of your fingers. There's still buildings left there. Unsold merchandise. Thousands of unemployed. It's almost as if smartphones ARE attached to a landline for some people. Get out. See some sun.\nPeople are obscenely lazy.\nAlso, what happened to actually talking to people?   Human interaction is important. I recommend reading 'The Fun They Had'. It really makes you think about the value of human interaction. \nThese aren't the only reasons smartphones are bad.. just think how things have changed for a little bit and I'm sure you'll see plenty of negative effects.\n\nIf you think I'm some annoying old guy who says 'back in my day', nope. I'm a teenager. A teenager who has a mild hate of smartphones. Dated? Yes.  I still use DVDs and CDs... \n\nWhen in moderation, smartphones are great devices but human nature is to get obsessive with things. Sorry for a long, annoying post, but that's why I think the original inventors of smartphones probably regret it. If it was my choice, we'd still be using RAZRs and BlackBerries...", "link": "https://www.reddit.com/r/technology/comments/bj4j3w/discussion_after_seeing_the_way_smartphones_have/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[discussion] after seeing the way smartphones have changed our society and how phone-centric we've become, do you think the original inventors of the modern smartphone regret it? /!/ i've held this question for a while now, and i just thought it would be an interesting discussion topic.\n\n(my opinion:)\nsmartphones are amazing machines, and have truly changed society forever. they've connected people, helped us find information, and are convenient. in my opinion, that's where the good things end. smartphones were supposed to assist with our life, not be it. people are addicted to their phones. \"i'll just scroll through my friend's instagram, when he's right in front of me and we could have a meaningful conversation right now.\" the average american spends up to 11 hours on their phone. not to be some hardcore patriot or anything, but smartphones are really ruining the economy. people are too lazy to  go to actual brick -and-mortar places anymore because of their mobile phones. don't agree with me? i bet you a crisp five that there won't be any physical stores left in 15 years. look how quick these physical stores are dying. sears, -----> bed !!!  bath and beyond... stores aren't just gone with the snap of your fingers. there's still buildings left there. unsold merchandise. thousands of unemployed. it's almost as if smartphones are attached to a landline for some people. get out. see some sun.\npeople are obscenely lazy.\nalso, what happened to actually talking to people?   human interaction is important. i recommend reading 'the fun they had'. it really makes you think about the value of human interaction. \nthese aren't the only reasons smartphones are bad.. just think how things have changed for a little bit and i'm sure you'll see plenty of negative effects.\n\nif you think i'm some annoying old guy who says 'back in my day', nope. i'm a teenager. a teenager who has a mild hate of smartphones. dated? yes.  i still use dvds and cds... \n\nwhen in moderation, smartphones are great devices but human nature is to get obsessive with things. sorry for a long, annoying post, but that's why i think the original inventors of smartphones probably regret it. if it was my choice, we'd still be using razrs and blackberries...", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bj4j3w/discussion_after_seeing_the_way_smartphones_have/',)", "identifyer": 5825908, "year": "2019"}, {"autor": "speakhyroglyphically", "date": 1572296757000, "content": "Your bed Is a disgusting bacteria buffet, but these high-tech bed sheets can help", "link": "https://www.reddit.com/r/technology/comments/dofdng/your_bed_is_a_disgusting_bacteria_buffet_but/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "your -----> bed !!!  is a disgusting bacteria buffet, but these high-tech -----> bed !!!  sheets can help", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://futurism.com/miracle-sheets-towels-stop-germs',)", "identifyer": 5834902, "year": "2019"}], "name": "bedtechnology2019"}