{"interestingcomments": [{"autor": "Gaming4all", "date": 1550955537000, "content": "Write-It the hackable code editor of the 21st century /!/  \n\n# What is Write-It?\n\nWrite-It is a lightweight, yet powerful, modern and hackable code editor/IDE designed for developers by developers with opening doors to web, app, game &amp; software development for both schools and companies. We blend visual tools into the editor so you get the right amount of help when you want it without getting in the way of your creative process. You'll enjoy writing code in Write-It.\n\n# Made with ♥ and CSharp\n\nWrite-It is an fresh and constant under development project, supported by an active and passionate group of developers. It's made by other software, web, app and game developers like you! With Plans for Contribution…\n\n# What Makes Write-It Great\n\nWrite-It lets your organization create and share fully automated dev environments on any infrastructure for modern distributed applications, websites, games, micro-services and containers with a feel similar to Visual Studio.\n\n# Inline Editors\n\nInstead of jumping between file tabs, Write-It lets you open a window into the code you care about most. Want to work on the CSS that applies to a specific ID? Put your mouse cursor on that ID, push Command / Ctrl+S and Write-It will show you all the CSS selectors with that ID in an inline window so you can work on your code side-by-side without any popups.\n\n# Great for Testing &amp; Previews\n\nGet a real-time connection to your browser or app. Make changes to CSS and HTML and you'll instantly see those changes on screen. Also see where your CSS selector is being applied in the browser/app by simply putting your cursor on it. It's the power of a code editor with the convenience of in-browser/app dev tools.\n\n# Preprocessor Support\n\nWork with preprocessors in a whole new way. We know how important preprocessors are to your workflow. That’s why we want to make Write-It the best code editor/IDE for preprocessors out there. With Write-It you can use Quick Editing and Live Highlights with your LESS and SCSS files which will make working with them easier than ever.\n\n# GitHub for Write-It\n\nA code editor is at the core of a developer’s toolbox, but it doesn't usually work alone. Work with Git and GitHub directly from Write-It with the GitHub integration. Create new branches, stage and commit, push and pull, resolve merge, view pull requests and more—all from within your editor. The GitHub integration is already bundled with Write-It, so you're ready to go!\n\n# Already Supports\n\nWrite-It already supports Java app development &amp; full deployments, C#, HTML, JavaScript, CSS, Bootstrap, Lua, React, NodeJS &amp; SQL.\n\n# Who develops Write-It?\n\nWrite-It is being developed by Philip Ritmeester.\n\n# What makes Write-It special?\n\nWe are working on a visual programming editor which would allow programmers to develop not only games but also applications and websites using visual code blocks. We aim towards a future where learners also can get the most out of there IDE of choice.\n\n# More about Write-It\n\nFor more information, questions, suggestions or just a little chat you can visit our Sub-Reddit at: https://www.reddit.com/r/Write\\_It", "link": "https://www.reddit.com/r/technology/comments/au01mp/writeit_the_hackable_code_editor_of_the_21st/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "write-it the hackable code editor of the 21st century /!/  \n\n# what is write-it?\n\nwrite-it is a lightweight, yet powerful, modern and hackable code editor/ide designed for developers by developers with opening doors to web, app, game &amp; software development for both schools and companies. we blend visual tools into the editor so you get the right amount of help when you want it without getting in the way of your creative process. you'll enjoy writing code in write-it.\n\n# made with ♥ and csharp\n\nwrite-it is an fresh and constant under development project, supported by an active and passionate group of developers. it's made by other software, web, app and game developers like you! with plans for contribution…\n\n# what makes write-it great\n\nwrite-it lets your organization create and share fully automated dev environments on any infrastructure for modern distributed applications, websites, games, micro-services and containers with a feel similar to visual studio.\n\n# inline editors\n\ninstead of jumping between file tabs, write-it lets you open a window into the code you care about most. want to work on the css that applies to a specific id? put your mouse cursor on that id, push command / ctrl+s and write-it will show you all the css selectors with that id in an inline window so you can work on your code side-by-side without any popups.\n\n# great for testing &amp; previews\n\nget a real-time connection to your browser or app. make changes to css and html and you'll instantly see those changes on screen. also see where your css selector is being applied in the browser/app by simply putting your cursor on it. it's the power of a code editor with the convenience of in-browser/app dev tools.\n\n# preprocessor support\n\nwork with preprocessors in a whole new way. we know how important preprocessors are to your workflow. that’s why we want to make write-it the best code editor/ide for preprocessors out there. with write-it you can use quick editing and live highlights with your less and scss files which will make working with them easier than ever.\n\n# github for write-it\n\na code editor is at the core of a developer’s toolbox, but it doesn't usually work alone. work with git and github directly from write-it with the github integration. create new -----> branches !!! , stage and commit, push and pull, resolve merge, view pull requests and more—all from within your editor. the github integration is already bundled with write-it, so you're ready to go!\n\n# already supports\n\nwrite-it already supports java app development &amp; full deployments, c#, html, javascript, css, bootstrap, lua, react, nodejs &amp; sql.\n\n# who develops write-it?\n\nwrite-it is being developed by philip ritmeester.\n\n# what makes write-it special?\n\nwe are working on a visual programming editor which would allow programmers to develop not only games but also applications and websites using visual code blocks. we aim towards a future where learners also can get the most out of there ide of choice.\n\n# more about write-it\n\nfor more information, questions, suggestions or just a little chat you can visit our sub-reddit at: https://www.reddit.com/r/write\\_it", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 7, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/au01mp/writeit_the_hackable_code_editor_of_the_21st/',)", "identifyer": 5760296, "year": "2019"}, {"autor": "IamChijamz", "date": 1569748452000, "content": "Flutterwave- Globalized Payment Infrastructure /!/ Are you a Startup, business, firm or an upcoming brand, are you looking for an efficient payment solution, a systematic gateway that allows you to send and receive money from anywhere in the world? I have good news for you.\n\n\nFlutterwave is the solution.\n\n\n￼\n\n\n\nFlutterwave is an all-encompassing payment solution for individuals, firms and businesses that allows the easy integration of all kinds of payments into a singular ecosystem. \n\n\n\nWith Flutterwave, one can send and receive money all over the world, using different tools and APIs inside the same platform.\n\n\nStarted in 2016, Flutterwave has grown to be one of the fastest-growing global payment solution brands, with Partnership with Top Financial and Innovative Companies like Uber, Banking.com, flywire and a host of others.\n\n\n\nFlutterwave is on a mission to put Africa on the World map by inventing and innovating global payment infrastructures that intertwine Africa with the rest of the world, financially.\n\n\nTo achieve this, Flutterwave Team have built a set of Products that will help achieve global adoption of Flutterwave solutions and these products are built based on the ideologies that favour these features:\n\nA. Global Reach\n\nB. One-Time Setup for everyone\n\nC. All-In-One Integration\n\nD. Innovations and Development\n\n\n\n\n\nFlutterwave Products:\n\n1. Rave:\n\n￼\n\n\n\nRave is a universal payment solution developed by Flutterwave. Rave enables people to pay for goods and services from anywhere in the world, Rave also affords startups, business owners and merchants the opportunity to accept payments for different products and services from anywhere in the world, seamlessly.\n\n\n\nWith Rave, businesses can accept payments with Credit cards, Bank transfers, Mobile transfers and even using Virtual card payments, with over 150 currencies supported.\n\n\n\nMore than that, individuals can also accept payments for services rendered on Social Media directly on Social media accounts or on their websites as they choose.\n\n\nBest of all, Rave is quick and easy to set up, integrate and utilize as it has integrations available for most popular E-Commerce plugins worldwide, including Shopify, Quickbooks, Xero, and Squarespace.\n\n\n\nRave is also embedded with Real-time inventory system, payment notifications and insights/Analytical data to ensure business growth and development. Therefore Rave is a payment solution for both Small, Medium and large scale enterprises.\n\n\n2. Barter:\n\n￼\n\n\nBarter can be said to be a better financial management partner for everyone. Barter is a payment solution Application designed by Flutterwave, it is an all-in-one payment solution for individuals desiring effective management of their finances.\n\n\n\nThe Barter App is furnished with a unique peer-to-peer payment ecosystem allowing friends within a particular geographic location to send and receive money seamlessly, making financial transactions more fun and exciting.\n\n\nHave you heard about Smart Reminders? Barter App is embedded with a plethora of Smart Notification for all kinds of transactions and notifications. When we talk about a full-fledged financial assistant, there's no better way to explain it than by using the Barter App.\n\n\n\nFlutterwave, Started by Ex-Andeleans Iyinoluwa Aboyeji and Olugbenga Agboola in 2016, has surpassed unimaginable standards and proven that a global payment system is possible. \n\n\n\nIn less than 2 years of commencement, Flutterwave has built a global brand with Headquarters in San Francisco and over 4 International Offices in Lagos, Accra, Nairobi and Johannesburg, and a host of other branches all over Africa and Europe, with up to 100Million processed transactions so far and innovative partnerships with over 50 banks in Africa.\n\n￼\n\n\n\nFlutterwave also has a growing community of over 1200 developers who are constantly building and developing the Flutterwave Ecosystem\n\n\nWhat are your thoughts about Flutterwave? \n\nPlease share in the comment box below", "link": "https://www.reddit.com/r/technology/comments/dasvyh/flutterwave_globalized_payment_infrastructure/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "flutterwave- globalized payment infrastructure /!/ are you a startup, business, firm or an upcoming brand, are you looking for an efficient payment solution, a systematic gateway that allows you to send and receive money from anywhere in the world? i have good news for you.\n\n\nflutterwave is the solution.\n\n\n￼\n\n\n\nflutterwave is an all-encompassing payment solution for individuals, firms and businesses that allows the easy integration of all kinds of payments into a singular ecosystem. \n\n\n\nwith flutterwave, one can send and receive money all over the world, using different tools and apis inside the same platform.\n\n\nstarted in 2016, flutterwave has grown to be one of the fastest-growing global payment solution brands, with partnership with top financial and innovative companies like uber, banking.com, flywire and a host of others.\n\n\n\nflutterwave is on a mission to put africa on the world map by inventing and innovating global payment infrastructures that intertwine africa with the rest of the world, financially.\n\n\nto achieve this, flutterwave team have built a set of products that will help achieve global adoption of flutterwave solutions and these products are built based on the ideologies that favour these features:\n\na. global reach\n\nb. one-time setup for everyone\n\nc. all-in-one integration\n\nd. innovations and development\n\n\n\n\n\nflutterwave products:\n\n1. rave:\n\n￼\n\n\n\nrave is a universal payment solution developed by flutterwave. rave enables people to pay for goods and services from anywhere in the world, rave also affords startups, business owners and merchants the opportunity to accept payments for different products and services from anywhere in the world, seamlessly.\n\n\n\nwith rave, businesses can accept payments with credit cards, bank transfers, mobile transfers and even using virtual card payments, with over 150 currencies supported.\n\n\n\nmore than that, individuals can also accept payments for services rendered on social media directly on social media accounts or on their websites as they choose.\n\n\nbest of all, rave is quick and easy to set up, integrate and utilize as it has integrations available for most popular e-commerce plugins worldwide, including shopify, quickbooks, xero, and squarespace.\n\n\n\nrave is also embedded with real-time inventory system, payment notifications and insights/analytical data to ensure business growth and development. therefore rave is a payment solution for both small, medium and large scale enterprises.\n\n\n2. barter:\n\n￼\n\n\nbarter can be said to be a better financial management partner for everyone. barter is a payment solution application designed by flutterwave, it is an all-in-one payment solution for individuals desiring effective management of their finances.\n\n\n\nthe barter app is furnished with a unique peer-to-peer payment ecosystem allowing friends within a particular geographic location to send and receive money seamlessly, making financial transactions more fun and exciting.\n\n\nhave you heard about smart reminders? barter app is embedded with a plethora of smart notification for all kinds of transactions and notifications. when we talk about a full-fledged financial assistant, there's no better way to explain it than by using the barter app.\n\n\n\nflutterwave, started by ex-andeleans iyinoluwa aboyeji and olugbenga agboola in 2016, has surpassed unimaginable standards and proven that a global payment system is possible. \n\n\n\nin less than 2 years of commencement, flutterwave has built a global brand with headquarters in san francisco and over 4 international offices in lagos, accra, nairobi and johannesburg, and a host of other -----> branches !!!  all over africa and europe, with up to 100million processed transactions so far and innovative partnerships with over 50 banks in africa.\n\n￼\n\n\n\nflutterwave also has a growing community of over 1200 developers who are constantly building and developing the flutterwave ecosystem\n\n\nwhat are your thoughts about flutterwave? \n\nplease share in the comment box below", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dasvyh/flutterwave_globalized_payment_infrastructure/',)", "identifyer": 5762894, "year": "2019"}, {"autor": "Philosophia_Discord", "date": 1559571718000, "content": "Philosophy &amp; Technology Discord Server /!/ Philosophia is the number 1 philosophy server on Discord. It has both casual, and intellectual discourse in text &amp; voice. We branch off to all areas of dialogue from philosophy, politics, science, history, business, and more!\n\nWe take pride in keeping quality over quantity, and only want the best platform a user could have when looking for debates or conversation. Server is updated regularly with an active, and friendly staff team. We also have events and giveaways occasionally. Apply to join today!\n\nWe also have 150 ideological roles to choose from! Clubs for focused discourse! Active, quality text and voice channels! Events, giveaways, and guest speakers regularly! Updated frequently to cater towards the community! ​ This link should work permanently: https://discord.gg/DGqGNr2", "link": "https://www.reddit.com/r/technology/comments/bwb7ai/philosophy_technology_discord_server/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "philosophy &amp; technology discord server /!/ philosophia is the number 1 philosophy server on discord. it has both casual, and intellectual discourse in text &amp; voice. we -----> branch !!!  off to all areas of dialogue from philosophy, politics, science, history, business, and more!\n\nwe take pride in keeping quality over quantity, and only want the best platform a user could have when looking for debates or conversation. server is updated regularly with an active, and friendly staff team. we also have events and giveaways occasionally. apply to join today!\n\nwe also have 150 ideological roles to choose from! clubs for focused discourse! active, quality text and voice channels! events, giveaways, and guest speakers regularly! updated frequently to cater towards the community! ​ this link should work permanently: https://discord.gg/dgqgnr2", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bwb7ai/philosophy_technology_discord_server/',)", "identifyer": 5763704, "year": "2019"}, {"autor": "keyxentictoken", "date": 1553950410000, "content": "World's First Biometric Secured Encryption Key USB Token with Crypto-Wallet /!/ **Secure ALL Your Data with Your Fingerprint!** From now on all of your data is secured with a key that you and only you possess!\n\n&amp;#x200B;\n\n**A  First of it’s kind Multi-Modal Bio-Authenticated Certified   Barometrically Secured Encryption Key USB Token with Crypto-Wallet,  Smart Card Reader, SD Drive, and Recovery Smart Card!**\n\n&amp;#x200B;\n\nThe KeyXentic Smart Token is an elegant and user-friendly all encompassing digital data security solution that creates the **NEW STANDARD** for personal and professional data protection.\n\n&amp;#x200B;\n\nThe KeyXentic Smart Token is for;\n\n1. Secure access control with identification and authentication\n2. Secure Email signing and encryption\n3. File encryption and data protection\n4. Cloud server encryption and data protection\n5. PDF Security (signing and encryption)\n6. Anonymous and secure cryptocurrency wallet and transactions\n\n&amp;#x200B;\n\nLearn more here: [https://keyxentictoken.com/](https://keyxentictoken.com/)\n\n&amp;#x200B;\n\nNote:  All questions concerning the newly developed propriety technology are  welcome. Please know I'm posting from Taiwan, will try to reply as fast  as possible to comments and questions.\n\n&amp;#x200B;\n\nBackground:\n\nKeyXentic  Inc. is based in Taipei, Taiwan (ROC) and was founded in the year 2000.  KeyXentic Inc., are the developers of the Taiwan's Citizen Digital  E-Passport Smart Card, protecting 10 million Taiwanese from identity  theft, mainly from mainland China threats. Until  now KeyXentic Inc. has provided government and enterprise cybersecurity  solutions to global banks and numerous local and international  hospitals. Keyxentic Inc. is a member of the FIDO Alliance.   \n\n\nThe  company's mission is to provide a simple and intuitive data encryption  solution for the daily lives of everyday people by using the KX906  Keyxentic Smart Token.\n\n&amp;#x200B;\n\nAt the moment  the Keyxentic Token can only be purchsed at KeyxenticToken.com and  Amazon.com, KeyxenticToken.com is owned and operated by HGAC LLC Ltd.  Trading Co. TW Br. the sole Authorized Global Supply Chain Distributor  for Keyxentic Inc. products and services. HGAC LLC Ltd. Trading Co. TW  Br. is a company founded in Montana, USA with a branch office in Taipei,  Taiwan.", "link": "https://www.reddit.com/r/technology/comments/b7ay7y/worlds_first_biometric_secured_encryption_key_usb/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "world's first biometric secured encryption key usb token with crypto-wallet /!/ **secure all your data with your fingerprint!** from now on all of your data is secured with a key that you and only you possess!\n\n&amp;#x200b;\n\n**a  first of it’s kind multi-modal bio-authenticated certified   barometrically secured encryption key usb token with crypto-wallet,  smart card reader, sd drive, and recovery smart card!**\n\n&amp;#x200b;\n\nthe keyxentic smart token is an elegant and user-friendly all encompassing digital data security solution that creates the **new standard** for personal and professional data protection.\n\n&amp;#x200b;\n\nthe keyxentic smart token is for;\n\n1. secure access control with identification and authentication\n2. secure email signing and encryption\n3. file encryption and data protection\n4. cloud server encryption and data protection\n5. pdf security (signing and encryption)\n6. anonymous and secure cryptocurrency wallet and transactions\n\n&amp;#x200b;\n\nlearn more here: [https://keyxentictoken.com/](https://keyxentictoken.com/)\n\n&amp;#x200b;\n\nnote:  all questions concerning the newly developed propriety technology are  welcome. please know i'm posting from taiwan, will try to reply as fast  as possible to comments and questions.\n\n&amp;#x200b;\n\nbackground:\n\nkeyxentic  inc. is based in taipei, taiwan (roc) and was founded in the year 2000.  keyxentic inc., are the developers of the taiwan's citizen digital  e-passport smart card, protecting 10 million taiwanese from identity  theft, mainly from mainland china threats. until  now keyxentic inc. has provided government and enterprise cybersecurity  solutions to global banks and numerous local and international  hospitals. keyxentic inc. is a member of the fido alliance.   \n\n\nthe  company's mission is to provide a simple and intuitive data encryption  solution for the daily lives of everyday people by using the kx906  keyxentic smart token.\n\n&amp;#x200b;\n\nat the moment  the keyxentic token can only be purchsed at keyxentictoken.com and  amazon.com, keyxentictoken.com is owned and operated by hgac llc ltd.  trading co. tw br. the sole authorized global supply chain distributor  for keyxentic inc. products and services. hgac llc ltd. trading co. tw  br. is a company founded in montana, usa with a -----> branch !!!  office in taipei,  taiwan.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 2, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/b7ay7y/worlds_first_biometric_secured_encryption_key_usb/',)", "identifyer": 5764914, "year": "2019"}, {"autor": "steveedwin", "date": 1554458456000, "content": "IDEA BANK LAUNCHED IDEA HUB, A NEW-GENERATION BANK BRANCH", "link": "https://www.reddit.com/r/technology/comments/b9p9a9/idea_bank_launched_idea_hub_a_newgeneration_bank/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "idea bank launched idea hub, a new-generation bank -----> branch !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.globalbankingandfinance.com/idea-bank-launched-idea-hub-a-new-generation-bank-branch/?fbclid=IwAR17YegJUE34Dxdpn20lSppIu8ThfXHf6pKEpBSZlzRDEpfso6edSSQJtOc',)", "identifyer": 5765180, "year": "2019"}, {"autor": "openwebsolutions", "date": 1554450932000, "content": "Easy And Helpful Steps Of Creating A New Branch With Git", "link": "https://www.reddit.com/r/technology/comments/b9ocwn/easy_and_helpful_steps_of_creating_a_new_branch/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "easy and helpful steps of creating a new -----> branch !!!  with git", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://blog.openwebsolutions.in/steps-of-creating-a-new-branch-with-git/',)", "identifyer": 5765206, "year": "2019"}, {"autor": "Ia2mn2wi", "date": 1547939284000, "content": "/u/24pepper posted about the interactive chart /u/nublargh created for tracking the various branches of user painting other users. It will likely be a necessary reference for generations to come. Pun intended.", "link": "https://www.reddit.com/r/technology/comments/ahrglv/u24pepper_posted_about_the_interactive_chart/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "/u/24pepper posted about the interactive chart /u/nublargh created for tracking the various -----> branches !!!  of user painting other users. it will likely be a necessary reference for generations to come. pun intended.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://np.reddit.com/r/pics/comments/ahlkis/when_it_sinks_in_that_i_stayed_up_most_of_the/eeftm84',)", "identifyer": 5777204, "year": "2019"}, {"autor": "moksah82", "date": 1564013281000, "content": "Top 10 branches of the social sciences", "link": "https://www.reddit.com/r/technology/comments/chg8j8/top_10_branches_of_the_social_sciences/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "top 10 -----> branches !!!  of the social sciences", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 0, "media": "('link',)", "medialink": "('http://www.foxsblog.com/top-10-branches-of-the-social-sciences/',)", "identifyer": 5783318, "year": "2019"}, {"autor": "Evan2895", "date": 1550610287000, "content": "Space Force will be a Marines-like branch under Air Force authority", "link": "https://www.reddit.com/r/technology/comments/asfe7s/space_force_will_be_a_marineslike_branch_under/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "space force will be a marines-like -----> branch !!!  under air force authority", "sortedWord": "None", "removed": "('nan',)", "score": 4, "comments": 32, "media": "('link',)", "medialink": "('https://techcrunch.com/2019/02/19/marines-in-space/',)", "identifyer": 5788426, "year": "2019"}, {"autor": "Thormask", "date": 1569069357000, "content": "where to buy a Passport ,Just visit ......https://quickydocs.com Where can i buy a passport-How can i Buy British passport We are an agency with over 120 branches worldwide cutting through Europe to the Middle East to Asia, Africa North and South America /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/d79xzb/where_to_buy_a_passport_just_visit/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "where to buy a passport ,just visit ......https://quickydocs.com where can i buy a passport-how can i buy british passport we are an agency with over 120 -----> branches !!!  worldwide cutting through europe to the middle east to asia, africa north and south america /!/ [removed]", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/d79xzb/where_to_buy_a_passport_just_visit/',)", "identifyer": 5791962, "year": "2019"}, {"autor": "rahulonehart", "date": 1571028267000, "content": "Both technology and process fix. Help me in improving Queuing system for account opening forms in bank processing center /!/ Hi fellow wankers,\n\nHope I'm posting at the right place\n\nI work at a public sector bank, might be one of oldest in the world. The range of operations are many as you know, and I'm assigned a job to reduce the number of discrepancies in current account opening forms across branches in my state. \n\nDaily count of discrepancies is around 300. Average\n\nDiscrepancies include absence of signatures of either branch office or the customer, non inclusion of either identity proofs copies accepted and either documents copies in the list, rubber stamps etc,. \n\nDaily number of branches: 250. average\n\nThe processing center forwards the discrepancies to be rectified to the branches. The branches are not penalised for not rectified in minimum time period. \n\nWhat I'm looking for is both technology (since it's dynamic) and process fix.\n\nCan you please refer me any websites about this problems in operations perspective or propose me any solution. Thank you for reading.", "link": "https://www.reddit.com/r/technology/comments/dhlp2n/both_technology_and_process_fix_help_me_in/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "both technology and process fix. help me in improving queuing system for account opening forms in bank processing center /!/ hi fellow wankers,\n\nhope i'm posting at the right place\n\ni work at a public sector bank, might be one of oldest in the world. the range of operations are many as you know, and i'm assigned a job to reduce the number of discrepancies in current account opening forms across -----> branches !!!  in my state. \n\ndaily count of discrepancies is around 300. average\n\ndiscrepancies include absence of signatures of either branch office or the customer, non inclusion of either identity proofs copies accepted and either documents copies in the list, rubber stamps etc,. \n\ndaily number of branches: 250. average\n\nthe processing center forwards the discrepancies to be rectified to the branches. the branches are not penalised for not rectified in minimum time period. \n\nwhat i'm looking for is both technology (since it's dynamic) and process fix.\n\ncan you please refer me any websites about this problems in operations perspective or propose me any solution. thank you for reading.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dhlp2n/both_technology_and_process_fix_help_me_in/',)", "identifyer": 5793177, "year": "2019"}, {"autor": "ExpressiveFrisk", "date": 1564535759000, "content": "I'm a student creating an article about the media control through data collection, and would like some advice. /!/ Hello. I'm a computer engineering student and would like some leads (articles, sites, podcasts, or your own thoughts) about this interesting, yet not so much commented theme: the possible media mass control of common population, through the use of personal data collection and Deep Learning.\n\n&amp;#x200B;\n\nThe three main topics about this theme are: \n\n&amp;#x200B;\n\n1. Media control (not necessarily the means of communication, but big companies, especially those who dominate the market).\n2. Personal data collecting: a hot topic considering it's influence in the electoral system, and the recent scandal about Cambridge Analytica.\n3. Deep Learning: a very interesting learning branch (personally) which makes me wonder: what if all the data collected under our noses, through the devices we use daily, was processed and fed to a Deep Learning program to generate ads, recommend shows or places, direct us to the way they want us to go...?\n\n&amp;#x200B;\n\nI hope it doesn't sound too much like a conspiracy theory, but some of these things already happen at a minor scale. I'm talking about MASSIVE control of common population, exacerbated consumism and (as already seen) control of a entire's country democracy system.\n\n&amp;#x200B;\n\nFurthermore, it's a work in progress, so I'm open to critics (please do). Also sorry for any incorrect english, please correct if necessary.", "link": "https://www.reddit.com/r/technology/comments/ck19uy/im_a_student_creating_an_article_about_the_media/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "i'm a student creating an article about the media control through data collection, and would like some advice. /!/ hello. i'm a computer engineering student and would like some leads (articles, sites, podcasts, or your own thoughts) about this interesting, yet not so much commented theme: the possible media mass control of common population, through the use of personal data collection and deep learning.\n\n&amp;#x200b;\n\nthe three main topics about this theme are: \n\n&amp;#x200b;\n\n1. media control (not necessarily the means of communication, but big companies, especially those who dominate the market).\n2. personal data collecting: a hot topic considering it's influence in the electoral system, and the recent scandal about cambridge analytica.\n3. deep learning: a very interesting learning -----> branch !!!  (personally) which makes me wonder: what if all the data collected under our noses, through the devices we use daily, was processed and fed to a deep learning program to generate ads, recommend shows or places, direct us to the way they want us to go...?\n\n&amp;#x200b;\n\ni hope it doesn't sound too much like a conspiracy theory, but some of these things already happen at a minor scale. i'm talking about massive control of common population, exacerbated consumism and (as already seen) control of a entire's country democracy system.\n\n&amp;#x200b;\n\nfurthermore, it's a work in progress, so i'm open to critics (please do). also sorry for any incorrect english, please correct if necessary.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ck19uy/im_a_student_creating_an_article_about_the_media/',)", "identifyer": 5805510, "year": "2019"}, {"autor": "varindia", "date": 1552634226000, "content": "JPMorgan Chase to open 90 branches this year - Employing 700 people", "link": "https://www.reddit.com/r/technology/comments/b1bsx6/jpmorgan_chase_to_open_90_branches_this_year/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "jpmorgan chase to open 90 -----> branches !!!  this year - employing 700 people", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://varindia.com/news/jpmorgan-chase-to-open-90-branches-this-year--employing-700-people#.XItRTKRaZuM.reddit',)", "identifyer": 5808575, "year": "2019"}, {"autor": "eggnoggman", "date": 1569925411000, "content": "WeWork used the same weak passwords and outdated Wi-Fi system throughout all its branches leaving tenants records exposed", "link": "https://www.reddit.com/r/technology/comments/dbrcfb/wework_used_the_same_weak_passwords_and_outdated/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "wework used the same weak passwords and outdated wi-fi system throughout all its -----> branches !!!  leaving tenants records exposed", "sortedWord": "None", "removed": "('nan',)", "score": 12, "comments": 1, "media": "('link',)", "medialink": "('https://perimeters81.com/weak-wework-wi-fi-network-security-leaves-ten',)", "identifyer": 5815690, "year": "2019"}, {"autor": "Proinlifes", "date": 1569920329000, "content": "WeWork used the same weak passwords and outdated Wi-Fi system throughout all its branches leaving tenants records exposed", "link": "https://www.reddit.com/r/technology/comments/dbqkjn/wework_used_the_same_weak_passwords_and_outdated/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "wework used the same weak passwords and outdated wi-fi system throughout all its -----> branches !!!  leaving tenants records exposed", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://perimeters81.com/weak-wework-wi-fi-network-security-leaves-ten',)", "identifyer": 5815703, "year": "2019"}, {"autor": "ShiekhW", "date": 1569839254000, "content": "U.S. Officials Warn of Rising Threat From Qaeda Branch in Northwest Syria", "link": "https://www.reddit.com/r/technology/comments/db9j6w/us_officials_warn_of_rising_threat_from_qaeda/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "u.s. officials warn of rising threat from qaeda -----> branch !!!  in northwest syria", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://worldtoures.blogspot.com/2019/09/us-officials-warn-of-rising-threat-from_95.html',)", "identifyer": 5818092, "year": "2019"}, {"autor": "SoftwareBrothers", "date": 1576576737000, "content": "5 GIT tips with branches that you should know | Software Brothers Blog", "link": "https://www.reddit.com/r/technology/comments/ebtw33/5_git_tips_with_branches_that_you_should_know/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "5 git tips with -----> branches !!!  that you should know | software brothers blog", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://softwarebrothers.co/blog/p/ab17fbea-0963-4c27-8a9e-7b2b0d351e88/',)", "identifyer": 5825212, "year": "2019"}, {"autor": "lesterosp", "date": 1552297463000, "content": "Rewriting of Medical Coding Automation using Artificial Intelligence /!/ The importance of Artificial Intelligence is often understated and also overstating the same is quite difficult.. to get in-depth with how AI is actually bringing changes in MCA, we must get to the basics of what Medical Billing and Coding really are.\n\n### MEDICAL CODING\n\n&amp;#x200B;\n\nMedical coding, if we talk about it at a very basic level -- is something that a coder takes, a written piece if you may, and translates it as accurately as possible into a coded format such as numeric or alphanumeric code. The piece that's taken for translation can be something such as a prescription for medication or a doctor's diagnosis or something else medical related. A code for each and every event is created, these events can be of injuries, diagnosis or medical procedures.\n\nPresently, there are about a hundred thousand codes existing that are used for medical procedures, outpatient procedures, and diagnoses. Let us have a look at a simple example of Medical Coding:\n\nLet's say that a patient has walked into a doctor’s office and he/she is coughing tirelessly, they have a high production of mucus, and have a dreaded fever. Then a nurse walks up to the patient and asks them their symptoms, once the symptoms are noted, she performs some initial tests to get an idea of what is actually going on, and then comes the doctor who analyzes and concludes the diagnoses saying that the patient is suffering from bronchitis. A medication is then prescribed to the patient by the doctor.\n\nNow comes the interesting part of Modern Healthcare, each and every part of the visit is recorded by the clinic be it the doctor or someone in the office who is authorized to carry out such operations. Then begins the coders job that is to translate all of relevant information of the visit into numeric and alphanumeric codes, which are ultimately used in the billing process.\n\nThe medical coder should be equipped with the knowledge of a few sets and subsets of code, let's take two of the subsets: International Classification of Diseases (ICD) these codes correspond to a patient’s injury or sickness, and Current Procedure Terminology (CPT) that are related to the functions and services Healthcare providers perform to the patient this can be as performing on them and performing for them.\n\nA task included for the Medical Coders is to translate every bit of data or information of the patient's visit to the clinic and shape it in the form of a code. There are different codes for different kinds of visits, some codes are more specific these specific codes can be such as the patients symptoms, the tests performed by the doctor and the diagnosis procedure used by the doctor.\n\nThe Medical Coders have to keep these guidelines in mind, they are very important and can affect the status of a claim. The coding process concludes when the Medical Coder has entered the proper codes into the for or software program. This is where the job of the Medical Coder ends, now, all of this is passed on to the Medical Biller.\n\n### MEDICAL BILLING\n\n&amp;#x200B;\n\nThe Medical Biller more so acts as a middleman between patients, healthcare providers and the insurance companies. Their job, is on similar lines in context to the Medical Coder. The Medical Biller translates the codes given by the Medical Coder into a financial report, they make sure that the Healthcare Provider has been reimbursed appropriately for the services they've provided.\n\nDo not be fooled by the simplicity of the term \"Medical Billing\", it may seem that all the Medical Billers task is to make a bill (Commonly known as a 'Claim') for the insurance company by the help of the information provided by the Medical Coder, the reality of the process is not as simple.\n\nContinuing with the previous example, the Medical Biller now looks at the codes, that consist of information of things such as the kind of visit, the symptoms, the diagnosis of the doctor, the medication prescribed by the doctor and then creates a Claim. The Claim is then sent and evaluated by the insurance company, and then returned back. The bill of the patient is then made by biller who carefully re-evaluates the returned claim after the insurance is removed, all of these tasks are performed through a form or software, they're called as [Medical Billing Software Solutions](https://www.osplabs.com/medical-billing-solutions/) and there's a large number of companies out there creating such solutions.\n\nThe biller takes a few factors into account such as the insurance plans of the patient into account while creating the bill, this ensures that an accurate bill is produced. In cases where the patient shows signs refraining the bill payment, the Medical Biller has to take appropriate steps to ensure healthcare provider is properly compensated.\n\n# Let's take a look at how a Traditional Medical Billing &amp; Coding Process Flows:\n\n&amp;#x200B;\n\nTalking about the word 'Traditional' you must have got an idea that it requires **ALOT** of manual documentation and paper work, the average time for a traditional coding and billing process stretched on to about 5-7 weeks whereas in the modern automated system the process is reduced to as low as 2 weeks.\n\nFollowing is a Claim-to-Payment Chase while using a traditional Paper-Based System.\n\n1. Patient visits the doctor’s office.\n2. Patient check-in, gets treated.\n3. Doctor or their assistant writes a superbill for the treatment.\n4. The Medical Coder writes codes for the treatment.\n5. Medical Billers receive Paper forms who then format the data and forward it to insurance payers.\n6. Payer generates check and send payment to the provider.\n\nNow the point where AI fits into the story is to enhance the efficiency and efficacy of the billing and coding process. *Computer Assisted Coding (CAC) is a technology that works on the concept of Machine Learning (ML) which is a branch of Artificial Intelligence (AI) and Natural Language Processing (NLP),* they provide automated assistance to the rigorous task of identifying and extracting data from the given documents and inserting it into the system.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/technology/comments/azrhh9/rewriting_of_medical_coding_automation_using/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "rewriting of medical coding automation using artificial intelligence /!/ the importance of artificial intelligence is often understated and also overstating the same is quite difficult.. to get in-depth with how ai is actually bringing changes in mca, we must get to the basics of what medical billing and coding really are.\n\n### medical coding\n\n&amp;#x200b;\n\nmedical coding, if we talk about it at a very basic level -- is something that a coder takes, a written piece if you may, and translates it as accurately as possible into a coded format such as numeric or alphanumeric code. the piece that's taken for translation can be something such as a prescription for medication or a doctor's diagnosis or something else medical related. a code for each and every event is created, these events can be of injuries, diagnosis or medical procedures.\n\npresently, there are about a hundred thousand codes existing that are used for medical procedures, outpatient procedures, and diagnoses. let us have a look at a simple example of medical coding:\n\nlet's say that a patient has walked into a doctor’s office and he/she is coughing tirelessly, they have a high production of mucus, and have a dreaded fever. then a nurse walks up to the patient and asks them their symptoms, once the symptoms are noted, she performs some initial tests to get an idea of what is actually going on, and then comes the doctor who analyzes and concludes the diagnoses saying that the patient is suffering from bronchitis. a medication is then prescribed to the patient by the doctor.\n\nnow comes the interesting part of modern healthcare, each and every part of the visit is recorded by the clinic be it the doctor or someone in the office who is authorized to carry out such operations. then begins the coders job that is to translate all of relevant information of the visit into numeric and alphanumeric codes, which are ultimately used in the billing process.\n\nthe medical coder should be equipped with the knowledge of a few sets and subsets of code, let's take two of the subsets: international classification of diseases (icd) these codes correspond to a patient’s injury or sickness, and current procedure terminology (cpt) that are related to the functions and services healthcare providers perform to the patient this can be as performing on them and performing for them.\n\na task included for the medical coders is to translate every bit of data or information of the patient's visit to the clinic and shape it in the form of a code. there are different codes for different kinds of visits, some codes are more specific these specific codes can be such as the patients symptoms, the tests performed by the doctor and the diagnosis procedure used by the doctor.\n\nthe medical coders have to keep these guidelines in mind, they are very important and can affect the status of a claim. the coding process concludes when the medical coder has entered the proper codes into the for or software program. this is where the job of the medical coder ends, now, all of this is passed on to the medical biller.\n\n### medical billing\n\n&amp;#x200b;\n\nthe medical biller more so acts as a middleman between patients, healthcare providers and the insurance companies. their job, is on similar lines in context to the medical coder. the medical biller translates the codes given by the medical coder into a financial report, they make sure that the healthcare provider has been reimbursed appropriately for the services they've provided.\n\ndo not be fooled by the simplicity of the term \"medical billing\", it may seem that all the medical billers task is to make a bill (commonly known as a 'claim') for the insurance company by the help of the information provided by the medical coder, the reality of the process is not as simple.\n\ncontinuing with the previous example, the medical biller now looks at the codes, that consist of information of things such as the kind of visit, the symptoms, the diagnosis of the doctor, the medication prescribed by the doctor and then creates a claim. the claim is then sent and evaluated by the insurance company, and then returned back. the bill of the patient is then made by biller who carefully re-evaluates the returned claim after the insurance is removed, all of these tasks are performed through a form or software, they're called as [medical billing software solutions](https://www.osplabs.com/medical-billing-solutions/) and there's a large number of companies out there creating such solutions.\n\nthe biller takes a few factors into account such as the insurance plans of the patient into account while creating the bill, this ensures that an accurate bill is produced. in cases where the patient shows signs refraining the bill payment, the medical biller has to take appropriate steps to ensure healthcare provider is properly compensated.\n\n# let's take a look at how a traditional medical billing &amp; coding process flows:\n\n&amp;#x200b;\n\ntalking about the word 'traditional' you must have got an idea that it requires **alot** of manual documentation and paper work, the average time for a traditional coding and billing process stretched on to about 5-7 weeks whereas in the modern automated system the process is reduced to as low as 2 weeks.\n\nfollowing is a claim-to-payment chase while using a traditional paper-based system.\n\n1. patient visits the doctor’s office.\n2. patient check-in, gets treated.\n3. doctor or their assistant writes a superbill for the treatment.\n4. the medical coder writes codes for the treatment.\n5. medical billers receive paper forms who then format the data and forward it to insurance payers.\n6. payer generates check and send payment to the provider.\n\nnow the point where ai fits into the story is to enhance the efficiency and efficacy of the billing and coding process. *computer assisted coding (cac) is a technology that works on the concept of machine learning (ml) which is a -----> branch !!!  of artificial intelligence (ai) and natural language processing (nlp),* they provide automated assistance to the rigorous task of identifying and extracting data from the given documents and inserting it into the system.\n\n&amp;#x200b;", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/azrhh9/rewriting_of_medical_coding_automation_using/',)", "identifyer": 5830506, "year": "2019"}, {"autor": "ShiekhW", "date": 1569860857000, "content": "U.S. Officials Warn of Rising Threat From Qaeda Branch in Northwest Syria", "link": "https://www.reddit.com/r/technology/comments/dbe3ik/us_officials_warn_of_rising_threat_from_qaeda/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "u.s. officials warn of rising threat from qaeda -----> branch !!!  in northwest syria", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://worldtoures.blogspot.com/2019/09/us-officials-warn-of-rising-threat-from_6.html',)", "identifyer": 5831853, "year": "2019"}, {"autor": "ShiekhW", "date": 1569817660000, "content": "U.S. Officials Warn of Rising Threat From Qaeda Branch in Northwest Syria", "link": "https://www.reddit.com/r/technology/comments/db6el3/us_officials_warn_of_rising_threat_from_qaeda/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "u.s. officials warn of rising threat from qaeda -----> branch !!!  in northwest syria", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://worldtoures.blogspot.com/2019/09/us-officials-warn-of-rising-threat-from_29.html',)", "identifyer": 5832682, "year": "2019"}, {"autor": "ShiekhW", "date": 1569806846000, "content": "U.S. Officials Warn of Rising Threat From Qaeda Branch in Northwest Syria", "link": "https://www.reddit.com/r/technology/comments/db4e6b/us_officials_warn_of_rising_threat_from_qaeda/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "u.s. officials warn of rising threat from qaeda -----> branch !!!  in northwest syria", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://worldtoures.blogspot.com/2019/09/us-officials-warn-of-rising-threat-from.html',)", "identifyer": 5832689, "year": "2019"}, {"autor": "oopsididnttakemymeds", "date": 1548983220000, "content": "A bit more detail on what Facebook losing its Enterprise App rights means /!/ Hi, former Facebook contractor here! Made a comment on the main post, figured I’ll branch it into its own thread and go into a bit more detail.\n\nBasically, losing the Enterprise App rights will impact bug and feature testing noticeably on iOS. However, moreso than that, it also impacts the daily operations of employees, which is where things will be getting even more fucky.\n\nIn short, every employee at Facebook, be it Developer, Human Resources, Janitor, Security Guard, or Chef has these internal apps. There’s one for Facebook, Messenger, Instagram, WhatsApp, there was one for Oculus IIRC. These apps were all the development builds for the apps. Anytime a test build was released, we had it. It was really cool because it meant everyone had a hand in testing out the features before they launch.\n\nHowever, it goes beyond that. We also had apps for Bus Routes, Menus at the Cafeterias, an FB appstore, and an app for a company wiki used primarily for bug tracking, employee resources, and the like. If the enterprise app permission is revoked, they potentially lose all of those resources.\nSadly for employees, there’s a lot of reliance on the internal apps for day-to-day use (I know the food app was a godsend when figuring out lunch plans) I would imagine this would have a huge shitshow on their end if they lose this resource.\n\nNow, they also had these apps for Android, so it’s not the end of the world. However, anyone at FB who’s an iOS user probably won’t be able to use these anymore. And again, I haven’t been with Facebook since last year. As someone who used these apps on a daily basis, and knowing others who did as well, it’s gonna have a larger impact than you’d expect.\n\nAlso, I’d imagine anyone who used these apps and wasn’t a developer for them is probably more than a little concerned about the data harvesting. But then again, they do work for Facebook. I’d be surprised if I didn’t sign anything that let them read all my DMs when I internalized my account.", "link": "https://www.reddit.com/r/technology/comments/alwhkr/a_bit_more_detail_on_what_facebook_losing_its/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "a bit more detail on what facebook losing its enterprise app rights means /!/ hi, former facebook contractor here! made a comment on the main post, figured i’ll -----> branch !!!  it into its own thread and go into a bit more detail.\n\nbasically, losing the enterprise app rights will impact bug and feature testing noticeably on ios. however, moreso than that, it also impacts the daily operations of employees, which is where things will be getting even more fucky.\n\nin short, every employee at facebook, be it developer, human resources, janitor, security guard, or chef has these internal apps. there’s one for facebook, messenger, instagram, whatsapp, there was one for oculus iirc. these apps were all the development builds for the apps. anytime a test build was released, we had it. it was really cool because it meant everyone had a hand in testing out the features before they launch.\n\nhowever, it goes beyond that. we also had apps for bus routes, menus at the cafeterias, an fb appstore, and an app for a company wiki used primarily for bug tracking, employee resources, and the like. if the enterprise app permission is revoked, they potentially lose all of those resources.\nsadly for employees, there’s a lot of reliance on the internal apps for day-to-day use (i know the food app was a godsend when figuring out lunch plans) i would imagine this would have a huge shitshow on their end if they lose this resource.\n\nnow, they also had these apps for android, so it’s not the end of the world. however, anyone at fb who’s an ios user probably won’t be able to use these anymore. and again, i haven’t been with facebook since last year. as someone who used these apps on a daily basis, and knowing others who did as well, it’s gonna have a larger impact than you’d expect.\n\nalso, i’d imagine anyone who used these apps and wasn’t a developer for them is probably more than a little concerned about the data harvesting. but then again, they do work for facebook. i’d be surprised if i didn’t sign anything that let them read all my dms when i internalized my account.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/alwhkr/a_bit_more_detail_on_what_facebook_losing_its/',)", "identifyer": 5834617, "year": "2019"}], "name": "branchtechnology2019"}