{"interestingcomments": [{"autor": "tirehabitat", "date": 1583179242000, "content": "Hear me out about the idea of phones ACTUALLY replacing computers. /!/ What I really want is a big serious discussion of ideas, thoughts, explanations of how or why it could or couldn't work, OR even just what would it take to replace your other devices.\n\n&amp;#x200B;\n\nSamsung DeX and Huawei EMUI, iPad OS (not the same but it could get there), Windows Continuum (dead), ARM on Windows (trying to be more mobile friendly with Smartphone tech).\n\nThey are all beating around the bush for what they could be. DeX and EMUI are the closest to REALLY appealing to me in terms of usability, but I wanted Windows and Apple to pull through because they are honestly the big influence... Love them or hate them, it's just how it is.\n\niPad OS was SO close to what I thought the iPad should do to begin with! Not dock on a literal MacBook but just become the MacBook [https://appleinsider.com/articles/20/01/28/apple-planning-iphones-and-ipads-that-can-dock-inside-macbooks](https://appleinsider.com/articles/20/01/28/apple-planning-iphones-and-ipads-that-can-dock-inside-macbooks) \n\nIf only iPad OS made use of the device to be able to take full advantage. *You can use a mouse (pointer) on the iPad*. **Poorly** but if people want it, they will catch on and make it better and more functional. The UI if used like a laptop is chunky, maybe they will listen and have an option to switch to a mode like that. I feel like Apple is so close too.\n\nSO what is great? What is missing and what could they add eventually?...\n\n**The Good:**\n\nDeX and EMUI are great. Scaling apps, multitasking, some pretty impressive app capabilities. \n\nWindows was a false hope but started the dock your phone and work on the go. Dock the phone, add accessories. What they needed was something like Windows 10 on ARM to be the base and make the rest of the mobile aspect work on that.\n\niPad OS just needs to turn into the laptop... All the talk about PC performance on their chip yet they use it to run mobile software... I still have some hope for Apple though they just need a push from competition. Like always these days.\n\n**What's missing?**\n\n1. USB C all the things! Standard USB C ports need to just support everything on one port.\n2. A setup.  (2a) Monitor + keyboard + trackpad + battery all in one -- [https://www.youtube.com/watch?v=PNCuEYF5uKk](https://www.youtube.com/watch?v=PNCuEYF5uKk) \\-- It needs a better screen and a few other things, but it's easy to setup and if made right it could support more just like a real Laptop. --   (2b.) A dock -- A proper one that has multiple USB Cs, display outputs and all the standard ports, to be able to work for a Desktop set up.\n3. Get the gamers involved in the market! -- Be able to connect external GPU with USB C -- NVIDIA has worked on ARM before, they could get on board with making it work. Steam would definitely hop on Linux again for Android and maybe use a x86 emulation (or better, the real deal) that Windows has already working better than it has before. -- this is a harder one that would take a while to get to work but the pieces are their I think.\n4. (**HARD** stretch) Microsoft needs to get back in the mobile game. If they base a phone for using ARM on Windows 10 as their selling point, they could maybe make a realistic reason for people to buy their phones. Directly compatible, if not eventual just completely replace, standard Windows 10\n\nPlease discuss. I'm not looking for just complete counter points to my thoughts. What do YOU want if smartphones replaced PCs and how do you think they could do it? Thanks.", "link": "https://www.reddit.com/r/technology/comments/fchxtd/hear_me_out_about_the_idea_of_phones_actually/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "bush", "selectorShort": "bush", "MarkedSent": "hear me out about the idea of phones actually replacing computers. /!/ what i really want is a big serious discussion of ideas, thoughts, explanations of how or why it could or couldn't work, or even just what would it take to replace your other devices.\n\n&amp;#x200b;\n\nsamsung dex and huawei emui, ipad os (not the same but it could get there), windows continuum (dead), arm on windows (trying to be more mobile friendly with smartphone tech).\n\nthey are all beating around the -----> bush !!!  for what they could be. dex and emui are the closest to really appealing to me in terms of usability, but i wanted windows and apple to pull through because they are honestly the big influence... love them or hate them, it's just how it is.\n\nipad os was so close to what i thought the ipad should do to begin with! not dock on a literal macbook but just become the macbook [https://appleinsider.com/articles/20/01/28/apple-planning-iphones-and-ipads-that-can-dock-inside-macbooks](https://appleinsider.com/articles/20/01/28/apple-planning-iphones-and-ipads-that-can-dock-inside-macbooks) \n\nif only ipad os made use of the device to be able to take full advantage. *you can use a mouse (pointer) on the ipad*. **poorly** but if people want it, they will catch on and make it better and more functional. the ui if used like a laptop is chunky, maybe they will listen and have an option to switch to a mode like that. i feel like apple is so close too.\n\nso what is great? what is missing and what could they add eventually?...\n\n**the good:**\n\ndex and emui are great. scaling apps, multitasking, some pretty impressive app capabilities. \n\nwindows was a false hope but started the dock your phone and work on the go. dock the phone, add accessories. what they needed was something like windows 10 on arm to be the base and make the rest of the mobile aspect work on that.\n\nipad os just needs to turn into the laptop... all the talk about pc performance on their chip yet they use it to run mobile software... i still have some hope for apple though they just need a push from competition. like always these days.\n\n**what's missing?**\n\n1. usb c all the things! standard usb c ports need to just support everything on one port.\n2. a setup.  (2a) monitor + keyboard + trackpad + battery all in one -- [https://www.youtube.com/watch?v=pncueyf5ukk](https://www.youtube.com/watch?v=pncueyf5ukk) \\-- it needs a better screen and a few other things, but it's easy to setup and if made right it could support more just like a real laptop. --   (2b.) a dock -- a proper one that has multiple usb cs, display outputs and all the standard ports, to be able to work for a desktop set up.\n3. get the gamers involved in the market! -- be able to connect external gpu with usb c -- nvidia has worked on arm before, they could get on board with making it work. steam would definitely hop on linux again for android and maybe use a x86 emulation (or better, the real deal) that windows has already working better than it has before. -- this is a harder one that would take a while to get to work but the pieces are their i think.\n4. (**hard** stretch) microsoft needs to get back in the mobile game. if they base a phone for using arm on windows 10 as their selling point, they could maybe make a realistic reason for people to buy their phones. directly compatible, if not eventual just completely replace, standard windows 10\n\nplease discuss. i'm not looking for just complete counter points to my thoughts. what do you want if smartphones replaced pcs and how do you think they could do it? thanks.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/fchxtd/hear_me_out_about_the_idea_of_phones_actually/',)", "identifyer": 5527803, "year": "2020"}], "name": "bushtechnology2020"}