{"interestingcomments": [{"autor": "virinchi12", "date": 1549418436000, "content": "Best Interior Landscaping Designers in Hyderabad - Landscape Gardens", "link": "https://www.reddit.com/r/technology/comments/anln21/best_interior_landscaping_designers_in_hyderabad/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "gardens", "selectorShort": "garden", "MarkedSent": "best interior landscaping designers in hyderabad - landscape -----> gardens !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('http://www.8virinchi.com/services/interiors/landscape-gardens/',)", "identifyer": 5759659, "year": "2019"}, {"autor": "ShadowDancer11", "date": 1558749896000, "content": "Supreme Court Rules Anti-Trust Lawsuit Filed Against Apple May Proceed /!/  \n\nApple had an unfavorable review by the Supreme Court and SCOTUS has ruled an anti-trust suit brought against Apple by consumers may  proceed. Its basis is Apple’s monopolistic practices governing “i”  devices as it relates to their ability to install and purchase apps ONLY  through their App Store.s about to receive the comeuppance for their overly restrictive iOS walled garden.\n\n&amp;#x200B;\n\nI feel this will be one of the largest tech anti-trust cases in the last 10  years whose outcome won't only serve as an industry bell-weather, but could radically reshape Apple's i-device product  strategy, the walled garden, Apple revenue models, app developers access  iOS devices, consumer pricing for apps, consumer choice, etc. etc. \n\n&amp;#x200B;\n\nThe wall garden, something which is not a practice in MacOS / OSX (*although  about 4 updates ago, Apple made it harder to install non-signed  software by “hiding” the ‘install from anywhere’ option. Users must now  open Terminal and type in a command line instruction to shut down  gatekeeper. A process which was not documented, the ordinary user would  be unfamiliar with and maybe even intimidated by*), has been touted by Apple for a decade now as necessary for security. \n\n&amp;#x200B;\n\nThe suit has the same basic premise of the FTC suit against Qualcomm: The royalties Apple charges developers on Apps and in game purchases, often as high as 30%, artificially raises prices to consumers and as Apple walls off any  other method of app installation (without Jailbreak of course which  voids the warranty), consumers are restricted of choice, competition is stifled, and owners of “i” devices must pay higher prices while  developers make lower profit.\n\n&amp;#x200B;\n\nIf the  ruling is unfavorable, this is going to shatter Apple’s device and app  revenue model. Apple have to make an open the file structure section of  iOS or create an enclave that doesn’t restrict a user from side loading  apps to their device that have not been signed by Apple.\n\nAs  far as royalties, I can imagine Apple would have to adjust their policy  and who knows - the judge may even impose a fine for economic harm  imposed to developers and consumers. Why should Apple be entitled to a  share of revenue when a kid purchases a new dance move in Fortnite?\n\nApple  played no role in the development of the game, does not provide updates  to the game, takes no capital risk, nor provided or maintains the game  servers or communication network needed to play the game - so why should  Apple be entitled to royalties.", "link": "https://www.reddit.com/r/technology/comments/bspbxd/supreme_court_rules_antitrust_lawsuit_filed/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "supreme court rules anti-trust lawsuit filed against apple may proceed /!/  \n\napple had an unfavorable review by the supreme court and scotus has ruled an anti-trust suit brought against apple by consumers may  proceed. its basis is apple’s monopolistic practices governing “i”  devices as it relates to their ability to install and purchase apps only  through their app store.s about to receive the comeuppance for their overly restrictive ios walled -----> garden !!! .\n\n&amp;#x200b;\n\ni feel this will be one of the largest tech anti-trust cases in the last 10  years whose outcome won't only serve as an industry bell-weather, but could radically reshape apple's i-device product  strategy, the walled garden, apple revenue models, app developers access  ios devices, consumer pricing for apps, consumer choice, etc. etc. \n\n&amp;#x200b;\n\nthe wall garden, something which is not a practice in macos / osx (*although  about 4 updates ago, apple made it harder to install non-signed  software by “hiding” the ‘install from anywhere’ option. users must now  open terminal and type in a command line instruction to shut down  gatekeeper. a process which was not documented, the ordinary user would  be unfamiliar with and maybe even intimidated by*), has been touted by apple for a decade now as necessary for security. \n\n&amp;#x200b;\n\nthe suit has the same basic premise of the ftc suit against qualcomm: the royalties apple charges developers on apps and in game purchases, often as high as 30%, artificially raises prices to consumers and as apple walls off any  other method of app installation (without jailbreak of course which  voids the warranty), consumers are restricted of choice, competition is stifled, and owners of “i” devices must pay higher prices while  developers make lower profit.\n\n&amp;#x200b;\n\nif the  ruling is unfavorable, this is going to shatter apple’s device and app  revenue model. apple have to make an open the file structure section of  ios or create an enclave that doesn’t restrict a user from side loading  apps to their device that have not been signed by apple.\n\nas  far as royalties, i can imagine apple would have to adjust their policy  and who knows - the judge may even impose a fine for economic harm  imposed to developers and consumers. why should apple be entitled to a  share of revenue when a kid purchases a new dance move in fortnite?\n\napple  played no role in the development of the game, does not provide updates  to the game, takes no capital risk, nor provided or maintains the game  servers or communication network needed to play the game - so why should  apple be entitled to royalties.", "sortedWord": "None", "removed": "('nan',)", "score": 4, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bspbxd/supreme_court_rules_antitrust_lawsuit_filed/',)", "identifyer": 5761393, "year": "2019"}, {"autor": "PMJosep", "date": 1554851045000, "content": "Home &amp; Garden : Crafts &amp; Hobbies /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/bbepii/home_garden_crafts_hobbies/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "home &amp; -----> garden !!!  : crafts &amp; hobbies /!/ [removed]", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bbepii/home_garden_crafts_hobbies/',)", "identifyer": 5761863, "year": "2019"}, {"autor": "corporatemumbojumbo", "date": 1565830320000, "content": "Quartz | Apple locked me out of its walled garden. It was a nightmare", "link": "https://www.reddit.com/r/technology/comments/cqiqs9/quartz_apple_locked_me_out_of_its_walled_garden/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "quartz | apple locked me out of its walled -----> garden !!! . it was a nightmare", "sortedWord": "None", "removed": "('nan',)", "score": 4, "comments": 2, "media": "('nan',)", "medialink": "('https://qz.com/co/2591348/apple-locked-me-out-of-its-walled-garden-it-was-a-nightmare/',)", "identifyer": 5766040, "year": "2019"}, {"autor": "OGarden_Smart", "date": 1550780401000, "content": "OGarden Smart: Grow An Indoor Garden of 90 Fruits &amp; Veggies", "link": "https://www.reddit.com/r/technology/comments/at7wi3/ogarden_smart_grow_an_indoor_garden_of_90_fruits/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "ogarden smart: grow an indoor -----> garden !!!  of 90 fruits &amp; veggies", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/at7wi3/ogarden_smart_grow_an_indoor_garden_of_90_fruits/',)", "identifyer": 5788208, "year": "2019"}, {"autor": "MrIonSol", "date": 1575753973000, "content": "Illumination in Tokyo Midtown | Starlight Garden", "link": "https://www.reddit.com/r/technology/comments/e7k7e8/illumination_in_tokyo_midtown_starlight_garden/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "illumination in tokyo midtown | starlight -----> garden !!! ", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('rich:video',)", "medialink": "('https://www.youtube.com/watch?v=v6dv6PUDPTw&amp;feature=share',)", "identifyer": 5794708, "year": "2019"}, {"autor": "EddyTheDad", "date": 1562504236000, "content": "Homemade: Green City solution (Garden Controller)", "link": "https://www.reddit.com/r/technology/comments/ca6jly/homemade_green_city_solution_garden_controller/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "homemade: green city solution (-----> garden !!!  controller)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://vinsloev.blogspot.com/2019/03/homemade-green-city-solution-garden.html',)", "identifyer": 5809364, "year": "2019"}, {"autor": "mvea", "date": 1547456731000, "content": "Apple’s famous walled garden is starting to show cracks", "link": "https://www.reddit.com/r/technology/comments/afu10b/apples_famous_walled_garden_is_starting_to_show/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "apple’s famous walled -----> garden !!!  is starting to show cracks", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.cnbc.com/2019/01/09/apple-walled-garden-starting-to-show-cracks.html',)", "identifyer": 5812692, "year": "2019"}, {"autor": "trollissimo9", "date": 1566849903000, "content": "Hello, I have a tech question sound related. I am looking to buy speakers that I can connect to a laptop for a bar that I am opening. /!/ I have a huge playlist on my Laptop made for bar, but I have to buy some big ass speakers both for inside and outside of bar, because I have garden in front of the bar. I wan them to be connected to my laptop and I think 8 of them would be a great choice. I need some recommendations, which kind I have to look for, how I can connect multiple amount of them to my laptop, etc. Thank you!", "link": "https://www.reddit.com/r/technology/comments/cvtauv/hello_i_have_a_tech_question_sound_related_i_am/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "hello, i have a tech question sound related. i am looking to buy speakers that i can connect to a laptop for a bar that i am opening. /!/ i have a huge playlist on my laptop made for bar, but i have to buy some big ass speakers both for inside and outside of bar, because i have -----> garden !!!  in front of the bar. i wan them to be connected to my laptop and i think 8 of them would be a great choice. i need some recommendations, which kind i have to look for, how i can connect multiple amount of them to my laptop, etc. thank you!", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 12, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/cvtauv/hello_i_have_a_tech_question_sound_related_i_am/',)", "identifyer": 5819371, "year": "2019"}, {"autor": "mvea", "date": 1561139629000, "content": "Inside Apple’s walled garden, developers take cover from Silicon Valley’s storms", "link": "https://www.reddit.com/r/technology/comments/c3dxy8/inside_apples_walled_garden_developers_take_cover/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "inside apple’s walled -----> garden !!! , developers take cover from silicon valley’s storms", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 0, "media": "('link',)", "medialink": "('https://www.theverge.com/2019/6/21/18693877/apple-wwdc-2019-privacy-walled-garden-antitrust-developers-app-store',)", "identifyer": 5824163, "year": "2019"}, {"autor": "mj_bee", "date": 1568013479000, "content": "Solar panels are getting so cheap people have started using them as garden fences that double as electricity generators", "link": "https://www.reddit.com/r/technology/comments/d1nk9l/solar_panels_are_getting_so_cheap_people_have/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "solar panels are getting so cheap people have started using them as -----> garden !!!  fences that double as electricity generators", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('link',)", "medialink": "('https://pbs.twimg.com/media/ED3cAG-XkAAVjib?format=jpg&amp;name=900x900',)", "identifyer": 5832042, "year": "2019"}, {"autor": "greenyuga", "date": 1571898994000, "content": "Vegetable Rooftop Garden Bangalore | Balcony Vegetable Garden | Terrace Garden Construction - Greenyuga", "link": "https://www.reddit.com/r/technology/comments/dmchit/vegetable_rooftop_garden_bangalore_balcony/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "vegetable rooftop -----> garden !!!  bangalore | balcony vegetable -----> garden !!!  | terrace -----> garden !!!  construction - greenyuga", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.greenyuga.com/vegetable-rooftop-garden/',)", "identifyer": 5832853, "year": "2019"}, {"autor": "4eak", "date": 1573148553000, "content": "Fraidycat - Toward Following People Instead of Platforms /!/ Fraidycat is a delightful browser extension for following people on the interwebs. It's an easy-to-use yet hackable, FOSS, privacy-respecting, and experimental next-generation feed aggregator and reader. Not every platform offers RSS, so Fraidycat tries to build those bridges for you, scraping and packaging it up for you automagically. It aims to enable you to tailor your own feeds, priorities, and timelines from across the web in your browser.\n\nInstead of being beholden to cycling through endless applications and platforms to follow people: use Fraidycat to simplify, defragment, and take ownership of your window into the lives of others on the web. Fraidycat is afraid of what the web has become (and is becoming), and it's savagely fighting back.\n\nI want to bypass the treadmills and middlemen which aim to commodify my attention span and the pipelines between me and others. I don't want my browser to become just some surveilled thin-client dehumanizingly displaying a walled-garden web engineered by whatever an oligarchy of corporations chooses for me. Fraidycat allows me to more independently use my resources to track and represent people on the web for me. I'm convinced it gives the power of surfing and taking the pulse of the web back to the user.\n\nYou own the aggregation process with Fraidycat because it runs in your browser. Political and technological autonomy requires turnkey tooling for users to actively shape the algorithms which pick out what they find salient on their own terms and devices. We have to shape our own filter-bubbles and how we feed ourselves information. Fraidycat is the kind of a lens-crafting tool we need.\n\nTake you, like, two minutes and try you one out: https://fraidyc.at/.", "link": "https://www.reddit.com/r/technology/comments/dt16ny/fraidycat_toward_following_people_instead_of/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "fraidycat - toward following people instead of platforms /!/ fraidycat is a delightful browser extension for following people on the interwebs. it's an easy-to-use yet hackable, foss, privacy-respecting, and experimental next-generation feed aggregator and reader. not every platform offers rss, so fraidycat tries to build those bridges for you, scraping and packaging it up for you automagically. it aims to enable you to tailor your own feeds, priorities, and timelines from across the web in your browser.\n\ninstead of being beholden to cycling through endless applications and platforms to follow people: use fraidycat to simplify, defragment, and take ownership of your window into the lives of others on the web. fraidycat is afraid of what the web has become (and is becoming), and it's savagely fighting back.\n\ni want to bypass the treadmills and middlemen which aim to commodify my attention span and the pipelines between me and others. i don't want my browser to become just some surveilled thin-client dehumanizingly displaying a walled------> garden !!!  web engineered by whatever an oligarchy of corporations chooses for me. fraidycat allows me to more independently use my resources to track and represent people on the web for me. i'm convinced it gives the power of surfing and taking the pulse of the web back to the user.\n\nyou own the aggregation process with fraidycat because it runs in your browser. political and technological autonomy requires turnkey tooling for users to actively shape the algorithms which pick out what they find salient on their own terms and devices. we have to shape our own filter-bubbles and how we feed ourselves information. fraidycat is the kind of a lens-crafting tool we need.\n\ntake you, like, two minutes and try you one out: https://fraidyc.at/.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/dt16ny/fraidycat_toward_following_people_instead_of/',)", "identifyer": 5832953, "year": "2019"}], "name": "gardentechnology2019"}