{"interestingcomments": [{"autor": "robertserry", "date": 1556803160000, "content": "TIC Services Market is propelled by the increasing trend of outsourcing services over 2018-2024", "link": "https://www.reddit.com/r/technology/comments/bjuust/tic_services_market_is_propelled_by_the/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "tic services market is -----> propelled !!!  by the increasing trend of outsourcing services over 2018-2024", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.marketwatch.com/press-release/tic-services-market-is-propelled-by-the-increasing-trend-of-outsourcing-services-over-2018-2024-2019-04-30',)", "identifyer": 5769575, "year": "2019"}, {"autor": "ShiekhW", "date": 1562430461000, "content": "In Sudan, a Secret Meeting and Public Rage Propelled a Power-Sharing Deal", "link": "https://www.reddit.com/r/technology/comments/c9vgx2/in_sudan_a_secret_meeting_and_public_rage/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "in sudan, a secret meeting and public rage -----> propelled !!!  a power-sharing deal", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://worldtoures.blogspot.com/2019/07/in-sudan-secret-meeting-and-public-rage_34.html',)", "identifyer": 5786395, "year": "2019"}, {"autor": "ShiekhW", "date": 1562419655000, "content": "In Sudan, a Secret Meeting and Public Rage Propelled a Power-Sharing Deal", "link": "https://www.reddit.com/r/technology/comments/c9tky2/in_sudan_a_secret_meeting_and_public_rage/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "in sudan, a secret meeting and public rage -----> propelled !!!  a power-sharing deal", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('http://worldtoures.blogspot.com/2019/07/in-sudan-secret-meeting-and-public-rage_6.html',)", "identifyer": 5809071, "year": "2019"}, {"autor": "ShiekhW", "date": 1562408854000, "content": "In Sudan, a Secret Meeting and Public Rage Propelled a Power-Sharing Deal", "link": "https://www.reddit.com/r/technology/comments/c9s5dc/in_sudan_a_secret_meeting_and_public_rage/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "in sudan, a secret meeting and public rage -----> propelled !!!  a power-sharing deal", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://worldtoures.blogspot.com/2019/07/in-sudan-secret-meeting-and-public-rage_90.html',)", "identifyer": 5809090, "year": "2019"}, {"autor": "ShiekhW", "date": 1562398055000, "content": "In Sudan, a Secret Meeting and Public Rage Propelled a Power-Sharing Deal", "link": "https://www.reddit.com/r/technology/comments/c9qwrv/in_sudan_a_secret_meeting_and_public_rage/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "in sudan, a secret meeting and public rage -----> propelled !!!  a power-sharing deal", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://worldtoures.blogspot.com/2019/07/in-sudan-secret-meeting-and-public-rage_5.html',)", "identifyer": 5809110, "year": "2019"}, {"autor": "ShiekhW", "date": 1562387251000, "content": "In Sudan, a Secret Meeting and Public Rage Propelled a Power-Sharing Deal", "link": "https://www.reddit.com/r/technology/comments/c9pg3v/in_sudan_a_secret_meeting_and_public_rage/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "in sudan, a secret meeting and public rage -----> propelled !!!  a power-sharing deal", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://worldtoures.blogspot.com/2019/07/in-sudan-secret-meeting-and-public-rage.html',)", "identifyer": 5809127, "year": "2019"}, {"autor": "plangan107", "date": 1555419795000, "content": "Why Hyperloop is still a deadly scientific fantasy /!/  \n\n## Deconstructing the Hype in Hyperloop\n\n&amp;#x200B;\n\nWith three test tracks and a empty passenger pod built the hyperloop hyperbole is building. What are the real dangers and challenges with the hyperloop theory?\n\n&amp;#x200B;\n\nI like the simple definition of Hyperloop in RationalWiki - *\" It involves a tube evacuated to very low pressure in which pods are propelled forward, using magnets, at speeds in excess of 1000 km/h. In essence it is a pneumatic tube on steroids or a magnetically levitated train inside a vacuum tube.\"*\n\n&amp;#x200B;\n\nThe technology currently does not exist except as a theoretical concept.\n\n&amp;#x200B;\n\nIn Canada, Transport Canada has begun a study to evaluate hyperloop. The fact is over 22 studies have been done on high speed rail in this country and we still have no high speed trains although it is a proven safe technology for over a half a century. So why spend taxpayers money on looking at hyperloop? \n\n&amp;#x200B;\n\nThere is a Canadian company called [Transpod](https://transpod.com/en/) who have a plan to build hyperloop. They have recently threatened to leave Canada for Europe if they are not successful in getting financial support in Canada.\n\n### What are some of the critical problems in trying to make hyperloop become a reality?\n\n#### Security-wise \n\nIt’s easy to destroy this system by making a small dent in the tube. Yes, it’s one inch thick steel, but there are easily attainable ways to dent one-inch steel. When you hit a small bump protruding inside the tube while going at 1,000 km/h nothing good can possibly happen regardless of capsule suspension design. As proposed the system is impossible to secure - [*Clem Tillier*](http://www.cahsrblog.com/2013/08/hyping-the-hyperloop/#comment-195825)\n\n#### Sudden Decompression \n\nThe whole thing about hard vacuum versus partial vacuum is academic This is a 99.9% vacuum. In a sudden decompression the passengers cannot survive, regardless of whether oxygen masks are available. This is unlike an airliner where there is always sufficient residual pressure and oxygen to survive even the worst-case decompression event. - [*Clem Tillier*](http://www.cahsrblog.com/2013/08/hyping-the-hyperloop/#comment-195825)\n\n#### Thermal Expansion\n\n Due to changes in  temperature, the steel would change in structure. In bridges there are expansion joints to allow it to expand and shrink without compromising the structural integrity. The Hyperloop will require thermal expansion joints to function. Installing the joints on bridges is easy enough, however, they do not need to maintain a seal holding back billions of kilograms of force.\n\nPhil Mason predicts the Hyperloop will require a joint every 100 meters. Over the entire distance, it would accumulate 6000 moving vacuum seals - all of which are a significant point of failure.\n\n\"A failure on any one of them would be disastrous to everyone inside\"  Phil Mason - [*The Hyperloop Busted Video.*](https://www.youtube.com/watch?v=RNFesa01llk)\n\n#### Pressure\n\nA proposed Hyperloop of 600 km with a diameter of about two meters,  will maintain a surface area of about four million meters squared. Given one square meter will experience 10,000 kg of force, the Hyperloop will have to endure nearly 40 billion kilograms of force over its entire surface.\n\nA small compromise in the structure of the tube would result in a catastrophic implosion. If the tube became punctured, external air would tear into the tube, shredding it apart as it violently rushes in to fill the void. -[ *Interesting Engineering - June 29th, 2017*](https://interestingengineering.com/biggest-challenges-stand-in-the-way-of-hyperloop)\n\n#### G-Force and Illness\n\nElon Musk's planned route is designed to limit lateral G-forces to a maximum of 0.5 Gs.\n\nAccording to James Powell PhD that’s a problem: \"In all our tests, we found people started to feel nauseous when you went above 0.2 lateral Gs.\" The closest comparison would be roller coasters, which usually top out around half a G — but the Hyperloop wouldn't just peak at 0.5; it would stay there for the duration of the curve. The result would be well short of blackout, which most studies peg around 4.7 lateral Gs, but it would make the Hyperloop challenging for the faint of stomach. A sick passenger might be less catastrophic than a crash but, given the tight passenger compartments, the results could still be fairly traumatic. - [*The Verge*](https://www.theverge.com/2013/8/16/4626506/speed-bumps-and-vomit-are-the-hyperloops-biggest-challenges)\n\nThere are many more problems with the concept of hyperloop, we will examine them in a future issue. Taken from Paul Langan's article in [High Speed Rail Canada](https://www.highspeedrailcanada.com/2019/04/deconstructing-hype-in-hyperloop.html)", "link": "https://www.reddit.com/r/technology/comments/bdtop2/why_hyperloop_is_still_a_deadly_scientific_fantasy/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "why hyperloop is still a deadly scientific fantasy /!/  \n\n## deconstructing the hype in hyperloop\n\n&amp;#x200b;\n\nwith three test tracks and a empty passenger pod built the hyperloop hyperbole is building. what are the real dangers and challenges with the hyperloop theory?\n\n&amp;#x200b;\n\ni like the simple definition of hyperloop in rationalwiki - *\" it involves a tube evacuated to very low pressure in which pods are -----> propelled !!!  forward, using magnets, at speeds in excess of 1000 km/h. in essence it is a pneumatic tube on steroids or a magnetically levitated train inside a vacuum tube.\"*\n\n&amp;#x200b;\n\nthe technology currently does not exist except as a theoretical concept.\n\n&amp;#x200b;\n\nin canada, transport canada has begun a study to evaluate hyperloop. the fact is over 22 studies have been done on high speed rail in this country and we still have no high speed trains although it is a proven safe technology for over a half a century. so why spend taxpayers money on looking at hyperloop? \n\n&amp;#x200b;\n\nthere is a canadian company called [transpod](https://transpod.com/en/) who have a plan to build hyperloop. they have recently threatened to leave canada for europe if they are not successful in getting financial support in canada.\n\n### what are some of the critical problems in trying to make hyperloop become a reality?\n\n#### security-wise \n\nit’s easy to destroy this system by making a small dent in the tube. yes, it’s one inch thick steel, but there are easily attainable ways to dent one-inch steel. when you hit a small bump protruding inside the tube while going at 1,000 km/h nothing good can possibly happen regardless of capsule suspension design. as proposed the system is impossible to secure - [*clem tillier*](http://www.cahsrblog.com/2013/08/hyping-the-hyperloop/#comment-195825)\n\n#### sudden decompression \n\nthe whole thing about hard vacuum versus partial vacuum is academic this is a 99.9% vacuum. in a sudden decompression the passengers cannot survive, regardless of whether oxygen masks are available. this is unlike an airliner where there is always sufficient residual pressure and oxygen to survive even the worst-case decompression event. - [*clem tillier*](http://www.cahsrblog.com/2013/08/hyping-the-hyperloop/#comment-195825)\n\n#### thermal expansion\n\n due to changes in  temperature, the steel would change in structure. in bridges there are expansion joints to allow it to expand and shrink without compromising the structural integrity. the hyperloop will require thermal expansion joints to function. installing the joints on bridges is easy enough, however, they do not need to maintain a seal holding back billions of kilograms of force.\n\nphil mason predicts the hyperloop will require a joint every 100 meters. over the entire distance, it would accumulate 6000 moving vacuum seals - all of which are a significant point of failure.\n\n\"a failure on any one of them would be disastrous to everyone inside\"  phil mason - [*the hyperloop busted video.*](https://www.youtube.com/watch?v=rnfesa01llk)\n\n#### pressure\n\na proposed hyperloop of 600 km with a diameter of about two meters,  will maintain a surface area of about four million meters squared. given one square meter will experience 10,000 kg of force, the hyperloop will have to endure nearly 40 billion kilograms of force over its entire surface.\n\na small compromise in the structure of the tube would result in a catastrophic implosion. if the tube became punctured, external air would tear into the tube, shredding it apart as it violently rushes in to fill the void. -[ *interesting engineering - june 29th, 2017*](https://interestingengineering.com/biggest-challenges-stand-in-the-way-of-hyperloop)\n\n#### g-force and illness\n\nelon musk's planned route is designed to limit lateral g-forces to a maximum of 0.5 gs.\n\naccording to james powell phd that’s a problem: \"in all our tests, we found people started to feel nauseous when you went above 0.2 lateral gs.\" the closest comparison would be roller coasters, which usually top out around half a g — but the hyperloop wouldn't just peak at 0.5; it would stay there for the duration of the curve. the result would be well short of blackout, which most studies peg around 4.7 lateral gs, but it would make the hyperloop challenging for the faint of stomach. a sick passenger might be less catastrophic than a crash but, given the tight passenger compartments, the results could still be fairly traumatic. - [*the verge*](https://www.theverge.com/2013/8/16/4626506/speed-bumps-and-vomit-are-the-hyperloops-biggest-challenges)\n\nthere are many more problems with the concept of hyperloop, we will examine them in a future issue. taken from paul langan's article in [high speed rail canada](https://www.highspeedrailcanada.com/2019/04/deconstructing-hype-in-hyperloop.html)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bdtop2/why_hyperloop_is_still_a_deadly_scientific_fantasy/',)", "identifyer": 5816966, "year": "2019"}], "name": "propeltechnology2019"}