{"interestingcomments": [{"autor": "sankarsp", "date": 1553240604000, "content": "Data Mining Tools /!/  \n\n### Data Mining Tools\n\n**Introduction to Data Mining Tools :**\n\nData mining is defined as a process used to extract usable data from a larger set of any raw data which implies analysing data patterns in large batches of data using one or more software.\n\nData mining is the process of discovering patterns in large data sets.\n\nData mining is the analysis step of the “knowledge discovery in databases” process, or KDD.\n\n&amp;#x200B;\n\n**Brief Introduction of Data Ming Tasks**\n\nThere are several data mining tasks such as classification, prediction, Outlier detection, clustering, Regression and Decision Tree etc. All these tasks are either fall in predictive data mining tasks or descriptive data mining tasks. A data mining system execute one or more tasks as part of data mining.\n\n1. **Classification**\n\n* Classification technique is used for assigning the items into target categories or classes which is used to predict what will occur within the class accurately.\n* It classifies each item in a set of data into one of a predefined set of classes or groups.\n\n1. **Outlier Detection**\n\nOutliers is defined as the data objects that do not comply with the general behaviour or model of the data available.\n\n1. **Clustering**\n\nCluster analysis is one of the techniques of data mining by which related records are grouped. As a result, objects are like one another within the same group. Although, they are different in same or other clusters.\n\n1. **Regression**\n\nThis technique is used for establishing the dependency between the two variables so that causal relationship can be used to predict the outcome.\n\n1. **Prediction**\n\nPrediction is made by finding the relationship between independent and dependent variables.\n\n1. **Decision Trees**\n\n* Decision tree is one of the analytical technique of Data Mining.\n* This technique is used for categorising or predict data.\n\n**Important Data Mining Tools**\n\nThere are different Data Mining Tools for performing data mining tasks are as follows,\n\n1. **Oracle Data Mining**\n\n* It is Proprietary License Software.\n* It provides us data mining algorithms for data classification, prediction, regression and specialized analytics that enables analysts to analyse insights, make better predictions, target best customers, identify cross-selling opportunities &amp; detect fraud.\n* The algorithms designed inside ODM leverage has the strengths of Oracle database.\n* The data mining feature of SQL can dig data out of database tables, views, and schemas.\n* The GUI of Oracle data miner is an extended version of Oracle SQL Developer.\n* It provides a facility of direct ‘drag &amp; drop’ of data inside the database to users thus giving better insight.\n\n1. **IBM SPSS Modeler**\n\n* It is Proprietary License Software.\n* It was originally produced by SPSS Inc. and later acquired by IBM.\n* It is a software suite owned by [IBM ](https://www.ibm.com/in-en/)that is used for data mining &amp; text data analytics.\n* It has a rich visual interface that allows users to work with data mining algorithms without the need of programming.\n* It eliminates the unnecessary complexities faced during data transformations and to make easy to use predictive models.\n* IBM SPSS comes in two editions, based on the features\n* IBM SPSS Modeler Professional\n* IBM SPSS Modeler Premium- contains additional features of text analytics, entity analytics etc.\n\n1. **Weka**\n\n* It is open source and free software.\n* It is best suited for data analysis and predictive modelling.\n* It contains algorithms and visualization tools that support data mining tasks and machine learning.\n* Weka has a GUI that gives easy access to all its features.\n* It is written in JAVA language.\n* Weka supports major data mining tasks including data mining, processing, visualization, regression etc.\n* Weka can also provide access to SQL Databases through database connectivity and can further process the data returned by the query.\n\n1. **IBM Cognos** \n\n* It is Proprietary License Software.\n* BM Cognos BI is an intelligence suite owned by IBM for reporting and data analysis, score carding etc.\n* It consists of sub-components that meet specific organizational requirements Cognos Connection, Query Studio, Report Studio, Analysis Studio, Event studio &amp; Workspace Advance.\n   * **Cognos Connection:**It is a web portal to gather and summarize data in scoreboard/reports.\n   * **Query Studio:**It contains queries to format data &amp; create diagrams.\n   * **Report Studio:**It is used to generate management reports.\n   * **Analysis Studio:**It is used to process large data volumes, understand &amp; identify trends.\n   * **Event Studio:**Notification module to keep in sync with events.\n   * **Workspace Advanced:**User-friendly interface to create personalized &amp; user-friendly documents.\n\n1. **Rapid Miner Software**\n\n* It is anOpen source software.\n* It is one of the best predictive analysis systems developed by the company with the same name as the Rapid Miner.\n* Written in JAVA programming language.\n* It provides an integrated environment for deep learning, text mining, machine learning &amp; predictive analysis.\n* It can be used for over various applications such as business applications, commercial applications, training, education, research, application development, machine learning.\n* Rapid Miner offers the server as both on premise &amp; in public/private cloud infrastructures.\n* It has a client/server model as its base.\n* Rapid Miner comes with template-based frameworks that enable speedy delivery with reduced number of errors.\n* Rapid Miner has three modules,\n\n1. Rapid Miner Studio- This module is for workflow design, prototyping, validation etc.\n2. Rapid Miner Server- To operate predictive data models created in studio\n3. Rapid Miner Radoop- Executes processes directly in Hadoop cluster to simplify predictive analysis.\n\n**6. Orange Software** \n\n* It is anOpen Source Software\n* It is suite for machine learning &amp; data mining tasks.\n* It best aids the data visualization and is a component-based software.\n* It is written in Python language.\n* Data coming to Orange software gets quickly formatted to the desired pattern and it can be easily moved where needed by simply moving/flipping the widgets.\n* It is a component-based software, the components of orange are called ‘widgets’. These widgets range from data visualization &amp; pre-processing to an evaluation of algorithms and predictive modelling.\n* Widgets provide major functionalities like\n\n1. Showing data table and allowing to select features\n2. Reading the data\n3. Training predictors and to compare learning algorithms\n4. Visualizing data elements etc.\n5. **KNIME** \n\n* **It is an** Open Source Software.\n* It is written in JAVA.\n* KNIME is integration platform for data mining and data analytics.\n* It works on the concept of the modular data pipeline.\n* It consists of various machine learning and data mining components embedded together.\n* It is used in pharmaceutical research. Also, it performs excellently for customer data analysis, financial data analysis, and business intelligence.\n* It has features of quick deployment and scaling efficiency.\n* It is easy to learn software.\n\n1. **Sisense**  \n\n* It is not open source i.e., it is aLicensed software\n* It is developed by the company of same name ‘Sisense’.\n* It is useful and best suited BI software when it comes to reporting purposes within the organization.\n* It has a brilliant capability to handle and process data for the small scale/large scale organizations.\n* It allows combining data from various sources to build a common repository and further, refines data to generate rich reports that get shared across departments for reporting.\n* Sisense generates reports which are highly visual. It is specially designed for users that are non-technical. It allows drag &amp; drop facility as well as widgets.\n* Different widgets can be selected to generate the reports in form of pie charts, line charts, bar graphs etc. based on the purpose of an organization. Reports can be further drilled down by simply clicking to check details and comprehensive data.\n\n1. **R Tool**\n\n* R is an open source and free software environment.\n* This is written in C and FORTRAN Language.\n* It is used to perform statistical computing, data mining &amp; graphics.\n* It also supports graphical analysis, both linear and nonlinear modelling, classification, clustering and time-based data analysis.\n* It is widely used in academia, research, engineering &amp; industrial applications.\n\n1. **Apache Mahout**\n\n* It is an Open source software.\n* It is developed by Apache Foundationthat serves the primary purpose of creating machine learning algorithms.\n* It focuses mainly on data clustering, classification, and collaborative filtering which is primary task in data mining.\n* It has been written in JAVA.\n* It includes JAVA libraries to perform mathematical operations like linear algebra and statistics.\n* The algorithms have implemented a level above Hadoop through mapping/reducing templates.\n* To key up, Mahout has following major features\n* Extensible programming environment\n* Pre-made algorithms\n* Math experimentation environment\n* GPU computes for performance improvement\n\n1. **SAS Data Mining**\n\n* It is having a Proprietary License.\n* This is a product of SAS Institute developed for analytics &amp; data management.\n* SAS can mine data, alter it, manage data from different sources and perform statistical analysis.\n* It provides a graphical UI for non-technical users.\n* SAS data miner enables users to analyse big data and derives accurate insight to make timely decisions.\n* SAS has a distributed memory processing architecture which is highly scalable. It is well suited for data mining, text mining &amp; optimization.\n\n1. **Teradata**\n\n* It is a Licensed Software.\n* It is commonly known as a Teradata database.\n* It is an enterprise data warehouse that contains data management tools along with data mining software.\n* It can be used for business analytics.\n* Teradata is used to have an insight of company data like sales, product placement, customer preferences etc.\n* Teradata works on ‘share nothing’ architecture as it has its server nodes have their own memory &amp; processing ability.", "link": "https://www.reddit.com/r/technology/comments/b426f8/data_mining_tools/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "data mining tools /!/  \n\n### data mining tools\n\n**introduction to data mining tools :**\n\ndata mining is defined as a process used to extract usable data from a larger set of any raw data which implies analysing data patterns in large batches of data using one or more software.\n\ndata mining is the process of discovering patterns in large data sets.\n\ndata mining is the analysis step of the “knowledge discovery in databases” process, or kdd.\n\n&amp;#x200b;\n\n**brief introduction of data ming tasks**\n\nthere are several data mining tasks such as classification, prediction, outlier detection, clustering, regression and decision -----> tree !!!  etc. all these tasks are either fall in predictive data mining tasks or descriptive data mining tasks. a data mining system execute one or more tasks as part of data mining.\n\n1. **classification**\n\n* classification technique is used for assigning the items into target categories or classes which is used to predict what will occur within the class accurately.\n* it classifies each item in a set of data into one of a predefined set of classes or groups.\n\n1. **outlier detection**\n\noutliers is defined as the data objects that do not comply with the general behaviour or model of the data available.\n\n1. **clustering**\n\ncluster analysis is one of the techniques of data mining by which related records are grouped. as a result, objects are like one another within the same group. although, they are different in same or other clusters.\n\n1. **regression**\n\nthis technique is used for establishing the dependency between the two variables so that causal relationship can be used to predict the outcome.\n\n1. **prediction**\n\nprediction is made by finding the relationship between independent and dependent variables.\n\n1. **decision trees**\n\n* decision tree is one of the analytical technique of data mining.\n* this technique is used for categorising or predict data.\n\n**important data mining tools**\n\nthere are different data mining tools for performing data mining tasks are as follows,\n\n1. **oracle data mining**\n\n* it is proprietary license software.\n* it provides us data mining algorithms for data classification, prediction, regression and specialized analytics that enables analysts to analyse insights, make better predictions, target best customers, identify cross-selling opportunities &amp; detect fraud.\n* the algorithms designed inside odm leverage has the strengths of oracle database.\n* the data mining feature of sql can dig data out of database tables, views, and schemas.\n* the gui of oracle data miner is an extended version of oracle sql developer.\n* it provides a facility of direct ‘drag &amp; drop’ of data inside the database to users thus giving better insight.\n\n1. **ibm spss modeler**\n\n* it is proprietary license software.\n* it was originally produced by spss inc. and later acquired by ibm.\n* it is a software suite owned by [ibm ](https://www.ibm.com/in-en/)that is used for data mining &amp; text data analytics.\n* it has a rich visual interface that allows users to work with data mining algorithms without the need of programming.\n* it eliminates the unnecessary complexities faced during data transformations and to make easy to use predictive models.\n* ibm spss comes in two editions, based on the features\n* ibm spss modeler professional\n* ibm spss modeler premium- contains additional features of text analytics, entity analytics etc.\n\n1. **weka**\n\n* it is open source and free software.\n* it is best suited for data analysis and predictive modelling.\n* it contains algorithms and visualization tools that support data mining tasks and machine learning.\n* weka has a gui that gives easy access to all its features.\n* it is written in java language.\n* weka supports major data mining tasks including data mining, processing, visualization, regression etc.\n* weka can also provide access to sql databases through database connectivity and can further process the data returned by the query.\n\n1. **ibm cognos** \n\n* it is proprietary license software.\n* bm cognos bi is an intelligence suite owned by ibm for reporting and data analysis, score carding etc.\n* it consists of sub-components that meet specific organizational requirements cognos connection, query studio, report studio, analysis studio, event studio &amp; workspace advance.\n   * **cognos connection:**it is a web portal to gather and summarize data in scoreboard/reports.\n   * **query studio:**it contains queries to format data &amp; create diagrams.\n   * **report studio:**it is used to generate management reports.\n   * **analysis studio:**it is used to process large data volumes, understand &amp; identify trends.\n   * **event studio:**notification module to keep in sync with events.\n   * **workspace advanced:**user-friendly interface to create personalized &amp; user-friendly documents.\n\n1. **rapid miner software**\n\n* it is anopen source software.\n* it is one of the best predictive analysis systems developed by the company with the same name as the rapid miner.\n* written in java programming language.\n* it provides an integrated environment for deep learning, text mining, machine learning &amp; predictive analysis.\n* it can be used for over various applications such as business applications, commercial applications, training, education, research, application development, machine learning.\n* rapid miner offers the server as both on premise &amp; in public/private cloud infrastructures.\n* it has a client/server model as its base.\n* rapid miner comes with template-based frameworks that enable speedy delivery with reduced number of errors.\n* rapid miner has three modules,\n\n1. rapid miner studio- this module is for workflow design, prototyping, validation etc.\n2. rapid miner server- to operate predictive data models created in studio\n3. rapid miner radoop- executes processes directly in hadoop cluster to simplify predictive analysis.\n\n**6. orange software** \n\n* it is anopen source software\n* it is suite for machine learning &amp; data mining tasks.\n* it best aids the data visualization and is a component-based software.\n* it is written in python language.\n* data coming to orange software gets quickly formatted to the desired pattern and it can be easily moved where needed by simply moving/flipping the widgets.\n* it is a component-based software, the components of orange are called ‘widgets’. these widgets range from data visualization &amp; pre-processing to an evaluation of algorithms and predictive modelling.\n* widgets provide major functionalities like\n\n1. showing data table and allowing to select features\n2. reading the data\n3. training predictors and to compare learning algorithms\n4. visualizing data elements etc.\n5. **knime** \n\n* **it is an** open source software.\n* it is written in java.\n* knime is integration platform for data mining and data analytics.\n* it works on the concept of the modular data pipeline.\n* it consists of various machine learning and data mining components embedded together.\n* it is used in pharmaceutical research. also, it performs excellently for customer data analysis, financial data analysis, and business intelligence.\n* it has features of quick deployment and scaling efficiency.\n* it is easy to learn software.\n\n1. **sisense**  \n\n* it is not open source i.e., it is alicensed software\n* it is developed by the company of same name ‘sisense’.\n* it is useful and best suited bi software when it comes to reporting purposes within the organization.\n* it has a brilliant capability to handle and process data for the small scale/large scale organizations.\n* it allows combining data from various sources to build a common repository and further, refines data to generate rich reports that get shared across departments for reporting.\n* sisense generates reports which are highly visual. it is specially designed for users that are non-technical. it allows drag &amp; drop facility as well as widgets.\n* different widgets can be selected to generate the reports in form of pie charts, line charts, bar graphs etc. based on the purpose of an organization. reports can be further drilled down by simply clicking to check details and comprehensive data.\n\n1. **r tool**\n\n* r is an open source and free software environment.\n* this is written in c and fortran language.\n* it is used to perform statistical computing, data mining &amp; graphics.\n* it also supports graphical analysis, both linear and nonlinear modelling, classification, clustering and time-based data analysis.\n* it is widely used in academia, research, engineering &amp; industrial applications.\n\n1. **apache mahout**\n\n* it is an open source software.\n* it is developed by apache foundationthat serves the primary purpose of creating machine learning algorithms.\n* it focuses mainly on data clustering, classification, and collaborative filtering which is primary task in data mining.\n* it has been written in java.\n* it includes java libraries to perform mathematical operations like linear algebra and statistics.\n* the algorithms have implemented a level above hadoop through mapping/reducing templates.\n* to key up, mahout has following major features\n* extensible programming environment\n* pre-made algorithms\n* math experimentation environment\n* gpu computes for performance improvement\n\n1. **sas data mining**\n\n* it is having a proprietary license.\n* this is a product of sas institute developed for analytics &amp; data management.\n* sas can mine data, alter it, manage data from different sources and perform statistical analysis.\n* it provides a graphical ui for non-technical users.\n* sas data miner enables users to analyse big data and derives accurate insight to make timely decisions.\n* sas has a distributed memory processing architecture which is highly scalable. it is well suited for data mining, text mining &amp; optimization.\n\n1. **teradata**\n\n* it is a licensed software.\n* it is commonly known as a teradata database.\n* it is an enterprise data warehouse that contains data management tools along with data mining software.\n* it can be used for business analytics.\n* teradata is used to have an insight of company data like sales, product placement, customer preferences etc.\n* teradata works on ‘share nothing’ architecture as it has its server nodes have their own memory &amp; processing ability.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/b426f8/data_mining_tools/',)", "identifyer": 5770585, "year": "2019"}, {"autor": "auscomp", "date": 1550126405000, "content": "Free MS #OneNote \"Family Tree\" #template. It's free so please retweet. #ancestry #KidsDeserveIt #ancestors #estateplanning", "link": "https://www.reddit.com/r/technology/comments/aqgx57/free_ms_onenote_family_tree_template_its_free_so/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "free ms #onenote \"family -----> tree !!! \" #template. it's free so please retweet. #ancestry #kidsdeserveit #ancestors #estateplanning", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5772689, "year": "2019"}, {"autor": "auscomp", "date": 1547936895000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Vault &amp; Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/ahr2o8/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , vault &amp; estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5777209, "year": "2019"}, {"autor": "bigbadgingerboy", "date": 1576336217000, "content": "USB 3.0 port only recognising 2.0 devices /!/ My computer has a usb 3.0 port. However it only recognised 2.0 devices. I have checked usb device tree viewer and it says this 3.0 port is in a generic 2.0 hub with 5 other usb 2.0 ports. Could this be the reason its not working with 3.0 devices?", "link": "https://www.reddit.com/r/technology/comments/eaksmm/usb_30_port_only_recognising_20_devices/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "usb 3.0 port only recognising 2.0 devices /!/ my computer has a usb 3.0 port. however it only recognised 2.0 devices. i have checked usb device -----> tree !!!  viewer and it says this 3.0 port is in a generic 2.0 hub with 5 other usb 2.0 ports. could this be the reason its not working with 3.0 devices?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/eaksmm/usb_30_port_only_recognising_20_devices/',)", "identifyer": 5780075, "year": "2019"}, {"autor": "timentask-software", "date": 1560600132000, "content": "The 5 mistakes I see candidates make the most often. /!/  \n\nI've given 50+ phone screens in the past year and I see people making the same mistakes over and over again. There is a lot of writing out there about hard skills that are useful for interviews, but I don't see that much about strategies to help people succeed. I think most of the candidates that we interview have the hard skills to pass our phone screen, but they are nervous and don't apply those hard skills effectively during the interview. For context, this is a \\~100 person startup, and about 50% of people make it to the second round of our interviews.\n\n**(1) Assuming the question has a fancy silver bullet.**\n\nWhen you’re interviewing for a generalist position at a software company, it’s pretty unlikely that their phone screen is going to require you to know what a Bloom filter is (although they are quite cool) and how to use it. And yet candidates consistently scrap OK solutions that aren’t quite optimized and start diving into crazy tangents. Just like in an actual programming job, save the complex and specialized data structures for situations where their usage is clear. There’s a reason why we’re all still using arrays (and merge sort) 70+ years later.\n\nHow to fix: use standard algorithms and data structures as building blocks.\n\n**(2) Ignoring interviewer hints and suggestions.**\n\nThis one can manifest itself in a couple of ways. The most egregious is when the interviewer makes a fairly clear hint such as “what if we used a stack instead of a tree?”, and the suggestion is either ignored or dismissed out of hand. As an interviewer, I’m trying to help you! There is no situation in which people will intentionally mislead you. When the interviewer makes an explicit suggestion, they are either trying to guide you along the right path or trying to have you prove that your current solution is optimal (in which case you’ll probably already know that your current solution is a good one). Regardless of which they are doing, just ignoring the hint won’t do you any good.\n\nOccasionally candidates will take the hint, spend a little bit of time trying to work it into their solution, and then cast it aside and return to whatever wasn’t working before (or onto a new thing). If someone gives you a suggestion and you don’t think it works that’s fine, but you should have a clear explanation for why an alternative solution is better than the one suggested to you. Remember, we’re trying to help you get the right solution and we have the answer key, so it’s likely that our suggestions are going to be helpful (not to say that people don’t occasionally come up with great solutions that aren’t in the answer key).\n\nHow to fix: give any input from your interviewer strong consideration.\n\n**(3) Forcing a square peg into a round hole.**\n\nThis ties into the one above, but candidates will frequently pick a solution early on and tack on enhancements for every problem that it has. If your answer doesn’t feel like a clean fit for the problem, then there is most likely a flaw with the foundation of your solution, not the wallpaper. Don’t be afraid to scrap your current solution (especially if you can articulate why it’s bad) and pick a new one. The right answer is usually also a fast one, so don’t worry about time constraints on that front.\n\nHow to fix: don’t be afraid to scrap a solution and try out something new.\n\n**(4) Diving too far into details right away.**\n\nThis one doesn’t sink candidates immediately, but it hurts them in two ways. First, once they’ve described a solution in great detail they get invested and don’t want to change it, leading to the problem (3). The bigger issue, though, is that it takes more time for the interviewer to figure out that it is a wrong solution. Interviewers will typically direct you away from wrong solutions and towards correct ones, so the faster they understand your solution the faster they can put you on the right track. Since interviews are time-limited, it’s better to give a wrong solution in 30 seconds than in 5 minutes. And if the solution you gave is correct, or close to it, the interviewer can always prompt you for more detail.\n\nHow to fix: get it wrong or right quickly, then iterate from there.\n\n**(5) Filling the silence at all times.**\n\nI blame bad advice from college “how to pass a technical interview” seminars and online advice columns for this one. It is important to let your interviewer know what you’re thinking, but just rambling is bad. The same way none of us sit down at a computer and start coding instantly when presented with a problem, it’s OK to not start talking right away when presented with an interview question. Just saying something like “just let me think for a second” is perfectly fine and can give you 30 seconds or a minute to concentrate. For the reasons discussed in (4), don’t take too long, but 1 minute of silence followed by a correct answer is a lot better than 2 minutes of talking but no good answer. A brief silence also allows candidates to gather their thoughts and then present a coherent answer, which is definitely preferable to a jumbled answer.\n\nHow to fix: still communicate your thoughts, but don’t be afraid to organize them first.", "link": "https://www.reddit.com/r/technology/comments/c0wkm0/the_5_mistakes_i_see_candidates_make_the_most/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "the 5 mistakes i see candidates make the most often. /!/  \n\ni've given 50+ phone screens in the past year and i see people making the same mistakes over and over again. there is a lot of writing out there about hard skills that are useful for interviews, but i don't see that much about strategies to help people succeed. i think most of the candidates that we interview have the hard skills to pass our phone screen, but they are nervous and don't apply those hard skills effectively during the interview. for context, this is a \\~100 person startup, and about 50% of people make it to the second round of our interviews.\n\n**(1) assuming the question has a fancy silver bullet.**\n\nwhen you’re interviewing for a generalist position at a software company, it’s pretty unlikely that their phone screen is going to require you to know what a bloom filter is (although they are quite cool) and how to use it. and yet candidates consistently scrap ok solutions that aren’t quite optimized and start diving into crazy tangents. just like in an actual programming job, save the complex and specialized data structures for situations where their usage is clear. there’s a reason why we’re all still using arrays (and merge sort) 70+ years later.\n\nhow to fix: use standard algorithms and data structures as building blocks.\n\n**(2) ignoring interviewer hints and suggestions.**\n\nthis one can manifest itself in a couple of ways. the most egregious is when the interviewer makes a fairly clear hint such as “what if we used a stack instead of a -----> tree !!! ?”, and the suggestion is either ignored or dismissed out of hand. as an interviewer, i’m trying to help you! there is no situation in which people will intentionally mislead you. when the interviewer makes an explicit suggestion, they are either trying to guide you along the right path or trying to have you prove that your current solution is optimal (in which case you’ll probably already know that your current solution is a good one). regardless of which they are doing, just ignoring the hint won’t do you any good.\n\noccasionally candidates will take the hint, spend a little bit of time trying to work it into their solution, and then cast it aside and return to whatever wasn’t working before (or onto a new thing). if someone gives you a suggestion and you don’t think it works that’s fine, but you should have a clear explanation for why an alternative solution is better than the one suggested to you. remember, we’re trying to help you get the right solution and we have the answer key, so it’s likely that our suggestions are going to be helpful (not to say that people don’t occasionally come up with great solutions that aren’t in the answer key).\n\nhow to fix: give any input from your interviewer strong consideration.\n\n**(3) forcing a square peg into a round hole.**\n\nthis ties into the one above, but candidates will frequently pick a solution early on and tack on enhancements for every problem that it has. if your answer doesn’t feel like a clean fit for the problem, then there is most likely a flaw with the foundation of your solution, not the wallpaper. don’t be afraid to scrap your current solution (especially if you can articulate why it’s bad) and pick a new one. the right answer is usually also a fast one, so don’t worry about time constraints on that front.\n\nhow to fix: don’t be afraid to scrap a solution and try out something new.\n\n**(4) diving too far into details right away.**\n\nthis one doesn’t sink candidates immediately, but it hurts them in two ways. first, once they’ve described a solution in great detail they get invested and don’t want to change it, leading to the problem (3). the bigger issue, though, is that it takes more time for the interviewer to figure out that it is a wrong solution. interviewers will typically direct you away from wrong solutions and towards correct ones, so the faster they understand your solution the faster they can put you on the right track. since interviews are time-limited, it’s better to give a wrong solution in 30 seconds than in 5 minutes. and if the solution you gave is correct, or close to it, the interviewer can always prompt you for more detail.\n\nhow to fix: get it wrong or right quickly, then iterate from there.\n\n**(5) filling the silence at all times.**\n\ni blame bad advice from college “how to pass a technical interview” seminars and online advice columns for this one. it is important to let your interviewer know what you’re thinking, but just rambling is bad. the same way none of us sit down at a computer and start coding instantly when presented with a problem, it’s ok to not start talking right away when presented with an interview question. just saying something like “just let me think for a second” is perfectly fine and can give you 30 seconds or a minute to concentrate. for the reasons discussed in (4), don’t take too long, but 1 minute of silence followed by a correct answer is a lot better than 2 minutes of talking but no good answer. a brief silence also allows candidates to gather their thoughts and then present a coherent answer, which is definitely preferable to a jumbled answer.\n\nhow to fix: still communicate your thoughts, but don’t be afraid to organize them first.", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/c0wkm0/the_5_mistakes_i_see_candidates_make_the_most/',)", "identifyer": 5780287, "year": "2019"}, {"autor": "auscomp", "date": 1553200495000, "content": "Gift a family tree to your kids. Free MS #OneNote \"Family Tree\" #template. Please RT #ancestry #KidsDeserveIt #estateplanning #dna #ancestry #children #dna #Estateplanning #family #FamilyTree #history #Office365 #OneNote https://onenote.auscomp.com", "link": "https://www.reddit.com/r/technology/comments/b3vn4i/gift_a_family_tree_to_your_kids_free_ms_onenote/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "gift a family -----> tree !!!  to your kids. free ms #onenote \"family tree\" #template. please rt #ancestry #kidsdeserveit #estateplanning #dna #ancestry #children #dna #estateplanning #family #familytree #history #office365 #onenote https://onenote.auscomp.com", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5782053, "year": "2019"}, {"autor": "auscomp", "date": 1550291508000, "content": "Free MS #OneNote \"Family Tree\" #template. It's free so please retweet. #ancestry #KidsDeserveIt #ancestors #estateplanning", "link": "https://www.reddit.com/r/technology/comments/ar5b2t/free_ms_onenote_family_tree_template_its_free_so/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "free ms #onenote \"family -----> tree !!! \" #template. it's free so please retweet. #ancestry #kidsdeserveit #ancestors #estateplanning", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5785736, "year": "2019"}, {"autor": "auscomp", "date": 1549837625000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Intranet in a Box, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Cooking Recipes, Cocktail Recipes, Vault &amp; Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/ap99sg/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, intranet in a box, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , cooking recipes, cocktail recipes, vault &amp; estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp',)", "identifyer": 5786762, "year": "2019"}, {"autor": "iammarksmith", "date": 1574805916000, "content": "This browser extension plants a tree for each of your Black Friday purchases", "link": "https://www.reddit.com/r/technology/comments/e25gl0/this_browser_extension_plants_a_tree_for_each_of/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "this browser extension plants a -----> tree !!!  for each of your black friday purchases", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.digitaltrends.com/news/treeclicks-tree-browser-extension-black-friday-cyber-monday-shopping/',)", "identifyer": 5796428, "year": "2019"}, {"autor": "Eezyville", "date": 1549034874000, "content": "Family Tree DNA will soon give you data to law enforcement to solve crimes", "link": "https://www.reddit.com/r/technology/comments/am34ek/family_tree_dna_will_soon_give_you_data_to_law/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "family -----> tree !!!  dna will soon give you data to law enforcement to solve crimes", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 15, "media": "('link',)", "medialink": "('https://www.engadget.com/2019/02/01/family-tree-dna-fbi/',)", "identifyer": 5800122, "year": "2019"}, {"autor": "mvea", "date": 1572433468000, "content": "Elon Musk casually tweeted that he'd donate $1 million to a tree-planting cause. Jack Dorsey and YouTube are following suit.", "link": "https://www.reddit.com/r/technology/comments/dp56s7/elon_musk_casually_tweeted_that_hed_donate_1/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "elon musk casually tweeted that he'd donate $1 million to a -----> tree !!! -planting cause. jack dorsey and youtube are following suit.", "sortedWord": "None", "removed": "('nan',)", "score": 82, "comments": 20, "media": "('nan',)", "medialink": "('https://www.businessinsider.com/elon-musk-makes-massive-donation-to-tree-planting-cause-tweet-2019-10',)", "identifyer": 5803399, "year": "2019"}, {"autor": "strangeattractors", "date": 1572732146000, "content": "Bringing Millions of People Together to Plant Just One Tree", "link": "https://www.reddit.com/r/technology/comments/dqr7zt/bringing_millions_of_people_together_to_plant/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "bringing millions of people together to plant just one -----> tree !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/TeamTrees/comments/dqqpwr/bringing_millions_of_people_together_to_plant/',)", "identifyer": 5803675, "year": "2019"}, {"autor": "stockwizaards", "date": 1564128257000, "content": "Machine Learning, NLP &amp; Python-Cut to the Chase-Start Learning Now /!/ A down-to-earth, shy but confident take on machine learning techniques that you can put to work today.\n\n* Identify situations that call for the use of Machine Learning\n* Use Machine Learning and Natural Language processing to solve problems like text classification, text summarization in Python\n* Understand which type of Machine learning problem you are solving and choose the appropriate solution\n\n### WHAT'S COVERED\n\n* Machine Learning: Supervised/Unsupervised learning, Classification, Clustering, Association Detection, Anomaly Detection, Dimensionality Reduction, Regression. Naive Bayes, K-nearest neighbours, Support Vector Machines, Artificial Neural Networks, K-means, Hierarchical clustering, Principal Components Analysis, Linear regression, Logistics regression, Random variables, Bayes theorem, Bias-variance tradeoff  \n* Natural Language Processing with Python: Corpora, stopwords, sentence and word parsing, auto-summarization, sentiment analysis (as a special case of classification), TF-IDF, Document Distance, Text summarization, Text classification with Naive Bayes and K-Nearest Neighbours and Clustering with K-Means  \n* Sentiment Analysis: Why it's useful, Approaches to solving - Rule-Based , ML-Based , Training , Feature Extraction, Sentiment Lexicons, Regular Expressions, Twitter API, Sentiment Analysis of Tweets with Python  \n* Mitigating Overfitting with Ensemble Learning: Decision trees and decision tree learning, Overfitting in decision trees, Techniques to mitigate overfitting (cross validation, regularization), Ensemble learning and Random forests  \n* Recommendations: Content based filtering, Collaborative filtering and Association Rules learning\n* Get started with Deep learning: Apply Multi-layer perceptrons to the MNIST Digit recognition problem\n* A Note on Python: The code-alongs in this class all use Python 2.7. Source code (with copious amounts of comments) is attached as a resource with all the code-alongs. The source code has been provided for both Python 2 and Python 3 wherever possible.  \n\nhttps://www.edisonxacademy.com/course/course-v1:TeachEdison+ML101+2017\\_T1", "link": "https://www.reddit.com/r/technology/comments/ci020i/machine_learning_nlp_pythoncut_to_the_chasestart/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "machine learning, nlp &amp; python-cut to the chase-start learning now /!/ a down-to-earth, shy but confident take on machine learning techniques that you can put to work today.\n\n* identify situations that call for the use of machine learning\n* use machine learning and natural language processing to solve problems like text classification, text summarization in python\n* understand which type of machine learning problem you are solving and choose the appropriate solution\n\n### what's covered\n\n* machine learning: supervised/unsupervised learning, classification, clustering, association detection, anomaly detection, dimensionality reduction, regression. naive bayes, k-nearest neighbours, support vector machines, artificial neural networks, k-means, hierarchical clustering, principal components analysis, linear regression, logistics regression, random variables, bayes theorem, bias-variance tradeoff  \n* natural language processing with python: corpora, stopwords, sentence and word parsing, auto-summarization, sentiment analysis (as a special case of classification), tf-idf, document distance, text summarization, text classification with naive bayes and k-nearest neighbours and clustering with k-means  \n* sentiment analysis: why it's useful, approaches to solving - rule-based , ml-based , training , feature extraction, sentiment lexicons, regular expressions, twitter api, sentiment analysis of tweets with python  \n* mitigating overfitting with ensemble learning: decision trees and decision -----> tree !!!  learning, overfitting in decision trees, techniques to mitigate overfitting (cross validation, regularization), ensemble learning and random forests  \n* recommendations: content based filtering, collaborative filtering and association rules learning\n* get started with deep learning: apply multi-layer perceptrons to the mnist digit recognition problem\n* a note on python: the code-alongs in this class all use python 2.7. source code (with copious amounts of comments) is attached as a resource with all the code-alongs. the source code has been provided for both python 2 and python 3 wherever possible.  \n\nhttps://www.edisonxacademy.com/course/course-v1:teachedison+ml101+2017\\_t1", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/ci020i/machine_learning_nlp_pythoncut_to_the_chasestart/',)", "identifyer": 5806351, "year": "2019"}, {"autor": "mynameis_neo", "date": 1554308101000, "content": "Home DNA kit company asks you to upload your family tree for the FBI - no consent required from family members impacted by your decision, of course.", "link": "https://www.reddit.com/r/technology/comments/b8zzxj/home_dna_kit_company_asks_you_to_upload_your/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "home dna kit company asks you to upload your family -----> tree !!!  for the fbi - no consent required from family members impacted by your decision, of course.", "sortedWord": "None", "removed": "('nan',)", "score": 203, "comments": 57, "media": "('nan',)", "medialink": "('https://www.zdnet.com/article/home-dna-kit-company-asks-you-to-upload-your-family-tree-for-the-fbi/',)", "identifyer": 5808450, "year": "2019"}, {"autor": "auscomp", "date": 1550008937000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Intranet in a Box, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Cooking Recipes, Cocktail Recipes, Vault &amp; Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/apywvf/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, intranet in a box, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , cooking recipes, cocktail recipes, vault &amp; estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp',)", "identifyer": 5810230, "year": "2019"}, {"autor": "heatingrox", "date": 1575030361000, "content": "Lone Tree HVAC Repair Expert", "link": "https://www.reddit.com/r/technology/comments/e3e4ct/lone_tree_hvac_repair_expert/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "lone -----> tree !!!  hvac repair expert", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.croozi.com/Business/locv?uid=5de108eb4d2c7&amp;=Rox-Heating-and-Air',)", "identifyer": 5817215, "year": "2019"}, {"autor": "maxwellhill", "date": 1566734694000, "content": "Tree-planting search engine saw a 1150% increase in downloads after the Amazon rainforest fires: It uses 80% of its profits from search ads to plant millions of trees in Brazil and other emerging economies - says it has planted 65 million trees to date.", "link": "https://www.reddit.com/r/technology/comments/cv7om6/treeplanting_search_engine_saw_a_1150_increase_in/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "-----> tree !!! -planting search engine saw a 1150% increase in downloads after the amazon rainforest fires: it uses 80% of its profits from search ads to plant millions of trees in brazil and other emerging economies - says it has planted 65 million trees to date.", "sortedWord": "None", "removed": "('nan',)", "score": 12, "comments": 3, "media": "('link',)", "medialink": "('https://www.businessinsider.my/amazon-rainforest-fires-boosted-ecosia-search-engine-installs-500-percent-2019-8/',)", "identifyer": 5819176, "year": "2019"}, {"autor": "prMac", "date": 1575460040000, "content": "Decorate Virtual Christmas Trees With Pico Christmas Tree AR for iPhone", "link": "https://www.reddit.com/r/technology/comments/e5y2kg/decorate_virtual_christmas_trees_with_pico/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "decorate virtual christmas trees with pico christmas -----> tree !!!  ar for iphone", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('http://bigobjuo.com/picoChristmasTreeAR.html',)", "identifyer": 5821446, "year": "2019"}, {"autor": "auscomp", "date": 1548895644000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Intranet in a Box, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Vault &amp; Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/aljss2/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, intranet in a box, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , vault &amp; estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5822836, "year": "2019"}, {"autor": "WardogMitzy", "date": 1556985574000, "content": "Adobe Acrobat and Microsoft Excel /!/ I have a PDF file that has many layers with literally hundreds of thousands of information nodes. I need to pull the nodes out and put them into an excel spreadsheet in rows format. I've been doing this one at a time.\n\n&amp;#x200B;\n\nWhat I have been doing is going to the model tree in acrobat, copy the data, go to excel, paste the data, then copy and transpose it. I've set up a Macro to do half the work for me on excel.\n\n&amp;#x200B;\n\nIs there a way script or a function in excel or adobe acrobat to automate the process of pulling the data from the PDF document and compiling it into an excel spreadsheet?", "link": "https://www.reddit.com/r/technology/comments/bkml0p/adobe_acrobat_and_microsoft_excel/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "adobe acrobat and microsoft excel /!/ i have a pdf file that has many layers with literally hundreds of thousands of information nodes. i need to pull the nodes out and put them into an excel spreadsheet in rows format. i've been doing this one at a time.\n\n&amp;#x200b;\n\nwhat i have been doing is going to the model -----> tree !!!  in acrobat, copy the data, go to excel, paste the data, then copy and transpose it. i've set up a macro to do half the work for me on excel.\n\n&amp;#x200b;\n\nis there a way script or a function in excel or adobe acrobat to automate the process of pulling the data from the pdf document and compiling it into an excel spreadsheet?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/bkml0p/adobe_acrobat_and_microsoft_excel/',)", "identifyer": 5827571, "year": "2019"}, {"autor": "auscomp", "date": 1547433009000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Vault, Kudos and Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/afr21f/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , vault, kudos and estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5830486, "year": "2019"}, {"autor": "auscomp", "date": 1547519571000, "content": "Medley of free MS OneNote templates. Get Things Done, KanBan Task Board, Diary, Moving House Checklist, Travel Vacation Checklist, Family Tree, Vault, Kudos &amp; Estate Planner.", "link": "https://www.reddit.com/r/technology/comments/ag3nbq/medley_of_free_ms_onenote_templates_get_things/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "medley of free ms onenote templates. get things done, kanban task board, diary, moving house checklist, travel vacation checklist, family -----> tree !!! , vault, kudos &amp; estate planner.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://onenote.auscomp.com',)", "identifyer": 5830605, "year": "2019"}], "name": "treetechnology2019"}