{"interestingcomments": [{"autor": "David1_2", "date": 1583259560000, "content": "How to Fix family tree maker software? /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/fcytxz/how_to_fix_family_tree_maker_software/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "how to fix family -----> tree !!!  maker software? /!/ [removed]", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/technology/comments/fcytxz/how_to_fix_family_tree_maker_software/',)", "identifyer": 5507554, "year": "2020"}, {"autor": "anemomylos", "date": 1582372309000, "content": "Random Musings on the R Developer Preview 1 - What Will Piss Off Users [CommonsWare] /!/ &gt;The phrasing around the [file and directory access restrictions](https://developer.android.com/preview/privacy/storage#file-directory-restrictions) puts the blame on developers. How *dare* we ask for the Downloads/document tree, or for files in Android/data/directories!  \n&gt;  \n&gt;In reality, developers don’t do that. Developers simply fire off ACTION\\_OPEN\\_DOCUMENT, ACTION\\_OPEN\\_DOCUMENT\\_TREE, or ACTION\\_CREATE\\_DOCUMENTIntents. Where the user winds up choosing is up to the user.  \n&gt;  \n&gt;So, in reality, **the restrictions listed in this section will be placed on** ***users***\\*\\*, not developers\\*\\*. And I have absolutely no idea **what sort of messaging Google could use** in the Storage Access Framework UI **that would justify to the user blocking them from navigating to certain portions of external and removable storage**. “Sorry, you can’t choose Downloads/, because ¯\\\\\\_(ツ)\\_/¯” doesn’t strike me as something that will make users very happy.  \n&gt;  \n&gt;**I am all for improved user control over privacy and security concerns, but the boundaries between what is and is not allowed need to make sense to users and, secondarily, to developers.**\n\n[https://commonsware.com/blog/2020/02/21/random-musings-r-dp1.html](https://commonsware.com/blog/2020/02/21/random-musings-r-dp1.html)", "link": "https://www.reddit.com/r/technology/comments/f7rlih/random_musings_on_the_r_developer_preview_1_what/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "random musings on the r developer preview 1 - what will piss off users [commonsware] /!/ &gt;the phrasing around the [file and directory access restrictions](https://developer.android.com/preview/privacy/storage#file-directory-restrictions) puts the blame on developers. how *dare* we ask for the downloads/document -----> tree !!! , or for files in android/data/directories!  \n&gt;  \n&gt;in reality, developers don’t do that. developers simply fire off action\\_open\\_document, action\\_open\\_document\\_tree, or action\\_create\\_documentintents. where the user winds up choosing is up to the user.  \n&gt;  \n&gt;so, in reality, **the restrictions listed in this section will be placed on** ***users***\\*\\*, not developers\\*\\*. and i have absolutely no idea **what sort of messaging google could use** in the storage access framework ui **that would justify to the user blocking them from navigating to certain portions of external and removable storage**. “sorry, you can’t choose downloads/, because ¯\\\\\\_(ツ)\\_/¯” doesn’t strike me as something that will make users very happy.  \n&gt;  \n&gt;**i am all for improved user control over privacy and security concerns, but the boundaries between what is and is not allowed need to make sense to users and, secondarily, to developers.**\n\n[https://commonsware.com/blog/2020/02/21/random-musings-r-dp1.html](https://commonsware.com/blog/2020/02/21/random-musings-r-dp1.html)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/f7rlih/random_musings_on_the_r_developer_preview_1_what/',)", "identifyer": 5510412, "year": "2020"}, {"autor": "Covid-19202122", "date": 1595424736000, "content": "Police use home genealogy test results to identify family tree and eventually arrest suspect in Penn State serial rape case that had gone cold except for unmatched DNA samples.", "link": "https://www.reddit.com/r/technology/comments/hvtu7n/police_use_home_genealogy_test_results_to/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "police use home genealogy test results to identify family -----> tree !!!  and eventually arrest suspect in penn state serial rape case that had gone cold except for unmatched dna samples.", "sortedWord": "None", "removed": "('moderator',)", "score": 170, "comments": 84, "media": "('nan',)", "medialink": "('http://www.statecollege.com/news/local-news/port-matilda-man-arrested-for-alleged-serial-rapes-of-four-penn-state-students,1483687/',)", "identifyer": 5510840, "year": "2020"}, {"autor": "gadgetgets", "date": 1596558856000, "content": "Tentsile Hanging Tree House Tent", "link": "https://www.reddit.com/r/technology/comments/i3ml48/tentsile_hanging_tree_house_tent/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "tentsile hanging -----> tree !!!  house tent", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/tentsile-hanging-tree-house-tent/',)", "identifyer": 5511299, "year": "2020"}, {"autor": "sololinux", "date": 1600945016000, "content": "Vista de árbol en consola con Broot. Broot es un administrador de archivos sobre directorios en línea de comandos. De código abierto, esta herramienta nos ofrece una excelente vista de arbol que nos recuerda al comando tree. La realidad es bien distinta.", "link": "https://www.reddit.com/r/technology/comments/iyv1ju/vista_de_árbol_en_consola_con_broot_broot_es_un/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "vista de árbol en consola con broot. broot es un administrador de archivos sobre directorios en línea de comandos. de código abierto, esta herramienta nos ofrece una excelente vista de arbol que nos recuerda al comando -----> tree !!! . la realidad es bien distinta.", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('link',)", "medialink": "('https://www.sololinux.es/vista-de-arbol-en-consola-con-broot/',)", "identifyer": 5511625, "year": "2020"}, {"autor": "skpl", "date": 1601736507000, "content": "For The First Time, Scientists Successfully Extract DNA From Insects Embedded In Tree Resin", "link": "https://www.reddit.com/r/technology/comments/j4g8r4/for_the_first_time_scientists_successfully/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "for the first time, scientists successfully extract dna from insects embedded in -----> tree !!!  resin", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1032, "media": "('link',)", "medialink": "('https://www.forbes.com/sites/davidbressan/2020/09/30/for-the-first-time-scientists-successfully-extract-dna-from-insects-embedded-in-tree-resin/#282f1b391445',)", "identifyer": 5515778, "year": "2020"}, {"autor": "YamekBGaming", "date": 1587068132000, "content": "Sex, Lies, and Video Games. Story of possibly the biggest Fraud Casino Gaming HISTORY /!/ \n\nAuthor: Darryl Rosenblatt writes......\n\nI wrote an article a couple of weeks ago about skill-based games. I've been tracking the performance of these games since they were introduced to the market a few years ago.\n\nIn this particular article, I mentioned a company called GameCo, and I referenced it's CEO, Blaine Graboyes.\n\nAfter I published the article, I received an enormous amount of messages and emails.\n\nThese could be sorted into three piles.\n\nFirst, there were the folks that completely agreed that skill based games are better suited in their own environment, where they don't have to compete with slots.\n\nSecond, there were the folks that thought I was crazy, and that I was being really harsh on Mr. Graboyes.\n\nThird, there was a disproportionate amount of folks that wanted to talk to me about Mr. Graboyes himself.\n\nNow, I am an amateur journalist. I like to say \"journalist\", because I like to think that I take more responsibility for what I publish, than say, a blogger.\n\nHowever, I promise, If it weren't for spell-check, and a wife with a keen eye for grammar, you'd think this piece was authored by a fourth grader, whose English was a second language.\n\nWith that said, I don't want to talk about anyone.\n\nBut, the emails were persistent, and what was weird, is that these people were not crackpots.\n\nFinanciers, Angel Investors, GameCo Employees, Ex-GameCo Employees, former partners, engineers, even the ex-COO of GameCo had reached out to me, with what amounted to be, a plethora of allegations against Blaine Graboyes.\n\nTo say that these people were upset, would be like saying Steve Wynn liked to flirt.\n\nThese individuals described Blaine Graboyes as a man who treats the truth like a tree falling in the woods. If you can't see it, and you can't hear it, it simply didn't happen.\n\nHowever, none of these things really had anything to do with the GameCo product, and despite numerous accusations to the contrary, the only thing I saw Blaine guilty of was bullshitting gaming operators, and an extremely confusing haircut.\n\nThat was until I got an email from an unassuming young man, who had quite a story, and he really wanted someone to tell it.\n\nJustin's tale was tall, and my patience was short, and most importantly, I needed evidence.\n\nIt came in troves.\n\nIn fact, it was some of the most meticulous record keeping I had ever seen.\n\nAfter reading hundreds of documents, multiple email chains, dozens of files, court filings, photographs, videos, corporate board recordings, schematics, patents, and interviewing the other people involved, I can say with absolute certainty, the GameCo story does not begin with Blaine Graboyes, and an epiphany, in New York City.\n\nNo alt text provided for this image\nThe story of GameCo begins in a small suburb of Toledo, Ohio called, Sylvania, and with a young competitive gamer named Justin Yamek.\n\nJustin worked as a Journeyman during the day, and spent most of his free time playing video games.\n\nExcept, Justin’s free time wasn’t free. Gaming is an expensive hobby, and as accomplished as he was at playing video games, the equipment, travel, and upgrades, were almost unattainable on his carpenters salary.\n\nJustin envisioned a privately held company that would run grassroots competitions for the mass market of “core gamers” by rewarding their participation while playing their favorite games on PC, consoles, social, and mobile.\n\nNo alt text provided for this image\nJustin developed his concept to include the first video game casino. This would be the home for gamers, just like him, where the outside is built and branded to look like a video game console, with pulsing lights attracting visitors. All of the attractions are video game themed, the floors and rooms evoke game genres and characters, and the gambling is focused on video games.\n\nNo alt text provided for this image\nInstead of slot machines, there are rows of individual gaming stations at which players can compete locally and online.\n\n\nAt the heart of this new Video Game Gambling casino concept was Justin’s new flagship product, the VGM, or Video Game Gambling Machine.\n\nDesigned specifically for younger players, The VGM is a single player, or multi-player gaming experience that allows players to gamble on the outcome of video games.\n\nJustin envisioned these games to replace traditional slot machines, which often generate 60% to 75% of the $60bn/yr in U.S. gambling revenue.\n\nJustin shared his idea with his brother-in-law,Tony Legeza, because he knew him to have experience in product development, and was aware that Mr. Legeza holds a degree in Mechanical Engineering, and had graduate Cum Laude from Eastern Michigan University.\n\nTony found merit in Justin’s concept and launched Beyond Gaming, LLC in July of 2009.\n\nThe original founders of Beyond Gaming, LLC were :  Anthony J. Legeza Jr. , Justin Yamek, Dan Gross, and Brandon Cohen.\n\nThe original board consisted of Tony Legeza, Justin Yamek, and Dan Gross, the new Chief Technology Officer for the company. \n\nIn September of 2009, As one of his first official acts as CEO, Mr. Legeza successfully secured an IGNITE! Grant for Beyond Gaming in the amount of $37,500.00\n\nBetween 2009 and 2010 Tony Legeza, in his role as CEO, raised seed money (Angel) from family and friends in the approximate amount of $250,000.\n\nIn 2010, Tony Legeza, in his role as CEO, raised approximately $500,000 (Series A), through Rocket Ventures.\n\nIn September 2011, Tony Legeza, in his role as CEO raised $850,000 through WPSChallenger - Heli Holdings I Investment (Common B shares).\n\nFrom 2013 - 2014 Beyond Gaming, LLC also was funded through a series of convertible debt notes from Challenger &amp; Rocket Ventures in excess of $1M.\n\nBetween October 2011- mid 2012 the corporate board for Beyond Gaming, LLC consisted of various principals of WPS Challenger.\n\nAt the request of Mr. Legeza, Robert Montgomery is brought onto the Board of Directors to replace Graeme Weston, whom Mr. Legeza felt was underperforming in his position on the board.\n\nRobert Montgomery had a personal relationship with Challenger CEO &amp; Beyond Gaming Board Member, Bruce Steinberg, and convinces the board to bring in Blaine Graboyes - “An old friend with vast experience with Video Games”, into the business as a consultant. \n\nBlaine's ex-wife is originally from Toledo, Ohio so they eventually moved to Toledo, and rented a house from Mr. Legeza. \n\nIn September 2012, Beyond Gaming, LLC began developing protypes for the VGM and presented Detroit Venture Partners &amp; Rock Gaming (Adam Suliman) ideas about a Video Game Casino and hardware/software solutions to put on the casino floor.\n\nTony Legeza resigned as CEO in November in 2012, and remained active with the company, as a paid consultant for five months, as Blaine Graboyes took the reigns as the CEO of Beyond Gaming, LLC.\n\n\nPrototypes were rapidly being developed for the first VGM, conceptual renderings were being created for the Video Game Casino, and marketing materials were being designed by Beyond Gaming LLC, that focused primarily on the VGM and the Video Game Casino concept.\n\nOn December 11, 2013, the Beyond Gaming Platform debuted at a private event hosted by Rock Gaming in their offices in Detroit, Michigan. Players were able to experience the VGM and VGC concepts for the first time.\n\nBlaine Graboyes attended this event.\n\nNo alt text provided for this image\nThe prototype was extremely well received, and there was enormous interest in seeing the next iteration of the machine.\n\nIt is the assertion of Yamek and Legeza, that it is during this event, that Blaine Graboyes decided that he was going to find a way to make this new video game gambling technology his own.\n\nFour months later, in April 2014, Graboyes E-mails the future COO of GameCo, and friend of thirty years, Cinnamon Booth,\n\n“This past year, I’ve developed a way to gamble playing video games at the casino. Our funders have run out of cash and I’ve negotiated to buy the company. Now I need to raise funds quickly to make this transition. Attached is a quick backgrounder. If interesting, I’d provide a NDA and support materials. The technology and business are ready to go - need the funding. Thought this may be a match for some of your contacts. Please lmk if you have time and I can walk through the opportunity.”\n\nGraboyes enclosed a “Backgrounder” to his email, that duplicated all of Beyond Gaming’s content and replaced Beyond Gaming’s logo and branding with GameCo’s.\n\nAt this point, Graboyes is utilizing Beyond Gaming promotional material to raise money for his own company, (GameCo) without the permission or knowledge of Beyond Gaming, LLC. \n\nOn or about May of 2014, with interest in Beyond Gaming’s concept at a fever pitch, Blaine Graboyes decides the company is insolvent, and spends the next several months trying to convince the board, that chapter seven bankruptcy is the only option moving forward, for Beyond Gaming.\n\nCiting Beyond Gaming’s lack of cash, Blaine pushed for the bankruptcy for the benefit of the “creditors”, the two biggest creditors being Blaine Graboyes and Robert Montgomery, for what they have claimed, but have failed to prove, were for unpaid wages.\n\nOf important note, save for Montgomery and Graboyes’s unsubstantiated claims for unpaid wages, which were never proven, There were high net-wealth individuals at the time willing to put forward the seed capital to further Beyond Gaming, LLC, and several offers were formally presented to the Board of Directors which were ultimately ignored &amp; expired.\n\nTo accept any offers proffered by suitors of Beyond Gaming, Blaine Graboyes would have to forfeit his plan to start his own company using Beyond Gaming’s proprietary technology.\n\nNeither Graboyes, nor Montgomery, had anything to lose, because they already had a plan in place to purchase the technology from Beyond Gaming, and dump the debt in Bankruptcy Court.\n\nAs such, Graboyes presented a plan to the board that would purposely omit Beyond Gaming’s IP assets from the chapter 7 filing, leaving them unencumbered, so that Blaine Graboyes could purchase them directly from Beyond Gaming, LLC. \n\nThis was essential in order for Blaine to legally launch GameCo, utilizing Beyond Gaming’s work product.\n\nRocket Ventures was willing to fund Graboye’s GameCo venture, provided that the IP was purchased from Beyond Gaming, LLC.\n\n\nOn June 4th 2014, Graboyes drafted a purchase agreement between GameCo and Beyond Gaming, LLC, confirming and identifying specific intellectual property, owned by Beyond Gaming, LLC, and to be conveyed to GameCo.\n\nThese assets were listed in the agreement as:\n\nSchedule 1.1: Certain Identified Purchase Assets\n\nPrototype Software\nSwayZ Software\nCabinet Prototype\nPelican Prototype\nMath Model (Excel spreadsheet)\nVGM White Paper\nExecutive Summary documents\n\n\nWhat Graboyes did not anticipate, was Beyond Gaming’s complete and total rejection of his offer.\n\nBeyond Gaming’s refusal to accept Graboyes’s offer was simple, and three-pronged.\n\nFirst, Blaine would continuously refer to himself as the inventor, and or pioneer of the technology, and Beyond Gaming, LLC sought recognition for their work in the space. \n\nSecond, it was evident that Graboyes was abusing his position as CEO of Beyond Gaming, LLC, and manipulating the future of the company, to his benefit, without respect to members of Beyond Gaming, LLC.\n\nAnd third, the gross inequity of the agreement presented.\n\nBeyond Gaming could not see leaving their original investors with nothing.\n\nBlaine was walking away with 80% of the new business and 100% of the Beyond Gaming assets.\n\nConsidering he had 0% ownership of Beyond Gaming, LLC, this agreement seemed ridiculous.\n\nPlus, it was become evident in hindsight, that Blaine was promising positions in the newly formed GameCo company to people on the board, if they supported his chapter seven scheme.\n\nUnable to strike a deal with Beyond Gaming, LLC , Rocket Ventures and Challenger pursued, and eventually funded the Chapter 7 Bankruptcy, leaving Blaine Graboyes unemployed.\n\nNo alt text provided for this image\nBlaine Graboyes left Beyond Gaming, LLC and took all the physical, and intellectual property assets of the company with him, including the VGM prototype.\n\nGraboyes unexpected change of fortune left him in a panic, as evidenced in an email to his friend Cinnamon Booth on July 29, 2014,\n\n“I’ve had to pass on the funding in Ohio. I’m now absolutely desperate for work. Will consider and pitch for any opportunities anywhere. Remaining focused on GameCo but need to hustle to stay alive.\nWill share more next time we talk.”\nBetween September and November 2014, Blaine Graboyes and Robert Montgomery began rebranding all of the Beyond Gaming, LLC marketing assets into GameCo.\n\n\n\n\nWhile it was relatively simple to simply replace the Beyond Gaming Logo on promotional materials, it was an entirely different thing to duplicate the demo software in the Beyond Gaming VGM prototype.\n\nWhereas, Blaine had the code, he had absolutely no idea at the time what to do with it.\n\nOn December 14, 2014, Blaine emailed Cinnamon Booth and Robert Montgomery, he had a breakthrough!\n\n\"Here’s a quick update on the situation. I’ve hacked the demo such that it’s usable but still broken.\"\nThere are two main issues:\n• The game does not display full screen (you can see edges)\n• The “Bank” is not working properly (shows wrong amount)\"\nIt’s not worth trying to debug this further. I want to focus on making a new, slicker demo.\nWe will still use TrackMania as the core game.\n\"The work on the maps is what’s really essential.\nEverything else is just reporting data - the maps are the key!!\"\nNo alt text provided for this image\n\n\nThe “demo” Graboyes references in his email, is the demo game featured in the stolen VGM. Trackmania is the game that features Beyond Gaming’s proprietary mapping technology and utilizes SwayZ Software (also proprietary to Beyond Gaming), to determine a player’s time versus the optimal path around the track to determine payout.\n\nTrackmania was the game featured in the VGM presented to Rock Gaming in Detroit.\n\nThe mapping technology utilized in Trackmania are literally, and figuratively, the principal claims of the ‘282 and ‘138 patents prosecuted by GameCo.\n\nNo alt text provided for this image\nThe patents filed by Graboyes and GameCo feature a photograph and sketch of the VGM prototype stolen from Beyond Gaming, LLC.\n\nGameCo also copied the Beyond Gaming, LLC RTP weighting index, and smacked that on their patent as well.\n\nThe white-paper on the VGM authored, and subsequently stolen by Graboyes, when he couldn’t come to terms with Beyond Gaming, LLC, mirrors the claims of the GameCo patents almost identically.\n\nFrom January 2015 to present, Blaine Graboyes and Robert Montgomery have used the stolen assets of Beyond Gaming, LLC to build GameCo. \n\nGameCo has since raised over $56,000,000 in private investment per CrunchBase (https://www.crunchbase.com/organization/gameco-llc)\n\nMr. Graboyes, as CEO, pays himself $350,000 a year, and Mr. Montgomery is listed on the GameCo website as Chairman. \n\nMark Sinosich, the mathematician contracted by Beyond Gaming, LLC, to develop the Math Model for the VGM White-Paper is listed as one of the inventors of GameCo’s patent.\n\nInterestingly, Beyond Gaming, LLC is mentioned - nowhere.\n\nThe reason that this is the case, is because Yamek and Legeza were afraid to sue GameCo, because Graboyes made it clear, it would be the type of litigation that could cost them their homes. Their homes, where their children live.\n\nPeople like Blaine Graboyes, who are a slap away from singing show-tunes on command, are in no position to bully anyone.\n\nThe fact that this gonif has been allowed, even encouraged, to pollute the space with his endless parade of bullshit is an embarrassment to our industry, an insult to true innovators, and an enormous black eye on the Great State of Nevada.\n\nWe reached out to Blaine Graboyes directly and through his attorney. They had no comment at the time of publication.\n\nPublished By\n\nDarryl Rosenblatt\nDarryl Rosenblatt\nDirector of Engineering at Scrappy Elegant Gaming\nThis article describes in detail, one of the most blatant intellectual property thefts, ever seen in the casino gaming industry. Learn how Blaine Graboyes, and GameCo LLC stole a young man's technology and convinced an industry that it was their own. #slots #casino #casinogaming #casinogames #gamingindustry #gaming #gamingnews #gaminglife #gamingcommunity #videogames #arcadegames #nevada #esports #investors #investment #frauds\n\nThis Link takes you to a Time-lined Dossier of evidence compiled by the true inventors. \n\nhttps://drive.google.com/file/d/1XVyWWEMNVPDCDWjVa59tBqyGB3g2zXHy/view?usp=drivesdk", "link": "https://www.reddit.com/r/technology/comments/g2mop3/sex_lies_and_video_games_story_of_possibly_the/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "sex, lies, and video games. story of possibly the biggest fraud casino gaming history /!/ \n\nauthor: darryl rosenblatt writes......\n\ni wrote an article a couple of weeks ago about skill-based games. i've been tracking the performance of these games since they were introduced to the market a few years ago.\n\nin this particular article, i mentioned a company called gameco, and i referenced it's ceo, blaine graboyes.\n\nafter i published the article, i received an enormous amount of messages and emails.\n\nthese could be sorted into three piles.\n\nfirst, there were the folks that completely agreed that skill based games are better suited in their own environment, where they don't have to compete with slots.\n\nsecond, there were the folks that thought i was crazy, and that i was being really harsh on mr. graboyes.\n\nthird, there was a disproportionate amount of folks that wanted to talk to me about mr. graboyes himself.\n\nnow, i am an amateur journalist. i like to say \"journalist\", because i like to think that i take more responsibility for what i publish, than say, a blogger.\n\nhowever, i promise, if it weren't for spell-check, and a wife with a keen eye for grammar, you'd think this piece was authored by a fourth grader, whose english was a second language.\n\nwith that said, i don't want to talk about anyone.\n\nbut, the emails were persistent, and what was weird, is that these people were not crackpots.\n\nfinanciers, angel investors, gameco employees, ex-gameco employees, former partners, engineers, even the ex-coo of gameco had reached out to me, with what amounted to be, a plethora of allegations against blaine graboyes.\n\nto say that these people were upset, would be like saying steve wynn liked to flirt.\n\nthese individuals described blaine graboyes as a man who treats the truth like a -----> tree !!!  falling in the woods. if you can't see it, and you can't hear it, it simply didn't happen.\n\nhowever, none of these things really had anything to do with the gameco product, and despite numerous accusations to the contrary, the only thing i saw blaine guilty of was bullshitting gaming operators, and an extremely confusing haircut.\n\nthat was until i got an email from an unassuming young man, who had quite a story, and he really wanted someone to tell it.\n\njustin's tale was tall, and my patience was short, and most importantly, i needed evidence.\n\nit came in troves.\n\nin fact, it was some of the most meticulous record keeping i had ever seen.\n\nafter reading hundreds of documents, multiple email chains, dozens of files, court filings, photographs, videos, corporate board recordings, schematics, patents, and interviewing the other people involved, i can say with absolute certainty, the gameco story does not begin with blaine graboyes, and an epiphany, in new york city.\n\nno alt text provided for this image\nthe story of gameco begins in a small suburb of toledo, ohio called, sylvania, and with a young competitive gamer named justin yamek.\n\njustin worked as a journeyman during the day, and spent most of his free time playing video games.\n\nexcept, justin’s free time wasn’t free. gaming is an expensive hobby, and as accomplished as he was at playing video games, the equipment, travel, and upgrades, were almost unattainable on his carpenters salary.\n\njustin envisioned a privately held company that would run grassroots competitions for the mass market of “core gamers” by rewarding their participation while playing their favorite games on pc, consoles, social, and mobile.\n\nno alt text provided for this image\njustin developed his concept to include the first video game casino. this would be the home for gamers, just like him, where the outside is built and branded to look like a video game console, with pulsing lights attracting visitors. all of the attractions are video game themed, the floors and rooms evoke game genres and characters, and the gambling is focused on video games.\n\nno alt text provided for this image\ninstead of slot machines, there are rows of individual gaming stations at which players can compete locally and online.\n\n\nat the heart of this new video game gambling casino concept was justin’s new flagship product, the vgm, or video game gambling machine.\n\ndesigned specifically for younger players, the vgm is a single player, or multi-player gaming experience that allows players to gamble on the outcome of video games.\n\njustin envisioned these games to replace traditional slot machines, which often generate 60% to 75% of the $60bn/yr in u.s. gambling revenue.\n\njustin shared his idea with his brother-in-law,tony legeza, because he knew him to have experience in product development, and was aware that mr. legeza holds a degree in mechanical engineering, and had graduate cum laude from eastern michigan university.\n\ntony found merit in justin’s concept and launched beyond gaming, llc in july of 2009.\n\nthe original founders of beyond gaming, llc were :  anthony j. legeza jr. , justin yamek, dan gross, and brandon cohen.\n\nthe original board consisted of tony legeza, justin yamek, and dan gross, the new chief technology officer for the company. \n\nin september of 2009, as one of his first official acts as ceo, mr. legeza successfully secured an ignite! grant for beyond gaming in the amount of $37,500.00\n\nbetween 2009 and 2010 tony legeza, in his role as ceo, raised seed money (angel) from family and friends in the approximate amount of $250,000.\n\nin 2010, tony legeza, in his role as ceo, raised approximately $500,000 (series a), through rocket ventures.\n\nin september 2011, tony legeza, in his role as ceo raised $850,000 through wpschallenger - heli holdings i investment (common b shares).\n\nfrom 2013 - 2014 beyond gaming, llc also was funded through a series of convertible debt notes from challenger &amp; rocket ventures in excess of $1m.\n\nbetween october 2011- mid 2012 the corporate board for beyond gaming, llc consisted of various principals of wps challenger.\n\nat the request of mr. legeza, robert montgomery is brought onto the board of directors to replace graeme weston, whom mr. legeza felt was underperforming in his position on the board.\n\nrobert montgomery had a personal relationship with challenger ceo &amp; beyond gaming board member, bruce steinberg, and convinces the board to bring in blaine graboyes - “an old friend with vast experience with video games”, into the business as a consultant. \n\nblaine's ex-wife is originally from toledo, ohio so they eventually moved to toledo, and rented a house from mr. legeza. \n\nin september 2012, beyond gaming, llc began developing protypes for the vgm and presented detroit venture partners &amp; rock gaming (adam suliman) ideas about a video game casino and hardware/software solutions to put on the casino floor.\n\ntony legeza resigned as ceo in november in 2012, and remained active with the company, as a paid consultant for five months, as blaine graboyes took the reigns as the ceo of beyond gaming, llc.\n\n\nprototypes were rapidly being developed for the first vgm, conceptual renderings were being created for the video game casino, and marketing materials were being designed by beyond gaming llc, that focused primarily on the vgm and the video game casino concept.\n\non december 11, 2013, the beyond gaming platform debuted at a private event hosted by rock gaming in their offices in detroit, michigan. players were able to experience the vgm and vgc concepts for the first time.\n\nblaine graboyes attended this event.\n\nno alt text provided for this image\nthe prototype was extremely well received, and there was enormous interest in seeing the next iteration of the machine.\n\nit is the assertion of yamek and legeza, that it is during this event, that blaine graboyes decided that he was going to find a way to make this new video game gambling technology his own.\n\nfour months later, in april 2014, graboyes e-mails the future coo of gameco, and friend of thirty years, cinnamon booth,\n\n“this past year, i’ve developed a way to gamble playing video games at the casino. our funders have run out of cash and i’ve negotiated to buy the company. now i need to raise funds quickly to make this transition. attached is a quick backgrounder. if interesting, i’d provide a nda and support materials. the technology and business are ready to go - need the funding. thought this may be a match for some of your contacts. please lmk if you have time and i can walk through the opportunity.”\n\ngraboyes enclosed a “backgrounder” to his email, that duplicated all of beyond gaming’s content and replaced beyond gaming’s logo and branding with gameco’s.\n\nat this point, graboyes is utilizing beyond gaming promotional material to raise money for his own company, (gameco) without the permission or knowledge of beyond gaming, llc. \n\non or about may of 2014, with interest in beyond gaming’s concept at a fever pitch, blaine graboyes decides the company is insolvent, and spends the next several months trying to convince the board, that chapter seven bankruptcy is the only option moving forward, for beyond gaming.\n\nciting beyond gaming’s lack of cash, blaine pushed for the bankruptcy for the benefit of the “creditors”, the two biggest creditors being blaine graboyes and robert montgomery, for what they have claimed, but have failed to prove, were for unpaid wages.\n\nof important note, save for montgomery and graboyes’s unsubstantiated claims for unpaid wages, which were never proven, there were high net-wealth individuals at the time willing to put forward the seed capital to further beyond gaming, llc, and several offers were formally presented to the board of directors which were ultimately ignored &amp; expired.\n\nto accept any offers proffered by suitors of beyond gaming, blaine graboyes would have to forfeit his plan to start his own company using beyond gaming’s proprietary technology.\n\nneither graboyes, nor montgomery, had anything to lose, because they already had a plan in place to purchase the technology from beyond gaming, and dump the debt in bankruptcy court.\n\nas such, graboyes presented a plan to the board that would purposely omit beyond gaming’s ip assets from the chapter 7 filing, leaving them unencumbered, so that blaine graboyes could purchase them directly from beyond gaming, llc. \n\nthis was essential in order for blaine to legally launch gameco, utilizing beyond gaming’s work product.\n\nrocket ventures was willing to fund graboye’s gameco venture, provided that the ip was purchased from beyond gaming, llc.\n\n\non june 4th 2014, graboyes drafted a purchase agreement between gameco and beyond gaming, llc, confirming and identifying specific intellectual property, owned by beyond gaming, llc, and to be conveyed to gameco.\n\nthese assets were listed in the agreement as:\n\nschedule 1.1: certain identified purchase assets\n\nprototype software\nswayz software\ncabinet prototype\npelican prototype\nmath model (excel spreadsheet)\nvgm white paper\nexecutive summary documents\n\n\nwhat graboyes did not anticipate, was beyond gaming’s complete and total rejection of his offer.\n\nbeyond gaming’s refusal to accept graboyes’s offer was simple, and three-pronged.\n\nfirst, blaine would continuously refer to himself as the inventor, and or pioneer of the technology, and beyond gaming, llc sought recognition for their work in the space. \n\nsecond, it was evident that graboyes was abusing his position as ceo of beyond gaming, llc, and manipulating the future of the company, to his benefit, without respect to members of beyond gaming, llc.\n\nand third, the gross inequity of the agreement presented.\n\nbeyond gaming could not see leaving their original investors with nothing.\n\nblaine was walking away with 80% of the new business and 100% of the beyond gaming assets.\n\nconsidering he had 0% ownership of beyond gaming, llc, this agreement seemed ridiculous.\n\nplus, it was become evident in hindsight, that blaine was promising positions in the newly formed gameco company to people on the board, if they supported his chapter seven scheme.\n\nunable to strike a deal with beyond gaming, llc , rocket ventures and challenger pursued, and eventually funded the chapter 7 bankruptcy, leaving blaine graboyes unemployed.\n\nno alt text provided for this image\nblaine graboyes left beyond gaming, llc and took all the physical, and intellectual property assets of the company with him, including the vgm prototype.\n\ngraboyes unexpected change of fortune left him in a panic, as evidenced in an email to his friend cinnamon booth on july 29, 2014,\n\n“i’ve had to pass on the funding in ohio. i’m now absolutely desperate for work. will consider and pitch for any opportunities anywhere. remaining focused on gameco but need to hustle to stay alive.\nwill share more next time we talk.”\nbetween september and november 2014, blaine graboyes and robert montgomery began rebranding all of the beyond gaming, llc marketing assets into gameco.\n\n\n\n\nwhile it was relatively simple to simply replace the beyond gaming logo on promotional materials, it was an entirely different thing to duplicate the demo software in the beyond gaming vgm prototype.\n\nwhereas, blaine had the code, he had absolutely no idea at the time what to do with it.\n\non december 14, 2014, blaine emailed cinnamon booth and robert montgomery, he had a breakthrough!\n\n\"here’s a quick update on the situation. i’ve hacked the demo such that it’s usable but still broken.\"\nthere are two main issues:\n• the game does not display full screen (you can see edges)\n• the “bank” is not working properly (shows wrong amount)\"\nit’s not worth trying to debug this further. i want to focus on making a new, slicker demo.\nwe will still use trackmania as the core game.\n\"the work on the maps is what’s really essential.\neverything else is just reporting data - the maps are the key!!\"\nno alt text provided for this image\n\n\nthe “demo” graboyes references in his email, is the demo game featured in the stolen vgm. trackmania is the game that features beyond gaming’s proprietary mapping technology and utilizes swayz software (also proprietary to beyond gaming), to determine a player’s time versus the optimal path around the track to determine payout.\n\ntrackmania was the game featured in the vgm presented to rock gaming in detroit.\n\nthe mapping technology utilized in trackmania are literally, and figuratively, the principal claims of the ‘282 and ‘138 patents prosecuted by gameco.\n\nno alt text provided for this image\nthe patents filed by graboyes and gameco feature a photograph and sketch of the vgm prototype stolen from beyond gaming, llc.\n\ngameco also copied the beyond gaming, llc rtp weighting index, and smacked that on their patent as well.\n\nthe white-paper on the vgm authored, and subsequently stolen by graboyes, when he couldn’t come to terms with beyond gaming, llc, mirrors the claims of the gameco patents almost identically.\n\nfrom january 2015 to present, blaine graboyes and robert montgomery have used the stolen assets of beyond gaming, llc to build gameco. \n\ngameco has since raised over $56,000,000 in private investment per crunchbase (https://www.crunchbase.com/organization/gameco-llc)\n\nmr. graboyes, as ceo, pays himself $350,000 a year, and mr. montgomery is listed on the gameco website as chairman. \n\nmark sinosich, the mathematician contracted by beyond gaming, llc, to develop the math model for the vgm white-paper is listed as one of the inventors of gameco’s patent.\n\ninterestingly, beyond gaming, llc is mentioned - nowhere.\n\nthe reason that this is the case, is because yamek and legeza were afraid to sue gameco, because graboyes made it clear, it would be the type of litigation that could cost them their homes. their homes, where their children live.\n\npeople like blaine graboyes, who are a slap away from singing show-tunes on command, are in no position to bully anyone.\n\nthe fact that this gonif has been allowed, even encouraged, to pollute the space with his endless parade of bullshit is an embarrassment to our industry, an insult to true innovators, and an enormous black eye on the great state of nevada.\n\nwe reached out to blaine graboyes directly and through his attorney. they had no comment at the time of publication.\n\npublished by\n\ndarryl rosenblatt\ndarryl rosenblatt\ndirector of engineering at scrappy elegant gaming\nthis article describes in detail, one of the most blatant intellectual property thefts, ever seen in the casino gaming industry. learn how blaine graboyes, and gameco llc stole a young man's technology and convinced an industry that it was their own. #slots #casino #casinogaming #casinogames #gamingindustry #gaming #gamingnews #gaminglife #gamingcommunity #videogames #arcadegames #nevada #esports #investors #investment #frauds\n\nthis link takes you to a time-lined dossier of evidence compiled by the true inventors. \n\nhttps://drive.google.com/file/d/1xvywwemnvpdcdwjva59tbqygb3g2zxhy/view?usp=drivesdk", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/g2mop3/sex_lies_and_video_games_story_of_possibly_the/',)", "identifyer": 5520470, "year": "2020"}, {"autor": "seminarlinks", "date": 1596367347000, "content": "Solar Tree Seminar Topics: IEEE | PDF Journals (Download)", "link": "https://www.reddit.com/r/technology/comments/i2aikq/solar_tree_seminar_topics_ieee_pdf_journals/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "solar -----> tree !!!  seminar topics: ieee | pdf journals (download)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.topicsforseminar.com/2020/07/solar-tree-seminar-topics-ieee-pdf.html',)", "identifyer": 5521935, "year": "2020"}, {"autor": "gadgetgets", "date": 1600526046000, "content": "Sweet and Mini Willow Tree Keepsake Box", "link": "https://www.reddit.com/r/technology/comments/ivtlyn/sweet_and_mini_willow_tree_keepsake_box/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "sweet and mini willow -----> tree !!!  keepsake box", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/sweet-and-mini-willow-tree-keepsake-box/',)", "identifyer": 5522425, "year": "2020"}, {"autor": "onlinepeepsofficial", "date": 1608806241000, "content": "Under the Christmas tree, more than 100 Android apps and games on offer await you", "link": "https://www.reddit.com/r/technology/comments/kjdavg/under_the_christmas_tree_more_than_100_android/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "under the christmas -----> tree !!! , more than 100 android apps and games on offer await you", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.onlinepeeps.org/under-the-christmas-tree-more-than-100-android-apps-and-games-on-offer-await-you/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=under-the-christmas-tree-more-than-100-android-apps-and-games-on-offer-await-you',)", "identifyer": 5523778, "year": "2020"}, {"autor": "fchung", "date": 1605808869000, "content": "Satellites could soon map every tree on Earth", "link": "https://www.reddit.com/r/technology/comments/jx7nrw/satellites_could_soon_map_every_tree_on_earth/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "satellites could soon map every -----> tree !!!  on earth", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 3, "media": "('link',)", "medialink": "('https://www.nature.com/articles/d41586-020-02830-3',)", "identifyer": 5533810, "year": "2020"}, {"autor": "gadgetgets", "date": 1594679674000, "content": "EAMBRITE 2FT 24LT Warm White LED Battery Operated Birch Tree", "link": "https://www.reddit.com/r/technology/comments/hqpfe0/eambrite_2ft_24lt_warm_white_led_battery_operated/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "eambrite 2ft 24lt warm white led battery operated birch -----> tree !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/eambrite-2ft-24lt-warm-white-led-battery-operated-birch-tree/',)", "identifyer": 5542690, "year": "2020"}, {"autor": "xiao6alice", "date": 1597839832000, "content": "The Best Cheap Speaker Bluetooth With Christmas Tree", "link": "https://www.reddit.com/r/technology/comments/icmmc3/the_best_cheap_speaker_bluetooth_with_christmas/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "the best cheap speaker bluetooth with christmas -----> tree !!! ", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('rich:video',)", "medialink": "('https://www.youtube.com/watch?v=3XYRy6Z_km8&amp;feature=share',)", "identifyer": 5546698, "year": "2020"}, {"autor": "gadgetgets", "date": 1596746049000, "content": "Canvas Wall Art Red Tree Picture Prints", "link": "https://www.reddit.com/r/technology/comments/i4zmwk/canvas_wall_art_red_tree_picture_prints/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "canvas wall art red -----> tree !!!  picture prints", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/canvas-wall-art-red-tree-picture-prints/',)", "identifyer": 5547254, "year": "2020"}, {"autor": "WestsideTrend", "date": 1606375793000, "content": "3 in 1 Tree Lamp/ Bluetooth Speaker/ Phone charger!! Awesome invention!!!! Must check out!!! Great gift for the holidays", "link": "https://www.reddit.com/r/technology/comments/k1atou/3_in_1_tree_lamp_bluetooth_speaker_phone_charger/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "3 in 1 -----> tree !!!  lamp/ bluetooth speaker/ phone charger!! awesome invention!!!! must check out!!! great gift for the holidays", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://macaves.myshopify.com',)", "identifyer": 5548561, "year": "2020"}, {"autor": "FossGuru", "date": 1583828151000, "content": "Decision tree machine learning", "link": "https://www.reddit.com/r/technology/comments/fgai5s/decision_tree_machine_learning/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "decision -----> tree !!!  machine learning", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.fossguru.com/decision-tree-machine-learning-some-real-life-example/',)", "identifyer": 5550216, "year": "2020"}, {"autor": "rijal_suprabhat", "date": 1588427996000, "content": "Machine Learning by the Decision Tree Algorithm", "link": "https://www.reddit.com/r/technology/comments/gc6x44/machine_learning_by_the_decision_tree_algorithm/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "machine learning by the decision -----> tree !!!  algorithm", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('http://www.suppe.me/post/machine-learning-by-the-decision-tree-algorithm/',)", "identifyer": 5569047, "year": "2020"}, {"autor": "gadgetgets", "date": 1607542469000, "content": "Pre-lit Artificial Christmas Tree", "link": "https://www.reddit.com/r/technology/comments/k9ytc3/prelit_artificial_christmas_tree/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "pre-lit artificial christmas -----> tree !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.gadgetgets.com/pre-lit-artificial-christmas-tree/',)", "identifyer": 5574462, "year": "2020"}, {"autor": "Tech_Tube1", "date": 1607404360000, "content": "Christmas light tricks for apartments: Balcony, window, tree and more", "link": "https://www.reddit.com/r/technology/comments/k8y3c6/christmas_light_tricks_for_apartments_balcony/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "christmas light tricks for apartments: balcony, window, -----> tree !!!  and more", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://tech-tube10.blogspot.com/2020/12/christmas-light-tricks-for-apartments.html',)", "identifyer": 5574572, "year": "2020"}, {"autor": "SergioOwls", "date": 1605115384000, "content": "Programming an AI Behavior Tree in Unity! /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/jscben/programming_an_ai_behavior_tree_in_unity/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "programming an ai behavior -----> tree !!!  in unity! /!/ [removed]", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 2, "media": "('self',)", "medialink": "('https://www.reddit.com/r/technology/comments/jscben/programming_an_ai_behavior_tree_in_unity/',)", "identifyer": 5575983, "year": "2020"}, {"autor": "mwarr5225", "date": 1592326362000, "content": "Why Infinite Red uses MobX-State-Tree instead of Redux", "link": "https://www.reddit.com/r/technology/comments/ha7rsx/why_infinite_red_uses_mobxstatetree_instead_of/", "origin": "Reddit", "suborigin": "technology", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "why infinite red uses mobx-state------> tree !!!  instead of redux", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://shift.infinite.red/why-infinite-red-uses-mobx-state-tree-instead-of-redux-d6c1407dead',)", "identifyer": 5579705, "year": "2020"}], "name": "treetechnology2020"}