{"interestingcomments": [{"autor": "_FuturistechInfo", "date": 1577558261000, "content": "🖖 Top Futurology News - For the week of Dec 27, 2019 /!/  **We hope you enjoy this weeks update!**  \n\n* [Russia Becomes First Nation with an Operational Hypersonic Weapon](https://futurism.com/russia-first-nation-operational-hypersonic-weapon)\n* [The FAA wants to track all drones flying in the US](https://www.engadget.com/2019/12/27/faa-drones-tracking-system/)\n* [5 nutrients that can boost your mood](https://www.futurity.org/food-nutrition-emotions-2241462/)\n* [The Future of Aviation Will Be Greener and Faster Than Ever Before](https://singularityhub.com/2019/12/26/the-future-of-aviation-will-be-greener-and-faster-than-ever-before/)\n* [Capturing CO2 from trucks and reducing their emissions by 90%](https://actu.epfl.ch/news/capturing-co2-from-trucks-and-reducing-their-emi-2/)\n* [First chip-to-chip quantum teleportation harnessing silicon photonic chip fabrication](https://phys.org/news/2019-12-chip-to-chip-quantum-teleportation-harnessing-silicon.html)\n* [Lasers learn to accurately spot space junk](https://phys.org/news/2019-12-lasers-accurately-space-junk.html)\n* [The Race to Invest in the Space Economy](https://ritholtz.com/2019/12/the-race-to-invest-in-the-space-economy/)\n* [Scientists Gene-Edited Tomatoes to Make Them Grow Like Grapes](https://www.popularmechanics.com/science/green-tech/a30310123/gene-edited-tomatoes/)\n* [Electronics at the speed of light](https://phys.org/news/2019-12-electronics.html)\n* [Electric truck startup Rivian raises $1.3 billion more to challenge Tesla](https://arstechnica.com/?p=1636435)\n* [Pentagon Remains Bullish on 3D Printing, Despite Regulatory ‘Slog’](https://www.defenseone.com/technology/2019/12/pentagon-remains-bullish-3d-printing-despite-regulatory-slog/162074/)\n* [Here are the top tech trends of 2020, according to top experts](https://www.fastcompany.com/90374432/here-are-the-top-tech-trends-of-2020-according-to-top-experts?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [20 predictions for 2020: Here's what people thought would happen by this year...](https://www.usatoday.com/story/news/nation/2019/12/22/2020-predictions-decades-ago-self-driving-cars-mars-voting/2594825001/)\n* [Would You Want a Personal AI That Knows Everything About You?](https://singularityhub.com/2019/12/22/would-you-want-a-personal-ai-that-knows-everything-about-you/)\n* [Elon Musk welcomes Space Force with 2 words on Twitter: 'Starfleet begins'](https://www.businessinsider.com/elon-musk-welcomes-space-force-on-twitter-with-2-words-2019-12)\n* [The True Scale of Atoms](https://theawesomer.com/the-true-scale-of-atoms/552313/)\n* [Trump Officially Establishes US Space Force with 2020 Defense Bill Signing](http://www.leonarddavid.com/u-s-space-force-sixth-branch-of-the-armed-forces/)\n* [Fed Entrenched in Repo Market. How Does It Get Out?](https://finance.yahoo.com/news/fed-entrenched-repo-market-does-120000251.html)\n* [Meet creepy robots poised to take over world...](https://nypost.com/2019/12/21/meet-the-creepy-robots-poised-to-take-over-the-world/)\n* [‘Game-changer’ methanol battery keeps drone in the air for 12 hours](https://www.scmp.com/news/china/science/article/3042818/chinese-scientists-create-game-changer-methanol-battery-keeps)\n* [Facebook's AI mathematician can solve university calculus problems](https://www.newscientist.com/article/2228399-facebooks-ai-mathematician-can-solve-university-calculus-problems/)\n* [Trump might help free science that’s locked behind paywalls](https://www.vox.com/science-and-health/2019/12/19/21029902/open-access-trump)\n* [The US government has approved funds for geoengineering research](https://www.technologyreview.com/s/614991/the-us-government-will-begin-to-fund-geoengineering-research/)", "link": "https://www.reddit.com/r/singularity/comments/egubqo/top_futurology_news_for_the_week_of_dec_27_2019/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "🖖 top futurology news - for the week of dec 27, 2019 /!/  **we hope you enjoy this weeks update!**  \n\n* [russia becomes first nation with an operational hypersonic weapon](https://futurism.com/russia-first-nation-operational-hypersonic-weapon)\n* [the faa wants to track all drones flying in the us](https://www.engadget.com/2019/12/27/faa-drones-tracking-system/)\n* [5 nutrients that can boost your mood](https://www.futurity.org/food-nutrition-emotions-2241462/)\n* [the future of aviation will be greener and faster than ever before](https://singularityhub.com/2019/12/26/the-future-of-aviation-will-be-greener-and-faster-than-ever-before/)\n* [capturing co2 from trucks and reducing their emissions by 90%](https://actu.epfl.ch/news/capturing-co2-from-trucks-and-reducing-their-emi-2/)\n* [first chip-to-chip quantum teleportation harnessing silicon photonic chip fabrication](https://phys.org/news/2019-12-chip-to-chip-quantum-teleportation-harnessing-silicon.html)\n* [lasers learn to accurately spot space junk](https://phys.org/news/2019-12-lasers-accurately-space-junk.html)\n* [the race to invest in the space economy](https://ritholtz.com/2019/12/the-race-to-invest-in-the-space-economy/)\n* [scientists gene-edited tomatoes to make them grow like grapes](https://www.popularmechanics.com/science/green-tech/a30310123/gene-edited-tomatoes/)\n* [electronics at the speed of light](https://phys.org/news/2019-12-electronics.html)\n* [electric truck startup rivian raises $1.3 billion more to challenge tesla](https://arstechnica.com/?p=1636435)\n* [pentagon remains bullish on 3d printing, despite regulatory ‘slog’](https://www.defenseone.com/technology/2019/12/pentagon-remains-bullish-3d-printing-despite-regulatory-slog/162074/)\n* [here are the top tech trends of 2020, according to top experts](https://www.fastcompany.com/90374432/here-are-the-top-tech-trends-of-2020-according-to-top-experts?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [20 predictions for 2020: here's what people thought would happen by this year...](https://www.usatoday.com/story/news/nation/2019/12/22/2020-predictions-decades-ago-self-driving-cars-mars-voting/2594825001/)\n* [would you want a personal ai that knows everything about you?](https://singularityhub.com/2019/12/22/would-you-want-a-personal-ai-that-knows-everything-about-you/)\n* [elon musk welcomes space force with 2 words on twitter: 'starfleet begins'](https://www.businessinsider.com/elon-musk-welcomes-space-force-on-twitter-with-2-words-2019-12)\n* [the true scale of atoms](https://theawesomer.com/the-true-scale-of-atoms/552313/)\n* [trump officially establishes us space force with 2020 defense bill signing](http://www.leonarddavid.com/u-s-space-force-sixth------> branch !!! -of-the-armed-forces/)\n* [fed entrenched in repo market. how does it get out?](https://finance.yahoo.com/news/fed-entrenched-repo-market-does-120000251.html)\n* [meet creepy robots poised to take over world...](https://nypost.com/2019/12/21/meet-the-creepy-robots-poised-to-take-over-the-world/)\n* [‘game-changer’ methanol battery keeps drone in the air for 12 hours](https://www.scmp.com/news/china/science/article/3042818/chinese-scientists-create-game-changer-methanol-battery-keeps)\n* [facebook's ai mathematician can solve university calculus problems](https://www.newscientist.com/article/2228399-facebooks-ai-mathematician-can-solve-university-calculus-problems/)\n* [trump might help free science that’s locked behind paywalls](https://www.vox.com/science-and-health/2019/12/19/21029902/open-access-trump)\n* [the us government has approved funds for geoengineering research](https://www.technologyreview.com/s/614991/the-us-government-will-begin-to-fund-geoengineering-research/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/egubqo/top_futurology_news_for_the_week_of_dec_27_2019/',)", "identifyer": 5584995, "year": "2019"}, {"autor": "FinnicSpaceWorld", "date": 1563604364000, "content": "Singularity and Metaphysics /!/ In this thread, we discuss implications of Singularity and its effect on Metaphysics. Metaphysics is in my definition, a study of fundamental reality. Existence, Space and Time are the three fundamental foundations of it. I consider Metaphysics a valid branch but dead against it being misused to prove nonsense. \n\nWe can discuss various aspects of Metaphysics like Space and its nature, Time and it's nature, Time travel, etc as all this has effect on the biggest center of Singularity, Consciousness. \n\n A few Warnings:\n\nSimulation argument is banned here. It's an open loop argument that never makes any sense.  \n\nTheistic elements are totally banned. Same problem as the Simulation. \n\nWe may believe in God but we believe more like a Panentheistic form as it's fundamentally impossible for anything like \"God\" to be totally separate as in Deism and Theism. \n\nPersonal attacks are totally unacceptable. Debate and discuss respectfully even if it's a fierce debate. If your point is wrong, you need to change it or stop debating. (I am posting these rules because a member did all these offences together in an another thread and seemed to deny too much Science).", "link": "https://www.reddit.com/r/singularity/comments/cfire5/singularity_and_metaphysics/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "singularity and metaphysics /!/ in this thread, we discuss implications of singularity and its effect on metaphysics. metaphysics is in my definition, a study of fundamental reality. existence, space and time are the three fundamental foundations of it. i consider metaphysics a valid -----> branch !!!  but dead against it being misused to prove nonsense. \n\nwe can discuss various aspects of metaphysics like space and its nature, time and it's nature, time travel, etc as all this has effect on the biggest center of singularity, consciousness. \n\n a few warnings:\n\nsimulation argument is banned here. it's an open loop argument that never makes any sense.  \n\ntheistic elements are totally banned. same problem as the simulation. \n\nwe may believe in god but we believe more like a panentheistic form as it's fundamentally impossible for anything like \"god\" to be totally separate as in deism and theism. \n\npersonal attacks are totally unacceptable. debate and discuss respectfully even if it's a fierce debate. if your point is wrong, you need to change it or stop debating. (i am posting these rules because a member did all these offences together in an another thread and seemed to deny too much science).", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 12, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/cfire5/singularity_and_metaphysics/',)", "identifyer": 5585286, "year": "2019"}, {"autor": "BenRayfield", "date": 1559394674000, "content": "What are the basic CRISPER actions which together are able to do anything CRISPR can do though may be slower or generate extra molecules? I strongly suspect that Unlambda (s k lambdas), including &lt;func,param,return&gt; caching, could operate in a swimming pool full of DNA, alternate stir still /!/ If it works, then the whole internet could run in a swimming pool or something like that, if duplication could be kept down but duplication is useful to find things that fit together faster find one such pair... maybe if each function starts with \"telomere\"-like in binary, unlike telomeres which are unary, and stir the pool long enough that every 2 molecules are very likely to have touched eachother many times, and if a duplicate is detected then simultaneously a third molecule modifies one in a way that can be caught in a filter to leave the pool... so maybe its 1000 times slower than I thought, but every cubic millimeter has about 10\\^17 atoms, and if you like, we could make a whole planet whose surface (not too deep cuz density) is all dna computer. TPUs are great for running parallel calculations in parallel, however slow they are, but we could simulate every atom in a Human body in realtime with such a planet (or maybe it would need to be galaxy size of many planets which are mixed over and over within each and in 4 edges each which is the FFT/wavenetlike topology?, and if we were very near a blackhole then the computer would run that much faster such as a million years had passed since we went in some hours ago) across all of history in a cup of fluid and drip more integer opcodes into it. Such integers would have a hash in a way that prevents their interaction with almost everything since a hash is basically random, and there might have to be molecules made to get rid of certain things. A computer is anything which calls a function on a function and returns a function, and the 2 functions you start with are Lx.Ly.x (k) and La.Lb.Lc.((a c)(b c)) (S). S a b is a function that calls a(param) on b(param), where a may further branch as another s or k or any of the infinite combos of them. The hash would be selected mostly randomly (once then use it forever after, or maybe I would want it more flexible)...among the set of all possible permutations of the values of a small number of bits (such as x = majorityBit(!y !z w)) and sequence of maybe 300 of those.\n\n&amp;#x200B;\n\nExistence proof: DNA built Human grabbed molecules that built computer that computes s and k lambdas. Theres probably a much shorter path. Even if its a trillion times slower than normal computing of s and k, thats still thousands of calculations per cubic millimeter per alternate stir still, and it makes more of itself if given some very common molecules. and such molecules could be mass produced by crispring tiny tools to convert other things we may have.\n\n&amp;#x200B;\n\nIf AIDS is a computer virus, it would have no chance to without a mind resist a mind which can port an existing AI algorithm from any language to sk to crispr to molecules. But nomatter how easy it is to destroy AIDS, which probably anyone could do by burning their whole body to dust, the hard part in any such action on a specific molecule and maybe some variants... is that it does not do a great many other possible things. If such things can be written in s k, that would be left to the AIs.\n\n&amp;#x200B;\n\nIs there a crispr cloud I can rent minute by minute? The calculations I would do never take more than a few sequential steps where a step is everything touches everything. The parallel part is s will do both branches at once, which any time a function called on a param has the same return value as any existing function, it checks for duplicates and shits them.", "link": "https://www.reddit.com/r/singularity/comments/bvkn2m/what_are_the_basic_crisper_actions_which_together/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "what are the basic crisper actions which together are able to do anything crispr can do though may be slower or generate extra molecules? i strongly suspect that unlambda (s k lambdas), including &lt;func,param,return&gt; caching, could operate in a swimming pool full of dna, alternate stir still /!/ if it works, then the whole internet could run in a swimming pool or something like that, if duplication could be kept down but duplication is useful to find things that fit together faster find one such pair... maybe if each function starts with \"telomere\"-like in binary, unlike telomeres which are unary, and stir the pool long enough that every 2 molecules are very likely to have touched eachother many times, and if a duplicate is detected then simultaneously a third molecule modifies one in a way that can be caught in a filter to leave the pool... so maybe its 1000 times slower than i thought, but every cubic millimeter has about 10\\^17 atoms, and if you like, we could make a whole planet whose surface (not too deep cuz density) is all dna computer. tpus are great for running parallel calculations in parallel, however slow they are, but we could simulate every atom in a human body in realtime with such a planet (or maybe it would need to be galaxy size of many planets which are mixed over and over within each and in 4 edges each which is the fft/wavenetlike topology?, and if we were very near a blackhole then the computer would run that much faster such as a million years had passed since we went in some hours ago) across all of history in a cup of fluid and drip more integer opcodes into it. such integers would have a hash in a way that prevents their interaction with almost everything since a hash is basically random, and there might have to be molecules made to get rid of certain things. a computer is anything which calls a function on a function and returns a function, and the 2 functions you start with are lx.ly.x (k) and la.lb.lc.((a c)(b c)) (s). s a b is a function that calls a(param) on b(param), where a may further -----> branch !!!  as another s or k or any of the infinite combos of them. the hash would be selected mostly randomly (once then use it forever after, or maybe i would want it more flexible)...among the set of all possible permutations of the values of a small number of bits (such as x = majoritybit(!y !z w)) and sequence of maybe 300 of those.\n\n&amp;#x200b;\n\nexistence proof: dna built human grabbed molecules that built computer that computes s and k lambdas. theres probably a much shorter path. even if its a trillion times slower than normal computing of s and k, thats still thousands of calculations per cubic millimeter per alternate stir still, and it makes more of itself if given some very common molecules. and such molecules could be mass produced by crispring tiny tools to convert other things we may have.\n\n&amp;#x200b;\n\nif aids is a computer virus, it would have no chance to without a mind resist a mind which can port an existing ai algorithm from any language to sk to crispr to molecules. but nomatter how easy it is to destroy aids, which probably anyone could do by burning their whole body to dust, the hard part in any such action on a specific molecule and maybe some variants... is that it does not do a great many other possible things. if such things can be written in s k, that would be left to the ais.\n\n&amp;#x200b;\n\nis there a crispr cloud i can rent minute by minute? the calculations i would do never take more than a few sequential steps where a step is everything touches everything. the parallel part is s will do both branches at once, which any time a function called on a param has the same return value as any existing function, it checks for duplicates and shits them.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/bvkn2m/what_are_the_basic_crisper_actions_which_together/',)", "identifyer": 5586227, "year": "2019"}], "name": "branchsingularity2019"}