{"interestingcomments": [{"autor": "Mymymywatdowehavhere", "date": 1538062771000, "content": "Speculating possible enhancements for Uploads /!/ It's likely that uploads would branch out into a billion different directions with no clear direction between them. It may be impossible to predict how they might expand on current human mind architecture but I don't see the harm in speculating. I want to hear some of your ideas on possible paths of augmentation for a digital mind.\n\n1. Enhanced well being: These are the standard go to's for most uploads. Changing the underlying algorithms of synapse connections behave could possibly enhance well being. In an upload you'd likely not have to simulate the neurotransmitters themselves but only their effect, making change to the system much simpler. Adding additional virtual neurons or entire cortical columns to the virtual mind could enhance intelligence. \n2. Enhanced human-ish intelligence: There are many way's you could hypothetically enhance an uploads intelligence. Adding additional virtual neurons, adding more connections between neurons, or adding entire cortical columns/layers to the virtual brain could be an option. Qualitative improvements to virtual neuron behavior similar to what I described under #1 could also augment intelligence. \n3. Non-human intelligence augmentations: Certain tasks are much easier for a computer than a human, and often require far fewer computational resources too. Perhaps we can find new ways of combining human brain architecture with classical computer architecture or even quantum computer architectural. \n4. Multiple avatars: With enough intelligence enhancements, controlling one body might become too limiting. With an enhanced motor cortex in addition to the rest of the brain being augmented, it's easy to imagine that you'd be able to control multiple avatars.\n5. Additional senses/emotions: We know of animals that have senses we don't have access to. These could act as blue prints for how we can add them to our current physical (or virtual body) and cognitive architecture. Emotions are trickier to imagine. It's safe to assume all our current emotions were evolutionary adaptations but it's highly unlikely that these are the only physically possible modes of experience.\n6. Eliminating emotions: Certain emotions like anger and jealousy or feelings such as pain may no longer be necessary for survival. People who are into sports may choose to keep pain as they may consider it to enhance the experience. Actor's may feel the same way towards the other negative emotions. Each person may tailor their emotional experiences to enhance their favorite activities. You may choose to turn certain emotions off and on for TV shows or whatever replaces TV shows.\n7. New modes of consciousness: Thinking in more than 3 dimensions is currently unimaginable but may be possible for uploads. A more imaginable form of consciousness would be a virtual environment held completetly within the mind of the upload, with no outside computer is creating the world. Humans can hold vague images in their brain and have an internal dialogue, but imagine expanding on that ability to the point where you could run near perfect simulations of the real world and have experiments that would be too expensive to perform in real life.\n\nI'm probably just scratching the surface with what's possible, but I'd like to hear other peoples ideas of what an uploads brain may be capable of.", "link": "https://www.reddit.com/r/singularity/comments/9jdxhc/speculating_possible_enhancements_for_uploads/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "speculating possible enhancements for uploads /!/ it's likely that uploads would -----> branch !!!  out into a billion different directions with no clear direction between them. it may be impossible to predict how they might expand on current human mind architecture but i don't see the harm in speculating. i want to hear some of your ideas on possible paths of augmentation for a digital mind.\n\n1. enhanced well being: these are the standard go to's for most uploads. changing the underlying algorithms of synapse connections behave could possibly enhance well being. in an upload you'd likely not have to simulate the neurotransmitters themselves but only their effect, making change to the system much simpler. adding additional virtual neurons or entire cortical columns to the virtual mind could enhance intelligence. \n2. enhanced human-ish intelligence: there are many way's you could hypothetically enhance an uploads intelligence. adding additional virtual neurons, adding more connections between neurons, or adding entire cortical columns/layers to the virtual brain could be an option. qualitative improvements to virtual neuron behavior similar to what i described under #1 could also augment intelligence. \n3. non-human intelligence augmentations: certain tasks are much easier for a computer than a human, and often require far fewer computational resources too. perhaps we can find new ways of combining human brain architecture with classical computer architecture or even quantum computer architectural. \n4. multiple avatars: with enough intelligence enhancements, controlling one body might become too limiting. with an enhanced motor cortex in addition to the rest of the brain being augmented, it's easy to imagine that you'd be able to control multiple avatars.\n5. additional senses/emotions: we know of animals that have senses we don't have access to. these could act as blue prints for how we can add them to our current physical (or virtual body) and cognitive architecture. emotions are trickier to imagine. it's safe to assume all our current emotions were evolutionary adaptations but it's highly unlikely that these are the only physically possible modes of experience.\n6. eliminating emotions: certain emotions like anger and jealousy or feelings such as pain may no longer be necessary for survival. people who are into sports may choose to keep pain as they may consider it to enhance the experience. actor's may feel the same way towards the other negative emotions. each person may tailor their emotional experiences to enhance their favorite activities. you may choose to turn certain emotions off and on for tv shows or whatever replaces tv shows.\n7. new modes of consciousness: thinking in more than 3 dimensions is currently unimaginable but may be possible for uploads. a more imaginable form of consciousness would be a virtual environment held completetly within the mind of the upload, with no outside computer is creating the world. humans can hold vague images in their brain and have an internal dialogue, but imagine expanding on that ability to the point where you could run near perfect simulations of the real world and have experiments that would be too expensive to perform in real life.\n\ni'm probably just scratching the surface with what's possible, but i'd like to hear other peoples ideas of what an uploads brain may be capable of.", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9jdxhc/speculating_possible_enhancements_for_uploads/',)", "identifyer": 5756117, "year": "2018"}], "name": "branchsingularity2018"}