{"interestingcomments": [{"autor": "All-DayErrDay", "date": 1601043378000, "content": "Why Biological Intelligence has a MUCH Higher Ceiling /!/  So I think that this forum in general, while small, has the right combination of people in it to be interested and understand this idea. This is going to be a long read, but I promise that it isn't filled with fluff but more the line of thinking that gets me excited about the long term future. I see so much talk of UFOs flying around social media and have read into it some myself. It isn't so much if UFOs are real or not, but it always gets me thinking about extraterrestrial intelligence.\n\nI think that as human beings we are extremely constrained in our ability to understand what having varying levels of intelligence means. Our scales are very limited because it more or less goes something like: bacteria (completely perceptually 'to us' chemically driven), ants (ability to perform complex routed tasks even with a small nervous system, however limited ability to diverge from this preset ability via problem solving), mouse (small animal with a small nervous system that can accomplish simple problem solving tasks), dog (varying levels of intelligence per breed, but can solve much more complex tasks than a mouse, have some emotional intelligence of humans, can react to the most basic use of language to varying degrees), dolphins (strong inter species emotional intelligence, can solve complex tasks that lie between dog and primate level, closest non-primate to humans in intelligence), certain primates (can solve generally complex tasks well beyond all other non-humans, can solve some relatively complex tasks that outperform humans up to a certain age, strong inter species emotional intelligence, highest observed primate intelligence can arguably correspond somewhere around -2 to -1 std human in some ways.)\n\nMy point is that this is where our scale falls flat. We can only compare each person in the very limited scope of what we can observe. This might mean knowing someone who can solve math problems a little faster or someone who picks up on math problems a little faster (in your personal life). The difference doesn't seem that big and objectively it isn't that big. Now on a relative scale the difference is big because of how increased intelligence leads to compounding effects over time and the ability to learn things that other people may never be able to understand, but the scale is only relatively significant. The reality is that people at the top end can hold around 2-3x the working memory and process information at most a few times faster than lower (but not mentally handicapped) std people. This also includes a general ability to perceive, understand and pick up on more complex information. If anything had intelligence that was higher by the same magnitude as we are to primates, it wouldn't personally care that much because it wouldn't notice much of a difference between people in general because the gap is so large. The reality is that computation can hold many orders of magnitude higher levels of cognitive ability than the human brain can. Unfathomable to us. However, this isn't what I am interested in for this post.\n\nOne thing that the UFO phenomenon keeps reminding me of is biological constraints and possibility. The reality is that Earth is just one experiment of evolution with only ONE organism that has reached a fatally dominant level of intelligence. This opens a can of worms that requires me to slow down a little. First of all, we could have had a more intelligent proto-human become dominant. Remember that many mutations create new branches of biological reality while also closing other branches. One mutation that acutely lead to Homosapien intelligence could have fatally reduced the maximum intelligence that we could have ever evolved to while Neanderthals (or other proto-human populations) could have had a much higher potential. This is completely theoretical, but its to make the possibility clear. Humans also speculatively had a huge bottleneck event 70,000 years ago that dropped the population down to 2,000-10,000 which highly restricts the mutations that had developed over 10s of thousands of years that could have lead to much higher spontaneous intelligence (the right combinations of the many unique mutations.) The reality is even with this huge bottleneck event occurring, we still have a wide mix of intelligence profiles in the 21st century, but it also requires billions of people to find some of our outliers.\n\nSo we've realized that Earth has had many experiments when it comes to the totality of evolved life and variety, but an extremely limited profile of outlier intelligence. Humans took a very short time to develop even in terms of how long Earth has had to run evolution. Now the next big problem besides how bottlenecked and possibly limited we are maximally from intelligence is the environment that humans were selected from. The three main features that I find when pondering why we became so dominant are: high enough base general intelligence, high enough emotional intelligence, right anatomical design to take advantage of both. These are the three key ingredients and honestly, the challenge wasn't that high. The evolutionary path required that we learn how to solve tasks a step higher than animals, have a decent memory, communicate fluently with each other and be able to hold and manipulate tools. I'm basically saying that how intelligent we evolved always came down to the environment that challenged us which is basic natural selection. I don't think that the selection was that high on this planet. We didn't have to spend millions of years evolving intelligence high enough to compete with other proto-humans in a quasi red queen scenario because we won out in a short period of time. We've hit the sufficient level of intelligence to become dominant and no longer is that a real pressure.\n\nSo now we are stuck at a certain biological intelligence cap. Intelligence = the pace of innovation. I think that a lot of us realize this already, but it has a clear and direct correlation. We can still make amazing progress, but the more problems you solve, the harder the new ones.\n\nHere is the final piece of the puzzle. Earth is one evolutionary experiment that was honestly pretty inefficient at producing highly intelligent organisms. Humans might have been a lucky accident for all we know. There's no way of knowing if anything even close to us has existed on this planet before, but it seems unlikely simply because of the current environment (with us being uncontested.) It's clear that there is no abundance of human like organisms on Earth. Now what happens when you run this experiment billions of times with different starting settings and mechanisms of genetic code? Well the obvious answer is that you could have other human like intelligences, but that answer is boring. You could have some planets that hit the jackpot early and are filled with loads of intelligent, human like life and if that already becomes standard, then by nature there will be outliers that outstrip all of the rest by a wide margin. When you have billions of planet experiments to run, you end up creating the outliers of outliers and having some organisms that are much more efficient. That's why we can have two different people with the same sized brain, but one being much more intelligent than the other. Well the same thing is going to happen in accord with millions of different highly intelligent species with millions of different mutations and starting points that branch differently. Not to mention that some planets could have unbelievably high selection standards in environments like this that Red Queen fully intelligent populations until one becomes dominant enough to win.\n\nSo at the end of the day, I'm not so much interested in intelligent life off this planet. What I am interested in is looking at the various routings of intelligence and evolution and the assumptions that you can make from them about the current limits of our biological intelligence. I am most excited with the idea of being able to recreate ourselves into extremely intelligent, customized biological beings. Now this might not take precedent over just entering the simulation, but it basically means we could upgrade our biology significantly as a means to have a natural intelligence boost as well. I guess it's that I like there being more than one route to upgrade ourselves.", "link": "https://www.reddit.com/r/singularity/comments/izk7fu/why_biological_intelligence_has_a_much_higher/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "why biological intelligence has a much higher ceiling /!/  so i think that this forum in general, while small, has the right combination of people in it to be interested and understand this idea. this is going to be a long read, but i promise that it isn't filled with fluff but more the line of thinking that gets me excited about the long term future. i see so much talk of ufos flying around social media and have read into it some myself. it isn't so much if ufos are real or not, but it always gets me thinking about extraterrestrial intelligence.\n\ni think that as human beings we are extremely constrained in our ability to understand what having varying levels of intelligence means. our scales are very limited because it more or less goes something like: bacteria (completely perceptually 'to us' chemically driven), ants (ability to perform complex routed tasks even with a small nervous system, however limited ability to diverge from this preset ability via problem solving), mouse (small animal with a small nervous system that can accomplish simple problem solving tasks), dog (varying levels of intelligence per breed, but can solve much more complex tasks than a mouse, have some emotional intelligence of humans, can react to the most basic use of language to varying degrees), dolphins (strong inter species emotional intelligence, can solve complex tasks that lie between dog and primate level, closest non-primate to humans in intelligence), certain primates (can solve generally complex tasks well beyond all other non-humans, can solve some relatively complex tasks that outperform humans up to a certain age, strong inter species emotional intelligence, highest observed primate intelligence can arguably correspond somewhere around -2 to -1 std human in some ways.)\n\nmy point is that this is where our scale falls flat. we can only compare each person in the very limited scope of what we can observe. this might mean knowing someone who can solve math problems a little faster or someone who picks up on math problems a little faster (in your personal life). the difference doesn't seem that big and objectively it isn't that big. now on a relative scale the difference is big because of how increased intelligence leads to compounding effects over time and the ability to learn things that other people may never be able to understand, but the scale is only relatively significant. the reality is that people at the top end can hold around 2-3x the working memory and process information at most a few times faster than lower (but not mentally handicapped) std people. this also includes a general ability to perceive, understand and pick up on more complex information. if anything had intelligence that was higher by the same magnitude as we are to primates, it wouldn't personally care that much because it wouldn't notice much of a difference between people in general because the gap is so large. the reality is that computation can hold many orders of magnitude higher levels of cognitive ability than the human brain can. unfathomable to us. however, this isn't what i am interested in for this post.\n\none thing that the ufo phenomenon keeps reminding me of is biological constraints and possibility. the reality is that earth is just one experiment of evolution with only one organism that has reached a fatally dominant level of intelligence. this opens a can of worms that requires me to slow down a little. first of all, we could have had a more intelligent proto-human become dominant. remember that many mutations create new -----> branches !!!  of biological reality while also closing other -----> branches !!! . one mutation that acutely lead to homosapien intelligence could have fatally reduced the maximum intelligence that we could have ever evolved to while neanderthals (or other proto-human populations) could have had a much higher potential. this is completely theoretical, but its to make the possibility clear. humans also speculatively had a huge bottleneck event 70,000 years ago that dropped the population down to 2,000-10,000 which highly restricts the mutations that had developed over 10s of thousands of years that could have lead to much higher spontaneous intelligence (the right combinations of the many unique mutations.) the reality is even with this huge bottleneck event occurring, we still have a wide mix of intelligence profiles in the 21st century, but it also requires billions of people to find some of our outliers.\n\nso we've realized that earth has had many experiments when it comes to the totality of evolved life and variety, but an extremely limited profile of outlier intelligence. humans took a very short time to develop even in terms of how long earth has had to run evolution. now the next big problem besides how bottlenecked and possibly limited we are maximally from intelligence is the environment that humans were selected from. the three main features that i find when pondering why we became so dominant are: high enough base general intelligence, high enough emotional intelligence, right anatomical design to take advantage of both. these are the three key ingredients and honestly, the challenge wasn't that high. the evolutionary path required that we learn how to solve tasks a step higher than animals, have a decent memory, communicate fluently with each other and be able to hold and manipulate tools. i'm basically saying that how intelligent we evolved always came down to the environment that challenged us which is basic natural selection. i don't think that the selection was that high on this planet. we didn't have to spend millions of years evolving intelligence high enough to compete with other proto-humans in a quasi red queen scenario because we won out in a short period of time. we've hit the sufficient level of intelligence to become dominant and no longer is that a real pressure.\n\nso now we are stuck at a certain biological intelligence cap. intelligence = the pace of innovation. i think that a lot of us realize this already, but it has a clear and direct correlation. we can still make amazing progress, but the more problems you solve, the harder the new ones.\n\nhere is the final piece of the puzzle. earth is one evolutionary experiment that was honestly pretty inefficient at producing highly intelligent organisms. humans might have been a lucky accident for all we know. there's no way of knowing if anything even close to us has existed on this planet before, but it seems unlikely simply because of the current environment (with us being uncontested.) it's clear that there is no abundance of human like organisms on earth. now what happens when you run this experiment billions of times with different starting settings and mechanisms of genetic code? well the obvious answer is that you could have other human like intelligences, but that answer is boring. you could have some planets that hit the jackpot early and are filled with loads of intelligent, human like life and if that already becomes standard, then by nature there will be outliers that outstrip all of the rest by a wide margin. when you have billions of planet experiments to run, you end up creating the outliers of outliers and having some organisms that are much more efficient. that's why we can have two different people with the same sized brain, but one being much more intelligent than the other. well the same thing is going to happen in accord with millions of different highly intelligent species with millions of different mutations and starting points that branch differently. not to mention that some planets could have unbelievably high selection standards in environments like this that red queen fully intelligent populations until one becomes dominant enough to win.\n\nso at the end of the day, i'm not so much interested in intelligent life off this planet. what i am interested in is looking at the various routings of intelligence and evolution and the assumptions that you can make from them about the current limits of our biological intelligence. i am most excited with the idea of being able to recreate ourselves into extremely intelligent, customized biological beings. now this might not take precedent over just entering the simulation, but it basically means we could upgrade our biology significantly as a means to have a natural intelligence boost as well. i guess it's that i like there being more than one route to upgrade ourselves.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 27, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/izk7fu/why_biological_intelligence_has_a_much_higher/',)", "identifyer": 5758199, "year": "2020"}, {"autor": "a4mula", "date": 1581564779000, "content": "Concerns from a long time believer. /!/ As a senior in high school back in 1995, I read a book written by Bill Gates.  \"The Road Ahead\" was Gates' thoughts on what the relatively near future would look like.   It hooked me immediately. \n\nFrom there I found Kurzweil, and couldn't get enough.  \n\nLike most in this sub, I'm a techno-optimist. I understand that with any new technology comes the risks of abuse.  However, I still feel that the gains of technology vastly outweigh those risks.\n\nJust look at our quality of life increases from even 100 years ago.  Every single one of them has been a byproduct of technology.\n\nI believe we are incentivized and innovative enough to find our way through the pitfalls that technological advances bring.  After all, we've been doing it since fire.\n\nI believe we're on the precipice of witnessing the greatest evolution this planet has ever seen.  Going from biological to digital.  There have been plenty of evolutionary revolutions.  You can trace them all the way back to the first sparks of life and the unicell.  One of the great insights of Kurzweil was that exponential growth can be found outside of just Moore's law.\n\nI also see things that even many experts miss or fail to realize.  It's not just any given field that is advancing. It's *all* fields.  This is so different than anything mankind has ever witnessed before.  \n\nFrom computing, to networking, to material sciences, from energy sciences to robotics and everything in between including biologics;  The amazing thing is how all of the vastly different branches of science and technology are working in unison.  They've become cohesive to one another.  Each advancement any of them make, is advancement for all.  For people to still feel like we're 30-50 years away, it's this point they miss.  You only have to look to the double exponential growth of quantum computers to understand that we're much closer than many think.\n\nStill;  I hold true to my optimism.  \n\nI must say however, it's starting to waver.  Here is what I fear the most.  It's not the technology, it's not our ability to harness it.  It's that once those two things are mastered;  Where does it leave the pyramid builders?  Let's be frank;  Those with power have no desire to share it.  The average person on this planet is as close to expendable as it gets.  I know I am.  It's not a fear of price or cost, because I get over time it would become ubiquitous; \n\nI just don't see the first people to become *gods* deciding they want to share that power with anyone else.\n\nHere's my prediction, and I hope it doesn't come to pass.  We will witness the Neuralink get through its clinical trials.  We will see it used on very selective people during the initial phase.  We will harvest whatever is needed to build a bulletproof neural net of human \"cognizance\" or whatever you want to label it.  Then we'll see it get yanked.  Either it'll be too *unsafe* or it will be commercial unviable, or whatever else they want to tell us.  \n\nI fear it's not for us.", "link": "https://www.reddit.com/r/singularity/comments/f33nhx/concerns_from_a_long_time_believer/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "concerns from a long time believer. /!/ as a senior in high school back in 1995, i read a book written by bill gates.  \"the road ahead\" was gates' thoughts on what the relatively near future would look like.   it hooked me immediately. \n\nfrom there i found kurzweil, and couldn't get enough.  \n\nlike most in this sub, i'm a techno-optimist. i understand that with any new technology comes the risks of abuse.  however, i still feel that the gains of technology vastly outweigh those risks.\n\njust look at our quality of life increases from even 100 years ago.  every single one of them has been a byproduct of technology.\n\ni believe we are incentivized and innovative enough to find our way through the pitfalls that technological advances bring.  after all, we've been doing it since fire.\n\ni believe we're on the precipice of witnessing the greatest evolution this planet has ever seen.  going from biological to digital.  there have been plenty of evolutionary revolutions.  you can trace them all the way back to the first sparks of life and the unicell.  one of the great insights of kurzweil was that exponential growth can be found outside of just moore's law.\n\ni also see things that even many experts miss or fail to realize.  it's not just any given field that is advancing. it's *all* fields.  this is so different than anything mankind has ever witnessed before.  \n\nfrom computing, to networking, to material sciences, from energy sciences to robotics and everything in between including biologics;  the amazing thing is how all of the vastly different -----> branches !!!  of science and technology are working in unison.  they've become cohesive to one another.  each advancement any of them make, is advancement for all.  for people to still feel like we're 30-50 years away, it's this point they miss.  you only have to look to the double exponential growth of quantum computers to understand that we're much closer than many think.\n\nstill;  i hold true to my optimism.  \n\ni must say however, it's starting to waver.  here is what i fear the most.  it's not the technology, it's not our ability to harness it.  it's that once those two things are mastered;  where does it leave the pyramid builders?  let's be frank;  those with power have no desire to share it.  the average person on this planet is as close to expendable as it gets.  i know i am.  it's not a fear of price or cost, because i get over time it would become ubiquitous; \n\ni just don't see the first people to become *gods* deciding they want to share that power with anyone else.\n\nhere's my prediction, and i hope it doesn't come to pass.  we will witness the neuralink get through its clinical trials.  we will see it used on very selective people during the initial phase.  we will harvest whatever is needed to build a bulletproof neural net of human \"cognizance\" or whatever you want to label it.  then we'll see it get yanked.  either it'll be too *unsafe* or it will be commercial unviable, or whatever else they want to tell us.  \n\ni fear it's not for us.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 57, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/f33nhx/concerns_from_a_long_time_believer/',)", "identifyer": 5758284, "year": "2020"}, {"autor": "DEATH_STAR_EXTRACTOR", "date": 1590663487000, "content": "The future Earth will be a fractal. /!/ I've been researching how to build AGIs and how the future will roll out for nearly several years, and have recently discovered something pretty interesting.\n\nA big chunk of AI is about Prediction; accuracy in understanding what is related or accuracy in understanding what will occur next after some state/ conditions. AI tries to model a lot of data / the universe, to learn patterns. It helps it survive longer.\n\nMy discovering is that humans fr example have already made Earth into an organized pattern. Stores are built near stores, homes are lined up, etc. Arteries each branch themselves, which requires little DNA to store the structure and can reach the most space probalistacally (optimally/ approximately).\n\nMy prediction is that the future Earth will be a total fractal because knowing where, when, and what everything is is more efficient for resources and time. Everything will cooperate as well like a shared friend network. Like magnets, fields/domains cross and align to make the propagating neural waves faster and have least resistance when you go with the flow that already exists.\n\nI imagine Earth may become something kike a cubic fractal, when nanobot units are made of similar units each themselves, and so on.", "link": "https://www.reddit.com/r/singularity/comments/gs452l/the_future_earth_will_be_a_fractal/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "the future earth will be a fractal. /!/ i've been researching how to build agis and how the future will roll out for nearly several years, and have recently discovered something pretty interesting.\n\na big chunk of ai is about prediction; accuracy in understanding what is related or accuracy in understanding what will occur next after some state/ conditions. ai tries to model a lot of data / the universe, to learn patterns. it helps it survive longer.\n\nmy discovering is that humans fr example have already made earth into an organized pattern. stores are built near stores, homes are lined up, etc. arteries each -----> branch !!!  themselves, which requires little dna to store the structure and can reach the most space probalistacally (optimally/ approximately).\n\nmy prediction is that the future earth will be a total fractal because knowing where, when, and what everything is is more efficient for resources and time. everything will cooperate as well like a shared friend network. like magnets, fields/domains cross and align to make the propagating neural waves faster and have least resistance when you go with the flow that already exists.\n\ni imagine earth may become something kike a cubic fractal, when nanobot units are made of similar units each themselves, and so on.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 12, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/gs452l/the_future_earth_will_be_a_fractal/',)", "identifyer": 5759058, "year": "2020"}, {"autor": "i-Wayfarer", "date": 1607553736000, "content": "I made a Discord server for like-minded people interested in AI to meet and chat /!/ https://discord.gg/HcuksrUdah\n\n\nHi everyone,\n\nI made a Discord server for AI discussion. Currently it has 63 people, and so far there's been some conversations starting around topics such as autonomous cars and chatbots.\n\nThere are threads for AI-related ethics, consciousness, philosophy, science, technology, and robotics, so a little something for everyone.\n\n\nMy server is also a very relaxed environment, so there are threads also to share AI memes, pics of your food, gaming, pets, art, and even a mental health thread so you can get things off your mind by hearing like-minded people and their stories.\n\nIf the server takes off there is potential to branch out from AI specifically to more about the singularity.\n\nIf you are interested, whether simply to lurk and learn, or share your knowledge, please do join. We need you.\n\nHere are the server rules:\n\nWelcome to the AI Embrace discord server! Just a few rules to keep the peace:\n\n#1. Don't post gore or anything that may be considered NSFL.\n#2. Try to use channels for what they're for, memes go in #memes, etc.\n#3. Respect each other, friendly trolling is fine but know the limit.\n#4. Don't ask for roles... they will be assigned as seen fit or based on duration in the server.\n#5. Leading on from #3, no racism, no homophobic behaviour, etc etc.\n#6. Don't post other's personal information.\n#7. Don't spam, posting a message more than 2-3 times is considered spam.\n#8. Obligatory - be an AI lover", "link": "https://www.reddit.com/r/singularity/comments/ka2i8h/i_made_a_discord_server_for_likeminded_people/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "i made a discord server for like-minded people interested in ai to meet and chat /!/ https://discord.gg/hcuksrudah\n\n\nhi everyone,\n\ni made a discord server for ai discussion. currently it has 63 people, and so far there's been some conversations starting around topics such as autonomous cars and chatbots.\n\nthere are threads for ai-related ethics, consciousness, philosophy, science, technology, and robotics, so a little something for everyone.\n\n\nmy server is also a very relaxed environment, so there are threads also to share ai memes, pics of your food, gaming, pets, art, and even a mental health thread so you can get things off your mind by hearing like-minded people and their stories.\n\nif the server takes off there is potential to -----> branch !!!  out from ai specifically to more about the singularity.\n\nif you are interested, whether simply to lurk and learn, or share your knowledge, please do join. we need you.\n\nhere are the server rules:\n\nwelcome to the ai embrace discord server! just a few rules to keep the peace:\n\n#1. don't post gore or anything that may be considered nsfl.\n#2. try to use channels for what they're for, memes go in #memes, etc.\n#3. respect each other, friendly trolling is fine but know the limit.\n#4. don't ask for roles... they will be assigned as seen fit or based on duration in the server.\n#5. leading on from #3, no racism, no homophobic behaviour, etc etc.\n#6. don't post other's personal information.\n#7. don't spam, posting a message more than 2-3 times is considered spam.\n#8. obligatory - be an ai lover", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/ka2i8h/i_made_a_discord_server_for_likeminded_people/',)", "identifyer": 5759202, "year": "2020"}, {"autor": "AsuhoChinami", "date": 1594875724000, "content": "Mental health treatment throughout the 2020s /!/ As someone who's suffered from depression since I was 12 years old (obviously a long time ago), one of my main interests in futurism is the future treatment of mental health. Everything comes down to mental health in the end; all branches of futurism come down to improved happiness and convenience.  \n\nAs the 20s go along, how much more treatable will mental illnesses like depression, PTSD, and personality disorders become? Could there be OTC treatments for emotional pain, where if your girlfriend leaves you or a family member dies, you can simply take some medicine and be perfectly fine, no grieving necessary (so long as you keep taking the medicine)?", "link": "https://www.reddit.com/r/singularity/comments/hs3lps/mental_health_treatment_throughout_the_2020s/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "mental health treatment throughout the 2020s /!/ as someone who's suffered from depression since i was 12 years old (obviously a long time ago), one of my main interests in futurism is the future treatment of mental health. everything comes down to mental health in the end; all -----> branches !!!  of futurism come down to improved happiness and convenience.  \n\nas the 20s go along, how much more treatable will mental illnesses like depression, ptsd, and personality disorders become? could there be otc treatments for emotional pain, where if your girlfriend leaves you or a family member dies, you can simply take some medicine and be perfectly fine, no grieving necessary (so long as you keep taking the medicine)?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 31, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/hs3lps/mental_health_treatment_throughout_the_2020s/',)", "identifyer": 5759343, "year": "2020"}], "name": "branchsingularity2020"}