{"interestingcomments": [{"autor": "kulmthestatusquo", "date": 1538347722000, "content": "Neocon, The unchanging future and Singularity /!/ What we can call the neocon has run every aspect of American political, military and economic sectors.\n\n&amp;#x200B;\n\nIn fact, it is hard wired to our Civilization, which is not going to change. \n\n&amp;#x200B;\n\nThe Congress of Vienna set the world order for the next 99 years, except for a couple minor hiccups caused by Bismarck. It is safe to say that without Singularity the world order will be set for the next 999 years.  \n \n\nThe Neocons are no longer what George W. Bush had . They also evolved, and got to include lots of people, such as &gt; ‘rationalist right’, which includes Ben Shapiro, Kevin Williamson, and possibly even Jordan Peterson. The rationalist-right are very individualistic, pro-market, oppose identity policies, are anti-populist, and could be considered elitist. \n\n \n\n Such ideas , individualistic, pro-market, anti-populist and elitist doctrines, lead human civilization to Singularity.\n\n&amp;#x200B;\n\nExtreme wealth concentration and the misery for the many is needed for Singularity as well, as it is necessary for the wealth to be concentrated at the very top to easily finance trillion-dollar projects.\n\n  \n \n\nThe very fact that USA can fuck around with any country and get away with it, and can issue an unlimited amount of credit which foreign countries will have to swallow whether they like it or not, frees up a lot of funds and energy for research and technical advances, which creates positive feedbacks and creates a faster, more ruthless advance which leaves no room for those who can't follow. Sorry, Singularity only provides hope for those who are ready to transcend; It simply has no room for those who are not exactly prepared for the post singularity.\n\n   \n And, it is certain USA will reach singularity first, no other would being even closer.\n\n&amp;#x200B;\n\n Future space empire, Civilization 2.0, Transhumanism and posthumanism, etc will be made in the image of today's neocons/deep state/TPTB. Period.  Although a lot of people don't like today's neocon/Deep State system, there is simply zero alternative, and everything is set up to work around it, so it will go on forever. It is needed to invest huge amounts of money for research.\n\n Xtianity was made in the image of Judaism with some Hellenism thrown in. Buddhism was made in the image of Hinduism with some personal tidbits from Siddhartha. Singularity , Civilization 2.0 and whatever might come next wil be made in the image of today's neocons' winner-take-all, take-no-prisoners philosophy.\n\n So, no democracy. No socialism. Much like an eternal theocracy. Whether you like or not, it is not relevant - the future is sawn up. 1984. After all, Yevgeny Zyamatin whose \"We\" is the father of both 1984 and Brave New World, set his story on space conquest by a totalitarian regime.", "link": "https://www.reddit.com/r/singularity/comments/9kat6e/neocon_the_unchanging_future_and_singularity/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "bush", "selectorShort": "bush", "MarkedSent": "neocon, the unchanging future and singularity /!/ what we can call the neocon has run every aspect of american political, military and economic sectors.\n\n&amp;#x200b;\n\nin fact, it is hard wired to our civilization, which is not going to change. \n\n&amp;#x200b;\n\nthe congress of vienna set the world order for the next 99 years, except for a couple minor hiccups caused by bismarck. it is safe to say that without singularity the world order will be set for the next 999 years.  \n \n\nthe neocons are no longer what george w. -----> bush !!!  had . they also evolved, and got to include lots of people, such as &gt; ‘rationalist right’, which includes ben shapiro, kevin williamson, and possibly even jordan peterson. the rationalist-right are very individualistic, pro-market, oppose identity policies, are anti-populist, and could be considered elitist. \n\n \n\n such ideas , individualistic, pro-market, anti-populist and elitist doctrines, lead human civilization to singularity.\n\n&amp;#x200b;\n\nextreme wealth concentration and the misery for the many is needed for singularity as well, as it is necessary for the wealth to be concentrated at the very top to easily finance trillion-dollar projects.\n\n  \n \n\nthe very fact that usa can fuck around with any country and get away with it, and can issue an unlimited amount of credit which foreign countries will have to swallow whether they like it or not, frees up a lot of funds and energy for research and technical advances, which creates positive feedbacks and creates a faster, more ruthless advance which leaves no room for those who can't follow. sorry, singularity only provides hope for those who are ready to transcend; it simply has no room for those who are not exactly prepared for the post singularity.\n\n   \n and, it is certain usa will reach singularity first, no other would being even closer.\n\n&amp;#x200b;\n\n future space empire, civilization 2.0, transhumanism and posthumanism, etc will be made in the image of today's neocons/deep state/tptb. period.  although a lot of people don't like today's neocon/deep state system, there is simply zero alternative, and everything is set up to work around it, so it will go on forever. it is needed to invest huge amounts of money for research.\n\n xtianity was made in the image of judaism with some hellenism thrown in. buddhism was made in the image of hinduism with some personal tidbits from siddhartha. singularity , civilization 2.0 and whatever might come next wil be made in the image of today's neocons' winner-take-all, take-no-prisoners philosophy.\n\n so, no democracy. no socialism. much like an eternal theocracy. whether you like or not, it is not relevant - the future is sawn up. 1984. after all, yevgeny zyamatin whose \"we\" is the father of both 1984 and brave new world, set his story on space conquest by a totalitarian regime.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9kat6e/neocon_the_unchanging_future_and_singularity/',)", "identifyer": 5756106, "year": "2018"}], "name": "bushsingularity2018"}