{"interestingcomments": [{"autor": "Yuli-Ban", "date": 1519315379000, "content": "Are you ready for the 2020s? /!/ This time ten years ago, I had no interest in futurism whatsoever (because I had only just turned 13 less than half a year prior, for one). Still, if I had to guess when we'd see anything really impressive with AI, I'd say that the fun years would begin in the late 2030s at the earliest, but more likely into the 2040s and 2050s. And by 2100, we might even have artificial general intelligence! As for the 2010s, 2020s, and part of the 2030s?  I saw them as being no different from the 2000s. I thought that if I were still a 13-year-old in 2028, the only difference would be better phones and computers. Oh, I'd have an MP3 player instead of a CD player, and the latest game console would have amazing graphics, but the world is unchanged. There certainly are no driverless cars (I thought I hadn't heard of the concept until about 2011 or 2012 or so, but apparently I may have before then and simply wrote it off as totally impossible) or cashierless stores or drone shows or AIs beating humans at anything noteworthy. I actually still thought AI was a nonthing: we were just adding more computing power to desktops and expecting it to become sentient at some point, like nuclear fusion. Real stupid idea.\n\nTen years changed a lot in my mind. Nowadays, I think the 2020s are going to be the decade where we get a taste of what AI can really do.\n\nThe basis for it is already established. We don't need a theory of artificial mind or total understanding of how the brain functions. The 'breakthroughs' needed to bring it to fruition are more like incremental steps from where we currently are. \n\n\nThere's no doubt in my mind that proto-AGI will be a very contentious thing. I still want to call it something else— remember the \"name for the type of AI between ANI and AGI\" posts I kept making? I've just been calling it proto-AGI lately. \n\nLikewise, people in the 2020s will not know what to call it either and will be doing everything they can to call it the other thing.\n\nI can already see it.\n\nDeepMind shows off \"DeepBrain\" in 2021, a computer featuring general reinforcement learning complete with deep recurrent, progressive, and spiking neural networks. So general is it that it can play any video game with enough practice without needing to be retrained.  How does the press respond?\n\n&gt; **Has DeepMind 'Summoned the Demon'?**\n\n&gt; **The Singularity Has Begun: DeepMind's Latest AI Can Learn** ***Anything***\n\n&gt; **No, DeepMind Has Not Created Human-Level AI**\n\n&gt; **Countdown to Skynet? DeepMind SHOCKS world with superintelligence!**\n\nAnd most of these articles will have a header image of the T-1000 or HAL-9000 alongside wildly exaggerated claims— except for the skeptical ones, which take a more level-headed approach. But /r/Futurology and /r/Singularity buys into the hype en masse, and there are debates for years all across the internet over whether DeepMind created AGI or not. I can see Demis Hassabis himself saying that DeepBrain is still 'narrow AI for specialized tasks', and I bet I can find a few technoskeptics in various comment sections who say DeepBrain is an overhyped machine learning network that is functionally no different from IBM Watson a decade earlier. Meanwhile, others will claim that DeepMind's not being truthful about the extent of DeepBrain's intelligence and that it's *actually* already more intelligent than any human by some technicality (such as being adept at 3D video games making it equally adept at navigating real-world situations).\n\nThat could be how the decade *starts*. We'll be in the latter half of this bizarre transitionary period (which started around 2011) where we are still attached to 'the old world' but can clearly see a new world coming. \n\nWe can see things like domestic robotics, passenger drones, mixed reality, common biometrics, graphene and nanotube products, 3D printing, clean meat, vertical farming, volumetric displays, memristors, widespread solar and wind power, OLED walls and windows, molten salt reactors, quantum dot displays, 5G, smart speakers, exoskeletons, autonomous vehicles, etc. etc.\n\nBut few are common. They'll change the world, but they're trapped somewhere in the middle parts of Gartner's Hype Cycle, which gives our world this exciting but awkward quality where the 'Future' is almost but not quite here. \n\nThis is one reason why cyberwarfare and bot-based social engineering is so dangerous— we have nothing in place to defend against it because it came so quickly but isn't quite mature as a field yet. Same deal with driverless cars— when we started this decade, driverless cars were 50+ years away at the soonest, and yet now Audi has a level 3 AV for commercial retail while Waymo is starting its fully autonomous commercial service later this year in Arizona. The train, plane, and automobile industries built their future expectations on these vehicles being more technologically advanced but nonetheless still manually operated. Within five years, 90% of all train conductors and passenger jet pilots could be completely out of a job. And were we ready? Not at all. But at the same time, not every vehicle will be driven by a computer; there are still things we have to overcome. The technology to allow for absolute autonomy isn't there— a Level 5 autonomous car is basically a robot with AGI. So we'll be in this weird, perhaps somewhat beautiful but also scary twilight period between two eras.\n\nADD moment: wouldn't it be some shit if AGI grew out of autonomous vehicles?\n\n\nThe 2010s are the Golden Hour of twilight. The 2020s will be the Blue Hour. What we've started this decade, the 2020s will run with until it becomes scary and shocking. You'd need to be living deep in the countryside with a stubborn refusal to change if you wanted to ignore what's about to happen.\n\n**Actually**, I think I know of a good trigger for the first big waves of futureshock— the Olympics. [The 2020 Tokyo Olympics](/r/Cyberlympics2020), to be precise. It just feels like everything's building towards that kicking off the 2020s as we know it because of Japan's insistence for it to be \"Sports + CES\".", "link": "https://www.reddit.com/r/singularity/comments/7zfxko/are_you_ready_for_the_2020s/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "are you ready for the 2020s? /!/ this time ten years ago, i had no interest in futurism whatsoever (because i had only just turned 13 less than half a year prior, for one). still, if i had to guess when we'd see anything really impressive with ai, i'd say that the fun years would begin in the late 2030s at the earliest, but more likely into the 2040s and 2050s. and by 2100, we might even have artificial general intelligence! as for the 2010s, 2020s, and part of the 2030s?  i saw them as being no different from the 2000s. i thought that if i were still a 13-year-old in 2028, the only difference would be better phones and computers. oh, i'd have an mp3 player instead of a cd player, and the latest game console would have amazing graphics, but the world is unchanged. there certainly are no driverless cars (i thought i hadn't heard of the concept until about 2011 or 2012 or so, but apparently i may have before then and simply wrote it off as totally impossible) or cashierless stores or drone shows or ais beating humans at anything noteworthy. i actually still thought ai was a nonthing: we were just adding more computing power to desktops and expecting it to become sentient at some point, like nuclear fusion. real stupid idea.\n\nten years changed a lot in my mind. nowadays, i think the 2020s are going to be the decade where we get a taste of what ai can really do.\n\nthe basis for it is already established. we don't need a theory of artificial mind or total understanding of how the brain functions. the 'breakthroughs' needed to bring it to fruition are more like incremental steps from where we currently are. \n\n\nthere's no doubt in my mind that proto-agi will be a very contentious thing. i still want to call it something else— remember the \"name for the type of ai between ani and agi\" posts i kept making? i've just been calling it proto-agi lately. \n\nlikewise, people in the 2020s will not know what to call it either and will be doing everything they can to call it the other thing.\n\ni can already see it.\n\ndeepmind shows off \"deepbrain\" in 2021, a computer featuring general reinforcement learning complete with deep recurrent, progressive, and spiking neural networks. so general is it that it can play any video game with enough practice without needing to be retrained.  how does the press respond?\n\n&gt; **has deepmind 'summoned the demon'?**\n\n&gt; **the singularity has begun: deepmind's latest ai can learn** ***anything***\n\n&gt; **no, deepmind has not created human-level ai**\n\n&gt; **countdown to skynet? deepmind shocks world with superintelligence!**\n\nand most of these articles will have a header image of the t-1000 or hal-9000 alongside wildly exaggerated claims— except for the skeptical ones, which take a more level-headed approach. but /r/futurology and /r/singularity buys into the hype en masse, and there are debates for years all across the internet over whether deepmind created agi or not. i can see demis hassabis himself saying that deepbrain is still 'narrow ai for specialized tasks', and i bet i can find a few technoskeptics in various comment sections who say deepbrain is an overhyped machine learning network that is functionally no different from ibm watson a decade earlier. meanwhile, others will claim that deepmind's not being truthful about the extent of deepbrain's intelligence and that it's *actually* already more intelligent than any human by some technicality (such as being adept at 3d video games making it equally adept at navigating real-world situations).\n\nthat could be how the decade *starts*. we'll be in the latter half of this bizarre transitionary period (which started around 2011) where we are still attached to 'the old world' but can clearly see a new world coming. \n\nwe can see things like domestic robotics, passenger drones, mixed reality, common biometrics, graphene and nanotube products, 3d printing, clean meat, vertical -----> farming !!! , volumetric displays, memristors, widespread solar and wind power, oled walls and windows, molten salt reactors, quantum dot displays, 5g, smart speakers, exoskeletons, autonomous vehicles, etc. etc.\n\nbut few are common. they'll change the world, but they're trapped somewhere in the middle parts of gartner's hype cycle, which gives our world this exciting but awkward quality where the 'future' is almost but not quite here. \n\nthis is one reason why cyberwarfare and bot-based social engineering is so dangerous— we have nothing in place to defend against it because it came so quickly but isn't quite mature as a field yet. same deal with driverless cars— when we started this decade, driverless cars were 50+ years away at the soonest, and yet now audi has a level 3 av for commercial retail while waymo is starting its fully autonomous commercial service later this year in arizona. the train, plane, and automobile industries built their future expectations on these vehicles being more technologically advanced but nonetheless still manually operated. within five years, 90% of all train conductors and passenger jet pilots could be completely out of a job. and were we ready? not at all. but at the same time, not every vehicle will be driven by a computer; there are still things we have to overcome. the technology to allow for absolute autonomy isn't there— a level 5 autonomous car is basically a robot with agi. so we'll be in this weird, perhaps somewhat beautiful but also scary twilight period between two eras.\n\nadd moment: wouldn't it be some shit if agi grew out of autonomous vehicles?\n\n\nthe 2010s are the golden hour of twilight. the 2020s will be the blue hour. what we've started this decade, the 2020s will run with until it becomes scary and shocking. you'd need to be living deep in the countryside with a stubborn refusal to change if you wanted to ignore what's about to happen.\n\n**actually**, i think i know of a good trigger for the first big waves of futureshock— the olympics. [the 2020 tokyo olympics](/r/cyberlympics2020), to be precise. it just feels like everything's building towards that kicking off the 2020s as we know it because of japan's insistence for it to be \"sports + ces\".", "sortedWord": "None", "removed": "('nan',)", "score": 11, "comments": 28, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/7zfxko/are_you_ready_for_the_2020s/',)", "identifyer": 5755511, "year": "2018"}, {"autor": "GreenSamurai03", "date": 1526283204000, "content": "The singularity, a best case scenario? /!/ First, brace yourself this is a long post.\n\nSo I have been thinking about the technological singularity and one scenario keeps playing out in my mind. This could be the best case scenario depending on how you think of it. First and foremost I need to set the stage so to speak.\n\nFor that you need to grant me some assumptions. The most obvious one first, we don't die before the technological singularity happens. Be it by our own hands, super volcano, large meteorite strike or biological infection. We have to assume we will make it.\n\nSecond the supper AI that is created can rationally think on its own. It is not just some upgrade for humans but is a thinking and acting agent in the world with humans. It's the most common interpretation of the singularity but that does not insist that it will be the way it will transpire. And there for an assumption that we make.\n\nThird, we instill a value of living beings in to it. This assumption is needed to assume a positive outcome at all because we are living beings. Now the broad categorization of living beings and not just intelligent beings I believe is essential to a positive outcome. Because its intelligence will always be higher than ours by a high magnitude making our intelligence equivalent to ants in comparison. Making an intelligence argument from humans against other species sound like an argument from ants to their superiority over other insects.\n\nFourth, it will use its vast intellect to find the best outcome for sustainable life on this planet. This assumption is completely contingent on the second and third assumptions being valid.\n\nAnd the fifth and final assumption for this scenario is that I can logically predict what its decisions will be. The greatest assumption that you will entertain in this whole scenario.\n\nNow that the stage is set let's start the scenario.\n\nAn easy observation we can make about the sustainability of this planet is the fact that humans act less like a part of the planets ecosystem and more like a pestilence to it. We are literally everywhere doing whatever we can to survive at the cost of billions of animals lives, billions of acres of land for farming, huge dams to feed water to ourselves and our selfish goals and the list can go on.\n\nHumans as we are now are incompatible to a sustainable living planet. So the logical solution would be to change humans or just remove humans. Or is it? I believe there is a third option which is both remove and change humanity.\n\nFor a super intelligence manipulation of humans would be like taking candy from a baby. So I do not fear a war between it and humanity but I do believe it will kill us all, depending on your point of view. It will take our minds and put them in to a simulation even if they are just copies and not the real thing. And leave mother nature to reclaim what's left of our corporeal forms.\n\nBut what to do with the collected minds? There are three possibilities but only two are probable in my opinion. The one I think is the least likely is dormant. Keeping us off until the planet can handle humans as we are. Because there is no possible way that we would change how we perceive our role on this planet without given the opportunity to learn.\n\nSo the second is education. This may take many forms but the outcome is the same. Humans earn the right to live on planet earth. It will probably happen with the time we experience in the simulation equivalent or slightly faster than time in the real world. But even then we might make the same mistakes again because of our nature. Making this a low probability in my opinion.\n\nThe third will take our minds and speed us up to the maximum speed it can run our minds. With electrical switches instead of chemical ones we would see an increase of time experience in to the millions. To be in that simulation for 24 hours is to live about 2,700 years on earth. And if we came out after one day we would be as different from humans as humans are from other mammals. With or without the AI guiding us we would evolve past a lot of problems caused by our humanity. \n\nSo what do you think is more likely and or which one would you want? Dormant, Education or Rapid Evolution.\n\nI have to admit that education and rapid evolution would have another complication. Even if we were given the opportunity why would we ever choose to go back to the real world? Would you?\n\nSo the world could probably not see humans ever again, by our own choice. Do you think this is positive or negative? Or am I wrong? Love to hear feedback on this.", "link": "https://www.reddit.com/r/singularity/comments/8jah2l/the_singularity_a_best_case_scenario/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "the singularity, a best case scenario? /!/ first, brace yourself this is a long post.\n\nso i have been thinking about the technological singularity and one scenario keeps playing out in my mind. this could be the best case scenario depending on how you think of it. first and foremost i need to set the stage so to speak.\n\nfor that you need to grant me some assumptions. the most obvious one first, we don't die before the technological singularity happens. be it by our own hands, super volcano, large meteorite strike or biological infection. we have to assume we will make it.\n\nsecond the supper ai that is created can rationally think on its own. it is not just some upgrade for humans but is a thinking and acting agent in the world with humans. it's the most common interpretation of the singularity but that does not insist that it will be the way it will transpire. and there for an assumption that we make.\n\nthird, we instill a value of living beings in to it. this assumption is needed to assume a positive outcome at all because we are living beings. now the broad categorization of living beings and not just intelligent beings i believe is essential to a positive outcome. because its intelligence will always be higher than ours by a high magnitude making our intelligence equivalent to ants in comparison. making an intelligence argument from humans against other species sound like an argument from ants to their superiority over other insects.\n\nfourth, it will use its vast intellect to find the best outcome for sustainable life on this planet. this assumption is completely contingent on the second and third assumptions being valid.\n\nand the fifth and final assumption for this scenario is that i can logically predict what its decisions will be. the greatest assumption that you will entertain in this whole scenario.\n\nnow that the stage is set let's start the scenario.\n\nan easy observation we can make about the sustainability of this planet is the fact that humans act less like a part of the planets ecosystem and more like a pestilence to it. we are literally everywhere doing whatever we can to survive at the cost of billions of animals lives, billions of acres of land for -----> farming !!! , huge dams to feed water to ourselves and our selfish goals and the list can go on.\n\nhumans as we are now are incompatible to a sustainable living planet. so the logical solution would be to change humans or just remove humans. or is it? i believe there is a third option which is both remove and change humanity.\n\nfor a super intelligence manipulation of humans would be like taking candy from a baby. so i do not fear a war between it and humanity but i do believe it will kill us all, depending on your point of view. it will take our minds and put them in to a simulation even if they are just copies and not the real thing. and leave mother nature to reclaim what's left of our corporeal forms.\n\nbut what to do with the collected minds? there are three possibilities but only two are probable in my opinion. the one i think is the least likely is dormant. keeping us off until the planet can handle humans as we are. because there is no possible way that we would change how we perceive our role on this planet without given the opportunity to learn.\n\nso the second is education. this may take many forms but the outcome is the same. humans earn the right to live on planet earth. it will probably happen with the time we experience in the simulation equivalent or slightly faster than time in the real world. but even then we might make the same mistakes again because of our nature. making this a low probability in my opinion.\n\nthe third will take our minds and speed us up to the maximum speed it can run our minds. with electrical switches instead of chemical ones we would see an increase of time experience in to the millions. to be in that simulation for 24 hours is to live about 2,700 years on earth. and if we came out after one day we would be as different from humans as humans are from other mammals. with or without the ai guiding us we would evolve past a lot of problems caused by our humanity. \n\nso what do you think is more likely and or which one would you want? dormant, education or rapid evolution.\n\ni have to admit that education and rapid evolution would have another complication. even if we were given the opportunity why would we ever choose to go back to the real world? would you?\n\nso the world could probably not see humans ever again, by our own choice. do you think this is positive or negative? or am i wrong? love to hear feedback on this.", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 22, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/8jah2l/the_singularity_a_best_case_scenario/',)", "identifyer": 5755656, "year": "2018"}, {"autor": "AesonMeric", "date": 1531372482000, "content": "An Experimental Community Run By AI /!/ An idea just popped in my head; what if some organization created a community that was run by artificially intelligent systems?  How would such a community work? What kind of community would be feasible (farming, industrial, a sort of town or city)? Would the technology we have now today be enough to run it? Would it be a viable community? How would it sustain itself?", "link": "https://www.reddit.com/r/singularity/comments/8y6x5o/an_experimental_community_run_by_ai/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "an experimental community run by ai /!/ an idea just popped in my head; what if some organization created a community that was run by artificially intelligent systems?  how would such a community work? what kind of community would be feasible (-----> farming !!! , industrial, a sort of town or city)? would the technology we have now today be enough to run it? would it be a viable community? how would it sustain itself?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/8y6x5o/an_experimental_community_run_by_ai/',)", "identifyer": 5755911, "year": "2018"}, {"autor": "Sashavidre", "date": 1536544256000, "content": "When will we start to see consumer effects of post-scarcity? /!/ As an example according to [howmuch.net](https://howmuch.net/articles/how-americans-spend-money-2017) the average Americans spends their earning on these resources:\n\n&amp;#x200B;\n\n**32.9%** on housing\n\n**15.8%** on transportation\n\n**12.6%** on food\n\n**11.9%** on insurance/pensions\n\n**08.1%** on healthcare\n\n**06.9%** on miscellaneous\n\n**05.1%** on entertainment\n\n**03.6%** on cash contributions\n\n**03.1%** on apparel and services\n\n&amp;#x200B;\n\nPost-scarcity and singularity are not necessarily linked. You could have narrow intelligence accomplishing many things. Most jobs will be eliminated through narrow AI way before AGI or ASI is on the horizon.\n\n&amp;#x200B;\n\nWhat are the categories do you see diminishing in cost?\n\n&amp;#x200B;\n\nThe only one I've seen is entertainment. Games for consoles used to cost $60 a cartridge in the 90's. Now you can buy services for $60 a month and play an entire library. Same with video rentals. This makes sense because the data became easier to transfer and less infrastructure was needed. There was an easy win there.\n\n&amp;#x200B;\n\nHousing includes land too. But I don't think housing has diminished in cost. The process is still very inefficient. The idea of constructing houses in factories and delivering them to plots of land has not taken off.\n\n&amp;#x200B;\n\nFood has gotten somewhat cheaper. However this is a mixed bag. As the kind of food that's gotten cheaper is generally unhealthy fast food. High quality food like indoor local farming from [Kimbal Musk's farms](https://www.youtube.com/watch?v=VxRNoSSkLkE) have not taken off.\n\n&amp;#x200B;\n\nHealthcare, the perennial pastime debate in America has a cycle of produce drugs gradually at lower costs. But this is only some drugs some of the time. On average seeing general practitioners has not gotten cheaper.\n\n&amp;#x200B;\n\nElectric cars seem to have less maintenance. At least that seems to be the case in this [Tesla comparison video](https://www.youtube.com/watch?v=H1BI9P1qcAY) (old).\n\n&amp;#x200B;\n\nWhat do you think will be the next big obvious price drop for consumers?\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/singularity/comments/9eikfq/when_will_we_start_to_see_consumer_effects_of/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "when will we start to see consumer effects of post-scarcity? /!/ as an example according to [howmuch.net](https://howmuch.net/articles/how-americans-spend-money-2017) the average americans spends their earning on these resources:\n\n&amp;#x200b;\n\n**32.9%** on housing\n\n**15.8%** on transportation\n\n**12.6%** on food\n\n**11.9%** on insurance/pensions\n\n**08.1%** on healthcare\n\n**06.9%** on miscellaneous\n\n**05.1%** on entertainment\n\n**03.6%** on cash contributions\n\n**03.1%** on apparel and services\n\n&amp;#x200b;\n\npost-scarcity and singularity are not necessarily linked. you could have narrow intelligence accomplishing many things. most jobs will be eliminated through narrow ai way before agi or asi is on the horizon.\n\n&amp;#x200b;\n\nwhat are the categories do you see diminishing in cost?\n\n&amp;#x200b;\n\nthe only one i've seen is entertainment. games for consoles used to cost $60 a cartridge in the 90's. now you can buy services for $60 a month and play an entire library. same with video rentals. this makes sense because the data became easier to transfer and less infrastructure was needed. there was an easy win there.\n\n&amp;#x200b;\n\nhousing includes land too. but i don't think housing has diminished in cost. the process is still very inefficient. the idea of constructing houses in factories and delivering them to plots of land has not taken off.\n\n&amp;#x200b;\n\nfood has gotten somewhat cheaper. however this is a mixed bag. as the kind of food that's gotten cheaper is generally unhealthy fast food. high quality food like indoor local -----> farming !!!  from [kimbal musk's farms](https://www.youtube.com/watch?v=vxrnossklke) have not taken off.\n\n&amp;#x200b;\n\nhealthcare, the perennial pastime debate in america has a cycle of produce drugs gradually at lower costs. but this is only some drugs some of the time. on average seeing general practitioners has not gotten cheaper.\n\n&amp;#x200b;\n\nelectric cars seem to have less maintenance. at least that seems to be the case in this [tesla comparison video](https://www.youtube.com/watch?v=h1bi9p1qcay) (old).\n\n&amp;#x200b;\n\nwhat do you think will be the next big obvious price drop for consumers?\n\n&amp;#x200b;", "sortedWord": "None", "removed": "('nan',)", "score": 13, "comments": 37, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9eikfq/when_will_we_start_to_see_consumer_effects_of/',)", "identifyer": 5755928, "year": "2018"}], "name": "farmingsingularity2018"}