{"interestingcomments": [{"autor": "HeartofAthena", "date": 1536224563000, "content": "The movie Transcendence to happen in real life - yay or nay? /!/ Hi everyone!\n\nI have already posted this in another sub but unfortunately, I did not get any comments. I would really love to know your thoughts about it please.\n\n Anyway, I just got to watch the movie Transcendence starring Johnny Depp. Yeah, I'm that delayed lol!\n\nFor  those who have not watched it, it's about a scientist named Dr. Will  Caster played by Johnny Depp and who has been working on AIs. As usual,  there were oppositions about it that killed him. Long story short, he  got his wife, Evelyn Caster, also a Scientist, upload his mind into the  computer. It was a success and together they built their own highly  technological kind of world. He was in the process of making the world a  better place when the FBI and the anti technology group discovered it  and had the perception that he was out to destroy the world thru  technology when the truth is, he was just trying to repair the damage  that humans had done to the ecosystems. The other group was able to  convince his wife to inject the virus to her body which in the end  killed them both. Will Caster on his new organic body. 5 years later,  while the world continued to deteriorate, the sunflowers in the couple's  garden were the only living plants in the area. Apparently, Will has  left nano particles in that garden that kept those sunflowers alive.  That just proved that his pursuit to repair the world was true and valid  but it was already too late. He already got killed because of humans'  closed mindedness.\n\nThis has hit me quite  emotionally. Looking at how many people are closed minded with whatever  technology can bring, could we also be killing the possibility of  finding a way to repair the earth? What are your thoughts about it?\n\n&amp;#x200B;\n\nhttps://i.redd.it/a0w99qzm2lk11.jpg\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/singularity/comments/9dgl0x/the_movie_transcendence_to_happen_in_real_life/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "the movie transcendence to happen in real life - yay or nay? /!/ hi everyone!\n\ni have already posted this in another sub but unfortunately, i did not get any comments. i would really love to know your thoughts about it please.\n\n anyway, i just got to watch the movie transcendence starring johnny depp. yeah, i'm that delayed lol!\n\nfor  those who have not watched it, it's about a scientist named dr. will  caster played by johnny depp and who has been working on ais. as usual,  there were oppositions about it that killed him. long story short, he  got his wife, evelyn caster, also a scientist, upload his mind into the  computer. it was a success and together they built their own highly  technological kind of world. he was in the process of making the world a  better place when the fbi and the anti technology group discovered it  and had the perception that he was out to destroy the world thru  technology when the truth is, he was just trying to repair the damage  that humans had done to the ecosystems. the other group was able to  convince his wife to inject the virus to her body which in the end  killed them both. will caster on his new organic body. 5 years later,  while the world continued to deteriorate, the sunflowers in the couple's  -----> garden !!!  were the only living plants in the area. apparently, will has  left nano particles in that garden that kept those sunflowers alive.  that just proved that his pursuit to repair the world was true and valid  but it was already too late. he already got killed because of humans'  closed mindedness.\n\nthis has hit me quite  emotionally. looking at how many people are closed minded with whatever  technology can bring, could we also be killing the possibility of  finding a way to repair the earth? what are your thoughts about it?\n\n&amp;#x200b;\n\nhttps://i.redd.it/a0w99qzm2lk11.jpg\n\n&amp;#x200b;", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9dgl0x/the_movie_transcendence_to_happen_in_real_life/',)", "identifyer": 5755948, "year": "2018"}], "name": "gardensingularity2018"}