{"interestingcomments": [{"autor": "Danj_memes_", "date": 1577899547000, "content": "New Tomato Ideal for Urban Gardens and Even Outer Space Created Through Genetic Editing", "link": "https://www.reddit.com/r/singularity/comments/eikukm/new_tomato_ideal_for_urban_gardens_and_even_outer/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "gardens", "selectorShort": "garden", "MarkedSent": "new tomato ideal for urban -----> gardens !!!  and even outer space created through genetic editing", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://scitechdaily-com.cdn.ampproject.org/v/s/scitechdaily.com/new-tomato-ideal-for-urban-gardens-and-even-outer-space-created-through-genetic-editing/amp/?amp_js_v=a2&amp;amp_gsa=1&amp;usqp=mq331AQCKAE%3D#referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Fscitechdaily.com%2Fnew-tomato-ideal-for-urban-gardens-and-even-outer-space-created-through-genetic-editing%2F',)", "identifyer": 5759039, "year": "2020"}, {"autor": "rampitup55", "date": 1603667366000, "content": "List of technologies that shrink government /!/ Hi all. I'd like to have a master list of technologies that will end up shrinking government, in the end. If you look at our infrastructure and how/why we're taxed and where that money goes, you can see that once certain technologies come along, government will necessarily shrink. No redundant institution survives long term. So what we need here, is near total self sufficiency. \n\nHere's what I've come up with so far for things that will help ensure freedom and shrink government:\n\n1. Free energy. Or close to free. Very cheap solar will probably do it. So another halving of all solar costs. If it halves again after that, the energy sector is finished. Everyone will just be in charge of making their own electricity and it'll be easy and cheap. \n2. 3D printers that print most things, even food. (materials made separately though)\n3. A variant of the 3D printer, that is better termed a \"recycler\" or something that makes materials for 3D printers to use. Once you get a 3D printer that can make most household items you'd need including clothes, it's not much of a stretch to develop another type of \"printer\" that can separate materials. Once you can separate them on a tiny level (not microscopic, that's unnecessary for household use) then you can reuse them over and over again. You could throw trash into it and have new paper and plastic (even metal). These could be used in your actual 3D printer to make new things you need, in a near endless cycle. \n4. Robot/s that can grow and tend a garden as good as any human can. This way, you could have a robot at your house that would grow much of your food in your backyard, and perhaps even store it for you in a preservation process like canning. If it makes too much food, you turn it off until your stock starts running a bit low. \n5. Robot/s that cook and clean *well.* These are quality of life improvements that would free up more time for people to pursue what they really care about doing in life. This may indirectly lead to shrinking government, in many different ways. \n6. Electric cars. Looks like that's coming along nicely. No more paying the man for gas, charge your car off of your solar system. \n7. That leaves water, but a well and an advanced filtration system should solve that problem. You can easily afford these things when you don't pay for electricity, gas, clothes, food, etc. But even water purification will become cheap one day. \n8. A.I doctors. IBM's watson comes to mind, although I'm sure it will be something different from some other company. A superdoctor that is seldom (if ever) wrong and doesn't need to be paid. This extends to many other jobs as well, which will be taken over by A.i. If a machine does it, it gets cheaper. \n9. ??? What else? What am I missing that would eventually shrink government once it becomes ubiquitous?", "link": "https://www.reddit.com/r/singularity/comments/ji3c28/list_of_technologies_that_shrink_government/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "list of technologies that shrink government /!/ hi all. i'd like to have a master list of technologies that will end up shrinking government, in the end. if you look at our infrastructure and how/why we're taxed and where that money goes, you can see that once certain technologies come along, government will necessarily shrink. no redundant institution survives long term. so what we need here, is near total self sufficiency. \n\nhere's what i've come up with so far for things that will help ensure freedom and shrink government:\n\n1. free energy. or close to free. very cheap solar will probably do it. so another halving of all solar costs. if it halves again after that, the energy sector is finished. everyone will just be in charge of making their own electricity and it'll be easy and cheap. \n2. 3d printers that print most things, even food. (materials made separately though)\n3. a variant of the 3d printer, that is better termed a \"recycler\" or something that makes materials for 3d printers to use. once you get a 3d printer that can make most household items you'd need including clothes, it's not much of a stretch to develop another type of \"printer\" that can separate materials. once you can separate them on a tiny level (not microscopic, that's unnecessary for household use) then you can reuse them over and over again. you could throw trash into it and have new paper and plastic (even metal). these could be used in your actual 3d printer to make new things you need, in a near endless cycle. \n4. robot/s that can grow and tend a -----> garden !!!  as good as any human can. this way, you could have a robot at your house that would grow much of your food in your backyard, and perhaps even store it for you in a preservation process like canning. if it makes too much food, you turn it off until your stock starts running a bit low. \n5. robot/s that cook and clean *well.* these are quality of life improvements that would free up more time for people to pursue what they really care about doing in life. this may indirectly lead to shrinking government, in many different ways. \n6. electric cars. looks like that's coming along nicely. no more paying the man for gas, charge your car off of your solar system. \n7. that leaves water, but a well and an advanced filtration system should solve that problem. you can easily afford these things when you don't pay for electricity, gas, clothes, food, etc. but even water purification will become cheap one day. \n8. a.i doctors. ibm's watson comes to mind, although i'm sure it will be something different from some other company. a superdoctor that is seldom (if ever) wrong and doesn't need to be paid. this extends to many other jobs as well, which will be taken over by a.i. if a machine does it, it gets cheaper. \n9. ??? what else? what am i missing that would eventually shrink government once it becomes ubiquitous?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 62, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/ji3c28/list_of_technologies_that_shrink_government/',)", "identifyer": 5759299, "year": "2020"}], "name": "gardensingularity2020"}