{"interestingcomments": [{"autor": "_FuturistechInfo", "date": 1588741298000, "content": "Top Futurology News - For the month of April 2020 /!/ **We hope you enjoy this month's update!**\n\nHere are the top stories from the past month (in mostly chronological order):\n\n1) [Artificial Intelligence Cannot Be Inventors, US Patent Office Rules](https://www.vice.com/en_us/article/akw5g4/artificial-intelligence-cannot-be-inventors-us-patent-office-rules)\n\n*An AI system called DABUS \"invented\" two new devices, but the USPTO says only humans can do that. On Monday, the United States Patent and Trademark Office* [*published a decision*](https://content.govdelivery.com/accounts/USPTO/bulletins/287fdc9#.Xqcts2pR6ZQ.email) *that claims artificial intelligences cannot be inventors. Only “natural persons” currently have the right to get a patent.*\n\n2) [Brain-decoding Computer Can Restore This Important Human Sense](https://www.inverse.com/innovation/computer-restores-sense-of-touch)\n\n*The feeling of grass beneath your fingertips, warm sand under your feet, the pain of getting too close to a fire: the world is full of sensations that we often take for granted. But for people who have suffered* [*spinal cord injuries (SCI,)*](https://www.inverse.com/article/62134-spinal-cord-assistive-technology) *and there are* [*approximately 288,000*](https://www.nscisc.uab.edu/Public/Facts%20and%20Figures%20-%202018.pdf) *of them in the United States alone, losing their sense of touch can greatly impact how they interact with the world around them. New research in the field of* [*brain-computer interfaces*](https://www.inverse.com/article/57607-neuralink-elon-musk-s-elusive-brain-computer-firm-just-made-a-big-reveal) *could make this devastating loss of sensation reversible.*\n\n3) [30,000 tiny sensors fit within the size of a penny - Can transmit data from living tissue](https://news.cornell.edu/stories/2020/04/mass-produced-microscopic-sensors-see-light)\n\n*Theologians once pondered how many angels could dance on the head of a pin. Not to be outdone, Cornell researchers who build nanoscale electronics have developed microsensors so tiny, they can fit 30,000 on one side of a penny. There’s more to these tiny sensors than just their diminutive size: They are equipped with an integrated circuit, solar cells and light-emitting diodes (LEDs) that enable them to harness light for power and communication.*\n\n4) [China Rolls Out Pilot Test of Digital Currency](https://www.wsj.com/articles/china-rolls-out-pilot-test-of-digital-currency-11587385339)\n\n*China’s central bank has introduced a homegrown digital currency across four cities as part of a pilot program, marking a milestone on the path toward the first electronic payment system by a major central bank.*\n\n5) [3D imaging reveals inner workings of an \"off-switch\" for cancer](https://newatlas.com/medical/3d-imaging-reveals-inner-workings-off-switch-cancer/)\n\n*One of the ways the human body can fight off cancer cells is through enzymes known as protein phosphatases, which act as a brake to slow cancer growth. Molecules can be used to ramp up the activity of these enzymes, and through advanced imaging technique scientists have now identified the binding sites they use to do the job, revealing how novel drugs could be used to activate this “off-switch” and keep the disease in check.*\n\n6) [Folding@Home Now More Powerful Than All the Supercomputers on Earth](https://www.extremetech.com/extreme/309386-foldinghome-now-more-powerful-than-all-the-supercomputers-on-earth)\n\n*The past six weeks have seen a lot of unprecedented activity across the globe, most of it bad. One bright spot in the gloom — though of course, a rather conditional one — has been the sudden explosion in computational power being flung at analyzing and understanding COVID-19. It wasn’t that long ago we were reporting on the Folding@Home network’s record-breaking 1.5 exaFLOPS of performance. Now, the system has broken 2.5 exaflops. At that speed, it’s reportedly faster than the sustained performance of all Top500 supercomputers combined.*\n\n7) [New handle for controlling electromagnetic properties could enable spintronic computing](https://phys.org/news/2020-04-electromagnetic-properties-enable-spintronic.html)\n\n*Materials scientists at Duke University have shown the first clear example that a material's transition into a magnet can control instabilities in its crystalline structure that cause it to change from a conductor to an insulator. If researchers can learn to control this unique connection between* [*physical properties*](https://phys.org/tags/physical+properties/) *identified in hexagonal iron sulfide, it could enable new technologies such as spintronic computing. The results appear April 13 in the journal Nature Physics.*\n\n8) [Stanford researchers devise treatment that relieved depression in 90% of participants in small study](http://med.stanford.edu/news/all-news/2020/04/stanford-researchers-devise-treatment-that-relieved-depression-i.html)\n\n*Stanford Medicine researchers used high doses of magnetic stimulation, delivered on an accelerated timeline and targeted to individual neurocircuitry, to treat patients with severe depression. A new form of magnetic brain stimulation rapidly relieved symptoms of severe depression in 90% of participants in a small study conducted by researchers at the* [*Stanford University School of Medicine*](https://med.stanford.edu/)*.*\n\n9) [Self-powered X-Ray detector to revolutionize imaging for medicine, security and research](https://www.lanl.gov/discover/news-release-archive/2020/April/0420-self-powered-xray-detector.php)\n\n*2-D perovskite thin films boost sensitivity 100-fold compared to conventional detectors, require no outside power source, and enable low-dose dental and medical images.  A new X-ray detector prototype is on the brink of revolutionizing medical imaging, with dramatic reduction in radiation exposure and the associated health risks, while also boosting resolution in security scanners and research applications, thanks to a collaboration between Los Alamos National Laboratory and Argonne National Laboratory researchers.*\n\n10) [Researchers present revolutionary light-emitting silicon](https://www.tue.nl/en/news/news-overview/08-04-2020-eindhoven-researchers-present-revolutionary-light-emitting-silicon/)\n\n*Breakthrough after 50 years of work paves the way for photonic chips. Emitting light from silicon has been the ‘Holy Grail’ in the microelectronics industry for decades. Solving this puzzle would revolutionize computing, as chips will become faster than ever. Researchers from Eindhoven University of Technology now succeeded: they have developed an alloy with silicon that can emit light. The results have been published in the journal Nature. The team will now start creating a silicon laser to be integrated into current chips.*\n\n11) [Researchers Create AI-Powered Blood Test to Detect Cancer](https://www.extremetech.com/extreme/308687-researchers-create-ai-powered-blood-test-to-detect-cancer)\n\n*Cancer is one of the most common causes of death, but the huge variation in types of cancer can make early detection a challenge. A team of researchers from the US has developed a blood test that might be able to help identify early-stage tumors using the power of AI. The test can* [*detect over 50 different cancers*](https://newatlas.com/medical/ai-powered-universal-blood-test-detection-location-cancer/) *and narrow down tumor location to specific areas of the body.* ", "link": "https://www.reddit.com/r/singularity/comments/gedpea/top_futurology_news_for_the_month_of_april_2020/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "top futurology news - for the month of april 2020 /!/ **we hope you enjoy this month's update!**\n\nhere are the top stories from the past month (in mostly chronological order):\n\n1) [artificial intelligence cannot be inventors, us patent office rules](https://www.vice.com/en_us/article/akw5g4/artificial-intelligence-cannot-be-inventors-us-patent-office-rules)\n\n*an ai system called dabus \"invented\" two new devices, but the uspto says only humans can do that. on monday, the united states patent and trademark office* [*published a decision*](https://content.govdelivery.com/accounts/uspto/bulletins/287fdc9#.xqcts2pr6zq.email) *that claims artificial intelligences cannot be inventors. only “natural persons” currently have the right to get a patent.*\n\n2) [brain-decoding computer can restore this important human sense](https://www.inverse.com/innovation/computer-restores-sense-of-touch)\n\n*the feeling of -----> grass !!!  beneath your fingertips, warm sand under your feet, the pain of getting too close to a fire: the world is full of sensations that we often take for granted. but for people who have suffered* [*spinal cord injuries (sci,)*](https://www.inverse.com/article/62134-spinal-cord-assistive-technology) *and there are* [*approximately 288,000*](https://www.nscisc.uab.edu/public/facts%20and%20figures%20-%202018.pdf) *of them in the united states alone, losing their sense of touch can greatly impact how they interact with the world around them. new research in the field of* [*brain-computer interfaces*](https://www.inverse.com/article/57607-neuralink-elon-musk-s-elusive-brain-computer-firm-just-made-a-big-reveal) *could make this devastating loss of sensation reversible.*\n\n3) [30,000 tiny sensors fit within the size of a penny - can transmit data from living tissue](https://news.cornell.edu/stories/2020/04/mass-produced-microscopic-sensors-see-light)\n\n*theologians once pondered how many angels could dance on the head of a pin. not to be outdone, cornell researchers who build nanoscale electronics have developed microsensors so tiny, they can fit 30,000 on one side of a penny. there’s more to these tiny sensors than just their diminutive size: they are equipped with an integrated circuit, solar cells and light-emitting diodes (leds) that enable them to harness light for power and communication.*\n\n4) [china rolls out pilot test of digital currency](https://www.wsj.com/articles/china-rolls-out-pilot-test-of-digital-currency-11587385339)\n\n*china’s central bank has introduced a homegrown digital currency across four cities as part of a pilot program, marking a milestone on the path toward the first electronic payment system by a major central bank.*\n\n5) [3d imaging reveals inner workings of an \"off-switch\" for cancer](https://newatlas.com/medical/3d-imaging-reveals-inner-workings-off-switch-cancer/)\n\n*one of the ways the human body can fight off cancer cells is through enzymes known as protein phosphatases, which act as a brake to slow cancer growth. molecules can be used to ramp up the activity of these enzymes, and through advanced imaging technique scientists have now identified the binding sites they use to do the job, revealing how novel drugs could be used to activate this “off-switch” and keep the disease in check.*\n\n6) [folding@home now more powerful than all the supercomputers on earth](https://www.extremetech.com/extreme/309386-foldinghome-now-more-powerful-than-all-the-supercomputers-on-earth)\n\n*the past six weeks have seen a lot of unprecedented activity across the globe, most of it bad. one bright spot in the gloom — though of course, a rather conditional one — has been the sudden explosion in computational power being flung at analyzing and understanding covid-19. it wasn’t that long ago we were reporting on the folding@home network’s record-breaking 1.5 exaflops of performance. now, the system has broken 2.5 exaflops. at that speed, it’s reportedly faster than the sustained performance of all top500 supercomputers combined.*\n\n7) [new handle for controlling electromagnetic properties could enable spintronic computing](https://phys.org/news/2020-04-electromagnetic-properties-enable-spintronic.html)\n\n*materials scientists at duke university have shown the first clear example that a material's transition into a magnet can control instabilities in its crystalline structure that cause it to change from a conductor to an insulator. if researchers can learn to control this unique connection between* [*physical properties*](https://phys.org/tags/physical+properties/) *identified in hexagonal iron sulfide, it could enable new technologies such as spintronic computing. the results appear april 13 in the journal nature physics.*\n\n8) [stanford researchers devise treatment that relieved depression in 90% of participants in small study](http://med.stanford.edu/news/all-news/2020/04/stanford-researchers-devise-treatment-that-relieved-depression-i.html)\n\n*stanford medicine researchers used high doses of magnetic stimulation, delivered on an accelerated timeline and targeted to individual neurocircuitry, to treat patients with severe depression. a new form of magnetic brain stimulation rapidly relieved symptoms of severe depression in 90% of participants in a small study conducted by researchers at the* [*stanford university school of medicine*](https://med.stanford.edu/)*.*\n\n9) [self-powered x-ray detector to revolutionize imaging for medicine, security and research](https://www.lanl.gov/discover/news-release-archive/2020/april/0420-self-powered-xray-detector.php)\n\n*2-d perovskite thin films boost sensitivity 100-fold compared to conventional detectors, require no outside power source, and enable low-dose dental and medical images.  a new x-ray detector prototype is on the brink of revolutionizing medical imaging, with dramatic reduction in radiation exposure and the associated health risks, while also boosting resolution in security scanners and research applications, thanks to a collaboration between los alamos national laboratory and argonne national laboratory researchers.*\n\n10) [researchers present revolutionary light-emitting silicon](https://www.tue.nl/en/news/news-overview/08-04-2020-eindhoven-researchers-present-revolutionary-light-emitting-silicon/)\n\n*breakthrough after 50 years of work paves the way for photonic chips. emitting light from silicon has been the ‘holy grail’ in the microelectronics industry for decades. solving this puzzle would revolutionize computing, as chips will become faster than ever. researchers from eindhoven university of technology now succeeded: they have developed an alloy with silicon that can emit light. the results have been published in the journal nature. the team will now start creating a silicon laser to be integrated into current chips.*\n\n11) [researchers create ai-powered blood test to detect cancer](https://www.extremetech.com/extreme/308687-researchers-create-ai-powered-blood-test-to-detect-cancer)\n\n*cancer is one of the most common causes of death, but the huge variation in types of cancer can make early detection a challenge. a team of researchers from the us has developed a blood test that might be able to help identify early-stage tumors using the power of ai. the test can* [*detect over 50 different cancers*](https://newatlas.com/medical/ai-powered-universal-blood-test-detection-location-cancer/) *and narrow down tumor location to specific areas of the body.* ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/singularity/comments/gedpea/top_futurology_news_for_the_month_of_april_2020/',)", "identifyer": 5758537, "year": "2020"}], "name": "grasssingularity2020"}