{"interestingcomments": [{"autor": "samiac99", "date": 1539933509000, "content": "Should we care about life before the singularity? Can people live as they do now if they so choose it afterwards? /!/ As a disclaimer I should probably say that I think the \"singularity\" is a sensationalistic briefcase term that hardly has any serious meaning anymore. I do think we will achieve AGI, and I expect that things will probably get crazy afterwards, though.\n\nMy question is this: If the singularity is going to change things so much, then do things like our entertainment, art, politics, and values such as love, family, and friendship still have meaning?\n\nCan people choose not to take part in the surrealist space opera and stay human instead of becoming one with the universe/ mind-uploads/ cyborgs or whatever and, and still take part in all of the things mentioned in the above question? Or will we be forced to abandon those and go full-on Lawnmower man?", "link": "https://www.reddit.com/r/singularity/comments/9phidh/should_we_care_about_life_before_the_singularity/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "lawnmower", "selectorShort": "lawnmower", "MarkedSent": "should we care about life before the singularity? can people live as they do now if they so choose it afterwards? /!/ as a disclaimer i should probably say that i think the \"singularity\" is a sensationalistic briefcase term that hardly has any serious meaning anymore. i do think we will achieve agi, and i expect that things will probably get crazy afterwards, though.\n\nmy question is this: if the singularity is going to change things so much, then do things like our entertainment, art, politics, and values such as love, family, and friendship still have meaning?\n\ncan people choose not to take part in the surrealist space opera and stay human instead of becoming one with the universe/ mind-uploads/ cyborgs or whatever and, and still take part in all of the things mentioned in the above question? or will we be forced to abandon those and go full-on -----> lawnmower !!!  man?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 25, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9phidh/should_we_care_about_life_before_the_singularity/',)", "identifyer": 5756829, "year": "2018"}], "name": "lawnmowersingularity2018"}