{"interestingcomments": [{"autor": "heathersauerszh", "date": 1569282535000, "content": "Counselors Providing Hope | Kansas City | New Leaf Counseling", "link": "https://www.reddit.com/r/singularity/comments/d8f1y4/counselors_providing_hope_kansas_city_new_leaf/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "counselors providing hope | kansas city | new -----> leaf !!!  counseling", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.newleafcounseling.org/',)", "identifyer": 5585428, "year": "2019"}, {"autor": "BenRayfield", "date": 1575076871000, "content": "What should we do about heatdeath? /!/ Heatdeath is a physics concept that cuz of the gradual spread and pseudorandomization of energy (also defined as the gradual rise of entropy), all possibilities eventually flatten out and become very very very... (to infinite depth) cold and flat.\n\nI believe in the  [https://en.wikipedia.org/wiki/Mathematical\\_universe\\_hypothesis](https://en.wikipedia.org/wiki/Mathematical_universe_hypothesis)  which says all structures which exist mathematically exist also physically, and nothing else exists. In this context, heatdeath is simply whitenoise of all possible frequencies in random combos, angles, dimensions, etc.\n\nThe relation between unitary and turingCompleteness (such as related to BQP vs NP) is somehow related to the set of possible unitary transforms of binary trees where each node is either LEAF or pair of 2 nodes, and pair(unpair(x,x),unpair(x,x)) equals x for all possible x, where a pair has a number that can be positive 0 or negative depth of complete binary tree whose leafs are all equal binary tree shape. That kind of number allows the copying and merging of all possible (finite amount of) info, as a unitary op, BUT to perform the basics of lambda theory on it as in [https://en.wikipedia.org/wiki/SKI\\_combinator\\_calculus](https://en.wikipedia.org/wiki/SKI_combinator_calculus) you still need a stream of known info (such as all 0 bits or all 1 bits) and output a stream of pseudorandomness (waste info), to continue computing, so there is an infinitely small subset of [https://en.wikipedia.org/wiki/Mathematical\\_universe\\_hypothesis](https://en.wikipedia.org/wiki/Mathematical_universe_hypothesis)  which can compute turingCompleteness and be UNITARY. So what if somehow we navigated the space of all possibilities more toward that and accelerated toward heatdeath faster than usual in other cases, so in the cases where we do not near instantly become heatdeath we gain longer duration until heatdeath and can pump chance between those 2 and maybe, just maybe, a form of reality could survive forever???", "link": "https://www.reddit.com/r/singularity/comments/e3ohhk/what_should_we_do_about_heatdeath/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "what should we do about heatdeath? /!/ heatdeath is a physics concept that cuz of the gradual spread and pseudorandomization of energy (also defined as the gradual rise of entropy), all possibilities eventually flatten out and become very very very... (to infinite depth) cold and flat.\n\ni believe in the  [https://en.wikipedia.org/wiki/mathematical\\_universe\\_hypothesis](https://en.wikipedia.org/wiki/mathematical_universe_hypothesis)  which says all structures which exist mathematically exist also physically, and nothing else exists. in this context, heatdeath is simply whitenoise of all possible frequencies in random combos, angles, dimensions, etc.\n\nthe relation between unitary and turingcompleteness (such as related to bqp vs np) is somehow related to the set of possible unitary transforms of binary trees where each node is either -----> leaf !!!  or pair of 2 nodes, and pair(unpair(x,x),unpair(x,x)) equals x for all possible x, where a pair has a number that can be positive 0 or negative depth of complete binary tree whose leafs are all equal binary tree shape. that kind of number allows the copying and merging of all possible (finite amount of) info, as a unitary op, but to perform the basics of lambda theory on it as in [https://en.wikipedia.org/wiki/ski\\_combinator\\_calculus](https://en.wikipedia.org/wiki/ski_combinator_calculus) you still need a stream of known info (such as all 0 bits or all 1 bits) and output a stream of pseudorandomness (waste info), to continue computing, so there is an infinitely small subset of [https://en.wikipedia.org/wiki/mathematical\\_universe\\_hypothesis](https://en.wikipedia.org/wiki/mathematical_universe_hypothesis)  which can compute turingcompleteness and be unitary. so what if somehow we navigated the space of all possibilities more toward that and accelerated toward heatdeath faster than usual in other cases, so in the cases where we do not near instantly become heatdeath we gain longer duration until heatdeath and can pump chance between those 2 and maybe, just maybe, a form of reality could survive forever???", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 28, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/e3ohhk/what_should_we_do_about_heatdeath/',)", "identifyer": 5586509, "year": "2019"}], "name": "leafsingularity2019"}