{"interestingcomments": [{"autor": "andrewfknight", "date": 1561148780000, "content": "Is It Possible to Copy the Brain? /!/ The science fiction plot involving copying brains or uploading minds onto computers or fighting conscious AI or teleportation *yada yada yada* is everywhere.  [Black Mirror](https://en.wikipedia.org/wiki/Black_Mirror) wouldn't even exist without these fascinating ideas.\n\nEvery one of these plots depends on the assumed ability to copy brains or consciousness, or on the assumption that consciousness is algorithmic, like software running on a computer.  These are very related assumptions: all algorithms can be copied and executed on any [general-purpose computer](https://en.wikipedia.org/wiki/Church%E2%80%93Turing_thesis), so if consciousness is algorithmic, then it should be possible to copy conscious states and/or duplicate brains.\n\nLet me be blunt: every science nerd on the planet (including me) has, at some point, wondered about and been intrigued by the possibility and implications of \"brain copying.\"  (Although really I mean the more general notion that one's consciousness can be copied, whether by digitizing consciousness, physically copying the brain, whatever.)  \n\nBut here's something weird.  VERY few scientists have actually questioned the assumptions that conscious states can be copied or that consciousness is fundamentally computational.  For instance, if you Google the exact phrase [\"impossible to copy the brain\"](https://www.google.com/search?rlz=1C1CHBD_enUS812US813&amp;ei=jTANXZnyMM2otQWh55e4AQ&amp;q=%E2%80%9Cimpossible+to+copy+the+brain%E2%80%9D&amp;oq=%E2%80%9Cimpossible+to+copy+the+brain%E2%80%9D&amp;gs_l=psy-ab.3...363421.363421..364098...0.0..0.168.168.0j1......0....2j1..gws-wiz.......0i71.jQH1zZQ2YLc) a total of ZERO results are found, but if you don't question the possibility of brain copying, then the exact phrase [\"copy the brain\"](https://www.google.com/search?rlz=1C1CHBD_enUS812US813&amp;ei=-jENXaOTL9KIsQWS9YHIBg&amp;q=%E2%80%9Ccopy+the+brain%E2%80%9D&amp;oq=%E2%80%9Ccopy+the+brain%E2%80%9D&amp;gs_l=psy-ab.3..0i7i30l3j0i30j0i8i30l3.119654.120225..122023...0.0..0.99.288.3......0....1..gws-wiz.......0i71.tuyvMNdbW_s) yields over a MILLION results.  Does it seems strange that despite our fascination with AI, teleportation, mind uploading, and so forth, that *this particular post* might be the very first in the *entire history of the Internet* to state, in these words, that it might be impossible to copy the brain?  Really?!  No one has ever said that phrase on the Internet before?\n\nThese assumptions are so ingrained within the scientific community that most young physicists, neurobiologists, engineers, etc., don't even realize that they are making such assumptions, and those that do are unlikely to question them.  Famed philosopher [John Searle once pointed out](https://philosophy.as.uky.edu/sites/default/files/Is%20the%20Brain%20a%20Digital%20Computer%20-%20John%20R.%20Searle.pdf) that \"to deny that the brain is computational is to risk losing your membership in the scientific community.\"  Entire industries are even being launched (mind uploading, digital immortality, etc.) on the underlying supposition that it's just a matter of time before we'll be able to digitize the brain, or create a conscious computer, or create a perfect duplicate of the brain.  Are these assumptions valid?\n\nSir Roger Penrose (Oxford) argues that [consciousness cannot be simulated on a computer](https://www.amazon.com/Emperors-New-Mind-Concerning-Computers/dp/0198784929/ref=sr_1_1?crid=1KWG3VTS2GDE0&amp;keywords=roger+penrose+the+emperor%27s+new+mind&amp;qid=1561147831&amp;s=gateway&amp;sprefix=penrose+emper%2Caps%2C152&amp;sr=8-1) because, he claims, humans are able to discover truths that cannot be discovered by any algorithm running on a Turing machine.  However, despite his eminence in the fields of mathematics and physics, he is still [criticized by the \"mainstream\" scientific community](https://www.edge.org/conversation/roger_penrose-chapter-14-consciousness-involves-noncomputable-ingredients) for this suggestion.\n\nScott Aaronson (U. Texas @ Austin) asks in [his paper](http://inspirehep.net/record/1236720/files/arXiv%3A1306.0159.pdf), \"Does quantum mechanics ... put interesting limits on an external agent's ability to scan, copy, and predict human brains ... ?\"  He says he regards this \"as an unsolved scientific question, and a big one,\" and then gives one possible explanation of how physics might explain that conscious brains can't be copied (if in fact they can't).  In a [blog post](https://www.scottaaronson.com/blog/?p=2756), he points to an empirical fact \"about the brain that currently separates it from any existing computer program.  Namely, we know how to copy a computer program ... how to rerun it ... how to transfer it from one substrate to another.  With the brain, we don't know how to do any of those things.\"  In both works, he is careful not to offend the majority, with self-deprecating comments about expecting to be \"roasted alive\" for his dissension from \"the consensus of most of my friends and colleagues.\"\n\nThere are a few other scientists who cautiously suggest that brains can't be copied or that brains aren't computers (one example [here](https://arxiv.org/abs/1405.0126)).  I myself have written a paper ([preprint here](http://arxiv.org/abs/1906.02813)) that argues that consciousness is not algorithmic and can't be copied, in part because consciousness correlates to quantum measurement events that occur outside the body.  But, let's face it: for the most part, very few scientists question these assumptions.\n\n&amp;#x200B;\n\n*I assert that the following* *assumptions* *pervade academia and popular science, and that they are* *unfounded and unsupported* *by empirical evidence:*\n\n*a) That consciousness is computational/algorithmic;*\n\n*b) That consciousness can be duplicated; and*\n\n*c) That brains can be copied.*\n\n&amp;#x200B;\n\nHere is my question: **What empirical evidence do we currently have for making any of these assumptions?**  I think the answer is \"none,\" but I could be wrong.  \n\n&amp;#x200B;\n\nIf you are going to answer this question, please consider these guidelines:\n\n\\*  Please provide actual empirical evidence to support your point.  For example, if you think that brains can be copied, then linking to a bunch of papers in which neurobiologists have sliced rat brains (or whatever) is inadequate, because that says nothing to support the assumption that brains can be copied *over* the assumption that brains cannot be copied.   And extrapolating into the future (\"If we can slice rat brains today, then in 50-100 years we'll be able to digitize them and copy them...\") is not evidence for your point.  On that note...\n\n\\*  Please do not talk about what is expected, or what \"should\" happen, or what you think is possible in principle.  (The phrase \"in principle\" should be banned from the physicist's lexicon.)  Please focus on what is actually known today based on scientific inquiry and discovery.  \n\n\\*  Please do not bully with hazy notions of \"consensus.\"  Scientific truth does not equal consensus.  I don't care (and nor should you) what a \"majority\" of scientists believe if those beliefs are not founded on scientific data and evidence.  Further, considering that anyone who openly questions these assumptions has to apologetically tiptoe on eggshells, for fear of offending the majority, it's difficult or impossible to know whether there really is any consensus on this issue.\n\n\\*  Please be aware of your own assumptions.  For example, if you reply that \"consciousness must be capable of being simulated because it is part of the universe, which is itself being capable of being simulated,\" note that the latter statement is itself an unproven assumption.", "link": "https://www.reddit.com/r/singularity/comments/c3fxvd/is_it_possible_to_copy_the_brain/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "is it possible to copy the brain? /!/ the science fiction -----> plot !!!  involving copying brains or uploading minds onto computers or fighting conscious ai or teleportation *yada yada yada* is everywhere.  [black mirror](https://en.wikipedia.org/wiki/black_mirror) wouldn't even exist without these fascinating ideas.\n\nevery one of these plots depends on the assumed ability to copy brains or consciousness, or on the assumption that consciousness is algorithmic, like software running on a computer.  these are very related assumptions: all algorithms can be copied and executed on any [general-purpose computer](https://en.wikipedia.org/wiki/church%e2%80%93turing_thesis), so if consciousness is algorithmic, then it should be possible to copy conscious states and/or duplicate brains.\n\nlet me be blunt: every science nerd on the planet (including me) has, at some point, wondered about and been intrigued by the possibility and implications of \"brain copying.\"  (although really i mean the more general notion that one's consciousness can be copied, whether by digitizing consciousness, physically copying the brain, whatever.)  \n\nbut here's something weird.  very few scientists have actually questioned the assumptions that conscious states can be copied or that consciousness is fundamentally computational.  for instance, if you google the exact phrase [\"impossible to copy the brain\"](https://www.google.com/search?rlz=1c1chbd_enus812us813&amp;ei=jtanxznymm2otqwh55e4aq&amp;q=%e2%80%9cimpossible+to+copy+the+brain%e2%80%9d&amp;oq=%e2%80%9cimpossible+to+copy+the+brain%e2%80%9d&amp;gs_l=psy-ab.3...363421.363421..364098...0.0..0.168.168.0j1......0....2j1..gws-wiz.......0i71.jqh1zzq2ylc) a total of zero results are found, but if you don't question the possibility of brain copying, then the exact phrase [\"copy the brain\"](https://www.google.com/search?rlz=1c1chbd_enus812us813&amp;ei=-jenxaotl9kisqws9yhibg&amp;q=%e2%80%9ccopy+the+brain%e2%80%9d&amp;oq=%e2%80%9ccopy+the+brain%e2%80%9d&amp;gs_l=psy-ab.3..0i7i30l3j0i30j0i8i30l3.119654.120225..122023...0.0..0.99.288.3......0....1..gws-wiz.......0i71.tuyvmndbw_s) yields over a million results.  does it seems strange that despite our fascination with ai, teleportation, mind uploading, and so forth, that *this particular post* might be the very first in the *entire history of the internet* to state, in these words, that it might be impossible to copy the brain?  really?!  no one has ever said that phrase on the internet before?\n\nthese assumptions are so ingrained within the scientific community that most young physicists, neurobiologists, engineers, etc., don't even realize that they are making such assumptions, and those that do are unlikely to question them.  famed philosopher [john searle once pointed out](https://philosophy.as.uky.edu/sites/default/files/is%20the%20brain%20a%20digital%20computer%20-%20john%20r.%20searle.pdf) that \"to deny that the brain is computational is to risk losing your membership in the scientific community.\"  entire industries are even being launched (mind uploading, digital immortality, etc.) on the underlying supposition that it's just a matter of time before we'll be able to digitize the brain, or create a conscious computer, or create a perfect duplicate of the brain.  are these assumptions valid?\n\nsir roger penrose (oxford) argues that [consciousness cannot be simulated on a computer](https://www.amazon.com/emperors-new-mind-concerning-computers/dp/0198784929/ref=sr_1_1?crid=1kwg3vts2gde0&amp;keywords=roger+penrose+the+emperor%27s+new+mind&amp;qid=1561147831&amp;s=gateway&amp;sprefix=penrose+emper%2caps%2c152&amp;sr=8-1) because, he claims, humans are able to discover truths that cannot be discovered by any algorithm running on a turing machine.  however, despite his eminence in the fields of mathematics and physics, he is still [criticized by the \"mainstream\" scientific community](https://www.edge.org/conversation/roger_penrose-chapter-14-consciousness-involves-noncomputable-ingredients) for this suggestion.\n\nscott aaronson (u. texas @ austin) asks in [his paper](http://inspirehep.net/record/1236720/files/arxiv%3a1306.0159.pdf), \"does quantum mechanics ... put interesting limits on an external agent's ability to scan, copy, and predict human brains ... ?\"  he says he regards this \"as an unsolved scientific question, and a big one,\" and then gives one possible explanation of how physics might explain that conscious brains can't be copied (if in fact they can't).  in a [blog post](https://www.scottaaronson.com/blog/?p=2756), he points to an empirical fact \"about the brain that currently separates it from any existing computer program.  namely, we know how to copy a computer program ... how to rerun it ... how to transfer it from one substrate to another.  with the brain, we don't know how to do any of those things.\"  in both works, he is careful not to offend the majority, with self-deprecating comments about expecting to be \"roasted alive\" for his dissension from \"the consensus of most of my friends and colleagues.\"\n\nthere are a few other scientists who cautiously suggest that brains can't be copied or that brains aren't computers (one example [here](https://arxiv.org/abs/1405.0126)).  i myself have written a paper ([preprint here](http://arxiv.org/abs/1906.02813)) that argues that consciousness is not algorithmic and can't be copied, in part because consciousness correlates to quantum measurement events that occur outside the body.  but, let's face it: for the most part, very few scientists question these assumptions.\n\n&amp;#x200b;\n\n*i assert that the following* *assumptions* *pervade academia and popular science, and that they are* *unfounded and unsupported* *by empirical evidence:*\n\n*a) that consciousness is computational/algorithmic;*\n\n*b) that consciousness can be duplicated; and*\n\n*c) that brains can be copied.*\n\n&amp;#x200b;\n\nhere is my question: **what empirical evidence do we currently have for making any of these assumptions?**  i think the answer is \"none,\" but i could be wrong.  \n\n&amp;#x200b;\n\nif you are going to answer this question, please consider these guidelines:\n\n\\*  please provide actual empirical evidence to support your point.  for example, if you think that brains can be copied, then linking to a bunch of papers in which neurobiologists have sliced rat brains (or whatever) is inadequate, because that says nothing to support the assumption that brains can be copied *over* the assumption that brains cannot be copied.   and extrapolating into the future (\"if we can slice rat brains today, then in 50-100 years we'll be able to digitize them and copy them...\") is not evidence for your point.  on that note...\n\n\\*  please do not talk about what is expected, or what \"should\" happen, or what you think is possible in principle.  (the phrase \"in principle\" should be banned from the physicist's lexicon.)  please focus on what is actually known today based on scientific inquiry and discovery.  \n\n\\*  please do not bully with hazy notions of \"consensus.\"  scientific truth does not equal consensus.  i don't care (and nor should you) what a \"majority\" of scientists believe if those beliefs are not founded on scientific data and evidence.  further, considering that anyone who openly questions these assumptions has to apologetically tiptoe on eggshells, for fear of offending the majority, it's difficult or impossible to know whether there really is any consensus on this issue.\n\n\\*  please be aware of your own assumptions.  for example, if you reply that \"consciousness must be capable of being simulated because it is part of the universe, which is itself being capable of being simulated,\" note that the latter statement is itself an unproven assumption.", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 28, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/c3fxvd/is_it_possible_to_copy_the_brain/',)", "identifyer": 5584722, "year": "2019"}], "name": "plotsingularity2019"}