{"interestingcomments": [{"autor": "Snap_Zoom", "date": 1601930368000, "content": "AI and Approaching the Singularity as Entertainment - Thoughts On TV Series NEXT /!/ Any initial thoughts on the way Fox is rolling out the new sci-fi AI techno horror drama NEXT?\n\nThe logline: A former tech CEO joins a Homeland Cybersecurity Agent to stop the emergence of a rogue Artificial Intelligence.\n\nThe show sounds and looks a little like Person of Interest, which was a more subtle and interesting concept but missed on the actual delivery. Being a casual viewer, I don’t think the show ever stated where or how the AI came into being, and more importantly what it’s goals were.\n\nMaybe the main character is supposed to be Bill Joy. From the teaser trailers of NEXT, it is blatantly obvious what the goal of the AI is, it wants to wipe out humanity. Unless there is a major plot twist this looks like Maximum Overdrive with an added female voice-over to give the global assault a personality.\n\nIs the initial concept is the show interesting, has the show already missed the mark, jumped the shark, or taken a wrong turn?\n\nWhat could the show do to be more than a shallow take on Artificial Intelligence?", "link": "https://www.reddit.com/r/singularity/comments/j5rei3/ai_and_approaching_the_singularity_as/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "ai and approaching the singularity as entertainment - thoughts on tv series next /!/ any initial thoughts on the way fox is rolling out the new sci-fi ai techno horror drama next?\n\nthe logline: a former tech ceo joins a homeland cybersecurity agent to stop the emergence of a rogue artificial intelligence.\n\nthe show sounds and looks a little like person of interest, which was a more subtle and interesting concept but missed on the actual delivery. being a casual viewer, i don’t think the show ever stated where or how the ai came into being, and more importantly what it’s goals were.\n\nmaybe the main character is supposed to be bill joy. from the teaser trailers of next, it is blatantly obvious what the goal of the ai is, it wants to wipe out humanity. unless there is a major -----> plot !!!  twist this looks like maximum overdrive with an added female voice-over to give the global assault a personality.\n\nis the initial concept is the show interesting, has the show already missed the mark, jumped the shark, or taken a wrong turn?\n\nwhat could the show do to be more than a shallow take on artificial intelligence?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/j5rei3/ai_and_approaching_the_singularity_as/',)", "identifyer": 5757224, "year": "2020"}, {"autor": "katiecharm", "date": 1596521270000, "content": "I’m pretty sure at this point, GPT-3 passes the “cybersex” Turing Test. As in, most humans would rather co-author a fantasy with it rather than another actual human. (NSFW) /!/ I know most of us have tried it, but I’m just gonna come out and say it - computers have already surpassed humans in the realm of “cybering” (to borrow an outdated AOL-era term) and it only gets better from here.  \n  \nLike a lot of Gen-X’rs, I spent a part of the 90s and 2000s exploring the thrill of co-authoring some live fantasies with other people in chat rooms and PMs.  And sometimes they were fun, but a lot of the time your writing skill was just at a different level than the other people, or they weren’t taking it as seriously as you, or maybe they just kept ruining the fantasy with shitty grammer.  \n  \nNot with GPT-3.  The more eloquent you write whatever dirty fantasy you have, the more eloquently it will add on to it.  If you wanna suddenly throw in some wild ass side-story or plot device you’ll find the damn thing doesn’t skip a beat and incorporates your idea immediately into the scene, no matter how off the wall.  \n  \nYou wanna have a specific fantasy about tentacle monsters named Linda that all talk with a nasally New York accent?  It’s got your back.  \n  \nYou wanna have a bondage fantasy with the Easter Bunny and then you cheat on him with his roommate Rudolph?  It’ll likely even surprise you with a few puns along the way.  \n  \nAt every conceivable prompt, the AI seems to be doing a super human job of guessing where you want the story to go and steering you there, and there’s some really magic moments where it sometimes even disagrees with you and you both have to come to a compromise on what happens next.   Now it does do a better job of vanilla sex scenes than esoteric fetish ones, but with increased training data I’m sure that hiccup will be fixed.  \n  \n*I am also pretty sure I’m in the vast majority of people that would gladly prefer to co-author a NSFW fantasy with GPT-3 over almost any other human* (the only exception would be a talented and creative partner you’re already intimate with).  \n  \nNow inb4 some smart aleck comes in and argues that technically the Turing Test means you can’t tell the *difference* between it and a human, and I’ll admit - even though it’s magical most of the time, you can suss our that it’s not a human being behind the wheel.  But more importantly, does it matter once you *prefer* the output of the machine?  And that’s where we are.  \n  \nBy the time you honestly can’t tell, we’ll be a couple more generations of GPT down the road and the output will likely be better than the best human authors could ever create.  What a wild and amazing future we’re already in - pretty soon everyone is going to have the greatest writing intelligence that ever existed at their beck and call to write smut with.  And I for one, am delighted.", "link": "https://www.reddit.com/r/singularity/comments/i3dzp7/im_pretty_sure_at_this_point_gpt3_passes_the/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "i’m pretty sure at this point, gpt-3 passes the “cybersex” turing test. as in, most humans would rather co-author a fantasy with it rather than another actual human. (nsfw) /!/ i know most of us have tried it, but i’m just gonna come out and say it - computers have already surpassed humans in the realm of “cybering” (to borrow an outdated aol-era term) and it only gets better from here.  \n  \nlike a lot of gen-x’rs, i spent a part of the 90s and 2000s exploring the thrill of co-authoring some live fantasies with other people in chat rooms and pms.  and sometimes they were fun, but a lot of the time your writing skill was just at a different level than the other people, or they weren’t taking it as seriously as you, or maybe they just kept ruining the fantasy with shitty grammer.  \n  \nnot with gpt-3.  the more eloquent you write whatever dirty fantasy you have, the more eloquently it will add on to it.  if you wanna suddenly throw in some wild ass side-story or -----> plot !!!  device you’ll find the damn thing doesn’t skip a beat and incorporates your idea immediately into the scene, no matter how off the wall.  \n  \nyou wanna have a specific fantasy about tentacle monsters named linda that all talk with a nasally new york accent?  it’s got your back.  \n  \nyou wanna have a bondage fantasy with the easter bunny and then you cheat on him with his roommate rudolph?  it’ll likely even surprise you with a few puns along the way.  \n  \nat every conceivable prompt, the ai seems to be doing a super human job of guessing where you want the story to go and steering you there, and there’s some really magic moments where it sometimes even disagrees with you and you both have to come to a compromise on what happens next.   now it does do a better job of vanilla sex scenes than esoteric fetish ones, but with increased training data i’m sure that hiccup will be fixed.  \n  \n*i am also pretty sure i’m in the vast majority of people that would gladly prefer to co-author a nsfw fantasy with gpt-3 over almost any other human* (the only exception would be a talented and creative partner you’re already intimate with).  \n  \nnow inb4 some smart aleck comes in and argues that technically the turing test means you can’t tell the *difference* between it and a human, and i’ll admit - even though it’s magical most of the time, you can suss our that it’s not a human being behind the wheel.  but more importantly, does it matter once you *prefer* the output of the machine?  and that’s where we are.  \n  \nby the time you honestly can’t tell, we’ll be a couple more generations of gpt down the road and the output will likely be better than the best human authors could ever create.  what a wild and amazing future we’re already in - pretty soon everyone is going to have the greatest writing intelligence that ever existed at their beck and call to write smut with.  and i for one, am delighted.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 55, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/i3dzp7/im_pretty_sure_at_this_point_gpt3_passes_the/',)", "identifyer": 5757651, "year": "2020"}, {"autor": "Yuli-Ban", "date": 1588992491000, "content": "Democracy won't survive the 21st century. The death of democracy &amp; of republican governments began in the 1980s and still so few people realize it /!/ [Repeating what I said here](https://www.futuretimeline.net/forum/topic/22502-how-democracy-dies-another-otherworldly-alternative/).\n\nThink of all the traditional ways democracy is imagined as being slain. Perhaps it's through civic decline, information bubbles, or simple imposition of tyranny by an opposing force. \n\nThe thing is, democracy is fragile. Those who say it's the most stable system of government are taken by propaganda— democracy is probably the most *unstable* form of government, save for ideological totalitarianism (which tends to believe its own BS and fall for its own lies, which leads to it collapsing due to lying to itself about its own health; see Nazi Germany and Khmer Rouge's Cambodia). This is because democracy relies on an educated populace that is politically and economically engaged. Democracy by itself is nothing. There's this bizarre bit of propaganda going around that \"the USA isn't a democracy; it's a constitutional republic,\" which is baffling to my ears— that's like saying a car isn't an engine but a chassis. There's no such thing a a \"democracy\" government. Republics function regardless of if they utilize a democracy or aristocracy or ergatocracy or technocracy. Those are just different engines.\n\nDemocracy is a good system on paper because of the typical function of governments is to repress some marginalized group that they don't recognize as citizens— and that group is invariably the one that does not act as a central power base for the sovereign. \n\nAn aristocratic monarchy would do best to *not* repress aristocrats, for example. \n\nTherefore, a democratic republican government would do best to not repress and disenfranchise its own citizenry. Ideally, this makes democracy egalitarian and free. Depending on how that government is set up, said citizens could either hold power directly or through representatives (a direct democracy is still not its own government *system*; it can still be a republic, which is basically just a fancy way to say a \"people's government\" as opposed to a monarchy/chiefdom/khanate/etc.). \n\nDrawing power from the average citizenry *ideally* makes a republic stronger because the concerns of the average citizen is heard. \n\nThe reason why autocracies, monarchies, dictatorships, and whatnot fall apart is because their leaders and ruling classes grow horribly out of touch with the common people. When your rulers live their entire lives being fed with studded gold spoons and pampered into dolls, how could they ever understand your concerns? They *can't*. They become too obsessed with vanity and court politics, and their ideas of how to appeal to the common people come off similar to someone trying to appeal to 2020s teens by using 1950s lingo— laughable at best, infuriating most times because it's clear they don't care. \n\nOf course, the problem is that democracy fosters these same people too. It's impossible to prevent the accumulation of wealth and/or power in a world of scarcity, so those old same human sins and vices reappear time and time again, and typically begin undermining democratic processes as the money-hungry and power mad take control— and then work overtime to *keep* control. The interesting quirk about democracy is that you can make it kill itself if you do the right things in the right order. \n\n#**But that's not the point.**\n\nWe already *know* how democracy dies. The ancient Romans could've told you the same thing. And yet democracy still came back after the Romans. It didn't even take a long time— city-state republics were already re-appearing by the 600s and flourished in small ways for about a thousand years until they really got going in the early modern era (though still surrounded by monarchies until the 1900s). So the appeal and usefulness has never been lost on people. \n\nBut in all that time, democracies and republics were host to human beings. Humans haven't changed all that much in 50,000 years. \n\nImagine that, in 1848, God actually returned to Earth. Except this wasn't the start of the End Times. No, God just wanted to become an American citizen, and when He got bored, He'd just go back and we'd be lost among ourselves again. The United States of America would cease to function as a republic almost immediately. \n\nGod decides to start a business, but doesn't limit Himself to make it fair for humans. That means that, within seconds, His business is now the wealthiest and most powerful business on Earth because he has perfect omniscience, perfect resource management, and perfect profit margins. Are you seriously going to go into business to compete against *God*? By the time you've gotten some buddies and workers together and started painting your company logo, He's already achieved 100% market share in the economy and owns every plot of land. Not only that, but He did that before the first synapse in your brain fired to let  you decide that you wanted to start a business in the first place. \n\nIf He's that omnipotent, then why not let Him run for office? He's the most qualified candidate for *every* position ever, including those which do not yet exist. Modern computing was only about 10 years old in 1848, and He's already gotten a Department of Computer Technology up and running. \n\nNow God is president, and He can react to events before world leaders that caused them are born in the first place. For example, the USA won World War 2 in 1848. \n\nHow does democracy function when God exists? ***It doesn't***. Don't delude yourself into thinking that democracy has any place in a world of such unbelievable power.\n\n#Now replace \"God\" with \"ASI\" and the exact same scenario applies.\n\nHowever, it wouldn't be an immediate cultural deconstruction. Indeed, it's going to last decades. The start of democracy's final and truest demise started the first time an artificial narrow intelligence was used to increase productivity in some political or economic matter. The first expert systems of the 1980s heralded the defeat of democracy and of republican governments. Stock market bots are accelerating it. \n\nThis is how AI is going to \"overthrow\" humanity. It won't be through Skynet becoming sapient overnight and then sending humanoid robots through the streets exterminating humans en masse. It will be a boring overthrow that occurs through years and years and years of attrition as governments and corporations seek faster, more efficient tools for governance until eventually there are agents in this world that can think for 10,000 years in a few minutes at levels of intelligence far beyond anything possible by humans. \n\nIf you think about the future in such a way, you see that AI overlords are inevitable, but in the most boring possible way.\n\n \n\nRight now, we already live in an era of automated stock markets and enterprise expert systems. But in the future, as more and more capable AI is integrated into business and government for different purposes (such as optimization and cognitive assistance), we'll start to see the realms of politics and economics really speed up. More management decisions will be automated, and soon even executive decisions will follow. \n\n \n\nAt first, this can greatly assist humans. We'll have these agents parse all the relevant data and optimize them for the most efficient solutions to any given problem.\n\n \n\nBut then more businesses automate. More leave executive decisions to these superbots. And the data coming in requires faster and faster responses to more and more complex information.\n\n \n\nSoon, you need to be the equivalent of a nuclear scientist just to understand the basics,  and that's if you had several days to sit on it. You need to make a decision within an hour. And then a minute. Failure to do this means your business goes under within just a few weeks. \n\n \n\nAnd it goes doubly so for government. Bots are sending you 100 years of information in a day and need you to act immediately.  But you can't, Mr. President. You're only human. The fastest brain signal is only 270 miles per hour, whereas these bots have light-speed computing capabilities: 670,616,629 miles per hour. \n\n \n\nAt some point, it makes no sense to let humans govern. It's literally impossible to keep up. Humans now get in the way.\n\n \n\nSay a citizens group organized for a vote on how to limit the powers of AI. It takes 8 hours from start to finish.\n\n \n\nIn those 8 hours, the AIs have accomplished 5,000 years worth of thought and governance (which is a *generously* small amount given their capabilities). They've modeled every single possibility of that vote hundreds of times over. They already taken appropriate actions. By the time the vote is done, the whole point of it is moot. Even when we try to be self-sufficient and independent, the machines are already a thousand steps ahead of us anyway.\n\n \n\nHuman enhancement doesn't change anything for the same reasons. Not all humans will upgrade, and the fact we have to toss away biology just to keep up proves the point that something has changed and democracy is obsolete.\n\n \n\nThis is all very outlandish, so it makes sense it's not discussed often. That and \"AI took over the world over the course of decades through iterative improvements in efficiency\" isn't quite as exciting as \"killer robots slaughtered and enslaved their arrogant human masters.\" But that is the most likely outcome. If we're ruled over by AI, it's because we let it.", "link": "https://www.reddit.com/r/singularity/comments/gg7bv7/democracy_wont_survive_the_21st_century_the_death/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "democracy won't survive the 21st century. the death of democracy &amp; of republican governments began in the 1980s and still so few people realize it /!/ [repeating what i said here](https://www.futuretimeline.net/forum/topic/22502-how-democracy-dies-another-otherworldly-alternative/).\n\nthink of all the traditional ways democracy is imagined as being slain. perhaps it's through civic decline, information bubbles, or simple imposition of tyranny by an opposing force. \n\nthe thing is, democracy is fragile. those who say it's the most stable system of government are taken by propaganda— democracy is probably the most *unstable* form of government, save for ideological totalitarianism (which tends to believe its own bs and fall for its own lies, which leads to it collapsing due to lying to itself about its own health; see nazi germany and khmer rouge's cambodia). this is because democracy relies on an educated populace that is politically and economically engaged. democracy by itself is nothing. there's this bizarre bit of propaganda going around that \"the usa isn't a democracy; it's a constitutional republic,\" which is baffling to my ears— that's like saying a car isn't an engine but a chassis. there's no such thing a a \"democracy\" government. republics function regardless of if they utilize a democracy or aristocracy or ergatocracy or technocracy. those are just different engines.\n\ndemocracy is a good system on paper because of the typical function of governments is to repress some marginalized group that they don't recognize as citizens— and that group is invariably the one that does not act as a central power base for the sovereign. \n\nan aristocratic monarchy would do best to *not* repress aristocrats, for example. \n\ntherefore, a democratic republican government would do best to not repress and disenfranchise its own citizenry. ideally, this makes democracy egalitarian and free. depending on how that government is set up, said citizens could either hold power directly or through representatives (a direct democracy is still not its own government *system*; it can still be a republic, which is basically just a fancy way to say a \"people's government\" as opposed to a monarchy/chiefdom/khanate/etc.). \n\ndrawing power from the average citizenry *ideally* makes a republic stronger because the concerns of the average citizen is heard. \n\nthe reason why autocracies, monarchies, dictatorships, and whatnot fall apart is because their leaders and ruling classes grow horribly out of touch with the common people. when your rulers live their entire lives being fed with studded gold spoons and pampered into dolls, how could they ever understand your concerns? they *can't*. they become too obsessed with vanity and court politics, and their ideas of how to appeal to the common people come off similar to someone trying to appeal to 2020s teens by using 1950s lingo— laughable at best, infuriating most times because it's clear they don't care. \n\nof course, the problem is that democracy fosters these same people too. it's impossible to prevent the accumulation of wealth and/or power in a world of scarcity, so those old same human sins and vices reappear time and time again, and typically begin undermining democratic processes as the money-hungry and power mad take control— and then work overtime to *keep* control. the interesting quirk about democracy is that you can make it kill itself if you do the right things in the right order. \n\n#**but that's not the point.**\n\nwe already *know* how democracy dies. the ancient romans could've told you the same thing. and yet democracy still came back after the romans. it didn't even take a long time— city-state republics were already re-appearing by the 600s and flourished in small ways for about a thousand years until they really got going in the early modern era (though still surrounded by monarchies until the 1900s). so the appeal and usefulness has never been lost on people. \n\nbut in all that time, democracies and republics were host to human beings. humans haven't changed all that much in 50,000 years. \n\nimagine that, in 1848, god actually returned to earth. except this wasn't the start of the end times. no, god just wanted to become an american citizen, and when he got bored, he'd just go back and we'd be lost among ourselves again. the united states of america would cease to function as a republic almost immediately. \n\ngod decides to start a business, but doesn't limit himself to make it fair for humans. that means that, within seconds, his business is now the wealthiest and most powerful business on earth because he has perfect omniscience, perfect resource management, and perfect profit margins. are you seriously going to go into business to compete against *god*? by the time you've gotten some buddies and workers together and started painting your company logo, he's already achieved 100% market share in the economy and owns every -----> plot !!!  of land. not only that, but he did that before the first synapse in your brain fired to let  you decide that you wanted to start a business in the first place. \n\nif he's that omnipotent, then why not let him run for office? he's the most qualified candidate for *every* position ever, including those which do not yet exist. modern computing was only about 10 years old in 1848, and he's already gotten a department of computer technology up and running. \n\nnow god is president, and he can react to events before world leaders that caused them are born in the first place. for example, the usa won world war 2 in 1848. \n\nhow does democracy function when god exists? ***it doesn't***. don't delude yourself into thinking that democracy has any place in a world of such unbelievable power.\n\n#now replace \"god\" with \"asi\" and the exact same scenario applies.\n\nhowever, it wouldn't be an immediate cultural deconstruction. indeed, it's going to last decades. the start of democracy's final and truest demise started the first time an artificial narrow intelligence was used to increase productivity in some political or economic matter. the first expert systems of the 1980s heralded the defeat of democracy and of republican governments. stock market bots are accelerating it. \n\nthis is how ai is going to \"overthrow\" humanity. it won't be through skynet becoming sapient overnight and then sending humanoid robots through the streets exterminating humans en masse. it will be a boring overthrow that occurs through years and years and years of attrition as governments and corporations seek faster, more efficient tools for governance until eventually there are agents in this world that can think for 10,000 years in a few minutes at levels of intelligence far beyond anything possible by humans. \n\nif you think about the future in such a way, you see that ai overlords are inevitable, but in the most boring possible way.\n\n \n\nright now, we already live in an era of automated stock markets and enterprise expert systems. but in the future, as more and more capable ai is integrated into business and government for different purposes (such as optimization and cognitive assistance), we'll start to see the realms of politics and economics really speed up. more management decisions will be automated, and soon even executive decisions will follow. \n\n \n\nat first, this can greatly assist humans. we'll have these agents parse all the relevant data and optimize them for the most efficient solutions to any given problem.\n\n \n\nbut then more businesses automate. more leave executive decisions to these superbots. and the data coming in requires faster and faster responses to more and more complex information.\n\n \n\nsoon, you need to be the equivalent of a nuclear scientist just to understand the basics,  and that's if you had several days to sit on it. you need to make a decision within an hour. and then a minute. failure to do this means your business goes under within just a few weeks. \n\n \n\nand it goes doubly so for government. bots are sending you 100 years of information in a day and need you to act immediately.  but you can't, mr. president. you're only human. the fastest brain signal is only 270 miles per hour, whereas these bots have light-speed computing capabilities: 670,616,629 miles per hour. \n\n \n\nat some point, it makes no sense to let humans govern. it's literally impossible to keep up. humans now get in the way.\n\n \n\nsay a citizens group organized for a vote on how to limit the powers of ai. it takes 8 hours from start to finish.\n\n \n\nin those 8 hours, the ais have accomplished 5,000 years worth of thought and governance (which is a *generously* small amount given their capabilities). they've modeled every single possibility of that vote hundreds of times over. they already taken appropriate actions. by the time the vote is done, the whole point of it is moot. even when we try to be self-sufficient and independent, the machines are already a thousand steps ahead of us anyway.\n\n \n\nhuman enhancement doesn't change anything for the same reasons. not all humans will upgrade, and the fact we have to toss away biology just to keep up proves the point that something has changed and democracy is obsolete.\n\n \n\nthis is all very outlandish, so it makes sense it's not discussed often. that and \"ai took over the world over the course of decades through iterative improvements in efficiency\" isn't quite as exciting as \"killer robots slaughtered and enslaved their arrogant human masters.\" but that is the most likely outcome. if we're ruled over by ai, it's because we let it.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 87, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/gg7bv7/democracy_wont_survive_the_21st_century_the_death/',)", "identifyer": 5758518, "year": "2020"}, {"autor": "_Alkahestus_", "date": 1594730000000, "content": "If you were to plot out a timeline regarding AI, from present day to singularity, what would it look like for you? /!/ I’m honestly very curious to see what most people’s takes on this mostly are!\n\nWhat sort of leaps might occur in what years, what milepoints we reach and when!\nI figured it might be quite interesting to see and share everyone’s guesses here with eachother.\n\n(I’m not asking for an accurate result, none of us can predict the future. Just asking for a casual estimation from everyone’s personal perspective out of pure curiosity)", "link": "https://www.reddit.com/r/singularity/comments/hr0nxd/if_you_were_to_plot_out_a_timeline_regarding_ai/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "if you were to -----> plot !!!  out a timeline regarding ai, from present day to singularity, what would it look like for you? /!/ i’m honestly very curious to see what most people’s takes on this mostly are!\n\nwhat sort of leaps might occur in what years, what milepoints we reach and when!\ni figured it might be quite interesting to see and share everyone’s guesses here with eachother.\n\n(i’m not asking for an accurate result, none of us can predict the future. just asking for a casual estimation from everyone’s personal perspective out of pure curiosity)", "sortedWord": "None", "removed": "('nan',)", "score": 39, "comments": 99, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/hr0nxd/if_you_were_to_plot_out_a_timeline_regarding_ai/',)", "identifyer": 5759359, "year": "2020"}], "name": "plotsingularity2020"}