{"interestingcomments": [{"autor": "Sashavidre", "date": 1517695914000, "content": "Chappie - Great example of AGI &gt; ASI /!/ Anyone seen the film Chappie? https://www.youtube.com/watch?v=lyy7y0QOK-0\n\n\nI think it's a great narrative showing the delicacy of training an AGI. I won't tell the whole movie (for those who haven't watched). But the basic plot is scientist creates AGI. AGI is like a baby, except it learns much faster. And like a baby or child it absorbs it's environment, whether good or bad. So early childhood development influences later development. For example living around a gang of uneducated thugs will make AGI a super thug. But with a caring empathetic university graduate will produce a different value loading. It's important to load the right values, because the rate of loading to understanding to implementing is fast. You only have one chance to get it right.", "link": "https://www.reddit.com/r/singularity/comments/7v2ia3/chappie_great_example_of_agi_asi/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "chappie - great example of agi &gt; asi /!/ anyone seen the film chappie? https://www.youtube.com/watch?v=lyy7y0qok-0\n\n\ni think it's a great narrative showing the delicacy of training an agi. i won't tell the whole movie (for those who haven't watched). but the basic -----> plot !!!  is scientist creates agi. agi is like a baby, except it learns much faster. and like a baby or child it absorbs it's environment, whether good or bad. so early childhood development influences later development. for example living around a gang of uneducated thugs will make agi a super thug. but with a caring empathetic university graduate will produce a different value loading. it's important to load the right values, because the rate of loading to understanding to implementing is fast. you only have one chance to get it right.", "sortedWord": "None", "removed": "('nan',)", "score": 13, "comments": 15, "media": "('self',)", "medialink": "('https://www.reddit.com/r/singularity/comments/7v2ia3/chappie_great_example_of_agi_asi/',)", "identifyer": 5755329, "year": "2018"}, {"autor": "evilpanda898", "date": 1538585766000, "content": "How will AI affect our socioeconomic status? /!/ Last weekend, me and my husband flew to New York for a short trip, where we got the opportunity to see the play [Dear Evan Hansen](https://medium.com/@jenniferpoon/story-of-dear-evan-hansen-9a24ddcd3fb5), which is about this boy, Evan, who has severe social anxiety and lied that he was best friends with a classmate (who committed suicide). Convincing that Connor and Evan were best friends, Evan decided to start the Connor Project to keep Connor's memory alive, as well as to raise money to reopen an abandoned apple orchard that Connor and Evan \"used to hang out together\". The launch of the Connor Project went viral. The plot goes on but one of the things that stuck with me among many things was how social media could affect us in technological singularity age.\n\nThis story also sort of reminds me of that episode from Black Mirror called [Nosedive](https://www.youtube.com/watch?v=R32qWdOWrTo), wherein people are rated based on how they interact with people. It was hard to watch, because you can definitely see how fake the interactions are. So with those two in mind, I thought about how AI could affect our socioeconomic status. Will it make us better people or will AI produce more fake people, lying about their everyday life just to please everyone to get higher social ratings?\n\nTL;DR: Can AI help us communicate better online? Or will we become worse, lying about who we are just to get higher social credit ratings?", "link": "https://www.reddit.com/r/singularity/comments/9l2ypl/how_will_ai_affect_our_socioeconomic_status/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "how will ai affect our socioeconomic status? /!/ last weekend, me and my husband flew to new york for a short trip, where we got the opportunity to see the play [dear evan hansen](https://medium.com/@jenniferpoon/story-of-dear-evan-hansen-9a24ddcd3fb5), which is about this boy, evan, who has severe social anxiety and lied that he was best friends with a classmate (who committed suicide). convincing that connor and evan were best friends, evan decided to start the connor project to keep connor's memory alive, as well as to raise money to reopen an abandoned apple orchard that connor and evan \"used to hang out together\". the launch of the connor project went viral. the -----> plot !!!  goes on but one of the things that stuck with me among many things was how social media could affect us in technological singularity age.\n\nthis story also sort of reminds me of that episode from black mirror called [nosedive](https://www.youtube.com/watch?v=r32qwdowrto), wherein people are rated based on how they interact with people. it was hard to watch, because you can definitely see how fake the interactions are. so with those two in mind, i thought about how ai could affect our socioeconomic status. will it make us better people or will ai produce more fake people, lying about their everyday life just to please everyone to get higher social ratings?\n\ntl;dr: can ai help us communicate better online? or will we become worse, lying about who we are just to get higher social credit ratings?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9l2ypl/how_will_ai_affect_our_socioeconomic_status/',)", "identifyer": 5756095, "year": "2018"}, {"autor": "TheLilliest", "date": 1531153747000, "content": "Will a future ASI turn us all into batteries and plug us into the Matrix or will humans avoid a sci-fi, AI doomsday plot? Realistic AI self-defense options available to future world governments", "link": "https://www.reddit.com/r/singularity/comments/8xdayx/will_a_future_asi_turn_us_all_into_batteries_and/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "will a future asi turn us all into batteries and plug us into the matrix or will humans avoid a sci-fi, ai doomsday -----> plot !!! ? realistic ai self-defense options available to future world governments", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 4, "media": "('nan',)", "medialink": "('https://www.quantumrun.com/prediction/how-humans-will-defend-against-artificial-superintelligence-future',)", "identifyer": 5756285, "year": "2018"}], "name": "plotsingularity2018"}