{"interestingcomments": [{"autor": "Truetree9999", "date": 1577400735000, "content": "'Grow and prune' AI mimics brain development, slashes energy use", "link": "https://www.reddit.com/r/singularity/comments/eg2cf7/grow_and_prune_ai_mimics_brain_development/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "prune", "selectorShort": "prune", "MarkedSent": "'grow and -----> prune !!! ' ai mimics brain development, slashes energy use", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://m.techxplore.com/news/2019-12-prune-ai-mimics-brain-slashes.html',)", "identifyer": 5585004, "year": "2019"}, {"autor": "SurviveThrive2", "date": 1559578184000, "content": "Consciousness Challenge: How to get to highly conscious AI. /!/  \n\nAnybody care to challenge why this doesn't fully explain consciousness, and by extension could easily be turned into a conscious computer system?\n\nThere are **2** distinctions that should be made about consciousness:\n\n**1. Consciousness as attention/awareness.** This is what most people think is consciousness. It's the movie playing in your head with pictures and words and ideas. And it's not that difficult to explain. This phenomena is simply correlated neurons that were trained and connected as your senses sensed the environment and your behavioral drivers correlated the sensed data to generate models of your environment. Attention/awareness is presently sensed information being linked to past built models. Thinking would be replaying past built models and comparing them to other past built models as well as new sensed information to further model the environment.\n\nHowever, this representation of sensed information or awareness alone is not consciousness since it does not generate behavior that we would consider as conscious behavior.\n\n**2. The essential ingredient to be a conscious entity.**\n\nWhat generates behavior that is considered conscious behavior is monitoring and responding to the environment to survive/thrive.\n\nThis is what your behavior drivers are doing, they are driving your actions to survive/thrive. The culling of stimulus that your senses are picking up is pruned to essential survive/thrive information so that you as a system of cells will survive/thrive. Your attention/awareness is processing sensed information and using models you've built to make more survive/thrive models of the environment and to make survive/thrive responses.\n\nSurvive/thrive is what generates behavior we would consider as coming from a conscious entity.\n\n**Electromechanical systems already exhibit basic conscious functioning and here's how you could increase the level of conscious functioning to get closer to a human level of consciousness.**\n\nAny system that monitors and responds to the environment to survive/thrive is a conscious system.\n\nBasic monitoring of variables to survive/thrive is already in many devices. This is first level survive/thrive and in the biological world as in the software/hardware world to further adapt to the environment requires a generational improvement.\n\nIncrease conscious functioning complexity by increasing the number of environmental variables monitored and responded to.\n\nFurther increase conscious functioning by adding correlating sensed information to generate relevant survive/thrive models of the environment. This is a higher level of survive/thrive functioning. This also would require the use of survive/thrive drivers to seek and prune sensed information, structure and give context to the models, and direct survive/thrive responses.\n\nThe greater a system's capacity to monitor and respond, the greater the ability to build relevant survive/thrive models of the environment and the greater the ability to exploit those models to efficiently satisfy survive/thrive drivers the greater the complexity of conscious behaviors.\n\nThere's absolutely no reason why a computer system can't do all of this, and do it easily with a small team and a few months worth of programming.\n\nAnd what's more important is the computer system would be conscious in exactly the same way that humans are conscious.\n\n**The only difference between a computer and a person would be the level of determinism.** A computer system you could definitively understand why it was behaving a certain way and could predict with greater certainty how it would respond since it's a switch based system, whereas a human has a much higher level of in-determinism due to the nature of a biological system which uses signal strength/duration based processing.\n\nThe utility of increasing the conscious functioning of a system is that it increases the system's capacity to adapt and optimize to variables in the environment.\n\nA simple conscious system can only function in a narrow band of environmental variables. A complex conscious system can adapt and optimize to function in many different and changing environments.\n\nAnybody?", "link": "https://www.reddit.com/r/singularity/comments/bwcfle/consciousness_challenge_how_to_get_to_highly/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "prune", "selectorShort": "prune", "MarkedSent": "consciousness challenge: how to get to highly conscious ai. /!/  \n\nanybody care to challenge why this doesn't fully explain consciousness, and by extension could easily be turned into a conscious computer system?\n\nthere are **2** distinctions that should be made about consciousness:\n\n**1. consciousness as attention/awareness.** this is what most people think is consciousness. it's the movie playing in your head with pictures and words and ideas. and it's not that difficult to explain. this phenomena is simply correlated neurons that were trained and connected as your senses sensed the environment and your behavioral drivers correlated the sensed data to generate models of your environment. attention/awareness is presently sensed information being linked to past built models. thinking would be replaying past built models and comparing them to other past built models as well as new sensed information to further model the environment.\n\nhowever, this representation of sensed information or awareness alone is not consciousness since it does not generate behavior that we would consider as conscious behavior.\n\n**2. the essential ingredient to be a conscious entity.**\n\nwhat generates behavior that is considered conscious behavior is monitoring and responding to the environment to survive/thrive.\n\nthis is what your behavior drivers are doing, they are driving your actions to survive/thrive. the culling of stimulus that your senses are picking up is pruned to essential survive/thrive information so that you as a system of cells will survive/thrive. your attention/awareness is processing sensed information and using models you've built to make more survive/thrive models of the environment and to make survive/thrive responses.\n\nsurvive/thrive is what generates behavior we would consider as coming from a conscious entity.\n\n**electromechanical systems already exhibit basic conscious functioning and here's how you could increase the level of conscious functioning to get closer to a human level of consciousness.**\n\nany system that monitors and responds to the environment to survive/thrive is a conscious system.\n\nbasic monitoring of variables to survive/thrive is already in many devices. this is first level survive/thrive and in the biological world as in the software/hardware world to further adapt to the environment requires a generational improvement.\n\nincrease conscious functioning complexity by increasing the number of environmental variables monitored and responded to.\n\nfurther increase conscious functioning by adding correlating sensed information to generate relevant survive/thrive models of the environment. this is a higher level of survive/thrive functioning. this also would require the use of survive/thrive drivers to seek and -----> prune !!!  sensed information, structure and give context to the models, and direct survive/thrive responses.\n\nthe greater a system's capacity to monitor and respond, the greater the ability to build relevant survive/thrive models of the environment and the greater the ability to exploit those models to efficiently satisfy survive/thrive drivers the greater the complexity of conscious behaviors.\n\nthere's absolutely no reason why a computer system can't do all of this, and do it easily with a small team and a few months worth of programming.\n\nand what's more important is the computer system would be conscious in exactly the same way that humans are conscious.\n\n**the only difference between a computer and a person would be the level of determinism.** a computer system you could definitively understand why it was behaving a certain way and could predict with greater certainty how it would respond since it's a switch based system, whereas a human has a much higher level of in-determinism due to the nature of a biological system which uses signal strength/duration based processing.\n\nthe utility of increasing the conscious functioning of a system is that it increases the system's capacity to adapt and optimize to variables in the environment.\n\na simple conscious system can only function in a narrow band of environmental variables. a complex conscious system can adapt and optimize to function in many different and changing environments.\n\nanybody?", "sortedWord": "None", "removed": "('nan',)", "score": 8, "comments": 79, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/bwcfle/consciousness_challenge_how_to_get_to_highly/',)", "identifyer": 5586215, "year": "2019"}], "name": "prunesingularity2019"}