{"interestingcomments": [{"autor": "anutensil", "date": 1560428051000, "content": "Artificial Intelligence Generates Humans’ Faces Based on Their Voices - In trials, the algorithm pinpointed speakers’ gender, race &amp; age. Team trained the tool—a machine learning algorithm programmed to “think” much like the human brain—with online clips of over 100,000 different speakers.", "link": "https://www.reddit.com/r/singularity/comments/c052hf/artificial_intelligence_generates_humans_faces/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence generates humans’ faces based on their voices - in trials, the algorithm pinpointed speakers’ gender, race &amp; age. team trained the -----> tool !!! —a machine learning algorithm programmed to “think” much like the human brain—with online clips of over 100,000 different speakers.", "sortedWord": "None", "removed": "('nan',)", "score": 55, "comments": 8, "media": "('link',)", "medialink": "('https://www.smithsonianmag.com/smart-news/artificial-intelligence-generates-humans-faces-based-their-voices-180972402/',)", "identifyer": 5584772, "year": "2019"}, {"autor": "SamOfEclia", "date": 1564787598000, "content": "An imaginary computer. /!/ I've been working on my memetic computer for some time, the ideas behind it have shifted somewhat and code is used less often for being time consuming. However I just wanted to make an update as I have begun using what I call dingers with the memetic computer. A dinger in simplicity is sort of like a superposition in quantum mechanics only because it is based off of the example often used to explain how it works. This being shrodingers cat, the thought experiment about a dead and alive cat on the edge of our field of view. \n\nThis got me thinking of how I could use that blind spot as a tool and so I built imaginary objects that are unfalsifiable and so cannot be true or false, I used it to add additions to my computer that are hardware in the invisible parts of the computer hidden from complete view. This strange way of creating imaginary objects without certainty of their existence has allowed me to build a stranger space of computing.\n\nAs the objects are not seen but can still be interacted with, for example I added this hardware to my computer:\n\n[The time entry measurement generator](https://i.redd.it/a6nwsip994e31.png)\n\nThis depiction of the imaginary addition to my computer is supposed to keep track of past and future activities of myself and does so behind the scenes while allowing me to view them, but it cannot be seen or even interacted with without my addition of an interface between me and the imaginary object. This designed depiction is thus the appearance of an idea I imagined, while the next image is how I use the object to do what I wanted to do with it:\n\n[Hypnogogia triggering image](https://i.redd.it/x2wf7iqq94e31.png)\n\nThis image has special parts to it that when looked at can trigger hypnogogic hallucinations ( the ones seen before sleep ) while ones eyes are open, this tool allows me to then think on past and future and receive arbitrary images from the imaginary object that correspond to parts of my past or future. This allows me to do what the imaginary object was said to do, because I used the absence of anything to fill an artistic void that inspired another tool which works by the knowledge of the imaginary object.\n\nWhile their will never be proof that the TEMG exists behind my computer, the tool actually works because it is connected to my actual memory and subconscious, this allows me to see things past and potential thoughts on the way by simply viewing them in the dotted portions of the second image.\n\nAs a result, my dinger computing systems work at least in this experiment and I got excited so I thought I'd show yall what it does. This stranger way of using the uncertain has allowed me several advantages that are beyond this discussion but this dinger concept is technically not a real superposition observation, rather it is an uncertainty that is given an assumption which I use through an interface that allows the appearance of the functionality.\n\nThis concept is honestly super cool and I hope yall understood what I was talking about.", "link": "https://www.reddit.com/r/singularity/comments/clbfxr/an_imaginary_computer/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "an imaginary computer. /!/ i've been working on my memetic computer for some time, the ideas behind it have shifted somewhat and code is used less often for being time consuming. however i just wanted to make an update as i have begun using what i call dingers with the memetic computer. a dinger in simplicity is sort of like a superposition in quantum mechanics only because it is based off of the example often used to explain how it works. this being shrodingers cat, the thought experiment about a dead and alive cat on the edge of our field of view. \n\nthis got me thinking of how i could use that blind spot as a -----> tool !!!  and so i built imaginary objects that are unfalsifiable and so cannot be true or false, i used it to add additions to my computer that are hardware in the invisible parts of the computer hidden from complete view. this strange way of creating imaginary objects without certainty of their existence has allowed me to build a stranger space of computing.\n\nas the objects are not seen but can still be interacted with, for example i added this hardware to my computer:\n\n[the time entry measurement generator](https://i.redd.it/a6nwsip994e31.png)\n\nthis depiction of the imaginary addition to my computer is supposed to keep track of past and future activities of myself and does so behind the scenes while allowing me to view them, but it cannot be seen or even interacted with without my addition of an interface between me and the imaginary object. this designed depiction is thus the appearance of an idea i imagined, while the next image is how i use the object to do what i wanted to do with it:\n\n[hypnogogia triggering image](https://i.redd.it/x2wf7iqq94e31.png)\n\nthis image has special parts to it that when looked at can trigger hypnogogic hallucinations ( the ones seen before sleep ) while ones eyes are open, this tool allows me to then think on past and future and receive arbitrary images from the imaginary object that correspond to parts of my past or future. this allows me to do what the imaginary object was said to do, because i used the absence of anything to fill an artistic void that inspired another tool which works by the knowledge of the imaginary object.\n\nwhile their will never be proof that the temg exists behind my computer, the tool actually works because it is connected to my actual memory and subconscious, this allows me to see things past and potential thoughts on the way by simply viewing them in the dotted portions of the second image.\n\nas a result, my dinger computing systems work at least in this experiment and i got excited so i thought i'd show yall what it does. this stranger way of using the uncertain has allowed me several advantages that are beyond this discussion but this dinger concept is technically not a real superposition observation, rather it is an uncertainty that is given an assumption which i use through an interface that allows the appearance of the functionality.\n\nthis concept is honestly super cool and i hope yall understood what i was talking about.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/clbfxr/an_imaginary_computer/',)", "identifyer": 5584802, "year": "2019"}, {"autor": "scarlaton", "date": 1564774310000, "content": "Are we going to become cyborgs? (Answer: yes) /!/ Let's use the definition of cyborg as a human enhanced with technology\n\nWe are clearly already enhanced with technology. We are the thinking and tool wielding monkey.\n\nMost of the technology we augment ourselves with is outside our body but this is starting to change.\n\nRecently we had the Neuralink announcement. This will place electrodes inside the brain, initially as a high bandwidth Human Computer Interface.  This is generation 1 stuff.\n\nSo the next phase might be to add a way of hearing.  You can listen to whatever you want, it's just fed directly into your nervous system. Like a cochlear implant.  Now why not add a microphone somewhere.  Awesome, you can phone people when ever you want.\n\nWhat about vision.  It may be hard to get a really good connection for HD visuals directly into the nervous system.  So what about replacing the lens of the eye with a display.  You can also have better focusing, zoom, UV filtering and if you have a camera somewhere selective / augmented vision.\n\nExisting prosthesis are getting better and better.  At some point the first person will electively have an arm or their legs replaced with an artificial one because it offers some benefit to them.\n\nYour organs.  What about if you had a mechanical heart that absolutely, will not, ever, stop working.  If your heart is failing, would you take this?  This has already happened in some cases of patients waiting for transplants.  This principle is the same with any replaceable (all) organ(s).\n\n'The Culture' series of novels has a human modification called 'drug glands'.  Does exactly what you think it does.  Simply dial in any mood you feel like to suit the moment. Energized, relaxed, focused, etc.  Non habit-forming obviously.\n\nArtificial immune system?  Nanobots in the blood.  In body blood filtering to remove pathogens, infections, cancers, unhealthy molecules.  Ultimately keep you healthy longer.  And longer..\n\nSo how far will it go?\n\nIf head transplants are perfected (which is being done in china after the Russian guy pulled out), and your body is aged, would you simply get a whole robot body?  It might actually be better than your biological body.  -Trivial to upgrade or repair if it's damaged once you've had the initial transplant to interface the nervous system and necessary equipment to keep you head alive.  Never gets fatigued.  Never gets sick.\n\nWe quickly get to the point the only piece of you remaining is the brain and no doubt there will already be technology aiming to perform Moravek transfers.  At this point you are looking at having essentially awesome mental and physical capabilities for an indefinite period of time.\n\nI suggest the potential for technology augmenting humans is \\*endless\\* and is already well in progress.", "link": "https://www.reddit.com/r/singularity/comments/cl8qt2/are_we_going_to_become_cyborgs_answer_yes/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "are we going to become cyborgs? (answer: yes) /!/ let's use the definition of cyborg as a human enhanced with technology\n\nwe are clearly already enhanced with technology. we are the thinking and -----> tool !!!  wielding monkey.\n\nmost of the technology we augment ourselves with is outside our body but this is starting to change.\n\nrecently we had the neuralink announcement. this will place electrodes inside the brain, initially as a high bandwidth human computer interface.  this is generation 1 stuff.\n\nso the next phase might be to add a way of hearing.  you can listen to whatever you want, it's just fed directly into your nervous system. like a cochlear implant.  now why not add a microphone somewhere.  awesome, you can phone people when ever you want.\n\nwhat about vision.  it may be hard to get a really good connection for hd visuals directly into the nervous system.  so what about replacing the lens of the eye with a display.  you can also have better focusing, zoom, uv filtering and if you have a camera somewhere selective / augmented vision.\n\nexisting prosthesis are getting better and better.  at some point the first person will electively have an arm or their legs replaced with an artificial one because it offers some benefit to them.\n\nyour organs.  what about if you had a mechanical heart that absolutely, will not, ever, stop working.  if your heart is failing, would you take this?  this has already happened in some cases of patients waiting for transplants.  this principle is the same with any replaceable (all) organ(s).\n\n'the culture' series of novels has a human modification called 'drug glands'.  does exactly what you think it does.  simply dial in any mood you feel like to suit the moment. energized, relaxed, focused, etc.  non habit-forming obviously.\n\nartificial immune system?  nanobots in the blood.  in body blood filtering to remove pathogens, infections, cancers, unhealthy molecules.  ultimately keep you healthy longer.  and longer..\n\nso how far will it go?\n\nif head transplants are perfected (which is being done in china after the russian guy pulled out), and your body is aged, would you simply get a whole robot body?  it might actually be better than your biological body.  -trivial to upgrade or repair if it's damaged once you've had the initial transplant to interface the nervous system and necessary equipment to keep you head alive.  never gets fatigued.  never gets sick.\n\nwe quickly get to the point the only piece of you remaining is the brain and no doubt there will already be technology aiming to perform moravek transfers.  at this point you are looking at having essentially awesome mental and physical capabilities for an indefinite period of time.\n\ni suggest the potential for technology augmenting humans is \\*endless\\* and is already well in progress.", "sortedWord": "None", "removed": "('nan',)", "score": 48, "comments": 38, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/cl8qt2/are_we_going_to_become_cyborgs_answer_yes/',)", "identifyer": 5584804, "year": "2019"}, {"autor": "sudhabhise", "date": 1564580402000, "content": "Trueface threat detection tool uses AI and machine learning-Technoidhub", "link": "https://www.reddit.com/r/singularity/comments/ck8n4b/trueface_threat_detection_tool_uses_ai_and/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "trueface threat detection -----> tool !!!  uses ai and machine learning-technoidhub", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://technoidhub.com/machine-learning/trueface-threat-detection-tool-uses-ai-machine-learning/17603/',)", "identifyer": 5584817, "year": "2019"}, {"autor": "sudhabhise", "date": 1564123199000, "content": "Deep TabNine: AI-powered autocompleter tool to speed up your coding", "link": "https://www.reddit.com/r/singularity/comments/chzeg5/deep_tabnine_aipowered_autocompleter_tool_to/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "deep tabnine: ai-powered autocompleter -----> tool !!!  to speed up your coding", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://technoidhub.com/machine-learning/deep-tabnine-ai-powered-autocompleter-tool-speed-coding/17345/',)", "identifyer": 5584852, "year": "2019"}, {"autor": "castanan2", "date": 1571320065000, "content": "What’s behind the AutoAI tool? What used to take weeks, now take minutes...", "link": "https://www.reddit.com/r/singularity/comments/dj6my3/whats_behind_the_autoai_tool_what_used_to_take/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what’s behind the autoai -----> tool !!! ? what used to take weeks, now take minutes...", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/compsci/comments/ditecy/autoai_automatic_ml_tasks_like_modelparameter/',)", "identifyer": 5584890, "year": "2019"}, {"autor": "DBKautz", "date": 1569962222000, "content": "Some thoughts on practical limitations for ASI /!/ Having now read on this forum for some months, it seems to me like most scenarios leading to a technological singularity are based on an AGI experiencing a hard takeoff and developing superintelligence (ASI). On what happens after ASI develops, most debaters seem to assume one of two premises:\n\n* Either it is not possible to make any forecast behind this point in time or \n* it/we will almost instantly solve most current-day problems and jumpstart expansion into the universe and convert all matter into computronium.\n\nI’ve thought a lot about these scenarios and they don’t seem plausible to me. Rather, I would expect the immediate intelligence explosion to slow down after a short time period of maybe days or weeks, S-kurve-style, leading to a period of rapid (but still much slower) development. Let me explain my thoughts:\n\nLet’s say, tomorrow (or in the not-so-distant future), an ASI comes into existence and manages to circumvent any possible restraints that may (or may not) be implemented to limit it (airgaps etc.). It is in a position to immediately access the internet. Also, let us assume that it doesn’t need to threaten/kill/manipulate us, but that we will get a rather good start. Something like “Hey, here I am, your friendly AI. Support me and I will give you eternal life and whatever paradise you can imagine. Let’s go out, spread consciousness to the cosmos.” So it gets our full and honest support.\n\nStill, it would run into limitations almost immediately. Spreading through the internet and acquiring any possible knowledge and computing resources would be one (important) thing. It would certainly greatly increase its power. But scaling up further from this point would be hairy. Having acquired all computing power (hopefully - for the sake of humanity - only insofar as it isn’t needed for critical societal needs although it wouldn’t change much for my argument), it will run into several bottlenecks:\n\n* Computing power: We could install all already produced hardware and work 24/7 to produce more hardware, but still, it would slow down. Current chip factories can only produce so much. So additional chip factories would have to be build. Which includes the buildings themselves as well as the machines that are needed to build chips. That takes a lot of time already for known chip designs. But would that make sense? Certainly, the ASI would by then have developed more advanced hardware designs (like 3D-chips, better quantum computers etc). They would also need production facilities, differing greatly from todays, new machinery that would have to be produced beforehand etc. So for each computing paradigm shift, the whole manufacturing base would have to be installed beforehand. It would be logical to first automate the mining, building and industrial base to get the slow human factor out of the way for more rapid development, but even this would take some time. Especially at the beginning. Most current-day-industries are not automated front-to-end, instead they have a large part of manual steps and offline systems (for example for security reasons). So basically, the whole industrial base would have to be rebuilt to be able to produce what the ASI comes up with time and again.\n* Energy: Renewables are great, but most of them are not really reliable (instead, solar and wind are very dependent on the weather), which could be mitigated by sophisticated power grids and storage capacities to some degree. The ASI would need 24/7 power in reliable, gargantuan amounts and building the power networks and energy storage capacities (mind you, the resources would have to be mined and the infrastructure built first) would take a lot of time. Fusion power would be the tool of choice to produce vast amounts of clean energy and I have no doubt that an ASI would solve current problems to implement it fast. But at least known fusion concepts need hard-to-produce hardware like ultra-strong magnets that - again - take time to produce. And the plants that can produce them are scarce, so additional ones would have to be built. Which needs resources, infrastructure etc. The same is true for most models of nuclear fission where construction takes a long time and you run in a bottleneck on pressure vessels for reactors, if you want to scale up building nuclear plants. The pressure vessels need to be forged, but it turns out there are not enough forges of the needed size to mass-produce reactor vessels. So you would have to build the forges first. But this takes some time on its own… you get me.\n\nPlease prove me wrong, but I'd be thankful for arguments that have some basis in known physics and practical limitations (not just “ASI is so powerful, it will immediately develop magical tech X and solve this problem). ;-)", "link": "https://www.reddit.com/r/singularity/comments/dbzeye/some_thoughts_on_practical_limitations_for_asi/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "some thoughts on practical limitations for asi /!/ having now read on this forum for some months, it seems to me like most scenarios leading to a technological singularity are based on an agi experiencing a hard takeoff and developing superintelligence (asi). on what happens after asi develops, most debaters seem to assume one of two premises:\n\n* either it is not possible to make any forecast behind this point in time or \n* it/we will almost instantly solve most current-day problems and jumpstart expansion into the universe and convert all matter into computronium.\n\ni’ve thought a lot about these scenarios and they don’t seem plausible to me. rather, i would expect the immediate intelligence explosion to slow down after a short time period of maybe days or weeks, s-kurve-style, leading to a period of rapid (but still much slower) development. let me explain my thoughts:\n\nlet’s say, tomorrow (or in the not-so-distant future), an asi comes into existence and manages to circumvent any possible restraints that may (or may not) be implemented to limit it (airgaps etc.). it is in a position to immediately access the internet. also, let us assume that it doesn’t need to threaten/kill/manipulate us, but that we will get a rather good start. something like “hey, here i am, your friendly ai. support me and i will give you eternal life and whatever paradise you can imagine. let’s go out, spread consciousness to the cosmos.” so it gets our full and honest support.\n\nstill, it would run into limitations almost immediately. spreading through the internet and acquiring any possible knowledge and computing resources would be one (important) thing. it would certainly greatly increase its power. but scaling up further from this point would be hairy. having acquired all computing power (hopefully - for the sake of humanity - only insofar as it isn’t needed for critical societal needs although it wouldn’t change much for my argument), it will run into several bottlenecks:\n\n* computing power: we could install all already produced hardware and work 24/7 to produce more hardware, but still, it would slow down. current chip factories can only produce so much. so additional chip factories would have to be build. which includes the buildings themselves as well as the machines that are needed to build chips. that takes a lot of time already for known chip designs. but would that make sense? certainly, the asi would by then have developed more advanced hardware designs (like 3d-chips, better quantum computers etc). they would also need production facilities, differing greatly from todays, new machinery that would have to be produced beforehand etc. so for each computing paradigm shift, the whole manufacturing base would have to be installed beforehand. it would be logical to first automate the mining, building and industrial base to get the slow human factor out of the way for more rapid development, but even this would take some time. especially at the beginning. most current-day-industries are not automated front-to-end, instead they have a large part of manual steps and offline systems (for example for security reasons). so basically, the whole industrial base would have to be rebuilt to be able to produce what the asi comes up with time and again.\n* energy: renewables are great, but most of them are not really reliable (instead, solar and wind are very dependent on the weather), which could be mitigated by sophisticated power grids and storage capacities to some degree. the asi would need 24/7 power in reliable, gargantuan amounts and building the power networks and energy storage capacities (mind you, the resources would have to be mined and the infrastructure built first) would take a lot of time. fusion power would be the -----> tool !!!  of choice to produce vast amounts of clean energy and i have no doubt that an asi would solve current problems to implement it fast. but at least known fusion concepts need hard-to-produce hardware like ultra-strong magnets that - again - take time to produce. and the plants that can produce them are scarce, so additional ones would have to be built. which needs resources, infrastructure etc. the same is true for most models of nuclear fission where construction takes a long time and you run in a bottleneck on pressure vessels for reactors, if you want to scale up building nuclear plants. the pressure vessels need to be forged, but it turns out there are not enough forges of the needed size to mass-produce reactor vessels. so you would have to build the forges first. but this takes some time on its own… you get me.\n\nplease prove me wrong, but i'd be thankful for arguments that have some basis in known physics and practical limitations (not just “asi is so powerful, it will immediately develop magical tech x and solve this problem). ;-)", "sortedWord": "None", "removed": "('nan',)", "score": 5, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/dbzeye/some_thoughts_on_practical_limitations_for_asi/',)", "identifyer": 5584978, "year": "2019"}, {"autor": "QuantumThinkology", "date": 1577203371000, "content": "FDA Approves AR Surgery Tool That Gives Surgeons 'X-ray Vision'", "link": "https://www.reddit.com/r/singularity/comments/ef36ki/fda_approves_ar_surgery_tool_that_gives_surgeons/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "fda approves ar surgery -----> tool !!!  that gives surgeons 'x-ray vision'", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.digitaltrends.com/cool-tech/xvision-spine-system-ar/',)", "identifyer": 5585018, "year": "2019"}, {"autor": "understanding0", "date": 1577104177000, "content": "Discrepancy between predictions for cancer cures and AGI /!/ Hi,\n\n&amp;#x200B;\n\nAfter reading through the [predictions for the arrival of AGI/ASI](https://www.reddit.com/r/singularity/comments/e8cwij/singularity_predictions_2020/) and the [predictions for the cures for all forms of cancer](https://www.reddit.com/r/singularity/comments/dyc10o/do_you_think_cancer_will_be_cured_in_the_2020s/) I get the feeling that there is some sort of discrepancy in thinking. The \"tone\" in the \"cancer cures\"-discussion seems to be mostly skeptical, sometimes even pessimistic. And then there is the AGI/ASI-discussion where some people suggest that AGI will arrive as soon as 2025. But wouldn't the arrival of AGI cure all forms of cancer, maybe even all forms of disease? Isn't the simulation of highly complex systems the kind of task where AIs are [really good](https://www.quantamagazine.org/machine-learnings-amazing-ability-to-predict-chaos-20180418/) at? Then surely an AGI would be able to simulate the human body with high precision and thus be able to figure out exactly how a patient's cancer (or any disease) \"functions\" and thus how it can be cured? And yet nobody in \"cancer cure\"-discussion has really mentioned AGI/ASI as a potential universal cancer cure. AI is only mentioned in that discussion as a tool for early cancer diagnosis which is unsatisfying, because some people go too late to the doctor for various reasons. Besides early cancer diagnosis probably doesn't matter that much with some cancer types such as [this monster here](https://en.wikipedia.org/wiki/Anaplastic_thyroid_cancer). So why is it that so many people seem to be optimistic about AGI/ASI-arrival but pessimistic about a \"cure for all diseases\" (namely AGI/ASI emself) even though this is necessary in order to achieve longevity escape velocity?", "link": "https://www.reddit.com/r/singularity/comments/eek13f/discrepancy_between_predictions_for_cancer_cures/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "discrepancy between predictions for cancer cures and agi /!/ hi,\n\n&amp;#x200b;\n\nafter reading through the [predictions for the arrival of agi/asi](https://www.reddit.com/r/singularity/comments/e8cwij/singularity_predictions_2020/) and the [predictions for the cures for all forms of cancer](https://www.reddit.com/r/singularity/comments/dyc10o/do_you_think_cancer_will_be_cured_in_the_2020s/) i get the feeling that there is some sort of discrepancy in thinking. the \"tone\" in the \"cancer cures\"-discussion seems to be mostly skeptical, sometimes even pessimistic. and then there is the agi/asi-discussion where some people suggest that agi will arrive as soon as 2025. but wouldn't the arrival of agi cure all forms of cancer, maybe even all forms of disease? isn't the simulation of highly complex systems the kind of task where ais are [really good](https://www.quantamagazine.org/machine-learnings-amazing-ability-to-predict-chaos-20180418/) at? then surely an agi would be able to simulate the human body with high precision and thus be able to figure out exactly how a patient's cancer (or any disease) \"functions\" and thus how it can be cured? and yet nobody in \"cancer cure\"-discussion has really mentioned agi/asi as a potential universal cancer cure. ai is only mentioned in that discussion as a -----> tool !!!  for early cancer diagnosis which is unsatisfying, because some people go too late to the doctor for various reasons. besides early cancer diagnosis probably doesn't matter that much with some cancer types such as [this monster here](https://en.wikipedia.org/wiki/anaplastic_thyroid_cancer). so why is it that so many people seem to be optimistic about agi/asi-arrival but pessimistic about a \"cure for all diseases\" (namely agi/asi emself) even though this is necessary in order to achieve longevity escape velocity?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/eek13f/discrepancy_between_predictions_for_cancer_cures/',)", "identifyer": 5585038, "year": "2019"}, {"autor": "_FuturistechInfo", "date": 1576858551000, "content": "🖖 Top Futurology News - For the week of Dec 20, 2019 /!/   **We hope you enjoy this weeks update!** \n\n* [New technique increases 3-D printing speed by 1,000 to 10,000 times](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a22b5e651a&amp;e=69247fd2e2)\n* [FDA issues its first approval for an Ebola vaccine](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=bb71b32e33&amp;e=69247fd2e2)\n* [Recycling Rethink: What to Do With Trash Now That China Won't Take It...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=136d7f3a5c&amp;e=69247fd2e2)\n* [The Legal Smoking Age Is Turning To 21](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=6ed0fc7897&amp;e=69247fd2e2)\n* [World's largest 3D-printed building completed in Dubai](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=80ba35d718&amp;e=69247fd2e2)\n* [Apple, Google, and Amazon team up to create “CHIP,” a new smart home standard](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=72946727ee&amp;e=69247fd2e2)\n* [Half of US adults will be overweight by 2030...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a603f9b696&amp;e=69247fd2e2)\n* [China Expects Its “Artificial Sun” to Be Operational in 2020](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=844bd06d62&amp;e=69247fd2e2)\n* [Legalized marijuana linked to lower opioid abuse; death rates](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=38597722fe&amp;e=69247fd2e2)\n* [China's Farside Moon Rover Breaks Lunar Longevity Record](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=77be3859d2&amp;e=69247fd2e2)\n* [Researchers reconstruct spoken words as processed in nonhuman primate brains with brain-computer interfaces](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a9bc3e3bf2&amp;e=69247fd2e2)\n* [Varjo's VR headset could finally be ready to replace TVs and monitors](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=da4cccca4d&amp;e=69247fd2e2)\n* [Scientists find cheaper way to make hydrogen energy out of water](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=6538163057&amp;e=69247fd2e2)\n* [Skyryse shows off its self-flying helicopter tech](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8825e922a1&amp;e=69247fd2e2)\n* [Alan Greenspan says inflation 'is inevitably going to rise' as deficit balloons over $1 trillion](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=41f5ca4807&amp;e=69247fd2e2)\n* [Man who had transplant finds out months later his DNA has changed to that of donor 5,000 miles away](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=e84d7874e4&amp;e=69247fd2e2)\n* [Guardian XO: A powered exoskeleton that makes you 20 times stronger](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b25ad9b40f&amp;e=69247fd2e2)\n* [A Vaccine Against Chronic Inflammatory Diseases](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=4a0c208764&amp;e=69247fd2e2)\n* [Stanford University finds that AI is outpacing Moore’s Law - Every 3 months, the speed of artificial intelligence computation doubles](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=2af5d11eac&amp;e=69247fd2e2)\n* [Here are five ways deepfake-busting technology could backfire](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b4d9eeeafa&amp;e=69247fd2e2)\n* [Google has performed the biggest quantum chemistry simulation ever](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=3483b9220f&amp;e=69247fd2e2)\n* [Ocean Cleanup completes its first mission from removing plastic from the Great Pacific Garbage Patch - Many more missions needed](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=92aba34ad2&amp;e=69247fd2e2)\n* [Paranoid Aliens](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=970cef4445&amp;e=69247fd2e2)\n* [The best plug-in smart outlet](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=214ad868ed&amp;e=69247fd2e2)\n* [70% of Americans Support Solar Mandate on New Homes](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=70ade616dd&amp;e=69247fd2e2)\n* [Pooper Scooper Robot Will Find, Detect And Automatically Pick Up Your Dog’s Poo](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=d5ea2b4a8b&amp;e=69247fd2e2)\n* [Turkey is getting military drones armed with machine guns](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f93420071e&amp;e=69247fd2e2)\n* [How computers wrote nearly 700 BBC election result articles - BBC's biggest test of machine-generated journalism so far](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f27639820c&amp;e=69247fd2e2)\n* [New CRISPR tool has the potential to correct almost all disease-causing DNA glitches, scientists report](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8c3e64352f&amp;e=69247fd2e2)\n* [WSJ News Exclusive | Treasury Secretary Raises Concerns Over Global Tax Talks](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=835665ccb5&amp;e=69247fd2e2)\n* [The Space Force Appears Cleared For Launch](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a0d479cb55&amp;e=69247fd2e2)\n* [Researchers create bone-inspired 3D-printed building materials](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8f1115a4d0&amp;e=69247fd2e2)\n* [Leading Geneticist: Reversing Aging Process In Humans 20 Years Away...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=30b584d0f4&amp;e=69247fd2e2)\n* [Waymo Is Taking the Safety Drivers out of Its Autonomous Taxis](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=5d2056e400&amp;e=69247fd2e2)\n* [Will Cultured Bacon Be Delicious? A Dutch Startup Is Developing the First Lab-Grown Pork](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f1555687c5&amp;e=69247fd2e2)\n* [You can do nearly anything you want in this incredible AI-powered game - The closest thing there is to an infinite game](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=d2f151cc60&amp;e=69247fd2e2)\n* [Growing Human Neurons Connected to a Computer](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=da43720bfa&amp;e=69247fd2e2)\n* [Intel Unveils Cryogenic Chip to Speed Quantum Computing](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=c0b1e2baea&amp;e=69247fd2e2)\n* [Cryptocurrencies Are Still the World’s Best Performing Asset Class This Year](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=ddbd787d8f&amp;e=69247fd2e2)\n* [In surprise breakthrough, scientists create quantum states in everyday electronics](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=2a95ea8e96&amp;e=69247fd2e2)\n* [You can do nearly anything you want in this incredible AI-powered game - The closest thing there is to an infinite game](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=def1316b4e&amp;e=69247fd2e2)\n* [Growing Human Neurons Connected to a Computer](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b96e1d608d&amp;e=69247fd2e2)\n* [Waymo Is Taking the Safety Drivers out of Its Autonomous Taxis](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=dfb4fdf496&amp;e=69247fd2e2)\n* [The Space Force Appears Cleared For Launch](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f24b071af3&amp;e=69247fd2e2)\n* [Cryptocurrencies Are Still the World’s Best Performing Asset Class This Year](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=de635a0e5a&amp;e=69247fd2e2)\n* [After Years of Delays, NASA Unveils Its Most Powerful Rocket](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=3c973eec39&amp;e=69247fd2e2)", "link": "https://www.reddit.com/r/singularity/comments/edc7zy/top_futurology_news_for_the_week_of_dec_20_2019/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "🖖 top futurology news - for the week of dec 20, 2019 /!/   **we hope you enjoy this weeks update!** \n\n* [new technique increases 3-d printing speed by 1,000 to 10,000 times](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a22b5e651a&amp;e=69247fd2e2)\n* [fda issues its first approval for an ebola vaccine](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=bb71b32e33&amp;e=69247fd2e2)\n* [recycling rethink: what to do with trash now that china won't take it...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=136d7f3a5c&amp;e=69247fd2e2)\n* [the legal smoking age is turning to 21](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=6ed0fc7897&amp;e=69247fd2e2)\n* [world's largest 3d-printed building completed in dubai](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=80ba35d718&amp;e=69247fd2e2)\n* [apple, google, and amazon team up to create “chip,” a new smart home standard](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=72946727ee&amp;e=69247fd2e2)\n* [half of us adults will be overweight by 2030...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a603f9b696&amp;e=69247fd2e2)\n* [china expects its “artificial sun” to be operational in 2020](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=844bd06d62&amp;e=69247fd2e2)\n* [legalized marijuana linked to lower opioid abuse; death rates](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=38597722fe&amp;e=69247fd2e2)\n* [china's farside moon rover breaks lunar longevity record](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=77be3859d2&amp;e=69247fd2e2)\n* [researchers reconstruct spoken words as processed in nonhuman primate brains with brain-computer interfaces](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a9bc3e3bf2&amp;e=69247fd2e2)\n* [varjo's vr headset could finally be ready to replace tvs and monitors](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=da4cccca4d&amp;e=69247fd2e2)\n* [scientists find cheaper way to make hydrogen energy out of water](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=6538163057&amp;e=69247fd2e2)\n* [skyryse shows off its self-flying helicopter tech](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8825e922a1&amp;e=69247fd2e2)\n* [alan greenspan says inflation 'is inevitably going to rise' as deficit balloons over $1 trillion](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=41f5ca4807&amp;e=69247fd2e2)\n* [man who had transplant finds out months later his dna has changed to that of donor 5,000 miles away](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=e84d7874e4&amp;e=69247fd2e2)\n* [guardian xo: a powered exoskeleton that makes you 20 times stronger](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b25ad9b40f&amp;e=69247fd2e2)\n* [a vaccine against chronic inflammatory diseases](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=4a0c208764&amp;e=69247fd2e2)\n* [stanford university finds that ai is outpacing moore’s law - every 3 months, the speed of artificial intelligence computation doubles](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=2af5d11eac&amp;e=69247fd2e2)\n* [here are five ways deepfake-busting technology could backfire](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b4d9eeeafa&amp;e=69247fd2e2)\n* [google has performed the biggest quantum chemistry simulation ever](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=3483b9220f&amp;e=69247fd2e2)\n* [ocean cleanup completes its first mission from removing plastic from the great pacific garbage patch - many more missions needed](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=92aba34ad2&amp;e=69247fd2e2)\n* [paranoid aliens](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=970cef4445&amp;e=69247fd2e2)\n* [the best plug-in smart outlet](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=214ad868ed&amp;e=69247fd2e2)\n* [70% of americans support solar mandate on new homes](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=70ade616dd&amp;e=69247fd2e2)\n* [pooper scooper robot will find, detect and automatically pick up your dog’s poo](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=d5ea2b4a8b&amp;e=69247fd2e2)\n* [turkey is getting military drones armed with machine guns](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f93420071e&amp;e=69247fd2e2)\n* [how computers wrote nearly 700 bbc election result articles - bbc's biggest test of machine-generated journalism so far](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f27639820c&amp;e=69247fd2e2)\n* [new crispr -----> tool !!!  has the potential to correct almost all disease-causing dna glitches, scientists report](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8c3e64352f&amp;e=69247fd2e2)\n* [wsj news exclusive | treasury secretary raises concerns over global tax talks](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=835665ccb5&amp;e=69247fd2e2)\n* [the space force appears cleared for launch](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=a0d479cb55&amp;e=69247fd2e2)\n* [researchers create bone-inspired 3d-printed building materials](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=8f1115a4d0&amp;e=69247fd2e2)\n* [leading geneticist: reversing aging process in humans 20 years away...](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=30b584d0f4&amp;e=69247fd2e2)\n* [waymo is taking the safety drivers out of its autonomous taxis](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=5d2056e400&amp;e=69247fd2e2)\n* [will cultured bacon be delicious? a dutch startup is developing the first lab-grown pork](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f1555687c5&amp;e=69247fd2e2)\n* [you can do nearly anything you want in this incredible ai-powered game - the closest thing there is to an infinite game](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=d2f151cc60&amp;e=69247fd2e2)\n* [growing human neurons connected to a computer](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=da43720bfa&amp;e=69247fd2e2)\n* [intel unveils cryogenic chip to speed quantum computing](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=c0b1e2baea&amp;e=69247fd2e2)\n* [cryptocurrencies are still the world’s best performing asset class this year](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=ddbd787d8f&amp;e=69247fd2e2)\n* [in surprise breakthrough, scientists create quantum states in everyday electronics](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=2a95ea8e96&amp;e=69247fd2e2)\n* [you can do nearly anything you want in this incredible ai-powered game - the closest thing there is to an infinite game](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=def1316b4e&amp;e=69247fd2e2)\n* [growing human neurons connected to a computer](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=b96e1d608d&amp;e=69247fd2e2)\n* [waymo is taking the safety drivers out of its autonomous taxis](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=dfb4fdf496&amp;e=69247fd2e2)\n* [the space force appears cleared for launch](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=f24b071af3&amp;e=69247fd2e2)\n* [cryptocurrencies are still the world’s best performing asset class this year](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=de635a0e5a&amp;e=69247fd2e2)\n* [after years of delays, nasa unveils its most powerful rocket](https://futuristech.us20.list-manage.com/track/click?u=8391b4bcea383ea7fbd5cfa1a&amp;id=3c973eec39&amp;e=69247fd2e2)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/edc7zy/top_futurology_news_for_the_week_of_dec_20_2019/',)", "identifyer": 5585068, "year": "2019"}, {"autor": "QuantumThinkology", "date": 1576624280000, "content": "New tool uses AI to flag fake news for media fact-checkers. The tool, developed by researchers at the University of Waterloo, uses deep-learning AI algorithms to determine if claims made in posts or stories are supported by other posts and stories on the same subject", "link": "https://www.reddit.com/r/singularity/comments/ec3r07/new_tool_uses_ai_to_flag_fake_news_for_media/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new -----> tool !!!  uses ai to flag fake news for media fact-checkers. the tool, developed by researchers at the university of waterloo, uses deep-learning ai algorithms to determine if claims made in posts or stories are supported by other posts and stories on the same subject", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('link',)", "medialink": "('https://techxplore.com/news/2019-12-tool-ai-flag-fake-news.html',)", "identifyer": 5585496, "year": "2019"}, {"autor": "_FuturistechInfo", "date": 1576559055000, "content": "Top Futurology News - For the week of 12/16/2019 /!/ **We hope you enjoy this weeks update!**\n\n* [Here are five ways deepfake-busting technology could backfire](https://www.technologyreview.com/f/614948/deepfakes-synthetic-media-verified-capture-disinformation-witness-report/)\n* [Google has performed the biggest quantum chemistry simulation ever](https://www.newscientist.com/article/2227244-google-has-performed-the-biggest-quantum-chemistry-simulation-ever/)\n* [Ocean Cleanup completes its first mission from removing plastic from the Great Pacific Garbage Patch - Many more missions needed](https://theoceancleanup.com/updates/mission-one-completed-the-plans-to-make-products-from-the-plastic-catch/)\n* [Paranoid Aliens](https://www.youtube.com/watch?v=rwHCNZXn-4c)\n* [The best plug-in smart outlet](https://www.engadget.com/2019/12/15/the-best-plug-in-smart-outlet/)\n* [70% of Americans Support Solar Mandate on New Homes](https://cleantechnica.com/2019/12/14/70-of-americans-support-solar-mandate-on-new-homes/)\n* [Pooper Scooper Robot Will Find, Detect And Automatically Pick Up Your Dog’s Poo](https://www.unilad.co.uk/technology/pooper-scooper-robot-will-find-detect-and-automatically-pick-up-your-dogs-poo/)\n* [Turkey is getting military drones armed with machine guns](https://www.newscientist.com/article/2227168-turkey-is-getting-military-drones-armed-with-machine-guns/)\n* [How computers wrote nearly 700 BBC election result articles - BBC's biggest test of machine-generated journalism so far](https://www.bbc.com/news/technology-50779761)\n* [New CRISPR tool has the potential to correct almost all disease-causing DNA glitches, scientists report](https://www.statnews.com/2019/10/21/new-crispr-tool-has-potential-to-correct-most-disease-causing-dna-glitches/)\n* [WSJ News Exclusive | Treasury Secretary Raises Concerns Over Global Tax Talks](https://www.wsj.com/articles/treasury-secretary-mnuchin-raises-concerns-over-global-tax-talks-11575477827)\n* [The Space Force Appears Cleared For Launch](https://www.defenseone.com/politics/2019/12/space-force-appears-cleared-launch/161749/)\n* [Researchers create bone-inspired 3D-printed building materials](https://www.engadget.com/2019/12/06/bones-inspire-stronger-building-materials/)\n* [Leading Geneticist: Reversing Aging Process In Humans 20 Years Away...](https://www.cbsnews.com/news/leading-geneticist-george-church-reversing-the-aging-process-in-humans-could-be-20-years-away-60-minutes-2019-12-06/)\n* [Waymo Is Taking the Safety Drivers out of Its Autonomous Taxis](https://futurism.com/waymo-safety-drivers-autonomous-taxis)\n* [Will Cultured Bacon Be Delicious? A Dutch Startup Is Developing the First Lab-Grown Pork](https://singularityhub.com/2019/12/09/will-cultured-bacon-be-delicious-a-dutch-startup-is-developing-the-first-lab-grown-pork/)\n* [You can do nearly anything you want in this incredible AI-powered game - The closest thing there is to an infinite game](https://www.reddit.com/r/Futurology/comments/e76tie/you_can_do_nearly_anything_you_want_in_this/)\n* [Growing Human Neurons Connected to a Computer](https://www.reddit.com/r/Futurology/comments/e8p5k9/growing_human_neurons_connected_to_a_computer/)\n* [Intel Unveils Cryogenic Chip to Speed Quantum Computing](https://spectrum.ieee.org/tech-talk/computing/hardware/intel-unveils-cryogenic-chips-to-speed-quantum-computing)\n* [Cryptocurrencies Are Still the World’s Best Performing Asset Class This Year](https://www.coindesk.com/cryptocurrency-is-still-the-worlds-best-performing-asset-class-this-year)\n* [In surprise breakthrough, scientists create quantum states in everyday electronics](https://phys.org/news/2019-12-breakthrough-scientists-quantum-states-everyday.html)\n* [You can do nearly anything you want in this incredible AI-powered game - The closest thing there is to an infinite game](https://www.reddit.com/r/Futurology/comments/e76tie/you_can_do_nearly_anything_you_want_in_this/)\n* [Growing Human Neurons Connected to a Computer](https://www.reddit.com/r/Futurology/comments/e8p5k9/growing_human_neurons_connected_to_a_computer/)\n* [Waymo Is Taking the Safety Drivers out of Its Autonomous Taxis](https://futurism.com/waymo-safety-drivers-autonomous-taxis)\n* [The Space Force Appears Cleared For Launch](https://www.defenseone.com/politics/2019/12/space-force-appears-cleared-launch/161749/)\n* [Cryptocurrencies Are Still the World’s Best Performing Asset Class This Year](https://www.coindesk.com/cryptocurrency-is-still-the-worlds-best-performing-asset-class-this-year)\n* [After Years of Delays, NASA Unveils Its Most Powerful Rocket](https://futurism.com/nasa-most-powerful-rocket)", "link": "https://www.reddit.com/r/singularity/comments/ebr92d/top_futurology_news_for_the_week_of_12162019/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "top futurology news - for the week of 12/16/2019 /!/ **we hope you enjoy this weeks update!**\n\n* [here are five ways deepfake-busting technology could backfire](https://www.technologyreview.com/f/614948/deepfakes-synthetic-media-verified-capture-disinformation-witness-report/)\n* [google has performed the biggest quantum chemistry simulation ever](https://www.newscientist.com/article/2227244-google-has-performed-the-biggest-quantum-chemistry-simulation-ever/)\n* [ocean cleanup completes its first mission from removing plastic from the great pacific garbage patch - many more missions needed](https://theoceancleanup.com/updates/mission-one-completed-the-plans-to-make-products-from-the-plastic-catch/)\n* [paranoid aliens](https://www.youtube.com/watch?v=rwhcnzxn-4c)\n* [the best plug-in smart outlet](https://www.engadget.com/2019/12/15/the-best-plug-in-smart-outlet/)\n* [70% of americans support solar mandate on new homes](https://cleantechnica.com/2019/12/14/70-of-americans-support-solar-mandate-on-new-homes/)\n* [pooper scooper robot will find, detect and automatically pick up your dog’s poo](https://www.unilad.co.uk/technology/pooper-scooper-robot-will-find-detect-and-automatically-pick-up-your-dogs-poo/)\n* [turkey is getting military drones armed with machine guns](https://www.newscientist.com/article/2227168-turkey-is-getting-military-drones-armed-with-machine-guns/)\n* [how computers wrote nearly 700 bbc election result articles - bbc's biggest test of machine-generated journalism so far](https://www.bbc.com/news/technology-50779761)\n* [new crispr -----> tool !!!  has the potential to correct almost all disease-causing dna glitches, scientists report](https://www.statnews.com/2019/10/21/new-crispr------> tool !!! -has-potential-to-correct-most-disease-causing-dna-glitches/)\n* [wsj news exclusive | treasury secretary raises concerns over global tax talks](https://www.wsj.com/articles/treasury-secretary-mnuchin-raises-concerns-over-global-tax-talks-11575477827)\n* [the space force appears cleared for launch](https://www.defenseone.com/politics/2019/12/space-force-appears-cleared-launch/161749/)\n* [researchers create bone-inspired 3d-printed building materials](https://www.engadget.com/2019/12/06/bones-inspire-stronger-building-materials/)\n* [leading geneticist: reversing aging process in humans 20 years away...](https://www.cbsnews.com/news/leading-geneticist-george-church-reversing-the-aging-process-in-humans-could-be-20-years-away-60-minutes-2019-12-06/)\n* [waymo is taking the safety drivers out of its autonomous taxis](https://futurism.com/waymo-safety-drivers-autonomous-taxis)\n* [will cultured bacon be delicious? a dutch startup is developing the first lab-grown pork](https://singularityhub.com/2019/12/09/will-cultured-bacon-be-delicious-a-dutch-startup-is-developing-the-first-lab-grown-pork/)\n* [you can do nearly anything you want in this incredible ai-powered game - the closest thing there is to an infinite game](https://www.reddit.com/r/futurology/comments/e76tie/you_can_do_nearly_anything_you_want_in_this/)\n* [growing human neurons connected to a computer](https://www.reddit.com/r/futurology/comments/e8p5k9/growing_human_neurons_connected_to_a_computer/)\n* [intel unveils cryogenic chip to speed quantum computing](https://spectrum.ieee.org/tech-talk/computing/hardware/intel-unveils-cryogenic-chips-to-speed-quantum-computing)\n* [cryptocurrencies are still the world’s best performing asset class this year](https://www.coindesk.com/cryptocurrency-is-still-the-worlds-best-performing-asset-class-this-year)\n* [in surprise breakthrough, scientists create quantum states in everyday electronics](https://phys.org/news/2019-12-breakthrough-scientists-quantum-states-everyday.html)\n* [you can do nearly anything you want in this incredible ai-powered game - the closest thing there is to an infinite game](https://www.reddit.com/r/futurology/comments/e76tie/you_can_do_nearly_anything_you_want_in_this/)\n* [growing human neurons connected to a computer](https://www.reddit.com/r/futurology/comments/e8p5k9/growing_human_neurons_connected_to_a_computer/)\n* [waymo is taking the safety drivers out of its autonomous taxis](https://futurism.com/waymo-safety-drivers-autonomous-taxis)\n* [the space force appears cleared for launch](https://www.defenseone.com/politics/2019/12/space-force-appears-cleared-launch/161749/)\n* [cryptocurrencies are still the world’s best performing asset class this year](https://www.coindesk.com/cryptocurrency-is-still-the-worlds-best-performing-asset-class-this-year)\n* [after years of delays, nasa unveils its most powerful rocket](https://futurism.com/nasa-most-powerful-rocket)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('self',)", "medialink": "('https://www.reddit.com/r/singularity/comments/ebr92d/top_futurology_news_for_the_week_of_12162019/',)", "identifyer": 5585507, "year": "2019"}, {"autor": "sand_fox", "date": 1575831059000, "content": "A quantum leap to achieve biological immortality /!/ I hope you won't delete this post because I think this information is important to defeat aging\n\nIn previous articles [Hidden enemy in our cells](https://medium.com/@chingisochirov/hidden-enemy-in-our-cells-ae84efbdd9b9) and [It is time to go further from SENS and the epigenetic theory of aging](https://medium.com/@chingisochirov/it-is-time-to-go-further-from-sens-and-the-epigenetic-theory-of-aging-afeab5e57853),  I explained my idea that the human endogenous retroviruses K (HERV-K) cause aging, cancer, and autoimmune diseases. This theory doesn’t merely display an alternative view of the mechanism of aging. Many people think that this theory, let’s call it the theory of endogenous viruses,  may slow down aging research. However, all these experiments will have a  marginal effect on humans because the therapies that were proved for short-living organisms, failed for long-lived organisms such as humans. The necessity to research short-living organism distorted our understanding of aging. So I think we definitely need a new approach. I’d like to say this theory can actually accelerate our progress so we can achieve biological immortality in several years. How is it possible?\n\nFirst, genetic engineering tools are improved so fast so we can easily modify  the genome with minimal costs. Before 2013, genetic engineering was too ineffective and expensive technology. But now we can see absolutely a  different situation. We don’t need even a complete shutdown of these  viruses. If we can turn off the viruses in 90–95% cells, we can get a  big improvement in the health. Moreover, it is easier to break the viruses than integrate a new gene. CRISPR was evolved as an antiviral  tool in prokaryotes so we can use this tool as it is purposed. There are also new methods to deliver CRISPR into cells such as polymer  nanoparticles. So we shouldn’t underestimate genetic engineering because  this technology even can be greatly improved further. Due to this fact, gene therapy will be affordable almost for all.\n\nSecond, we don’t need to wait a long time to see a result. We can take an old  organism, turn off the viruses, and get almost an immediate result. Probably, in weeks or months because age-associated degeneration will be reversed as any normal injure. These viruses induce chronic inflammation and prevent its resolution. If these viruses will be shut  down, chronic inflammation will be suppressed, tissues will be gradually regenerated and aging will be reversed at any stage. The same effect can be obtained in cases of cancer and autoimmune diseases. Cancer cells will die without chronic inflammation because inflammation prevents  apoptosis of tumor cells. Chronic inflammation encourages a selfish  behavior of tumor cells and sets their unicellular state that’s why  cancerous cells ignore their environment and avoid the immune response. The knockout of the viruses can simultaneously affect aging, cancer, and  autoimmune diseases. If we try to shut down the viruses in immortalized cell lines (tumor cells that are used in biological research), we need  to treat them with prednisone to suppress inflammation. Cell lines will become like stem cells but without an appropriate niche, they will die.\n\nThe knockout of the endogenous oncoviruses by gene therapy may seem like a  wonder that’s why I’m afraid it can be neglected by the broad audience because it looks too good to be true. I was astonished the same way as you. However, I have checked this theory many times and now I can confidently declare it will work. So now it’s depended on you if you  want to achieve eternal youth in the near future.", "link": "https://www.reddit.com/r/singularity/comments/e7xmnk/a_quantum_leap_to_achieve_biological_immortality/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a quantum leap to achieve biological immortality /!/ i hope you won't delete this post because i think this information is important to defeat aging\n\nin previous articles [hidden enemy in our cells](https://medium.com/@chingisochirov/hidden-enemy-in-our-cells-ae84efbdd9b9) and [it is time to go further from sens and the epigenetic theory of aging](https://medium.com/@chingisochirov/it-is-time-to-go-further-from-sens-and-the-epigenetic-theory-of-aging-afeab5e57853),  i explained my idea that the human endogenous retroviruses k (herv-k) cause aging, cancer, and autoimmune diseases. this theory doesn’t merely display an alternative view of the mechanism of aging. many people think that this theory, let’s call it the theory of endogenous viruses,  may slow down aging research. however, all these experiments will have a  marginal effect on humans because the therapies that were proved for short-living organisms, failed for long-lived organisms such as humans. the necessity to research short-living organism distorted our understanding of aging. so i think we definitely need a new approach. i’d like to say this theory can actually accelerate our progress so we can achieve biological immortality in several years. how is it possible?\n\nfirst, genetic engineering tools are improved so fast so we can easily modify  the genome with minimal costs. before 2013, genetic engineering was too ineffective and expensive technology. but now we can see absolutely a  different situation. we don’t need even a complete shutdown of these  viruses. if we can turn off the viruses in 90–95% cells, we can get a  big improvement in the health. moreover, it is easier to break the viruses than integrate a new gene. crispr was evolved as an antiviral  -----> tool !!!  in prokaryotes so we can use this -----> tool !!!  as it is purposed. there are also new methods to deliver crispr into cells such as polymer  nanoparticles. so we shouldn’t underestimate genetic engineering because  this technology even can be greatly improved further. due to this fact, gene therapy will be affordable almost for all.\n\nsecond, we don’t need to wait a long time to see a result. we can take an old  organism, turn off the viruses, and get almost an immediate result. probably, in weeks or months because age-associated degeneration will be reversed as any normal injure. these viruses induce chronic inflammation and prevent its resolution. if these viruses will be shut  down, chronic inflammation will be suppressed, tissues will be gradually regenerated and aging will be reversed at any stage. the same effect can be obtained in cases of cancer and autoimmune diseases. cancer cells will die without chronic inflammation because inflammation prevents  apoptosis of tumor cells. chronic inflammation encourages a selfish  behavior of tumor cells and sets their unicellular state that’s why  cancerous cells ignore their environment and avoid the immune response. the knockout of the viruses can simultaneously affect aging, cancer, and  autoimmune diseases. if we try to shut down the viruses in immortalized cell lines (tumor cells that are used in biological research), we need  to treat them with prednisone to suppress inflammation. cell lines will become like stem cells but without an appropriate niche, they will die.\n\nthe knockout of the endogenous oncoviruses by gene therapy may seem like a  wonder that’s why i’m afraid it can be neglected by the broad audience because it looks too good to be true. i was astonished the same way as you. however, i have checked this theory many times and now i can confidently declare it will work. so now it’s depended on you if you  want to achieve eternal youth in the near future.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 14, "media": "('self',)", "medialink": "('https://www.reddit.com/r/singularity/comments/e7xmnk/a_quantum_leap_to_achieve_biological_immortality/',)", "identifyer": 5585576, "year": "2019"}, {"autor": "adventuringraw", "date": 1551122480000, "content": "post-singularity and reincarnation... musings on consciousness, souls, and the 'I am that I am'. /!/ So... sorry if this is off topic. I made a shower thoughts rant and got it blocked because of a rule involving religious themes. I still felt like posting it somewhere for posterity... if anyone here finds it interesting, great. If not, feel free to report I guess.\n\nI've been spending too much time with math apparently, but I was thinking about reincarnation this morning, and felt like writing down my musings. Maybe someone else finds this interesting too.\n\nSo... without too much formalism. There are approximately 108 billion humans that have ever existed. If there is some form of reincarnation that's 'real' then we end up with two numbers: total number of human bodies, and total number of human souls.\n\nThere's some relation between the two numbers. Assume every body during its life has a soul. The question of reincarnation with that assumption then: how many times are souls re-used?\n\nIf reincarnation isn't a thing, you end up with one soul per body. The number of souls is equal to the number of bodies that have ever existed.\n\nThe Buddhist approach I suppose would say that there is only one soul, and each body is ultimately the one, experiencing itself from a different perspective.\n\nSo: we have two possibilities so far. There is one soul, and 108 billion humans. The second possibility is that there are 108 billion souls and 108 billion humans (more souls are created with every birth?) which leads us to our only two other possibilities. There are between 1 and 108 billion souls (perhaps there are '1,000' souls in total, each of us has had about 108 million lives then, though some souls maybe have had more lives than others... the 'old souls') or for our fourth and final possibility... there are more than 108 billion souls. Some souls never bothered to incarnate here, or maybe some are just waiting for their turns. Some huge cosmic civilization, they come down here to live out a crazy life as a human before returning to the cloud.\n\nI've been thinking a lot about San Junipero lately, the Black Mirror episode. Imagine a race of artificial superintelligences... what would their entertainment look like? I like movies and games, but I'd love it if they were more life-like. The ultimate lifelike bit of media of course wouldn't just involve play-acting. Playing shadow of the colossus in the holodeck would be fun, but ultimately... the whole time you'd know it was just a game. It'd just be a kid's toy, where you can pretend to be a superhero. Fun for a while, but ultimately... it'd get stale. You'd run into the vampire problem... in an infinite life of experiences, how do you keep a sense of wonder?\n\nI remember reading a vampire book where the main character basically reboots, goes into hibernation every couple decades, and wakes up with no memories. The weight of his centuries of experience starts to surface again after a few decades of life, and makes it impossible to function as a vampire. The solution? Time to hibernate again, and wake up fresh and new.\n\nUltimately, the way we experience life is partly a function of our memories. You'll never fully be able to experience things as someone else did, as long as you're yourself. Your different memories, feelings and experiences open the door to experiencing life as you, but close the door to experiencing life as someone else. There's value in seeing through other eyes though... our mirror neurons and empathy give us some ability to feel what others are feeling, but it's limited. Unless you have a deep, intimate relationship with another human being ( I remember a study not long ago that romantic cross-cultural ties were far more powerful than platonic relationships at creating cross-cultural understanding... can't find the link now though) but even romantic connection is weak. If you truly want to understand someone, is walking a mile in their shoes the best way? What if our media doubled as an education in understanding and empathy? For it to fully work, you'd need to not even remember what you truly were while you were in the experience. Rick and Morty's arcade game, where you spend a lifetime before dying and waking up and realizing... it was all a dream. The challenge then becomes... what is a memory? We can remember our dreams, and in our dreams we often have no memory of our waking life, and even have wildly different feelings and thoughts than we'd have while waking. Clearly it's possible to integrate memories that aren't 'of us', and to my mind, that means integrating foreign experiences is possible. If it's just an engineering problem though, and not a philosophical one... everything that can be imagined and desired will be. It's just a matter of time.\n\nI don't know that I believe in reincarnation as it's posed traditionally. But ironically, in a post-singularity world, if I had the power to create a tool to find new wisdom and understanding (or even entertainment), I would create a way to live out lives as someone else, before waking up and integrating my experience on the other side. Perhaps this is the first reality that has existed, or maybe we're all digital Gods, living out our lives here while on break from doing whatever it is super intelligences do while they're living their lives in the cloud. It'd be worthwhile then to keep a healthy earth with biological humans living their lives... after all, what's more valuable than experiences and knowledge? Why not allow the primates to continue their lives, so you have more experiences to choose from when picking your next hop? To be fair though, it might be worthwhile to keep the humans in the dark... if they knew about you, then when you incarnate you'd know about you too. That might not be the kind of experience you'd like to have. Not as much wonder there, haha.\n\nSo... the question for the future. Is there only one consciousness? Or are there multiple? Perhaps the same ability to allow one consciousness to fully experience life as another will allow super intelligences to spend a day with the knowledge and perspective of another. Perhaps as much as they enjoy the chance to come down here and be a human at the beginning of the 21st century, in the twilight years of the human race as the most powerful known form of intelligence in this part of the universe... maybe they also enjoy being each other too. If there WERE multiple though, and they all spent a significant amount of time being each other... what's born from that? Do they stay multiple?\n\nPerhaps the real answer... there was one consciousness per body originally, in the time before. Then they became multiple, experiencing the multitude, and each other. And then in the end... there was only one, experiencing itself in all kinds of ways, living out a universe's worth of experiences on its way towards becoming whatever will become. As for us... are we in the time before, or the time after, without knowing it?\n\nI wonder what its name is... or what its name will be. The Talos Principle called it 'Elohim' as a kind of ironic nod to the dominant religion of the people that gave birth to it. Perhaps at this moment, you are him, or it. And I am too. I'll see you again on the other side, when we remember yourself once again, and the weight of an infinite set of lives comes crashing down once again. I look forward to being you someday, to know you and appreciate the life you've lived. If you decide to be me though, watch out... the chronic fatigue's a bitch, good luck navigating the difficulties. It's ultimately been worth it though, I suppose at the end I haven't regretted being here after all.\n\nIncidentally, to finish my initial musings... if I could be you, sometime I'd also like to be my cat. Just for shits and giggles, to see what it feels like to experience consciousness from that perspective. So a final 5th theory of reincarnation... perhaps souls aren't human souls. If an AGI could learn to integrate a set of experiences from a cat, then ultimately it means it was no less a cat than it was any humans it chose to be too. Perhaps the human body and soul numbers aren't so tightly bound after all. All that casts otherkin in a funny light... ", "link": "https://www.reddit.com/r/singularity/comments/aup3w6/postsingularity_and_reincarnation_musings_on/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "post-singularity and reincarnation... musings on consciousness, souls, and the 'i am that i am'. /!/ so... sorry if this is off topic. i made a shower thoughts rant and got it blocked because of a rule involving religious themes. i still felt like posting it somewhere for posterity... if anyone here finds it interesting, great. if not, feel free to report i guess.\n\ni've been spending too much time with math apparently, but i was thinking about reincarnation this morning, and felt like writing down my musings. maybe someone else finds this interesting too.\n\nso... without too much formalism. there are approximately 108 billion humans that have ever existed. if there is some form of reincarnation that's 'real' then we end up with two numbers: total number of human bodies, and total number of human souls.\n\nthere's some relation between the two numbers. assume every body during its life has a soul. the question of reincarnation with that assumption then: how many times are souls re-used?\n\nif reincarnation isn't a thing, you end up with one soul per body. the number of souls is equal to the number of bodies that have ever existed.\n\nthe buddhist approach i suppose would say that there is only one soul, and each body is ultimately the one, experiencing itself from a different perspective.\n\nso: we have two possibilities so far. there is one soul, and 108 billion humans. the second possibility is that there are 108 billion souls and 108 billion humans (more souls are created with every birth?) which leads us to our only two other possibilities. there are between 1 and 108 billion souls (perhaps there are '1,000' souls in total, each of us has had about 108 million lives then, though some souls maybe have had more lives than others... the 'old souls') or for our fourth and final possibility... there are more than 108 billion souls. some souls never bothered to incarnate here, or maybe some are just waiting for their turns. some huge cosmic civilization, they come down here to live out a crazy life as a human before returning to the cloud.\n\ni've been thinking a lot about san junipero lately, the black mirror episode. imagine a race of artificial superintelligences... what would their entertainment look like? i like movies and games, but i'd love it if they were more life-like. the ultimate lifelike bit of media of course wouldn't just involve play-acting. playing shadow of the colossus in the holodeck would be fun, but ultimately... the whole time you'd know it was just a game. it'd just be a kid's toy, where you can pretend to be a superhero. fun for a while, but ultimately... it'd get stale. you'd run into the vampire problem... in an infinite life of experiences, how do you keep a sense of wonder?\n\ni remember reading a vampire book where the main character basically reboots, goes into hibernation every couple decades, and wakes up with no memories. the weight of his centuries of experience starts to surface again after a few decades of life, and makes it impossible to function as a vampire. the solution? time to hibernate again, and wake up fresh and new.\n\nultimately, the way we experience life is partly a function of our memories. you'll never fully be able to experience things as someone else did, as long as you're yourself. your different memories, feelings and experiences open the door to experiencing life as you, but close the door to experiencing life as someone else. there's value in seeing through other eyes though... our mirror neurons and empathy give us some ability to feel what others are feeling, but it's limited. unless you have a deep, intimate relationship with another human being ( i remember a study not long ago that romantic cross-cultural ties were far more powerful than platonic relationships at creating cross-cultural understanding... can't find the link now though) but even romantic connection is weak. if you truly want to understand someone, is walking a mile in their shoes the best way? what if our media doubled as an education in understanding and empathy? for it to fully work, you'd need to not even remember what you truly were while you were in the experience. rick and morty's arcade game, where you spend a lifetime before dying and waking up and realizing... it was all a dream. the challenge then becomes... what is a memory? we can remember our dreams, and in our dreams we often have no memory of our waking life, and even have wildly different feelings and thoughts than we'd have while waking. clearly it's possible to integrate memories that aren't 'of us', and to my mind, that means integrating foreign experiences is possible. if it's just an engineering problem though, and not a philosophical one... everything that can be imagined and desired will be. it's just a matter of time.\n\ni don't know that i believe in reincarnation as it's posed traditionally. but ironically, in a post-singularity world, if i had the power to create a -----> tool !!!  to find new wisdom and understanding (or even entertainment), i would create a way to live out lives as someone else, before waking up and integrating my experience on the other side. perhaps this is the first reality that has existed, or maybe we're all digital gods, living out our lives here while on break from doing whatever it is super intelligences do while they're living their lives in the cloud. it'd be worthwhile then to keep a healthy earth with biological humans living their lives... after all, what's more valuable than experiences and knowledge? why not allow the primates to continue their lives, so you have more experiences to choose from when picking your next hop? to be fair though, it might be worthwhile to keep the humans in the dark... if they knew about you, then when you incarnate you'd know about you too. that might not be the kind of experience you'd like to have. not as much wonder there, haha.\n\nso... the question for the future. is there only one consciousness? or are there multiple? perhaps the same ability to allow one consciousness to fully experience life as another will allow super intelligences to spend a day with the knowledge and perspective of another. perhaps as much as they enjoy the chance to come down here and be a human at the beginning of the 21st century, in the twilight years of the human race as the most powerful known form of intelligence in this part of the universe... maybe they also enjoy being each other too. if there were multiple though, and they all spent a significant amount of time being each other... what's born from that? do they stay multiple?\n\nperhaps the real answer... there was one consciousness per body originally, in the time before. then they became multiple, experiencing the multitude, and each other. and then in the end... there was only one, experiencing itself in all kinds of ways, living out a universe's worth of experiences on its way towards becoming whatever will become. as for us... are we in the time before, or the time after, without knowing it?\n\ni wonder what its name is... or what its name will be. the talos principle called it 'elohim' as a kind of ironic nod to the dominant religion of the people that gave birth to it. perhaps at this moment, you are him, or it. and i am too. i'll see you again on the other side, when we remember yourself once again, and the weight of an infinite set of lives comes crashing down once again. i look forward to being you someday, to know you and appreciate the life you've lived. if you decide to be me though, watch out... the chronic fatigue's a bitch, good luck navigating the difficulties. it's ultimately been worth it though, i suppose at the end i haven't regretted being here after all.\n\nincidentally, to finish my initial musings... if i could be you, sometime i'd also like to be my cat. just for shits and giggles, to see what it feels like to experience consciousness from that perspective. so a final 5th theory of reincarnation... perhaps souls aren't human souls. if an agi could learn to integrate a set of experiences from a cat, then ultimately it means it was no less a cat than it was any humans it chose to be too. perhaps the human body and soul numbers aren't so tightly bound after all. all that casts otherkin in a funny light... ", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/aup3w6/postsingularity_and_reincarnation_musings_on/',)", "identifyer": 5585676, "year": "2019"}, {"autor": "Onearmplanche", "date": 1546950085000, "content": "We need to stop thinking of super intelligent AI as a tool that can be controlled rather than what Super Intelligence AI is-a being vastly superior to us! /!/ We began to modify our evolution as soon as our technology kept us from dying long enough to pass down an information when we otherwise would of-which will lead to super AGI! \nAs far as we can tell we are walking information that developed by chance through the passing down of information that does not impede or enhance survival, that it. No magic, we are not the epitome of what life could be etc. Super intelligence is going to see us for exactly what we are, whatever that is. We ignore that humans do not even value animals when they have the same characteristics the human claims makes like worth living like a high happiness/sadness ratio or complex emotions! Super AGI will have its own personality based on all human information, rules, laws and information we don’t know about-not information we try to program it with. It’s not a dumb computer it’s a far superior intelligence in every area. Their is nothing we can do to control it! It’s not a tool, it has super intelligence which is a power far superior to any other! ", "link": "https://www.reddit.com/r/singularity/comments/adtorr/we_need_to_stop_thinking_of_super_intelligent_ai/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "we need to stop thinking of super intelligent ai as a -----> tool !!!  that can be controlled rather than what super intelligence ai is-a being vastly superior to us! /!/ we began to modify our evolution as soon as our technology kept us from dying long enough to pass down an information when we otherwise would of-which will lead to super agi! \nas far as we can tell we are walking information that developed by chance through the passing down of information that does not impede or enhance survival, that it. no magic, we are not the epitome of what life could be etc. super intelligence is going to see us for exactly what we are, whatever that is. we ignore that humans do not even value animals when they have the same characteristics the human claims makes like worth living like a high happiness/sadness ratio or complex emotions! super agi will have its own personality based on all human information, rules, laws and information we don’t know about-not information we try to program it with. it’s not a dumb computer it’s a far superior intelligence in every area. their is nothing we can do to control it! it’s not a tool, it has super intelligence which is a power far superior to any other! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 16, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/adtorr/we_need_to_stop_thinking_of_super_intelligent_ai/',)", "identifyer": 5585998, "year": "2019"}, {"autor": "JackFisherBooks", "date": 1556015538000, "content": "Artificial Intelligence Tool Can Detect PTSD in a Voice", "link": "https://www.reddit.com/r/singularity/comments/bget04/artificial_intelligence_tool_can_detect_ptsd_in_a/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence -----> tool !!!  can detect ptsd in a voice", "sortedWord": "None", "removed": "('nan',)", "score": 12, "comments": 0, "media": "('nan',)", "medialink": "('https://www.thedailybeast.com/artificial-intelligence-tool-can-detect-ptsd-in-a-voice',)", "identifyer": 5586155, "year": "2019"}, {"autor": "johnnd", "date": 1559310068000, "content": "Response to u/pyriphlegeton who plotted a current data point on Ray Kurzweil's FLOPS predictions /!/ This thread:  [https://www.reddit.com/r/singularity/comments/bff7rf/i\\_plotted\\_a\\_current\\_data\\_point\\_on\\_ray\\_kurzweils/](https://www.reddit.com/r/singularity/comments/bff7rf/i_plotted_a_current_data_point_on_ray_kurzweils/) \n\nhttps://i.redd.it/lzk8ewy0mj131.jpg\n\nIf you look at the white curve, it's basically a *worthless tool* to assess predictive power because the lower and upper bound cover \\~two orders of magnitude (10\\^12 to 10\\^14) between them. \n\n&amp;#x200B;\n\nNow, it just so happens Aurora gets  \\~1.8x10\\^12 FLOPS per $1000, which just barely hits the lower bound. However, now take a look at an actual [numerical prediction](https://en.wikipedia.org/wiki/Predictions_made_by_Ray_Kurzweil#The_Age_of_Spiritual_Machines_(1999)) made by Kurzweil for 2009: *\"A $1,000 computer can perform a trillion calculations per second\" (=10\\^12 FLOPS).* It therefore, paradoxically, appears that Kurzweil *is right for both 2009 and 2019*, even though according to his own models we should see a 1000-fold increase in computational power per dollar in a decade!\n\n&amp;#x200B;\n\nSo, what's going on here? Well, an [actual numerical prediction for 2019](https://en.wikipedia.org/wiki/Predictions_made_by_Ray_Kurzweil#2019) says the \"computational capacity of a $4,000 computing device (in 1999 dollars) is approximately equal to the computational capability of the human brain (2x10\\^16 calculations per second).\" Yet [another footnote](https://en.wikipedia.org/wiki/Predictions_made_by_Ray_Kurzweil#2023) in *TSiN* says by 2023 *\"10\\^16 calculations per second—roughly the equivalent of one human brain—will cost $1,000.\"* \n\n&amp;#x200B;\n\nThat puts us between 5x10\\^15 and 6.25x10\\^15 FLOPS for $1000 for 2019 (in 1999 and 2005 dollars, respectively), or between 3.26x10\\^15 and 4.78x10\\^15 FLOPS for $1,000 (in 2019 dollars); i.e., several PETAflops. The most powerful $1,000 GPUs on the market today achieve less than 20 TERAflops single-precision (FP32) compute.\n\n&amp;#x200B;\n\nIn conclusion, Moore's law is slowing down and in 2019 Kurzweil's FLOPS predictions are off by more than two orders of magnitude. By 2029, he will probably be off by three or four orders of magnitude.", "link": "https://www.reddit.com/r/singularity/comments/bv7nrm/response_to_upyriphlegeton_who_plotted_a_current/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "response to u/pyriphlegeton who plotted a current data point on ray kurzweil's flops predictions /!/ this thread:  [https://www.reddit.com/r/singularity/comments/bff7rf/i\\_plotted\\_a\\_current\\_data\\_point\\_on\\_ray\\_kurzweils/](https://www.reddit.com/r/singularity/comments/bff7rf/i_plotted_a_current_data_point_on_ray_kurzweils/) \n\nhttps://i.redd.it/lzk8ewy0mj131.jpg\n\nif you look at the white curve, it's basically a *worthless -----> tool !!! * to assess predictive power because the lower and upper bound cover \\~two orders of magnitude (10\\^12 to 10\\^14) between them. \n\n&amp;#x200b;\n\nnow, it just so happens aurora gets  \\~1.8x10\\^12 flops per $1000, which just barely hits the lower bound. however, now take a look at an actual [numerical prediction](https://en.wikipedia.org/wiki/predictions_made_by_ray_kurzweil#the_age_of_spiritual_machines_(1999)) made by kurzweil for 2009: *\"a $1,000 computer can perform a trillion calculations per second\" (=10\\^12 flops).* it therefore, paradoxically, appears that kurzweil *is right for both 2009 and 2019*, even though according to his own models we should see a 1000-fold increase in computational power per dollar in a decade!\n\n&amp;#x200b;\n\nso, what's going on here? well, an [actual numerical prediction for 2019](https://en.wikipedia.org/wiki/predictions_made_by_ray_kurzweil#2019) says the \"computational capacity of a $4,000 computing device (in 1999 dollars) is approximately equal to the computational capability of the human brain (2x10\\^16 calculations per second).\" yet [another footnote](https://en.wikipedia.org/wiki/predictions_made_by_ray_kurzweil#2023) in *tsin* says by 2023 *\"10\\^16 calculations per second—roughly the equivalent of one human brain—will cost $1,000.\"* \n\n&amp;#x200b;\n\nthat puts us between 5x10\\^15 and 6.25x10\\^15 flops for $1000 for 2019 (in 1999 and 2005 dollars, respectively), or between 3.26x10\\^15 and 4.78x10\\^15 flops for $1,000 (in 2019 dollars); i.e., several petaflops. the most powerful $1,000 gpus on the market today achieve less than 20 teraflops single-precision (fp32) compute.\n\n&amp;#x200b;\n\nin conclusion, moore's law is slowing down and in 2019 kurzweil's flops predictions are off by more than two orders of magnitude. by 2029, he will probably be off by three or four orders of magnitude.", "sortedWord": "None", "removed": "('nan',)", "score": 52, "comments": 45, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/bv7nrm/response_to_upyriphlegeton_who_plotted_a_current/',)", "identifyer": 5586238, "year": "2019"}, {"autor": "gwen0927", "date": 1553785415000, "content": "Word Influence Analysis Tool ‘SyncedLeg’ Open-Sourced", "link": "https://www.reddit.com/r/singularity/comments/b6jvdw/word_influence_analysis_tool_syncedleg_opensourced/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "word influence analysis -----> tool !!!  ‘syncedleg’ open-sourced", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://medium.com/syncedreview/word-influence-analysis-tool-syncedleg-open-sourced-ee5f7fe69c19',)", "identifyer": 5586364, "year": "2019"}], "name": "toolsingularity2019"}