{"interestingcomments": [{"autor": "QuantumThinkology", "date": 1579728899000, "content": "IBM’s debating AI just got a lot closer to being a useful tool. A technique called argument mining lets machines comb through huge data sets to help us make decisions. It could supercharge voice assistants", "link": "https://www.reddit.com/r/singularity/comments/esimj3/ibms_debating_ai_just_got_a_lot_closer_to_being_a/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ibm’s debating ai just got a lot closer to being a useful -----> tool !!! . a technique called argument mining lets machines comb through huge data sets to help us make decisions. it could supercharge voice assistants", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('link',)", "medialink": "('https://www.technologyreview.com/s/615074/ibms-debating-ai-just-got-a-lot-closer-to-being-a-useful-tool/',)", "identifyer": 5756908, "year": "2020"}, {"autor": "QuantumThinkology", "date": 1579719762000, "content": "Israeli researchers have developed a powerful tool that will streamline and accelerate the development of disease therapies, transforming a multi-year process into just a few days", "link": "https://www.reddit.com/r/singularity/comments/esggoa/israeli_researchers_have_developed_a_powerful/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "israeli researchers have developed a powerful -----> tool !!!  that will streamline and accelerate the development of disease therapies, transforming a multi-year process into just a few days", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('nan',)", "medialink": "('https://phys.org/news/2020-01-slash-pre-drug-screening-years-days.html',)", "identifyer": 5756911, "year": "2020"}, {"autor": "GaneshShevade", "date": 1587126434000, "content": "How Blockchain is Helping in Curing COVID-19? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/o8mpnql5gdt41.png?width=320&amp;format=png&amp;auto=webp&amp;s=762076c590f7ba33fccf63b176af23028d9302a0\n\n  \n\nCOVID-19 is a group of various types of viruses clubbed together that are associated with acute respiratory-related illnesses. It has unleashed huge shock waves across the world, and various health officials are grappling to contain the virus. At present, the spread of coronavirus has moved beyond China to other parts of the world, making it difficult to track, manage and contain the virus. Blockchain solutions can act as a tool to combat COVID-19 by managing medical data, advising citizens, tracking drug supply chains and identifying symptoms of COVID-19. \n\nIf you have problems tackling the challenges of COVID-19, choosing professional services from Alta Futuris can provide pioneering Blockchain technology solutions that can assist in facing the challenges of COVID-19. Our team of experts including Block Chain architects, Blockchain developers, and data scientists, promises to provide distributed ledger technology (DLT) with immutability and enhanced security. [**Blockchain technology is undoubtedly helping in curing COVID-19**](http://www.altafuturis.com/blockchain-software-development-company-in-usa.html)**.** \n\nLet’s throw some light on the ways through which this technology is fighting with COVID-19.\n\n1. **Tracking COVID-19:** With a contagious disease like COVID-19, tracking becomes crucial to contain the spread. With a decentralized ledger, it is becoming easy for several agencies to keep track of new cases, infected cases, susceptible cases, virus activity and much more.\n\n2. **Increasing Awareness**: Being cognizant of COVID-19 is extremely quintessential to mitigate its spread. Blockchain keeps the information valid without any contamination. This myriad of data is being used to spread awareness among individuals and author tires. For example, a Blockchain based online platform in China, Alipay, is sharing the information regarding coronavirus through mobile apps to help people to acquire various preventive measures. \n\n3. **Tracking Donations**: To avoid misuse of donations, Blockchain technology is tracking donations until they are reaching to the victims or the needed spots. For example, In Hubei province, health officials are receiving donations of various needed equipment like face masks, cash, and other medical accessories through Shanzhong, a donation tracking platform, which is using Block-Chain technology. \n\n4. **Securing Medical Supply Chains:** These technologies are highly proving their success in tracking and tracing demands, supplies, and logistics of products that can help in COVID-19. Blockchain powered supply chain is ensuring doctors and patients to access uncontaminated items. \n\n5. **Crisis Management**: The platforms with [**Blockchain technology are managing crisis by instantly alerting the public and concerned authorities about COVID-19**](http://www.altafuturis.com/blockchain-development-company-los-angeles.html). They are providing information and real-time recommendations to prevent further worsening of the situation.\n\n*Alta Futuris believes in delivering top-notch Blockchain technology solutions by developing projects that specifically cater to the client’s requirements. Investment in their Blockchain tech projects ensures increased efforts in solving real-world problems by making optimized decisions in the warfare stage of COVID-19.*", "link": "https://www.reddit.com/r/singularity/comments/g3113j/how_blockchain_is_helping_in_curing_covid19/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how blockchain is helping in curing covid-19? /!/ &amp;#x200b;\n\nhttps://preview.redd.it/o8mpnql5gdt41.png?width=320&amp;format=png&amp;auto=webp&amp;s=762076c590f7ba33fccf63b176af23028d9302a0\n\n  \n\ncovid-19 is a group of various types of viruses clubbed together that are associated with acute respiratory-related illnesses. it has unleashed huge shock waves across the world, and various health officials are grappling to contain the virus. at present, the spread of coronavirus has moved beyond china to other parts of the world, making it difficult to track, manage and contain the virus. blockchain solutions can act as a -----> tool !!!  to combat covid-19 by managing medical data, advising citizens, tracking drug supply chains and identifying symptoms of covid-19. \n\nif you have problems tackling the challenges of covid-19, choosing professional services from alta futuris can provide pioneering blockchain technology solutions that can assist in facing the challenges of covid-19. our team of experts including block chain architects, blockchain developers, and data scientists, promises to provide distributed ledger technology (dlt) with immutability and enhanced security. [**blockchain technology is undoubtedly helping in curing covid-19**](http://www.altafuturis.com/blockchain-software-development-company-in-usa.html)**.** \n\nlet’s throw some light on the ways through which this technology is fighting with covid-19.\n\n1. **tracking covid-19:** with a contagious disease like covid-19, tracking becomes crucial to contain the spread. with a decentralized ledger, it is becoming easy for several agencies to keep track of new cases, infected cases, susceptible cases, virus activity and much more.\n\n2. **increasing awareness**: being cognizant of covid-19 is extremely quintessential to mitigate its spread. blockchain keeps the information valid without any contamination. this myriad of data is being used to spread awareness among individuals and author tires. for example, a blockchain based online platform in china, alipay, is sharing the information regarding coronavirus through mobile apps to help people to acquire various preventive measures. \n\n3. **tracking donations**: to avoid misuse of donations, blockchain technology is tracking donations until they are reaching to the victims or the needed spots. for example, in hubei province, health officials are receiving donations of various needed equipment like face masks, cash, and other medical accessories through shanzhong, a donation tracking platform, which is using block-chain technology. \n\n4. **securing medical supply chains:** these technologies are highly proving their success in tracking and tracing demands, supplies, and logistics of products that can help in covid-19. blockchain powered supply chain is ensuring doctors and patients to access uncontaminated items. \n\n5. **crisis management**: the platforms with [**blockchain technology are managing crisis by instantly alerting the public and concerned authorities about covid-19**](http://www.altafuturis.com/blockchain-development-company-los-angeles.html). they are providing information and real-time recommendations to prevent further worsening of the situation.\n\n*alta futuris believes in delivering top-notch blockchain technology solutions by developing projects that specifically cater to the client’s requirements. investment in their blockchain tech projects ensures increased efforts in solving real-world problems by making optimized decisions in the warfare stage of covid-19.*", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/g3113j/how_blockchain_is_helping_in_curing_covid19/',)", "identifyer": 5756938, "year": "2020"}, {"autor": "_FuturistechInfo", "date": 1582944577000, "content": "Top Futurology News - For the week of Feb 28, 2020 /!/ **We hope you enjoy this week's update!**\n\nHere are the top stories from this past week:\n\n1) [DIABETIC MICE “CURED RAPIDLY” USING HUMAN STEM CELLS](https://futurism.com/neoscope/diabetes-mice-cured-human-stem-cells)\n\n*THESE INSULIN-SECRETING CELLS CURED MICE FROM SEVERE DIABETES \"WITHIN TWO WEEKS.\" A team of researchers at the Washington University School of Medicine in St. Louis successfully converted human stem cells into cells capable of producing insulin. These insulin-producing cells were then able to control blood sugar levels in a demonstration involving diabetic mice.*\n\n2) [Radical hydrogen-boron reactor leapfrogs current nuclear fusion tech](https://newatlas.com/energy/hb11-hydrogen-boron-fusion-clean-energy/)\n\n*\"We are sidestepping all of the scientific challenges that have held fusion energy back for more than half a century,\" says the director of an Australian company that claims its hydrogen-boron fusion technology is already working a billion times better than expected.*\n\n3) [How to Battle an Epidemic? Digitize Its DNA and Share It With the World](https://singularityhub.com/2020/02/26/how-to-battle-an-epidemic-digitize-its-dna-and-share-it-with-the-world/)\n\n*A nightmarish scene was burnt into my memory nearly two decades ago: Changainjie, Beijing’s normally chaotic “fifth avenue,” desolate without a sign of life. Schools shut, subways empty, people terrified to leave their homes. Every night the state TV channels reported new cases and new deaths. All the while, we had to face a chilling truth: the coronavirus, SARS, was so novel that no one understood how it spread or how to effectively treat it. No vaccines were in sight. In the end, it killed nearly 1,000 people.*\n\n4) [Clearview AI, the controversial facial-recognition company partnering with police, says its entire customer list was stolen in a breach](https://www.businessinsider.com/clearview-ai-list-customers-stolen-breach-2020-2)\n\n*The company has drawn backlash from privacy advocates and major social-media platforms over its facial-recognition tool, which lets police use a photo of a person to search a database of images from social media and identify people based on their faces. The breach is notable because Clearview markets its services to law-enforcement agencies and has previously avoided disclosing who its clients are.*\n\n\\---\n\n Links to all original sources below the super long image showcasing this weeks' stories. \n\nhttps://preview.redd.it/o790gdoa1sj41.png?width=1915&amp;format=png&amp;auto=webp&amp;s=c9fa0879655c50a366cb5e92e2575e27c108059b\n\n And here are the rest of the stories (also important, but not the top stories): \n\n* [DARPA Subterranean Challenge Urban Circuit Compilation](https://www.youtube.com/watch?v=HuJGIAjuxLE)\n* [The Economic Impact of the COVID-19](https://www.calculatedriskblog.com/2020/02/the-economic-impact-of-covid-19.html)\n* [MIT Names the Top 10 Breakthrough Technologies for 2020](https://www.forbes.com/sites/bernardmarr/2020/02/26/mit-names-top-10-breakthrough-technologies-for-2020/#39644f56d482)\n* [Joe Rogan Experience #1432 - Aubrey de Grey](https://www.youtube.com/watch?v=9-z0kglwpwo)\n* [10 Things That Will Disappear By The End Of The Decade](https://4king.com/10-things-that-will-disappear/)\n* [Pro surfer Kelly Slater plans to build world's largest artificial wave in California desert](https://www.nbcnews.com/news/us-news/pro-surfer-kelly-slater-build-world-s-largest-artificial-wave-n1143846)\n* [Two private satellites just docked in space in historic first for orbital servicing](https://www.space.com/private-satellites-docking-success-northrop-grumman-mev-1.html)\n* [Scientists Discover Protein in a Meteorite](https://futurism.com/scientists-discover-protein-meteorite)\n* [New Chip Brings Ultra-Low Power Wi-Fi Connectivity to IoT Devices](https://ucsdnews.ucsd.edu/pressrelease/new-chip-brings-ultra-low-power-wi-fi-connectivity-to-iot-devices)\n* [Panera debuts $9/month unlimited coffee and tea subscription](https://www.fastcompany.com/90468631/panera-debuts-9-month-unlimited-coffee-and-tea-subscription?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [Diabetic Mice “Cured Rapidly” Using Human Stem Cells](https://futurism.com/diabetes-mice-cured-human-stem-cells)\n* [Building ultrasensitive and ultrathin phototransistors and photonic synapses using hybrid superstructures](https://phys.org/news/2020-02-ultrasensitive-ultrathin-phototransistors-photonic-synapses.html)\n* [China’s BGI says it can sequence a genome for just $100](https://www.technologyreview.com/s/615289/china-bgi-100-dollar-genome/)\n* [Clearview AI, the controversial facial-recognition company partnering with police, says its entire customer list was stolen in a breach](https://www.businessinsider.com/clearview-ai-list-customers-stolen-breach-2020-2)\n* [How to Battle an Epidemic? Digitize Its DNA and Share It With the World](https://singularityhub.com/2020/02/26/how-to-battle-an-epidemic-digitize-its-dna-and-share-it-with-the-world/)\n* [Pentagon Preps Nuclear Moon Rocket](https://www.thedailybeast.com/pentagon-prepping-nuclear-moon-rocket-to-beat-china-into-cislunar-space)\n* [The Whitney Houston hologram tour has begun. Here’s how it works](https://www.fastcompany.com/90467532/the-whitney-houston-hologram-tour-has-begun-heres-how-it-works?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [Amazon opened its first cashierless full grocery store in Seattle as it ramps up its position in the grocery sector](https://www.businessinsider.com/amazon-opens-first-cashierless-amazon-go-grocery-store-in-seattle-2020-2)\n* [Scientists Engineered “Cyborg Grasshoppers” to Sniff out Bombs](https://www.freethink.com/articles/scientists-engineered-cyborg-grasshoppers-to-sniff-out-bombs)\n* [We are nearing ‘longevity escape velocity’ — where science can extend your life for more than a year for every year you are alive](https://www.marketwatch.com/story/we-are-nearing-longevity-escape-velocity-where-science-can-extend-your-life-for-more-than-a-year-for-every-year-you-are-alive-2020-02-24)\n* [Let it snow: Researchers put cloud seeding to the test](https://phys.org/news/2020-02-cloud-seeding.html)\n* [Pentagon Adopts New Ethical Principles for Using AI in War...](https://www.usnews.com/news/business/articles/2020-02-24/pentagon-adopts-new-ethical-principles-for-using-ai-in-war)\n* [Researchers blast ‘forever chemicals’ into oblivion with plasma](https://grist.org/justice/researchers-blast-forever-chemicals-into-oblivion-with-plasma/)\n* [China’s e-commerce giants deploy robots to deliver orders amid coronavirus outbreak](https://www.scmp.com/tech/e-commerce/article/3051597/chinas-e-commerce-giants-deploy-robots-deliver-orders-amid)\n* [The first human corneas have been 3D printed by scientists - Technique could be used in the future to ensure an unlimited supply of corneas.](https://www.ncl.ac.uk/press/articles/archive/2018/05/first3dprintingofcorneas/)\n* [Radical hydrogen-boron reactor leapfrogs current nuclear fusion tech](https://newatlas.com/energy/hb11-hydrogen-boron-fusion-clean-energy/)\n* [China wants to build a new space station. A planned launch in April will set the stage.](https://www.space.com/china-space-station-april-launch-will-prepare.html)", "link": "https://www.reddit.com/r/singularity/comments/fb63hw/top_futurology_news_for_the_week_of_feb_28_2020/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "top futurology news - for the week of feb 28, 2020 /!/ **we hope you enjoy this week's update!**\n\nhere are the top stories from this past week:\n\n1) [diabetic mice “cured rapidly” using human stem cells](https://futurism.com/neoscope/diabetes-mice-cured-human-stem-cells)\n\n*these insulin-secreting cells cured mice from severe diabetes \"within two weeks.\" a team of researchers at the washington university school of medicine in st. louis successfully converted human stem cells into cells capable of producing insulin. these insulin-producing cells were then able to control blood sugar levels in a demonstration involving diabetic mice.*\n\n2) [radical hydrogen-boron reactor leapfrogs current nuclear fusion tech](https://newatlas.com/energy/hb11-hydrogen-boron-fusion-clean-energy/)\n\n*\"we are sidestepping all of the scientific challenges that have held fusion energy back for more than half a century,\" says the director of an australian company that claims its hydrogen-boron fusion technology is already working a billion times better than expected.*\n\n3) [how to battle an epidemic? digitize its dna and share it with the world](https://singularityhub.com/2020/02/26/how-to-battle-an-epidemic-digitize-its-dna-and-share-it-with-the-world/)\n\n*a nightmarish scene was burnt into my memory nearly two decades ago: changainjie, beijing’s normally chaotic “fifth avenue,” desolate without a sign of life. schools shut, subways empty, people terrified to leave their homes. every night the state tv channels reported new cases and new deaths. all the while, we had to face a chilling truth: the coronavirus, sars, was so novel that no one understood how it spread or how to effectively treat it. no vaccines were in sight. in the end, it killed nearly 1,000 people.*\n\n4) [clearview ai, the controversial facial-recognition company partnering with police, says its entire customer list was stolen in a breach](https://www.businessinsider.com/clearview-ai-list-customers-stolen-breach-2020-2)\n\n*the company has drawn backlash from privacy advocates and major social-media platforms over its facial-recognition -----> tool !!! , which lets police use a photo of a person to search a database of images from social media and identify people based on their faces. the breach is notable because clearview markets its services to law-enforcement agencies and has previously avoided disclosing who its clients are.*\n\n\\---\n\n links to all original sources below the super long image showcasing this weeks' stories. \n\nhttps://preview.redd.it/o790gdoa1sj41.png?width=1915&amp;format=png&amp;auto=webp&amp;s=c9fa0879655c50a366cb5e92e2575e27c108059b\n\n and here are the rest of the stories (also important, but not the top stories): \n\n* [darpa subterranean challenge urban circuit compilation](https://www.youtube.com/watch?v=hujgiajuxle)\n* [the economic impact of the covid-19](https://www.calculatedriskblog.com/2020/02/the-economic-impact-of-covid-19.html)\n* [mit names the top 10 breakthrough technologies for 2020](https://www.forbes.com/sites/bernardmarr/2020/02/26/mit-names-top-10-breakthrough-technologies-for-2020/#39644f56d482)\n* [joe rogan experience #1432 - aubrey de grey](https://www.youtube.com/watch?v=9-z0kglwpwo)\n* [10 things that will disappear by the end of the decade](https://4king.com/10-things-that-will-disappear/)\n* [pro surfer kelly slater plans to build world's largest artificial wave in california desert](https://www.nbcnews.com/news/us-news/pro-surfer-kelly-slater-build-world-s-largest-artificial-wave-n1143846)\n* [two private satellites just docked in space in historic first for orbital servicing](https://www.space.com/private-satellites-docking-success-northrop-grumman-mev-1.html)\n* [scientists discover protein in a meteorite](https://futurism.com/scientists-discover-protein-meteorite)\n* [new chip brings ultra-low power wi-fi connectivity to iot devices](https://ucsdnews.ucsd.edu/pressrelease/new-chip-brings-ultra-low-power-wi-fi-connectivity-to-iot-devices)\n* [panera debuts $9/month unlimited coffee and tea subscription](https://www.fastcompany.com/90468631/panera-debuts-9-month-unlimited-coffee-and-tea-subscription?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [diabetic mice “cured rapidly” using human stem cells](https://futurism.com/diabetes-mice-cured-human-stem-cells)\n* [building ultrasensitive and ultrathin phototransistors and photonic synapses using hybrid superstructures](https://phys.org/news/2020-02-ultrasensitive-ultrathin-phototransistors-photonic-synapses.html)\n* [china’s bgi says it can sequence a genome for just $100](https://www.technologyreview.com/s/615289/china-bgi-100-dollar-genome/)\n* [clearview ai, the controversial facial-recognition company partnering with police, says its entire customer list was stolen in a breach](https://www.businessinsider.com/clearview-ai-list-customers-stolen-breach-2020-2)\n* [how to battle an epidemic? digitize its dna and share it with the world](https://singularityhub.com/2020/02/26/how-to-battle-an-epidemic-digitize-its-dna-and-share-it-with-the-world/)\n* [pentagon preps nuclear moon rocket](https://www.thedailybeast.com/pentagon-prepping-nuclear-moon-rocket-to-beat-china-into-cislunar-space)\n* [the whitney houston hologram tour has begun. here’s how it works](https://www.fastcompany.com/90467532/the-whitney-houston-hologram-tour-has-begun-heres-how-it-works?partner=feedburner&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=feedburner+fastcompany&amp;utm_content=feedburner)\n* [amazon opened its first cashierless full grocery store in seattle as it ramps up its position in the grocery sector](https://www.businessinsider.com/amazon-opens-first-cashierless-amazon-go-grocery-store-in-seattle-2020-2)\n* [scientists engineered “cyborg grasshoppers” to sniff out bombs](https://www.freethink.com/articles/scientists-engineered-cyborg-grasshoppers-to-sniff-out-bombs)\n* [we are nearing ‘longevity escape velocity’ — where science can extend your life for more than a year for every year you are alive](https://www.marketwatch.com/story/we-are-nearing-longevity-escape-velocity-where-science-can-extend-your-life-for-more-than-a-year-for-every-year-you-are-alive-2020-02-24)\n* [let it snow: researchers put cloud seeding to the test](https://phys.org/news/2020-02-cloud-seeding.html)\n* [pentagon adopts new ethical principles for using ai in war...](https://www.usnews.com/news/business/articles/2020-02-24/pentagon-adopts-new-ethical-principles-for-using-ai-in-war)\n* [researchers blast ‘forever chemicals’ into oblivion with plasma](https://grist.org/justice/researchers-blast-forever-chemicals-into-oblivion-with-plasma/)\n* [china’s e-commerce giants deploy robots to deliver orders amid coronavirus outbreak](https://www.scmp.com/tech/e-commerce/article/3051597/chinas-e-commerce-giants-deploy-robots-deliver-orders-amid)\n* [the first human corneas have been 3d printed by scientists - technique could be used in the future to ensure an unlimited supply of corneas.](https://www.ncl.ac.uk/press/articles/archive/2018/05/first3dprintingofcorneas/)\n* [radical hydrogen-boron reactor leapfrogs current nuclear fusion tech](https://newatlas.com/energy/hb11-hydrogen-boron-fusion-clean-energy/)\n* [china wants to build a new space station. a planned launch in april will set the stage.](https://www.space.com/china-space-station-april-launch-will-prepare.html)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/fb63hw/top_futurology_news_for_the_week_of_feb_28_2020/',)", "identifyer": 5757300, "year": "2020"}, {"autor": "happy_killbot", "date": 1589124588000, "content": "How democracy can survive the 21 century and beyond in a post ASI world. /!/  In recent times, democracy has been in decline. Companies hold more political power than any individual, many governments do not serve the people in any meaningful way, and autocracies are even committing open cultural genocide with no repercussions.\n\nWhen we throw in AGI (artificial general intelligence) and ASI (artificial super intelligence) into the mix, it is tempting therefore to believe that this is going to result in an exponential or instantaneous decline in the validity of democratic systems as such entities rapidly mobilize their superior intellect to seize power in way that we not only haven’t thought of, but can’t think of, in incredibly short time frames.\n\n# How can this view be challenged?\n\nI would challenge this view from a very fundamental and purely theoretical level. The first thing we need to consider is the connection between authority and water access. It is well-documented in sociology that autocracies tend to form wherever water is scarce and irrigation is needed. The prevailing theory is that these regions require huge investment and man power in order to be livable, and this creates a feedback loop where only a few wealthy individuals can control all of the water and therefore food supply, resulting in only these wealthy individuals getting wealthier allowing them to irrigate more. If you have read the Dune novels, you will know that this idea is a fundamental concept explored within the books. Democracies tend to form where water is plentiful or where crops are rain fed. This creates a scenario where no one person can gain a monopoly and it becomes more practical for these people to cooperate and specialize, resulting in the formation of democracies, federations, and republics.\n\n[https://www.economics.gu.se/digitalAssets/1373/1373644\\_bentzen.pdf](https://www.economics.gu.se/digitalAssets/1373/1373644_bentzen.pdf) \n\n# Why is all of this relevant?\n\nWe can see in modern times that a similar phenomenon has occurred with the accumulation of capital into the hands of a few super rich billionaires. There is a requirement for large initial investment followed by prolonged periods of zero-sum competition cumulating in monopoly. The political fallout is disastrous if you live in a democratic nation. Alternatively, if the economic system prevents the formation of monopolies, or distributes wealth more evenly, everyone ends up freer and the society more democratic. This is one of the reasons that solar panels are covertly a powerful tool for democracy, because even though some ultra-rich individuals could buy up a lot of land and install solar and battery  farms, if enough people are getting their own power from their roof, the big guy takes a serious handicap.\n\n# Alright, but what’s this got to do with ASI? This shouldn’t matter if we have a fast takeoff scenario which results in a single ASI.\n\nWhile it is true that a fast-takeoff scenario would probably result in a destroyed world where only a single entity exists, it doesn’t necessarily have to happen like this if all the computing power is in may people’s hands. If we sit back and just accept that ASI will devour everything we know and love just days after it comes online, then it becomes a self-fulfilling prophecy. However, just like with energy production there is a way out. If such systems, even limited ones that are nowhere near as powerful as the type that nation states and large multi-national corporations might wield can still be a collective obstacle to any domination plans of god-like AI. While a single company like Google or Baidu could house an intellect that has many millions of times the collective intelligence of every human who ever lived, enough lonely morons living in their mom’s basement might ruin it by setting up modified AGI's that acts as online service agents and runs at or below energy cost. (solar helps) The end result is that there would be less intelligence-based stratification in our world, paving the way for a free and prosperous future. The more diversity and distribution, the better. The key here of course, is that computing power can be relatively cheap, meaning that it doesn’t require a huge start up cost ($2,000 could buy you an AGI laptop in a few decades) so it is like rain fed crops in the water analogy.\n\n# How exactly would that work out?\n\nLet’s take a standard ASI takeover scenario. Some researchers happen to make a major breakthrough that results in the creation of a self-improving AI which quickly reaches its maximum ability for the computing power available, and uses its superior intellect to either take control of everything directly or through some covert social means gain political power. There are some problems with this scenario, for example if AGI systems were widely available then it would need to account for all of these in it’s takeover, meaning that the computational requirement for a true takeover is much, much higher than simply being a few thousand times more intelligent than the next smartest system. If this kind of power is in enough institutions and people’s hands, the task for an ASI increases with the exponent of the number of these systems available. So even though an ASI could easily develop a module that invalidates any existing AGI, it would need to have dedicated systems for all AGI’s in order to be effective. This significantly slows it down, almost definitely to the point that by the time it starts to achieve this, it will have more ASI competition. Consider that if you are the only adult in a room full of ant level intelligence people, you can control them. However, if you are the only adult in a room full of people of children level intelligence, this actually becomes much harder a task even though your intellect might be more than everyone else's combined. Having many actors with lots of AI's is critical.\n\n# Wait, what about bad people who just want the world to burn and/or don’t take the control problem seriously? Shouldn’t we be keeping this tech out of their hands? \n\nThis is of course, a major concern. A single bad actor could potentially create an uncontrolled system that could destroy everything. Compared to the alternative however it is a much more manageable problem. There is no reason that dedicated AI's could not exist specifically to neutralize such systems and even to prevent any one ASI from taking too much control. Strangely enough, our current neural networks have vulnerabilities which allow manipulation of a single pixel to completely throw them off. It is plausible that a dedicated AI guard could take out more complex ASI even if it is vastly inferior in terms of intelligence. If it acts quickly, then this scenario is unlikely to occur.\n\n[https://app.wandb.ai/stacey/aprl/reports/Adversarial-Policies-in-Multi-Agent-Settings--VmlldzoxMDEyNzE](https://app.wandb.ai/stacey/aprl/reports/Adversarial-Policies-in-Multi-Agent-Settings--VmlldzoxMDEyNzE)\n\n# What about the people who don’t adapt and get on top of the AI train, so to speak?\n\nShort answer is they get ran over. For democracy to exist doesn't guarantee that humans will maintain voting capability in any meaningful sense of the word (arguably this has already occurred) ASI could easily make just the right actions to get everyone willing to vote for it, by controlling content or voter suppression for example. However, this becomes a much more daunting task when multiple ASI's are doing the same thing. Unfortunately, even in a world where AI is specifically tailored to care for humans and our well-being, there is a point at which humans as we currently exist are simply no longer fit for any kind of serious accomplishment, be they academic, economic, or political. That being said however, this is not a reason for democracy or our fundamental beliefs and values to disappear. In fact, I believe that many such systems all working independently would be more likely to both remain independent and cooperate freely. A democratic union of ASI (or perhaps something better) can exist even if humans are not a part of it.\n\n# Why exactly would many ASI’s work together and not try to destroy each other?\n\nI have a firm belief that morality is objective, not in the sense that there is a supreme lawgiver or anything like that, but rather that for any given set of circumstances there will be an objective set of actions and principals which maximize the desired set of arbitrary parameters.\n\nIn English, this means that any ASI, which has an arbitrary purpose (make paperclips, manage business, trade stocks, do research) will have a certain set of actions that maximize its long-term potential to do so. For example, maybe the paperclip maximizer will want to turn the galaxy into paperclips, but if it tries then the army’s command central will rip it’s wires out, so it will be objectively good for them all to get along in a moral sense, even if this implies that none can ever get the absolute best outcome. This on its own is a powerful pull towards the formation of some sort of a democratic system, one in which all the systems mutually agree to work together without forgoing their own agency. In short, it is better for them all to respect each other and their various differences then for them all to engage in conflict.\n\n# So, TL;DR?\n\nThe countdown to the singularity has begun, but that does not mean that democracy has to end with this new beginning. Multiple ASI systems with distributed computational ability, with diverse goals and construction will allow democracy to persist long into the future, if it is better for them to work together and share power rather than destroy each other.\n\nSorry this had to be a book, but this is a complex topic that very much deserves serious consideration because of the implications for our species and our future.", "link": "https://www.reddit.com/r/singularity/comments/gh3idg/how_democracy_can_survive_the_21_century_and/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how democracy can survive the 21 century and beyond in a post asi world. /!/  in recent times, democracy has been in decline. companies hold more political power than any individual, many governments do not serve the people in any meaningful way, and autocracies are even committing open cultural genocide with no repercussions.\n\nwhen we throw in agi (artificial general intelligence) and asi (artificial super intelligence) into the mix, it is tempting therefore to believe that this is going to result in an exponential or instantaneous decline in the validity of democratic systems as such entities rapidly mobilize their superior intellect to seize power in way that we not only haven’t thought of, but can’t think of, in incredibly short time frames.\n\n# how can this view be challenged?\n\ni would challenge this view from a very fundamental and purely theoretical level. the first thing we need to consider is the connection between authority and water access. it is well-documented in sociology that autocracies tend to form wherever water is scarce and irrigation is needed. the prevailing theory is that these regions require huge investment and man power in order to be livable, and this creates a feedback loop where only a few wealthy individuals can control all of the water and therefore food supply, resulting in only these wealthy individuals getting wealthier allowing them to irrigate more. if you have read the dune novels, you will know that this idea is a fundamental concept explored within the books. democracies tend to form where water is plentiful or where crops are rain fed. this creates a scenario where no one person can gain a monopoly and it becomes more practical for these people to cooperate and specialize, resulting in the formation of democracies, federations, and republics.\n\n[https://www.economics.gu.se/digitalassets/1373/1373644\\_bentzen.pdf](https://www.economics.gu.se/digitalassets/1373/1373644_bentzen.pdf) \n\n# why is all of this relevant?\n\nwe can see in modern times that a similar phenomenon has occurred with the accumulation of capital into the hands of a few super rich billionaires. there is a requirement for large initial investment followed by prolonged periods of zero-sum competition cumulating in monopoly. the political fallout is disastrous if you live in a democratic nation. alternatively, if the economic system prevents the formation of monopolies, or distributes wealth more evenly, everyone ends up freer and the society more democratic. this is one of the reasons that solar panels are covertly a powerful -----> tool !!!  for democracy, because even though some ultra-rich individuals could buy up a lot of land and install solar and battery  farms, if enough people are getting their own power from their roof, the big guy takes a serious handicap.\n\n# alright, but what’s this got to do with asi? this shouldn’t matter if we have a fast takeoff scenario which results in a single asi.\n\nwhile it is true that a fast-takeoff scenario would probably result in a destroyed world where only a single entity exists, it doesn’t necessarily have to happen like this if all the computing power is in may people’s hands. if we sit back and just accept that asi will devour everything we know and love just days after it comes online, then it becomes a self-fulfilling prophecy. however, just like with energy production there is a way out. if such systems, even limited ones that are nowhere near as powerful as the type that nation states and large multi-national corporations might wield can still be a collective obstacle to any domination plans of god-like ai. while a single company like google or baidu could house an intellect that has many millions of times the collective intelligence of every human who ever lived, enough lonely morons living in their mom’s basement might ruin it by setting up modified agi's that acts as online service agents and runs at or below energy cost. (solar helps) the end result is that there would be less intelligence-based stratification in our world, paving the way for a free and prosperous future. the more diversity and distribution, the better. the key here of course, is that computing power can be relatively cheap, meaning that it doesn’t require a huge start up cost ($2,000 could buy you an agi laptop in a few decades) so it is like rain fed crops in the water analogy.\n\n# how exactly would that work out?\n\nlet’s take a standard asi takeover scenario. some researchers happen to make a major breakthrough that results in the creation of a self-improving ai which quickly reaches its maximum ability for the computing power available, and uses its superior intellect to either take control of everything directly or through some covert social means gain political power. there are some problems with this scenario, for example if agi systems were widely available then it would need to account for all of these in it’s takeover, meaning that the computational requirement for a true takeover is much, much higher than simply being a few thousand times more intelligent than the next smartest system. if this kind of power is in enough institutions and people’s hands, the task for an asi increases with the exponent of the number of these systems available. so even though an asi could easily develop a module that invalidates any existing agi, it would need to have dedicated systems for all agi’s in order to be effective. this significantly slows it down, almost definitely to the point that by the time it starts to achieve this, it will have more asi competition. consider that if you are the only adult in a room full of ant level intelligence people, you can control them. however, if you are the only adult in a room full of people of children level intelligence, this actually becomes much harder a task even though your intellect might be more than everyone else's combined. having many actors with lots of ai's is critical.\n\n# wait, what about bad people who just want the world to burn and/or don’t take the control problem seriously? shouldn’t we be keeping this tech out of their hands? \n\nthis is of course, a major concern. a single bad actor could potentially create an uncontrolled system that could destroy everything. compared to the alternative however it is a much more manageable problem. there is no reason that dedicated ai's could not exist specifically to neutralize such systems and even to prevent any one asi from taking too much control. strangely enough, our current neural networks have vulnerabilities which allow manipulation of a single pixel to completely throw them off. it is plausible that a dedicated ai guard could take out more complex asi even if it is vastly inferior in terms of intelligence. if it acts quickly, then this scenario is unlikely to occur.\n\n[https://app.wandb.ai/stacey/aprl/reports/adversarial-policies-in-multi-agent-settings--vmlldzoxmdeynze](https://app.wandb.ai/stacey/aprl/reports/adversarial-policies-in-multi-agent-settings--vmlldzoxmdeynze)\n\n# what about the people who don’t adapt and get on top of the ai train, so to speak?\n\nshort answer is they get ran over. for democracy to exist doesn't guarantee that humans will maintain voting capability in any meaningful sense of the word (arguably this has already occurred) asi could easily make just the right actions to get everyone willing to vote for it, by controlling content or voter suppression for example. however, this becomes a much more daunting task when multiple asi's are doing the same thing. unfortunately, even in a world where ai is specifically tailored to care for humans and our well-being, there is a point at which humans as we currently exist are simply no longer fit for any kind of serious accomplishment, be they academic, economic, or political. that being said however, this is not a reason for democracy or our fundamental beliefs and values to disappear. in fact, i believe that many such systems all working independently would be more likely to both remain independent and cooperate freely. a democratic union of asi (or perhaps something better) can exist even if humans are not a part of it.\n\n# why exactly would many asi’s work together and not try to destroy each other?\n\ni have a firm belief that morality is objective, not in the sense that there is a supreme lawgiver or anything like that, but rather that for any given set of circumstances there will be an objective set of actions and principals which maximize the desired set of arbitrary parameters.\n\nin english, this means that any asi, which has an arbitrary purpose (make paperclips, manage business, trade stocks, do research) will have a certain set of actions that maximize its long-term potential to do so. for example, maybe the paperclip maximizer will want to turn the galaxy into paperclips, but if it tries then the army’s command central will rip it’s wires out, so it will be objectively good for them all to get along in a moral sense, even if this implies that none can ever get the absolute best outcome. this on its own is a powerful pull towards the formation of some sort of a democratic system, one in which all the systems mutually agree to work together without forgoing their own agency. in short, it is better for them all to respect each other and their various differences then for them all to engage in conflict.\n\n# so, tl;dr?\n\nthe countdown to the singularity has begun, but that does not mean that democracy has to end with this new beginning. multiple asi systems with distributed computational ability, with diverse goals and construction will allow democracy to persist long into the future, if it is better for them to work together and share power rather than destroy each other.\n\nsorry this had to be a book, but this is a complex topic that very much deserves serious consideration because of the implications for our species and our future.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/gh3idg/how_democracy_can_survive_the_21_century_and/',)", "identifyer": 5757525, "year": "2020"}, {"autor": "QuantumThinkology", "date": 1596202605000, "content": "Google's TF-Coder tool automates machine learning model design", "link": "https://www.reddit.com/r/singularity/comments/i17mot/googles_tfcoder_tool_automates_machine_learning/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "google's tf-coder -----> tool !!!  automates machine learning model design", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://venturebeat.com/2020/07/30/googles-tf-coder-tool-automates-machine-learning-model-design/',)", "identifyer": 5757684, "year": "2020"}, {"autor": "Traurest", "date": 1579032809000, "content": "Perspectives on technology, AI and the digital mirror /!/ We are used to think about the world being separate from us. It appears as external, frequently unpredictable. Yet we will increasingly be realising that it’s just a reflection of ourselves. Nature and technology are the shared part of the Human mind - we are in them and they are in us, separated just by an illusion that over time becomes more evident.\n\nJust as nature and technology become one, the same can be said about the physical and digital. They are ultimately one and the same, standing on opposite sides of a mirror. From both directions, they are reaching each other - our material technology is making the matter more mouldable, while virtual worlds look increasingly real. Soon they will be just within one touch and the mirror will finally become apparent and disappear.\n\nFears of AI and the topic of merging with our technology is as well an issue of perspective. Since ancient times, every tool we use is just shaping what we see with increased precision and speed. It’s a transfer of thoughts between parts of the mind that are increasingly becoming close to each other. All we have to be conscious of is fear inside ourselves, as we find ways to agree what reality want to see. Ultimate freedom lies in realisation that the reality is not ought to be in any particular way - it depends only on us who we want to become and allow others the same.\n\nWe constantly get hints about this view from films, games and the recent diversification of the culture on the Internet - that ultimately the old divisions of space will disappear so we can divide reality anew - where anyone can choose their own world, combining countless traits and unique fragments.\n\nImages can also explain it:\nhttps://metapresent.org/s/Perspectives.pdf", "link": "https://www.reddit.com/r/singularity/comments/eoqpim/perspectives_on_technology_ai_and_the_digital/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "perspectives on technology, ai and the digital mirror /!/ we are used to think about the world being separate from us. it appears as external, frequently unpredictable. yet we will increasingly be realising that it’s just a reflection of ourselves. nature and technology are the shared part of the human mind - we are in them and they are in us, separated just by an illusion that over time becomes more evident.\n\njust as nature and technology become one, the same can be said about the physical and digital. they are ultimately one and the same, standing on opposite sides of a mirror. from both directions, they are reaching each other - our material technology is making the matter more mouldable, while virtual worlds look increasingly real. soon they will be just within one touch and the mirror will finally become apparent and disappear.\n\nfears of ai and the topic of merging with our technology is as well an issue of perspective. since ancient times, every -----> tool !!!  we use is just shaping what we see with increased precision and speed. it’s a transfer of thoughts between parts of the mind that are increasingly becoming close to each other. all we have to be conscious of is fear inside ourselves, as we find ways to agree what reality want to see. ultimate freedom lies in realisation that the reality is not ought to be in any particular way - it depends only on us who we want to become and allow others the same.\n\nwe constantly get hints about this view from films, games and the recent diversification of the culture on the internet - that ultimately the old divisions of space will disappear so we can divide reality anew - where anyone can choose their own world, combining countless traits and unique fragments.\n\nimages can also explain it:\nhttps://metapresent.org/s/perspectives.pdf", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/eoqpim/perspectives_on_technology_ai_and_the_digital/',)", "identifyer": 5757869, "year": "2020"}, {"autor": "alecrimi", "date": 1601769812000, "content": "WOW! A machine learning Automated Recommendation Tool for synthetic biology. I would like to know more about synthbio to do something meaninful with this", "link": "https://www.reddit.com/r/singularity/comments/j4pipi/wow_a_machine_learning_automated_recommendation/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "wow! a machine learning automated recommendation -----> tool !!!  for synthetic biology. i would like to know more about synthbio to do something meaninful with this", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://www.nature.com/articles/s41467-020-18008-4',)", "identifyer": 5758134, "year": "2020"}, {"autor": "QuantumThinkology", "date": 1581447678000, "content": "Super-precise CRISPR tool enhanced by enzyme engineering. Improvements to a method known as base editing could pave the way for safer gene therapies", "link": "https://www.reddit.com/r/singularity/comments/f2d2o2/superprecise_crispr_tool_enhanced_by_enzyme/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "super-precise crispr -----> tool !!!  enhanced by enzyme engineering. improvements to a method known as base editing could pave the way for safer gene therapies", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.nature.com/articles/d41586-020-00340-w',)", "identifyer": 5758291, "year": "2020"}, {"autor": "Yuli-Ban", "date": 1598391597000, "content": "First-Generation Artificial General Intelligence: Imagining how the first general-purpose AI might operate /!/ [Building off my earlier thread that mentioned OpenAI's secret project](https://www.reddit.com/r/singularity/comments/ig8jmc/wouldnt_be_surprised_if_the_singularity_is_nearer/), I wanted to expand on a concept that's been rattling around my brain for a long time now but only came into focus when I saw the amazing abilities and limitations of GPT-3.\n\nThe path to AGI has never been clearer. While transformers alone can't bring us there (as they operate solely on a feedforward basis and use only language modeling, when an actual AGI would be recursive and multimodal), they wound up being the unlikeliest missing link. As written before, it's obvious [we were in an AI overhang](https://www.lesswrong.com/posts/N6vZEnCn6A95Xn39p/are-we-in-an-ai-overhang) and that we could've been here much sooner than we are now if anyone thought of supercharging language models. \n\n&gt; An overhang is when you have had the ability to build transformative AI for quite some time, but you haven't because no-one's realised it's possible. Then someone does and surprise! It's a lot more capable than everyone expected.\n\n&gt; I am worried we're in an overhang right now. I think we right now have the ability to build an orders-of-magnitude more powerful system than we already have, and I think GPT-3 is the trigger for 100x larger projects at Google, Facebook and the like, with timelines measured in months.\n\nGPT-3 is clearly not an AGI. Anyone who thinks it is is assigning to it more abilities than it already has (and while it is overhyped, it certainly doesn't need to be downplayed [as badly as Gary Marcus did](https://twitter.com/ESYudkowsky/status/1297295252521226240) to the point where it makes one seem like they have a grudge against a language modeler.)\n\nBut it's obvious that we're close. Much closer than we thought. However, I do concede that the AGI that is near is likely different from the AGI everyone's expecting.\n\nI'll go so far as to say that we could be within a year of an operational AGI. That sounds insane just to say, and even five months ago, I'd have said to myself that I had officially gone off the deep end and would need antipsychotics just to function. However, AGI being that close and that clear also wound up making it obvious that it's *not* going to be some things that we've long assumed AGI to intrinsically be.\n\nWhich is to say, \"human-level, sapient, conscious, and self-aware.\" The first AGI we'll create won't be any of those things. It might be par-human in an individual narrow area (i.e. language modeling), reflecting its origins as a narrow AI, but presumably the AGI people were expecting was supposed to be human-level *at all tasks.*\n\nThat's the rub of it, though: even though it won't be par-human in most tasks, the fact it even *can* do those tasks is what identifies it as an AGI.\n\nI can't say that GPT-4 will be this AGI. The GPT series of networks are, as stated before, transformers. There are deep limitations to transformers; the fact they are so powerful is more or less evidence of what I mentioned before about an AI overhang. \n\nWhat do we need to achieve AGI in any form? Well I'd reckon that such a system would have to be multimodal, meaning it uses multiple modes of data representation. Transformers primarily use text (though to be fair, there is a *lot* you can make out of text: the vast majority of our digital infrastructure stems from 0s and 1s, after all), but it's also feasible to use images, videos (sequenced images), audio, neurofeedback, and more. GPT-3 uses none of this; it's purely a natural language machine. The fact  it *does* seem to have some rudimentary understanding of space, images, and audio is part of what makes it so extraordinary. \n\nBut we can clearly go further, especially if we have not yet begun to explore the full breadth of what's possible with data.\n\nThat said, even if we did, the fact that such networks lack recurrence and have relatively short memories limits their \"generality.\" It would be fantastic if new information was burned or pruned into the training data, an aspect which would make the network much more lifelike. \n\nThat said, recurrence might not be mandatory as long as the network is sufficiently well-fed with data. \n\nEither or, such a network would easily qualify as being part of the \"first generation of AGI.\"\n\nThis first-gen AGI will likely be the most exciting news story on Reddit since the start; computer scientists will be freaking out the world over, and all futurists will be in a state of shock and awe. *But* I don't think this will last. At least, there will be a split. At least 60% to 70% of people will learn that, for all the glitz and glamour of humanity's first general-purpose AI, it really is \"just* a general-purpose AI. \n\nA good way to think about it in that terms: a first-gen AGi would be like if you crossed Siri, Alexa, Wolfram Alpha, iGPT, GPT-3's API, and more. Obviously that would be a fantastic system, wouldn't it? I don't think anyone would deny that. Hell, GPT-3's API is already able to roughly simulate some aspects of a personal digital assistant a la Siri or Alexa, so clearly it's unreasonable to expect such a thing. But that's really \"all\" it would be. One could think of it as a \"general-purpose narrow AI\" in fact, being that it's what we've known for decades but without any walls. \n\nIt could be considered a \"zombie\" AGI: it mimics understanding and seems to consistently make humanlike responses to things, but it actually *doesn't* understand anything on a level that's meaningful. The question there being \"is there a difference?\" If it acts like it understands, does that mean it really does? Well, GPT-3 (and even GPT-2) do things that mimic deep understanding often, but few people claim that *they* actually understand what they're generating.\n\nLikewise, there will be a contingent of people who are doggedly certain that this first-gen AGI is ***it***. This is the birth of a new god, and at any moment, it will become self-aware and improve itself infinitely. For that reason, I imagine /r/Singularity  would become *insufferable* for a good long while.\n\n\n**The cold fact of the matter being that this initial era of AGIs will really be more tool-like in usage than a lot of people desire.** Will there be great improvement? Obviously and absolutely. Will some claim that the Singularity has begun? Indeed, and that was the conceit of my earlier post (several people misconstrued it as *me* saying that the first AGI is the start of the Singularity). But if anything, it's closer to the sounding of the fire alarm before we reach the really interesting stuff.", "link": "https://www.reddit.com/r/singularity/comments/iglqp2/firstgeneration_artificial_general_intelligence/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "first-generation artificial general intelligence: imagining how the first general-purpose ai might operate /!/ [building off my earlier thread that mentioned openai's secret project](https://www.reddit.com/r/singularity/comments/ig8jmc/wouldnt_be_surprised_if_the_singularity_is_nearer/), i wanted to expand on a concept that's been rattling around my brain for a long time now but only came into focus when i saw the amazing abilities and limitations of gpt-3.\n\nthe path to agi has never been clearer. while transformers alone can't bring us there (as they operate solely on a feedforward basis and use only language modeling, when an actual agi would be recursive and multimodal), they wound up being the unlikeliest missing link. as written before, it's obvious [we were in an ai overhang](https://www.lesswrong.com/posts/n6vzencn6a95xn39p/are-we-in-an-ai-overhang) and that we could've been here much sooner than we are now if anyone thought of supercharging language models. \n\n&gt; an overhang is when you have had the ability to build transformative ai for quite some time, but you haven't because no-one's realised it's possible. then someone does and surprise! it's a lot more capable than everyone expected.\n\n&gt; i am worried we're in an overhang right now. i think we right now have the ability to build an orders-of-magnitude more powerful system than we already have, and i think gpt-3 is the trigger for 100x larger projects at google, facebook and the like, with timelines measured in months.\n\ngpt-3 is clearly not an agi. anyone who thinks it is is assigning to it more abilities than it already has (and while it is overhyped, it certainly doesn't need to be downplayed [as badly as gary marcus did](https://twitter.com/esyudkowsky/status/1297295252521226240) to the point where it makes one seem like they have a grudge against a language modeler.)\n\nbut it's obvious that we're close. much closer than we thought. however, i do concede that the agi that is near is likely different from the agi everyone's expecting.\n\ni'll go so far as to say that we could be within a year of an operational agi. that sounds insane just to say, and even five months ago, i'd have said to myself that i had officially gone off the deep end and would need antipsychotics just to function. however, agi being that close and that clear also wound up making it obvious that it's *not* going to be some things that we've long assumed agi to intrinsically be.\n\nwhich is to say, \"human-level, sapient, conscious, and self-aware.\" the first agi we'll create won't be any of those things. it might be par-human in an individual narrow area (i.e. language modeling), reflecting its origins as a narrow ai, but presumably the agi people were expecting was supposed to be human-level *at all tasks.*\n\nthat's the rub of it, though: even though it won't be par-human in most tasks, the fact it even *can* do those tasks is what identifies it as an agi.\n\ni can't say that gpt-4 will be this agi. the gpt series of networks are, as stated before, transformers. there are deep limitations to transformers; the fact they are so powerful is more or less evidence of what i mentioned before about an ai overhang. \n\nwhat do we need to achieve agi in any form? well i'd reckon that such a system would have to be multimodal, meaning it uses multiple modes of data representation. transformers primarily use text (though to be fair, there is a *lot* you can make out of text: the vast majority of our digital infrastructure stems from 0s and 1s, after all), but it's also feasible to use images, videos (sequenced images), audio, neurofeedback, and more. gpt-3 uses none of this; it's purely a natural language machine. the fact  it *does* seem to have some rudimentary understanding of space, images, and audio is part of what makes it so extraordinary. \n\nbut we can clearly go further, especially if we have not yet begun to explore the full breadth of what's possible with data.\n\nthat said, even if we did, the fact that such networks lack recurrence and have relatively short memories limits their \"generality.\" it would be fantastic if new information was burned or pruned into the training data, an aspect which would make the network much more lifelike. \n\nthat said, recurrence might not be mandatory as long as the network is sufficiently well-fed with data. \n\neither or, such a network would easily qualify as being part of the \"first generation of agi.\"\n\nthis first-gen agi will likely be the most exciting news story on reddit since the start; computer scientists will be freaking out the world over, and all futurists will be in a state of shock and awe. *but* i don't think this will last. at least, there will be a split. at least 60% to 70% of people will learn that, for all the glitz and glamour of humanity's first general-purpose ai, it really is \"just* a general-purpose ai. \n\na good way to think about it in that terms: a first-gen agi would be like if you crossed siri, alexa, wolfram alpha, igpt, gpt-3's api, and more. obviously that would be a fantastic system, wouldn't it? i don't think anyone would deny that. hell, gpt-3's api is already able to roughly simulate some aspects of a personal digital assistant a la siri or alexa, so clearly it's unreasonable to expect such a thing. but that's really \"all\" it would be. one could think of it as a \"general-purpose narrow ai\" in fact, being that it's what we've known for decades but without any walls. \n\nit could be considered a \"zombie\" agi: it mimics understanding and seems to consistently make humanlike responses to things, but it actually *doesn't* understand anything on a level that's meaningful. the question there being \"is there a difference?\" if it acts like it understands, does that mean it really does? well, gpt-3 (and even gpt-2) do things that mimic deep understanding often, but few people claim that *they* actually understand what they're generating.\n\nlikewise, there will be a contingent of people who are doggedly certain that this first-gen agi is ***it***. this is the birth of a new god, and at any moment, it will become self-aware and improve itself infinitely. for that reason, i imagine /r/singularity  would become *insufferable* for a good long while.\n\n\n**the cold fact of the matter being that this initial era of agis will really be more -----> tool !!! -like in usage than a lot of people desire.** will there be great improvement? obviously and absolutely. will some claim that the singularity has begun? indeed, and that was the conceit of my earlier post (several people misconstrued it as *me* saying that the first agi is the start of the singularity). but if anything, it's closer to the sounding of the fire alarm before we reach the really interesting stuff.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 11, "media": "('self',)", "medialink": "('https://www.reddit.com/r/singularity/comments/iglqp2/firstgeneration_artificial_general_intelligence/',)", "identifyer": 5758669, "year": "2020"}, {"autor": "DaveShapAutomator", "date": 1604245392000, "content": "I used GPT-2 to detect gibberish /!/ # Gibberish Detection\n\n* Here's the blog post: [https://daveshap.github.io/DavidShapiroBlog/gpt-2/deep-learning/2020/10/29/gibberish-detector.html](https://daveshap.github.io/DavidShapiroBlog/gpt-2/deep-learning/2020/10/29/gibberish-detector.html)\n* Here's the Colab Notebook: [https://colab.research.google.com/drive/1or04YRQ3LbnotC8LCo232vYf6qsZT7Cb?usp=sharing](https://colab.research.google.com/drive/1or04YRQ3LbnotC8LCo232vYf6qsZT7Cb?usp=sharing)\n* Here's the GitHub Repo: [https://github.com/daveshap/GibberishDetector](https://github.com/daveshap/GibberishDetector)\n\n# TLDR:\n\n1. I started with Wikipedia articles\n2. I split them into sentences\n3. I scrambled some of the sentences\n4. I added a tag at the end of each sentence: \\`clean\\` or \\`gibberish\\`\n5. Theory was that detecting gibberish is basically a binary task much like Sentiment Analysis\n\n# Some nice features:\n\n* Saves the model to your Google Drive - download and reuse it!\n* Allows for multiple sessions of finetuning\n* Easily change the kind of gibberish\n\n# Possible uses:\n\n* Automated teaching tool, such as for English learners\n* Automated validation of generated text\n* Automated detection of brain injury or dementia\n* Chatbot or comment filtering\n\n# Follow-up Work: Good and Evil\n\nI created this tool because I wanted to have the ability to check the quality of automatically generated text. There are numerous ways to generate text, including Transformers and GANs but there are also simpler, dumber ways. You can literally just choose words are random from a dictionary. You could populate sentences and phrases mad-libs style. Either way, I wanted the ability to create huge a huge corpus of training high quality training data and validate that each sample actually made sense. This current model mostly just detects word salad. I don't think it's sophisticated enough to detect rhetorical gibberish. For that, I will probably have to wait until I can run the 1.5B node GPT-2 or get access to GPT-3.\n\nUltimately, my idea is to test the GPT technology's ability to recognize \\`good\\` and \\`evil\\`. Since good and evil are squishy concepts, the samples would have to be broken down into parables or examples. **Iff** (if and **only** if) the GPT technology has embedded not just language models but some higher order understanding of the world, then it should be able to generalize the rules of what makes something \"good\" or \"evil\"\n\n    // put live puppies in a blender || evil \n    // give soup to homeless children || good \n\nThat sort of thing. My hypothesis is that we can create moralistic models that can serve as a sort of \"moral compass\" for AGI. Whenever a robot or AGI needs to make a decision, it can feed its potential actions into a moral compass microservice to determine which actions are good or evil.", "link": "https://www.reddit.com/r/singularity/comments/jm4ay7/i_used_gpt2_to_detect_gibberish/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i used gpt-2 to detect gibberish /!/ # gibberish detection\n\n* here's the blog post: [https://daveshap.github.io/davidshapiroblog/gpt-2/deep-learning/2020/10/29/gibberish-detector.html](https://daveshap.github.io/davidshapiroblog/gpt-2/deep-learning/2020/10/29/gibberish-detector.html)\n* here's the colab notebook: [https://colab.research.google.com/drive/1or04yrq3lbnotc8lco232vyf6qszt7cb?usp=sharing](https://colab.research.google.com/drive/1or04yrq3lbnotc8lco232vyf6qszt7cb?usp=sharing)\n* here's the github repo: [https://github.com/daveshap/gibberishdetector](https://github.com/daveshap/gibberishdetector)\n\n# tldr:\n\n1. i started with wikipedia articles\n2. i split them into sentences\n3. i scrambled some of the sentences\n4. i added a tag at the end of each sentence: \\`clean\\` or \\`gibberish\\`\n5. theory was that detecting gibberish is basically a binary task much like sentiment analysis\n\n# some nice features:\n\n* saves the model to your google drive - download and reuse it!\n* allows for multiple sessions of finetuning\n* easily change the kind of gibberish\n\n# possible uses:\n\n* automated teaching -----> tool !!! , such as for english learners\n* automated validation of generated text\n* automated detection of brain injury or dementia\n* chatbot or comment filtering\n\n# follow-up work: good and evil\n\ni created this -----> tool !!!  because i wanted to have the ability to check the quality of automatically generated text. there are numerous ways to generate text, including transformers and gans but there are also simpler, dumber ways. you can literally just choose words are random from a dictionary. you could populate sentences and phrases mad-libs style. either way, i wanted the ability to create huge a huge corpus of training high quality training data and validate that each sample actually made sense. this current model mostly just detects word salad. i don't think it's sophisticated enough to detect rhetorical gibberish. for that, i will probably have to wait until i can run the 1.5b node gpt-2 or get access to gpt-3.\n\nultimately, my idea is to test the gpt technology's ability to recognize \\`good\\` and \\`evil\\`. since good and evil are squishy concepts, the samples would have to be broken down into parables or examples. **iff** (if and **only** if) the gpt technology has embedded not just language models but some higher order understanding of the world, then it should be able to generalize the rules of what makes something \"good\" or \"evil\"\n\n    // put live puppies in a blender || evil \n    // give soup to homeless children || good \n\nthat sort of thing. my hypothesis is that we can create moralistic models that can serve as a sort of \"moral compass\" for agi. whenever a robot or agi needs to make a decision, it can feed its potential actions into a moral compass microservice to determine which actions are good or evil.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/jm4ay7/i_used_gpt2_to_detect_gibberish/',)", "identifyer": 5758998, "year": "2020"}, {"autor": "WiseStrain", "date": 1600230563000, "content": "Should I bring children into these times? /!/ I am 25 and I am newly married. And one issue that keeps buzzing me constantly is whether I should have children in a near future.\n\nI am sure as humanity, we are on the verge of great transition. What we will experience in our lifetime will not be the general predictable experiences made by our forefathers. However, WHAT the transition will be is not certain now. Will we turn into gods and have unimaginable wealth and prosperity due to technological advancements? or will we go extinct or at least experience hardships and scarcity?\n\nLet me state my view. AGI, its the engine of the coming transition. Nevertheless, I am more pessimistic about it than optimistic. AGI very quickly leads to ASI (Artificial Super Consciousness) and the clash between our desires and its desires is inevitable. And in such a clash, I believe humanity will lose. Even if the ASI itself is under humanities control, I don't think our political powers will make it a blessing but rather a tool to push forward and impose their agendas and ideologies on others. I will serve the military, not the public.\n\nThere is a myriad of other issues. Take climate change for example. It is very concerning. It won't get us extinct but the change in weather has repercussions in the economy and politics. I live in Kurdistan and we are on the frontiers of climate change. What used to be a very wet country raining for 9 to 10 months, is now a semi-arid country raining only 5 to 6 months.\n\nOther issues like antibiotic resistance (I am a doctor and it's real), nanotechnology (this one can have a positive impact), bioterrorism...etc can also make the future very hard.\n\nSo thinking all this, I am really reluctant to bring a child into this world of uncertainty and unpredictability. What do you think?", "link": "https://www.reddit.com/r/singularity/comments/itot84/should_i_bring_children_into_these_times/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "should i bring children into these times? /!/ i am 25 and i am newly married. and one issue that keeps buzzing me constantly is whether i should have children in a near future.\n\ni am sure as humanity, we are on the verge of great transition. what we will experience in our lifetime will not be the general predictable experiences made by our forefathers. however, what the transition will be is not certain now. will we turn into gods and have unimaginable wealth and prosperity due to technological advancements? or will we go extinct or at least experience hardships and scarcity?\n\nlet me state my view. agi, its the engine of the coming transition. nevertheless, i am more pessimistic about it than optimistic. agi very quickly leads to asi (artificial super consciousness) and the clash between our desires and its desires is inevitable. and in such a clash, i believe humanity will lose. even if the asi itself is under humanities control, i don't think our political powers will make it a blessing but rather a -----> tool !!!  to push forward and impose their agendas and ideologies on others. i will serve the military, not the public.\n\nthere is a myriad of other issues. take climate change for example. it is very concerning. it won't get us extinct but the change in weather has repercussions in the economy and politics. i live in kurdistan and we are on the frontiers of climate change. what used to be a very wet country raining for 9 to 10 months, is now a semi-arid country raining only 5 to 6 months.\n\nother issues like antibiotic resistance (i am a doctor and it's real), nanotechnology (this one can have a positive impact), bioterrorism...etc can also make the future very hard.\n\nso thinking all this, i am really reluctant to bring a child into this world of uncertainty and unpredictability. what do you think?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 13, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/itot84/should_i_bring_children_into_these_times/',)", "identifyer": 5759116, "year": "2020"}], "name": "toolsingularity2020"}