{"interestingcomments": [{"autor": "wengchunkn", "date": 1571111507000, "content": "Delegation vs. Intelligence /!/ Delegation vs. Intelligence\n\nPerhaps mainstream AI researchers are barking on the wrong tree all these time.\n\nHuman beings survive and evolve with collective intelligence and delegation of tasks.\n\nAs such, it must be too much to expect machines to do better --- although they already are, on specific tasks.\n\nIf we adopt the collective intelligence model where machine intelligence is part of the collective intelligence together with human population, then the definition of technological singularity will change to:\n\n\\-- a time where machine intelligence output exceeds that of human intelligence\n\nAnd it might have already happened!!!\n\nThen the next questions are:\n\n(1) Will Eugenics attempt to ethnic cleanse inferior races?\n\n(2) Will machine choose to kill human beings OR co-exist?\n\nBut then, we do not have much choice in those decisions already --- it will be a world of Terminator, Matrix, Transformer or Star Wars --- those who lose the battle will run, or become extinct, if they can.", "link": "https://www.reddit.com/r/singularity/comments/di28gy/delegation_vs_intelligence/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "delegation vs. intelligence /!/ delegation vs. intelligence\n\nperhaps mainstream ai researchers are barking on the wrong -----> tree !!!  all these time.\n\nhuman beings survive and evolve with collective intelligence and delegation of tasks.\n\nas such, it must be too much to expect machines to do better --- although they already are, on specific tasks.\n\nif we adopt the collective intelligence model where machine intelligence is part of the collective intelligence together with human population, then the definition of technological singularity will change to:\n\n\\-- a time where machine intelligence output exceeds that of human intelligence\n\nand it might have already happened!!!\n\nthen the next questions are:\n\n(1) will eugenics attempt to ethnic cleanse inferior races?\n\n(2) will machine choose to kill human beings or co-exist?\n\nbut then, we do not have much choice in those decisions already --- it will be a world of terminator, matrix, transformer or star wars --- those who lose the battle will run, or become extinct, if they can.", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/di28gy/delegation_vs_intelligence/',)", "identifyer": 5584905, "year": "2019"}], "name": "treesingularity2019"}