{"interestingcomments": [{"autor": "BenRayfield", "date": 1520385028000, "content": "What kind of thinking remains, where both Human and Computer can verify a solution, but only Human can generate a solution? /!/ I propose the rules of this contest:\n\n* A game is any javascript code which answers true or false, given a pair of [randomNumber, answer]. randomNumber is any arbitrary input (max 256 bits) that generates a variation of the question. answer is anything of equal or lesser size than randomNumber which answers the puzzle correctly.\n\n* There exists a kind of thinking that Humans are better at than computers if any such \"game\" is found which can be solved by Humans but cant be solved by computer alone, given a randomNumber variation of the puzzle.\n\n* Or, computers are smarter than Humans at practically everything if no such game can be found where Humans defeat computers.\n\nI would like to help find a game (such a javascript function) which Humans still dominate, but I am skeptical that such a thing is still possible. My intuition on Humans vs Computers speculates that the only things Humans are still better at are things like \"what does it feel like to have a heart beating in your chest\" or \"what does it feel like to shift your eyes from the left to the right\" etc, but in terms of kinds of thinking, thats like saying Humans are dumber than monkeys cuz they dont know what its like to swing between tree branches while eating bananas. Its too specific. So I want a more fair, simpler kind of measure of kinds of thinking, thats looking to demonstrate at least 1 well-defined kind of thinking Humans are consistently better at than computers.", "link": "https://www.reddit.com/r/singularity/comments/82kben/what_kind_of_thinking_remains_where_both_human/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "what kind of thinking remains, where both human and computer can verify a solution, but only human can generate a solution? /!/ i propose the rules of this contest:\n\n* a game is any javascript code which answers true or false, given a pair of [randomnumber, answer]. randomnumber is any arbitrary input (max 256 bits) that generates a variation of the question. answer is anything of equal or lesser size than randomnumber which answers the puzzle correctly.\n\n* there exists a kind of thinking that humans are better at than computers if any such \"game\" is found which can be solved by humans but cant be solved by computer alone, given a randomnumber variation of the puzzle.\n\n* or, computers are smarter than humans at practically everything if no such game can be found where humans defeat computers.\n\ni would like to help find a game (such a javascript function) which humans still dominate, but i am skeptical that such a thing is still possible. my intuition on humans vs computers speculates that the only things humans are still better at are things like \"what does it feel like to have a heart beating in your chest\" or \"what does it feel like to shift your eyes from the left to the right\" etc, but in terms of kinds of thinking, thats like saying humans are dumber than monkeys cuz they dont know what its like to swing between -----> tree !!!  branches while eating bananas. its too specific. so i want a more fair, simpler kind of measure of kinds of thinking, thats looking to demonstrate at least 1 well-defined kind of thinking humans are consistently better at than computers.", "sortedWord": "None", "removed": "('nan',)", "score": 6, "comments": 101, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/82kben/what_kind_of_thinking_remains_where_both_human/',)", "identifyer": 5755467, "year": "2018"}, {"autor": "Yuli-Ban", "date": 1536976282000, "content": "Artificial Expert Intelligence (AXI) /!/ Question: how many of you have wondered about the current day capabilities of artificial intelligence? How many of you would say that AI circa autumn 2018 can accomplish many tasks at once but lacks generality? And how many would say DeepMind is the closest to creating AGI because AlphaGo beat Lee Sedol and Ke Jie? Or maybe Siri or IBM Watson? \n\n\nTime for a reality check: current AI is *not* close to generality. Artificial intelligence is squarely narrow and incapable of accomplishing any task beyond its hardcoded parameters. The ability of present day AI to appear more capable than it is speaks more to the geniuses who programmed it than the networks themselves. Siri, Cortana, Alexa, Google Home, etc. are not one algorithm. They're bundles of narrow AIs that work together loosely. Not even like a brain, but more like how a clock requires many separate parts to tell time. Voice synthesis are the numbers; internet search abilities are the hands; understanding speech and all the convolutional matrices are the clockwork inside. \n\nThis is what AI is like right now. What's more, DeepMind and OpenAI are the bleeding edge, the stuff that actually *is* AI and not scripts or tree searches. Even they will tell you that the real magic is behind the keyboard, not in the computer. \n\nBut what if I also told you that we genuinely are on the cusp of magic? DeepMind's AlphaZero was but a single taste of the future. \n\nAll AI today may be narrow, but some are narrower than others. \n\nThe missing link in AI is the architecture that lies between artificial narrow intelligence (ANI) and artificial general intelligence (AGI). I call this missing link \"artificial expert intelligence\" or AXI. This will be the point where magic lies both within the computer and the programmer. A stage where AI displays traits of generality in certain areas. There will be no illusions and clever tricks like there are today.\n", "link": "https://www.reddit.com/r/singularity/comments/9fxtca/artificial_expert_intelligence_axi/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "tree", "selectorShort": "tree", "MarkedSent": "artificial expert intelligence (axi) /!/ question: how many of you have wondered about the current day capabilities of artificial intelligence? how many of you would say that ai circa autumn 2018 can accomplish many tasks at once but lacks generality? and how many would say deepmind is the closest to creating agi because alphago beat lee sedol and ke jie? or maybe siri or ibm watson? \n\n\ntime for a reality check: current ai is *not* close to generality. artificial intelligence is squarely narrow and incapable of accomplishing any task beyond its hardcoded parameters. the ability of present day ai to appear more capable than it is speaks more to the geniuses who programmed it than the networks themselves. siri, cortana, alexa, google home, etc. are not one algorithm. they're bundles of narrow ais that work together loosely. not even like a brain, but more like how a clock requires many separate parts to tell time. voice synthesis are the numbers; internet search abilities are the hands; understanding speech and all the convolutional matrices are the clockwork inside. \n\nthis is what ai is like right now. what's more, deepmind and openai are the bleeding edge, the stuff that actually *is* ai and not scripts or -----> tree !!!  searches. even they will tell you that the real magic is behind the keyboard, not in the computer. \n\nbut what if i also told you that we genuinely are on the cusp of magic? deepmind's alphazero was but a single taste of the future. \n\nall ai today may be narrow, but some are narrower than others. \n\nthe missing link in ai is the architecture that lies between artificial narrow intelligence (ani) and artificial general intelligence (agi). i call this missing link \"artificial expert intelligence\" or axi. this will be the point where magic lies both within the computer and the programmer. a stage where ai displays traits of generality in certain areas. there will be no illusions and clever tricks like there are today.\n", "sortedWord": "None", "removed": "('nan',)", "score": 11, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/9fxtca/artificial_expert_intelligence_axi/',)", "identifyer": 5756748, "year": "2018"}], "name": "treesingularity2018"}