{"interestingcomments": [{"autor": "FuzzyDude17", "date": 1527730528000, "content": "Greetings reddit subscribers of Futurology. I have a prediction for fashion, cars, culture, and music for the 2020s. Note: This prediction should not go too far as many news reporters and scientists predict do for the new decade. So, here is what I predict. /!/ **Number 1: Fashion**\n\nMen will probably have very thin facial hair, and a skin fade hairstyle.\n\nTheir clothing might have skinny hoodie zipper, skinny tank top in it, skinny jeans, and low top shoes.\n\nWomen: Short hair, skinny shirt, skinny jeans, and slip on sneakers.\n\n**Number 2: Cars.** \n\nThey will look more modern and might look more aggressive. \n\nThe hood, roof, doors, trunk, and bumper molding might be sleek and stocky.\n\nThe headlamps and taillights might look angry, and its LED lights will come with of course. \n\n**Number 3: Culture**\n\nCreative musicians vs One Hit Wonders culture. \n\nA lot of new so\\-called rappers and off topic R&amp;B singers \\(One hit wonders\\) will probably try so hard\n\nto take over new music genre artists \\(I am guessing R&amp;B\\) in mainstream music. Fans might be involved in \n\nthis music conflict. \n\n**And Number 4: Music**\n\nIt might have a reverse 2000s trend. Because back then, Hip hop became mainstream while R&amp;B was around the corner.\n\nKiss Pop music goodbye and ladies first for R&amp;B, while mens hip hop will have to wait its turn on radio. \n\nSo that is my prediction for the 2020s. If you have any opinions, put it in the comments down below. Thank you for reading\n\nmy prediction, and have a good day. ", "link": "https://www.reddit.com/r/singularity/comments/8ne2mc/greetings_reddit_subscribers_of_futurology_i_have/", "origin": "Reddit", "suborigin": "singularity", "result": true, "Selector": "trunk", "selectorShort": "trunk", "MarkedSent": "greetings reddit subscribers of futurology. i have a prediction for fashion, cars, culture, and music for the 2020s. note: this prediction should not go too far as many news reporters and scientists predict do for the new decade. so, here is what i predict. /!/ **number 1: fashion**\n\nmen will probably have very thin facial hair, and a skin fade hairstyle.\n\ntheir clothing might have skinny hoodie zipper, skinny tank top in it, skinny jeans, and low top shoes.\n\nwomen: short hair, skinny shirt, skinny jeans, and slip on sneakers.\n\n**number 2: cars.** \n\nthey will look more modern and might look more aggressive. \n\nthe hood, roof, doors, -----> trunk !!! , and bumper molding might be sleek and stocky.\n\nthe headlamps and taillights might look angry, and its led lights will come with of course. \n\n**number 3: culture**\n\ncreative musicians vs one hit wonders culture. \n\na lot of new so\\-called rappers and off topic r&amp;b singers \\(one hit wonders\\) will probably try so hard\n\nto take over new music genre artists \\(i am guessing r&amp;b\\) in mainstream music. fans might be involved in \n\nthis music conflict. \n\n**and number 4: music**\n\nit might have a reverse 2000s trend. because back then, hip hop became mainstream while r&amp;b was around the corner.\n\nkiss pop music goodbye and ladies first for r&amp;b, while mens hip hop will have to wait its turn on radio. \n\nso that is my prediction for the 2020s. if you have any opinions, put it in the comments down below. thank you for reading\n\nmy prediction, and have a good day. ", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 9, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/singularity/comments/8ne2mc/greetings_reddit_subscribers_of_futurology_i_have/',)", "identifyer": 5756415, "year": "2018"}], "name": "trunksingularity2018"}