{"interestingcomments": [{"autor": "abluecrate", "date": 1587139795000, "content": "Approaches to 2D (non-image) Data Analysis? /!/ Are there any machine learning methods to handle 2D curve data as an input? In other words, to predict some output z*,* given a 2D array (2 \\* n) of x and y values. I can't seem to find any information that isn't image related. \n\nFor background, I have a large data set containing curves -  specifically stress-strain data - with associated parameters. The goal is to predict these parameters given only the 2D curve itself. It's essentially a form of regression, where I already know x and y, but instead need to predict an underlying constant.\n\nMy current approach involves an MLP neural network with 2 input branches, where I split the 2D data into two 1D arrays with an extra hidden layer and then combine them in a concatenation layer. This appears to work, at least when training against linear pseudo-data.\n\nAre there any other network structures and/or machine learning algorithms that could be used in this application? From what I've read a CNN could work, though I can't find any information that isn't image related. Or perhaps an RNN or LSTM, since the data is sequential - though again, I can't find any information on series data that isn't time related.\n\nAny help or links/resources would be greatly appreciated", "link": "https://www.reddit.com/r/learnmachinelearning/comments/g34y8x/approaches_to_2d_nonimage_data_analysis/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "approaches to 2d (non-image) data analysis? /!/ are there any machine learning methods to handle 2d curve data as an input? in other words, to predict some output z*,* given a 2d array (2 \\* n) of x and y values. i can't seem to find any information that isn't image related. \n\nfor background, i have a large data set containing curves -  specifically stress-strain data - with associated parameters. the goal is to predict these parameters given only the 2d curve itself. it's essentially a form of regression, where i already know x and y, but instead need to predict an underlying constant.\n\nmy current approach involves an mlp neural network with 2 input -----> branches !!! , where i split the 2d data into two 1d arrays with an extra hidden layer and then combine them in a concatenation layer. this appears to work, at least when training against linear pseudo-data.\n\nare there any other network structures and/or machine learning algorithms that could be used in this application? from what i've read a cnn could work, though i can't find any information that isn't image related. or perhaps an rnn or lstm, since the data is sequential - though again, i can't find any information on series data that isn't time related.\n\nany help or links/resources would be greatly appreciated", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/g34y8x/approaches_to_2d_nonimage_data_analysis/',)", "identifyer": 5741249, "year": "2020"}, {"autor": "rodrigonader", "date": 1602889434000, "content": "Is it good practice to have a separate branch for training in ML development?", "link": "https://www.reddit.com/r/learnmachinelearning/comments/jck8lm/is_it_good_practice_to_have_a_separate_branch_for/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "is it good practice to have a separate -----> branch !!!  for training in ml development?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/jck8lm/is_it_good_practice_to_have_a_separate_branch_for/',)", "identifyer": 5741826, "year": "2020"}, {"autor": "wizyardo_", "date": 1598067317000, "content": "I'm getting the following error (full log included) while trying to run buildozer /!/  Can anyone help me? I installed buildozer following the steps in the docs.\n\n`MacBook-Air-de-Federico:PP federicoundurraga$ buildozer -v android debug`\n\n`# Check configuration tokens`\n\n`# Ensure build layout`\n\n`# Check configuration tokens`\n\n`# Read available permissions from api-versions.xml`\n\n`# Preparing build`\n\n`# Check requirements for android`\n\n`# Search for Git (git)`\n\n`# -&gt; found at /usr/local/Cellar/git/2.23.0_1/bin/git`\n\n`# Search for Cython (cython)`\n\n`# -&gt; found at /Library/Frameworks/Python.framework/Versions/3.6/bin/cython`\n\n`# Search for Java compiler (javac)`\n\n`# -&gt; found at /System/Library/Frameworks/JavaVM.framework/Versions/A/Commands/javac`\n\n`# Search for Java keytool (keytool)`\n\n`# -&gt; found at /System/Library/Frameworks/JavaVM.framework/Versions/A/Commands/keytool`\n\n`# Install platform`\n\n`# Run 'git config --get remote.origin.url'`\n\n`# Cwd /Users/federicoundurraga/Desktop/PP/.buildozer/android/platform/python-for-android`\n\n`https://github.com/kivy/python-for-android.git`\n\n`# Run 'git branch -vv'`\n\n`# Cwd /Users/federicoundurraga/Desktop/PP/.buildozer/android/platform/python-for-android`\n\n`* master 1b3b0e3f [origin/master] Merge pull request #2225 from kivy/release-2020.06.02`\n\n`# Run '/Library/Frameworks/Python.framework/Versions/3.6/bin/python3 -m pip install -q --user \\'appdirs\\' \\'colorama&gt;=0.3.3\\' \\'jinja2\\' \\'six\\' \\'enum34; python_version&lt;\"3.4\"\\' \\'sh&gt;=1.10; sys_platform!=\"nt\"\\' \\'pep517&lt;0.7.0\"\\' \\'toml\\''`\n\n`# Cwd None`\n\n`# Apache ANT found at /Users/federicoundurraga/.buildozer/android/platform/apache-ant-1.9.4`\n\n`# Android SDK found at /Users/federicoundurraga/.buildozer/android/platform/android-sdk`\n\n`# Recommended android's NDK version by p4a is: 19c`\n\n`# Android NDK found at /Users/federicoundurraga/.buildozer/android/platform/android-ndk-r19c`\n\n`# Installing/updating SDK platform tools if necessary`\n\n`# Check configuration tokens`\n\n`# sdkmanager path \"/Users/federicoundurraga/.buildozer/android/platform/android-sdk/tools/bin/sdkmanager\" does not exist, sdkmanager is notinstalled`", "link": "https://www.reddit.com/r/learnmachinelearning/comments/iebgn8/im_getting_the_following_error_full_log_included/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "i'm getting the following error (full log included) while trying to run buildozer /!/  can anyone help me? i installed buildozer following the steps in the docs.\n\n`macbook-air-de-federico:pp federicoundurraga$ buildozer -v android debug`\n\n`# check configuration tokens`\n\n`# ensure build layout`\n\n`# check configuration tokens`\n\n`# read available permissions from api-versions.xml`\n\n`# preparing build`\n\n`# check requirements for android`\n\n`# search for git (git)`\n\n`# -&gt; found at /usr/local/cellar/git/2.23.0_1/bin/git`\n\n`# search for cython (cython)`\n\n`# -&gt; found at /library/frameworks/python.framework/versions/3.6/bin/cython`\n\n`# search for java compiler (javac)`\n\n`# -&gt; found at /system/library/frameworks/javavm.framework/versions/a/commands/javac`\n\n`# search for java keytool (keytool)`\n\n`# -&gt; found at /system/library/frameworks/javavm.framework/versions/a/commands/keytool`\n\n`# install platform`\n\n`# run 'git config --get remote.origin.url'`\n\n`# cwd /users/federicoundurraga/desktop/pp/.buildozer/android/platform/python-for-android`\n\n`https://github.com/kivy/python-for-android.git`\n\n`# run 'git -----> branch !!!  -vv'`\n\n`# cwd /users/federicoundurraga/desktop/pp/.buildozer/android/platform/python-for-android`\n\n`* master 1b3b0e3f [origin/master] merge pull request #2225 from kivy/release-2020.06.02`\n\n`# run '/library/frameworks/python.framework/versions/3.6/bin/python3 -m pip install -q --user \\'appdirs\\' \\'colorama&gt;=0.3.3\\' \\'jinja2\\' \\'six\\' \\'enum34; python_version&lt;\"3.4\"\\' \\'sh&gt;=1.10; sys_platform!=\"nt\"\\' \\'pep517&lt;0.7.0\"\\' \\'toml\\''`\n\n`# cwd none`\n\n`# apache ant found at /users/federicoundurraga/.buildozer/android/platform/apache-ant-1.9.4`\n\n`# android sdk found at /users/federicoundurraga/.buildozer/android/platform/android-sdk`\n\n`# recommended android's ndk version by p4a is: 19c`\n\n`# android ndk found at /users/federicoundurraga/.buildozer/android/platform/android-ndk-r19c`\n\n`# installing/updating sdk platform tools if necessary`\n\n`# check configuration tokens`\n\n`# sdkmanager path \"/users/federicoundurraga/.buildozer/android/platform/android-sdk/tools/bin/sdkmanager\" does not exist, sdkmanager is notinstalled`", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/iebgn8/im_getting_the_following_error_full_log_included/',)", "identifyer": 5743118, "year": "2020"}, {"autor": "eternalLearn", "date": 1599621913000, "content": "Bounding Box parameterization help /!/ One common method to parameterize bounding boxes is given in the Faster RCNN paper. [https://arxiv.org/pdf/1506.01497.pdf](https://arxiv.org/pdf/1506.01497.pdf) (Equation 2 on page 5)\n\nThis includes the equation t\\_w = log(w/w\\_a), which makes sense when there is an object present. However, when an object is not present you would be taking the log of zero, which will blow up. \n\nWhat value should the bounding box branch of a network using this parameterization predict when there is no object present? What value should I have in the labels when no object is present? Is the solution to only regress the matched anchors?\n\nThanks for your help!", "link": "https://www.reddit.com/r/learnmachinelearning/comments/ip8fd3/bounding_box_parameterization_help/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "bounding box parameterization help /!/ one common method to parameterize bounding boxes is given in the faster rcnn paper. [https://arxiv.org/pdf/1506.01497.pdf](https://arxiv.org/pdf/1506.01497.pdf) (equation 2 on page 5)\n\nthis includes the equation t\\_w = log(w/w\\_a), which makes sense when there is an object present. however, when an object is not present you would be taking the log of zero, which will blow up. \n\nwhat value should the bounding box -----> branch !!!  of a network using this parameterization predict when there is no object present? what value should i have in the labels when no object is present? is the solution to only regress the matched anchors?\n\nthanks for your help!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/ip8fd3/bounding_box_parameterization_help/',)", "identifyer": 5743193, "year": "2020"}, {"autor": "pablodev", "date": 1586796085000, "content": "How does a developer without a math base starts learning Machine Learning ? /!/  Hey guys im new to machine learning and i dont know much about math, and i wanted to ask for advice.\n\nI am a full stack developer (Laravel, SQL and Angular) in barcelona and i wanted to explore this \"branch\" of coding, does anyone know how to get into machine learning without a solid base of maths? Like the first steps to get there!\n\nI would appreciate some book recommendations for newbies and idk maybe a udemy course or something like that to start! I know its a lot of work and the learning curve is hard but i just want to get into it and start learning, i got stuck in some functions like the Sigmoid, etc...\n\nThank you so much!", "link": "https://www.reddit.com/r/learnmachinelearning/comments/g0mjrm/how_does_a_developer_without_a_math_base_starts/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "how does a developer without a math base starts learning machine learning ? /!/  hey guys im new to machine learning and i dont know much about math, and i wanted to ask for advice.\n\ni am a full stack developer (laravel, sql and angular) in barcelona and i wanted to explore this \"-----> branch !!! \" of coding, does anyone know how to get into machine learning without a solid base of maths? like the first steps to get there!\n\ni would appreciate some book recommendations for newbies and idk maybe a udemy course or something like that to start! i know its a lot of work and the learning curve is hard but i just want to get into it and start learning, i got stuck in some functions like the sigmoid, etc...\n\nthank you so much!", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 9, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/g0mjrm/how_does_a_developer_without_a_math_base_starts/',)", "identifyer": 5744021, "year": "2020"}, {"autor": "Are_We_There_Yet256", "date": 1593276603000, "content": "I'm Moving Towards Data Engineering And Data Analysis Far More Than Data Science... Am I Making The Right Choice? /!/ Hi!  \n\n\nJust going to put this bluntly, I've been primarily interested in data science starting from my freshmen year at University, but I kept it at a bay and break for sometime because of University work and other personal issues.  \n\n\nNow, I'm heading towards my semester ending and my Summer break starting, and I really want to dive deeper and deeper into all this. But since the last year, I realized that apart from just being a data scientist, I wanted to be an actual software engineer. Software Engineering is a complex combination of various talents, ideas, from different fields and branches of knowledge, and I have been so far somewhat successful in understanding how fully fledged, actually usable software is made.  \n\n\nAnd the more I think about it, the more I start to think and realize that for me, data science has been about developing models and getting good measures of precision and recall, fine tuning it according to the data, but in actual realistic scenarios, data science isn't really the top priority for any new startup, or company just trying to develop a scale-able, maintainable, and agile software. There are far many factors into it, and data science and building models just seem to be a part of it, but not the entire thing itself. I see data engineering and data analysis as being far more valuable to companies for the following reasons,  \n\n\n1. Companies often just need a good overview of the data they have so that they can extract meaningful features out of it. This requires good knowledge of statistics on the theoretical basis, and on the practical basis, SQL + R + figures and diagrams to explain the nature of data should be fine, i.e., data analysis. Data Science and model training seems to be just not what employees need most of the time. And besides, the easier the idea behind the figures are, the easier it is to explain to cooperates who need to make rational decisions. A good statistical notion combined with simple linear or logistic regression seem to be just enough.\n2. Because of the influx of the data that is growing data by data, companies just need a good workflow and pipeline to maintain how the data is stored, accessed, and modified - they need data engineers for every day related tasks to data. But on the other hand, you don't need data scientists making models for the coming data on a daily basis, and since data science is so easy to pick up with easy to learn languages and libraries, it seems highly likely that companies would rather ask the data engineer to look over that part as well. Hiring another person, integrating + training + making him part of the team seems to be much more of an expensive move. \n\nI might be missing something here, but these are the ideas and thoughts that I had. Here is what I have done so far in Data Science,\n\n1. Almost completed the Introduction To ML and DL Specialization by Andrew Ng.\n2. Started Kaggle somewhat - have to still make a team for it.\n3. Gone through the Python libraries, Tf, and PyTorch. Not very big things to talk about, but yeah, I'm familiar with Python.\n\nThoughts and ideas appreciated. Thank you!", "link": "https://www.reddit.com/r/learnmachinelearning/comments/hgwxgf/im_moving_towards_data_engineering_and_data/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "i'm moving towards data engineering and data analysis far more than data science... am i making the right choice? /!/ hi!  \n\n\njust going to put this bluntly, i've been primarily interested in data science starting from my freshmen year at university, but i kept it at a bay and break for sometime because of university work and other personal issues.  \n\n\nnow, i'm heading towards my semester ending and my summer break starting, and i really want to dive deeper and deeper into all this. but since the last year, i realized that apart from just being a data scientist, i wanted to be an actual software engineer. software engineering is a complex combination of various talents, ideas, from different fields and -----> branches !!!  of knowledge, and i have been so far somewhat successful in understanding how fully fledged, actually usable software is made.  \n\n\nand the more i think about it, the more i start to think and realize that for me, data science has been about developing models and getting good measures of precision and recall, fine tuning it according to the data, but in actual realistic scenarios, data science isn't really the top priority for any new startup, or company just trying to develop a scale-able, maintainable, and agile software. there are far many factors into it, and data science and building models just seem to be a part of it, but not the entire thing itself. i see data engineering and data analysis as being far more valuable to companies for the following reasons,  \n\n\n1. companies often just need a good overview of the data they have so that they can extract meaningful features out of it. this requires good knowledge of statistics on the theoretical basis, and on the practical basis, sql + r + figures and diagrams to explain the nature of data should be fine, i.e., data analysis. data science and model training seems to be just not what employees need most of the time. and besides, the easier the idea behind the figures are, the easier it is to explain to cooperates who need to make rational decisions. a good statistical notion combined with simple linear or logistic regression seem to be just enough.\n2. because of the influx of the data that is growing data by data, companies just need a good workflow and pipeline to maintain how the data is stored, accessed, and modified - they need data engineers for every day related tasks to data. but on the other hand, you don't need data scientists making models for the coming data on a daily basis, and since data science is so easy to pick up with easy to learn languages and libraries, it seems highly likely that companies would rather ask the data engineer to look over that part as well. hiring another person, integrating + training + making him part of the team seems to be much more of an expensive move. \n\ni might be missing something here, but these are the ideas and thoughts that i had. here is what i have done so far in data science,\n\n1. almost completed the introduction to ml and dl specialization by andrew ng.\n2. started kaggle somewhat - have to still make a team for it.\n3. gone through the python libraries, tf, and pytorch. not very big things to talk about, but yeah, i'm familiar with python.\n\nthoughts and ideas appreciated. thank you!", "sortedWord": "None", "removed": "('nan',)", "score": 11, "comments": 15, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/hgwxgf/im_moving_towards_data_engineering_and_data/',)", "identifyer": 5744434, "year": "2020"}, {"autor": "LeonhardEuler_", "date": 1582069887000, "content": "Tips for a highschooler starting college next fall? /!/ I was recently accepted into a college well-known for its computer science department. Ultimately, I would like to work for a company such as OpenAI or Google's Deep Mind as a machine learning research scientist. I was wondering what this path might look like, specifically what I should be doing between now and my first semester of college. Would it be worth doing OCW such as Gilbert Strang's linear algebra? I am already fluent in Python and Java, so I guess I am wondering what mathematics I should study to get ahead. \n\nTL;DR What branches of mathematics should I study to get ahead in time for my first semester of college / is it worth getting ahead if I'm just going to take math classes at the university?", "link": "https://www.reddit.com/r/learnmachinelearning/comments/f61e2s/tips_for_a_highschooler_starting_college_next_fall/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "tips for a highschooler starting college next fall? /!/ i was recently accepted into a college well-known for its computer science department. ultimately, i would like to work for a company such as openai or google's deep mind as a machine learning research scientist. i was wondering what this path might look like, specifically what i should be doing between now and my first semester of college. would it be worth doing ocw such as gilbert strang's linear algebra? i am already fluent in python and java, so i guess i am wondering what mathematics i should study to get ahead. \n\ntl;dr what -----> branches !!!  of mathematics should i study to get ahead in time for my first semester of college / is it worth getting ahead if i'm just going to take math classes at the university?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/f61e2s/tips_for_a_highschooler_starting_college_next_fall/',)", "identifyer": 5744729, "year": "2020"}, {"autor": "abcxyz-5", "date": 1607478777000, "content": "Suppose you have a multi-class classification problem with 10 classes. Your neural network has 3 layers, and the hidden layer (layer 2) has 5 units. Using the one-vs-all method described here, how many elements does Θ(2) have? /!/ Hi\n\nIm not sure if this is the correct place to ask, I am currently taking Andrew Ang course and I don't understand the answer to this question\n\n\nI answered 50 since layer 2 has 5 units, and layer 3 (results) has 10 units.\n\nSo each branches of layer 2 should connect to 10 units (3rd layer) .\n\n 5 x 10 is 50.\n\nBut turned out the answer is 60.\n\nWould like to seek explaination. Thank you!", "link": "https://www.reddit.com/r/learnmachinelearning/comments/k9ibqf/suppose_you_have_a_multiclass_classification/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "suppose you have a multi-class classification problem with 10 classes. your neural network has 3 layers, and the hidden layer (layer 2) has 5 units. using the one-vs-all method described here, how many elements does θ(2) have? /!/ hi\n\nim not sure if this is the correct place to ask, i am currently taking andrew ang course and i don't understand the answer to this question\n\n\ni answered 50 since layer 2 has 5 units, and layer 3 (results) has 10 units.\n\nso each -----> branches !!!  of layer 2 should connect to 10 units (3rd layer) .\n\n 5 x 10 is 50.\n\nbut turned out the answer is 60.\n\nwould like to seek explaination. thank you!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/k9ibqf/suppose_you_have_a_multiclass_classification/',)", "identifyer": 5744947, "year": "2020"}, {"autor": "Mountain24601", "date": 1585150863000, "content": "Which are the important chapters in An Introduction to Statistical learning /!/ Hi everyone,\n\nI understand all of it has some important stuff. From the harsh guide to machine learning he specified to read chapter 1-4, and 7-8. Is there any similar regions in this I should be focusing on. I wanted to branch off into Andrew Ng’s machine learning coursera course before finishing the rest of this book.\n\nThanks for any input.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/foseqz/which_are_the_important_chapters_in_an/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "which are the important chapters in an introduction to statistical learning /!/ hi everyone,\n\ni understand all of it has some important stuff. from the harsh guide to machine learning he specified to read chapter 1-4, and 7-8. is there any similar regions in this i should be focusing on. i wanted to -----> branch !!!  off into andrew ng’s machine learning coursera course before finishing the rest of this book.\n\nthanks for any input.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/foseqz/which_are_the_important_chapters_in_an/',)", "identifyer": 5745281, "year": "2020"}, {"autor": "xemeds", "date": 1590993257000, "content": "Free Course Coupon /!/ Hello everyone!\n\nI've created a Python course on Udemy that will teach beginners the fundementals of programming with Python in just 80 minutes.  It will teach you enough of Python for you to be able to move on to branches like machine learning, data science, web development with django, etc.\n\nHere is the courses link: https://www.udemy.com/course/learn-python-in-80-minutes/?referralCode=02CCEB0AC1EC6F4B1354\n\n(the referral code is for me as the instructor to be fully credited with any sales)\n\nI have also created a coupon that when applied will make the course totally free but only for the first 10 people.\n\nCoupon: LEARN80\n\n(if the coupon is finished don't worry the course has the cheapest price tier on Udemy so you could just support me and buy it)\n\nOne more thing, when you leave your desired rating for the course you will recieve a free Python PDF Book that will help you through out your learning process, it will also help you to learn more advanced topics with Python such as; regular expressions, networked programming, using web services, OOP programming, databases and data visualization.\n\nLooking forward to working with anyone who enrolls.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/guff60/free_course_coupon/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "free course coupon /!/ hello everyone!\n\ni've created a python course on udemy that will teach beginners the fundementals of programming with python in just 80 minutes.  it will teach you enough of python for you to be able to move on to -----> branches !!!  like machine learning, data science, web development with django, etc.\n\nhere is the courses link: https://www.udemy.com/course/learn-python-in-80-minutes/?referralcode=02cceb0ac1ec6f4b1354\n\n(the referral code is for me as the instructor to be fully credited with any sales)\n\ni have also created a coupon that when applied will make the course totally free but only for the first 10 people.\n\ncoupon: learn80\n\n(if the coupon is finished don't worry the course has the cheapest price tier on udemy so you could just support me and buy it)\n\none more thing, when you leave your desired rating for the course you will recieve a free python pdf book that will help you through out your learning process, it will also help you to learn more advanced topics with python such as; regular expressions, networked programming, using web services, oop programming, databases and data visualization.\n\nlooking forward to working with anyone who enrolls.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/guff60/free_course_coupon/',)", "identifyer": 5745828, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1605677104000, "content": "7 Major Branches of Discrete Mathematics /!/  Discrete mathematics is the language of Computer Science that includes major topics such as combinatorics, binary trees, Boolean algebra, group, graph, probability, and set theory. \n\nRead further to understand in-depth: [https://www.analyticssteps.com/blogs/7-major-branches-discrete-mathematics](https://www.analyticssteps.com/blogs/7-major-branches-discrete-mathematics)", "link": "https://www.reddit.com/r/learnmachinelearning/comments/jw9ywi/7_major_branches_of_discrete_mathematics/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "7 major -----> branches !!!  of discrete mathematics /!/  discrete mathematics is the language of computer science that includes major topics such as combinatorics, binary trees, boolean algebra, group, graph, probability, and set theory. \n\nread further to understand in-depth: [https://www.analyticssteps.com/blogs/7-major-branches-discrete-mathematics](https://www.analyticssteps.com/blogs/7-major-branches-discrete-mathematics)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/jw9ywi/7_major_branches_of_discrete_mathematics/',)", "identifyer": 5746963, "year": "2020"}, {"autor": "JashRathod99", "date": 1606633808000, "content": "Branches in artificial intelligence to transform your business /!/ [removed]", "link": "https://www.reddit.com/r/learnmachinelearning/comments/k354hx/branches_in_artificial_intelligence_to_transform/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "-----> branches !!!  in artificial intelligence to transform your business /!/ [removed]", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/k354hx/branches_in_artificial_intelligence_to_transform/',)", "identifyer": 5748222, "year": "2020"}, {"autor": "biohacker_tobe", "date": 1603988577000, "content": "Combining Different Regularization Methods /!/ Hello community,\n\nSo I've been exploring a bit the regularization methods present in deep learning models. Mostly just the use of Dropout Layers or  L1/L2 Regularization. I've seen people debate that they should be used in a separate manner or they can be combined. I've tried both approaches (combined and separate) and have seen promising results when actually combining as it has helped me not to overfit my models entirely while improving the r2 score.\n\n**Question**:\n\nIs is then possible to combine L1/L2 Regularization with Dropout Layer, or is it preferred to use them separately?\n\n*Example Code:*\n\n    def model_build(x_train):\n        # Define Inputs for ANN\n        input_layer = Input(shape = (x_train.shape[1],), name = \"Input\")\n        #Create Hidden ANN Layers\n        dense_layer = BatchNormalization(name = \"Normalization\")(input_layer)  \n        dense_layer = Dense(128, name = \"First_Layer\", activation = 'relu', kernel_regularizer=regularizers.l1(0.01))(dense_layer)\n        #dense_layer = Dropout(0.08)(dense_layer)\n        dense_layer = Dense(128, name = \"Second_Layer\", activation = 'relu',  kernel_regularizer=regularizers.l1(0.00))(dense_layer)\n        #dense_layer = Dropout(0.05)(dense_layer)\n    \n        #Apply Output Layers\n        output = Dense(1, name = \"Output\")(dense_layer)\n    \n        # Create an Interpretation Model (Accepts the inputs from branch and has single output)\n        model = Model(inputs = input_layer, outputs = output)\n    \n        # Compile the Model\n        model.compile(loss='mse', optimizer = Adam(lr = 0.01), metrics = ['mse'])\n        #model.compile(loss='mse', optimizer=AdaBound(lr=0.001, final_lr=0.1), metrics = ['mse'])", "link": "https://www.reddit.com/r/learnmachinelearning/comments/jkd60s/combining_different_regularization_methods/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "combining different regularization methods /!/ hello community,\n\nso i've been exploring a bit the regularization methods present in deep learning models. mostly just the use of dropout layers or  l1/l2 regularization. i've seen people debate that they should be used in a separate manner or they can be combined. i've tried both approaches (combined and separate) and have seen promising results when actually combining as it has helped me not to overfit my models entirely while improving the r2 score.\n\n**question**:\n\nis is then possible to combine l1/l2 regularization with dropout layer, or is it preferred to use them separately?\n\n*example code:*\n\n    def model_build(x_train):\n        # define inputs for ann\n        input_layer = input(shape = (x_train.shape[1],), name = \"input\")\n        #create hidden ann layers\n        dense_layer = batchnormalization(name = \"normalization\")(input_layer)  \n        dense_layer = dense(128, name = \"first_layer\", activation = 'relu', kernel_regularizer=regularizers.l1(0.01))(dense_layer)\n        #dense_layer = dropout(0.08)(dense_layer)\n        dense_layer = dense(128, name = \"second_layer\", activation = 'relu',  kernel_regularizer=regularizers.l1(0.00))(dense_layer)\n        #dense_layer = dropout(0.05)(dense_layer)\n    \n        #apply output layers\n        output = dense(1, name = \"output\")(dense_layer)\n    \n        # create an interpretation model (accepts the inputs from -----> branch !!!  and has single output)\n        model = model(inputs = input_layer, outputs = output)\n    \n        # compile the model\n        model.compile(loss='mse', optimizer = adam(lr = 0.01), metrics = ['mse'])\n        #model.compile(loss='mse', optimizer=adabound(lr=0.001, final_lr=0.1), metrics = ['mse'])", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/jkd60s/combining_different_regularization_methods/',)", "identifyer": 5748327, "year": "2020"}, {"autor": "EnigmaticMJ", "date": 1603987196000, "content": "ML Engineers: What is your preferred stack/process for a scalable CI/CD production ML Pipeline? /!/ New here, hoping it's okay to ask this sort of question. IMO, I don't see enough high-level discussions around this in the ML Community.\n\nI've recently transitioned from Software Engineering to ML Engineering, and have quickly realized how many different approaches there are to creating a continuously integrated ML pipeline. I'd love to get an idea of what some of the most popular strategies are.\n\n**I'm looking processes that fit the following requirements:**\n\n* Support multiple versioned models and datasets\n* Define scripts for querying, preprocessing, training, and deployment in git repository\n* Use CI/CD (eg Jenkins, Bamboo, CircleCI, etc) to automatically execute the ML pipeline for the modified model(s) upon master branch merges\n* CI/CD support for non-production environment(s) using something like [Gitlab Flow](https://docs.gitlab.com/ee/topics/gitlab_flow.html)\n* Automatic encoding on inference\n* Accuracy/drift monitoring of production models with trigger to execute the ML pipeline for any model that has drifted past a defined threshold\n\n&amp;#x200B;\n\n**As of right now, my current process is:**\n\n1. Single git repository for all models (been considering breaking this into multiple)\n   1. Python scripts for each model in separate directories\n   2. Separate scripts for each step of the pipeline (query, preprocess, train, deploy, etc)\n2. Jenkins pipeline uses Terraform to deploy scripts as AWS Lambdas (currently transitioning to AWS Step Functions for DAG pipelines)\n3. AWS CloudWatch Event Rules to trigger the Lambdas/Step Functions via cron schedules\n4. Query Lambda queries data warehouse (AWS Redshift) and stores unprocessed datasets per model in S3\n5. Preprocess Lambda loads unprocessed dataset from S3, preprocesses, and stores as new training and validation datasets in S3\n6. Training Lambda uses AWS SageMaker API to initialize a training job\n7. Deploy Lambda uses AWS SageMaker API to deploy trained model to a SageMaker Endpoint\n\n&amp;#x200B;\n\n**Problems with this process:**\n\n* All models are in a single repository, which makes it harder to trigger the pipeline for specific models upon merges to master. This also seems like it probably won't scale well as the number of models increases over time.\n* Non-backwards-compatible versioning of models has to be done with an entirely new model, since I don't have non-production environments with the current process\n* Don't currently have a way to monitor production model accuracy/drift", "link": "https://www.reddit.com/r/learnmachinelearning/comments/jkcpzj/ml_engineers_what_is_your_preferred_stackprocess/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "ml engineers: what is your preferred stack/process for a scalable ci/cd production ml pipeline? /!/ new here, hoping it's okay to ask this sort of question. imo, i don't see enough high-level discussions around this in the ml community.\n\ni've recently transitioned from software engineering to ml engineering, and have quickly realized how many different approaches there are to creating a continuously integrated ml pipeline. i'd love to get an idea of what some of the most popular strategies are.\n\n**i'm looking processes that fit the following requirements:**\n\n* support multiple versioned models and datasets\n* define scripts for querying, preprocessing, training, and deployment in git repository\n* use ci/cd (eg jenkins, bamboo, circleci, etc) to automatically execute the ml pipeline for the modified model(s) upon master -----> branch !!!  merges\n* ci/cd support for non-production environment(s) using something like [gitlab flow](https://docs.gitlab.com/ee/topics/gitlab_flow.html)\n* automatic encoding on inference\n* accuracy/drift monitoring of production models with trigger to execute the ml pipeline for any model that has drifted past a defined threshold\n\n&amp;#x200b;\n\n**as of right now, my current process is:**\n\n1. single git repository for all models (been considering breaking this into multiple)\n   1. python scripts for each model in separate directories\n   2. separate scripts for each step of the pipeline (query, preprocess, train, deploy, etc)\n2. jenkins pipeline uses terraform to deploy scripts as aws lambdas (currently transitioning to aws step functions for dag pipelines)\n3. aws cloudwatch event rules to trigger the lambdas/step functions via cron schedules\n4. query lambda queries data warehouse (aws redshift) and stores unprocessed datasets per model in s3\n5. preprocess lambda loads unprocessed dataset from s3, preprocesses, and stores as new training and validation datasets in s3\n6. training lambda uses aws sagemaker api to initialize a training job\n7. deploy lambda uses aws sagemaker api to deploy trained model to a sagemaker endpoint\n\n&amp;#x200b;\n\n**problems with this process:**\n\n* all models are in a single repository, which makes it harder to trigger the pipeline for specific models upon merges to master. this also seems like it probably won't scale well as the number of models increases over time.\n* non-backwards-compatible versioning of models has to be done with an entirely new model, since i don't have non-production environments with the current process\n* don't currently have a way to monitor production model accuracy/drift", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/jkcpzj/ml_engineers_what_is_your_preferred_stackprocess/',)", "identifyer": 5748328, "year": "2020"}, {"autor": "AssumeSmallAngle", "date": 1581595636000, "content": "Theoretical Physicist applying for ML PhDs /!/ I'm studying for a masters in TP but I'm thinking of moving over to ML for my PhD as most branches of TP no longer excite me enough to commit to a PhD.\n\nWhat skills would be necessary to apply/be considered?", "link": "https://www.reddit.com/r/learnmachinelearning/comments/f390d1/theoretical_physicist_applying_for_ml_phds/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "theoretical physicist applying for ml phds /!/ i'm studying for a masters in tp but i'm thinking of moving over to ml for my phd as most -----> branches !!!  of tp no longer excite me enough to commit to a phd.\n\nwhat skills would be necessary to apply/be considered?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 11, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/f390d1/theoretical_physicist_applying_for_ml_phds/',)", "identifyer": 5748557, "year": "2020"}, {"autor": "pmabz", "date": 1593126009000, "content": "Maps. Specifically routes on maps. /!/ \nMaps. Specifically routes on maps.\nHow does ML deal with maps and routes? I really don't comprehend how they even represent routes, roads. Properties and features of roads. How do you represent those?\n\nIs there a branch of ML related to this?\n\nCan someone point me to videos, articles, papers freely available to get me on the right track.\n\nApologies for the puns!", "link": "https://www.reddit.com/r/learnmachinelearning/comments/hfw5v5/maps_specifically_routes_on_maps/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "maps. specifically routes on maps. /!/ \nmaps. specifically routes on maps.\nhow does ml deal with maps and routes? i really don't comprehend how they even represent routes, roads. properties and features of roads. how do you represent those?\n\nis there a -----> branch !!!  of ml related to this?\n\ncan someone point me to videos, articles, papers freely available to get me on the right track.\n\napologies for the puns!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/hfw5v5/maps_specifically_routes_on_maps/',)", "identifyer": 5748770, "year": "2020"}, {"autor": "manishmanalath", "date": 1598339196000, "content": "A Beginner’s Guide To Natural Language Processing /!/ Natural Language Processing (NLP) is the branch of machine learning that helps computers interpret natural human language. In this article you will learn how NLP works along with real world use cases: [https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59](https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59)", "link": "https://www.reddit.com/r/learnmachinelearning/comments/ig7931/a_beginners_guide_to_natural_language_processing/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "a beginner’s guide to natural language processing /!/ natural language processing (nlp) is the -----> branch !!!  of machine learning that helps computers interpret natural human language. in this article you will learn how nlp works along with real world use cases: [https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59](https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/ig7931/a_beginners_guide_to_natural_language_processing/',)", "identifyer": 5751236, "year": "2020"}, {"autor": "doyougitme", "date": 1607956749000, "content": "What does your Data Science/ML dev toolbox look like? /!/ I've been working in ML/Computer Vision/Data Science for 4 years now. Recently I ventured out into non-data-science dev world and found an insane number of tools to help make the dev life better. Every problem seems to have multiple tools aimed at addressing it. Take Continuous Integration (CI) an example. You don't need me enumerating the number of \"solutions\" aimed at addressing the day-to-day pain of working with, testing and collaborating on code.\n\nIt made me realise that my toolbox for doing data-science/ML by comparison is incredibly hacky. At my last company, each ML engineer had their datasets on their own computer that they'd copy from the internet (or from a shared samba drive if it was proprietary). Experiments were a mishmash of Jupyter Notebooks, Python scripts and manual path configs. When it came to sharing your work, you'd commit/push/merge you git branch for the code part, but you'd manually point your colleagues to the right files in the Samba share to replicate your project. Needless to say things got pretty chaotic.\n\nMaybe it's just me but that seems very definitively sub-optimal. Am I missing something? Is there a whole cache of dev-tools aimed at working with data that I'm not aware of? Are Jupyter Notebooks the best we have? Would love to hear what other people use day-to-day to make sense of the data &lt;==&gt; code madness.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/kcyt57/what_does_your_data_scienceml_dev_toolbox_look/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "what does your data science/ml dev toolbox look like? /!/ i've been working in ml/computer vision/data science for 4 years now. recently i ventured out into non-data-science dev world and found an insane number of tools to help make the dev life better. every problem seems to have multiple tools aimed at addressing it. take continuous integration (ci) an example. you don't need me enumerating the number of \"solutions\" aimed at addressing the day-to-day pain of working with, testing and collaborating on code.\n\nit made me realise that my toolbox for doing data-science/ml by comparison is incredibly hacky. at my last company, each ml engineer had their datasets on their own computer that they'd copy from the internet (or from a shared samba drive if it was proprietary). experiments were a mishmash of jupyter notebooks, python scripts and manual path configs. when it came to sharing your work, you'd commit/push/merge you git -----> branch !!!  for the code part, but you'd manually point your colleagues to the right files in the samba share to replicate your project. needless to say things got pretty chaotic.\n\nmaybe it's just me but that seems very definitively sub-optimal. am i missing something? is there a whole cache of dev-tools aimed at working with data that i'm not aware of? are jupyter notebooks the best we have? would love to hear what other people use day-to-day to make sense of the data &lt;==&gt; code madness.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/kcyt57/what_does_your_data_scienceml_dev_toolbox_look/',)", "identifyer": 5752269, "year": "2020"}], "name": "branchlearnmachinelearning2020"}