{"interestingcomments": [{"autor": "QuietCow5", "date": 1579527910000, "content": "Ask me about my project /!/ I'm currently doing my bachelor's degree and I'm working on automated yield estimation of oranges. I've created a basic idea document for you guys to see what the project is actually about. I would love to hear your thoughts and questions that come in your mind because I have my project defense coming up in a few days. So throw your questions at me.  \n\n\n**Automated yield estimation of oranges:** \n\nPakistan is among the top ten producers of oranges. Due to this, most of the target export markets of oranges are those of developing countries. This leads to the increasing demand for oranges during winters which puts a significant burden on the agriculture sector. Modern technologies are not being adopted by farmers in Pakistan, which propels them to manually count the fruit for yield estimation. This increases manual labor and decrease in overall profit. With the use of automated yield estimation, current production can be maximized through automation, image processing, computer vision, artificial intelligence, and machine learning. The estimated yield of Oranges on trees will be given as a result. In the long run, automated yield estimation can reduce labor force requirement, decrease costs, increase efficiency and boost agricultural production.\n\nDrones will be used to capture 360° images of trees. With the help of image processing and AI/ML techniques images will be segmented and data of the oranges will be extracted from images. Global coordinates will then be allocated to record various detections of the same orange to reduce over counting.\n\n**The main objective** of this project is to estimate the yield of oranges on trees with minimum error as well as improved accuracy to enhance the quality of oranges, which, in turn, will reduce operating costs. \n\n**In conclusion**, Pakistan needs automated yield estimation to increase its agricultural output. Not only will it speed up oranges harvesting, but it will also prevent oranges from rotting before reaching its destination. Automated yield estimation is needed that may enable the local farmers to make their livelihood under harsh situations. In summary, the use of automated yield estimation could mean more income for farmers, more taxes and foreign reserves for the government.\n\n&amp;#x200B;\n\nPlease let me know what you think of this and if you have any questions.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/erddjv/ask_me_about_my_project/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "ask me about my project /!/ i'm currently doing my bachelor's degree and i'm working on automated yield estimation of oranges. i've created a basic idea document for you guys to see what the project is actually about. i would love to hear your thoughts and questions that come in your mind because i have my project defense coming up in a few days. so throw your questions at me.  \n\n\n**automated yield estimation of oranges:** \n\npakistan is among the top ten producers of oranges. due to this, most of the target export markets of oranges are those of developing countries. this leads to the increasing demand for oranges during winters which puts a significant burden on the agriculture sector. modern technologies are not being adopted by farmers in pakistan, which propels them to manually count the fruit for yield estimation. this increases manual labor and decrease in overall profit. with the use of automated yield estimation, current production can be maximized through automation, image processing, computer vision, artificial intelligence, and machine learning. the estimated yield of oranges on trees will be given as a result. in the long run, automated yield estimation can reduce labor force requirement, decrease costs, increase efficiency and boost agricultural production.\n\ndrones will be used to capture 360° images of trees. with the help of image processing and ai/ml techniques images will be segmented and data of the oranges will be extracted from images. global coordinates will then be allocated to record various detections of the same orange to reduce over counting.\n\n**the main objective** of this project is to estimate the yield of oranges on trees with minimum error as well as improved accuracy to enhance the quality of oranges, which, in turn, will reduce operating costs. \n\n**in conclusion**, pakistan needs automated yield estimation to increase its agricultural output. not only will it speed up oranges -----> harvesting !!! , but it will also prevent oranges from rotting before reaching its destination. automated yield estimation is needed that may enable the local farmers to make their livelihood under harsh situations. in summary, the use of automated yield estimation could mean more income for farmers, more taxes and foreign reserves for the government.\n\n&amp;#x200b;\n\nplease let me know what you think of this and if you have any questions.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/erddjv/ask_me_about_my_project/',)", "identifyer": 5747605, "year": "2020"}], "name": "harvestinglearnmachinelearning2020"}