{"interestingcomments": [{"autor": "leockl", "date": 1599291734000, "content": "What is ‘objective’ = ’binary:logitraw’ in XGBClassifier? /!/ For classification tasks with XGBoost, I know the parameter ‘objective’ = ’binary:logistic’ means specifying a binary classification task with objective function using probability. From my understanding, probability here is just calculating the positive class instances in each leaf of the decision tree. \n\nWhat does then the parameter ‘objective’ = ’binary:logitraw’ do? Documentation here (https://xgboost.readthedocs.io/en/latest/parameter.html) states this means “logistic regression for binary classification, output score before logistic transformation”. What does it mean by “output score before logistic regression”, especially since probability here is calculating the positive class instances in each leaf of the decision tree, so it doesn’t make sense to me that there would be a “logistic transformation” involved?", "link": "https://www.reddit.com/r/learnmachinelearning/comments/imx6ga/what_is_objective_binarylogitraw_in_xgbclassifier/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "what is ‘objective’ = ’binary:logitraw’ in xgbclassifier? /!/ for classification tasks with xgboost, i know the parameter ‘objective’ = ’binary:logistic’ means specifying a binary classification task with objective function using probability. from my understanding, probability here is just calculating the positive class instances in each -----> leaf !!!  of the decision tree. \n\nwhat does then the parameter ‘objective’ = ’binary:logitraw’ do? documentation here (https://xgboost.readthedocs.io/en/latest/parameter.html) states this means “logistic regression for binary classification, output score before logistic transformation”. what does it mean by “output score before logistic regression”, especially since probability here is calculating the positive class instances in each leaf of the decision tree, so it doesn’t make sense to me that there would be a “logistic transformation” involved?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/imx6ga/what_is_objective_binarylogitraw_in_xgbclassifier/',)", "identifyer": 5746303, "year": "2020"}, {"autor": "django_free", "date": 1586529395000, "content": "How to use transfer learning for specific classification? /!/ I'm working on a project where I have to classify different types of leaf diseases based on the images.\n\nHow do I introduce transfer learning to increase my accuracy?\n\nI already tried vgg19 and resnet50 where I just used their weights as the starting weights of my model but accuracy decreased because of that\n\nIs there another way to use transfer learning?", "link": "https://www.reddit.com/r/learnmachinelearning/comments/fygxvp/how_to_use_transfer_learning_for_specific/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "how to use transfer learning for specific classification? /!/ i'm working on a project where i have to classify different types of -----> leaf !!!  diseases based on the images.\n\nhow do i introduce transfer learning to increase my accuracy?\n\ni already tried vgg19 and resnet50 where i just used their weights as the starting weights of my model but accuracy decreased because of that\n\nis there another way to use transfer learning?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/fygxvp/how_to_use_transfer_learning_for_specific/',)", "identifyer": 5747770, "year": "2020"}, {"autor": "indigo_whiskey", "date": 1597423742000, "content": "Seeking advice for frequency analysis model /!/ I'm attempting to teach a RNN to learn to accurately infer whether a sequence of consecutive characters are common/possible within the English language, using an extension of frequency analysis.\n\nUsing bulk text files, I've collated some data which contain the sequence of letters and the count of occurrences within the source text, which is to be used as the categorical output data. The source data set contains all repeating permutations of A-Z for n characters in length, and a count.\n\nFor example using a sample length of 4, if the source text reads 'The lazy fox jumps the leaf', a single line in the data set would contain 'FOXJ' = 1 and 'THEL' = 2, whereas 'AAAA' = 0, and 'ZZZZ' = 0, where spaces and other non-alphabetic characters are removed.\n\nCan anyone advise me on a model which is suitable for this application? My implementations to date only achieve a 0.43 accuracy via simple Embedding(26,64) LSTM(64) + Dense(64) + Dense(2) model, so I'm looking for a fresh think on the correct model architecture. Output categorical classification should accurately predict English or Not English.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/i9pix6/seeking_advice_for_frequency_analysis_model/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "seeking advice for frequency analysis model /!/ i'm attempting to teach a rnn to learn to accurately infer whether a sequence of consecutive characters are common/possible within the english language, using an extension of frequency analysis.\n\nusing bulk text files, i've collated some data which contain the sequence of letters and the count of occurrences within the source text, which is to be used as the categorical output data. the source data set contains all repeating permutations of a-z for n characters in length, and a count.\n\nfor example using a sample length of 4, if the source text reads 'the lazy fox jumps the -----> leaf !!! ', a single line in the data set would contain 'foxj' = 1 and 'thel' = 2, whereas 'aaaa' = 0, and 'zzzz' = 0, where spaces and other non-alphabetic characters are removed.\n\ncan anyone advise me on a model which is suitable for this application? my implementations to date only achieve a 0.43 accuracy via simple embedding(26,64) lstm(64) + dense(64) + dense(2) model, so i'm looking for a fresh think on the correct model architecture. output categorical classification should accurately predict english or not english.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/i9pix6/seeking_advice_for_frequency_analysis_model/',)", "identifyer": 5753581, "year": "2020"}], "name": "leaflearnmachinelearning2020"}