{"interestingcomments": [{"autor": "Ok_Cryptographer2209", "date": 1597989092000, "content": "Classify a group of individuals/ units to a group attribute or outcome (Whats the method?) /!/ I am very stuck right now.  Would welcome some help. \n\nI am having some troubles coming up with a way of formulating or matching my problem with the types of networks that I know. \n\nWhat is the proper model to use if I am looking to classify a group of individuals/ units\n\n&amp;#x200B;\n\nFor example, \n\na football line up where each player has say 4 main characteristic (40 yard time, height, weight, cardinal position on the field) \n\ngiven a group of random players, I want to rank the probably of certain plays.  Or the probability that the roster belongs to a certain team.  \n\n&amp;#x200B;\n\nOr, given a group of notes/ sound where I have numerical representation of sound say (frequency, amplitude and duration), I want to classify that this group of sounds most likely belongs to which genre of music or if it is even music.  \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAny help is much appreciated.  I am just very stuck, if you can discuss, enlighten, forward papers, examples, courses, degrees? (jk) I would be very grateful.", "link": "https://www.reddit.com/r/learnmachinelearning/comments/idr5hg/classify_a_group_of_individuals_units_to_a_group/", "origin": "Reddit", "suborigin": "learnmachinelearning", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "classify a group of individuals/ units to a group attribute or outcome (whats the method?) /!/ i am very stuck right now.  would welcome some help. \n\ni am having some troubles coming up with a way of formulating or matching my problem with the types of networks that i know. \n\nwhat is the proper model to use if i am looking to classify a group of individuals/ units\n\n&amp;#x200b;\n\nfor example, \n\na football line up where each player has say 4 main characteristic (40 -----> yard !!!  time, height, weight, cardinal position on the field) \n\ngiven a group of random players, i want to rank the probably of certain plays.  or the probability that the roster belongs to a certain team.  \n\n&amp;#x200b;\n\nor, given a group of notes/ sound where i have numerical representation of sound say (frequency, amplitude and duration), i want to classify that this group of sounds most likely belongs to which genre of music or if it is even music.  \n\n&amp;#x200b;\n\n&amp;#x200b;\n\nany help is much appreciated.  i am just very stuck, if you can discuss, enlighten, forward papers, examples, courses, degrees? (jk) i would be very grateful.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/learnmachinelearning/comments/idr5hg/classify_a_group_of_individuals_units_to_a_group/',)", "identifyer": 5743158, "year": "2020"}], "name": "yardlearnmachinelearning2020"}