{"interestingcomments": [{"Unnamed: 0": 291455, "autor": "LastSonofKunLun", "date": 1614345725000, "content": "Suggestions for a wide angle lens for R5? /!/ When I bought my R5, one of the lenses I traded in was a Sigma 14-24 DG DN Art lens. I had some really nice results with it on location with a model and was looking forward to experimenting with it more.\n\nFast forward to now, and I have an impending shoot (late April) at the same location, but no wide angle lens. With it being unlikely that Sigma will announce and release an RF version of that lens in the next two months, I need to start considering other options.\n\nWhat are your recommendations for wide angle lenses? Right now, I'm mostly looking at the RF 15-35mm f/2.8. But is there an EF lens to adapt to the body that I should be paying more attention to?", "link": "https://www.reddit.com/r/canon/comments/lsxktv/suggestions_for_a_wide_angle_lens_for_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "suggestions for a wide angle lens for r5? /!/ when i bought my r5, one of the lenses i traded in was a sigma 14-24 dg dn art lens. i had some really nice results with it on -----> location !!!  with a model and was looking forward to experimenting with it more.\n\nfast forward to now, and i have an impending shoot (late april) at the same location, but no wide angle lens. with it being unlikely that sigma will announce and release an rf version of that lens in the next two months, i need to start considering other options.\n\nwhat are your recommendations for wide angle lenses? right now, i'm mostly looking at the rf 15-35mm f/2.8. but is there an ef lens to adapt to the body that i should be paying more attention to?", "sortedWord": "None", "identifyer": 38007, "year": "2021"}, {"Unnamed: 0": 291644, "autor": "Silent_Spectator_04", "date": 1611987067000, "content": "Canon RP + RF 35mm f/1.8. Got the rf 35 recently and was surprised by how sharp it is. Location : Cannon Beach, Oregon.", "link": "https://www.reddit.com/r/canon/comments/l8fgjb/canon_rp_rf_35mm_f18_got_the_rf_35_recently_and/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon rp + rf 35mm f/1.8. got the rf 35 recently and was surprised by how sharp it is. -----> location !!!  : cannon beach, oregon.", "sortedWord": "None", "identifyer": 38198, "year": "2021"}, {"Unnamed: 0": 291689, "autor": "foxer720", "date": 1611848587000, "content": "Canon EOS RP lens advice /!/ Beginner here. I've been shooting and learning about photography for a few months with my RP and nifty 50 RF f/1.8. I'm having a blast learning to get the composition I want with a prime,  but of course want to build out my lens kit to expand options. I will continue using the 50 for portraits and street photography.\n\nMy primary interest lies in landscape photography. I plan to use the camera hiking, backpacking, and ski touring. My primary locations are redwood forests and seascapes around Santa Cruz, and the Sierra. My original plan is to pickup the Tamron EF 17-35mm f/2.8-4 used. Then sometime in the future (6 months to a year) buy a telephoto like the Canon EF 70-200 f/4L IS used. I already have the RF/EF adapter.\n\nYesterday I started reading about the Canon RF 24-240 F4-6.3 IS. I realize this lens has compromises, but seems decent overall. One of my biggest concerns with this lens is lack of weather sealing and whether I can avoid ruining it while backpacking and skiing. The biggest appeal of this lens is obviously the huge focal range it covers. I don't see myself carrying both an UWA and telephoto for long hikes and skiing. I would pick a lens for the day or trip and live with the confines of that lens.\n\nOption 1: Buy Tamron EF 17-35 now and save for a telephoto down the road.\n\nOption 2: Buy the Canon RF 24-240 now and be done (hopefully) buying lenses for the time being. \n\nAny feedback/advice appreciated!", "link": "https://www.reddit.com/r/canon/comments/l7043l/canon_eos_rp_lens_advice/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon eos rp lens advice /!/ beginner here. i've been shooting and learning about photography for a few months with my rp and nifty 50 rf f/1.8. i'm having a blast learning to get the composition i want with a prime,  but of course want to build out my lens kit to expand options. i will continue using the 50 for portraits and street photography.\n\nmy primary interest lies in landscape photography. i plan to use the camera hiking, backpacking, and ski touring. my primary -----> locations !!!  are redwood forests and seascapes around santa cruz, and the sierra. my original plan is to pickup the tamron ef 17-35mm f/2.8-4 used. then sometime in the future (6 months to a year) buy a telephoto like the canon ef 70-200 f/4l is used. i already have the rf/ef adapter.\n\nyesterday i started reading about the canon rf 24-240 f4-6.3 is. i realize this lens has compromises, but seems decent overall. one of my biggest concerns with this lens is lack of weather sealing and whether i can avoid ruining it while backpacking and skiing. the biggest appeal of this lens is obviously the huge focal range it covers. i don't see myself carrying both an uwa and telephoto for long hikes and skiing. i would pick a lens for the day or trip and live with the confines of that lens.\n\noption 1: buy tamron ef 17-35 now and save for a telephoto down the road.\n\noption 2: buy the canon rf 24-240 now and be done (hopefully) buying lenses for the time being. \n\nany feedback/advice appreciated!", "sortedWord": "None", "identifyer": 38244, "year": "2021"}, {"Unnamed: 0": 291941, "autor": "KhGamed", "date": 1625100817000, "content": "sl3/250 battery for a video shoot? How long does it last? /!/ I am planning on shooting a 3 minute short film in one day/one location and i only have this ONE battery *lp e17* for my sl3\nHow long does it last on average considering i wont be  continuously shooting video but intead most of the time will be spent on setting the scene and fixing the cameras position and focus", "link": "https://www.reddit.com/r/canon/comments/obap7w/sl3250_battery_for_a_video_shoot_how_long_does_it/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sl3/250 battery for a video shoot? how long does it last? /!/ i am planning on shooting a 3 minute short film in one day/one -----> location !!!  and i only have this one battery *lp e17* for my sl3\nhow long does it last on average considering i wont be  continuously shooting video but intead most of the time will be spent on setting the scene and fixing the cameras position and focus", "sortedWord": "None", "identifyer": 38499, "year": "2021"}, {"Unnamed: 0": 292410, "autor": "Local_Anywhere", "date": 1613087255000, "content": "\"Could not find the server. Check the SMTP server settings and the DNS settings\" /!/ Hi,\n\nI am trying to set up  scan and send to email in our Canon printer. When users attempt to scan and send, the printer scans the documents but fails to send. This is also visible in the Status Monitor on the printer under Send &gt; Job Log which gives error code #801\n\nWe use O365 and Outlook for correspondence. I have created an O3565 account specifically for scan and send, and this account is configured as follows:\n\nProtocol: SMTP\n\nSMTP Server: smtp.office365.com\n\nPort: 587 (SSL)\n\nOn the Canon printer's Remote UI accessible from a browser, the SMTP details are correct under Settings/Registration : Function Settings : Send &gt; Network Settings - E-Mail/I-Fax Settings. I have also validated these on the printer itself.\n\nI can \"Check SMTP Connection\" from the above location on the printer with the following appearing after a few seconds:\n\n*\"Could not find the server. Check the SMTP server settings, the DNS settings, and the SMTP server status.\"*\n\nI'm out of ideas to troubleshoot this further! Any assistance from the community is much appreciated.", "link": "https://www.reddit.com/r/canon/comments/lhybum/could_not_find_the_server_check_the_smtp_server/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "\"could not find the server. check the smtp server settings and the dns settings\" /!/ hi,\n\ni am trying to set up  scan and send to email in our canon printer. when users attempt to scan and send, the printer scans the documents but fails to send. this is also visible in the status monitor on the printer under send &gt; job log which gives error code #801\n\nwe use o365 and outlook for correspondence. i have created an o3565 account specifically for scan and send, and this account is configured as follows:\n\nprotocol: smtp\n\nsmtp server: smtp.office365.com\n\nport: 587 (ssl)\n\non the canon printer's remote ui accessible from a browser, the smtp details are correct under settings/registration : function settings : send &gt; network settings - e-mail/i-fax settings. i have also validated these on the printer itself.\n\ni can \"check smtp connection\" from the above -----> location !!!  on the printer with the following appearing after a few seconds:\n\n*\"could not find the server. check the smtp server settings, the dns settings, and the smtp server status.\"*\n\ni'm out of ideas to troubleshoot this further! any assistance from the community is much appreciated.", "sortedWord": "None", "identifyer": 38978, "year": "2021"}, {"Unnamed: 0": 292520, "autor": "Tygrius", "date": 1614094429000, "content": "Help with some kind of \"glare\" in my images /!/ I have owned a Canon t2i for about 7-8 years now, and I recently took it down on a trip to Jamaica.  When I got home and was reviewing the footage, I noticed there is some kind of glare where the top left corner of the image is brighter than the rest, in the exact same shape across multiple images.  At first I thought maybe it was just a shadow form from how I was standing, but the location stayed consistent despite where I was shooting on the resort.  I've used both lenses I own (55-250 and 18-55) and the same \"glare\" occurs in the same spot, so I figure it must be the camera itself.  I've cleaned the sensors/mirror and retested, and I'm still getting this same issue.  \n\n\nAny thoughts/tips/suggestions are greatly appreciated!!!\n\nhttps://preview.redd.it/6o9osohhx8j61.jpg?width=1902&amp;format=pjpg&amp;auto=webp&amp;s=28874f1a7d9502077247a4b4ba4f7d14acef1220", "link": "https://www.reddit.com/r/canon/comments/lql47a/help_with_some_kind_of_glare_in_my_images/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help with some kind of \"glare\" in my images /!/ i have owned a canon t2i for about 7-8 years now, and i recently took it down on a trip to jamaica.  when i got home and was reviewing the footage, i noticed there is some kind of glare where the top left corner of the image is brighter than the rest, in the exact same shape across multiple images.  at first i thought maybe it was just a shadow form from how i was standing, but the -----> location !!!  stayed consistent despite where i was shooting on the resort.  i've used both lenses i own (55-250 and 18-55) and the same \"glare\" occurs in the same spot, so i figure it must be the camera itself.  i've cleaned the sensors/mirror and retested, and i'm still getting this same issue.  \n\n\nany thoughts/tips/suggestions are greatly appreciated!!!\n\nhttps://preview.redd.it/6o9osohhx8j61.jpg?width=1902&amp;format=pjpg&amp;auto=webp&amp;s=28874f1a7d9502077247a4b4ba4f7d14acef1220", "sortedWord": "None", "identifyer": 39091, "year": "2021"}, {"Unnamed: 0": 294076, "autor": "RFDMessenger", "date": 1631477608000, "content": "Canadians: Canon Road Trip is back if you want to try new EOS R lenses and bodies /!/ https://canonroadtrip.ca/\n\nDrove down to Calgary to try the R6 last year and it convinced me that I should add it to my future gear list. Was my first time shooting with a full-frame body and lens so the event was essential for me to have a feel of what a full kit feels like. They've since expanded to more locations and are spanning the event longer than one month, unlike last year. I also enjoy how they sub-contract local camera store employees and models to help out for the day as well.", "link": "https://www.reddit.com/r/canon/comments/pn066u/canadians_canon_road_trip_is_back_if_you_want_to/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canadians: canon road trip is back if you want to try new eos r lenses and bodies /!/ https://canonroadtrip.ca/\n\ndrove down to calgary to try the r6 last year and it convinced me that i should add it to my future gear list. was my first time shooting with a full-frame body and lens so the event was essential for me to have a feel of what a full kit feels like. they've since expanded to more -----> locations !!!  and are spanning the event longer than one month, unlike last year. i also enjoy how they sub-contract local camera store employees and models to help out for the day as well.", "sortedWord": "None", "identifyer": 40684, "year": "2021"}, {"Unnamed: 0": 294268, "autor": "IamTrainerJJ", "date": 1635270328000, "content": "[Showcase: Canon Bird Photography - Canon 7D + EF 28-135mm F/3.5-5.6 IS USM (100mm, f/6.3, 1/125, ISO 125) - American Avocet Preens its Feathers] /!/ &amp;#x200B;\n\n[Location: Monterey Bay Aquarium](https://preview.redd.it/r8ad8fs1ztv71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=be8d7d4ec358a2305106ae19a280a6b94cb5fd4d)", "link": "https://www.reddit.com/r/canon/comments/qgbvcw/showcase_canon_bird_photography_canon_7d_ef/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "[showcase: canon bird photography - canon 7d + ef 28-135mm f/3.5-5.6 is usm (100mm, f/6.3, 1/125, iso 125) - american avocet preens its feathers] /!/ &amp;#x200b;\n\n[-----> location !!! : monterey bay aquarium](https://preview.redd.it/r8ad8fs1ztv71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=be8d7d4ec358a2305106ae19a280a6b94cb5fd4d)", "sortedWord": "None", "identifyer": 40880, "year": "2021"}, {"Unnamed: 0": 295122, "autor": "300_Months", "date": 1618461802000, "content": "Canon EF 70-200mm f/2.8L vs. EF 50mm f/1.2L? /!/ I’m shooting a talking head documentary with the Canon C200 as my main camera.\n\nIn the past I’ve used my Canon EF 70-200mm f/2.8L IS II , but it’s so big and heavy it’s not fun to lug around. Plus, being at 70mm still means the camera has to be quite a distance from the subject which can be tricky when shooting in a variety of settings and locations.\n\nI’m thinking about getting the Canon EF 50mm f/1.2 L lens to use instead. What do you think? I love the look of the 70mm-200mm so I’m worried the footage won’t look as good. But, it would be much easier, lighter, and more versatile. Thoughts?\n\nAny thoughts or tips would be greatly appreciated. Thanks!", "link": "https://www.reddit.com/r/canon/comments/mr7qce/canon_ef_70200mm_f28l_vs_ef_50mm_f12l/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon ef 70-200mm f/2.8l vs. ef 50mm f/1.2l? /!/ i’m shooting a talking head documentary with the canon c200 as my main camera.\n\nin the past i’ve used my canon ef 70-200mm f/2.8l is ii , but it’s so big and heavy it’s not fun to lug around. plus, being at 70mm still means the camera has to be quite a distance from the subject which can be tricky when shooting in a variety of settings and -----> locations !!! .\n\ni’m thinking about getting the canon ef 50mm f/1.2 l lens to use instead. what do you think? i love the look of the 70mm-200mm so i’m worried the footage won’t look as good. but, it would be much easier, lighter, and more versatile. thoughts?\n\nany thoughts or tips would be greatly appreciated. thanks!", "sortedWord": "None", "identifyer": 41748, "year": "2021"}, {"Unnamed: 0": 295238, "autor": "MisterSynergy", "date": 1619095270000, "content": "Canon AC adapters for DSLRs: pricing and availability; aftermarket replacements /!/ I am looking to buy an AC adapter (AC-E6N) and a DC coupler (DR-E6) for my Canon EOS 80D, in order to run it on a stationary power supply rather than with a battery.\n\n* The price apparently is 129 Euro each \\[1\\]\\[2\\] in my location, i.e. 258 Euro in total.\n* Both items are not available for quite a while now, neither from Canon directly nor from anywhere else as much as I am aware.\n\nThis raises some questions:\n\n* Why are these items so expensive? 1/10th of the mentioned price, or something between 25 and 50 Euro, would seem more appropriate. I assume there isn't much fancy tech in them, right?\n* Why are they out of stock basically all the time?\n* There are some aftermarket replacements available on Amazon for reasonable money; it seems most of them are imports from China. Are they any good and safe to use? What to consider when selecting one? Can anyone make recommendations of has experience?\n\nThanks in advance for any input.\n\n&amp;#x200B;\n\n\\[1\\] [https://store.canon.de/canon-ac-e6n-netzadapter/1425C007/](https://store.canon.de/canon-ac-e6n-netzadapter/1425C007/)\n\n\\[2\\] [https://store.canon.de/canon-dr-e6-gleichstromkuppler/3352B001/](https://store.canon.de/canon-dr-e6-gleichstromkuppler/3352B001/)", "link": "https://www.reddit.com/r/canon/comments/mw3um1/canon_ac_adapters_for_dslrs_pricing_and/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon ac adapters for dslrs: pricing and availability; aftermarket replacements /!/ i am looking to buy an ac adapter (ac-e6n) and a dc coupler (dr-e6) for my canon eos 80d, in order to run it on a stationary power supply rather than with a battery.\n\n* the price apparently is 129 euro each \\[1\\]\\[2\\] in my -----> location !!! , i.e. 258 euro in total.\n* both items are not available for quite a while now, neither from canon directly nor from anywhere else as much as i am aware.\n\nthis raises some questions:\n\n* why are these items so expensive? 1/10th of the mentioned price, or something between 25 and 50 euro, would seem more appropriate. i assume there isn't much fancy tech in them, right?\n* why are they out of stock basically all the time?\n* there are some aftermarket replacements available on amazon for reasonable money; it seems most of them are imports from china. are they any good and safe to use? what to consider when selecting one? can anyone make recommendations of has experience?\n\nthanks in advance for any input.\n\n&amp;#x200b;\n\n\\[1\\] [https://store.canon.de/canon-ac-e6n-netzadapter/1425c007/](https://store.canon.de/canon-ac-e6n-netzadapter/1425c007/)\n\n\\[2\\] [https://store.canon.de/canon-dr-e6-gleichstromkuppler/3352b001/](https://store.canon.de/canon-dr-e6-gleichstromkuppler/3352b001/)", "sortedWord": "None", "identifyer": 41866, "year": "2021"}, {"Unnamed: 0": 295325, "autor": "happinessnow12", "date": 1623203694000, "content": "Help! please. /!/ Hello,\n\n&amp;#x200B;\n\nI'm sure you all probably get this question a lot. But, I'm shooting a wedding on Friday and I never have. Let me preface, I would absolutely under any normal circumstances say No! I don't have the experience etc., however my friend is in a bind, her photographer called her this evening and cancelled for Friday, he was unable to get a replacement so he gave her a full refund. \n\n&amp;#x200B;\n\nEnter, me. \n\n&amp;#x200B;\n\n**Experience**: Hobbyist, who's favourite photography is landscape. I do make a little money doing family shoots for friends and family members. I have 4 families who I photograph every year, and have done the odd couples shoots, and new born shoots.\n\n&amp;#x200B;\n\n**Gear:** Canon 6D, 24-104 f4L, 50 f1.8 (I will get memory cards for the event, and have 2 spare batteries) Edit with Lightroom and occasionally photoshop.\n\n&amp;#x200B;\n\n**Situation:** Evening wedding, 6 PM (sunset close to 10pm), outdoor. 20 guests  plus, bride, groom, and one attendant each. They will be doing a first look, and couples pictures, and wedding party pictures in the morning/afternoon. \n\n&amp;#x200B;\n\n**My plan:** \n\n* Getting ready pictures, bride, possibly groom- they have said the bride getting ready is the only must.\n* First look- A little nervous about this, I want to get the reactions. **Any advice on this sooo appreciated.**\n* couples pictures, these are being shot at a location I am very familiar with, this is possibly the part I feel most comfortable with.\n* Group shots with bridal party, and parents. Pretty confident about this part too.\n* **The ceremony:** they will have 2 rows of 5 seats on each side of the \"aisle\" no real aisle, its in her parents very beautiful backyard. I was planning on getting groom waiting, then being at the front, but kind of to the side to get the bride walking down, then moving to the back to get some of them saying their vows, then maybe a wide shot of everyone watching them. Staying at the back to get them walking off together. (There is a rehearsal ceremony tomorrow evening)\n* The after ceremony- They have some picnic tables set up, and will be having a BBQ, there will like be some speeches, I'll get some pictures here. And then cake cutting. \n* The party- I will not be staying for the whole party, by this time it will be 8pm-ish, so less light, but still light. I will get the important dance pictures, bride-groom, bride-dad, groom-mom. And probably a few of the party goers having fun before I leave around 9.\n\n&amp;#x200B;\n\nSo all in all, start at 1030 am go until 9pm at night.\n\n&amp;#x200B;\n\nAny and all advice is appreciated. I have already talked to them about managing expectations, they know I am not a pro, but it is either, me or cell phone pictures from the guests...", "link": "https://www.reddit.com/r/canon/comments/nvkgb0/help_please/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help! please. /!/ hello,\n\n&amp;#x200b;\n\ni'm sure you all probably get this question a lot. but, i'm shooting a wedding on friday and i never have. let me preface, i would absolutely under any normal circumstances say no! i don't have the experience etc., however my friend is in a bind, her photographer called her this evening and cancelled for friday, he was unable to get a replacement so he gave her a full refund. \n\n&amp;#x200b;\n\nenter, me. \n\n&amp;#x200b;\n\n**experience**: hobbyist, who's favourite photography is landscape. i do make a little money doing family shoots for friends and family members. i have 4 families who i photograph every year, and have done the odd couples shoots, and new born shoots.\n\n&amp;#x200b;\n\n**gear:** canon 6d, 24-104 f4l, 50 f1.8 (i will get memory cards for the event, and have 2 spare batteries) edit with lightroom and occasionally photoshop.\n\n&amp;#x200b;\n\n**situation:** evening wedding, 6 pm (sunset close to 10pm), outdoor. 20 guests  plus, bride, groom, and one attendant each. they will be doing a first look, and couples pictures, and wedding party pictures in the morning/afternoon. \n\n&amp;#x200b;\n\n**my plan:** \n\n* getting ready pictures, bride, possibly groom- they have said the bride getting ready is the only must.\n* first look- a little nervous about this, i want to get the reactions. **any advice on this sooo appreciated.**\n* couples pictures, these are being shot at a -----> location !!!  i am very familiar with, this is possibly the part i feel most comfortable with.\n* group shots with bridal party, and parents. pretty confident about this part too.\n* **the ceremony:** they will have 2 rows of 5 seats on each side of the \"aisle\" no real aisle, its in her parents very beautiful backyard. i was planning on getting groom waiting, then being at the front, but kind of to the side to get the bride walking down, then moving to the back to get some of them saying their vows, then maybe a wide shot of everyone watching them. staying at the back to get them walking off together. (there is a rehearsal ceremony tomorrow evening)\n* the after ceremony- they have some picnic tables set up, and will be having a bbq, there will like be some speeches, i'll get some pictures here. and then cake cutting. \n* the party- i will not be staying for the whole party, by this time it will be 8pm-ish, so less light, but still light. i will get the important dance pictures, bride-groom, bride-dad, groom-mom. and probably a few of the party goers having fun before i leave around 9.\n\n&amp;#x200b;\n\nso all in all, start at 1030 am go until 9pm at night.\n\n&amp;#x200b;\n\nany and all advice is appreciated. i have already talked to them about managing expectations, they know i am not a pro, but it is either, me or cell phone pictures from the guests...", "sortedWord": "None", "identifyer": 41958, "year": "2021"}, {"Unnamed: 0": 295409, "autor": "boolean_union", "date": 1622885628000, "content": "File numbering - best practices? /!/ Currently, when I get to IMG_9999, I start using 'Bulk Rename Utility' to insert a letter in the file name.  So, when IMG_9999 rolls over to IMG_A0001, and then IMG_A9999 rolls over to IMG_B0001, etc.  \n\nGranted, this isn't necessary if one keeps a small numbers of photos in each folder, but as I currently put all of my photos from a given year in the same folder, it is likely that I'll have &gt;9999 photos in a folder and therefore duplicate file names.\n\nAlso, for whatever reason I don't like the idea of having duplicate file names regardless of folder location (though when I upgraded bodies, I did just start back over at IMG_0001, so idk...)\n\nSo, two questions:\n\n1. Is there a better way to do this?\n\n2. Is this a problem for anyone else?  If so, seems like it might be nice for Canon to offer an additional menu option, like '*set file name digit length*'.  If you could set file names to 6 digits, having duplicate file names would probably never be an issue for me on a given body.  I only got up to 40,500 on my t2i, and am at 17,000 on the 90d.", "link": "https://www.reddit.com/r/canon/comments/nss17j/file_numbering_best_practices/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "file numbering - best practices? /!/ currently, when i get to img_9999, i start using 'bulk rename utility' to insert a letter in the file name.  so, when img_9999 rolls over to img_a0001, and then img_a9999 rolls over to img_b0001, etc.  \n\ngranted, this isn't necessary if one keeps a small numbers of photos in each folder, but as i currently put all of my photos from a given year in the same folder, it is likely that i'll have &gt;9999 photos in a folder and therefore duplicate file names.\n\nalso, for whatever reason i don't like the idea of having duplicate file names regardless of folder -----> location !!!  (though when i upgraded bodies, i did just start back over at img_0001, so idk...)\n\nso, two questions:\n\n1. is there a better way to do this?\n\n2. is this a problem for anyone else?  if so, seems like it might be nice for canon to offer an additional menu option, like '*set file name digit length*'.  if you could set file names to 6 digits, having duplicate file names would probably never be an issue for me on a given body.  i only got up to 40,500 on my t2i, and am at 17,000 on the 90d.", "sortedWord": "None", "identifyer": 42044, "year": "2021"}, {"Unnamed: 0": 295496, "autor": "Muttoab", "date": 1621470831000, "content": "Card Changes - Canon R5 /!/ Recently bought a Canon R5 and while I think it is an amazing camera, there's one thing about it that is driving me nuts: it keeps changing the image storage location.\n\nI know it has to do with what card(s) are in the camera when the door opens/closes but for the life of me, I can't get it to be consistent. It's a real pain in the a$$ because (for example) I'll pull the SD card out and put in the card reader expecting my images to be there for download only to find that no, they are on the CFExpress card. I then not only have to get the other card out of the camera but plug in a different card reader ('cause for the like of me I can't find a dual-slot reader that does both SD and CFEpress.) \n\nWhat I want is simple: still images to the SD, video to the CFEpress. Don't ever do anything different. What am I missing??", "link": "https://www.reddit.com/r/canon/comments/nglwv3/card_changes_canon_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "card changes - canon r5 /!/ recently bought a canon r5 and while i think it is an amazing camera, there's one thing about it that is driving me nuts: it keeps changing the image storage -----> location !!! .\n\ni know it has to do with what card(s) are in the camera when the door opens/closes but for the life of me, i can't get it to be consistent. it's a real pain in the a$$ because (for example) i'll pull the sd card out and put in the card reader expecting my images to be there for download only to find that no, they are on the cfexpress card. i then not only have to get the other card out of the camera but plug in a different card reader ('cause for the like of me i can't find a dual-slot reader that does both sd and cfepress.) \n\nwhat i want is simple: still images to the sd, video to the cfepress. don't ever do anything different. what am i missing??", "sortedWord": "None", "identifyer": 42132, "year": "2021"}, {"Unnamed: 0": 295519, "autor": "ilkkuPvP", "date": 1620803009000, "content": "Canon F-715SG \"S to D\" button location? Please help quick /!/ I have this Canon F-715SG Calculator and can't get the answer to a more \"precise\" version.\n\nOne of my calculations to solve: (4:√17)x34\n\nI get the answer in decimals and it should be a squared number :(", "link": "https://www.reddit.com/r/canon/comments/nain4r/canon_f715sg_s_to_d_button_location_please_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon f-715sg \"s to d\" button -----> location !!! ? please help quick /!/ i have this canon f-715sg calculator and can't get the answer to a more \"precise\" version.\n\none of my calculations to solve: (4:√17)x34\n\ni get the answer in decimals and it should be a squared number :(", "sortedWord": "None", "identifyer": 42155, "year": "2021"}, {"Unnamed: 0": 295568, "autor": "namesroverrated_420", "date": 1620666867000, "content": "best $1200 body buy /!/ (FYI I have been lurking and searching before asking this question)\n\nMy friend is a portrait/event photog 'on the side' -- he has a day job but does family portraits, senior HS portraits on location, professional head shots, nonprofit events, and church functions on the side for money. He has multi-year relationships w/a couple agencies for his photo work but has never gotten it off the ground to freelance FT. He usually rents equip -- which of course is eating a hole in his wallet. His true love is nature photography landscapes.\n\nMy friends and I are thinking of a nice big bday present and can work with a budget of up to $1200. Is the [EOS RP](https://www.bhphotovideo.com/c/product/1459282-REG/canon_eos_rp_mirrorless_digital.html) our best bet? I know he wants full-frame, and to not look like an amateur. I am NOT a photographer and haven't dabbled in digital photo since before 2010. So I am completely lost. TIA.", "link": "https://www.reddit.com/r/canon/comments/n9agub/best_1200_body_buy/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "best $1200 body buy /!/ (fyi i have been lurking and searching before asking this question)\n\nmy friend is a portrait/event photog 'on the side' -- he has a day job but does family portraits, senior hs portraits on -----> location !!! , professional head shots, nonprofit events, and church functions on the side for money. he has multi-year relationships w/a couple agencies for his photo work but has never gotten it off the ground to freelance ft. he usually rents equip -- which of course is eating a hole in his wallet. his true love is nature photography landscapes.\n\nmy friends and i are thinking of a nice big bday present and can work with a budget of up to $1200. is the [eos rp](https://www.bhphotovideo.com/c/product/1459282-reg/canon_eos_rp_mirrorless_digital.html) our best bet? i know he wants full-frame, and to not look like an amateur. i am not a photographer and haven't dabbled in digital photo since before 2010. so i am completely lost. tia.", "sortedWord": "None", "identifyer": 42205, "year": "2021"}, {"Unnamed: 0": 295607, "autor": "username-Czechs-out", "date": 1620501605000, "content": "Canon RP silent shutter not working /!/ My RPs silent shutter mode suddenly stopped working today (on location right now, best timing ever). When the shutter button is pressed it the shutter clicks 4 times and “busy” is displayed on the screen. It takes no pictures but seems to work fine on every other mode. \n\nAnyone know what to do about this?", "link": "https://www.reddit.com/r/canon/comments/n7wer6/canon_rp_silent_shutter_not_working/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon rp silent shutter not working /!/ my rps silent shutter mode suddenly stopped working today (on -----> location !!!  right now, best timing ever). when the shutter button is pressed it the shutter clicks 4 times and “busy” is displayed on the screen. it takes no pictures but seems to work fine on every other mode. \n\nanyone know what to do about this?", "sortedWord": "None", "identifyer": 42247, "year": "2021"}, {"Unnamed: 0": 295735, "autor": "smallestbat", "date": 1624300676000, "content": "Canon EOS 650D almost completely unresponsive /!/ Hi everyone! \n\nHoping someone here might be able to help me get an answer as to what's gone wrong with my EOS 650D. I've had this camera for a good few years and it's been working perfectly up until recently. I was out using it, turning the camera off and on between locations, when suddenly virtually everything stopped responding. I could use the lever to switch the camera on and off but no longer use it to enter video mode, the display would instead remain as if in standard photo mode. I could also use the dial to switch between settings and this was reflected on the screen. The shutter and flash release buttons also still work but that is all.\n\nThe touch screen is no longer responsive, and none of the other buttons seem to do anything. I can still take photos using the camera but the last settings I used were for a continuous timer and I am unable to change these. When the camera has finished shooting, the images are not displayed on the screen as they were before, however they are accessible when the SD card is inserted into my computer. Strangely, when I returned home after this and turned the camera on again it started functioning normally, but the next time I went to use it the same problem persisted and I have been unable to get it to work again since. \n\nI am interested as to whether anyone has experienced anything similar, I tried searching but couldn't seem to find anything. I am not by any means a camera expert but this strikes me as strange as it is, in a very limited sense of the word, still functional. Could there be something I am missing or is it possible it has just given up after around 10 years of use? \n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/o5249e/canon_eos_650d_almost_completely_unresponsive/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon eos 650d almost completely unresponsive /!/ hi everyone! \n\nhoping someone here might be able to help me get an answer as to what's gone wrong with my eos 650d. i've had this camera for a good few years and it's been working perfectly up until recently. i was out using it, turning the camera off and on between -----> locations !!! , when suddenly virtually everything stopped responding. i could use the lever to switch the camera on and off but no longer use it to enter video mode, the display would instead remain as if in standard photo mode. i could also use the dial to switch between settings and this was reflected on the screen. the shutter and flash release buttons also still work but that is all.\n\nthe touch screen is no longer responsive, and none of the other buttons seem to do anything. i can still take photos using the camera but the last settings i used were for a continuous timer and i am unable to change these. when the camera has finished shooting, the images are not displayed on the screen as they were before, however they are accessible when the sd card is inserted into my computer. strangely, when i returned home after this and turned the camera on again it started functioning normally, but the next time i went to use it the same problem persisted and i have been unable to get it to work again since. \n\ni am interested as to whether anyone has experienced anything similar, i tried searching but couldn't seem to find anything. i am not by any means a camera expert but this strikes me as strange as it is, in a very limited sense of the word, still functional. could there be something i am missing or is it possible it has just given up after around 10 years of use? \n\nthanks!", "sortedWord": "None", "identifyer": 42378, "year": "2021"}, {"Unnamed: 0": 295968, "autor": "Thercon_Jair", "date": 1626479629000, "content": "Discussion: Rumours about entry level Canon FF mirrorless /!/ You have probably all heard the rumours about an affordable fullframe mirrorless camera from Canon.\n\nSuch as this [recent one from www.canonrumors.com.](https://www.canonrumors.com/canon-aiming-for-a-799-full-frame-camera-cr2/)\n\n&amp;#x200B;\n\nI have noticed a lot of sales for the RP lately and was already surmising that they're selling off stock because something new is incoming. As an example, Digitec in Switzerland is having a sale for the RP body for CHF789.- ($849). At the same time a Canon cashback is running where you get CHF100.- ($108) for the body or CHF150.- ($161) for the kit with the RF24-105 f/4-71. Friend got the kit for CHF849 minus the 150 cashback, so 699.-. Which is a really great deal.\n\n&amp;#x200B;\n\nSo this got me wondering if an RP replacement was in the works as these sales are generally launched when a when a new product is soon to be launched.\n\n&amp;#x200B;\n\nDid any of you notice any RP specific sales in your location? Do you think it's going to be launched 2022 as the rumour in the link aleges? In my own opinion, if 2022, I'd say really early 2022 and maybe even announced in 2021, say end of November earliest.", "link": "https://www.reddit.com/r/canon/comments/olt5l3/discussion_rumours_about_entry_level_canon_ff/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "discussion: rumours about entry level canon ff mirrorless /!/ you have probably all heard the rumours about an affordable fullframe mirrorless camera from canon.\n\nsuch as this [recent one from www.canonrumors.com.](https://www.canonrumors.com/canon-aiming-for-a-799-full-frame-camera-cr2/)\n\n&amp;#x200b;\n\ni have noticed a lot of sales for the rp lately and was already surmising that they're selling off stock because something new is incoming. as an example, digitec in switzerland is having a sale for the rp body for chf789.- ($849). at the same time a canon cashback is running where you get chf100.- ($108) for the body or chf150.- ($161) for the kit with the rf24-105 f/4-71. friend got the kit for chf849 minus the 150 cashback, so 699.-. which is a really great deal.\n\n&amp;#x200b;\n\nso this got me wondering if an rp replacement was in the works as these sales are generally launched when a when a new product is soon to be launched.\n\n&amp;#x200b;\n\ndid any of you notice any rp specific sales in your -----> location !!! ? do you think it's going to be launched 2022 as the rumour in the link aleges? in my own opinion, if 2022, i'd say really early 2022 and maybe even announced in 2021, say end of november earliest.", "sortedWord": "None", "identifyer": 42620, "year": "2021"}, {"Unnamed: 0": 296217, "autor": "TheRandmG", "date": 1629477734000, "content": "Is the Canon EOS 500D good for beginners? /!/ I have just started a photography course and i have always liked the aspect of taking pictures when a good location/subject appears and i was wondering if the Canon EOS 500D is a good one to begin with?\nP.s. Is there any lense i should get with it, i was thinking a 18-55mm?\nEdit: i have done some research myself and read that is is a good build quality camera with good pic quality as well, my budget for a camera is say £150", "link": "https://www.reddit.com/r/canon/comments/p88y3o/is_the_canon_eos_500d_good_for_beginners/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "is the canon eos 500d good for beginners? /!/ i have just started a photography course and i have always liked the aspect of taking pictures when a good -----> location !!! /subject appears and i was wondering if the canon eos 500d is a good one to begin with?\np.s. is there any lense i should get with it, i was thinking a 18-55mm?\nedit: i have done some research myself and read that is is a good build quality camera with good pic quality as well, my budget for a camera is say £150", "sortedWord": "None", "identifyer": 42869, "year": "2021"}, {"Unnamed: 0": 297412, "autor": "RomanticPhotographic", "date": 1619962236000, "content": "Battery life of the Canon R6: is it really only 360 shots? /!/ I've seen a couple of sites indicating the battery is really awful ([Photographylife](https://photographylife.com/canon-eos-r5-vs-eos-r6), [DPReview](https://www.dpreview.com/articles/1603749381/canon-eos-r5-vs-r6-what-s-the-difference?slide=10)). With my 5D3, I can shoot over a thousand pictures and still have plenty of power in the battery. So many of my location shoots involve 500 or more pictures and the idea of having to change batteries mid way is disturbing. \n\nIs the battery life really *that* bad?", "link": "https://www.reddit.com/r/canon/comments/n36fq8/battery_life_of_the_canon_r6_is_it_really_only/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "battery life of the canon r6: is it really only 360 shots? /!/ i've seen a couple of sites indicating the battery is really awful ([photographylife](https://photographylife.com/canon-eos-r5-vs-eos-r6), [dpreview](https://www.dpreview.com/articles/1603749381/canon-eos-r5-vs-r6-what-s-the-difference?slide=10)). with my 5d3, i can shoot over a thousand pictures and still have plenty of power in the battery. so many of my -----> location !!!  shoots involve 500 or more pictures and the idea of having to change batteries mid way is disturbing. \n\nis the battery life really *that* bad?", "sortedWord": "None", "identifyer": 44103, "year": "2021"}], "name": "locationcanon2021"}