{"interestingcomments": [{"Unnamed: 0": 297992, "autor": "adam-kobich", "date": 1584005374000, "content": "Survey: Development of a Web-Based Application to Help Photographers Find New Shooting Locations /!/ [removed]", "link": "https://www.reddit.com/r/canon/comments/fhdo3n/survey_development_of_a_webbased_application_to/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "survey: development of a web-based application to help photographers find new shooting -----> locations !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 44701, "year": "2020"}, {"Unnamed: 0": 298098, "autor": "Replicaindigo", "date": 1580752480000, "content": "Canon EOS RP battery life /!/  It would be nice to have the larger battery from the EOS R (which I've also owned before) but don't let \"battery life\" be a factor that makes you shy away from the RP. I shot an entire road trip including messing around reviewing photos, taking shots out of the car, then actual shooting at multiple locations, and after 3 days I still had 1/3 battery left. Simply amazing. And this is using an image stabilized lens too which takes even more battery life. The RP has more than enough battery life for a shooting adventure. And in case I ran out, I brought a power bank AND extra fully charged Canon battery. Turns out i didn't even need them.", "link": "https://www.reddit.com/r/canon/comments/eyawh2/canon_eos_rp_battery_life/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon eos rp battery life /!/  it would be nice to have the larger battery from the eos r (which i've also owned before) but don't let \"battery life\" be a factor that makes you shy away from the rp. i shot an entire road trip including messing around reviewing photos, taking shots out of the car, then actual shooting at multiple -----> locations !!! , and after 3 days i still had 1/3 battery left. simply amazing. and this is using an image stabilized lens too which takes even more battery life. the rp has more than enough battery life for a shooting adventure. and in case i ran out, i brought a power bank and extra fully charged canon battery. turns out i didn't even need them.", "sortedWord": "None", "identifyer": 44815, "year": "2020"}, {"Unnamed: 0": 298509, "autor": "Puggetty", "date": 1596558045000, "content": "Autofocus gears /!/ Afternoon,\n\nDoes anyone know where I can get replacement gears for the autofocus system on a Canon 80-200mm zoom lens? I have added pictures here: \n\n[https://imgur.com/a/Kq4c6lL](https://imgur.com/a/Kq4c6lL)\n\n   \n \n\nIt's the gear that connects the motor segment to another two gears in the assembly (and moved up and down by the AF/MF switch). I have added a picture of its location.\n\nIf anyone can identify them or point me to where I can purchase a new one that would be fantastic. Let me know if you need any more images :)", "link": "https://www.reddit.com/r/canon/comments/i3mbtf/autofocus_gears/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "autofocus gears /!/ afternoon,\n\ndoes anyone know where i can get replacement gears for the autofocus system on a canon 80-200mm zoom lens? i have added pictures here: \n\n[https://imgur.com/a/kq4c6ll](https://imgur.com/a/kq4c6ll)\n\n   \n \n\nit's the gear that connects the motor segment to another two gears in the assembly (and moved up and down by the af/mf switch). i have added a picture of its -----> location !!! .\n\nif anyone can identify them or point me to where i can purchase a new one that would be fantastic. let me know if you need any more images :)", "sortedWord": "None", "identifyer": 45242, "year": "2020"}, {"Unnamed: 0": 298574, "autor": "mrpablotoyou", "date": 1599770967000, "content": "6D Mk ii - Is there an option to move focus point while using viewfinder? /!/ I am aware the 6dii got a lot of bad press about issues concerning the positioning of focus points etc but I've had no issues with the locations of them. However, moving from the 5dii with its joystick you were able to move focus points while looking through the viewfinder. I can see that you can use the D pad to change points with the 6dii but only when you have gone into the menu - Is there no way of moving the focus point while using the viewfinder on the fly ? ? Any help appreciated in maximising the functions of the AF on this camera.", "link": "https://www.reddit.com/r/canon/comments/iqc07r/6d_mk_ii_is_there_an_option_to_move_focus_point/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "6d mk ii - is there an option to move focus point while using viewfinder? /!/ i am aware the 6dii got a lot of bad press about issues concerning the positioning of focus points etc but i've had no issues with the -----> locations !!!  of them. however, moving from the 5dii with its joystick you were able to move focus points while looking through the viewfinder. i can see that you can use the d pad to change points with the 6dii but only when you have gone into the menu - is there no way of moving the focus point while using the viewfinder on the fly ? ? any help appreciated in maximising the functions of the af on this camera.", "sortedWord": "None", "identifyer": 45309, "year": "2020"}, {"Unnamed: 0": 298619, "autor": "unituned", "date": 1599604252000, "content": "Purchased Canon R6 from Bestbuy. Few hours later I get call from area code (612) /!/ So I just purchased the Canon R6 from [bestbuy.com](https://bestbuy.com). A Few hours later I get a call from (612) number saying theyre from best buy(thick heavy accent). I felt kind of sketched with the whole process, but I guess since my billing address and pick up location were 60 miles apart and it being an expensive purchase I needed to confirm my email and phone number so I complied and gave them the information. Has anyone purchased from best buy and gotten a call from that area code?", "link": "https://www.reddit.com/r/canon/comments/ip3puf/purchased_canon_r6_from_bestbuy_few_hours_later_i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "purchased canon r6 from bestbuy. few hours later i get call from area code (612) /!/ so i just purchased the canon r6 from [bestbuy.com](https://bestbuy.com). a few hours later i get a call from (612) number saying theyre from best buy(thick heavy accent). i felt kind of sketched with the whole process, but i guess since my billing address and pick up -----> location !!!  were 60 miles apart and it being an expensive purchase i needed to confirm my email and phone number so i complied and gave them the information. has anyone purchased from best buy and gotten a call from that area code?", "sortedWord": "None", "identifyer": 45354, "year": "2020"}, {"Unnamed: 0": 298702, "autor": "Sociophilo", "date": 1602792424000, "content": "Canon R5 Overheating - It's Unusable /!/ Context:  \nI'm a photographer and videographer mainly working in product, short form narrative in a studio environment with occasional on-location photography.\n\n**This camera is useless** as the **hybrid 8K RAW/4K120/4KHQ device** it was marketed to be.  \n\n\n* Example 1: Product Shots\n\nI'm in the studio using continuous lighting to set up the product shots. I'm monitoring occasionally in liveview, for histogram etc... \n\nI start off by taking photos for \\~45 min, continuously. I switch over to video and all the top tier video formats are 0:00:00'd out. The camera is showing an overheating control and It's locked me out of those settings.\n\nLiterally unusable as a hybrid in this scenario.  \n\n\n* Example 2: On Location\n\nI'm on location and the task is to get some photos of products in different settings and then switch over to slow-mo video of them.\n\nSame thing, \\~45 min of photographing and when switched to video the top tier settings are 0:00:00'd out.  \n\n\n*  Example 3: On location with models for a beauty campaign\n\nFall day - around 15 degrees outside, 4pm with nice sunlight coming through.\n\nWe're shooting a campaign for a beauty company across different mediums: stills, film stills and video. At each set up we go through the different mediums.  \n\n\nI have the record button hotkeyed to default to 4kHQ when I'm in photo mode. The first 2 set-ups and the 4KHQ is working, but I'm only shooting bursts of like 10 seconds. By the 3rd set up, the 4KHQ is 0:00:00'd out and it's blocked out.  \n\n\n**Canon needs to address this concerns head on - this is a disaster for a camera that costs \\~$6000CAD.**  \n\n\nTo all my fellow shooters expeciting a hybrid camera - literally reframe your understanding of this camera. This is NOT a hybrid camera.\n\nThis is a stills camera that occasionally can shoot HQ video, and those occasions are limited by your usage of the camera. \n\nWhat can we as a community do about this glaring problem?", "link": "https://www.reddit.com/r/canon/comments/jbv74o/canon_r5_overheating_its_unusable/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon r5 overheating - it's unusable /!/ context:  \ni'm a photographer and videographer mainly working in product, short form narrative in a studio environment with occasional on------> location !!!  photography.\n\n**this camera is useless** as the **hybrid 8k raw/4k120/4khq device** it was marketed to be.  \n\n\n* example 1: product shots\n\ni'm in the studio using continuous lighting to set up the product shots. i'm monitoring occasionally in liveview, for histogram etc... \n\ni start off by taking photos for \\~45 min, continuously. i switch over to video and all the top tier video formats are 0:00:00'd out. the camera is showing an overheating control and it's locked me out of those settings.\n\nliterally unusable as a hybrid in this scenario.  \n\n\n* example 2: on location\n\ni'm on location and the task is to get some photos of products in different settings and then switch over to slow-mo video of them.\n\nsame thing, \\~45 min of photographing and when switched to video the top tier settings are 0:00:00'd out.  \n\n\n*  example 3: on location with models for a beauty campaign\n\nfall day - around 15 degrees outside, 4pm with nice sunlight coming through.\n\nwe're shooting a campaign for a beauty company across different mediums: stills, film stills and video. at each set up we go through the different mediums.  \n\n\ni have the record button hotkeyed to default to 4khq when i'm in photo mode. the first 2 set-ups and the 4khq is working, but i'm only shooting bursts of like 10 seconds. by the 3rd set up, the 4khq is 0:00:00'd out and it's blocked out.  \n\n\n**canon needs to address this concerns head on - this is a disaster for a camera that costs \\~$6000cad.**  \n\n\nto all my fellow shooters expeciting a hybrid camera - literally reframe your understanding of this camera. this is not a hybrid camera.\n\nthis is a stills camera that occasionally can shoot hq video, and those occasions are limited by your usage of the camera. \n\nwhat can we as a community do about this glaring problem?", "sortedWord": "None", "identifyer": 45438, "year": "2020"}, {"Unnamed: 0": 298730, "autor": "ijuiceman", "date": 1602654002000, "content": "Canon Image Transfer Utility 2 - Cannot save to network /!/ I have been asked to setup 2 x EOS850D cameras to save pictures to a central location on the network.\n\nI have successfully setup the camera and using 2 PCs (one for each camera) I have managed to get them to both download the files to the local PC.\n\nHowever I am unable to save to a mapped drive on the network.  I have tried to use mapped drives, direct UNC paths and even tried to redirect the directory to a LAN path. \n\nThe error pops up and just states \"Cannot write to the selected folder. Select another folder.\"\n\nHas anyone found a trick or work around to get the utility to save to a network path ?", "link": "https://www.reddit.com/r/canon/comments/jauu7r/canon_image_transfer_utility_2_cannot_save_to/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon image transfer utility 2 - cannot save to network /!/ i have been asked to setup 2 x eos850d cameras to save pictures to a central -----> location !!!  on the network.\n\ni have successfully setup the camera and using 2 pcs (one for each camera) i have managed to get them to both download the files to the local pc.\n\nhowever i am unable to save to a mapped drive on the network.  i have tried to use mapped drives, direct unc paths and even tried to redirect the directory to a lan path. \n\nthe error pops up and just states \"cannot write to the selected folder. select another folder.\"\n\nhas anyone found a trick or work around to get the utility to save to a network path ?", "sortedWord": "None", "identifyer": 45469, "year": "2020"}, {"Unnamed: 0": 298944, "autor": "nishkiskade", "date": 1609098698000, "content": "Worth upgrading from 5D mark ii to EOS RP with a 35mm ER? /!/ Hi everyone,  \n\n\nMy camera needs have changed a bit over the years, especially since COVID started. I bought the 5D as an early-career side hustle in event photographer and videographer around 2013 when I was just out of grad school and starting to freelance, and it was great for the time. I moved to a small town in 2016 and didn't continue this freelance work, but I still enjoy having the capacity to do run-and-gun documentary filmmaking when the need arises.  \n\nMy primary discipline has always been music, and I've had to quickly pivot from touring for live performances to a combination of livestream concerts and pre-recorded concert videos which I typically do on location. I've had access to a Panasonic Lumix G85 through my day job, which was a pleasant surprise and has shown me the age of the 5Dii. Things I particularly enjoyed were 4K editing, especially to crop and pan in post, and the lack of the 30 minute cutoff (come on, Canon....), though I output in 1080p for most distribution. I did a two-camera shoot with the Canon and Panasonic and had a lot of difficulty grading the flat Canon footage to better match the Panasonic.\n\nI'm pretty invested in the Canon ecosystem, and own a first-gen 24-105mm f/4 L, a 50mm f/1.4, and a 105mm f/2.8L macro. I also have a good video monopod, tripod, a fair amount of outboard audio gear, and a Godox speedlight. \n\nI've been researching a few months, and I'm looking at an upgrade to the EOS RP with the ER 35mm macro, along with the control ring adapter. I love the specs of the R6, but don't use the camera as much as I used to, and I like the idea of getting some new glass and an extra battery for less than an EOS R body.\n\nI'm not thrilled with the reviews of the EOS RP 4K footage and would welcome experience - I was looking at the 90D as an alternative to have uncropped footage, but then reminded myself that a cropped RP isn't so different from shooting on the 90D. \n\ntl;dr, my wishlist for intended use\n\n* using my full-frame EF glass (is the control ring worth it?)\n* video, top priority documenting living room and outdoor concerts in either 1080 or 4K\n* video livestreaming in 1080, (I have an Elgato cam link 4K, can somebody confirm clean HDMI out?)\n* my partner is an artisan that has been experimenting in product photography and macro photography. We recently shot a billboard on the 5Dii that consisted of 30+ stitched together images, and extra MP over the 5Dii is a help. The additional resolution of the EOS R is tempting, but then I wouldn't be buying any glass right away.\n* I find I don't carry my 5D anymore because it's too bulky, so I like the idea of switching over to mirrorless. I started back in 2010 on an early Sony mirrorless and loved the size before switching to Canon DSLR. My photography needs would be mostly travel/landscape and occasional headshot/portrait. \n* I've been wanting to get a 35mm prime for years, debating between the Sigma ART and a stabilized Canon. I like the idea of having an everyday walkaround that's compact, and for living room concerts 50mm has been too tight of a frame so I think 35 is my ideal focal length to start with, though I'll also be adapting my EF glass. \n\nAm I on the right page? I could play more for a body if really necessary but I'm coming around to the size and price of the RP.\n\nBoxing Day sales are going until January 1 in Canada. I could probably wait a few more months if we anticipate any further price drops.", "link": "https://www.reddit.com/r/canon/comments/kla46x/worth_upgrading_from_5d_mark_ii_to_eos_rp_with_a/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "worth upgrading from 5d mark ii to eos rp with a 35mm er? /!/ hi everyone,  \n\n\nmy camera needs have changed a bit over the years, especially since covid started. i bought the 5d as an early-career side hustle in event photographer and videographer around 2013 when i was just out of grad school and starting to freelance, and it was great for the time. i moved to a small town in 2016 and didn't continue this freelance work, but i still enjoy having the capacity to do run-and-gun documentary filmmaking when the need arises.  \n\nmy primary discipline has always been music, and i've had to quickly pivot from touring for live performances to a combination of livestream concerts and pre-recorded concert videos which i typically do on -----> location !!! . i've had access to a panasonic lumix g85 through my day job, which was a pleasant surprise and has shown me the age of the 5dii. things i particularly enjoyed were 4k editing, especially to crop and pan in post, and the lack of the 30 minute cutoff (come on, canon....), though i output in 1080p for most distribution. i did a two-camera shoot with the canon and panasonic and had a lot of difficulty grading the flat canon footage to better match the panasonic.\n\ni'm pretty invested in the canon ecosystem, and own a first-gen 24-105mm f/4 l, a 50mm f/1.4, and a 105mm f/2.8l macro. i also have a good video monopod, tripod, a fair amount of outboard audio gear, and a godox speedlight. \n\ni've been researching a few months, and i'm looking at an upgrade to the eos rp with the er 35mm macro, along with the control ring adapter. i love the specs of the r6, but don't use the camera as much as i used to, and i like the idea of getting some new glass and an extra battery for less than an eos r body.\n\ni'm not thrilled with the reviews of the eos rp 4k footage and would welcome experience - i was looking at the 90d as an alternative to have uncropped footage, but then reminded myself that a cropped rp isn't so different from shooting on the 90d. \n\ntl;dr, my wishlist for intended use\n\n* using my full-frame ef glass (is the control ring worth it?)\n* video, top priority documenting living room and outdoor concerts in either 1080 or 4k\n* video livestreaming in 1080, (i have an elgato cam link 4k, can somebody confirm clean hdmi out?)\n* my partner is an artisan that has been experimenting in product photography and macro photography. we recently shot a billboard on the 5dii that consisted of 30+ stitched together images, and extra mp over the 5dii is a help. the additional resolution of the eos r is tempting, but then i wouldn't be buying any glass right away.\n* i find i don't carry my 5d anymore because it's too bulky, so i like the idea of switching over to mirrorless. i started back in 2010 on an early sony mirrorless and loved the size before switching to canon dslr. my photography needs would be mostly travel/landscape and occasional headshot/portrait. \n* i've been wanting to get a 35mm prime for years, debating between the sigma art and a stabilized canon. i like the idea of having an everyday walkaround that's compact, and for living room concerts 50mm has been too tight of a frame so i think 35 is my ideal focal length to start with, though i'll also be adapting my ef glass. \n\nam i on the right page? i could play more for a body if really necessary but i'm coming around to the size and price of the rp.\n\nboxing day sales are going until january 1 in canada. i could probably wait a few more months if we anticipate any further price drops.", "sortedWord": "None", "identifyer": 45689, "year": "2020"}, {"Unnamed: 0": 299153, "autor": "DaDankPenguin", "date": 1578934488000, "content": "Need help upgrading my setup! /!/ Thanks for reading! I currently have a T3 along with the 2 kit lenses (18-55 &amp; 75-300) and the 50mm 1:8 II. Additionally, I have recently purchased a used 17-40 f4 L for about $250 USD. I am looking to upgrade my gear to improve my image quality. \n\nI am a total amateur, but it is a really big hobby of mine. I am most interested in landscapes and architecture (individual buildings, inside and out, and skylines), with the occasional wildlife photo or portrait. I am also wanting to get into astrophotography. I find myself using basically all of my current range, and I really enjoy using my telephoto. At this point in time, I am very much more of a 'stop for a little bit and take some pictures' than a 'stop for a little while and set up my tripod' type of person. I am planning my first solo international trip to Amsterdam, Budapest, and Prague. So I am really looking forward to taking pictures in those locations and welcome any advice that might be beneficial for this trip as well. \n\nAnyways, I am torn between my options. Should I upgrade my body, since mine is outdated, or just continue to purchase new glass? I know that I eventually want to upgrade to either full-frame or mirrorless (advice on this is also welcome), but I don't know if now is the right time considering my budget. I am looking to spend around $500, but will stretch if absolutely recommended. I am a college student as of right now, so hopefully in a couple years I will be able to make a bigger upgrade. Here are some of the options I'm considering:\n\nEF-S Lenses:\n   17-55mm f/2.8 IS USM\n   24mm STM\n   55-250mm f/4-5.6 STM\n\nI don't know if these are worth it considering that in the near future (3-5 years), or now, I will upgrade to a full-frame.\n\nEF lenses: \n   50mm 1:8 STM\n   Canon 70-300mm f/4-5.6 IS USM \n   Canon 70-200mm f/4 L\n   Sigma 100-400mm f/5-6.3 Contemporary\n   Tokina AT-X 116 DX-II 11-16mm f/2.8\n   Canon 24-105mm f/4 L IS USM\n\nBodies:\n   T6i\n   6d\n   5d mk ii \n   70d (I heard this has a much better autofocus and overall is much more user friendly than the 6d)\n\n\nI have done research on all of these and they all look promising, which is my problem. I would buy all of these used/refurbished. Please give any advice you can, or recommended an item // set of items that would be best for me to purchase. Get me the most bang for my buck. Obviously, if I were to buy a 17-55, I would sell my 17-40, or if I bought the STM 50, I would sell the other and use this extra money for my camera as well. I apologise for the extremely long post, and I'm grateful for anyone who takes the time to read it and help me out! I will take any advice I can get, and please recommend other lenses if they are more worth it to you.", "link": "https://www.reddit.com/r/canon/comments/eo6qog/need_help_upgrading_my_setup/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "need help upgrading my setup! /!/ thanks for reading! i currently have a t3 along with the 2 kit lenses (18-55 &amp; 75-300) and the 50mm 1:8 ii. additionally, i have recently purchased a used 17-40 f4 l for about $250 usd. i am looking to upgrade my gear to improve my image quality. \n\ni am a total amateur, but it is a really big hobby of mine. i am most interested in landscapes and architecture (individual buildings, inside and out, and skylines), with the occasional wildlife photo or portrait. i am also wanting to get into astrophotography. i find myself using basically all of my current range, and i really enjoy using my telephoto. at this point in time, i am very much more of a 'stop for a little bit and take some pictures' than a 'stop for a little while and set up my tripod' type of person. i am planning my first solo international trip to amsterdam, budapest, and prague. so i am really looking forward to taking pictures in those -----> locations !!!  and welcome any advice that might be beneficial for this trip as well. \n\nanyways, i am torn between my options. should i upgrade my body, since mine is outdated, or just continue to purchase new glass? i know that i eventually want to upgrade to either full-frame or mirrorless (advice on this is also welcome), but i don't know if now is the right time considering my budget. i am looking to spend around $500, but will stretch if absolutely recommended. i am a college student as of right now, so hopefully in a couple years i will be able to make a bigger upgrade. here are some of the options i'm considering:\n\nef-s lenses:\n   17-55mm f/2.8 is usm\n   24mm stm\n   55-250mm f/4-5.6 stm\n\ni don't know if these are worth it considering that in the near future (3-5 years), or now, i will upgrade to a full-frame.\n\nef lenses: \n   50mm 1:8 stm\n   canon 70-300mm f/4-5.6 is usm \n   canon 70-200mm f/4 l\n   sigma 100-400mm f/5-6.3 contemporary\n   tokina at-x 116 dx-ii 11-16mm f/2.8\n   canon 24-105mm f/4 l is usm\n\nbodies:\n   t6i\n   6d\n   5d mk ii \n   70d (i heard this has a much better autofocus and overall is much more user friendly than the 6d)\n\n\ni have done research on all of these and they all look promising, which is my problem. i would buy all of these used/refurbished. please give any advice you can, or recommended an item // set of items that would be best for me to purchase. get me the most bang for my buck. obviously, if i were to buy a 17-55, i would sell my 17-40, or if i bought the stm 50, i would sell the other and use this extra money for my camera as well. i apologise for the extremely long post, and i'm grateful for anyone who takes the time to read it and help me out! i will take any advice i can get, and please recommend other lenses if they are more worth it to you.", "sortedWord": "None", "identifyer": 45907, "year": "2020"}, {"Unnamed: 0": 300791, "autor": "puckpuckgo", "date": 1609063971000, "content": "Canon PD-E1 alternative? /!/ I got a G7X for Xmas, which is a great mini companion for my EOS R. However, it looks like Canon is selling a constant power USB-C device for this camera for an astounding $140, which is borderline criminal IMO.\n\nAre there any alternatives to get constant power to the G7X without using a power bank or one of those fake batteries with a cable attached to it? \n\nThe fake battery route won't work due to the G7X's location of the tripod hole. You cannot mount the camera to a tripod with the battery cover open. Also, unlike the EOS R, the G7X does not have a slot to threat the cable though while having the battery cover closed.", "link": "https://www.reddit.com/r/canon/comments/kl1cjj/canon_pde1_alternative/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon pd-e1 alternative? /!/ i got a g7x for xmas, which is a great mini companion for my eos r. however, it looks like canon is selling a constant power usb-c device for this camera for an astounding $140, which is borderline criminal imo.\n\nare there any alternatives to get constant power to the g7x without using a power bank or one of those fake batteries with a cable attached to it? \n\nthe fake battery route won't work due to the g7x's -----> location !!!  of the tripod hole. you cannot mount the camera to a tripod with the battery cover open. also, unlike the eos r, the g7x does not have a slot to threat the cable though while having the battery cover closed.", "sortedWord": "None", "identifyer": 47606, "year": "2020"}, {"Unnamed: 0": 301281, "autor": "xelune", "date": 1589203031000, "content": "Bought a EOS 90D, having LCD Pixel issues /!/ Hello,\nI'm new to this subreddit as before I was taking pictures with a 'normal' digital camera and an Asahi Pentax. Decided to buy a 90D. I'm in love with the camera, but the LCD/Touchscreen keeps showing black pixels, but they change the location. I checked, it's not the sensor, because they are only there on photo reply on the camera and not on PC or my phone. Has anyone had this? Is there a fix? I've had the camera for a week now and I've contacted Canon via email, but they haven't gotten back to me. Just seems like a strange issue.\n\nSuper happy about any input!", "link": "https://www.reddit.com/r/canon/comments/ghncqb/bought_a_eos_90d_having_lcd_pixel_issues/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "bought a eos 90d, having lcd pixel issues /!/ hello,\ni'm new to this subreddit as before i was taking pictures with a 'normal' digital camera and an asahi pentax. decided to buy a 90d. i'm in love with the camera, but the lcd/touchscreen keeps showing black pixels, but they change the -----> location !!! . i checked, it's not the sensor, because they are only there on photo reply on the camera and not on pc or my phone. has anyone had this? is there a fix? i've had the camera for a week now and i've contacted canon via email, but they haven't gotten back to me. just seems like a strange issue.\n\nsuper happy about any input!", "sortedWord": "None", "identifyer": 48116, "year": "2020"}, {"Unnamed: 0": 301897, "autor": "billj04", "date": 1595359278000, "content": "How to geotag with no GPS on Canon R5 /!/ I'm considering switching to the RF system, but I read that the R5 will not have GPS built in like my 5D Mark IV and 6D. As a travel/street photographer, this is a pretty vital function. I understand that my options are to buy a GP-E2 receiver (I assume I'd need one for each camera) or to use the Canon Connect app to sync the locations. My experience with the Canon Connect app is that it is very, very clunky to use on the 5D IV. I'm curious what people's experience with using the geotagging feature has been, and have a number of questions about it. In case the functionality varies by type of phone, I use an iPhone.\n\n1. My typical setup is to walk around with two cameras. Will I be able to connect two R5s/R6s to sync GPS simultaneously?\n2. With the 5D, I need to manually start the Canon Connect app for things like remote shooting, and if I switch to another app, like sending a text message, or if the phone goes into power save mode, it disconnects, and I have to start all over. With the R5/R6, would I be able to leave the phone in my pocket and have it sync GPS location continuously, all day?\n3. Will I still get camera orientation data with the R5/R6 so I can tell not only the longitude/latitude, but what direction I was facing?\n\nI'm also open to other suggestions on how to get reliable GPS data set on my photos.\n\nThanks in advance!", "link": "https://www.reddit.com/r/canon/comments/hvdv8h/how_to_geotag_with_no_gps_on_canon_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "how to geotag with no gps on canon r5 /!/ i'm considering switching to the rf system, but i read that the r5 will not have gps built in like my 5d mark iv and 6d. as a travel/street photographer, this is a pretty vital function. i understand that my options are to buy a gp-e2 receiver (i assume i'd need one for each camera) or to use the canon connect app to sync the -----> locations !!! . my experience with the canon connect app is that it is very, very clunky to use on the 5d iv. i'm curious what people's experience with using the geotagging feature has been, and have a number of questions about it. in case the functionality varies by type of phone, i use an iphone.\n\n1. my typical setup is to walk around with two cameras. will i be able to connect two r5s/r6s to sync gps simultaneously?\n2. with the 5d, i need to manually start the canon connect app for things like remote shooting, and if i switch to another app, like sending a text message, or if the phone goes into power save mode, it disconnects, and i have to start all over. with the r5/r6, would i be able to leave the phone in my pocket and have it sync gps location continuously, all day?\n3. will i still get camera orientation data with the r5/r6 so i can tell not only the longitude/latitude, but what direction i was facing?\n\ni'm also open to other suggestions on how to get reliable gps data set on my photos.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 48748, "year": "2020"}, {"Unnamed: 0": 302004, "autor": "meenster2008", "date": 1595972085000, "content": "Upgrade from SL3 to RP? /!/ Hi All, \n\nFirstly I am a total newbie to all this so apologies if I don't understand the technical side of things super well. \n\nI picked up a bundle from Costco with the SL3 that included the nifty-fifty, and a couple other lenses and a bag for around $950. What I use it for is creating YouTube videos. I have found that for the review videos I shoot, 4k is really great and I plan expand on shooting in that quality. With the SL3 having a cropped sensor, I am having issues with being able to film in my office because of having the camera so far away, and when I need to change locations it becomes very limiting to keep the resolution. \n\nWhat I am considering is returning the SL3 bundle, and grabbing the RP w/ the same 50mm 1.8f lens with the adapter to use the lens. \n\nMy concerns are listed below:\n\nBased on this [link](https://cameradecision.com/compare/Canon-EOS-Rebel-SL3-vs-Canon-EOS-RP), I am concerned with battery life on the RP and I don't understand lens mounts, so will the RF mount be limiting compared to the EF/EF-S mount on the SL3?\n\nAny insight is appreciated as I am trying to learn as much as possible about using these cameras. Thank you!", "link": "https://www.reddit.com/r/canon/comments/hznlh4/upgrade_from_sl3_to_rp/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "upgrade from sl3 to rp? /!/ hi all, \n\nfirstly i am a total newbie to all this so apologies if i don't understand the technical side of things super well. \n\ni picked up a bundle from costco with the sl3 that included the nifty-fifty, and a couple other lenses and a bag for around $950. what i use it for is creating youtube videos. i have found that for the review videos i shoot, 4k is really great and i plan expand on shooting in that quality. with the sl3 having a cropped sensor, i am having issues with being able to film in my office because of having the camera so far away, and when i need to change -----> locations !!!  it becomes very limiting to keep the resolution. \n\nwhat i am considering is returning the sl3 bundle, and grabbing the rp w/ the same 50mm 1.8f lens with the adapter to use the lens. \n\nmy concerns are listed below:\n\nbased on this [link](https://cameradecision.com/compare/canon-eos-rebel-sl3-vs-canon-eos-rp), i am concerned with battery life on the rp and i don't understand lens mounts, so will the rf mount be limiting compared to the ef/ef-s mount on the sl3?\n\nany insight is appreciated as i am trying to learn as much as possible about using these cameras. thank you!", "sortedWord": "None", "identifyer": 48857, "year": "2020"}, {"Unnamed: 0": 302670, "autor": "AD1AD", "date": 1601429896000, "content": "Locations permissions required for Bluetooth????????? /!/ Hi all. I'm connecting my new M50 to my smartphone so that photos can be transferred there automatically. (Loving the camera so far!)\n\nIt's telling me that it needs location services in the app to enable the feature. All I can say to that is... what? Am I missing something? Why on earth would you ***require*** location services? I realize people might want to use the location from the phone so that they can add that metadata to the photos automatically, but I don't need that at all, and I have no interest in giving this app access to my location.\n\nIs there any way around it? If not, Canon is shooting themselves in the foot by denying their most convenient features to anyone who errs on the safe side when it comes to giving apps unnecessary permissions =/\n\nThanks for any help!", "link": "https://www.reddit.com/r/canon/comments/j2ct68/locations_permissions_required_for_bluetooth/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "-----> locations !!!  permissions required for bluetooth????????? /!/ hi all. i'm connecting my new m50 to my smartphone so that photos can be transferred there automatically. (loving the camera so far!)\n\nit's telling me that it needs location services in the app to enable the feature. all i can say to that is... what? am i missing something? why on earth would you ***require*** location services? i realize people might want to use the location from the phone so that they can add that metadata to the photos automatically, but i don't need that at all, and i have no interest in giving this app access to my location.\n\nis there any way around it? if not, canon is shooting themselves in the foot by denying their most convenient features to anyone who errs on the safe side when it comes to giving apps unnecessary permissions =/\n\nthanks for any help!", "sortedWord": "None", "identifyer": 49537, "year": "2020"}, {"Unnamed: 0": 302835, "autor": "ytterligare", "date": 1603861115000, "content": "EOS R and GPS /!/ Anyone using Canon GP-E2 or Solmeta’s GMAX with the R ?\nUsing the GMAX and not getting good results : 30-50% of the shoots shares the same Exif location if taken within 30-60 seconds from each other...and the position interval setting on camera and GPS is 1 second.\nI was wondering how the GP-E2 behave, instead...", "link": "https://www.reddit.com/r/canon/comments/jjhp8y/eos_r_and_gps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "eos r and gps /!/ anyone using canon gp-e2 or solmeta’s gmax with the r ?\nusing the gmax and not getting good results : 30-50% of the shoots shares the same exif -----> location !!!  if taken within 30-60 seconds from each other...and the position interval setting on camera and gps is 1 second.\ni was wondering how the gp-e2 behave, instead...", "sortedWord": "None", "identifyer": 49710, "year": "2020"}, {"Unnamed: 0": 303123, "autor": "RnAShows", "date": 1605214620000, "content": "Hey all! Need help with noisy/grainy footage on my Canon 70D /!/ I was trying to film something for a short movie I'm shooting. I shot it and imported it on my iMac and the footage looked extremely noisy and grainy. I was shooting in low light, which did make sense for it to be grainy, but then I decided to raise the light and it still looked grainy. I tried everything from raising and lowering the ISO, using a different preset for the color, shooting with different lights, shooting with different lenses, it still appeared to be noisy and it didn't look all that great. What's weird is that I've shot with the camera so many times, and not once did it look extremely noisy except for like one time.\n\nThe footage looks perfectly fine when I take a picture, so... I really don't know what it is. I don't know if the camera's broken, if it's the location I'm in, if it's the light I'm using, if I'm using the wrong lens, if something's wrong with the settings, or if it's just me, I really don't know...", "link": "https://www.reddit.com/r/canon/comments/jt31sl/hey_all_need_help_with_noisygrainy_footage_on_my/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "hey all! need help with noisy/grainy footage on my canon 70d /!/ i was trying to film something for a short movie i'm shooting. i shot it and imported it on my imac and the footage looked extremely noisy and grainy. i was shooting in low light, which did make sense for it to be grainy, but then i decided to raise the light and it still looked grainy. i tried everything from raising and lowering the iso, using a different preset for the color, shooting with different lights, shooting with different lenses, it still appeared to be noisy and it didn't look all that great. what's weird is that i've shot with the camera so many times, and not once did it look extremely noisy except for like one time.\n\nthe footage looks perfectly fine when i take a picture, so... i really don't know what it is. i don't know if the camera's broken, if it's the -----> location !!!  i'm in, if it's the light i'm using, if i'm using the wrong lens, if something's wrong with the settings, or if it's just me, i really don't know...", "sortedWord": "None", "identifyer": 50010, "year": "2020"}, {"Unnamed: 0": 303498, "autor": "IBG22", "date": 1608674479000, "content": "Canon EOS R Focusing question /!/ Hey all, I assume  I am missing something pretty obvious here. I just switched from a Fuji XT3 to a Canon EOS R and am having trouble figuring out how to focus on my desired subject without using the touch screen. On the fuji xt3 I would use the four buttons surrounding the \"menu\" button to move the single point to where  I wanted the camera to focus. These same 4 buttons on the canon EOS r don't seem to move the focus location. Any help would be great. thanks!", "link": "https://www.reddit.com/r/canon/comments/kif5nj/canon_eos_r_focusing_question/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon eos r focusing question /!/ hey all, i assume  i am missing something pretty obvious here. i just switched from a fuji xt3 to a canon eos r and am having trouble figuring out how to focus on my desired subject without using the touch screen. on the fuji xt3 i would use the four buttons surrounding the \"menu\" button to move the single point to where  i wanted the camera to focus. these same 4 buttons on the canon eos r don't seem to move the focus -----> location !!! . any help would be great. thanks!", "sortedWord": "None", "identifyer": 50391, "year": "2020"}, {"Unnamed: 0": 304392, "autor": "notgideon", "date": 1601299269000, "content": "Waiting for Canon R5 /!/ I pre-ordered a Canon R5 back in July of this year from our local camera shop. They are a registered Canon reseller so I felt confident pre-ordering would be fine. Being now it is almost October and I've yet to receive my camera. The camera shop owners are very nice and honest people and told me Canon is not giving them much information at all on this issue and waiting would be the best way to go about it.\nMy question is has anyone here pre-ordered the Canon R5 and also received it? If so, did you pre-order online or through a physical location? \nIm wondering if at this point is better to keep blindly waiting or cancel my order and go through a faster seller.\n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/j1bvbk/waiting_for_canon_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "waiting for canon r5 /!/ i pre-ordered a canon r5 back in july of this year from our local camera shop. they are a registered canon reseller so i felt confident pre-ordering would be fine. being now it is almost october and i've yet to receive my camera. the camera shop owners are very nice and honest people and told me canon is not giving them much information at all on this issue and waiting would be the best way to go about it.\nmy question is has anyone here pre-ordered the canon r5 and also received it? if so, did you pre-order online or through a physical -----> location !!! ? \nim wondering if at this point is better to keep blindly waiting or cancel my order and go through a faster seller.\n\nthanks!", "sortedWord": "None", "identifyer": 51303, "year": "2020"}, {"Unnamed: 0": 304866, "autor": "rsegoly", "date": 1608211276000, "content": "Canon connect as GPS /!/ Can someone explain the functionality of the app for geotag?\n\nI directed the camera to use the phone as GPS device, and indeed I see location in  my files.\n\nBut I want to understand the options in the app\n\nI see two switches but adding geotag to app works even if both are off\n\n1. Begin logging\n2. Send location when  connect to Wifi\n\nAnd also button to send log to camera although I get a message my camera do not support this option.\n\nSo what's the switches for?", "link": "https://www.reddit.com/r/canon/comments/kexboo/canon_connect_as_gps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon connect as gps /!/ can someone explain the functionality of the app for geotag?\n\ni directed the camera to use the phone as gps device, and indeed i see -----> location !!!  in  my files.\n\nbut i want to understand the options in the app\n\ni see two switches but adding geotag to app works even if both are off\n\n1. begin logging\n2. send location when  connect to wifi\n\nand also button to send log to camera although i get a message my camera do not support this option.\n\nso what's the switches for?", "sortedWord": "None", "identifyer": 51788, "year": "2020"}], "name": "locationcanon2020"}