{"interestingcomments": [{"Unnamed: 0": 292453, "autor": "sirkelly", "date": 1612894147000, "content": "New R6 User - Viewfinder Question! /!/ I recently upgraded from my trusty 7D Mark II to an R6, my first mirrorless dSLR (and first full-frame sensor). LOVING it so far--it feels like a huge leap forward, and that's even before I'm able to use it with any of my modern EF lenses to check out the autofocus system (the EF&gt;RF adapter was backordered and hasn't arrived yet)!\n\nBut I have a question about the behavior of the viewfinder and rear screen. I've tinkered with the settings, but I can't seem to get things to behave the way I'd like. Essentially, I want to replicate the various dSLRs I've been using for the past 15 years:\n\n* Rear screen off by default, but turns on if I press a menu or playback button\n* EVF turns on when I put it to my eye (or is on by default)\n* Rear screen shows image review for 2 seconds after shooting, then turns off\n\nIn the default auto-switching mode, the eye sensor causes the rear screen to constantly turn itself on and off when I've got the camera on a strap and it bounces around. Feels like that will run the battery down a lot faster than it should. Eco mode kinda addresses that by quickly dimming the screen, but it also dims when I WANT the screen on, which is super-annoying.\n\nThe best workaround I've found so far is to set the display to the EVF by default, and map a rear button to switch between EVF and screen. That disables the eye sensor and keeps the rear screen off, which is what I want. It's one additional button press to get the menu or playback to appear on the rear screen, which isn't too bad. But it disables automatic image review, since I don't want that to appear in the EVF if I'm still shooting (and it doesn't activate the rear screen when switched over to the EVF).\n\nI can't be the only one coming from a mirrored dSLR and wanting to basically replicate the behavior I'm accustomed to. Any thoughts or tips? Maybe a future firmware update will address?", "link": "https://www.reddit.com/r/canon/comments/lg9e2e/new_r6_user_viewfinder_question/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "new r6 user - viewfinder question! /!/ i recently upgraded from my trusty 7d mark ii to an r6, my first mirrorless dslr (and first full-frame sensor). loving it so far--it feels like a huge leap forward, and that's even before i'm able to use it with any of my modern ef lenses to check out the autofocus system (the ef&gt;rf adapter was backordered and hasn't arrived yet)!\n\nbut i have a question about the behavior of the viewfinder and rear screen. i've tinkered with the settings, but i can't seem to get things to behave the way i'd like. essentially, i want to replicate the various dslrs i've been using for the past 15 years:\n\n* rear screen off by default, but turns on if i press a menu or playback button\n* evf turns on when i put it to my eye (or is on by default)\n* rear screen shows image review for 2 seconds after shooting, then turns off\n\nin the default auto-switching mode, the eye sensor causes the rear screen to constantly turn itself on and off when i've got the camera on a strap and it bounces around. feels like that will run the battery down a lot faster than it should. eco mode kinda addresses that by quickly dimming the screen, but it also dims when i want the screen on, which is super-annoying.\n\nthe best workaround i've found so far is to set the display to the evf by default, and -----> map !!!  a rear button to switch between evf and screen. that disables the eye sensor and keeps the rear screen off, which is what i want. it's one additional button press to get the menu or playback to appear on the rear screen, which isn't too bad. but it disables automatic image review, since i don't want that to appear in the evf if i'm still shooting (and it doesn't activate the rear screen when switched over to the evf).\n\ni can't be the only one coming from a mirrored dslr and wanting to basically replicate the behavior i'm accustomed to. any thoughts or tips? maybe a future firmware update will address?", "sortedWord": "None", "identifyer": 39022, "year": "2021"}, {"Unnamed: 0": 292761, "autor": "2003aaa", "date": 1610355865000, "content": "Two things I don’t like about the EOS RP /!/ I’ve been carrying it around for a few days, and two things stand out.\n\n1. No real-time DOF preview. I know the Sony a7R IV does this, and I’m sure other cameras do as well, but the RP does not. I have the AF-ON button mapped to DOF preview so this is not a deal-breaker, but it would have been nice to have.\n\n2. Card slot is on the bottom, not the side. Why do I care? There have been many times where I left my SD card in the computer after an import and only realized after I had brought the camera to a faraway place. To prevent this, I like to keep the card slot open whenever a card is not in it. The door/slot being on the bottom makes this difficult.\n\nWhat are your thoughts/dislikes on the RP?", "link": "https://www.reddit.com/r/canon/comments/kuz2xe/two_things_i_dont_like_about_the_eos_rp/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "two things i don’t like about the eos rp /!/ i’ve been carrying it around for a few days, and two things stand out.\n\n1. no real-time dof preview. i know the sony a7r iv does this, and i’m sure other cameras do as well, but the rp does not. i have the af-on button -----> mapped !!!  to dof preview so this is not a deal-breaker, but it would have been nice to have.\n\n2. card slot is on the bottom, not the side. why do i care? there have been many times where i left my sd card in the computer after an import and only realized after i had brought the camera to a faraway place. to prevent this, i like to keep the card slot open whenever a card is not in it. the door/slot being on the bottom makes this difficult.\n\nwhat are your thoughts/dislikes on the rp?", "sortedWord": "None", "identifyer": 39334, "year": "2021"}, {"Unnamed: 0": 293795, "autor": "Jay_Lamar", "date": 1629761187000, "content": "Help with connect app /!/ I noticed there seemed to be some functionality missing and wondered if maybe I overlooked some settings in the app or on the camera. \n\nWhile using it as a remote trigger so I could include myself in the photos, there were three options that would have made it way better:\n\n* Haptic and/or audio feedback when a picture is taken, or even the ability to map the shutter release to a physical button on the phone\n\n* Face/eye detect auto focus instead of tap to focus\n\n* A self timer \n\nI'm sure setting the timer on the camera itself is an option, but in the moment I couldn't get back behind the camera to turn it on\n\nThank you", "link": "https://www.reddit.com/r/canon/comments/pabfzr/help_with_connect_app/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "help with connect app /!/ i noticed there seemed to be some functionality missing and wondered if maybe i overlooked some settings in the app or on the camera. \n\nwhile using it as a remote trigger so i could include myself in the photos, there were three options that would have made it way better:\n\n* haptic and/or audio feedback when a picture is taken, or even the ability to -----> map !!!  the shutter release to a physical button on the phone\n\n* face/eye detect auto focus instead of tap to focus\n\n* a self timer \n\ni'm sure setting the timer on the camera itself is an option, but in the moment i couldn't get back behind the camera to turn it on\n\nthank you", "sortedWord": "None", "identifyer": 40398, "year": "2021"}, {"Unnamed: 0": 296117, "autor": "Aquilarden", "date": 1629161457000, "content": "Eos Webcam Utility Aspect Ratio with Rebel SL1 /!/ Hi all. I'm not very proficient with using my Rebel SL1 and I've just today started trying to use the Webcam Utility. I've found others with the aspect ratio issue, but with different cameras - their solutions don't map onto the options I find on my camera. Basically I have black bars on the sides of my video as the camera wants to shoot 3:2 instead of 16:9. I've restarted my computer, put the camera into the video setting (past \"on\"), and pushed the movie-mode button when prompted - nothing changes. I got it to work once, but after turning it off and on again, it won't go back. So how do I get it to shoot at 16:9 for the webcam utility? I figured someone here would know more about operating this camera and this utility than I do.", "link": "https://www.reddit.com/r/canon/comments/p5t8zh/eos_webcam_utility_aspect_ratio_with_rebel_sl1/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "eos webcam utility aspect ratio with rebel sl1 /!/ hi all. i'm not very proficient with using my rebel sl1 and i've just today started trying to use the webcam utility. i've found others with the aspect ratio issue, but with different cameras - their solutions don't -----> map !!!  onto the options i find on my camera. basically i have black bars on the sides of my video as the camera wants to shoot 3:2 instead of 16:9. i've restarted my computer, put the camera into the video setting (past \"on\"), and pushed the movie-mode button when prompted - nothing changes. i got it to work once, but after turning it off and on again, it won't go back. so how do i get it to shoot at 16:9 for the webcam utility? i figured someone here would know more about operating this camera and this utility than i do.", "sortedWord": "None", "identifyer": 42769, "year": "2021"}], "name": "mapcanon2021"}