{"interestingcomments": [{"Unnamed: 0": 300585, "autor": "hatrox", "date": 1605791543000, "content": "RF 85mm F2 not locking its stabilisation motors when removing from camera /!/ So, recently got the RF 85mm F2 for my Canon RP but something feels strange: when removing it from the camera (while camera is OFF and the \"retract lens on power off\" feature is enabled), the stabilisation motors don't seem to lock themselves, causing the lens assembly inside to move freely, depending on the lens's orientation. The RF 35mm f/1.8 and the RF 24-105mm kit (f/4-7.1) don't seem to exhibit this behaviour, even though they both have IS. My concern is the likeliness of the delicate assembly inside getting damaged from vibrations from my motorcycle. Any ideas? Could anybody with the same lens confirm if their units lock their assemblies when removed from the camera? Thanks!", "link": "https://www.reddit.com/r/canon/comments/jx2fgd/rf_85mm_f2_not_locking_its_stabilisation_motors/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "rf 85mm f2 not locking its stabilisation motors when removing from camera /!/ so, recently got the rf 85mm f2 for my canon rp but something feels strange: when removing it from the camera (while camera is off and the \"retract lens on power off\" feature is enabled), the stabilisation motors don't seem to lock themselves, causing the lens assembly inside to move freely, depending on the lens's -----> orientation !!! . the rf 35mm f/1.8 and the rf 24-105mm kit (f/4-7.1) don't seem to exhibit this behaviour, even though they both have is. my concern is the likeliness of the delicate assembly inside getting damaged from vibrations from my motorcycle. any ideas? could anybody with the same lens confirm if their units lock their assemblies when removed from the camera? thanks!", "sortedWord": "None", "identifyer": 47396, "year": "2020"}, {"Unnamed: 0": 301485, "autor": "Mybagelsarethere", "date": 1592073934000, "content": "Bought a 5D Mark II as fully functional from eBay, but surprise it isn‘t and the seller does not respond /!/ The problem seems to be the sensor for the orientation of the body position. If I shoot in landscape, the picture gets autorotated to vertical. Pictures shot in vertical are rotated 90 degrees to landscape bottom side up.   \nSure, I could turn off auto rotate but that’s not the point and fixing many images in post is cumbersome.\n\nwhat are my options? Can the sensor be replaced or the firmware altered in a way to fix the shift of the sensor?\n\nI appreciate any help. \n\nthanks!", "link": "https://www.reddit.com/r/canon/comments/h8d50n/bought_a_5d_mark_ii_as_fully_functional_from_ebay/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "bought a 5d mark ii as fully functional from ebay, but surprise it isn‘t and the seller does not respond /!/ the problem seems to be the sensor for the -----> orientation !!!  of the body position. if i shoot in landscape, the picture gets autorotated to vertical. pictures shot in vertical are rotated 90 degrees to landscape bottom side up.   \nsure, i could turn off auto rotate but that’s not the point and fixing many images in post is cumbersome.\n\nwhat are my options? can the sensor be replaced or the firmware altered in a way to fix the shift of the sensor?\n\ni appreciate any help. \n\nthanks!", "sortedWord": "None", "identifyer": 48328, "year": "2020"}, {"Unnamed: 0": 303076, "autor": "ITS_MAJOR_TOM_YO", "date": 1605461390000, "content": "EOS R and Apple Photos Orientation Problem /!/ When I import photos it looks fine on the  imports screen but when I select a vertical photos to edit, they rotate!  I cannot figure out why.  Anyone else figure this out?", "link": "https://www.reddit.com/r/canon/comments/jupmfh/eos_r_and_apple_photos_orientation_problem/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "eos r and apple photos -----> orientation !!!  problem /!/ when i import photos it looks fine on the  imports screen but when i select a vertical photos to edit, they rotate!  i cannot figure out why.  anyone else figure this out?", "sortedWord": "None", "identifyer": 49960, "year": "2020"}], "name": "orientationcanon2020"}