{"interestingcomments": [{"Unnamed: 0": 293268, "autor": "fred2806", "date": 1622233988000, "content": "Renting 600mm F4 Canada /!/ Hey! I'd like to treat myself for my birthday renting a Canon EF 600mm F4 L IS II or III. So far I can't find a place in Canada (or QC) where I could rent one.\nI found websites in the US but not sure they ship to Canada. \n\nIf you did rent one or know a place please give me a shoot that would be great. Thanks.", "link": "https://www.reddit.com/r/canon/comments/nn6xet/renting_600mm_f4_canada/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "renting 600mm f4 canada /!/ hey! i'd like to treat myself for my birthday renting a canon ef 600mm f4 l is ii or iii. so far i can't -----> find !!!  -----> a !!!  -----> place !!!  in canada (or qc) where i could rent one.\ni found websites in the us but not sure they ship to canada. \n\nif you did rent one or know a place please give me a shoot that would be great. thanks.", "sortedWord": "None", "identifyer": 39856, "year": "2021"}, {"Unnamed: 0": 297725, "autor": "DjPersh", "date": 1625457199000, "content": "Where should I buy a R6 in the US? /!/ Plan on upgrading from my 80D to an R6 with the 24-105 f4 but can’t decide where to buy it. I’ve given up on trying to find any sales or open box deals, even used seems basically out of the question. \n\nConsidered my local camera shop as it’s the same price as everywhere else. I’ve tried finding a place not charging sales tax but can’t seem to find any anymore. I’m leaning towards Best Buy since I can get it in a few days and they seem pretty good when it comes to returns. Anyone have an on opinion on their extended warranty for a camera like that? Seems to cover a lot. Considered some third part insurance as well. \n\nJust looking for some advice before I drop so much money on an upgrade. I’m mainly a land scape guy but I’ve started doing some real estate and product photography as well.\n\nThanks for any tips. They’re much appreciated.", "link": "https://www.reddit.com/r/canon/comments/odz824/where_should_i_buy_a_r6_in_the_us/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "finding a place", "selectorShort": "place", "MarkedSent": "where should i buy a r6 in the us? /!/ plan on upgrading from my 80d to an r6 with the 24-105 f4 but can’t decide where to buy it. i’ve given up on trying to find any sales or open box deals, even used seems basically out of the question. \n\nconsidered my local camera shop as it’s the same price as everywhere else. i’ve tried -----> finding !!!  -----> a !!!  -----> place !!!  not charging sales tax but can’t seem to find any anymore. i’m leaning towards best buy since i can get it in a few days and they seem pretty good when it comes to returns. anyone have an on opinion on their extended warranty for a camera like that? seems to cover a lot. considered some third part insurance as well. \n\njust looking for some advice before i drop so much money on an upgrade. i’m mainly a land scape guy but i’ve started doing some real estate and product photography as well.\n\nthanks for any tips. they’re much appreciated.", "sortedWord": "None", "identifyer": 44427, "year": "2021"}], "name": "placecanon2021"}