{"interestingcomments": [{"Unnamed: 0": 131274, "autor": "vbguy77", "date": 1520037928000, "content": "Intermittent T5 Issue /!/ So, I have a nearly 3-year old T5 with which I normally shoot in Program mode with the shutter drive set to continuous, and I'm shooting in RAW.\n\nWithin the past month or so, it has started occasionally locking the mirror in the up position after an exposure, and it is not releasing until I cycle the power switch.\n\nThere doesn't seem to be a pattern to when it happens. I do most of my shooting outdoors (my hobby is train photography), so I'm not sure if temperature changes between the inside of my car and the outside may be having an effect, or if this is a sign of something well-know among long-time Canon owners.\n\nI did a Google search for this, but my Google-fu must be lacking, because nothing I put in directed me results that had to do with what I'm experiencing.\n\nThank you in advance for your help. :)", "link": "https://www.reddit.com/r/canon/comments/81kl8i/intermittent_t5_issue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "intermittent t5 issue /!/ so, i have a nearly 3-year old t5 with which i normally shoot in program mode with the shutter drive set to continuous, and i'm shooting in raw.\n\nwithin the past month or so, it has started occasionally locking the mirror in the up -----> position !!!  after an exposure, and it is not releasing until i cycle the power switch.\n\nthere doesn't seem to be a pattern to when it happens. i do most of my shooting outdoors (my hobby is train photography), so i'm not sure if temperature changes between the inside of my car and the outside may be having an effect, or if this is a sign of something well-know among long-time canon owners.\n\ni did a google search for this, but my google-fu must be lacking, because nothing i put in directed me results that had to do with what i'm experiencing.\n\nthank you in advance for your help. :)", "sortedWord": "None", "identifyer": 21991, "year": "2018"}, {"Unnamed: 0": 131317, "autor": "eviktion", "date": 1523670150000, "content": "7D Shuts off during continuous drive, slow and fast. /!/ Good evening! I purchased a 7D second hand yesterday with 10,890 shutter actuations and I've been having a few issues. \n\nIt has a battery communication error and will also shut down after 1-6 shots on continuous. I believe it may be the battery but it also has a small noise which sounds either like a loose button or a loose screw- seemingly the most common issue for a 7D battery communication error. I have managed to squeeze out 40 shots or so without error, but typically it will not do over 3. It seems to be coincidental and not linked to any lens. When the shutdown occurs, the battery icon on the top screen flashes and will not turn back regardless of the power switch position on until the battery has been removed and replaced, otherwise it will just continue to have the battery icon flashing. This leads me to believe my battery is probably screwed.\n\n My attempts to fix.\n\n-Shut off high noise reduction\n\n-Changed AF drive to Release Priority\n\n-New battery being delivered on Monday\n\n\nPotential solutions? \n\n-New battery\n\n-Retrieve screw and tighten to PCB board\n\n-Send to Canon for costly repairs...\n\n\nHas anyone experienced any issues along these lines or maybe know what to do in this situation? I just want to get it functional so I didn't get burned for $450 or immediately pay $230.. \n\n\nThanks\n\nEdit: I have been in touch with Canon and their suggestion is to send it in for repair since they could lend no answers.", "link": "https://www.reddit.com/r/canon/comments/8c4en0/7d_shuts_off_during_continuous_drive_slow_and_fast/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "7d shuts off during continuous drive, slow and fast. /!/ good evening! i purchased a 7d second hand yesterday with 10,890 shutter actuations and i've been having a few issues. \n\nit has a battery communication error and will also shut down after 1-6 shots on continuous. i believe it may be the battery but it also has a small noise which sounds either like a loose button or a loose screw- seemingly the most common issue for a 7d battery communication error. i have managed to squeeze out 40 shots or so without error, but typically it will not do over 3. it seems to be coincidental and not linked to any lens. when the shutdown occurs, the battery icon on the top screen flashes and will not turn back regardless of the power switch -----> position !!!  on until the battery has been removed and replaced, otherwise it will just continue to have the battery icon flashing. this leads me to believe my battery is probably screwed.\n\n my attempts to fix.\n\n-shut off high noise reduction\n\n-changed af drive to release priority\n\n-new battery being delivered on monday\n\n\npotential solutions? \n\n-new battery\n\n-retrieve screw and tighten to pcb board\n\n-send to canon for costly repairs...\n\n\nhas anyone experienced any issues along these lines or maybe know what to do in this situation? i just want to get it functional so i didn't get burned for $450 or immediately pay $230.. \n\n\nthanks\n\nedit: i have been in touch with canon and their suggestion is to send it in for repair since they could lend no answers.", "sortedWord": "None", "identifyer": 22034, "year": "2018"}, {"Unnamed: 0": 131559, "autor": "architype", "date": 1529432034000, "content": "Repair my 6D or upgrade it? /!/ So I was at an event shooting with my 6D and I get the dreaded Err 30 message.  I tried the manual cleaning method that some owners suggested, but the mirror would always lock up and get stuck in the up position.  Taking out the batteries and changing them didn't work either.  So I took it into Canon and they said that I need to repair the mirror box and shutter assembly because they were at their rated limits.  Cost was $600.  That was kind of steep.  A brand new 6D is around $1000.  What would you guys do?  Repair or just wait and save up for a new body?", "link": "https://www.reddit.com/r/canon/comments/8sb3ix/repair_my_6d_or_upgrade_it/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "repair my 6d or upgrade it? /!/ so i was at an event shooting with my 6d and i get the dreaded err 30 message.  i tried the manual cleaning method that some owners suggested, but the mirror would always lock up and get stuck in the up -----> position !!! .  taking out the batteries and changing them didn't work either.  so i took it into canon and they said that i need to repair the mirror box and shutter assembly because they were at their rated limits.  cost was $600.  that was kind of steep.  a brand new 6d is around $1000.  what would you guys do?  repair or just wait and save up for a new body?", "sortedWord": "None", "identifyer": 22276, "year": "2018"}, {"Unnamed: 0": 131956, "autor": "hotrock3", "date": 1545581721000, "content": "To buy grey market or not? I'm about to move... /!/ I'm considering purchasing a 70-200 f2.8 IS USM Mark 3 or Mark 2. The question is do I buy grey market or not considering I'm about to move.\n\nI currently live in the UAE and the lens prices here are insane (70-200 f2.8 IS Mark 3 is $2,700) but I'll be moving to Beijing next summer. I'm only in the US about 4 weeks a year. \n\nIf you were in my position would you spring for a Mk 3 from a Hong Kong based seller for $1,700 or pick up a refurb from Canon USA this summer?\n\nI know that if I buy the Hong Kong lens it *may not* be serviced outside of its intended market (I'm assuming that would be China as a whole.) Even if I bought this while living in China would I be likely to run into problems in the future?", "link": "https://www.reddit.com/r/canon/comments/a8vujz/to_buy_grey_market_or_not_im_about_to_move/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "to buy grey market or not? i'm about to move... /!/ i'm considering purchasing a 70-200 f2.8 is usm mark 3 or mark 2. the question is do i buy grey market or not considering i'm about to move.\n\ni currently live in the uae and the lens prices here are insane (70-200 f2.8 is mark 3 is $2,700) but i'll be moving to beijing next summer. i'm only in the us about 4 weeks a year. \n\nif you were in my -----> position !!!  would you spring for a mk 3 from a hong kong based seller for $1,700 or pick up a refurb from canon usa this summer?\n\ni know that if i buy the hong kong lens it *may not* be serviced outside of its intended market (i'm assuming that would be china as a whole.) even if i bought this while living in china would i be likely to run into problems in the future?", "sortedWord": "None", "identifyer": 22676, "year": "2018"}, {"Unnamed: 0": 132045, "autor": "Alps_89", "date": 1542302882000, "content": "Sigma 35mm 1.4 ART focus issues on 5D mark iii and iv /!/  \n\nHey, before I trade the lens in or send it for repair I would like to know if anyone else has this experience. 1/4 shots seems to be out of focus by a huge amount My 50mm sigma art nails focus 100% of the time except when user error. The 35 lens has been calibrated with the sigma dock and it's tack sharp when it does focus but I just can't trust it during a wedding and it's just sitting in my bag.\n\nExample - [https://imgur.com/a/wR2yUdP](https://imgur.com/a/wR2yUdP)\n\nDo I have a bad copy? I have calibrated it and I stop it down to f2 - use \"expand af focus point\" (I have tried single focus point too). It keeps missing focus really bad even when there isn't much change with the scene or my position.\n\n​\n\nThanks in advance.", "link": "https://www.reddit.com/r/canon/comments/9xd8kl/sigma_35mm_14_art_focus_issues_on_5d_mark_iii_and/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sigma 35mm 1.4 art focus issues on 5d mark iii and iv /!/  \n\nhey, before i trade the lens in or send it for repair i would like to know if anyone else has this experience. 1/4 shots seems to be out of focus by a huge amount my 50mm sigma art nails focus 100% of the time except when user error. the 35 lens has been calibrated with the sigma dock and it's tack sharp when it does focus but i just can't trust it during a wedding and it's just sitting in my bag.\n\nexample - [https://imgur.com/a/wr2yudp](https://imgur.com/a/wr2yudp)\n\ndo i have a bad copy? i have calibrated it and i stop it down to f2 - use \"expand af focus point\" (i have tried single focus point too). it keeps missing focus really bad even when there isn't much change with the scene or my -----> position !!! .\n\n​\n\nthanks in advance.", "sortedWord": "None", "identifyer": 22766, "year": "2018"}, {"Unnamed: 0": 132206, "autor": "massmemes", "date": 1519630626000, "content": "Canon error 20 fix? /!/ Recently my rebel t5 recieved error 20 and upon inspection the shutter is actually stuck in the up position constantly exposing the sensor so since it's like that when I turn the camera on it recognizes it and instantly goes into the error screen. Are there any diy fixes as I can't afford to fix or replace it right now.", "link": "https://www.reddit.com/r/canon/comments/80bajc/canon_error_20_fix/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon error 20 fix? /!/ recently my rebel t5 recieved error 20 and upon inspection the shutter is actually stuck in the up -----> position !!!  constantly exposing the sensor so since it's like that when i turn the camera on it recognizes it and instantly goes into the error screen. are there any diy fixes as i can't afford to fix or replace it right now.", "sortedWord": "None", "identifyer": 22928, "year": "2018"}, {"Unnamed: 0": 132253, "autor": "doddyk96", "date": 1519089786000, "content": "Any canon employees from the Melville, NY office here? /!/ I've been offered a position there out of college but I have a few other interviews lined up. \nI just want to know what the work environment is like and how much opportunity there is to move up?\nOr any other advice/words of wisdom you may have?", "link": "https://www.reddit.com/r/canon/comments/7ys1fh/any_canon_employees_from_the_melville_ny_office/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any canon employees from the melville, ny office here? /!/ i've been offered a -----> position !!!  there out of college but i have a few other interviews lined up. \ni just want to know what the work environment is like and how much opportunity there is to move up?\nor any other advice/words of wisdom you may have?", "sortedWord": "None", "identifyer": 22975, "year": "2018"}, {"Unnamed: 0": 132373, "autor": "t82213", "date": 1521681571000, "content": "Canon summer internship: when are the interviews? /!/ If you have interned for Canon, when was your interview?\nI'm an undergraduate who applied to Canon's summer intern program in late January and I have yet to hear anything back. My application is still existing when I log into their database, so I know it hasn't been rejected. The application I applied for is closed and has been for about 2 weeks. \nI have done a lot of searches to find information about when Canon does interviews, but the only information I can find is on glassdoor.com and there are only about 2 submissions. Basically, I am starting to get worried because I would really love to work for this company and I am qualified for the position I applied for.", "link": "https://www.reddit.com/r/canon/comments/867qb0/canon_summer_internship_when_are_the_interviews/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon summer internship: when are the interviews? /!/ if you have interned for canon, when was your interview?\ni'm an undergraduate who applied to canon's summer intern program in late january and i have yet to hear anything back. my application is still existing when i log into their database, so i know it hasn't been rejected. the application i applied for is closed and has been for about 2 weeks. \ni have done a lot of searches to find information about when canon does interviews, but the only information i can find is on glassdoor.com and there are only about 2 submissions. basically, i am starting to get worried because i would really love to work for this company and i am qualified for the -----> position !!!  i applied for.", "sortedWord": "None", "identifyer": 23095, "year": "2018"}, {"Unnamed: 0": 132696, "autor": "bk112", "date": 1534431160000, "content": "35mm on a cropped sensor (f/1.4 L vs f/2) /!/ r/Canon has been so helpful to me, I hope you guys can help me again.\n\nI shoot with a cropped sensor camera (t6i) and my current absolute favorite lens is the EF 50mm f/1.8. I use it pretty much exclusively for all my food/product photography, which is what I mainly do (indoors, natural light). However, being on a crop sensor, it acts more like a 80mm, which restricts my abilities indoors and especially at restaurants (awkward positions to get distance). My style of photography is usually up close and tight, with the occasional overhead full table. Wouldn't necessarily use this for street photography as its commonly used for. \n\nThe EF 35mm prime lens seems like a great option for me. Providing me extra focal length to get the exact sweet spot I want.\n\nThere's several versions of the lens on the market. (Note: I don't do video, just photo)\n\nEF 35mm f/1.4L II USM (which retails for about $2,000 CAD)\nEF 35mm f/2 IS USM (which retails for about $700 CAD)\nSigma 35mm f/1.4 DG HSM Art (which retails for about $1,000 CAD)\n\nThe EF 35mm f/1.4 II is what my favorite food photographer uses (though, he shoots on a full frame, which in the future I may upgrade to). \n\nI hardly ever go lower than f/2 on my 50mm. Aside from the lower f stop, does the 35mm L actually produce any perks that would warrant its purchase? I don't own any L-series lens yet and don't mind splurging on this as I can see it easily becoming my most used focal length. The size and weight difference don't really bother me. But would it actually produce tangible differences for my work? Or is the f/2 more than capable?\n\nThank you!", "link": "https://www.reddit.com/r/canon/comments/97syiq/35mm_on_a_cropped_sensor_f14_l_vs_f2/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "35mm on a cropped sensor (f/1.4 l vs f/2) /!/ r/canon has been so helpful to me, i hope you guys can help me again.\n\ni shoot with a cropped sensor camera (t6i) and my current absolute favorite lens is the ef 50mm f/1.8. i use it pretty much exclusively for all my food/product photography, which is what i mainly do (indoors, natural light). however, being on a crop sensor, it acts more like a 80mm, which restricts my abilities indoors and especially at restaurants (awkward -----> positions !!!  to get distance). my style of photography is usually up close and tight, with the occasional overhead full table. wouldn't necessarily use this for street photography as its commonly used for. \n\nthe ef 35mm prime lens seems like a great option for me. providing me extra focal length to get the exact sweet spot i want.\n\nthere's several versions of the lens on the market. (note: i don't do video, just photo)\n\nef 35mm f/1.4l ii usm (which retails for about $2,000 cad)\nef 35mm f/2 is usm (which retails for about $700 cad)\nsigma 35mm f/1.4 dg hsm art (which retails for about $1,000 cad)\n\nthe ef 35mm f/1.4 ii is what my favorite food photographer uses (though, he shoots on a full frame, which in the future i may upgrade to). \n\ni hardly ever go lower than f/2 on my 50mm. aside from the lower f stop, does the 35mm l actually produce any perks that would warrant its purchase? i don't own any l-series lens yet and don't mind splurging on this as i can see it easily becoming my most used focal length. the size and weight difference don't really bother me. but would it actually produce tangible differences for my work? or is the f/2 more than capable?\n\nthank you!", "sortedWord": "None", "identifyer": 23420, "year": "2018"}, {"Unnamed: 0": 132705, "autor": "bk112", "date": 1534271976000, "content": "Photography enthusiast, worth upgrading from Rebel t6i? /!/ Hello r/Canon,\n\nI've been using the Canon Rebel Series since the t3i model. Upgraded to the t5i for a while, and then again to the t6i. I want to upgrade out of rebel but I'm trying to think if an upgrade is even necessary. Some relevant info:\n\nFirst, my budget is very flexible. I don't mind splurging on a camera. Its not my day job, but it is my main hobby and I want to treat myself and grow even more with my skills.\n\nSecond, I'm a Canon user: Its what I've always used, and what all my lenses are (10-18mm, 50mm, 60mm macro, 55-250mm). Could be open to upgrading to mirrorless or full frame cameras but I feel like I already got a lot of Canon gear that work on APS-C DSLRs.\n\nThird, I primarily shoot indoors. Food photography is my main arena of photography. Travel/landscape photography is secondary. May soon be getting into more outdoor wildlife photography in 2019 and beyond.\n\nFourth; I love the swivel screen, wifi, and touchscreen features currently on the t6i.\n\nLastly, I almost exclusively only take photos. Videos are something I seldom do.\n\nThe 80D looks somewhat enticing. From what I understand, the shutter speed and extra AF points would be well suited for wildlife photography. Curious tho, would the extra AF points have any benefits on still photography (such as landscape or food)? I'm in no rush to upgrade, I would likely wait until a sale or perhaps even a new camera (90D?) gets released.\n\nCan anyone offer their input or advice? Thank you!\n\nP.S. Also eager for a new lens to replace my 50mm. I use the 50mm for food pictures, and I'm very happy with the results it produces, but the focal length on a cropped sensor (which makes it act more like a 80mm) requires me to sometimes stand in awkward/ridiculous positions. Maybe a 35mm prime would serve me better?", "link": "https://www.reddit.com/r/canon/comments/97axq7/photography_enthusiast_worth_upgrading_from_rebel/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "photography enthusiast, worth upgrading from rebel t6i? /!/ hello r/canon,\n\ni've been using the canon rebel series since the t3i model. upgraded to the t5i for a while, and then again to the t6i. i want to upgrade out of rebel but i'm trying to think if an upgrade is even necessary. some relevant info:\n\nfirst, my budget is very flexible. i don't mind splurging on a camera. its not my day job, but it is my main hobby and i want to treat myself and grow even more with my skills.\n\nsecond, i'm a canon user: its what i've always used, and what all my lenses are (10-18mm, 50mm, 60mm macro, 55-250mm). could be open to upgrading to mirrorless or full frame cameras but i feel like i already got a lot of canon gear that work on aps-c dslrs.\n\nthird, i primarily shoot indoors. food photography is my main arena of photography. travel/landscape photography is secondary. may soon be getting into more outdoor wildlife photography in 2019 and beyond.\n\nfourth; i love the swivel screen, wifi, and touchscreen features currently on the t6i.\n\nlastly, i almost exclusively only take photos. videos are something i seldom do.\n\nthe 80d looks somewhat enticing. from what i understand, the shutter speed and extra af points would be well suited for wildlife photography. curious tho, would the extra af points have any benefits on still photography (such as landscape or food)? i'm in no rush to upgrade, i would likely wait until a sale or perhaps even a new camera (90d?) gets released.\n\ncan anyone offer their input or advice? thank you!\n\np.s. also eager for a new lens to replace my 50mm. i use the 50mm for food pictures, and i'm very happy with the results it produces, but the focal length on a cropped sensor (which makes it act more like a 80mm) requires me to sometimes stand in awkward/ridiculous -----> positions !!! . maybe a 35mm prime would serve me better?", "sortedWord": "None", "identifyer": 23430, "year": "2018"}, {"Unnamed: 0": 133023, "autor": "paddo93", "date": 1543511505000, "content": "Live Streaming to a projector via HDMI with Canon /!/ HELP! Ive managed to find myself in a sticky position... Im helping to host a charity event and we dont have the budget to get an AV team to set up the event space so we are hiring projectors etc. so we can live stream whats happening on stage to the audience. I have two canon DSLRs  200D and a 6D and at first thought it would be super easy to connect them via HDMI to the projectors but the shutter keeps closing unless Im filming and we dont want to record anything. Is there a way around this?", "link": "https://www.reddit.com/r/canon/comments/a1j8bi/live_streaming_to_a_projector_via_hdmi_with_canon/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "live streaming to a projector via hdmi with canon /!/ help! ive managed to find myself in a sticky -----> position !!! ... im helping to host a charity event and we dont have the budget to get an av team to set up the event space so we are hiring projectors etc. so we can live stream whats happening on stage to the audience. i have two canon dslrs  200d and a 6d and at first thought it would be super easy to connect them via hdmi to the projectors but the shutter keeps closing unless im filming and we dont want to record anything. is there a way around this?", "sortedWord": "None", "identifyer": 23751, "year": "2018"}, {"Unnamed: 0": 133178, "autor": "choorel", "date": 1540699103000, "content": "Best lens for outdoor engagement /!/ I have an M50 with the kit lens and the 22mm f2.  I need to be prepared to capture my sister in laws engagement and I’m trying to figure out what lens to rent. \n\nI would like to have a bit of zoom so I can zoom in or out in case I can’t get a good position like I would have to with a prime lens. I know enough to get decent shots, just haven’t used many lenses over the years beyond kit lenses. \n\nI’m considering the Sigma 18-35 f1.8 but I’m not sure if the compatibility with the M50. ", "link": "https://www.reddit.com/r/canon/comments/9s0hno/best_lens_for_outdoor_engagement/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best lens for outdoor engagement /!/ i have an m50 with the kit lens and the 22mm f2.  i need to be prepared to capture my sister in laws engagement and i’m trying to figure out what lens to rent. \n\ni would like to have a bit of zoom so i can zoom in or out in case i can’t get a good -----> position !!!  like i would have to with a prime lens. i know enough to get decent shots, just haven’t used many lenses over the years beyond kit lenses. \n\ni’m considering the sigma 18-35 f1.8 but i’m not sure if the compatibility with the m50. ", "sortedWord": "None", "identifyer": 23907, "year": "2018"}, {"Unnamed: 0": 133245, "autor": "smishNelson", "date": 1540041724000, "content": "[Question] C100: Does anyone know the correct screw size for the C100 handle microphone mount? /!/ Hi guys, I apologize if this is against the rules. I'm looking for the correct screw size for the c100 handle microphone mount. I have taken it to my local fastener shop but they were unable to ID it due to its size. I don't want to go with the official canon ones as they are quite expensive and I am looking to buy in bulk, as I am in a position where they get lost quite often.\n\nOne forum I found says they are 30-10 or something similar to that, but I want to be sure.\n\nThanks in advance", "link": "https://www.reddit.com/r/canon/comments/9pu3am/question_c100_does_anyone_know_the_correct_screw/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[question] c100: does anyone know the correct screw size for the c100 handle microphone mount? /!/ hi guys, i apologize if this is against the rules. i'm looking for the correct screw size for the c100 handle microphone mount. i have taken it to my local fastener shop but they were unable to id it due to its size. i don't want to go with the official canon ones as they are quite expensive and i am looking to buy in bulk, as i am in a -----> position !!!  where they get lost quite often.\n\none forum i found says they are 30-10 or something similar to that, but i want to be sure.\n\nthanks in advance", "sortedWord": "None", "identifyer": 23974, "year": "2018"}, {"Unnamed: 0": 133355, "autor": "zwillc92", "date": 1515025786000, "content": "80D shutter button stuck. help! /!/   I bought a brand new 80D about 2 weeks ago. I have only taken it on 3 shoots. The shutter button is stuck. It feels to be in the half-pressed position. There are not two two positions when I press the shutter button. I cant change any settings, I cant access the menu, nothing. It is constantly trying to focus. Does anyone know how to free it up? Is this a known issue with Canon? ", "link": "https://www.reddit.com/r/canon/comments/7nz3v9/80d_shutter_button_stuck_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "80d shutter button stuck. help! /!/   i bought a brand new 80d about 2 weeks ago. i have only taken it on 3 shoots. the shutter button is stuck. it feels to be in the half-pressed -----> position !!! . there are not two two positions when i press the shutter button. i cant change any settings, i cant access the menu, nothing. it is constantly trying to focus. does anyone know how to free it up? is this a known issue with canon? ", "sortedWord": "None", "identifyer": 24084, "year": "2018"}], "name": "positioncanon2018"}