{"interestingcomments": [{"Unnamed: 0": 298316, "autor": "rickyrorton", "date": 1590162514000, "content": "IDK if this is the right place but I have a problem with my Canon pixma MG 3040 printer /!/ The problem is that when i turn it on the printhead doesnt move but it does get recognized by the pc but when i try scanning it shows there is a problem scanning and tells me that the printer is busy pls help me i broke my ipad a couple days ago and i am unable to take photos so i tried using the printer but it doesnt work pls help i really need to scan documents for online classes\n\nUpdate:the print head moves to the catridge loading position but it still cant scan\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/canon/comments/golrxy/idk_if_this_is_the_right_place_but_i_have_a/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "idk if this is the right place but i have a problem with my canon pixma mg 3040 printer /!/ the problem is that when i turn it on the printhead doesnt move but it does get recognized by the pc but when i try scanning it shows there is a problem scanning and tells me that the printer is busy pls help me i broke my ipad a couple days ago and i am unable to take photos so i tried using the printer but it doesnt work pls help i really need to scan documents for online classes\n\nupdate:the print head moves to the catridge loading -----> position !!!  but it still cant scan\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 45040, "year": "2020"}, {"Unnamed: 0": 298830, "autor": "Ginger-Engineer", "date": 1605886848000, "content": "Mirrorless or DSLR? /!/ Hey all, I'm in the market for my first 'real' camera, and need some advice.\n\nI've borrowed many a DSLR from friends and family to photograph things in the past (portraits, static automotive content, landscape stuff), and am finally in a position to get my own gear. I've narrowed my search down to either a T8i or an M50 Mark II. I have zero experience with a mirrorless camera. For a beginner/enthusiast which would you choose and why?", "link": "https://www.reddit.com/r/canon/comments/jxr9om/mirrorless_or_dslr/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mirrorless or dslr? /!/ hey all, i'm in the market for my first 'real' camera, and need some advice.\n\ni've borrowed many a dslr from friends and family to photograph things in the past (portraits, static automotive content, landscape stuff), and am finally in a -----> position !!!  to get my own gear. i've narrowed my search down to either a t8i or an m50 mark ii. i have zero experience with a mirrorless camera. for a beginner/enthusiast which would you choose and why?", "sortedWord": "None", "identifyer": 45572, "year": "2020"}, {"Unnamed: 0": 299641, "autor": "Brane212", "date": 1589816571000, "content": "Canon R9 /!/ Canon R9 has appeared on canonrumours.\n\nI  know it's early for such guestimmates, but I'm asking about opinion,  based on your experience with Canon politics and past lineup.\n\nR9 is supposed to come next year and be replacement for RP, presumably at the same price point.\n\nSo, is it likely to have:\n\n\\- new sensor ( Current RP has 6D's sensor)\n\n\\- IBIS\n\n\\- improved dynamic range\n\nAnything else that one could expect from model on lowest price position ?", "link": "https://www.reddit.com/r/canon/comments/gm3tyn/canon_r9/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon r9 /!/ canon r9 has appeared on canonrumours.\n\ni  know it's early for such guestimmates, but i'm asking about opinion,  based on your experience with canon politics and past lineup.\n\nr9 is supposed to come next year and be replacement for rp, presumably at the same price point.\n\nso, is it likely to have:\n\n\\- new sensor ( current rp has 6d's sensor)\n\n\\- ibis\n\n\\- improved dynamic range\n\nanything else that one could expect from model on lowest price -----> position !!!  ?", "sortedWord": "None", "identifyer": 46420, "year": "2020"}, {"Unnamed: 0": 300003, "autor": "n0ahfence", "date": 1596404480000, "content": "Canon R5/R6/1Dx2 &amp; dogs (...help?) /!/ I'm currently using a 1dx mk1 and I'm looking to upgrade and need some honest opinions.\nIt'll either be moving to the R5 or R6 or getting a used 1dx2 since the 1dx3 is out of my budget. \n\nI photograph dogs and a chunk of the photography is them running straight at me at full speed. \nI shoot with the EF 300mm f2.8 and intend to keep my EF glass and adapt it.\n\nSo... the new R5 &amp; R6 have the animal AF whereas staying with a 1D body does not. \nAlthough most new owners of the R5 probably haven't tested what I'm asking, do you think it would be better for me to stick with a 1D body or go to one of the new bodies? \nCan the R5/6 AF system track a fast moving subject coming straight at the camera or do I need to keep to a 1D body for that kind of action?\n\nI don't video at all either so the only reason I currently know to go with the R5 over the R6 is the megapixel bump and ability to crop more. \nAnimal AF looks awesome but It's useless to me if it can't keep up, whereas the 1Dx2 has a proven track record. \nI saw a video of a dog moving towards the camera but it wasn't very quickly.\n\nBasically... If you were in my position, which would you go for and why?", "link": "https://www.reddit.com/r/canon/comments/i2kcwm/canon_r5r61dx2_dogs_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon r5/r6/1dx2 &amp; dogs (...help?) /!/ i'm currently using a 1dx mk1 and i'm looking to upgrade and need some honest opinions.\nit'll either be moving to the r5 or r6 or getting a used 1dx2 since the 1dx3 is out of my budget. \n\ni photograph dogs and a chunk of the photography is them running straight at me at full speed. \ni shoot with the ef 300mm f2.8 and intend to keep my ef glass and adapt it.\n\nso... the new r5 &amp; r6 have the animal af whereas staying with a 1d body does not. \nalthough most new owners of the r5 probably haven't tested what i'm asking, do you think it would be better for me to stick with a 1d body or go to one of the new bodies? \ncan the r5/6 af system track a fast moving subject coming straight at the camera or do i need to keep to a 1d body for that kind of action?\n\ni don't video at all either so the only reason i currently know to go with the r5 over the r6 is the megapixel bump and ability to crop more. \nanimal af looks awesome but it's useless to me if it can't keep up, whereas the 1dx2 has a proven track record. \ni saw a video of a dog moving towards the camera but it wasn't very quickly.\n\nbasically... if you were in my -----> position !!! , which would you go for and why?", "sortedWord": "None", "identifyer": 46791, "year": "2020"}, {"Unnamed: 0": 300335, "autor": "canonfoot", "date": 1600986030000, "content": "Does the Canon EOS RP display have an on-screen indicator for when the lens Image Stabilization is set to ON? /!/ As the title says, I'm curious to see if anyone knows if the RP has any sort of visual indication that the Image Stabilization switch on an RF lens has been switched to the ON position? With my previous camera, the Sony A7 first gen, I could see if the image stabilization was on based on the SteadyShot icon that looked like this [this.](https://1.img-dpreview.com/files/w/TS560x560?url=https%3A%2F%2Fphotos.smugmug.com%2Fphotos%2Fi-4ShfD6Q%2F0%2F20e5472a%2FXL%2Fi-4ShfD6Q-XL.jpg&amp;signature=mhOxry6tO0Oc3TpAB2rDuDRkIlY%3D)\n\nI know it's going to be tempting to say just look at the lens itself, but I found it pretty helpful to have an indicator on the viewfinder screens to remind me whether or not I need to make changes for tripod/non-tripod shooting. I got burned the other week when shooting astrophotography because I forgot to turn off the lens IS after using it earlier in the day.\n\nI've scoured the RP user manual, and searched on forums to no avail - so I'm hoping someone here may have found a workaround.", "link": "https://www.reddit.com/r/canon/comments/iz77ke/does_the_canon_eos_rp_display_have_an_onscreen/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "does the canon eos rp display have an on-screen indicator for when the lens image stabilization is set to on? /!/ as the title says, i'm curious to see if anyone knows if the rp has any sort of visual indication that the image stabilization switch on an rf lens has been switched to the on -----> position !!! ? with my previous camera, the sony a7 first gen, i could see if the image stabilization was on based on the steadyshot icon that looked like this [this.](https://1.img-dpreview.com/files/w/ts560x560?url=https%3a%2f%2fphotos.smugmug.com%2fphotos%2fi-4shfd6q%2f0%2f20e5472a%2fxl%2fi-4shfd6q-xl.jpg&amp;signature=mhoxry6to0oc3tpab2rdudrkily%3d)\n\ni know it's going to be tempting to say just look at the lens itself, but i found it pretty helpful to have an indicator on the viewfinder screens to remind me whether or not i need to make changes for tripod/non-tripod shooting. i got burned the other week when shooting astrophotography because i forgot to turn off the lens is after using it earlier in the day.\n\ni've scoured the rp user manual, and searched on forums to no avail - so i'm hoping someone here may have found a workaround.", "sortedWord": "None", "identifyer": 47134, "year": "2020"}, {"Unnamed: 0": 300394, "autor": "sturdybutter", "date": 1602546073000, "content": "How is Canons customer service? /!/ I recently purchased a Canon rebel T7 (got it about 3 maybe 4 months ago) and just let me start by saying that I absolutely baby my equipment. Unless the camera is on my person and being used, its inside the carrying case it came with, that sits snuggly inside my backpack. Tons of cushioning and protection. \n\nWell today I take it out to shoot some photos with my 3 year old, go to turn it on, and nothing. I thought maybe the battery was dead so threw it on the charger till it was full and popped it back in.\n\nThe camera turns on, and I can hear it try and focus when I hit the shutter button but nothing is on the display, the buttons around the display dont do anything, and when I look through the viewfinder it says 'busy' in the bottom left corner. \n\nHas anyone experienced this happening without any seeming cause? How decent is Canon when it comes to customer relations? Should I expect professionalism and helpfulness or do I need to be aggressive, because I'm absolutely not in a position to just write off a $600 camera.\n\nI sincerely hope someone can offer some insight or assistance. I very much appreciate anything you guys have to offer. I haven't been this upset in a long while.\nI'm not a pro by any means whatsoever but I try to document atleast a few photos of my son and I every day so we have something to go back and remember and reflect on. \n\nIts kind of breaking my heart knowing that I won't have a camera to use for probably atleast the next week or two, and thats if I can get Canon to take care of it. \n\nTrying to prepare myself for the all too real possibility that I will not have a camera for a very long time.", "link": "https://www.reddit.com/r/canon/comments/ja298e/how_is_canons_customer_service/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how is canons customer service? /!/ i recently purchased a canon rebel t7 (got it about 3 maybe 4 months ago) and just let me start by saying that i absolutely baby my equipment. unless the camera is on my person and being used, its inside the carrying case it came with, that sits snuggly inside my backpack. tons of cushioning and protection. \n\nwell today i take it out to shoot some photos with my 3 year old, go to turn it on, and nothing. i thought maybe the battery was dead so threw it on the charger till it was full and popped it back in.\n\nthe camera turns on, and i can hear it try and focus when i hit the shutter button but nothing is on the display, the buttons around the display dont do anything, and when i look through the viewfinder it says 'busy' in the bottom left corner. \n\nhas anyone experienced this happening without any seeming cause? how decent is canon when it comes to customer relations? should i expect professionalism and helpfulness or do i need to be aggressive, because i'm absolutely not in a -----> position !!!  to just write off a $600 camera.\n\ni sincerely hope someone can offer some insight or assistance. i very much appreciate anything you guys have to offer. i haven't been this upset in a long while.\ni'm not a pro by any means whatsoever but i try to document atleast a few photos of my son and i every day so we have something to go back and remember and reflect on. \n\nits kind of breaking my heart knowing that i won't have a camera to use for probably atleast the next week or two, and thats if i can get canon to take care of it. \n\ntrying to prepare myself for the all too real possibility that i will not have a camera for a very long time.", "sortedWord": "None", "identifyer": 47198, "year": "2020"}, {"Unnamed: 0": 300550, "autor": "liam-donoma", "date": 1604117573000, "content": "70D still overheating, even after repair. /!/  My 70D, which I've had since 2014, recently died during a video shoot; the screen froze, and it wouldn't turn off. I had to take the battery out, which turned it off, but it never came back on, even when trying other batteries. It had the start of the serial number(s) that were a weird batch, and caused the \"error 70/80\" issue, so Canon (surprisingly quickly) replaced the circuit board for free. I got it back a couple of days ago and just tried it out for the first time. I only took some photos, didn't even try video, and it warmed up pretty fast, same as it was doing prior to failing. :( \nI mean, I feel lucky that it lasted as long as it did, because it's always had an overheating problem, but I was really hoping this repair would fix that. \n\nI'm unsure what to do. I don't wanna be a burden by contacting Canon again so soon, lol. Should I accept my hot camera and strap an ice pack to it? 😅 \n\nI guess I'm wondering what you would do in my position, or if anyone has experienced the same/something similar. Thanks!", "link": "https://www.reddit.com/r/canon/comments/jlc2on/70d_still_overheating_even_after_repair/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "70d still overheating, even after repair. /!/  my 70d, which i've had since 2014, recently died during a video shoot; the screen froze, and it wouldn't turn off. i had to take the battery out, which turned it off, but it never came back on, even when trying other batteries. it had the start of the serial number(s) that were a weird batch, and caused the \"error 70/80\" issue, so canon (surprisingly quickly) replaced the circuit board for free. i got it back a couple of days ago and just tried it out for the first time. i only took some photos, didn't even try video, and it warmed up pretty fast, same as it was doing prior to failing. :( \ni mean, i feel lucky that it lasted as long as it did, because it's always had an overheating problem, but i was really hoping this repair would fix that. \n\ni'm unsure what to do. i don't wanna be a burden by contacting canon again so soon, lol. should i accept my hot camera and strap an ice pack to it? 😅 \n\ni guess i'm wondering what you would do in my -----> position !!! , or if anyone has experienced the same/something similar. thanks!", "sortedWord": "None", "identifyer": 47361, "year": "2020"}, {"Unnamed: 0": 300870, "autor": "ImDixon", "date": 1608822038000, "content": "Looking for lens advice for an EOS R for new hobbyest/potential professional /!/ Hi there!\n\nA couple of months back my wife had mentioned her interest of getting into photography. She got a new phone and started shooting everything and having a blast. That led to her looking into entry level cameras to dabble around. Long story short, instead of buying something, her father temporarily lent her his camera, and EOS m200. She then fell in love with taking pictures of literally anything and everything.\n\nFast forward to the present. Over the past couple of weeks I've been looking everywhere for any information about cameras I can absorb, and I've landed on getting \"us\" an EOS R for a late surprise Christmas present. I get this is probably more than what we're looking for, but I figure it holds value pretty well and I'm lucky enough to be in a position to afford it at the moment. This year a while back, we agreed not to exchange gifts for whatever reason, but I think this is one we can both enjoy. I landed on the R because I can see her passion and she mentions doing it professionally in the future as well as vlogging, and I also have an interest in looking into doing a form of talking head media.\n\nThis leads to my questions:\n\nShould I get an EF adapter and buy a handful of cheaper EF lenses or should I bite the bullet and get one single RF lens (and maaaybe the 50) and hold out for a couple months before I can get another instead? Is the kit lens worth looking at?\n\nThe scope I'm looking to cover is mainly nature, animal, portrait and potentially weddings, as well as vlogging/talking head video. Not so much landscapes or architecture, though its still a wide variety.\n\nI realize this is probably a terrible wall of text, and I'm sorry for that, but this subreddit seems very informative so I figure I'd give it a shot. Thanks in advance! :P", "link": "https://www.reddit.com/r/canon/comments/kjgrym/looking_for_lens_advice_for_an_eos_r_for_new/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for lens advice for an eos r for new hobbyest/potential professional /!/ hi there!\n\na couple of months back my wife had mentioned her interest of getting into photography. she got a new phone and started shooting everything and having a blast. that led to her looking into entry level cameras to dabble around. long story short, instead of buying something, her father temporarily lent her his camera, and eos m200. she then fell in love with taking pictures of literally anything and everything.\n\nfast forward to the present. over the past couple of weeks i've been looking everywhere for any information about cameras i can absorb, and i've landed on getting \"us\" an eos r for a late surprise christmas present. i get this is probably more than what we're looking for, but i figure it holds value pretty well and i'm lucky enough to be in a -----> position !!!  to afford it at the moment. this year a while back, we agreed not to exchange gifts for whatever reason, but i think this is one we can both enjoy. i landed on the r because i can see her passion and she mentions doing it professionally in the future as well as vlogging, and i also have an interest in looking into doing a form of talking head media.\n\nthis leads to my questions:\n\nshould i get an ef adapter and buy a handful of cheaper ef lenses or should i bite the bullet and get one single rf lens (and maaaybe the 50) and hold out for a couple months before i can get another instead? is the kit lens worth looking at?\n\nthe scope i'm looking to cover is mainly nature, animal, portrait and potentially weddings, as well as vlogging/talking head video. not so much landscapes or architecture, though its still a wide variety.\n\ni realize this is probably a terrible wall of text, and i'm sorry for that, but this subreddit seems very informative so i figure i'd give it a shot. thanks in advance! :p", "sortedWord": "None", "identifyer": 47685, "year": "2020"}, {"Unnamed: 0": 301011, "autor": "Swisstopher2000", "date": 1578000252000, "content": "Gimbal for Canon eos rp /!/ I just got this camera recently and a zhiyun 3 axis gimbal stabilizer but I'm having issues with the camera being in a position so that it doesn't topple forward. Is the camera not compatible With the gimbal or am i not doing it correctly?", "link": "https://www.reddit.com/r/canon/comments/ej4ju2/gimbal_for_canon_eos_rp/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "gimbal for canon eos rp /!/ i just got this camera recently and a zhiyun 3 axis gimbal stabilizer but i'm having issues with the camera being in a -----> position !!!  so that it doesn't topple forward. is the camera not compatible with the gimbal or am i not doing it correctly?", "sortedWord": "None", "identifyer": 47830, "year": "2020"}, {"Unnamed: 0": 301474, "autor": "likelyprocrastinatin", "date": 1592148142000, "content": "Vertical shooting problem with 1DX /!/ I'm trying to troubleshoot my 1DX before making the $50 trip to CPS over this issue. With the selector switch in the on position, my camera's vertical AF, metering, focus selection, M-Fn, shutter release, and multi select button do not work. \n\nAnybody ever have this problem and would know anything about it? Thank you!", "link": "https://www.reddit.com/r/canon/comments/h8vq6s/vertical_shooting_problem_with_1dx/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "vertical shooting problem with 1dx /!/ i'm trying to troubleshoot my 1dx before making the $50 trip to cps over this issue. with the selector switch in the on -----> position !!! , my camera's vertical af, metering, focus selection, m-fn, shutter release, and multi select button do not work. \n\nanybody ever have this problem and would know anything about it? thank you!", "sortedWord": "None", "identifyer": 48317, "year": "2020"}, {"Unnamed: 0": 301787, "autor": "PiccoloSea", "date": 1594518857000, "content": "Error 60. /!/ Hello there, Canon people!\n\nI recently got the error 60 on my 77D and I did a lot of research but couldn't find any solutions.I was taking some pictures with my friends, when I had to turn off my DSLR for about 30 minutes or so because we were taking a break and playing some games. We decided to do some photography after we were done playing some games, So I got my DSLR moved the switch to the ON position, and saw \"Err 60\" on the top LCD, I thought it's maybe the battery that was causing the issue, I removed the battery and inserted it again, The camera wouldn't turn on, not even \"Err 60\" on the top LCD, I thought I'd try to put the battery on the charger for some time, Maybe the battery needs a little bit of charge, I thought **(Note: The battery was 75%\\~ charged before this happened),** I put the battery on the charger for about 30 minutes.\n\nI tried again after 30 minutes of putting the battery on the charger, I put the battery in the camera, Put the switch on the  \"ON\" position, I got nothing, Top LCD, **no text**, Viewfinder, **Darker than usual**, like when you have the battery removed, Display, **No output**, pressing buttons, **Nothing,** trying a different lens, **Nothing**, Removing and inserting the battery, **Nothing.**\n\n&amp;#x200B;\n\nPlease help!\n\nThanks for reading.", "link": "https://www.reddit.com/r/canon/comments/hpmbw5/error_60/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "error 60. /!/ hello there, canon people!\n\ni recently got the error 60 on my 77d and i did a lot of research but couldn't find any solutions.i was taking some pictures with my friends, when i had to turn off my dslr for about 30 minutes or so because we were taking a break and playing some games. we decided to do some photography after we were done playing some games, so i got my dslr moved the switch to the on -----> position !!! , and saw \"err 60\" on the top lcd, i thought it's maybe the battery that was causing the issue, i removed the battery and inserted it again, the camera wouldn't turn on, not even \"err 60\" on the top lcd, i thought i'd try to put the battery on the charger for some time, maybe the battery needs a little bit of charge, i thought **(note: the battery was 75%\\~ charged before this happened),** i put the battery on the charger for about 30 minutes.\n\ni tried again after 30 minutes of putting the battery on the charger, i put the battery in the camera, put the switch on the  \"on\" position, i got nothing, top lcd, **no text**, viewfinder, **darker than usual**, like when you have the battery removed, display, **no output**, pressing buttons, **nothing,** trying a different lens, **nothing**, removing and inserting the battery, **nothing.**\n\n&amp;#x200b;\n\nplease help!\n\nthanks for reading.", "sortedWord": "None", "identifyer": 48632, "year": "2020"}, {"Unnamed: 0": 301862, "autor": "BrewAndAView", "date": 1595456533000, "content": "Stuck in Canon Repair Limbo - Losing hope for my poor Canon RP /!/ I bought a Canon RP March 2019 and got a CarePak to cover repair costs. Lately my camera has been turning on by itself even when the physical switch is set to off. It turns on and off in a flickering manner for hours while it sits in an OFF position and I'm worried this is doing bad damage to the circuits inside, kind of like how turning a lightbulb on and off rapidly isn't good for it. I resort to taking the battery out when it's not in use. This happens only after sitting on my desk for multiple hours. (No lens, multiple first-party batteries tested). [Video of the problem](https://imgur.com/a/VunUFUQ)\n\nI sent it into Canon under my CarePak and they replaced the process control board did a quick QA and sent it back. It's still having the problem because of course they didn't sit and stare at it for 4 hours like I do when it's on my desk to properly test this.\n\nI sent it back into repair and explained that the problem wasn't solved and after a few days, they say they're not able to recreate the problem. And they want me to send in the Lens, Memory Card, and Battery for inspection. I know it's not the Lens or Memory card since it happens without those attached, and I'm nearly confident that it's not a battery problem.\n\nAt this point I would prefer a full camera replacement, where I pay whatever I need to to offset that cost, but I suggested that 2 days ago and haven't received a response.\n\nThis is stressing me out pretty badly and I don't want to end up with a camera that is actively killing itself while not in use.", "link": "https://www.reddit.com/r/canon/comments/hw3jfs/stuck_in_canon_repair_limbo_losing_hope_for_my/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "stuck in canon repair limbo - losing hope for my poor canon rp /!/ i bought a canon rp march 2019 and got a carepak to cover repair costs. lately my camera has been turning on by itself even when the physical switch is set to off. it turns on and off in a flickering manner for hours while it sits in an off -----> position !!!  and i'm worried this is doing bad damage to the circuits inside, kind of like how turning a lightbulb on and off rapidly isn't good for it. i resort to taking the battery out when it's not in use. this happens only after sitting on my desk for multiple hours. (no lens, multiple first-party batteries tested). [video of the problem](https://imgur.com/a/vunufuq)\n\ni sent it into canon under my carepak and they replaced the process control board did a quick qa and sent it back. it's still having the problem because of course they didn't sit and stare at it for 4 hours like i do when it's on my desk to properly test this.\n\ni sent it back into repair and explained that the problem wasn't solved and after a few days, they say they're not able to recreate the problem. and they want me to send in the lens, memory card, and battery for inspection. i know it's not the lens or memory card since it happens without those attached, and i'm nearly confident that it's not a battery problem.\n\nat this point i would prefer a full camera replacement, where i pay whatever i need to to offset that cost, but i suggested that 2 days ago and haven't received a response.\n\nthis is stressing me out pretty badly and i don't want to end up with a camera that is actively killing itself while not in use.", "sortedWord": "None", "identifyer": 48710, "year": "2020"}, {"Unnamed: 0": 302279, "autor": "drewng98", "date": 1598358742000, "content": "EOS 50 SLR Battery level affecting shutter speed /!/ I've just noticed that my EOS 50 film camera freezes up at shutter speeds of 750 upwards. It will take the picture (shutter curtian moves down but not returning) but flashes the 'no battery' symbol. If I tune it back down to shutter speed of 500, everything acts normal and it shows full battery. \n\nIs there something I'm missing? Does a high shutter speed drain the battery so much that the shutter curtain doesnt return to the original position? \n\n  \nAny help appreciated.", "link": "https://www.reddit.com/r/canon/comments/igb8oj/eos_50_slr_battery_level_affecting_shutter_speed/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "eos 50 slr battery level affecting shutter speed /!/ i've just noticed that my eos 50 film camera freezes up at shutter speeds of 750 upwards. it will take the picture (shutter curtian moves down but not returning) but flashes the 'no battery' symbol. if i tune it back down to shutter speed of 500, everything acts normal and it shows full battery. \n\nis there something i'm missing? does a high shutter speed drain the battery so much that the shutter curtain doesnt return to the original -----> position !!! ? \n\n  \nany help appreciated.", "sortedWord": "None", "identifyer": 49136, "year": "2020"}, {"Unnamed: 0": 302309, "autor": "just-a-spaz", "date": 1599069216000, "content": "Crooked Screen on Canon SL3/250D /!/ This keeps bugging me more than it really should. When my screen is folded closed into the camera (normal position) it appears slanted upward a bit so it's not parallel from the bottom of the camera. This makes the eye-piece look like it's crooked, but it's the screen. If I push down on the articulating screen, I can push it into place, but a slight bump will make it go crooked again.\n\nIs there anything I can do about this?\n\nI'll post a picture in a minute", "link": "https://www.reddit.com/r/canon/comments/ilbqtg/crooked_screen_on_canon_sl3250d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "crooked screen on canon sl3/250d /!/ this keeps bugging me more than it really should. when my screen is folded closed into the camera (normal -----> position !!! ) it appears slanted upward a bit so it's not parallel from the bottom of the camera. this makes the eye-piece look like it's crooked, but it's the screen. if i push down on the articulating screen, i can push it into place, but a slight bump will make it go crooked again.\n\nis there anything i can do about this?\n\ni'll post a picture in a minute", "sortedWord": "None", "identifyer": 49168, "year": "2020"}, {"Unnamed: 0": 302764, "autor": "Gojira707", "date": 1603300042000, "content": "Deciding between 7D Mk II or R6 /!/ Hey all,\n\nI got out of photography in 2017 when I accepted a position with a motorsports tour and really didn't have much time to photograph.. With Covid 19 happening that has changed and unfortunately I don't know when I'll go back to that work. \n\nI used to photograph a TON of motorsports ranging from Dirt Track racing, NHRA, NASCAR, etc. I had a lot of success with my Canon 7D MK II and 70-200 2.8, however I sold my equipment back in 2017 and I honestly don't regret it. \n\nFor the past couple years, I honestly didn't pay much attention to the industry didn't keep up on new stuff, etc. However, I used my moms old camera last month and remember that I enjoyed it. I'm looking at getting back into it and watched a video of the R6 with the EF adapter and was pleasantly surprised at how well it worked and tracked.\n\nI know how well the 7D2 does and am already familiar with it, however the R6 looks real promising and I want some really good ISO performance at some of the darker tracks without spending the 1dX price. However I've never used an EVF and have heard mixed things about it but it seems like Canon nailed it with the R5 and R6. \n\nWhat do you guys recommended, anyone using the R6 for motorsports? How decent is the RAW buffer with a 300mb/s card? \n\nNot in a rush to buy at the moment but any chance we'll see some decent sales during black Friday/holidays?\n\nThanks all!", "link": "https://www.reddit.com/r/canon/comments/jfgypy/deciding_between_7d_mk_ii_or_r6/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "deciding between 7d mk ii or r6 /!/ hey all,\n\ni got out of photography in 2017 when i accepted a -----> position !!!  with a motorsports tour and really didn't have much time to photograph.. with covid 19 happening that has changed and unfortunately i don't know when i'll go back to that work. \n\ni used to photograph a ton of motorsports ranging from dirt track racing, nhra, nascar, etc. i had a lot of success with my canon 7d mk ii and 70-200 2.8, however i sold my equipment back in 2017 and i honestly don't regret it. \n\nfor the past couple years, i honestly didn't pay much attention to the industry didn't keep up on new stuff, etc. however, i used my moms old camera last month and remember that i enjoyed it. i'm looking at getting back into it and watched a video of the r6 with the ef adapter and was pleasantly surprised at how well it worked and tracked.\n\ni know how well the 7d2 does and am already familiar with it, however the r6 looks real promising and i want some really good iso performance at some of the darker tracks without spending the 1dx price. however i've never used an evf and have heard mixed things about it but it seems like canon nailed it with the r5 and r6. \n\nwhat do you guys recommended, anyone using the r6 for motorsports? how decent is the raw buffer with a 300mb/s card? \n\nnot in a rush to buy at the moment but any chance we'll see some decent sales during black friday/holidays?\n\nthanks all!", "sortedWord": "None", "identifyer": 49636, "year": "2020"}, {"Unnamed: 0": 303219, "autor": "whats_it_such", "date": 1606585104000, "content": "Shotgun mic for the M50? I have a Rode VideoMic GO that makes a buzzing noise and I hate it /!/ Hi all - title is self-explanatory. Looking for a better shotgun mic than what I currently have, which makes an awful buzzing noise in video. I've tried multiple cables with this mic and have found that I get a buzzing noise unless I rotate the cable in a very specific position, which is honestly too much of a hassle. \n\nAny recs are appreciated! Thanks.", "link": "https://www.reddit.com/r/canon/comments/k2rv87/shotgun_mic_for_the_m50_i_have_a_rode_videomic_go/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shotgun mic for the m50? i have a rode videomic go that makes a buzzing noise and i hate it /!/ hi all - title is self-explanatory. looking for a better shotgun mic than what i currently have, which makes an awful buzzing noise in video. i've tried multiple cables with this mic and have found that i get a buzzing noise unless i rotate the cable in a very specific -----> position !!! , which is honestly too much of a hassle. \n\nany recs are appreciated! thanks.", "sortedWord": "None", "identifyer": 50106, "year": "2020"}, {"Unnamed: 0": 303368, "autor": "lucaaslobo", "date": 1608198024000, "content": "Viewfinder vs live view /!/ (I have the Canon RP)\n\nOut of curiosity, which one do you use? I was watching a YouTube street photography vlog and the guy always shot using live view. Not sure if because he wanted for everyone to see what he was doing, but it didn't seem so bad. I usually use the viewfinder.\n\nSometimes I feel like the viewfinder is not a good option, for example when I want to shoot low or in an awkward position, live view is easier.\n\nIt has happened a lot that my live view will turn off when it shouldn't due to the proximity sensor being covered by accident. Is there a way to change the sensitivity of this?\n\nHow do you usually shoot?", "link": "https://www.reddit.com/r/canon/comments/keug9x/viewfinder_vs_live_view/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "viewfinder vs live view /!/ (i have the canon rp)\n\nout of curiosity, which one do you use? i was watching a youtube street photography vlog and the guy always shot using live view. not sure if because he wanted for everyone to see what he was doing, but it didn't seem so bad. i usually use the viewfinder.\n\nsometimes i feel like the viewfinder is not a good option, for example when i want to shoot low or in an awkward -----> position !!! , live view is easier.\n\nit has happened a lot that my live view will turn off when it shouldn't due to the proximity sensor being covered by accident. is there a way to change the sensitivity of this?\n\nhow do you usually shoot?", "sortedWord": "None", "identifyer": 50258, "year": "2020"}, {"Unnamed: 0": 303543, "autor": "r6arrow", "date": 1608553766000, "content": "Please advice with shooting videos on Canon 6D Mark 1 /!/ So i'm trying to record some video lessons by myself, using my Canon 6D Mark I as a camcorder, onba tripod.\n\nI am the only one in the room and nobody can manual focus on my face, so the problem is that I am unable to get the correct Focus. \n\n\n I am using di \"live focus on face\" function but after i start my video and go to my position, the camera is not able to focus on me neither on my face.\n\nAlso, i cannot use the application on smartphone because camera says that I have to disable wifi in order to shoot videos.\n\nAny advice?\n\nThank you", "link": "https://www.reddit.com/r/canon/comments/khghj5/please_advice_with_shooting_videos_on_canon_6d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "please advice with shooting videos on canon 6d mark 1 /!/ so i'm trying to record some video lessons by myself, using my canon 6d mark i as a camcorder, onba tripod.\n\ni am the only one in the room and nobody can manual focus on my face, so the problem is that i am unable to get the correct focus. \n\n\n i am using di \"live focus on face\" function but after i start my video and go to my -----> position !!! , the camera is not able to focus on me neither on my face.\n\nalso, i cannot use the application on smartphone because camera says that i have to disable wifi in order to shoot videos.\n\nany advice?\n\nthank you", "sortedWord": "None", "identifyer": 50436, "year": "2020"}, {"Unnamed: 0": 303768, "autor": "samziqua", "date": 1592380379000, "content": "My phone camera (top) is more zoomed out when taken from the same position as canon and vibrant than the canon (bottom). Why is this and how can I make the canon better? (I’m a beginner by the way, don’t know much about cameras). The lens is 18-35mm but won’t go down to 18, lowest it can go is 35", "link": "https://www.reddit.com/r/canon/comments/hamtvp/my_phone_camera_top_is_more_zoomed_out_when_taken/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my phone camera (top) is more zoomed out when taken from the same -----> position !!!  as canon and vibrant than the canon (bottom). why is this and how can i make the canon better? (i’m a beginner by the way, don’t know much about cameras). the lens is 18-35mm but won’t go down to 18, lowest it can go is 35", "sortedWord": "None", "identifyer": 50669, "year": "2020"}, {"Unnamed: 0": 303972, "autor": "nicwillu", "date": 1595000446000, "content": "My Canon gear was stolen. I now want to invest in GPS tracker for my bags. /!/ Last summer I unfortunately got my gear stolen. As the title suggests, I'm now looking for GPS trackers that can be hidden in bags, once I now buy the new R6 (stoked!) . The ones I've been looking at are quite expensive with features I don't really need, or are subscription based. I was wondering if anybody would have any suggestions? I just need something simple that can give me position via app or web interface. \nIt needs to have GPS, not just bluetooth. That's pretty much my only requirement. I'm looking at max 100 usd. Any hidden gems I haven't found? I found a gps tracker disguised as a cable. Pretty neat. But it was only using cell towers and not actual gps data, so the accuracy was very bad. Thanks!", "link": "https://www.reddit.com/r/canon/comments/hsxw9s/my_canon_gear_was_stolen_i_now_want_to_invest_in/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my canon gear was stolen. i now want to invest in gps tracker for my bags. /!/ last summer i unfortunately got my gear stolen. as the title suggests, i'm now looking for gps trackers that can be hidden in bags, once i now buy the new r6 (stoked!) . the ones i've been looking at are quite expensive with features i don't really need, or are subscription based. i was wondering if anybody would have any suggestions? i just need something simple that can give me -----> position !!!  via app or web interface. \nit needs to have gps, not just bluetooth. that's pretty much my only requirement. i'm looking at max 100 usd. any hidden gems i haven't found? i found a gps tracker disguised as a cable. pretty neat. but it was only using cell towers and not actual gps data, so the accuracy was very bad. thanks!", "sortedWord": "None", "identifyer": 50878, "year": "2020"}, {"Unnamed: 0": 304730, "autor": "rainb0wspirit", "date": 1607833951000, "content": "RP vs 6D MK II. Help /!/ Hello guys, i want to buy a new camera to replace my old Rebel T5 (1200D) and i want to do the jump to a Full Frame body.\nI have been deciding between the RP and 6D MK II, since the R is out of my budget.\nI do landscape photography and sometimes social events, such as weddings.\nThe RP kit with the RF24-105mm F4-7.1 L IS STM is cheaper than the 6D MK II 17-40mm f4 L USM.\nThe 6D weather sealing and better battery are great. But  the RP is mirrorless, it weight and cost less, plus it can use the new RF lenses. \nWhat is your advice? Which one do you buy in you were in my position?\nThanks in advance", "link": "https://www.reddit.com/r/canon/comments/kc49ae/rp_vs_6d_mk_ii_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "rp vs 6d mk ii. help /!/ hello guys, i want to buy a new camera to replace my old rebel t5 (1200d) and i want to do the jump to a full frame body.\ni have been deciding between the rp and 6d mk ii, since the r is out of my budget.\ni do landscape photography and sometimes social events, such as weddings.\nthe rp kit with the rf24-105mm f4-7.1 l is stm is cheaper than the 6d mk ii 17-40mm f4 l usm.\nthe 6d weather sealing and better battery are great. but  the rp is mirrorless, it weight and cost less, plus it can use the new rf lenses. \nwhat is your advice? which one do you buy in you were in my -----> position !!! ?\nthanks in advance", "sortedWord": "None", "identifyer": 51649, "year": "2020"}, {"Unnamed: 0": 304824, "autor": "TouchOfStyle", "date": 1608341858000, "content": "Canon EOS m200 overheating issue and Using non brand dummy batteries /!/   Got my camera recently to use as a webcam for streaming \n\nI wanted to avoid having to buy a capture card for a while due to them being overpriced due to covid \n\nIt did connect as a webcam, but I’m wondering if this makes it do extra processing internally causing a heating issue \n\nI looked online for some possible solutions \n\nI since moved flat screen position up and opened the flash  to help with heating dispation, recharging my battyer before I can test that \n\nI don’t do a lot of movement on camera so I could reduces the frames per sec down to 40 or 30 \n\nIf that would help with heat\n\nDoes updating the firmware on the camera help at all with the overheating issue ?\n\nSecondly I’ll need to use a dummy battery \n\nonly to come across a post saying that Canon discontinued their dummy battery kit for the M200.\n\nLooking around its going to hard to get an official  power unit and battery  before mid January as a lot of the tech stores have closed (I’m in Australia)   an the price would be $140 for the power unit and the battery\n\nChecking on ebay I could get one of the non brand names ones for around $25 and get it ordered now instead waiting. The camera is second hand so I’m not under the canon warrenty but I wanted to check about it causing any issue with the camera including overheating", "link": "https://www.reddit.com/r/canon/comments/kfykdd/canon_eos_m200_overheating_issue_and_using_non/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon eos m200 overheating issue and using non brand dummy batteries /!/   got my camera recently to use as a webcam for streaming \n\ni wanted to avoid having to buy a capture card for a while due to them being overpriced due to covid \n\nit did connect as a webcam, but i’m wondering if this makes it do extra processing internally causing a heating issue \n\ni looked online for some possible solutions \n\ni since moved flat screen -----> position !!!  up and opened the flash  to help with heating dispation, recharging my battyer before i can test that \n\ni don’t do a lot of movement on camera so i could reduces the frames per sec down to 40 or 30 \n\nif that would help with heat\n\ndoes updating the firmware on the camera help at all with the overheating issue ?\n\nsecondly i’ll need to use a dummy battery \n\nonly to come across a post saying that canon discontinued their dummy battery kit for the m200.\n\nlooking around its going to hard to get an official  power unit and battery  before mid january as a lot of the tech stores have closed (i’m in australia)   an the price would be $140 for the power unit and the battery\n\nchecking on ebay i could get one of the non brand names ones for around $25 and get it ordered now instead waiting. the camera is second hand so i’m not under the canon warrenty but i wanted to check about it causing any issue with the camera including overheating", "sortedWord": "None", "identifyer": 51746, "year": "2020"}, {"Unnamed: 0": 304834, "autor": "ottguy42", "date": 1608318426000, "content": "Versatile lenses for video on a full frame body? /!/ Hi, am looking for options for a more versatile lens for shooting video with an R6 from rinkside (figure skating) - my current stable of lenses is missing a good zoom that can go from reasonably wide (say 28-40mm) to longer (150mm+ range).\n\nMy current zooms are either not wide enough (EF 70-200mm f/2.8 L) or pretty dark at the longer end (RF 24-105mm STM f/4-7.1). I have an EF 55-200mm which wouldn't be too bad from a focal length perspective but it's godawful noisy and useless for video.\n\nI see the Tamron 35-150mm f/2.8-4 lens which looks like it would be wide enough for when skaters are close to my position and long enough to reach (barely) when they're at the opposite end of the rink. The only lens from Canon that I can find to complete would be the 28-300mm L ($$$). Any other options I should be looking at?", "link": "https://www.reddit.com/r/canon/comments/kfrfm9/versatile_lenses_for_video_on_a_full_frame_body/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "versatile lenses for video on a full frame body? /!/ hi, am looking for options for a more versatile lens for shooting video with an r6 from rinkside (figure skating) - my current stable of lenses is missing a good zoom that can go from reasonably wide (say 28-40mm) to longer (150mm+ range).\n\nmy current zooms are either not wide enough (ef 70-200mm f/2.8 l) or pretty dark at the longer end (rf 24-105mm stm f/4-7.1). i have an ef 55-200mm which wouldn't be too bad from a focal length perspective but it's godawful noisy and useless for video.\n\ni see the tamron 35-150mm f/2.8-4 lens which looks like it would be wide enough for when skaters are close to my -----> position !!!  and long enough to reach (barely) when they're at the opposite end of the rink. the only lens from canon that i can find to complete would be the 28-300mm l ($$$). any other options i should be looking at?", "sortedWord": "None", "identifyer": 51756, "year": "2020"}], "name": "positioncanon2020"}