{"interestingcomments": [{"Unnamed: 0": 298186, "autor": "sherbertbert", "date": 1587185031000, "content": "Dropped my dslr today and the side of my lens split open 🙁 It still shoots fine. Is it worth trying to fix this and where’s the best spot to fix it?", "link": "https://www.reddit.com/r/canon/comments/g3hqd0/dropped_my_dslr_today_and_the_side_of_my_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dropped my dslr today and the side of my lens split open 🙁 it still shoots fine. is it worth trying to fix this and where’s the best -----> spot !!!  to fix it?", "sortedWord": "None", "identifyer": 44903, "year": "2020"}, {"Unnamed: 0": 298567, "autor": "t_albert", "date": 1599797895000, "content": "What Happened to All the Canon M50s? /!/ I’m ready to pull the trigger, but there isn’t an M50 in stock seemingly anywhere on the internet. What gives?\n\nDo you guys have any secret spots to snag an M50?", "link": "https://www.reddit.com/r/canon/comments/iqjn2y/what_happened_to_all_the_canon_m50s/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what happened to all the canon m50s? /!/ i’m ready to pull the trigger, but there isn’t an m50 in stock seemingly anywhere on the internet. what gives?\n\ndo you guys have any secret -----> spots !!!  to snag an m50?", "sortedWord": "None", "identifyer": 45302, "year": "2020"}, {"Unnamed: 0": 298585, "autor": "JohnDeere6930Premium", "date": 1599724131000, "content": "How do i sanitize lenses without damaging them? /!/ So i need to sanitize lenses before i return them, but i dont know how to do this? Are there some spots i need to avoid / clean?", "link": "https://www.reddit.com/r/canon/comments/ipyzgm/how_do_i_sanitize_lenses_without_damaging_them/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do i sanitize lenses without damaging them? /!/ so i need to sanitize lenses before i return them, but i dont know how to do this? are there some -----> spots !!!  i need to avoid / clean?", "sortedWord": "None", "identifyer": 45320, "year": "2020"}, {"Unnamed: 0": 298624, "autor": "Albertadude8392", "date": 1599590732000, "content": "Canon R vs RP sensor? /!/ Planning to get one of these, ultimately only for photos. I don't do fast moving objects or spots. Mainly landscapes, street photography, product photography and portraits.  \n\n\nMy question is; is there a real difference between the R and the RP when it comes to the photo quality (when rocking the same lens) besides the MPixels. I heard that the R has the 5D MK4 Sensor and the RP has the 6D Mark2 sensor. in the real world; does it make a difference? considering the price I would love to get everyone's thoughts.   \n\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/iozge8/canon_r_vs_rp_sensor/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon r vs rp sensor? /!/ planning to get one of these, ultimately only for photos. i don't do fast moving objects or -----> spots !!! . mainly landscapes, street photography, product photography and portraits.  \n\n\nmy question is; is there a real difference between the r and the rp when it comes to the photo quality (when rocking the same lens) besides the mpixels. i heard that the r has the 5d mk4 sensor and the rp has the 6d mark2 sensor. in the real world; does it make a difference? considering the price i would love to get everyone's thoughts.   \n\n\nthanks", "sortedWord": "None", "identifyer": 45359, "year": "2020"}, {"Unnamed: 0": 298637, "autor": "metalhead-scientist", "date": 1599529103000, "content": "[Question/Seeking Advice] Black spots in photos, please help! /!/ Hey everyone! Relatively new photographer here looking for some advice about what I understand to be a hardware issue. I keep seeing these black spots/blemishes/dust(?) in the upper corners of every single photo taken on my Rebel T6, but I'm not sure if the issue is on the sensor, in the lens, or somewhere else? Please advise if you have experienced this or if you know what to do. Additionally, if you know the fix that would be great! Thanks!", "link": "https://www.reddit.com/r/canon/comments/iokmyh/questionseeking_advice_black_spots_in_photos/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[question/seeking advice] black -----> spots !!!  in photos, please help! /!/ hey everyone! relatively new photographer here looking for some advice about what i understand to be a hardware issue. i keep seeing these black spots/blemishes/dust(?) in the upper corners of every single photo taken on my rebel t6, but i'm not sure if the issue is on the sensor, in the lens, or somewhere else? please advise if you have experienced this or if you know what to do. additionally, if you know the fix that would be great! thanks!", "sortedWord": "None", "identifyer": 45372, "year": "2020"}, {"Unnamed: 0": 298672, "autor": "grd601", "date": 1602905696000, "content": "My R6 set-up. Using Custom profiles to make your (my) life easier. /!/ Setting up my R6 - Think I've finally found my sweet spot. Just wanted to share what I feel is MY final set-up for my R6 (It's not ideal for everyone I know, so if it's not for you - that's cool). I think quite a few people are changing from older Canon models (5D3,4 etc) and are at first struggling with the camera settings on the R6. I know I was, so I thought sharing what helped me might help someone else. I knew the camera could be great...at times. But sometimes I couldn't stop it from doing things I didn't want it to do, especially when it came to focusing. \"Don't pick that!\" I found myself saying more than once...lol. So, first off, I thought to myself, what do I photograph most of the time. And I broke that down into three categories - 1. Static/posed mages (sometimes with people, sometimes without). 2. \"Capturing a moment\" images - usually involving kids running around, couples kissing, walking, etc. And 3. Moving animals. (Since getting the R6 and the 600MM, I've somehow become a wannabe National Geographic Photographer..lol). So, with those 3 basic image types in mind, this is how I approached my set up (And for the record, as mainly a natural light photographer most of the time I shoot in AV mode - let's not argue the pros/cons here). I created 3 custom profiles using the c1,c2, and c3 on the dial. And now easily switch back and forth between each of the profiles, without ever (or rarely) having to go into the menu system to change anything - This is my first time using the custom settings and so far it's worked great for me. As a side note - make sure you enable the joystick button to move focus points - personally I find it quicker than sliding a finger on the screen and by pressing the joystick in returns focus to centre point) And I use Elec. 1st curtain mainly. And I have my ISO set to the thumb dial.\n\n1. Static/posed Images - To set up my profile, put camera in AV. I put on the fastest lens I have and put the aperture at the lowest value. Personally I think 99% of shots I take are at the lowest value - I'm not buying a 1.2 lens to shoot at f4. lol. This ensures no matter what lens I have attached, the profile will always go the lowest aperture value of that lens. I put the ISO at 100. I changed the AF Operation to ONE SHOT AF and the AF Method to Center Point focus - move the focus via the joystick when required. I moved exposure compensation slightly to the left. Low Speed continuous shooting - with High Speed+ continuous, I found myself taking close to 3 photos each time!  And programmed the AF-ON button to change the AF Operation to Eye Tracking when pressed - This allowed me to be able to eye focus on static portraits when it was required (be sure to have \"people\" as eye type) Keep your finger on the button when pressing the shutter. And it could be said that I could leave the camera in SERVO - put just personally for me, it's comforting for me to hear the \"focus beep\" lol. Hence ONE SHOT AF. - Register these as C1. \n\n2. Moving Images. Same as above for most. But AF Operation changed Eye+Face Tracking (be sure to have \"people\" as eye type), AF Operation Changed to SERVO. High Speed+ Continous shooting. Register to C2.\n\n3. Animals. Same as 2, but eye priority as \"Animal\". Register as C3.\n\n  \nAnd that's it! For me, it's worked great this past week. As mentioned, it's not a one size fits all for sure. Just know the camera is so capable of customization and it's best to use the custom buttons for your most common uses, as opposed to changing them in the menu. It's made it much easier for me.", "link": "https://www.reddit.com/r/canon/comments/jco5tb/my_r6_setup_using_custom_profiles_to_make_your_my/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my r6 set-up. using custom profiles to make your (my) life easier. /!/ setting up my r6 - think i've finally found my sweet -----> spot !!! . just wanted to share what i feel is my final set-up for my r6 (it's not ideal for everyone i know, so if it's not for you - that's cool). i think quite a few people are changing from older canon models (5d3,4 etc) and are at first struggling with the camera settings on the r6. i know i was, so i thought sharing what helped me might help someone else. i knew the camera could be great...at times. but sometimes i couldn't stop it from doing things i didn't want it to do, especially when it came to focusing. \"don't pick that!\" i found myself saying more than once...lol. so, first off, i thought to myself, what do i photograph most of the time. and i broke that down into three categories - 1. static/posed mages (sometimes with people, sometimes without). 2. \"capturing a moment\" images - usually involving kids running around, couples kissing, walking, etc. and 3. moving animals. (since getting the r6 and the 600mm, i've somehow become a wannabe national geographic photographer..lol). so, with those 3 basic image types in mind, this is how i approached my set up (and for the record, as mainly a natural light photographer most of the time i shoot in av mode - let's not argue the pros/cons here). i created 3 custom profiles using the c1,c2, and c3 on the dial. and now easily switch back and forth between each of the profiles, without ever (or rarely) having to go into the menu system to change anything - this is my first time using the custom settings and so far it's worked great for me. as a side note - make sure you enable the joystick button to move focus points - personally i find it quicker than sliding a finger on the screen and by pressing the joystick in returns focus to centre point) and i use elec. 1st curtain mainly. and i have my iso set to the thumb dial.\n\n1. static/posed images - to set up my profile, put camera in av. i put on the fastest lens i have and put the aperture at the lowest value. personally i think 99% of shots i take are at the lowest value - i'm not buying a 1.2 lens to shoot at f4. lol. this ensures no matter what lens i have attached, the profile will always go the lowest aperture value of that lens. i put the iso at 100. i changed the af operation to one shot af and the af method to center point focus - move the focus via the joystick when required. i moved exposure compensation slightly to the left. low speed continuous shooting - with high speed+ continuous, i found myself taking close to 3 photos each time!  and programmed the af-on button to change the af operation to eye tracking when pressed - this allowed me to be able to eye focus on static portraits when it was required (be sure to have \"people\" as eye type) keep your finger on the button when pressing the shutter. and it could be said that i could leave the camera in servo - put just personally for me, it's comforting for me to hear the \"focus beep\" lol. hence one shot af. - register these as c1. \n\n2. moving images. same as above for most. but af operation changed eye+face tracking (be sure to have \"people\" as eye type), af operation changed to servo. high speed+ continous shooting. register to c2.\n\n3. animals. same as 2, but eye priority as \"animal\". register as c3.\n\n  \nand that's it! for me, it's worked great this past week. as mentioned, it's not a one size fits all for sure. just know the camera is so capable of customization and it's best to use the custom buttons for your most common uses, as opposed to changing them in the menu. it's made it much easier for me.", "sortedWord": "None", "identifyer": 45408, "year": "2020"}, {"Unnamed: 0": 298898, "autor": "Irlut", "date": 1609194675000, "content": "EOS R focusing issue /!/ I'm having some focusing issues on my EOS R. I mostly shoot with adapted EF manual focus primes from Zeiss. Unfortunately it seems like the focusing is somehow off, and I can focus beyond infinity when the lenses have hard stop at infinity. Focusing used to be spot on a few weeks ago, and I haven't really banged the camera or lenses on anything, and I haven't updated any software that may cause issues. \n\nThis isn't necessarily catastrophic, but it's getting a bit annoying. I can make the problem soft of go away by pushing on the lens so the adapter shifts, but that's not really going to work on the long run (and it could cause damage). \n\nI can't seem to figure out if this is a problem with the adapter or with the body. Unfortunately the only native RF lens I have on hand is a 24-105/4L, and since it's focus by wire I'm not sure how I can use that to test if the body is alright. \n\nAnyone have any tips on how I can try to fix or debug this?", "link": "https://www.reddit.com/r/canon/comments/km0o26/eos_r_focusing_issue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "eos r focusing issue /!/ i'm having some focusing issues on my eos r. i mostly shoot with adapted ef manual focus primes from zeiss. unfortunately it seems like the focusing is somehow off, and i can focus beyond infinity when the lenses have hard stop at infinity. focusing used to be -----> spot !!!  on a few weeks ago, and i haven't really banged the camera or lenses on anything, and i haven't updated any software that may cause issues. \n\nthis isn't necessarily catastrophic, but it's getting a bit annoying. i can make the problem soft of go away by pushing on the lens so the adapter shifts, but that's not really going to work on the long run (and it could cause damage). \n\ni can't seem to figure out if this is a problem with the adapter or with the body. unfortunately the only native rf lens i have on hand is a 24-105/4l, and since it's focus by wire i'm not sure how i can use that to test if the body is alright. \n\nanyone have any tips on how i can try to fix or debug this?", "sortedWord": "None", "identifyer": 45642, "year": "2020"}, {"Unnamed: 0": 299366, "autor": "Engelszunge", "date": 1585038143000, "content": "Which 50mm Canon Sigma Tamron /!/ I'm looking forward to buy a 50mm. Those 3 are in the race. Canon 50mm 1.4 USM Tamron 45mm 1.8 DI VC and the Sigma 50mm Art. I do have a 50mm STM which I like but I want a little upgrade that could be carried over to a Canon RF Mount system in the future.\n\nAny opinions on these lenses? Pricing here is as follows.\n\nCanon 300 Euro\nTamron 400 Euro\nSigma 650 Euro\n\nI would lean toward the 45mm Tamron right now it seems to hit the sweet spot of IQ / Price and on top Stabilisation. \n\nExperience and opinions are welcome\n\nThx guys. Take care in these dark days.", "link": "https://www.reddit.com/r/canon/comments/fo1ir1/which_50mm_canon_sigma_tamron/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "which 50mm canon sigma tamron /!/ i'm looking forward to buy a 50mm. those 3 are in the race. canon 50mm 1.4 usm tamron 45mm 1.8 di vc and the sigma 50mm art. i do have a 50mm stm which i like but i want a little upgrade that could be carried over to a canon rf mount system in the future.\n\nany opinions on these lenses? pricing here is as follows.\n\ncanon 300 euro\ntamron 400 euro\nsigma 650 euro\n\ni would lean toward the 45mm tamron right now it seems to hit the sweet -----> spot !!!  of iq / price and on top stabilisation. \n\nexperience and opinions are welcome\n\nthx guys. take care in these dark days.", "sortedWord": "None", "identifyer": 46134, "year": "2020"}, {"Unnamed: 0": 299441, "autor": "ryangourley", "date": 1586477139000, "content": "Canon Ivy Rec /!/ I am simply curious and open for discussion as to what you guys think of the Canon Ivy Rec, at least those of you that have tried one. \n\nMy take:\n\nI'll give some context as to what I use Canon cameras for. I a young, aspiring filmmaker who also enjoys capturing and editing photos. My first real camera was a SL2, which was later demoted to my secondary camera when I upgrade to the M50. I don't think that gear is everything, but it definitely helps. For Christmas 2019 I asked for the Ivy Rec for a few reasons: it was cheap, looked fun, why not?\n\nSo, what do I think of it so far? I'll be honest, I used it pretty sparingly when I first got it. I had also received some accessories for my M50 so I was spending a lot of time playing around with those. In the last few months I have kept the Ivy Rec in my pocket almost everywhere I have gone, just in case. Even though I have a Samsung S10, which takes great photos, it was nice to have a camera that I wasn't terrified of dropping (I've broken a few phones), and one that I wasn't always looking at the photo after the fact. It's the definition of point and shoot. I heard some had troubles with the app, and initially I did too. Thankfully, Canon released a few software/firmware updates and things seem to work a lot better now. I found it worked smoothly when I manually connected my WiFi to the camera (Samsung multitasking came in handy).\n\nI know you all want to know about one thing: performance. In well lit areas, the photos come out very nicely. Not nice enough to truly impress anyone, but far from bad. I took similar pictures of my dog with both the Ivy Rec and my S10. While the S10 looked sharper, the vibrance of its photos were a bit much, at least for an unedited photo. That's where I think the Ivy Rec stayed true to the Canon name, the colours. They weren't mind-boggingly amazing. Nothing on this camera is. But the colours of the sky were much truer to life. It isn't all peachy though. As with pretty much all cameras, especially at this price range, low light situations usually result in lower quality photos and videos. This is true for the Ivy Rec. It is very true. Without a flash, the Ivy Rec takes photos that are near unusable in poor lighting conditions. While this is definitely a downfall, this camera begs to be taken out on walks or hikes. I have found myself taking it with me even when I'm going to shoot on a much higher quality camera. There's a novelty in looking through a square carabiner clip to frame your shot (I recommend using the app to change the aspect ratio to 1:1, it makes the square cutout make a lot more sense). It brings a childlike joy to go out and snap a bunch of pictures, not knowing how they turned out until later.\n\nThe video is actually pretty rewarding, provided good lighting. Out the box it films in 720p, in 2020 that's just not gonna cut it. In the Canon MiniCam app you can change the quality to 1080p at either 30 or 60 frames. Respectable. I would absolutely love a firmware update to allow for 24 frames as I shoot almost strictly in 24, even if I would be shocked if I used Ivy Rec footage in something serious. The video quality, and audio quality for that matter, truly surprised me with how decent it looked. This may have been because I wasn't expecting anything at all, but regardless, it would be the kind of camera you can take with you on an amusement park ride. Vlogging isn't ideal due to the lack of a viewfinder, but with some practice I'm sure you can figure out the best angle for vlogging if you really wanted to.\n\n&amp;#x200B;\n\n(My) Verdict:\n\nThe Ivy Rec has grown on me over time and has earned its spot in my pocket next to my wallet, ready to go at a moments notice. As long as the lighting is fair, it will perform well enough for what it is, so long as you don't expect DSLR or DSLM quality. If you want a fun, little camera that makes you rethink the process of taking a photo, look into the Ivy Rec.\n\nThanks for reading this review thing, I think I was fair to this camera considering all it has going for it (size, price, purpose). If you want to check out my stuff you can follow my YouTube channel: Ryan Gourley. I don't post anything serious there, just small little sketches. Thanks!", "link": "https://www.reddit.com/r/canon/comments/fy3qo1/canon_ivy_rec/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon ivy rec /!/ i am simply curious and open for discussion as to what you guys think of the canon ivy rec, at least those of you that have tried one. \n\nmy take:\n\ni'll give some context as to what i use canon cameras for. i a young, aspiring filmmaker who also enjoys capturing and editing photos. my first real camera was a sl2, which was later demoted to my secondary camera when i upgrade to the m50. i don't think that gear is everything, but it definitely helps. for christmas 2019 i asked for the ivy rec for a few reasons: it was cheap, looked fun, why not?\n\nso, what do i think of it so far? i'll be honest, i used it pretty sparingly when i first got it. i had also received some accessories for my m50 so i was spending a lot of time playing around with those. in the last few months i have kept the ivy rec in my pocket almost everywhere i have gone, just in case. even though i have a samsung s10, which takes great photos, it was nice to have a camera that i wasn't terrified of dropping (i've broken a few phones), and one that i wasn't always looking at the photo after the fact. it's the definition of point and shoot. i heard some had troubles with the app, and initially i did too. thankfully, canon released a few software/firmware updates and things seem to work a lot better now. i found it worked smoothly when i manually connected my wifi to the camera (samsung multitasking came in handy).\n\ni know you all want to know about one thing: performance. in well lit areas, the photos come out very nicely. not nice enough to truly impress anyone, but far from bad. i took similar pictures of my dog with both the ivy rec and my s10. while the s10 looked sharper, the vibrance of its photos were a bit much, at least for an unedited photo. that's where i think the ivy rec stayed true to the canon name, the colours. they weren't mind-boggingly amazing. nothing on this camera is. but the colours of the sky were much truer to life. it isn't all peachy though. as with pretty much all cameras, especially at this price range, low light situations usually result in lower quality photos and videos. this is true for the ivy rec. it is very true. without a flash, the ivy rec takes photos that are near unusable in poor lighting conditions. while this is definitely a downfall, this camera begs to be taken out on walks or hikes. i have found myself taking it with me even when i'm going to shoot on a much higher quality camera. there's a novelty in looking through a square carabiner clip to frame your shot (i recommend using the app to change the aspect ratio to 1:1, it makes the square cutout make a lot more sense). it brings a childlike joy to go out and snap a bunch of pictures, not knowing how they turned out until later.\n\nthe video is actually pretty rewarding, provided good lighting. out the box it films in 720p, in 2020 that's just not gonna cut it. in the canon minicam app you can change the quality to 1080p at either 30 or 60 frames. respectable. i would absolutely love a firmware update to allow for 24 frames as i shoot almost strictly in 24, even if i would be shocked if i used ivy rec footage in something serious. the video quality, and audio quality for that matter, truly surprised me with how decent it looked. this may have been because i wasn't expecting anything at all, but regardless, it would be the kind of camera you can take with you on an amusement park ride. vlogging isn't ideal due to the lack of a viewfinder, but with some practice i'm sure you can figure out the best angle for vlogging if you really wanted to.\n\n&amp;#x200b;\n\n(my) verdict:\n\nthe ivy rec has grown on me over time and has earned its -----> spot !!!  in my pocket next to my wallet, ready to go at a moments notice. as long as the lighting is fair, it will perform well enough for what it is, so long as you don't expect dslr or dslm quality. if you want a fun, little camera that makes you rethink the process of taking a photo, look into the ivy rec.\n\nthanks for reading this review thing, i think i was fair to this camera considering all it has going for it (size, price, purpose). if you want to check out my stuff you can follow my youtube channel: ryan gourley. i don't post anything serious there, just small little sketches. thanks!", "sortedWord": "None", "identifyer": 46210, "year": "2020"}, {"Unnamed: 0": 299720, "autor": "Jidoe", "date": 1591736319000, "content": "Canon 400mm 2.8 I IS ... is this a good deal? $3500 (Canadian dollars) /!/ I've been looking for a 300mm 2.8, but recently spotted this 400mm for roughly the same price I was going to spend on the 300mm. It's listed as being in excellent condition, and is selling for $3500 CAD ($2600 USD). Thoughts?  \n\nhttps://preview.redd.it/oqqu4dof7y351.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=101f1f3bfbc75588e4207bccd2395ad78953622d", "link": "https://www.reddit.com/r/canon/comments/gzw1rf/canon_400mm_28_i_is_is_this_a_good_deal_3500/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "canon 400mm 2.8 i is ... is this a good deal? $3500 (canadian dollars) /!/ i've been looking for a 300mm 2.8, but recently -----> spotted !!!  this 400mm for roughly the same price i was going to spend on the 300mm. it's listed as being in excellent condition, and is selling for $3500 cad ($2600 usd). thoughts?  \n\nhttps://preview.redd.it/oqqu4dof7y351.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=101f1f3bfbc75588e4207bccd2395ad78953622d", "sortedWord": "None", "identifyer": 46504, "year": "2020"}, {"Unnamed: 0": 299779, "autor": "54mn", "date": 1591458533000, "content": "How to meter a portrait when using flash /!/ Usually I use spot metering and pictures turn out as expected. But when I use flash(off camera) the meter in the camera is unreliable even when using ETTL. I use Yongnuo YN622 and Canon 430EXii. The image is blown out with the flash when I use the metering in camera. So I have to take a picture even when the meter says underexposed and i get pictures with lots of highlights. It requires a lot of trial and error to take a good shot. Is there any smarter way to work this without buying an expensive light meter?", "link": "https://www.reddit.com/r/canon/comments/gxtc67/how_to_meter_a_portrait_when_using_flash/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to meter a portrait when using flash /!/ usually i use -----> spot !!!  metering and pictures turn out as expected. but when i use flash(off camera) the meter in the camera is unreliable even when using ettl. i use yongnuo yn622 and canon 430exii. the image is blown out with the flash when i use the metering in camera. so i have to take a picture even when the meter says underexposed and i get pictures with lots of highlights. it requires a lot of trial and error to take a good shot. is there any smarter way to work this without buying an expensive light meter?", "sortedWord": "None", "identifyer": 46564, "year": "2020"}, {"Unnamed: 0": 299797, "autor": "dougthecamera", "date": 1591336673000, "content": "Questions about the generation 1 L lens the 24-70mm f2.8 adapted to EOS RP, having to deal with lens flares and what appears to be haze. /!/ Using this lens adapted to my EOS RP has been a good experience, but what I've been noticing is when light hit's the lens it will create a pretty big blue spot. and as light goes, I'm talking about lamps in my house or headlights. Is that technically lens flares? or is that haze? is my lens broken? What do I have to do to fix this issue because it's pretty annoying.", "link": "https://www.reddit.com/r/canon/comments/gwyvva/questions_about_the_generation_1_l_lens_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "questions about the generation 1 l lens the 24-70mm f2.8 adapted to eos rp, having to deal with lens flares and what appears to be haze. /!/ using this lens adapted to my eos rp has been a good experience, but what i've been noticing is when light hit's the lens it will create a pretty big blue -----> spot !!! . and as light goes, i'm talking about lamps in my house or headlights. is that technically lens flares? or is that haze? is my lens broken? what do i have to do to fix this issue because it's pretty annoying.", "sortedWord": "None", "identifyer": 46583, "year": "2020"}, {"Unnamed: 0": 299880, "autor": "Rens_Berg", "date": 1592952148000, "content": "[experiment] Exposure Simulation is by default enabled on RP, but can have dramatic effect on AF performance. /!/ Recently I noticed my eos-RP sometimes hunting for focus when shooting for darker subjects whereas my much older 7D (through the viewfinder) focuses just fine. Both using the same 70-200 f/2.8L lens and settings. \n\n**My brief experiment:**  \nIn a brief test at home with a static subject, I traced the problem on the RP back to the exposure simulation setting. When it was turned on (= default setting) it sometimes had trouble focusing, whilst turning it off caused the AF to perform stellar. I performed my test with both cameras set to full manual exposure with the center spot-AF selected and one-shot mode enabled. A dark-gray coffee-machine with plenty of texture and contrast was my subject in a very well lit room.\n\n1. EOS 7D with settings: \\[M f/2.8 1/800 ISO 100\\] -&gt; Focused in an instant. \n2. **EOS RP** with settings: \\[M f/2.8 1/800 ISO 100 expo. sim. ON\\] -&gt; Kept hunting, could not focus \n3. EOS RP with settings: \\[M f/2.8 1/800 **ISO 250** expo. sim. ON\\] -&gt; Focused in an instant \n4. EOS RP with settings: \\[M f/2.8 1/800 ISO 100 **expo. sim. OFF**\\] -&gt; Focused in an instant \n\n**Hypotheses:**  \nIt's weird how just increasing the ISO with 1-1.5 stops causes the camera to focus just fine. Because changing the ISO does not cause any more light to enter the camera, it only amplifies the existing signal. Therefore it should have no impact on the performance of phase-detection auto-focus, yet it could influence the contrast-detection auto-focus. Therefore my hypothesis is, that by enabling expo. simul. contrast-AF can mess up and sees no contrast in the darker subject when the ISO is kept low. Slightly increasing the ISO will help the contrast-AF algorithm to 'see' contrast in the darker subject again. On the other hand, by disabling exposure simulation, the camera focuses mainly with PDAF (just like the 7D), and focuses just fine.\n\n**Poor implementation?**  \nThough my hypothesis could explain my findings, I still find it a rather poor implementation of exposure simulation, since the PDAF could have easily taken over and locked focus, when the contrast-AF had trouble doing so. Though it does not happen too frequently, I had major issues the other day, locking focus on a black cat on a sunny day, whereas my 7D did just fine. Increasing the ISO allowed me to focus onto the cat, but caused the background to be completely blown out. I guess for most people, at least those that that do not shoot in full manual, this problem is not a major issue. Because the expo. sim. will always adjust the exposure automatically as to assist the contrast-AF.", "link": "https://www.reddit.com/r/canon/comments/heou7e/experiment_exposure_simulation_is_by_default/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[experiment] exposure simulation is by default enabled on rp, but can have dramatic effect on af performance. /!/ recently i noticed my eos-rp sometimes hunting for focus when shooting for darker subjects whereas my much older 7d (through the viewfinder) focuses just fine. both using the same 70-200 f/2.8l lens and settings. \n\n**my brief experiment:**  \nin a brief test at home with a static subject, i traced the problem on the rp back to the exposure simulation setting. when it was turned on (= default setting) it sometimes had trouble focusing, whilst turning it off caused the af to perform stellar. i performed my test with both cameras set to full manual exposure with the center -----> spot !!! -af selected and one-shot mode enabled. a dark-gray coffee-machine with plenty of texture and contrast was my subject in a very well lit room.\n\n1. eos 7d with settings: \\[m f/2.8 1/800 iso 100\\] -&gt; focused in an instant. \n2. **eos rp** with settings: \\[m f/2.8 1/800 iso 100 expo. sim. on\\] -&gt; kept hunting, could not focus \n3. eos rp with settings: \\[m f/2.8 1/800 **iso 250** expo. sim. on\\] -&gt; focused in an instant \n4. eos rp with settings: \\[m f/2.8 1/800 iso 100 **expo. sim. off**\\] -&gt; focused in an instant \n\n**hypotheses:**  \nit's weird how just increasing the iso with 1-1.5 stops causes the camera to focus just fine. because changing the iso does not cause any more light to enter the camera, it only amplifies the existing signal. therefore it should have no impact on the performance of phase-detection auto-focus, yet it could influence the contrast-detection auto-focus. therefore my hypothesis is, that by enabling expo. simul. contrast-af can mess up and sees no contrast in the darker subject when the iso is kept low. slightly increasing the iso will help the contrast-af algorithm to 'see' contrast in the darker subject again. on the other hand, by disabling exposure simulation, the camera focuses mainly with pdaf (just like the 7d), and focuses just fine.\n\n**poor implementation?**  \nthough my hypothesis could explain my findings, i still find it a rather poor implementation of exposure simulation, since the pdaf could have easily taken over and locked focus, when the contrast-af had trouble doing so. though it does not happen too frequently, i had major issues the other day, locking focus on a black cat on a sunny day, whereas my 7d did just fine. increasing the iso allowed me to focus onto the cat, but caused the background to be completely blown out. i guess for most people, at least those that that do not shoot in full manual, this problem is not a major issue. because the expo. sim. will always adjust the exposure automatically as to assist the contrast-af.", "sortedWord": "None", "identifyer": 46666, "year": "2020"}, {"Unnamed: 0": 299918, "autor": "Cinderbike", "date": 1594940408000, "content": "What to replace Rebel XTi with? /!/ Currently I have a Rebel XTi, which I've had for about 14 years. I have not used it AT ALL in about 5, as the batteries are toast, the shutter is starting to go and most importantly, a big black spot on the photos which is NOT dust on the sensor. These issues and increasingly acceptable photos on my smartphone had made me all but stop shooting. TLDR, want to get back into the game and would like (do not NEED) mirrorless and something that can replace my camcorder as well.\n\nI am torn on the R, RP, and R6. I am quite sure I could live happily with the RP... but other than \"money is no object\" would an amateur such as myself have any reason to splurge for a better model? Would I be better off with an EOS-M or a higher end/newer Rebel? From all reviews it appears the RP has fairly terrible video performance, but for CASUAL use - is it worth the expenditure to go for the R or R6?\n\nLastly - glass. I was thinking of getting the 24-105L or 24-70 f.28... The old speed vs. length debate. Any suggestions there would be great. Thanks!", "link": "https://www.reddit.com/r/canon/comments/hske8k/what_to_replace_rebel_xti_with/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what to replace rebel xti with? /!/ currently i have a rebel xti, which i've had for about 14 years. i have not used it at all in about 5, as the batteries are toast, the shutter is starting to go and most importantly, a big black -----> spot !!!  on the photos which is not dust on the sensor. these issues and increasingly acceptable photos on my smartphone had made me all but stop shooting. tldr, want to get back into the game and would like (do not need) mirrorless and something that can replace my camcorder as well.\n\ni am torn on the r, rp, and r6. i am quite sure i could live happily with the rp... but other than \"money is no object\" would an amateur such as myself have any reason to splurge for a better model? would i be better off with an eos-m or a higher end/newer rebel? from all reviews it appears the rp has fairly terrible video performance, but for casual use - is it worth the expenditure to go for the r or r6?\n\nlastly - glass. i was thinking of getting the 24-105l or 24-70 f.28... the old speed vs. length debate. any suggestions there would be great. thanks!", "sortedWord": "None", "identifyer": 46705, "year": "2020"}, {"Unnamed: 0": 300250, "autor": "BleachedJam", "date": 1599254797000, "content": "I think I made a bad choice, help? /!/ I've been interested in photography off and on for years. I had a baby about a year ago and the pregnancy was difficult, so I haven't had a chance to really use my camera in a few years. \n\nThis semester in college I decided to take a digital photography class to help get me back into it. I have a T5i with the 18-55mm lens.\n\nIt has some problems though. It has 5-6 dead pixels that appear in all photos. And when the aperture is closed past f13 there is a very noticeable spot of dust on the sensor. This is frustrating for sure, the dust is big enough to not be easy to shop out like the pixels.\n\nAnyway, my husband saw they have a bundle with the T7 at Costco. We bought it and it should be here on Tuesday. However, this sub and another photography sub I'm on seem to think the T7 is trash.\n\nDid I make a mistake? Should I return it and go for something else? \n\nAs far as use of the camera, I'm not sure where I am. Obviously I want nice pictures of my kid but any camera can do that. I like a lot of nature photography, animals and plants, and street photography. I have a few friends who want portraits done and I dabble in cosplay photography. I have a redbubble because it would be cool to sell pictures, but I understand this camera and budget are because this is a hobby to me. I would love to do photography as a career or even on the side to make money, but I don't think my budget would allow for that at the moment.\n\n\n\n\nTL;DR I have a T5i with dead pixels and dust on the sensor, will I be happy upgrading to the T7 with two lenses or should I return the T7 and make a different choice?", "link": "https://www.reddit.com/r/canon/comments/imop5i/i_think_i_made_a_bad_choice_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i think i made a bad choice, help? /!/ i've been interested in photography off and on for years. i had a baby about a year ago and the pregnancy was difficult, so i haven't had a chance to really use my camera in a few years. \n\nthis semester in college i decided to take a digital photography class to help get me back into it. i have a t5i with the 18-55mm lens.\n\nit has some problems though. it has 5-6 dead pixels that appear in all photos. and when the aperture is closed past f13 there is a very noticeable -----> spot !!!  of dust on the sensor. this is frustrating for sure, the dust is big enough to not be easy to shop out like the pixels.\n\nanyway, my husband saw they have a bundle with the t7 at costco. we bought it and it should be here on tuesday. however, this sub and another photography sub i'm on seem to think the t7 is trash.\n\ndid i make a mistake? should i return it and go for something else? \n\nas far as use of the camera, i'm not sure where i am. obviously i want nice pictures of my kid but any camera can do that. i like a lot of nature photography, animals and plants, and street photography. i have a few friends who want portraits done and i dabble in cosplay photography. i have a redbubble because it would be cool to sell pictures, but i understand this camera and budget are because this is a hobby to me. i would love to do photography as a career or even on the side to make money, but i don't think my budget would allow for that at the moment.\n\n\n\n\ntl;dr i have a t5i with dead pixels and dust on the sensor, will i be happy upgrading to the t7 with two lenses or should i return the t7 and make a different choice?", "sortedWord": "None", "identifyer": 47048, "year": "2020"}, {"Unnamed: 0": 300269, "autor": "Reflectif_", "date": 1599190080000, "content": "Older lenses and fungus /!/ Sorry if this is a bit of a noob question - I've never had a lens with fungus before so don't have any experience.\n\nSo I picked up a deal with a 7D,  and the older 17-35mm 2.8, and 28-70mm 2.8 lenses as a package for a really good price. Unfortunately one of the lenses has a couple of spots of fungus. I'm still getting a pretty good image quality out of the lens, but if I were to get it cleaned in the future I was wondering a) how much is a reasonable price that I should be expecting to pay, and b) whether it would be worth it in terms of image quality and general health of the lens?", "link": "https://www.reddit.com/r/canon/comments/im8hz1/older_lenses_and_fungus/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "older lenses and fungus /!/ sorry if this is a bit of a noob question - i've never had a lens with fungus before so don't have any experience.\n\nso i picked up a deal with a 7d,  and the older 17-35mm 2.8, and 28-70mm 2.8 lenses as a package for a really good price. unfortunately one of the lenses has a couple of -----> spots !!!  of fungus. i'm still getting a pretty good image quality out of the lens, but if i were to get it cleaned in the future i was wondering a) how much is a reasonable price that i should be expecting to pay, and b) whether it would be worth it in terms of image quality and general health of the lens?", "sortedWord": "None", "identifyer": 47067, "year": "2020"}, {"Unnamed: 0": 300373, "autor": "kim_kgb", "date": 1600889308000, "content": "Hi Everyone, Just bought used Canon 80D with brand News Canon EF 50 mm 1.8 stm lens but some pictures show Black spot.. Suggestions?", "link": "https://www.reddit.com/r/canon/comments/iyh4b4/hi_everyone_just_bought_used_canon_80d_with_brand/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi everyone, just bought used canon 80d with brand news canon ef 50 mm 1.8 stm lens but some pictures show black -----> spot !!! .. suggestions?", "sortedWord": "None", "identifyer": 47174, "year": "2020"}, {"Unnamed: 0": 300573, "autor": "meanmonkey20", "date": 1604027196000, "content": "R5/R6 focus trouble during video /!/ Hi guys, just wondering if anyone have trouble with focusing during video mode using R5/R6. I have an R6 and not much of an video person but tested it out after watching a review by Potato Jet. My R6 did struggles about 25-30% of time, slow to focus or unable to focus altogether. Settings are 1/100, 2.8, auto iso, spot af and canon ef 16-35mm iii.", "link": "https://www.reddit.com/r/canon/comments/jkp2tu/r5r6_focus_trouble_during_video/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "r5/r6 focus trouble during video /!/ hi guys, just wondering if anyone have trouble with focusing during video mode using r5/r6. i have an r6 and not much of an video person but tested it out after watching a review by potato jet. my r6 did struggles about 25-30% of time, slow to focus or unable to focus altogether. settings are 1/100, 2.8, auto iso, -----> spot !!!  af and canon ef 16-35mm iii.", "sortedWord": "None", "identifyer": 47384, "year": "2020"}, {"Unnamed: 0": 300589, "autor": "Tsar_Ilya", "date": 1605762173000, "content": "A question for R5 (in first place) and R6 owners /!/ On 5Dmk3 you can change AF spot with big and upper wheels, which is a lot faster than joystick. Can you do the same on R5? \n\nI don’t know if this is available on 6D’s, but if R6 allows it - please let me know too.", "link": "https://www.reddit.com/r/canon/comments/jwwj73/a_question_for_r5_in_first_place_and_r6_owners/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a question for r5 (in first place) and r6 owners /!/ on 5dmk3 you can change af -----> spot !!!  with big and upper wheels, which is a lot faster than joystick. can you do the same on r5? \n\ni don’t know if this is available on 6d’s, but if r6 allows it - please let me know too.", "sortedWord": "None", "identifyer": 47400, "year": "2020"}, {"Unnamed: 0": 300702, "autor": "FurioSoprano7", "date": 1607536425000, "content": "Camera suggestions? /!/ Im pretty new to photography. So i really dont know what Camera to choose, on one hand so far the EOS 100D from 2013 and the other hand the EOS 250D from 2019, it can be another too. I had good experiences with the EOS 100D of a friend of mine and the picture were great, even though she had a  EF 75-300 lens which has a bad reputstion, so i wanna have something better since my budget is around ~500€.\n\nWhat is really irritating is the fact that the EOS 250D has 4k resolution but is somehow cheaper than the 100D and i really dont know why. The main use of my camera is portraits and other kind pictures of person depending on the spot and background.\n\nIm open for any suggestions and i would be really grateful for any help.", "link": "https://www.reddit.com/r/canon/comments/k9wqis/camera_suggestions/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera suggestions? /!/ im pretty new to photography. so i really dont know what camera to choose, on one hand so far the eos 100d from 2013 and the other hand the eos 250d from 2019, it can be another too. i had good experiences with the eos 100d of a friend of mine and the picture were great, even though she had a  ef 75-300 lens which has a bad reputstion, so i wanna have something better since my budget is around ~500€.\n\nwhat is really irritating is the fact that the eos 250d has 4k resolution but is somehow cheaper than the 100d and i really dont know why. the main use of my camera is portraits and other kind pictures of person depending on the -----> spot !!!  and background.\n\nim open for any suggestions and i would be really grateful for any help.", "sortedWord": "None", "identifyer": 47514, "year": "2020"}, {"Unnamed: 0": 300760, "autor": "Meticulous7", "date": 1607350893000, "content": "Canon M50 as Webcam via HDMI Capture --- Video Freezing when USB is disconnected /!/ Hi Everybody,\n\n&amp;#x200B;\n\nI'm having a peculiar issue, and since the Canon M50 is such a common streaming/VLOG camera, I'm hoping someone else has had this issue and resolved it at some point.\n\n&amp;#x200B;\n\nThe issue: I run a Canon M50 for a variety of webcam-style tasks: OBS streaming to Twitch and conference calls via a variety of programs (WebEx/Jabber/Zoom/etc.). The issue occurs when I'm **only** using the HDMI cable running to my HDMI USB capture card. When I connect the USB 2.0 cord to the camera, this issue does not occur. \n\n&amp;#x200B;\n\nMy HDMI capture card is using a USB 3.0 port on a powered hub. I was having a \"general\" freezing issue with it when trying to use my motherboard's USB ports. Connected to a fully powered USB port resolved that issue. However, this also seems to require having the micro USB 2.0  cable connected as well.\n\n&amp;#x200B;\n\nSo I'm curious, is this how it's supposed to be connected? I'm not using the EOS Webcam Utility, but am unable to stream video for more than a few minutes without connecting the to USB in tandem with the HDMI port. I have tested this across my primary desktop in OBS / Windows Camera app, and my laptop in Jabber/Webex/Zoom and also the Windows camera app. The behavior is very reproducable and occurs regardless of the computer when the USB 2.0 cable is disconnected (and trying to send video via the HDMI port.)\n\n&amp;#x200B;\n\nPlease let me know if any additional information is required. I tried searching a lot for this issue before posting, so I'm hoping this may act as a resolution spot for others who have had this problem. \n\n&amp;#x200B;\n\nThanks all for your time!", "link": "https://www.reddit.com/r/canon/comments/k8hgel/canon_m50_as_webcam_via_hdmi_capture_video/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon m50 as webcam via hdmi capture --- video freezing when usb is disconnected /!/ hi everybody,\n\n&amp;#x200b;\n\ni'm having a peculiar issue, and since the canon m50 is such a common streaming/vlog camera, i'm hoping someone else has had this issue and resolved it at some point.\n\n&amp;#x200b;\n\nthe issue: i run a canon m50 for a variety of webcam-style tasks: obs streaming to twitch and conference calls via a variety of programs (webex/jabber/zoom/etc.). the issue occurs when i'm **only** using the hdmi cable running to my hdmi usb capture card. when i connect the usb 2.0 cord to the camera, this issue does not occur. \n\n&amp;#x200b;\n\nmy hdmi capture card is using a usb 3.0 port on a powered hub. i was having a \"general\" freezing issue with it when trying to use my motherboard's usb ports. connected to a fully powered usb port resolved that issue. however, this also seems to require having the micro usb 2.0  cable connected as well.\n\n&amp;#x200b;\n\nso i'm curious, is this how it's supposed to be connected? i'm not using the eos webcam utility, but am unable to stream video for more than a few minutes without connecting the to usb in tandem with the hdmi port. i have tested this across my primary desktop in obs / windows camera app, and my laptop in jabber/webex/zoom and also the windows camera app. the behavior is very reproducable and occurs regardless of the computer when the usb 2.0 cable is disconnected (and trying to send video via the hdmi port.)\n\n&amp;#x200b;\n\nplease let me know if any additional information is required. i tried searching a lot for this issue before posting, so i'm hoping this may act as a resolution -----> spot !!!  for others who have had this problem. \n\n&amp;#x200b;\n\nthanks all for your time!", "sortedWord": "None", "identifyer": 47574, "year": "2020"}, {"Unnamed: 0": 300865, "autor": "NugsCommaChicken", "date": 1608838010000, "content": "Looking for upgrade to 28-135mm that is on its way out, would the canon 24-105 f/4L or the sigma Art 24-105 be an upgrade for IQ? /!/ Loving the range in my 28-135, but I think the focusing mechanism is going on it, and the zoom ring is getting tight in spots. Wondering if I should just replace with another of the same lens, or opt for one of the lenses mentioned in the headline?\n\n\nAny big differences in image quality? I like the thought of the continuous aperture. \n\n\nAny other lenses you’d recommend? Going on an m50 (for now) with an ef/ef-s adapter. No speed booster. \n\n\nWhat say you, Reddit?", "link": "https://www.reddit.com/r/canon/comments/kjl6on/looking_for_upgrade_to_28135mm_that_is_on_its_way/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looking for upgrade to 28-135mm that is on its way out, would the canon 24-105 f/4l or the sigma art 24-105 be an upgrade for iq? /!/ loving the range in my 28-135, but i think the focusing mechanism is going on it, and the zoom ring is getting tight in -----> spots !!! . wondering if i should just replace with another of the same lens, or opt for one of the lenses mentioned in the headline?\n\n\nany big differences in image quality? i like the thought of the continuous aperture. \n\n\nany other lenses you’d recommend? going on an m50 (for now) with an ef/ef-s adapter. no speed booster. \n\n\nwhat say you, reddit?", "sortedWord": "None", "identifyer": 47680, "year": "2020"}, {"Unnamed: 0": 301392, "autor": "muhammetalikaya", "date": 1590908140000, "content": "How i clean sensor spots /!/ Yes, i taking photos and add to lr for develop but i see sensor spots in sky etc. How i clean this sh*t.", "link": "https://www.reddit.com/r/canon/comments/gtub6v/how_i_clean_sensor_spots/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how i clean sensor -----> spots !!!  /!/ yes, i taking photos and add to lr for develop but i see sensor spots in sky etc. how i clean this sh*t.", "sortedWord": "None", "identifyer": 48232, "year": "2020"}, {"Unnamed: 0": 301501, "autor": "Second0pinion", "date": 1591967918000, "content": "Is a “superzoom” camera worth it? /!/ I have a GoPro I use for action Shots, and My IPhone I typically take portraits or selfies or landscapes with, but the zoom sucks on the phones.\n\nI was looking into getting one of the following for their “superzoom” capabilities:\n\nNikon P900\n(83x optical)\n\nPanasonic Lumix FZ300\n(24x zoom, I like this one least)\n\nNikon COOLPIX B600\n(60x optical)\n\nKodak PIXPRO Astro Zoom AZ652-BK \n(65X optical)\n\n\nbut I don’t like the fact that lenses can’t be changed like a DSLR would.\n\nIf something breaks, it would essentially be turned into an expensive paperweight, as the repair would surely be almost as my as a new camera.\n\nI just wondered if anyone had any recommendations from this list, or if you advise against a bridge camera all together?\n\nI wanted the Nikon P900 for the 83X optical zoom, but don’t want to spend $500 and then something happen and be stuck with an expensive paperweight.\n\nI’m leaning towards either the Nikon P900, or one of the cheaper models around $200 in case something happens.\n\nI will be using this primarily for the “superzoom” functionality, I don’t do professional photography or print pictures or anything, everything would be shared on a mobile device or laptop.\n\nI’ll be taking a trip to Yellowstone &amp; Grand Tetons and want to have something with a nice zoom feature so we could spot wildlife or take some cool mountain peek photos, or the stars at night.\n\nI almost went with a sighting scope and a cell phone adapter but figured that would be a disaster, and it ended up being $150+ anyway\n\nAny recommendations are appreciated!\n\nThank you.", "link": "https://www.reddit.com/r/canon/comments/h7kjac/is_a_superzoom_camera_worth_it/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is a “superzoom” camera worth it? /!/ i have a gopro i use for action shots, and my iphone i typically take portraits or selfies or landscapes with, but the zoom sucks on the phones.\n\ni was looking into getting one of the following for their “superzoom” capabilities:\n\nnikon p900\n(83x optical)\n\npanasonic lumix fz300\n(24x zoom, i like this one least)\n\nnikon coolpix b600\n(60x optical)\n\nkodak pixpro astro zoom az652-bk \n(65x optical)\n\n\nbut i don’t like the fact that lenses can’t be changed like a dslr would.\n\nif something breaks, it would essentially be turned into an expensive paperweight, as the repair would surely be almost as my as a new camera.\n\ni just wondered if anyone had any recommendations from this list, or if you advise against a bridge camera all together?\n\ni wanted the nikon p900 for the 83x optical zoom, but don’t want to spend $500 and then something happen and be stuck with an expensive paperweight.\n\ni’m leaning towards either the nikon p900, or one of the cheaper models around $200 in case something happens.\n\ni will be using this primarily for the “superzoom” functionality, i don’t do professional photography or print pictures or anything, everything would be shared on a mobile device or laptop.\n\ni’ll be taking a trip to yellowstone &amp; grand tetons and want to have something with a nice zoom feature so we could -----> spot !!!  wildlife or take some cool mountain peek photos, or the stars at night.\n\ni almost went with a sighting scope and a cell phone adapter but figured that would be a disaster, and it ended up being $150+ anyway\n\nany recommendations are appreciated!\n\nthank you.", "sortedWord": "None", "identifyer": 48345, "year": "2020"}, {"Unnamed: 0": 301727, "autor": "telekinetic", "date": 1594672109000, "content": "The official \"The R6 should have been more than 20MP, and here's why and how\" vs \"The R6 has a great spots in Canon's overall portfolio that is currently unoccupied\" discussion thread. /!/ Let's consolidate this discussion into one place.  Stay civil, everyone's opinions are their own.  Making broad sweeping statements about \"no real photographer\" or \"a serious camera\" not backed up by usage scenarios will be locked or ignored.  People are allowed to like or dislike what they like or dislike, and everyone's photographic workflow and trade-offs are their own.\n\nI am trying to phrase the two sides of this 'debate' in good faith, but I'm honestly having trouble seeing the opposing side, so maybe you guys can help me?\n\nIf you want more than 20MP, or need the high FPS and IBIS etc, and can afford the cost increase, Canon offers the 45MP R5.\n\nIf you want more than 20MP, and don't need high FPS, or can't afford the cost increase, Canon offers the 30MP R.\n\nIf you want a high FPS mirrorless with IBIS and advanced AF, and you value maximum ISO performance and longer buffers over higher MP, buy an R6.  \n\nAlternately, if you want a high FPS mirrorless with IBIS and advanced AF, but can't afford the R5, and 20MP is enough, buy the R6.\n\nIt's bizarre to me that people are claiming there is no market for a 20MP high FPS camera in a brand forum for a brand that has the 1DX series as its flagship.\n\nI feel like the R6 is a sweet spot for my particular type of photography.  The extra $1400 is not worth it for me for pixels I'm not going to use, and if I could get even better high ISO and increased FPS performance at the same price point, I'd take an even lower MP count, down to the 12MP Sony did with the A7S. If they do a firmware update (impossible I know, just a theoretical) that made the R6 operate in a 10MP mode, but the FPS went up to 40 and the rolling shutter was nearly eliminated, I would never switch it off.\n\nPeople who say the R6 should be higher MP, what else are you advocating they change about it? Make it 30MP and cost more?  That's really close to an R5.  Make it 30MP, 5 FPS, but add IBIS and the new autofocus and the joystick, and keep cost the same?  That's an EOS-R mark II, I'm sure it's coming, this just isn't it.  If you're just grumpy it isn't an EOS-R mark II, register your complaint here.\n\n[View Poll](https://www.reddit.com/poll/hqn3ac)", "link": "https://www.reddit.com/r/canon/comments/hqn3ac/the_official_the_r6_should_have_been_more_than/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "the official \"the r6 should have been more than 20mp, and here's why and how\" vs \"the r6 has a great -----> spots !!!  in canon's overall portfolio that is currently unoccupied\" discussion thread. /!/ let's consolidate this discussion into one place.  stay civil, everyone's opinions are their own.  making broad sweeping statements about \"no real photographer\" or \"a serious camera\" not backed up by usage scenarios will be locked or ignored.  people are allowed to like or dislike what they like or dislike, and everyone's photographic workflow and trade-offs are their own.\n\ni am trying to phrase the two sides of this 'debate' in good faith, but i'm honestly having trouble seeing the opposing side, so maybe you guys can help me?\n\nif you want more than 20mp, or need the high fps and ibis etc, and can afford the cost increase, canon offers the 45mp r5.\n\nif you want more than 20mp, and don't need high fps, or can't afford the cost increase, canon offers the 30mp r.\n\nif you want a high fps mirrorless with ibis and advanced af, and you value maximum iso performance and longer buffers over higher mp, buy an r6.  \n\nalternately, if you want a high fps mirrorless with ibis and advanced af, but can't afford the r5, and 20mp is enough, buy the r6.\n\nit's bizarre to me that people are claiming there is no market for a 20mp high fps camera in a brand forum for a brand that has the 1dx series as its flagship.\n\ni feel like the r6 is a sweet spot for my particular type of photography.  the extra $1400 is not worth it for me for pixels i'm not going to use, and if i could get even better high iso and increased fps performance at the same price point, i'd take an even lower mp count, down to the 12mp sony did with the a7s. if they do a firmware update (impossible i know, just a theoretical) that made the r6 operate in a 10mp mode, but the fps went up to 40 and the rolling shutter was nearly eliminated, i would never switch it off.\n\npeople who say the r6 should be higher mp, what else are you advocating they change about it? make it 30mp and cost more?  that's really close to an r5.  make it 30mp, 5 fps, but add ibis and the new autofocus and the joystick, and keep cost the same?  that's an eos-r mark ii, i'm sure it's coming, this just isn't it.  if you're just grumpy it isn't an eos-r mark ii, register your complaint here.\n\n[view poll](https://www.reddit.com/poll/hqn3ac)", "sortedWord": "None", "identifyer": 48572, "year": "2020"}, {"Unnamed: 0": 301756, "autor": "keithwillshoot", "date": 1594586879000, "content": "Can you spot the other red ring", "link": "https://www.reddit.com/r/canon/comments/hq1qvc/can_you_spot_the_other_red_ring/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you -----> spot !!!  the other red ring", "sortedWord": "None", "identifyer": 48601, "year": "2020"}, {"Unnamed: 0": 301805, "autor": "sonanz", "date": 1594431942000, "content": "Black spot showing up in pictures and in the viewfinder /!/ I've been using a Canon 6D for about 6 years now, and I just recently noticed a black spot in the lower right hand portion of my images.  See this example:\n\n[https://imgur.com/gIbytgh](https://imgur.com/gIbytgh)\n\nI've tried to search up what it means when a spot shows up both in the viewfinder and in images, but I can't seem to find any good information.  It seems like it should always be either one or the other, but not both.  And no, it's not on a lens or anything.  It shows up in the viewfinder with no lens attached.\n\nAny help would be greatly appreciated!", "link": "https://www.reddit.com/r/canon/comments/hp1o7d/black_spot_showing_up_in_pictures_and_in_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "black -----> spot !!!  showing up in pictures and in the viewfinder /!/ i've been using a canon 6d for about 6 years now, and i just recently noticed a black spot in the lower right hand portion of my images.  see this example:\n\n[https://imgur.com/gibytgh](https://imgur.com/gibytgh)\n\ni've tried to search up what it means when a spot shows up both in the viewfinder and in images, but i can't seem to find any good information.  it seems like it should always be either one or the other, but not both.  and no, it's not on a lens or anything.  it shows up in the viewfinder with no lens attached.\n\nany help would be greatly appreciated!", "sortedWord": "None", "identifyer": 48652, "year": "2020"}, {"Unnamed: 0": 301817, "autor": "primusinterpares", "date": 1594403905000, "content": "What's the difference between Canon RF 24-105mm f/4L IS USM vs RF24-105mm F4-7.1 is STM /!/ I've been going back and forth between these lenses, but I can't understand why they are so much separately priced. I'm rather new to photography, but not a complete n00b, can someone help me understand the price difference between these two lenses?\n\nAperture seems to be the same at F4, they both have IS, the only difference I can spot is USM vs STM, and I understand the difference - but not why it would result in such a higher price.\n\nCanon RF24-105mm F4-7.1 is STM (4111C002): $399, sold by Canon\n\n [https://www.amazon.com/Canon-RF24-105mm-F4-7-1-STM-4111C002/dp/B084BKXDLD/ref=sr\\_1\\_1?dchild=1&amp;keywords=RF24-105mm+F4&amp;qid=1594403302&amp;sr=8-1](https://www.amazon.com/Canon-RF24-105mm-F4-7-1-STM-4111C002/dp/B084BKXDLD/ref=sr_1_1?dchild=1&amp;keywords=RF24-105mm+F4&amp;qid=1594403302&amp;sr=8-1) \n\nCanon RF 24-105mm f/4L IS USM Lens, Black - 2963C002: $1,099, sold by Canon\n\n [https://www.amazon.com/Canon-RF-24-105mm-USM-Lens/dp/B07H489XDQ/ref=sr\\_1\\_6?dchild=1&amp;keywords=RF24-105mm+F4&amp;qid=1594403302&amp;sr=8-6](https://www.amazon.com/Canon-RF-24-105mm-USM-Lens/dp/B07H489XDQ/ref=sr_1_6?dchild=1&amp;keywords=RF24-105mm+F4&amp;qid=1594403302&amp;sr=8-6)", "link": "https://www.reddit.com/r/canon/comments/hotp5x/whats_the_difference_between_canon_rf_24105mm_f4l/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what's the difference between canon rf 24-105mm f/4l is usm vs rf24-105mm f4-7.1 is stm /!/ i've been going back and forth between these lenses, but i can't understand why they are so much separately priced. i'm rather new to photography, but not a complete n00b, can someone help me understand the price difference between these two lenses?\n\naperture seems to be the same at f4, they both have is, the only difference i can -----> spot !!!  is usm vs stm, and i understand the difference - but not why it would result in such a higher price.\n\ncanon rf24-105mm f4-7.1 is stm (4111c002): $399, sold by canon\n\n [https://www.amazon.com/canon-rf24-105mm-f4-7-1-stm-4111c002/dp/b084bkxdld/ref=sr\\_1\\_1?dchild=1&amp;keywords=rf24-105mm+f4&amp;qid=1594403302&amp;sr=8-1](https://www.amazon.com/canon-rf24-105mm-f4-7-1-stm-4111c002/dp/b084bkxdld/ref=sr_1_1?dchild=1&amp;keywords=rf24-105mm+f4&amp;qid=1594403302&amp;sr=8-1) \n\ncanon rf 24-105mm f/4l is usm lens, black - 2963c002: $1,099, sold by canon\n\n [https://www.amazon.com/canon-rf-24-105mm-usm-lens/dp/b07h489xdq/ref=sr\\_1\\_6?dchild=1&amp;keywords=rf24-105mm+f4&amp;qid=1594403302&amp;sr=8-6](https://www.amazon.com/canon-rf-24-105mm-usm-lens/dp/b07h489xdq/ref=sr_1_6?dchild=1&amp;keywords=rf24-105mm+f4&amp;qid=1594403302&amp;sr=8-6)", "sortedWord": "None", "identifyer": 48664, "year": "2020"}, {"Unnamed: 0": 301850, "autor": "Ailurus_Fulgens_", "date": 1595493316000, "content": "Some focus points aren’t useable? /!/ On my 7D, Spot Auto Focus and Auto Focus Point Expansion are not available to use, but the other focus points are fine. Can anyone tell me why?", "link": "https://www.reddit.com/r/canon/comments/hwc45p/some_focus_points_arent_useable/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some focus points aren’t useable? /!/ on my 7d, -----> spot !!!  auto focus and auto focus point expansion are not available to use, but the other focus points are fine. can anyone tell me why?", "sortedWord": "None", "identifyer": 48697, "year": "2020"}, {"Unnamed: 0": 301878, "autor": "RedZero1901", "date": 1595412566000, "content": "Letting my Canon Rebel t6i die? /!/ I've had my baby since Spring 2018, got it from Amazon and from then it has been with me for trips, school pictures, short films and even my gap year in Europe.\n\nLast December I had to do its first repair as it didn't process the recording of videos, I think it was because I was filming in a very humid and so-so rainy day but yeah, that repair costed me 130€.\n\nJust now, that I started filming other short film, I messed up and putted it with the tripod over an office chair, it seemed a nice spot but 5 seconds later, I heard it falling to the floor.\n\nFor what I've checked, it's having image saving problems but the SD Card is fine. Plus, the display won't even show up when putting it on video mode.\n\nI'll take it to a repair shop but to be honest, I don't know if the price is somehow similar to last time (even if I'm sure it most likely will be higher as it seems as a bigger problem) I should keep pushing on with it.\n\nI know this is a pricey hobby/passion, but knowing that right now I don't have the money to buy a new camera but maybe I can keep this one going for a couple of years, if I'm just burning my money.\n\nThoughts? Opinion appreciated.", "link": "https://www.reddit.com/r/canon/comments/hvr6ab/letting_my_canon_rebel_t6i_die/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "letting my canon rebel t6i die? /!/ i've had my baby since spring 2018, got it from amazon and from then it has been with me for trips, school pictures, short films and even my gap year in europe.\n\nlast december i had to do its first repair as it didn't process the recording of videos, i think it was because i was filming in a very humid and so-so rainy day but yeah, that repair costed me 130€.\n\njust now, that i started filming other short film, i messed up and putted it with the tripod over an office chair, it seemed a nice -----> spot !!!  but 5 seconds later, i heard it falling to the floor.\n\nfor what i've checked, it's having image saving problems but the sd card is fine. plus, the display won't even show up when putting it on video mode.\n\ni'll take it to a repair shop but to be honest, i don't know if the price is somehow similar to last time (even if i'm sure it most likely will be higher as it seems as a bigger problem) i should keep pushing on with it.\n\ni know this is a pricey hobby/passion, but knowing that right now i don't have the money to buy a new camera but maybe i can keep this one going for a couple of years, if i'm just burning my money.\n\nthoughts? opinion appreciated.", "sortedWord": "None", "identifyer": 48728, "year": "2020"}, {"Unnamed: 0": 302017, "autor": "brothersp0rt", "date": 1597213256000, "content": "When are the R6's supposed to start shipping? /!/ The end of August right? I've never pre-ordered a camera before and I didn't think waiting 12 hours would cost me an extra few months of waiting. I did my first one through Adorama around 1 am on the 10th and another through Amazon a week ago, I also was put on a list for a local spot 2 weeks ago.\n\nI was really hoping to have it by October but it's not looking good.", "link": "https://www.reddit.com/r/canon/comments/i88n13/when_are_the_r6s_supposed_to_start_shipping/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "when are the r6's supposed to start shipping? /!/ the end of august right? i've never pre-ordered a camera before and i didn't think waiting 12 hours would cost me an extra few months of waiting. i did my first one through adorama around 1 am on the 10th and another through amazon a week ago, i also was put on a list for a local -----> spot !!!  2 weeks ago.\n\ni was really hoping to have it by october but it's not looking good.", "sortedWord": "None", "identifyer": 48872, "year": "2020"}, {"Unnamed: 0": 302101, "autor": "gunk_plunk", "date": 1597022736000, "content": "Film spots when looking in the lens. /!/ I recently acquired a Canon AE-1. It was in very good condition so picked up new battery and loaded with film. When I look through view finder I don’t see any spots but if I look through the front lens of the camera when mounted on body I can see a ton. Will this show up on pictures? I will more than likely take it to get cleaned but just curious is this roll is ruined.", "link": "https://www.reddit.com/r/canon/comments/i6vhah/film_spots_when_looking_in_the_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film -----> spots !!!  when looking in the lens. /!/ i recently acquired a canon ae-1. it was in very good condition so picked up new battery and loaded with film. when i look through view finder i don’t see any spots but if i look through the front lens of the camera when mounted on body i can see a ton. will this show up on pictures? i will more than likely take it to get cleaned but just curious is this roll is ruined.", "sortedWord": "None", "identifyer": 48956, "year": "2020"}, {"Unnamed: 0": 302157, "autor": "Benjiblobs", "date": 1597578649000, "content": "Main/Top scroll dial inconsistent - 5D Mark 3 /!/ Hiya, \n\nAs the title suggests, I have a 5D3 with a slightly dodgy top scroll wheel (the one by the shutter release) it works just fine about 95% of the time, but every now and again, one of the ratchets/clicks doesn't trigger the action. \n\nIf I'm scrolling through an ISO range for example, I'll slowly scroll the dial a few times, 200, 400, 800 \\*click\\*, 1000. It's impossible to replicate it consistently, it's not like there's a dead spot on the wheel because the next time around it'll miss a click on a different setting, or it will hang for more than one click.\n\nIt's obviously not the end of the world, most of the time the camera is fine for use, but when you're quickly adjusting settings on the fly you can't rely on the clicks to tell you what's going on. Is there anything I should be trying to get this fixed? Alcohol? Compressed air?\n\nMany thanks in advance!", "link": "https://www.reddit.com/r/canon/comments/iar1iq/maintop_scroll_dial_inconsistent_5d_mark_3/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "main/top scroll dial inconsistent - 5d mark 3 /!/ hiya, \n\nas the title suggests, i have a 5d3 with a slightly dodgy top scroll wheel (the one by the shutter release) it works just fine about 95% of the time, but every now and again, one of the ratchets/clicks doesn't trigger the action. \n\nif i'm scrolling through an iso range for example, i'll slowly scroll the dial a few times, 200, 400, 800 \\*click\\*, 1000. it's impossible to replicate it consistently, it's not like there's a dead -----> spot !!!  on the wheel because the next time around it'll miss a click on a different setting, or it will hang for more than one click.\n\nit's obviously not the end of the world, most of the time the camera is fine for use, but when you're quickly adjusting settings on the fly you can't rely on the clicks to tell you what's going on. is there anything i should be trying to get this fixed? alcohol? compressed air?\n\nmany thanks in advance!", "sortedWord": "None", "identifyer": 49012, "year": "2020"}, {"Unnamed: 0": 302225, "autor": "Just_Water_Please", "date": 1598554153000, "content": "Any Way to Extend Recordings on G7x mark ii? /!/  I've been using my G7x mark ii in an unreachable spot on my dash cam for auto-cross purposes. It's in the best possible angle and I'd hate to forfeit it just so I can press the record button every 20-25 minutes.. But all my videos discontinue automatically at 20-25 minutes. Is there a way to override this? \n\nI understand this has something to do with the filing format for SD cards only allowing 4GB in a single file but it throws a wrench in my plans. If not, is there another method any of you can think of that doesn't involve pressing record on the camera? Any canon remotes I haven't heard of? :)\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/ihqwu4/any_way_to_extend_recordings_on_g7x_mark_ii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any way to extend recordings on g7x mark ii? /!/  i've been using my g7x mark ii in an unreachable -----> spot !!!  on my dash cam for auto-cross purposes. it's in the best possible angle and i'd hate to forfeit it just so i can press the record button every 20-25 minutes.. but all my videos discontinue automatically at 20-25 minutes. is there a way to override this? \n\ni understand this has something to do with the filing format for sd cards only allowing 4gb in a single file but it throws a wrench in my plans. if not, is there another method any of you can think of that doesn't involve pressing record on the camera? any canon remotes i haven't heard of? :)\n\nthanks", "sortedWord": "None", "identifyer": 49080, "year": "2020"}, {"Unnamed: 0": 302239, "autor": "123qazwsx123", "date": 1598498565000, "content": "Bright Green-ish Spots on 5D Mark II LCD /!/ Hello Everyone,\n\nI recently purchased a used Canon 5D Mark II. The external aspects of the camera look terrific - it is clean, lightly used and has a low shutter count. However, when I received and turned the camera on, I noticed several bright green-ish spots on the LCD. Interestingly, I have not noticed these on the viewfinder, and from what I am seeing, doesn’t impact image quality. With that said, I have no clue what these spots are or if they might signal a larger internal issue with the LCD. I bought used, but I also want to avoid major issues. At this point, I have the option to return and am considering it. Is anyone familiar with this issue? I would appreciate any thoughts and guidance on determining the cause of these spots and if it’s something that should raise red flags for me and the long term use of this body. If it’s cosmetic, I think I can live with it... For context, the spots appear most significantly in dark or under exposed images. \n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/ihdm1k/bright_greenish_spots_on_5d_mark_ii_lcd/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "bright green-ish -----> spots !!!  on 5d mark ii lcd /!/ hello everyone,\n\ni recently purchased a used canon 5d mark ii. the external aspects of the camera look terrific - it is clean, lightly used and has a low shutter count. however, when i received and turned the camera on, i noticed several bright green-ish spots on the lcd. interestingly, i have not noticed these on the viewfinder, and from what i am seeing, doesn’t impact image quality. with that said, i have no clue what these spots are or if they might signal a larger internal issue with the lcd. i bought used, but i also want to avoid major issues. at this point, i have the option to return and am considering it. is anyone familiar with this issue? i would appreciate any thoughts and guidance on determining the cause of these spots and if it’s something that should raise red flags for me and the long term use of this body. if it’s cosmetic, i think i can live with it... for context, the spots appear most significantly in dark or under exposed images. \n\nthanks!", "sortedWord": "None", "identifyer": 49094, "year": "2020"}, {"Unnamed: 0": 302243, "autor": "lilybelle-", "date": 1598492737000, "content": "I need help removing this black speck from camera lens. Only shows up when taking photos, not video and is in same spot every time. It’s a cannon 18-55mm thanks!", "link": "https://www.reddit.com/r/canon/comments/ihc52p/i_need_help_removing_this_black_speck_from_camera/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i need help removing this black speck from camera lens. only shows up when taking photos, not video and is in same -----> spot !!!  every time. it’s a cannon 18-55mm thanks!", "sortedWord": "None", "identifyer": 49098, "year": "2020"}, {"Unnamed: 0": 302244, "autor": "lilybelle-", "date": 1598492594000, "content": "Dark spot on lens :(", "link": "https://www.reddit.com/r/canon/comments/ihc3ph/dark_spot_on_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dark -----> spot !!!  on lens :(", "sortedWord": "None", "identifyer": 49099, "year": "2020"}, {"Unnamed: 0": 302292, "autor": "BrugDiana", "date": 1598306958000, "content": "Problem with dark spots in upper corners of photos (more info on the problem in the comments)", "link": "https://www.reddit.com/r/canon/comments/ifz4in/problem_with_dark_spots_in_upper_corners_of/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "problem with dark -----> spots !!!  in upper corners of photos (more info on the problem in the comments)", "sortedWord": "None", "identifyer": 49150, "year": "2020"}, {"Unnamed: 0": 302502, "autor": "Nariakioshi", "date": 1600832720000, "content": "Switched to the R6 from Sony A7R III, some thoughts so far. /!/ I was with Sony for about four years. I had two canon cameras in the past but they were crop censored and I barely had any lenses for them. This isn’t a Bash one company over another post, just to give my take on Canon’s mirrorless coming from Sony. \n\n1) Canon has made some serious improvements to their software and it’s much easier to use than any Sony camera I’ve ever owned. Just having a touchscreen and being able to select things in a menu that are easy to read and understand. Menus written with the type of grammar typically used in my own dialect made picking up the camera and knowing where all the settings are, a task that lasted about an hour total. I had my a7R for so long and still couldn’t find some of the settings quickly after years of usage. \n\n2) I really love the size of the camera and how it feels in the hand. I know cameras are trending towards smaller form factors but I applaud canon for sticking to what photographers are used to. I have very large hands and it’s nice to know that the cameras not going to slip out while I’m holding it at a strange angle. \n\n3) there’s been a lot of talk about color science over the years. No matter which side of the fence you’re on, I can’t deny what my I can see.  Canon seems to have this figured out.  it was one of the major factors as to why I made the switch. There’s my things a photographer can adjust when you shoot RAW, and there are some things that are challenging to do, based on the system you use. I’ve owned three different Sony cameras and not one of them produced tones, contrast, edge detail, Close to what this canon has produced. (I owned 42 megapixel a7R that had no aa filter with 4 g-master lenses, so it was a sharpness beast.) I have to admit, Canon just understands image processing. I feel like a no other camera manufacturer, save for Fuji, can match what they do, regardless of whether you’re shooting RAW or JPEG. \n\n4) If you ever decide that you want to switch systems Canon’s glass is so excellent and so compatible that it easily the smarter investment. I spent thousands of dollars on G master lenses. When I had to sell them, I lost so much. No matter what system I use I’ll make sure my glass is compatible with the new bodies going forward. \n\n5) Dual pixel auto focus is just as good as Any real time focusing system. I haven’t tested it on fast moving object yet but I’m not really a wildlife shooter nor sport shooter, so my opinion could change based on the scenario but from what I’ve seen so far it’s spot on and really impressive.\n\n6) Lastly, I registered my camera today and posted on my Instagram story my unboxing. I tagged Cannon and to my surprise it they responded to my post. In the three years I’ve been posting Sony photographs, even taking product shots of Sony products, I’ve never once received any attention from their pages. It’s just appreciated to know that they care about the people that purchase their cameras.", "link": "https://www.reddit.com/r/canon/comments/iy2wfh/switched_to_the_r6_from_sony_a7r_iii_some/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "switched to the r6 from sony a7r iii, some thoughts so far. /!/ i was with sony for about four years. i had two canon cameras in the past but they were crop censored and i barely had any lenses for them. this isn’t a bash one company over another post, just to give my take on canon’s mirrorless coming from sony. \n\n1) canon has made some serious improvements to their software and it’s much easier to use than any sony camera i’ve ever owned. just having a touchscreen and being able to select things in a menu that are easy to read and understand. menus written with the type of grammar typically used in my own dialect made picking up the camera and knowing where all the settings are, a task that lasted about an hour total. i had my a7r for so long and still couldn’t find some of the settings quickly after years of usage. \n\n2) i really love the size of the camera and how it feels in the hand. i know cameras are trending towards smaller form factors but i applaud canon for sticking to what photographers are used to. i have very large hands and it’s nice to know that the cameras not going to slip out while i’m holding it at a strange angle. \n\n3) there’s been a lot of talk about color science over the years. no matter which side of the fence you’re on, i can’t deny what my i can see.  canon seems to have this figured out.  it was one of the major factors as to why i made the switch. there’s my things a photographer can adjust when you shoot raw, and there are some things that are challenging to do, based on the system you use. i’ve owned three different sony cameras and not one of them produced tones, contrast, edge detail, close to what this canon has produced. (i owned 42 megapixel a7r that had no aa filter with 4 g-master lenses, so it was a sharpness beast.) i have to admit, canon just understands image processing. i feel like a no other camera manufacturer, save for fuji, can match what they do, regardless of whether you’re shooting raw or jpeg. \n\n4) if you ever decide that you want to switch systems canon’s glass is so excellent and so compatible that it easily the smarter investment. i spent thousands of dollars on g master lenses. when i had to sell them, i lost so much. no matter what system i use i’ll make sure my glass is compatible with the new bodies going forward. \n\n5) dual pixel auto focus is just as good as any real time focusing system. i haven’t tested it on fast moving object yet but i’m not really a wildlife shooter nor sport shooter, so my opinion could change based on the scenario but from what i’ve seen so far it’s -----> spot !!!  on and really impressive.\n\n6) lastly, i registered my camera today and posted on my instagram story my unboxing. i tagged cannon and to my surprise it they responded to my post. in the three years i’ve been posting sony photographs, even taking product shots of sony products, i’ve never once received any attention from their pages. it’s just appreciated to know that they care about the people that purchase their cameras.", "sortedWord": "None", "identifyer": 49367, "year": "2020"}, {"Unnamed: 0": 302629, "autor": "meanmrmustard", "date": 1601557934000, "content": "Canon T3i Green on LCD /!/ I just bought a used T3i and unfortunately there seems to be something wrong with the LCD. Has anyone come across this issue before? It isn't on the pictures when uploaded. And it's not in fixed spots. It's like it's processing colours incorrectly. \n\nhttps://preview.redd.it/h9p4v33hghq51.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=644999e035f42450f17f7b9d608ec572519f08aa", "link": "https://www.reddit.com/r/canon/comments/j38amn/canon_t3i_green_on_lcd/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon t3i green on lcd /!/ i just bought a used t3i and unfortunately there seems to be something wrong with the lcd. has anyone come across this issue before? it isn't on the pictures when uploaded. and it's not in fixed -----> spots !!! . it's like it's processing colours incorrectly. \n\nhttps://preview.redd.it/h9p4v33hghq51.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=644999e035f42450f17f7b9d608ec572519f08aa", "sortedWord": "None", "identifyer": 49495, "year": "2020"}, {"Unnamed: 0": 302932, "autor": "hallie90", "date": 1604761714000, "content": "Focus Canon EOS R /!/ Hi everyone,\n\nI’ve had my Canon EOS R for about a year now and I love it. However, I’ve been having issues focusing the camera when I’m using the viewfinder. I had been using the screen to look and focus, but I much prefer looking through the viewfinder. So when I have tracking on, I can look through the viewfinder and the camera will find the focus point depending on where I have it pointed to. However, if I chose spot focusing for example or any other mode, the box doesn’t automatically move when I point the camera in different places. Why is that? Do I have something wrong in my settings? I’m used to being able to just focus in that way. Dragging or moving the box manually seems inefficient.\n\nAny guidance would be appreciated! \n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/jpscz9/focus_canon_eos_r/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focus canon eos r /!/ hi everyone,\n\ni’ve had my canon eos r for about a year now and i love it. however, i’ve been having issues focusing the camera when i’m using the viewfinder. i had been using the screen to look and focus, but i much prefer looking through the viewfinder. so when i have tracking on, i can look through the viewfinder and the camera will find the focus point depending on where i have it pointed to. however, if i chose -----> spot !!!  focusing for example or any other mode, the box doesn’t automatically move when i point the camera in different places. why is that? do i have something wrong in my settings? i’m used to being able to just focus in that way. dragging or moving the box manually seems inefficient.\n\nany guidance would be appreciated! \n\nthanks!", "sortedWord": "None", "identifyer": 49810, "year": "2020"}, {"Unnamed: 0": 303140, "autor": "anthroposcenery", "date": 1605155880000, "content": "R5: Couple custom button setting questions /!/ I've been using my new R5 for a couple weeks and mostly loving it. \n\nThere are two things I still can't find a good way to set up: \n\n1) I really want a custom button to switch between shutter modes without digging through the menus. I've been using the mechanical shutter, but if a little bird lands by me and I want to go into silent mode, I don't want to spend 30 seconds digging in menus.\n\n2) I want a button to toggle auto ISO on and off. There's something I don't understand where sometimes when you turn the ISO dial past 100 it goes into auto and sometimes not. But still, you can't then use the same dial to set exposure compensation. Ideally, I'd like to be able to toggle between auto and manual and use the same dial to adjust ISO directly or exposure compensation. I usually want to be in fully manual, but if I'm tracking something moving from shadow to light, I want to be able to quickly go into auto.\n\n&amp;#x200B;\n\nAlso, since it took a long time to get the AF set up in a way that works for me, here's how I have if if anyone's interested:\n\nI'm using backbutton autofocus with AF-ON and \\* set to spot AF and eye AF, but then I still have spot AF on the shutter half press and AF point button set to AF stop with the joystick always on and the set button set to toggle servo on and off. The shutter half-press doesn't seem to interfere with backbutton AF when you have one of the back button AF modes already on and if I don't want the AF to come on when I half press the shutter, I can hold the other AF stop button. I prefer it that way so if I want to turn servo off and use the joystick to track something I don't have to go into any menus. I guess all that's only relevant if you are someone who switches back and fourth between back button autofocusing. Te only drawback I see is having to sometimes hold the AF stop button when you otherwise wouldn't, but I like the flexibility.\n\nAnyway, I'm just an amateur. I'd be thrilled to hear about other setups or if there's something dumb about how I have my AF set up.", "link": "https://www.reddit.com/r/canon/comments/jsoamp/r5_couple_custom_button_setting_questions/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "r5: couple custom button setting questions /!/ i've been using my new r5 for a couple weeks and mostly loving it. \n\nthere are two things i still can't find a good way to set up: \n\n1) i really want a custom button to switch between shutter modes without digging through the menus. i've been using the mechanical shutter, but if a little bird lands by me and i want to go into silent mode, i don't want to spend 30 seconds digging in menus.\n\n2) i want a button to toggle auto iso on and off. there's something i don't understand where sometimes when you turn the iso dial past 100 it goes into auto and sometimes not. but still, you can't then use the same dial to set exposure compensation. ideally, i'd like to be able to toggle between auto and manual and use the same dial to adjust iso directly or exposure compensation. i usually want to be in fully manual, but if i'm tracking something moving from shadow to light, i want to be able to quickly go into auto.\n\n&amp;#x200b;\n\nalso, since it took a long time to get the af set up in a way that works for me, here's how i have if if anyone's interested:\n\ni'm using backbutton autofocus with af-on and \\* set to -----> spot !!!  af and eye af, but then i still have spot af on the shutter half press and af point button set to af stop with the joystick always on and the set button set to toggle servo on and off. the shutter half-press doesn't seem to interfere with backbutton af when you have one of the back button af modes already on and if i don't want the af to come on when i half press the shutter, i can hold the other af stop button. i prefer it that way so if i want to turn servo off and use the joystick to track something i don't have to go into any menus. i guess all that's only relevant if you are someone who switches back and fourth between back button autofocusing. te only drawback i see is having to sometimes hold the af stop button when you otherwise wouldn't, but i like the flexibility.\n\nanyway, i'm just an amateur. i'd be thrilled to hear about other setups or if there's something dumb about how i have my af set up.", "sortedWord": "None", "identifyer": 50027, "year": "2020"}, {"Unnamed: 0": 303169, "autor": "Devastator1329", "date": 1605085680000, "content": "Best place to go online to trade lens, camera gear, etc?? /!/ I have some lens I’m looking to trade and wondering if there’s any safe spots online where it’s commonly done and acceptable ? Have some lens I’d rather potentially trade then sell them to like BH photos and those sort of things.", "link": "https://www.reddit.com/r/canon/comments/js4wpl/best_place_to_go_online_to_trade_lens_camera_gear/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "best place to go online to trade lens, camera gear, etc?? /!/ i have some lens i’m looking to trade and wondering if there’s any safe -----> spots !!!  online where it’s commonly done and acceptable ? have some lens i’d rather potentially trade then sell them to like bh photos and those sort of things.", "sortedWord": "None", "identifyer": 50056, "year": "2020"}, {"Unnamed: 0": 303245, "autor": "flippingwilson", "date": 1606504809000, "content": "Is there a sweet spot in the Canon Rebel T-series? /!/ Is there one to avoid?", "link": "https://www.reddit.com/r/canon/comments/k27ohs/is_there_a_sweet_spot_in_the_canon_rebel_tseries/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there a sweet -----> spot !!!  in the canon rebel t-series? /!/ is there one to avoid?", "sortedWord": "None", "identifyer": 50133, "year": "2020"}, {"Unnamed: 0": 303319, "autor": "ActualKensei", "date": 1607122328000, "content": "R5 Shipping Dates /!/ I had an order in with BH Photo that would have shipped right about on Christmas according to the rep I spoke to, today. \n\nI saw that Canon was now listing the R5 as \"In Stock\". So I placed an order at CanonUSA with 2 day shipping and then cancelled my BH Photo order. Shortly thereafter, I checked on the status of my order with CanonUSA and it says it's on backorder. Now, BH Photo can't reinstate my order so I effectively lost my spot in the order fulfillment queue. (I would prefer to buy from BH Photo anyway.)\n\nI'm not happy about the Canon website listing In Stock status for items that are on backorder. The fact that I can't find any status updates or press releases on when Canon plans to ship the R5 is really frustrating. \n\nDoes anyone have any inside scoop? Is there a reason why Canon is listing the R5 as in stock? Is my camera going to ship tomorrow and I'm getting annoyed for no reason?", "link": "https://www.reddit.com/r/canon/comments/k6vkm6/r5_shipping_dates/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "r5 shipping dates /!/ i had an order in with bh photo that would have shipped right about on christmas according to the rep i spoke to, today. \n\ni saw that canon was now listing the r5 as \"in stock\". so i placed an order at canonusa with 2 day shipping and then cancelled my bh photo order. shortly thereafter, i checked on the status of my order with canonusa and it says it's on backorder. now, bh photo can't reinstate my order so i effectively lost my -----> spot !!!  in the order fulfillment queue. (i would prefer to buy from bh photo anyway.)\n\ni'm not happy about the canon website listing in stock status for items that are on backorder. the fact that i can't find any status updates or press releases on when canon plans to ship the r5 is really frustrating. \n\ndoes anyone have any inside scoop? is there a reason why canon is listing the r5 as in stock? is my camera going to ship tomorrow and i'm getting annoyed for no reason?", "sortedWord": "None", "identifyer": 50209, "year": "2020"}, {"Unnamed: 0": 303695, "autor": "[deleted]", "date": 1593818706000, "content": "I took this photo w/ my dad’s 8MP Canon EOS Rebel XT, using a 28-135mm f/5.6 (the only lens he has). I need help finding the sweet spot for ISO and shutter speed to prevent the banding issue /!/ [deleted]", "link": "https://www.reddit.com/r/canon/comments/hkt7ya/i_took_this_photo_w_my_dads_8mp_canon_eos_rebel/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i took this photo w/ my dad’s 8mp canon eos rebel xt, using a 28-135mm f/5.6 (the only lens he has). i need help finding the sweet -----> spot !!!  for iso and shutter speed to prevent the banding issue /!/ [deleted]", "sortedWord": "None", "identifyer": 50595, "year": "2020"}, {"Unnamed: 0": 303730, "autor": "MonkeySherm", "date": 1593699611000, "content": "RF control ring adapter worth it? /!/ First things first: I’m only using EF glass at the moment, and the adapter basically lives full time on my camera. \n\nIs anyone using anything other than the standard RF-EF adapter on their RF mount? \n\nInitially, I was thinking about picking up the filter adapter, but after I watched a few videos on it, it seems expensive and not ideal to use as something that stays mounted on the camera at all times - as far as I can tell there’s no “blank” to use when you’re not using a filter, and again, pretty expensive. \n\nThat lead me to the control ring adapter - is it worth the price over the basic one?  I’m thinking about a second RF body for shooting products - basically something to hang over a sweep and leave there, and maybe bring as a backup every now and then.  So I’d use the standard adapter I already have on that camera, and pick up the control ring adapter for my main.  \n\nI saw the control ring adapter refurbished for like $125 and at that price I’d just take the risk of not using it, but it’s sold out and you can get a standard adapter refurbished for like $40, so the jump becomes a little more significant - is the control ring worth $160 over a refurbished basic adapter? Why or why not? I would likely assign aperture on the ring, shutter speed by the shutter release, and ISO on the mode dial. \n\nI know the ring on the lenses is a mixed bag as far as how people feel about it, but it seems like it could be useful if it’s always in the same spot.", "link": "https://www.reddit.com/r/canon/comments/hjxv9j/rf_control_ring_adapter_worth_it/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "rf control ring adapter worth it? /!/ first things first: i’m only using ef glass at the moment, and the adapter basically lives full time on my camera. \n\nis anyone using anything other than the standard rf-ef adapter on their rf mount? \n\ninitially, i was thinking about picking up the filter adapter, but after i watched a few videos on it, it seems expensive and not ideal to use as something that stays mounted on the camera at all times - as far as i can tell there’s no “blank” to use when you’re not using a filter, and again, pretty expensive. \n\nthat lead me to the control ring adapter - is it worth the price over the basic one?  i’m thinking about a second rf body for shooting products - basically something to hang over a sweep and leave there, and maybe bring as a backup every now and then.  so i’d use the standard adapter i already have on that camera, and pick up the control ring adapter for my main.  \n\ni saw the control ring adapter refurbished for like $125 and at that price i’d just take the risk of not using it, but it’s sold out and you can get a standard adapter refurbished for like $40, so the jump becomes a little more significant - is the control ring worth $160 over a refurbished basic adapter? why or why not? i would likely assign aperture on the ring, shutter speed by the shutter release, and iso on the mode dial. \n\ni know the ring on the lenses is a mixed bag as far as how people feel about it, but it seems like it could be useful if it’s always in the same -----> spot !!! .", "sortedWord": "None", "identifyer": 50630, "year": "2020"}, {"Unnamed: 0": 303744, "autor": "curlyriver", "date": 1593656371000, "content": "does anyone know what that grey spot on the upper almost-middle corner might be? I tried looking at the first glass of the lenses but doesn't seem to be dirty, is it something inside? I tried cleaning the glass of the lens, too, but nothing worked. I'm scared 😬. (It's a Canon t6 with a 18-55mm.)", "link": "https://www.reddit.com/r/canon/comments/hjoibc/does_anyone_know_what_that_grey_spot_on_the_upper/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone know what that grey -----> spot !!!  on the upper almost-middle corner might be? i tried looking at the first glass of the lenses but doesn't seem to be dirty, is it something inside? i tried cleaning the glass of the lens, too, but nothing worked. i'm scared 😬. (it's a canon t6 with a 18-55mm.)", "sortedWord": "None", "identifyer": 50644, "year": "2020"}, {"Unnamed: 0": 303931, "autor": "Infernus1186", "date": 1595189116000, "content": "Help deciding between 80d and 90d /!/ I have been looking into upgrading my Rebel T6 for a while now, I do a lot of wildlife/bird shooting and the T6's lack of spot metering and large auto focus points/poor performance leave a lot to be desired.\nI primarily shoot with an EF 70-300mm IS USM II handheld.\n\nThe reason I'm hesitant to jump on the 90d is that I keep reading about the high megapixel count of the sensor resulting in soft images from subpar lenses as well as needing to increase shutter speed to avoid motion blur on subjects which isnt a big deal because i dont shoot a lot of fast moving stuff because the T6 really cant.\n\nBuying a new camera and something like the $2200 100-400mm L lens is out of the question, if the 90d is gonna give me issues with my current lens I will just save the $200 price difference and go with the 80d.\nI was wondering if anyone here has had any experience with the 90d compared to the 80d for this type of use and any other thoughts about the two cameras overall.", "link": "https://www.reddit.com/r/canon/comments/hu735b/help_deciding_between_80d_and_90d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help deciding between 80d and 90d /!/ i have been looking into upgrading my rebel t6 for a while now, i do a lot of wildlife/bird shooting and the t6's lack of -----> spot !!!  metering and large auto focus points/poor performance leave a lot to be desired.\ni primarily shoot with an ef 70-300mm is usm ii handheld.\n\nthe reason i'm hesitant to jump on the 90d is that i keep reading about the high megapixel count of the sensor resulting in soft images from subpar lenses as well as needing to increase shutter speed to avoid motion blur on subjects which isnt a big deal because i dont shoot a lot of fast moving stuff because the t6 really cant.\n\nbuying a new camera and something like the $2200 100-400mm l lens is out of the question, if the 90d is gonna give me issues with my current lens i will just save the $200 price difference and go with the 80d.\ni was wondering if anyone here has had any experience with the 90d compared to the 80d for this type of use and any other thoughts about the two cameras overall.", "sortedWord": "None", "identifyer": 50836, "year": "2020"}, {"Unnamed: 0": 304058, "autor": "PantsuitEmporium", "date": 1595712611000, "content": "Filming for VR 180 or VR 360 with a Canon 90D. How to achieve this? /!/ Hello, \n\nI've been wanting to start a project where I film various spots around NYC for use with VR headsets. \n\nI'd like to either do VR 180 or VR 360 depending on what my options are. \n\nI own a Canon 90D. \n\nAre there any lenses or attachments that can make this possible?", "link": "https://www.reddit.com/r/canon/comments/hxumhf/filming_for_vr_180_or_vr_360_with_a_canon_90d_how/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "filming for vr 180 or vr 360 with a canon 90d. how to achieve this? /!/ hello, \n\ni've been wanting to start a project where i film various -----> spots !!!  around nyc for use with vr headsets. \n\ni'd like to either do vr 180 or vr 360 depending on what my options are. \n\ni own a canon 90d. \n\nare there any lenses or attachments that can make this possible?", "sortedWord": "None", "identifyer": 50965, "year": "2020"}, {"Unnamed: 0": 304151, "autor": "ViggePro", "date": 1596722524000, "content": "Is this a dead pixel? The camera (eos m50) arrived today and when I put the lens hood on I noticed a blue/purple spot.", "link": "https://www.reddit.com/r/canon/comments/i4sc2r/is_this_a_dead_pixel_the_camera_eos_m50_arrived/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this a dead pixel? the camera (eos m50) arrived today and when i put the lens hood on i noticed a blue/purple -----> spot !!! .", "sortedWord": "None", "identifyer": 51059, "year": "2020"}, {"Unnamed: 0": 304379, "autor": "Tappiocca", "date": 1600365358000, "content": "Canon M6 MKII Autofocus Question /!/ Hello.\nI am using Canon M6 MKII (15-45mm lens at about 18\"-20\" away) to shoot 4K video with and I had a question about auto focus. I am making painting tutorial videos (objects that are between 2\"-3\" tall) with the zoom pulled back and then I use FCPX to zoom into my subject. When I allow the camera to Auto Focus, I am having issues where it keeps switching its focus to my hands/fingers and my subject is being blurred out. I know that I can allow the camera to set its focus and then freeze it on a specific object, but then if I move the subject up or down from that point it will loose focus. Should I be using a Spot or 1-Point Focus, I believe it is generally set for Zone Focus.", "link": "https://www.reddit.com/r/canon/comments/iuooxb/canon_m6_mkii_autofocus_question/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon m6 mkii autofocus question /!/ hello.\ni am using canon m6 mkii (15-45mm lens at about 18\"-20\" away) to shoot 4k video with and i had a question about auto focus. i am making painting tutorial videos (objects that are between 2\"-3\" tall) with the zoom pulled back and then i use fcpx to zoom into my subject. when i allow the camera to auto focus, i am having issues where it keeps switching its focus to my hands/fingers and my subject is being blurred out. i know that i can allow the camera to set its focus and then freeze it on a specific object, but then if i move the subject up or down from that point it will loose focus. should i be using a -----> spot !!!  or 1-point focus, i believe it is generally set for zone focus.", "sortedWord": "None", "identifyer": 51290, "year": "2020"}, {"Unnamed: 0": 304403, "autor": "rroberts3439", "date": 1601224042000, "content": "Using AC adapter with Canon D90 /!/ Ok this is hopefully an easy thing.  I did the searches on Google but came up empty.  \n\nI've been using my D90 more as a good webcam for livestreaming than as a regular camera.  As such, I spent the $150 (Why canon??) to get the AC adapter.  Problem I have is that the camera has a little switch that tells the camera when the battery door is closed.  With the AC adapter in there I cannot close the door?  Is there a setting somewhere or do I need to cut out a spot for the cord so I can close the door with it in it and just buy an extra door when using outside to seal it?\n\nThanks!!!", "link": "https://www.reddit.com/r/canon/comments/j0tzae/using_ac_adapter_with_canon_d90/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "using ac adapter with canon d90 /!/ ok this is hopefully an easy thing.  i did the searches on google but came up empty.  \n\ni've been using my d90 more as a good webcam for livestreaming than as a regular camera.  as such, i spent the $150 (why canon??) to get the ac adapter.  problem i have is that the camera has a little switch that tells the camera when the battery door is closed.  with the ac adapter in there i cannot close the door?  is there a setting somewhere or do i need to cut out a -----> spot !!!  for the cord so i can close the door with it in it and just buy an extra door when using outside to seal it?\n\nthanks!!!", "sortedWord": "None", "identifyer": 51315, "year": "2020"}, {"Unnamed: 0": 304622, "autor": "BubVisuals", "date": 1606176792000, "content": "No matter which lens I use, I am never able to adjust AF speed on the EOS R /!/ For context, I shoot video, mainly with the 1 point AF spot, with a variety of lenses, but mostly Canon L series with the RF adapter.  The focus looks a little too jarringly quick for my liking, but when I try to turn down the speed, I always get the \"lens incompatible\" error.  Does anyone know what could be causing this?  I'm on firmware version 1.7.0 if that helps.  Thanks", "link": "https://www.reddit.com/r/canon/comments/jzu0iq/no_matter_which_lens_i_use_i_am_never_able_to/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "no matter which lens i use, i am never able to adjust af speed on the eos r /!/ for context, i shoot video, mainly with the 1 point af -----> spot !!! , with a variety of lenses, but mostly canon l series with the rf adapter.  the focus looks a little too jarringly quick for my liking, but when i try to turn down the speed, i always get the \"lens incompatible\" error.  does anyone know what could be causing this?  i'm on firmware version 1.7.0 if that helps.  thanks", "sortedWord": "None", "identifyer": 51536, "year": "2020"}, {"Unnamed: 0": 304698, "autor": "dulayhuncho", "date": 1606793974000, "content": "Blurry T4i When I turn off Auto Focus /!/ I have a EOS rebel t4i, when I'm filming videos, I like to turn off auto focus because I'm just sitting in one spot and it keeps going in and out trying to focus, it's not necessary.\n\nWhen I turn off auto focus, it's hit or miss. Sometimes the video is clear, other times it is blurry. How can I ensure that my focus is sharp without using auto focus. Im not moving around, just sitting in one spot.\n\nI think the camera is getting focused, but when I get up to turn off auto focus, it readjusts its focus and gets blurry. Do I need someone to sit there to keep it focused or something?", "link": "https://www.reddit.com/r/canon/comments/k4csto/blurry_t4i_when_i_turn_off_auto_focus/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "blurry t4i when i turn off auto focus /!/ i have a eos rebel t4i, when i'm filming videos, i like to turn off auto focus because i'm just sitting in one -----> spot !!!  and it keeps going in and out trying to focus, it's not necessary.\n\nwhen i turn off auto focus, it's hit or miss. sometimes the video is clear, other times it is blurry. how can i ensure that my focus is sharp without using auto focus. im not moving around, just sitting in one spot.\n\ni think the camera is getting focused, but when i get up to turn off auto focus, it readjusts its focus and gets blurry. do i need someone to sit there to keep it focused or something?", "sortedWord": "None", "identifyer": 51614, "year": "2020"}, {"Unnamed: 0": 304723, "autor": "sirdan74", "date": 1607884115000, "content": "Can YOU Spot the Difference? Canon M50, 90D, EOS R for Photos", "link": "https://www.reddit.com/r/canon/comments/kcfqhi/can_you_spot_the_difference_canon_m50_90d_eos_r/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you -----> spot !!!  the difference? canon m50, 90d, eos r for photos", "sortedWord": "None", "identifyer": 51641, "year": "2020"}, {"Unnamed: 0": 304761, "autor": "slashmelon", "date": 1607726610000, "content": "Thoughts on going all-in on a 35mm f/1.4L II? /!/ Hi all,\n\nCurrently I'm really interested in picking up the EF 35mm f/1.4L II, which is considered by some to be the sharpest (affordable) EF lens out there. It seems to be the perfect sweet spot for what I like to shoot, which is portraits, landscapes and more recently cars.\n\nIt's not cheap though - around $1300 used. I'm trying to justify selling a couple lenses to get a bit closer: my Rokinon 24mm and *maybe* my Sigma 50mm Art. The 35mm falls right in between these two, which is why I'm so tempted. I also have a 135mm f/2L, which could cover some ground for portraits if I lose the 50mm.\n\nWhat do you guys think? Is the 35mm worth betting it all? Reviews I've seen of it claim it's worth every dollar.", "link": "https://www.reddit.com/r/canon/comments/kbd4vc/thoughts_on_going_allin_on_a_35mm_f14l_ii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thoughts on going all-in on a 35mm f/1.4l ii? /!/ hi all,\n\ncurrently i'm really interested in picking up the ef 35mm f/1.4l ii, which is considered by some to be the sharpest (affordable) ef lens out there. it seems to be the perfect sweet -----> spot !!!  for what i like to shoot, which is portraits, landscapes and more recently cars.\n\nit's not cheap though - around $1300 used. i'm trying to justify selling a couple lenses to get a bit closer: my rokinon 24mm and *maybe* my sigma 50mm art. the 35mm falls right in between these two, which is why i'm so tempted. i also have a 135mm f/2l, which could cover some ground for portraits if i lose the 50mm.\n\nwhat do you guys think? is the 35mm worth betting it all? reviews i've seen of it claim it's worth every dollar.", "sortedWord": "None", "identifyer": 51682, "year": "2020"}], "name": "spotcanon2020"}