{"interestingcomments": [{"Unnamed: 0": 54586, "autor": "23Weirdo23", "date": 1573765069000, "content": "Spots showing up on the viewfinder /!/ I’m very new to photography sorry if This is a simple problem but I got spots showing up on the viewfinder but not on pictures So I’m stumped I don’t know what’s going on", "link": "https://www.reddit.com/r/canon/comments/dwfq3p/spots_showing_up_on_the_viewfinder/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!!  showing up on the viewfinder /!/ i’m very new to photography sorry if this is a simple problem but i got spots showing up on the viewfinder but not on pictures so i’m stumped i don’t know what’s going on", "sortedWord": "None", "identifyer": 55974, "year": "2019"}, {"Unnamed: 0": 54612, "autor": "love_10_min_snooze", "date": 1551904110000, "content": "Canon 17-40 f4L with \"schneideritis\". What to do? /!/ Hi all.  My old, trusty Canon 17-40 f4L developed what is known as \"schneideritis\".  This is a condition which happens with old lenses and it's basically little white spots on the black area around the glass.  If you google \"schneideritis\", you will see many images online.\n\nThis does not appear on the glass, it only affects area around the glass and it does not have any impact on image quality.  \n\nI decided to sell this lens, but I don't know what to do now and what do I say to potential buyers.  According to many articles that I read online, this \"condition\" is totally harmless and it affects many old lenses.  \n\nCan I still sell this lens?  Do I need to reduce the price significantly? \n\nI was thinking of replacing this lens with 16-35, but if I can't sell it now, I might as well keep it.  It's still a great lens, no other issues at all.", "link": "https://www.reddit.com/r/canon/comments/ay3i3g/canon_1740_f4l_with_schneideritis_what_to_do/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon 17-40 f4l with \"schneideritis\". what to do? /!/ hi all.  my old, trusty canon 17-40 f4l developed what is known as \"schneideritis\".  this is a condition which happens with old lenses and it's basically little white -----> spots !!!  on the black area around the glass.  if you google \"schneideritis\", you will see many images online.\n\nthis does not appear on the glass, it only affects area around the glass and it does not have any impact on image quality.  \n\ni decided to sell this lens, but i don't know what to do now and what do i say to potential buyers.  according to many articles that i read online, this \"condition\" is totally harmless and it affects many old lenses.  \n\ncan i still sell this lens?  do i need to reduce the price significantly? \n\ni was thinking of replacing this lens with 16-35, but if i can't sell it now, i might as well keep it.  it's still a great lens, no other issues at all.", "sortedWord": "None", "identifyer": 56000, "year": "2019"}, {"Unnamed: 0": 54657, "autor": "TheFoxPhyre", "date": 1551638097000, "content": "Need some Canon EOS 6D Mark II help /!/ A little about what I'm looking for here. I'm looking for the settings comparison for the Canon EOS 6D Mark II. In the two supplied images, the configurations are as follows:\n\n&amp;#x200B;\n\nLeft: \n\nCamera - Nikon D3400 (crop sensor), Fine image quality, large image jpeg, Min Iso 200, auto-servo AF, 3D AF area mode, Matrix metering\n\nLens - AF-S Nikkor 70-200mm f/2.8E FL ED VR, 200 mm zoom, f/2.8 (might be about 4.0 in the picture, can't remember), VR on. \n\nRight:\n\nCamera - Canon EOS 6D Mark II, auto picture style, standard auto lighting optimizer, one-shot AF, Spot AF, Evaluative Metering, Fine/Large image Jpeg.\n\nLens - Canon EF 70-200mm f/2.8 IS II USM, 200 mm zoom, f/2.8 (this was probably about 3.5), Stabilizer mode 1. \n\n&amp;#x200B;\n\nI'm not sure if it's a setting issue or if it's just the lens itself which is causing the extremities blur on the picture on the right. I have since changed the autofocus to AI Servo AF and went to the Zone AF setting. I'm hoping this helps. I won't have a chance to shoot a rugby match before this next Saturday but can try on some random stuff around town. \n\n&amp;#x200B;\n\nAny insight into the Canon camera and lens configuration would be great! Thanks!", "link": "https://www.reddit.com/r/canon/comments/awwwhs/need_some_canon_eos_6d_mark_ii_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need some canon eos 6d mark ii help /!/ a little about what i'm looking for here. i'm looking for the settings comparison for the canon eos 6d mark ii. in the two supplied images, the configurations are as follows:\n\n&amp;#x200b;\n\nleft: \n\ncamera - nikon d3400 (crop sensor), fine image quality, large image jpeg, min iso 200, auto-servo af, 3d af area mode, matrix metering\n\nlens - af-s nikkor 70-200mm f/2.8e fl ed vr, 200 mm zoom, f/2.8 (might be about 4.0 in the picture, can't remember), vr on. \n\nright:\n\ncamera - canon eos 6d mark ii, auto picture style, standard auto lighting optimizer, one-shot af, -----> spot !!!  af, evaluative metering, fine/large image jpeg.\n\nlens - canon ef 70-200mm f/2.8 is ii usm, 200 mm zoom, f/2.8 (this was probably about 3.5), stabilizer mode 1. \n\n&amp;#x200b;\n\ni'm not sure if it's a setting issue or if it's just the lens itself which is causing the extremities blur on the picture on the right. i have since changed the autofocus to ai servo af and went to the zone af setting. i'm hoping this helps. i won't have a chance to shoot a rugby match before this next saturday but can try on some random stuff around town. \n\n&amp;#x200b;\n\nany insight into the canon camera and lens configuration would be great! thanks!", "sortedWord": "None", "identifyer": 56045, "year": "2019"}, {"Unnamed: 0": 54710, "autor": "Bear__Fucker", "date": 1553659982000, "content": "How to get rid of spots on photos? /!/ A lot of my photos are coming out with what appears to be dust or spots on the pictures. [Here](https://imgur.com/q3yfAEp) is an example.  I have a Canon EOS T5 and I primarily use an EFS 10-18mm for landscape and weather photos. I have tried cleaning the mirror and the sensor and the spots still remain. Any ideas of how to fix this issues?", "link": "https://www.reddit.com/r/canon/comments/b5zurf/how_to_get_rid_of_spots_on_photos/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how to get rid of -----> spots !!!  on photos? /!/ a lot of my photos are coming out with what appears to be dust or spots on the pictures. [here](https://imgur.com/q3yfaep) is an example.  i have a canon eos t5 and i primarily use an efs 10-18mm for landscape and weather photos. i have tried cleaning the mirror and the sensor and the spots still remain. any ideas of how to fix this issues?", "sortedWord": "None", "identifyer": 56098, "year": "2019"}, {"Unnamed: 0": 54734, "autor": "ChiliManiac", "date": 1553470024000, "content": "Circle in Spot Metering misaligned? /!/ Took My 5D mark for the other day outside, think I might have damaged my 24-70l vii lens when I slipped on some snow. Don't remembering it hitting that hard, but such is the nature of the glass. In Spot Metering the dot is centered to the top of the circle I see the anti-flicker light flashing in the bottom of the corner even though anti-flicker is off. I have enough gear to register for pro support, pictures still seem to come out fine, I'm not noticing any weird artifacts or other issues but just want other people's thoughts. Thanks in advanced! Possible it's just my focusing screen? ", "link": "https://www.reddit.com/r/canon/comments/b534dt/circle_in_spot_metering_misaligned/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "circle in -----> spot !!!  metering misaligned? /!/ took my 5d mark for the other day outside, think i might have damaged my 24-70l vii lens when i slipped on some snow. don't remembering it hitting that hard, but such is the nature of the glass. in spot metering the dot is centered to the top of the circle i see the anti-flicker light flashing in the bottom of the corner even though anti-flicker is off. i have enough gear to register for pro support, pictures still seem to come out fine, i'm not noticing any weird artifacts or other issues but just want other people's thoughts. thanks in advanced! possible it's just my focusing screen? ", "sortedWord": "None", "identifyer": 56122, "year": "2019"}, {"Unnamed: 0": 54749, "autor": "3enrique", "date": 1553372813000, "content": "Can a sun damaged sensor produce more noise? /!/ I know it's probably a stupid question, I'm being a bit paranoid but I've noticed that after shooting at a sunset, my photos taken the next day seem to have more noise than before. There aren't any spots or dead pixels, just a bit more noise.\n\nAm I being paranoid and it's just a coincidence? ", "link": "https://www.reddit.com/r/canon/comments/b4nthq/can_a_sun_damaged_sensor_produce_more_noise/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "can a sun damaged sensor produce more noise? /!/ i know it's probably a stupid question, i'm being a bit paranoid but i've noticed that after shooting at a sunset, my photos taken the next day seem to have more noise than before. there aren't any -----> spots !!!  or dead pixels, just a bit more noise.\n\nam i being paranoid and it's just a coincidence? ", "sortedWord": "None", "identifyer": 56137, "year": "2019"}, {"Unnamed: 0": 54863, "autor": "xilet", "date": 1550345010000, "content": "Is it worth upgrading right now with the R line out? /!/ I know variants of this question have been popping up on here a good bit, but I wanted to toss this out there if anyone who had worked with some of the canon bodies had opinions on it. \n\n&amp;#x200B;\n\nRight now I am a purely amateur photographer doing a combination of nightclub photography and shooting birds ( I know, about on the opposite ends of needs ). Right now I have a 6D mark1 and a m5 and quite a lot invested in EF glass. \n\nI have been looking at the R and RP and am interested in the RF line, largely due to low light AF results and just overall the improved sensors. I also have been looking at gray market 5D mark IV since those are about to the same price point as the R. \n\nThe points I am currently running into limits of my bodies are: the 6D has a heck of a time keeping focus when people are moving in low light situations, it does a great job when things are static but I pretty much have to exclusively rely on center point focus. Also I think my body may be having a slight focus issues, many shots are coming just slightly out of focus and even with microadjustments I can never seem to quite nail it without doing full manual.  (Happens across a series of lenses, the pictures are still usable just a little fuzzy in spots I wouldn't assume it should be).\n\nWith the M5 it is a nice little body and has certainly helped with nature shots but the final images are not quite as sharp as I would like, there tends to be a good bit of grain if I have to shoot over iso 400 and with larger lenses the tiny body throws the balance off. But honestly I really do like that little camera and would probably keep it for nature shots anyway.\n\nSo, my questions are Is it actually a big enough jump to upgrade now or should I wait for the next set of prosumer bodies to come out? And if changing now would be a decent idea, would going to the R or the 5D be a better option?  I wouldn't need a replacement body to handle both birding as well as low light, but if it could at least be a decent backup for outdoors while replacing the 6D I think it would be worthwhile. \n\n&amp;#x200B;\n\nAs a note, I do very little video so the video limitations are not a big concern for me. \n\n&amp;#x200B;", "link": "https://www.reddit.com/r/canon/comments/arc20v/is_it_worth_upgrading_right_now_with_the_r_line/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is it worth upgrading right now with the r line out? /!/ i know variants of this question have been popping up on here a good bit, but i wanted to toss this out there if anyone who had worked with some of the canon bodies had opinions on it. \n\n&amp;#x200b;\n\nright now i am a purely amateur photographer doing a combination of nightclub photography and shooting birds ( i know, about on the opposite ends of needs ). right now i have a 6d mark1 and a m5 and quite a lot invested in ef glass. \n\ni have been looking at the r and rp and am interested in the rf line, largely due to low light af results and just overall the improved sensors. i also have been looking at gray market 5d mark iv since those are about to the same price point as the r. \n\nthe points i am currently running into limits of my bodies are: the 6d has a heck of a time keeping focus when people are moving in low light situations, it does a great job when things are static but i pretty much have to exclusively rely on center point focus. also i think my body may be having a slight focus issues, many shots are coming just slightly out of focus and even with microadjustments i can never seem to quite nail it without doing full manual.  (happens across a series of lenses, the pictures are still usable just a little fuzzy in -----> spots !!!  i wouldn't assume it should be).\n\nwith the m5 it is a nice little body and has certainly helped with nature shots but the final images are not quite as sharp as i would like, there tends to be a good bit of grain if i have to shoot over iso 400 and with larger lenses the tiny body throws the balance off. but honestly i really do like that little camera and would probably keep it for nature shots anyway.\n\nso, my questions are is it actually a big enough jump to upgrade now or should i wait for the next set of prosumer bodies to come out? and if changing now would be a decent idea, would going to the r or the 5d be a better option?  i wouldn't need a replacement body to handle both birding as well as low light, but if it could at least be a decent backup for outdoors while replacing the 6d i think it would be worthwhile. \n\n&amp;#x200b;\n\nas a note, i do very little video so the video limitations are not a big concern for me. \n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 56251, "year": "2019"}, {"Unnamed: 0": 54934, "autor": "SolanaarMusic", "date": 1554674625000, "content": "Got dust onto my viewfinder prism /!/ I noticed some dots (sharp and unsharp ones) while looking through my viewfinder on my 700D. First I thought it was the sensor but it looked clean. \nSo I thought it must be the mirror and viewfinder. I tried cleaning it with the handblower, but since that didn't do anything I used a q-tip since I saw someone using it in a video guide. \nBut that made everything worse and now the viewfinder looks like my glasses after 1 week without cleaning, everything's dusty and dirty and the spots from the beginning are still there!\n\n\nWhat should I do?", "link": "https://www.reddit.com/r/canon/comments/balqex/got_dust_onto_my_viewfinder_prism/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "got dust onto my viewfinder prism /!/ i noticed some dots (sharp and unsharp ones) while looking through my viewfinder on my 700d. first i thought it was the sensor but it looked clean. \nso i thought it must be the mirror and viewfinder. i tried cleaning it with the handblower, but since that didn't do anything i used a q-tip since i saw someone using it in a video guide. \nbut that made everything worse and now the viewfinder looks like my glasses after 1 week without cleaning, everything's dusty and dirty and the -----> spots !!!  from the beginning are still there!\n\n\nwhat should i do?", "sortedWord": "None", "identifyer": 56322, "year": "2019"}, {"Unnamed: 0": 55071, "autor": "Macca1535", "date": 1546946896000, "content": "Weird black spot on every photo /!/ I just noticed that i have this weird black spot on every photo. This is has nothing to do with my lens because i tested multiple lenses. Is there i way i could remove this. I am using a Canon 600D. Here is a picture.\n\n&amp;#x200B;\n\n![img](ugu4ej9tp6921)", "link": "https://www.reddit.com/r/canon/comments/adtc5z/weird_black_spot_on_every_photo/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird black -----> spot !!!  on every photo /!/ i just noticed that i have this weird black spot on every photo. this is has nothing to do with my lens because i tested multiple lenses. is there i way i could remove this. i am using a canon 600d. here is a picture.\n\n&amp;#x200b;\n\n![img](ugu4ej9tp6921)", "sortedWord": "None", "identifyer": 56461, "year": "2019"}, {"Unnamed: 0": 55211, "autor": "jbwhite99", "date": 1556843418000, "content": "Canon T5i Autofocus slowed to a crawl? /!/ I have a 18-250mm Sigma lens attached to my camera - the camera has worked fine, but over the last week, when I've shot pictures both inside and outside, the autofocus seems to take forever.  The battery is fine, and I'm using a class \"U3\" card.  This happens when shooting video or photos - the photos look fine, but the video - since the focus points change, has some weird spots in the middle.\n\nI've checked the lens seating, I do have a Merkury Optics 62mm glass lens cover...\n\nOS is set to \"on\" and the AF/N is set to \"AF\" \n\nIf anyone has any idea as to why my AF has slowed to a crawl, I would greatly appreciate it - I'd love to take it to the hockey game tomorrow night and actually get faster shots.  Thanks!", "link": "https://www.reddit.com/r/canon/comments/bk29cu/canon_t5i_autofocus_slowed_to_a_crawl/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon t5i autofocus slowed to a crawl? /!/ i have a 18-250mm sigma lens attached to my camera - the camera has worked fine, but over the last week, when i've shot pictures both inside and outside, the autofocus seems to take forever.  the battery is fine, and i'm using a class \"u3\" card.  this happens when shooting video or photos - the photos look fine, but the video - since the focus points change, has some weird -----> spots !!!  in the middle.\n\ni've checked the lens seating, i do have a merkury optics 62mm glass lens cover...\n\nos is set to \"on\" and the af/n is set to \"af\" \n\nif anyone has any idea as to why my af has slowed to a crawl, i would greatly appreciate it - i'd love to take it to the hockey game tomorrow night and actually get faster shots.  thanks!", "sortedWord": "None", "identifyer": 56603, "year": "2019"}, {"Unnamed: 0": 56297, "autor": "dick-penis", "date": 1576768740000, "content": "EOS R Focus Help /!/ I recently purchased an EOS R and I am used to using back button focus. Can someone help me figure out how to get it working. Right now it keep auto focusing when not touching any buttons. Also, can you assign it to do spot focusing with the AF ON button and then eye detection with the star button. Thanks!!!", "link": "https://www.reddit.com/r/canon/comments/ecuka6/eos_r_focus_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "eos r focus help /!/ i recently purchased an eos r and i am used to using back button focus. can someone help me figure out how to get it working. right now it keep auto focusing when not touching any buttons. also, can you assign it to do -----> spot !!!  focusing with the af on button and then eye detection with the star button. thanks!!!", "sortedWord": "None", "identifyer": 57697, "year": "2019"}, {"Unnamed: 0": 56669, "autor": "DoritoCookie", "date": 1550775301000, "content": "Handheld Moon Photography (Process and Equipment Setup Explaination included) /!/ &amp;#x200B;\n\n[The Moon](https://i.redd.it/lcd6lmvkxyh21.jpg)\n\n\\[Equipment/Software Used\\]\n\n  \n\\- Canon 1200D (yes, an entry level Canon APS-C body)\n\n\\- Canon 300mm IS USM \"L\" Mk.I   \n\\- EF EXTENDER 2x  \n\\- EF EXTENDER 1.4x  \n\n\n\\[Setup\\]\n\n&amp;#x200B;\n\nMount both extenders and lens into your body (i'm using a crop body to push my effective focal length to 1344mm, but fullframe would work too if you crop it in post) \n\n&amp;#x200B;\n\n(Process)\n\n&amp;#x200B;\n\nAI SERVO and High Speed Continuous Shooting   \nSPOT metering  \nUsing Manual Mode at f/6.3, 1/500 sec, ISO200  \nRAW file format  \nUsed Digital Photo Professional and adjusted brightness, manually retouched gamma adjustment and cropping before exporting as JPEG", "link": "https://www.reddit.com/r/canon/comments/at6vrb/handheld_moon_photography_process_and_equipment/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "handheld moon photography (process and equipment setup explaination included) /!/ &amp;#x200b;\n\n[the moon](https://i.redd.it/lcd6lmvkxyh21.jpg)\n\n\\[equipment/software used\\]\n\n  \n\\- canon 1200d (yes, an entry level canon aps-c body)\n\n\\- canon 300mm is usm \"l\" mk.i   \n\\- ef extender 2x  \n\\- ef extender 1.4x  \n\n\n\\[setup\\]\n\n&amp;#x200b;\n\nmount both extenders and lens into your body (i'm using a crop body to push my effective focal length to 1344mm, but fullframe would work too if you crop it in post) \n\n&amp;#x200b;\n\n(process)\n\n&amp;#x200b;\n\nai servo and high speed continuous shooting   \n-----> spot !!!  metering  \nusing manual mode at f/6.3, 1/500 sec, iso200  \nraw file format  \nused digital photo professional and adjusted brightness, manually retouched gamma adjustment and cropping before exporting as jpeg", "sortedWord": "None", "identifyer": 58075, "year": "2019"}, {"Unnamed: 0": 56785, "autor": "Pippopotamus", "date": 1549975332000, "content": "Is this something warranty will cover? /!/ I bought my 10-18mm lens back in July of 2018 from the Canon refurbished site.  Well I just recently uploaded my honeymoon pictures from August (should have done that long ago) and a recent vacation and discovered in a lot of my pictures that were taken on my 10-18 have this spot.  It isn't in every picture as I suspect that it is sometimes covered by what I am taking a picture of.  I just cleaned by lens and it is still there.  I also checked my other lenses to make sure that it wasn't the sensor, it seems to be only on this lens.  I added two pictures one from my honeymoon and one from my recent vacation to show that it has been there since I started using the lens, as well as a picture on the lens itself.\n\nI can't see anything on the lens myself, but I am so an amateur and not really sure if I have missed anything.  Now since this is still within the one year limited warranty, I was wondering if this would possibly be covered? If not, is it fixable?  Thanks!!\n\nPictures (Sorry can't figure out how to make an album)\n\n[Pic 1: spot in upper third towards the middle](https://i.imgur.com/QqRFLwP.jpg?1)\n\n[Pic 2: Spot in same spot as pic 1](https://i.imgur.com/44fCIGr.jpg?2)\n\n[Lens from front](https://i.imgur.com/26GGpXF.jpg?1)\n\n[Lens from back](https://i.imgur.com/ZcJrTlb.jpg?2) ", "link": "https://www.reddit.com/r/canon/comments/apsxsw/is_this_something_warranty_will_cover/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this something warranty will cover? /!/ i bought my 10-18mm lens back in july of 2018 from the canon refurbished site.  well i just recently uploaded my honeymoon pictures from august (should have done that long ago) and a recent vacation and discovered in a lot of my pictures that were taken on my 10-18 have this -----> spot !!! .  it isn't in every picture as i suspect that it is sometimes covered by what i am taking a picture of.  i just cleaned by lens and it is still there.  i also checked my other lenses to make sure that it wasn't the sensor, it seems to be only on this lens.  i added two pictures one from my honeymoon and one from my recent vacation to show that it has been there since i started using the lens, as well as a picture on the lens itself.\n\ni can't see anything on the lens myself, but i am so an amateur and not really sure if i have missed anything.  now since this is still within the one year limited warranty, i was wondering if this would possibly be covered? if not, is it fixable?  thanks!!\n\npictures (sorry can't figure out how to make an album)\n\n[pic 1: spot in upper third towards the middle](https://i.imgur.com/qqrflwp.jpg?1)\n\n[pic 2: spot in same spot as pic 1](https://i.imgur.com/44fcigr.jpg?2)\n\n[lens from front](https://i.imgur.com/26ggpxf.jpg?1)\n\n[lens from back](https://i.imgur.com/zcjrtlb.jpg?2) ", "sortedWord": "None", "identifyer": 58191, "year": "2019"}, {"Unnamed: 0": 57083, "autor": "mr-no-name", "date": 1555772443000, "content": "Help! Dust spots show when I take a video, but not when I take a picture. /!/ I have a Canon Rebel T6i and I am trying to take a video, but when it focuses on the clouds, dust spots show on the screen. It doesn’t how up when I take pictures though. I tried cleaning it but they are still showing up. Am I just not cleaning the dust properly?", "link": "https://www.reddit.com/r/canon/comments/bfd2sf/help_dust_spots_show_when_i_take_a_video_but_not/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help! dust -----> spots !!!  show when i take a video, but not when i take a picture. /!/ i have a canon rebel t6i and i am trying to take a video, but when it focuses on the clouds, dust spots show on the screen. it doesn’t how up when i take pictures though. i tried cleaning it but they are still showing up. am i just not cleaning the dust properly?", "sortedWord": "None", "identifyer": 58493, "year": "2019"}, {"Unnamed: 0": 57201, "autor": "RyMarquez5", "date": 1559268349000, "content": "[LOTW] 55-250 STM, Spotted Towhee", "link": "https://www.reddit.com/r/canon/comments/bv1quy/lotw_55250_stm_spotted_towhee/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "[lotw] 55-250 stm, -----> spotted !!!  towhee", "sortedWord": "None", "identifyer": 58611, "year": "2019"}, {"Unnamed: 0": 57405, "autor": "FirstManLostOnMars", "date": 1562073996000, "content": "Someone PLEASE help. These spots are killing me. It’s the camera itself as switching lenses doesn’t change anything. What do I do? Please and thanks.", "link": "https://www.reddit.com/r/canon/comments/c897ne/someone_please_help_these_spots_are_killing_me/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "someone please help. these -----> spots !!!  are killing me. it’s the camera itself as switching lenses doesn’t change anything. what do i do? please and thanks.", "sortedWord": "None", "identifyer": 58817, "year": "2019"}], "name": "spotcanon2019"}