{"interestingcomments": [{"Unnamed: 0": 292397, "autor": "3ther_BunnY", "date": 1635352722000, "content": "EoS (R) and Tamron 150-600mm G2 auto-Focus issue /!/ Hello folks,\n\nThanks to the expensive price tag of Super telephoto Canon RF lenses (if any), I couldn't sell my soul and get one of those hence I settled down with Cheaper and older Tamron SP 150-600mm G2 with EoS R-&gt;RD adaptor from Canon on EOS (R). \nThe AF on EoS R with my Canon EF 17-40L works perfectly fine and rather quick. \nThe Tamron G2 however is a big pain when it comes to focusing. Most of the time at the long end of barrel, that's where I generally prefer to shoot, the AF will either keep hunting forever (15-20 sec). If I set the focus limiter, it doesn't make any significant difference. \nBut more importantly, there are numerous times when the AF simply doesn't work. It's like the AF motor doesn't budge and then out of nowhere it'll eventually focus after maybe 10s or 2min. \n\nI have tried in excellent light conditions. Minimum as well as maximum aperture. AF single point/shoot as well as Services. Tried at different Metering methods (although I use manual exposure pretty much all the time). Also tried different focus points too and manually clicking on the focus point in the screen as well. \nCamera is fairly new and has latest Canon Firmware. The Tamron is having 5x s/n so it should ideally ship with updated firmware from Tamron for EoS R. \n\nMy few questions are:\n-are there EoS R system users out there having same issues ? How bad is it ? \n-I need to check with Tamron ASC to see if they can replace my unit or else issue a refund (very challenging if you're in India). \n-does the usb dock offer any help ?\n-I don't think the autofocus is usable at all unless I pre-focus close enough to the subject. When you do that, it acquires a pretty solid AF and is fast. And that seems the only way to use AF on this lens so far. \n-Is Tamron liable to issue refund/fix ? There has to be an acceptable value of AF in seconds before which they can say that it's usable. I'm sure anything more than 5 seconds is a waste (?). \n\nThanks", "link": "https://www.reddit.com/r/canon/comments/qh0sc8/eos_r_and_tamron_150600mm_g2_autofocus_issue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "eos (r) and tamron 150-600mm g2 auto-focus issue /!/ hello folks,\n\nthanks to the expensive price -----> tag !!!  of super telephoto canon rf lenses (if any), i couldn't sell my soul and get one of those hence i settled down with cheaper and older tamron sp 150-600mm g2 with eos r-&gt;rd adaptor from canon on eos (r). \nthe af on eos r with my canon ef 17-40l works perfectly fine and rather quick. \nthe tamron g2 however is a big pain when it comes to focusing. most of the time at the long end of barrel, that's where i generally prefer to shoot, the af will either keep hunting forever (15-20 sec). if i set the focus limiter, it doesn't make any significant difference. \nbut more importantly, there are numerous times when the af simply doesn't work. it's like the af motor doesn't budge and then out of nowhere it'll eventually focus after maybe 10s or 2min. \n\ni have tried in excellent light conditions. minimum as well as maximum aperture. af single point/shoot as well as services. tried at different metering methods (although i use manual exposure pretty much all the time). also tried different focus points too and manually clicking on the focus point in the screen as well. \ncamera is fairly new and has latest canon firmware. the tamron is having 5x s/n so it should ideally ship with updated firmware from tamron for eos r. \n\nmy few questions are:\n-are there eos r system users out there having same issues ? how bad is it ? \n-i need to check with tamron asc to see if they can replace my unit or else issue a refund (very challenging if you're in india). \n-does the usb dock offer any help ?\n-i don't think the autofocus is usable at all unless i pre-focus close enough to the subject. when you do that, it acquires a pretty solid af and is fast. and that seems the only way to use af on this lens so far. \n-is tamron liable to issue refund/fix ? there has to be an acceptable value of af in seconds before which they can say that it's usable. i'm sure anything more than 5 seconds is a waste (?). \n\nthanks", "sortedWord": "None", "identifyer": 38964, "year": "2021"}, {"Unnamed: 0": 293083, "autor": "tomjkoslo", "date": 1621061292000, "content": "I ordered the Canon RF 15-35mm from Amazon, this is how it arrived. Should I return it? /!/ **Context:**  \n\n\nI recently purchased an EOS R. I professionally work in wedding photography and real estate. This is the first \"L\" series lens that I have purchased. It is a massive milestone in my career, and an incredibly meaningful step forward in acquiring what is necessary for me to be able to capture the quality and standard that is expected from me.  \n\n\nNormally, I buy EVERYTHING that I can from B&amp;H. I live in the tristate area near their super-store, and whenever possible, I conduct my major and important purchases through them directly (and pick-up via in-person if possible).\n\nThis arrived where I am currently staying in Connecticut. I feel compelled to disclose that I have not had the opportunity to inspect the contents personally. Forgive my neuroticism, but I am deeply upset that (despite Amazon being an authorized Canon retailer) my package appears damaged. It seems as if this was recklessly handled, possibly even water damaged based on the label. Literally every corner of the box has some damage.  \n\n\nMy girlfriend who received the package and sent me the picture has told me that the box itself arrived as is (meaning that it did not come packaged in any other additional box (to prevent theft due to high price tag, to protect both the box itself and the contents inside).  \n\n\nI intend on researching insurance policies moving forward with the purchase of \"L\" series lenses, as well as my EOS R, and any additional Canon camera bodies that I consider and purchase moving forward. Due to the pandemic, this is (unless I can find a policy that itemizes and quantifies my gear soon at a reasonable price point), not within my budget. \n\n  \nShould I let this go and take a chance? Or should I return it and wait for a new one that hasn't been abused in transit?\n\nhttps://preview.redd.it/pxuma4rld8z61.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=79b3717cf32d13166233aa1b020c21b28fd795e3", "link": "https://www.reddit.com/r/canon/comments/ncsnan/i_ordered_the_canon_rf_1535mm_from_amazon_this_is/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i ordered the canon rf 15-35mm from amazon, this is how it arrived. should i return it? /!/ **context:**  \n\n\ni recently purchased an eos r. i professionally work in wedding photography and real estate. this is the first \"l\" series lens that i have purchased. it is a massive milestone in my career, and an incredibly meaningful step forward in acquiring what is necessary for me to be able to capture the quality and standard that is expected from me.  \n\n\nnormally, i buy everything that i can from b&amp;h. i live in the tristate area near their super-store, and whenever possible, i conduct my major and important purchases through them directly (and pick-up via in-person if possible).\n\nthis arrived where i am currently staying in connecticut. i feel compelled to disclose that i have not had the opportunity to inspect the contents personally. forgive my neuroticism, but i am deeply upset that (despite amazon being an authorized canon retailer) my package appears damaged. it seems as if this was recklessly handled, possibly even water damaged based on the label. literally every corner of the box has some damage.  \n\n\nmy girlfriend who received the package and sent me the picture has told me that the box itself arrived as is (meaning that it did not come packaged in any other additional box (to prevent theft due to high price -----> tag !!! , to protect both the box itself and the contents inside).  \n\n\ni intend on researching insurance policies moving forward with the purchase of \"l\" series lenses, as well as my eos r, and any additional canon camera bodies that i consider and purchase moving forward. due to the pandemic, this is (unless i can find a policy that itemizes and quantifies my gear soon at a reasonable price point), not within my budget. \n\n  \nshould i let this go and take a chance? or should i return it and wait for a new one that hasn't been abused in transit?\n\nhttps://preview.redd.it/pxuma4rld8z61.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=79b3717cf32d13166233aa1b020c21b28fd795e3", "sortedWord": "None", "identifyer": 39662, "year": "2021"}, {"Unnamed: 0": 293351, "autor": "serige", "date": 1621875050000, "content": "RF 100mm 2.8L macro vs the old EF 100mm 2.8L /!/ I have the EF 100mm 2.8L in my gear box, but given that the RF version is out soon with a not so expensive price tag, I am curious if it is a good idea to sell my old EF to get the RF. \n\nFrom the reviews I have read so far, the RF lens looks great but I haven't seen any comparison between the 2 lenses in term of image quality. The SA control and 1.4x magnification are nice features but that's not the most important thing I am looking at. The native RF mount is also great since I don't the adapter anymore, but the downside is I won't be able to use it if I am on a EOS M camera. Any thought from folks who wanted to upgrade?", "link": "https://www.reddit.com/r/canon/comments/nk2h87/rf_100mm_28l_macro_vs_the_old_ef_100mm_28l/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "rf 100mm 2.8l macro vs the old ef 100mm 2.8l /!/ i have the ef 100mm 2.8l in my gear box, but given that the rf version is out soon with a not so expensive price -----> tag !!! , i am curious if it is a good idea to sell my old ef to get the rf. \n\nfrom the reviews i have read so far, the rf lens looks great but i haven't seen any comparison between the 2 lenses in term of image quality. the sa control and 1.4x magnification are nice features but that's not the most important thing i am looking at. the native rf mount is also great since i don't the adapter anymore, but the downside is i won't be able to use it if i am on a eos m camera. any thought from folks who wanted to upgrade?", "sortedWord": "None", "identifyer": 39942, "year": "2021"}, {"Unnamed: 0": 293579, "autor": "preciouscode96", "date": 1626248754000, "content": "EOS RP and EOS R users, how has your experience in usage and battery life been so far? Is it a big difference compared to my 70D and M50? /!/ As the title says I'm in doubt to upgrade one of my 2 bodies. I'd love to own a full frame next to my 70D. \n\nThe M50 has got the same sensor as the 80D so I'm wondering if I'd see a big (if any) difference when going for an RP or R. \n\nProbably one of my biggest drawbacks is the suggested battery life both cameras have. Although I've seen posts of the EOS R getting around 700 images (which is about my 70D's range). \n\nNext to that I'm not sure if I could justify a €1200+ price tag for a camera that's slightly better than my current gear (if that's the case). Also the RF mount would maybe be an issue. \n\nI capture mostly scenery, close-ups but busy setting up a business for interior and product photography. My current lenses are: canon 70-200 F4L IS, tokina 11-16 f2.8, Sigma 17-50 F2.8, canon 24mm and canon 50mm F1.8. \n\nCurious what you'd say, let me know :)", "link": "https://www.reddit.com/r/canon/comments/ojzhwj/eos_rp_and_eos_r_users_how_has_your_experience_in/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "eos rp and eos r users, how has your experience in usage and battery life been so far? is it a big difference compared to my 70d and m50? /!/ as the title says i'm in doubt to upgrade one of my 2 bodies. i'd love to own a full frame next to my 70d. \n\nthe m50 has got the same sensor as the 80d so i'm wondering if i'd see a big (if any) difference when going for an rp or r. \n\nprobably one of my biggest drawbacks is the suggested battery life both cameras have. although i've seen posts of the eos r getting around 700 images (which is about my 70d's range). \n\nnext to that i'm not sure if i could justify a €1200+ price -----> tag !!!  for a camera that's slightly better than my current gear (if that's the case). also the rf mount would maybe be an issue. \n\ni capture mostly scenery, close-ups but busy setting up a business for interior and product photography. my current lenses are: canon 70-200 f4l is, tokina 11-16 f2.8, sigma 17-50 f2.8, canon 24mm and canon 50mm f1.8. \n\ncurious what you'd say, let me know :)", "sortedWord": "None", "identifyer": 40178, "year": "2021"}, {"Unnamed: 0": 293938, "autor": "photographerguy", "date": 1632242596000, "content": "Canon EF 70-200mm f/2.8 II vs. Canon RF 70-200mm f/4 /!/ Hello!\n\nI'm considering selling my EF 70-200mm f/2.8 II for the buy price of an RF 70-200mm f/4. I've read many reviews and articles and have considered the obvious factors (like losing a stop of light in the aperture, build size, etc.), but I'm not sold on the decision yet.\n\nMy main reason for wanting to switch is size/weight, but I'm afraid I might miss that stop of light shooting events in low light as well as weddings. Reviews of image quality seem to be mixed but generally in favor of the RF f/4 lens being pretty impressive in a small package. The EF is great, and I love it, and I have no complaints about it...but it is HEAVY compared to the RF. I do a lot of run-and-gun, so that's hard to put a price tag on, but I can't afford the RF f/2.8 currently. I'm wondering if the EF f/2.8 will depreciate more until I can afford the RF f/2.8 though, making it harder to get a good sell on that.\n\nShould I hold out with the EF f/2.8 until I can afford the RF f/2.8, or should I sell the EF f/2.8 to buy the RF f/4? All thoughts are welcome!", "link": "https://www.reddit.com/r/canon/comments/psmm0y/canon_ef_70200mm_f28_ii_vs_canon_rf_70200mm_f4/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon ef 70-200mm f/2.8 ii vs. canon rf 70-200mm f/4 /!/ hello!\n\ni'm considering selling my ef 70-200mm f/2.8 ii for the buy price of an rf 70-200mm f/4. i've read many reviews and articles and have considered the obvious factors (like losing a stop of light in the aperture, build size, etc.), but i'm not sold on the decision yet.\n\nmy main reason for wanting to switch is size/weight, but i'm afraid i might miss that stop of light shooting events in low light as well as weddings. reviews of image quality seem to be mixed but generally in favor of the rf f/4 lens being pretty impressive in a small package. the ef is great, and i love it, and i have no complaints about it...but it is heavy compared to the rf. i do a lot of run-and-gun, so that's hard to put a price -----> tag !!!  on, but i can't afford the rf f/2.8 currently. i'm wondering if the ef f/2.8 will depreciate more until i can afford the rf f/2.8 though, making it harder to get a good sell on that.\n\nshould i hold out with the ef f/2.8 until i can afford the rf f/2.8, or should i sell the ef f/2.8 to buy the rf f/4? all thoughts are welcome!", "sortedWord": "None", "identifyer": 40545, "year": "2021"}, {"Unnamed: 0": 294730, "autor": "egyptianstriker11293", "date": 1610049866000, "content": "Almost 6 months with the Canon R5 /!/ It’s almost been 6 months of using my Canon R5 and I think this could help people who are looking to make a purchase or switch to this camera. I’ve used it in the humidity of Charleston, the salty air of Aruba and Jamaica, the cold winters of Washington and Montana, and the long hours of a professional wedding video. The camera is simply amazing when you just go out and create without overthinking the boundaries of the camera itself. \n\nI’ll start with the “negatives” because these would be my only two complaints to canon. And these could easily be fixed in a firmware update.\n\nDid it overheat? Once during the wedding but I learned from it. I learned that I don’t need to shoot 4K HQ for a wedding because the files are simply too large for my hard drives. I learned to be more precise in my shots and not over shoot which saves me time in post. It made me a better videographer. This isn’t crippling like people make it out to be.\n\nYes, the file sizes are large. Large enough that I had some serious issues at the start of owning this camera. I had to create a new workflow and now it isn’t an issue. Once I got accustomed to it, life was easier. But full transparency...my 5k MacBook Pro and Adobe Premier Pro were fighting to handle the files. I have sold my MacBook and acquired the M1 Mac mini which is a beast for the R5. So keep that in mind...This is an additional cost excluding hard drives to store these files.\n\nNow the good:\nIBIS has saved me. I don’t travel with a gimbal anymore (it’s not going to replace your gimbal I just personally don’t need the extra baggage)\n\n8k if you need it. I did a video of me proposing to my girlfriend and this was a shot where I didn’t need 8k but I used it so I can frame the shot later. You never know when you’ll use it\n\n4K 120fps - self explanatory although 4K 60fps is my go to for cinematic videos.\n\nCanon color science and skin tones are so buttery smooth I’ll never get over it.\n\nErgonomics and feel is fantastic for me personally. It’s heavy enough but not too heavy that it’s a burden. Although when you get this thing on a gimbal you’re gonna get a workout.\n\nFuture Proof - I really don’t see myself upgrading this camera for at least 3 years. I would get a c70 type camera before upgrading this.\n\n\nFinal thought: If you’re gonna be picky and complain about the camera itself then the hardware you’re using isn’t the issue. But if you’re looking to enhance and take your art to the next level than I say this with full confidence...don’t think just buy it! The price tag is high I know, but maybe it’ll help you push yourself to get that extra gig or even start making videos or photography for money. \n\nThanks for coming to my Ted talk", "link": "https://www.reddit.com/r/canon/comments/kslf9i/almost_6_months_with_the_canon_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "almost 6 months with the canon r5 /!/ it’s almost been 6 months of using my canon r5 and i think this could help people who are looking to make a purchase or switch to this camera. i’ve used it in the humidity of charleston, the salty air of aruba and jamaica, the cold winters of washington and montana, and the long hours of a professional wedding video. the camera is simply amazing when you just go out and create without overthinking the boundaries of the camera itself. \n\ni’ll start with the “negatives” because these would be my only two complaints to canon. and these could easily be fixed in a firmware update.\n\ndid it overheat? once during the wedding but i learned from it. i learned that i don’t need to shoot 4k hq for a wedding because the files are simply too large for my hard drives. i learned to be more precise in my shots and not over shoot which saves me time in post. it made me a better videographer. this isn’t crippling like people make it out to be.\n\nyes, the file sizes are large. large enough that i had some serious issues at the start of owning this camera. i had to create a new workflow and now it isn’t an issue. once i got accustomed to it, life was easier. but full transparency...my 5k macbook pro and adobe premier pro were fighting to handle the files. i have sold my macbook and acquired the m1 mac mini which is a beast for the r5. so keep that in mind...this is an additional cost excluding hard drives to store these files.\n\nnow the good:\nibis has saved me. i don’t travel with a gimbal anymore (it’s not going to replace your gimbal i just personally don’t need the extra baggage)\n\n8k if you need it. i did a video of me proposing to my girlfriend and this was a shot where i didn’t need 8k but i used it so i can frame the shot later. you never know when you’ll use it\n\n4k 120fps - self explanatory although 4k 60fps is my go to for cinematic videos.\n\ncanon color science and skin tones are so buttery smooth i’ll never get over it.\n\nergonomics and feel is fantastic for me personally. it’s heavy enough but not too heavy that it’s a burden. although when you get this thing on a gimbal you’re gonna get a workout.\n\nfuture proof - i really don’t see myself upgrading this camera for at least 3 years. i would get a c70 type camera before upgrading this.\n\n\nfinal thought: if you’re gonna be picky and complain about the camera itself then the hardware you’re using isn’t the issue. but if you’re looking to enhance and take your art to the next level than i say this with full confidence...don’t think just buy it! the price -----> tag !!!  is high i know, but maybe it’ll help you push yourself to get that extra gig or even start making videos or photography for money. \n\nthanks for coming to my ted talk", "sortedWord": "None", "identifyer": 41348, "year": "2021"}, {"Unnamed: 0": 295770, "autor": "smatthewsphoto", "date": 1624171580000, "content": "What are people using for ultra-wides on RF? /!/ I've not had an ultra-wide (wider than 24mm) on Canon in a decade or so and I'm getting the itch to buy one again for a bit of fun. Ideally 19-21mm, since 20mm is what I always liked most in the past.   \nProblem is the only native RF lenses I can find that go beyond 24mm are the big and expensive 15-35 and the Samyang 14mm. I know recent rumours say a 14-35 f/4L will come soon, but I'm expecting that to also be quite large and expensive, or at least more expensive than I'm willing to spend on a \"just for fun\" lens. There are obviously lots of lenses which can be adapted, but I'm seeing some adapted ultra-wides end up having false colour vignetting on RF.  \n\nSo, what are people using on RF to fill the ultra-wide gap? Same-old EF lenses? Adapting some of those weird Leica wide pancakes? Given the Laowa 'zero distortion' lenses a shot? Or are people just swallowing the L zoom price tag?  \n\nI'm only interested in what people *are actually using* and know first-hand what works.", "link": "https://www.reddit.com/r/canon/comments/o3zhqs/what_are_people_using_for_ultrawides_on_rf/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what are people using for ultra-wides on rf? /!/ i've not had an ultra-wide (wider than 24mm) on canon in a decade or so and i'm getting the itch to buy one again for a bit of fun. ideally 19-21mm, since 20mm is what i always liked most in the past.   \nproblem is the only native rf lenses i can find that go beyond 24mm are the big and expensive 15-35 and the samyang 14mm. i know recent rumours say a 14-35 f/4l will come soon, but i'm expecting that to also be quite large and expensive, or at least more expensive than i'm willing to spend on a \"just for fun\" lens. there are obviously lots of lenses which can be adapted, but i'm seeing some adapted ultra-wides end up having false colour vignetting on rf.  \n\nso, what are people using on rf to fill the ultra-wide gap? same-old ef lenses? adapting some of those weird leica wide pancakes? given the laowa 'zero distortion' lenses a shot? or are people just swallowing the l zoom price -----> tag !!! ?  \n\ni'm only interested in what people *are actually using* and know first-hand what works.", "sortedWord": "None", "identifyer": 42413, "year": "2021"}, {"Unnamed: 0": 295877, "autor": "TheGhostlySheep", "date": 1625664179000, "content": "Canon EF 70-200mm F2.8 III vs F4 II /!/ Does anyone have any experience shooting with these lenses? \n\nI'm looking for a 70-200 and I'm not really sure which one to buy. Based on my research the only major difference in quality between these 2 is the air sphere coating on the F2.8 mIII which helps it shoot into the sun which is a very attractive quality for me as I shoot a lot of dog portraits and dog photos in general and fairly often shoot in the direction of the sun.\n\nNow I can't afford the 2200 GBP price tag on the F2.8 (or used at 1700-1800 GBP) but I found it for 1400 GBP on a gray market retailer. This would not have any warranty under canon but the website offers a 12 month warranty plus a 14 day money back guarantee and has thousands of very positive reviews on websites like trustpilot. However, I'm still sceptical as it still is somewhat risky.\n\nMy question is basically is there a big enough difference between the f2.8 and f4 to warrant taking the risk of buying the f2.8 from a gray market retailer?", "link": "https://www.reddit.com/r/canon/comments/ofisoy/canon_ef_70200mm_f28_iii_vs_f4_ii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon ef 70-200mm f2.8 iii vs f4 ii /!/ does anyone have any experience shooting with these lenses? \n\ni'm looking for a 70-200 and i'm not really sure which one to buy. based on my research the only major difference in quality between these 2 is the air sphere coating on the f2.8 miii which helps it shoot into the sun which is a very attractive quality for me as i shoot a lot of dog portraits and dog photos in general and fairly often shoot in the direction of the sun.\n\nnow i can't afford the 2200 gbp price -----> tag !!!  on the f2.8 (or used at 1700-1800 gbp) but i found it for 1400 gbp on a gray market retailer. this would not have any warranty under canon but the website offers a 12 month warranty plus a 14 day money back guarantee and has thousands of very positive reviews on websites like trustpilot. however, i'm still sceptical as it still is somewhat risky.\n\nmy question is basically is there a big enough difference between the f2.8 and f4 to warrant taking the risk of buying the f2.8 from a gray market retailer?", "sortedWord": "None", "identifyer": 42526, "year": "2021"}, {"Unnamed: 0": 296178, "autor": "habsnkush", "date": 1628961136000, "content": "Hello, I’m trying to identify exactly what type of canon camera this is. Really just trying to put a price tag on the thing but I’m totally lost &amp; I can’t figure it out via Internet. Happy to answer any questions to help out", "link": "https://www.reddit.com/r/canon/comments/p4bzc0/hello_im_trying_to_identify_exactly_what_type_of/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hello, i’m trying to identify exactly what type of canon camera this is. really just trying to put a price -----> tag !!!  on the thing but i’m totally lost &amp; i can’t figure it out via internet. happy to answer any questions to help out", "sortedWord": "None", "identifyer": 42830, "year": "2021"}, {"Unnamed: 0": 297186, "autor": "Deathstrokecph", "date": 1609535725000, "content": "Can't decide between the 32mm or the 22mm for Canon M50 /!/ I'd like to upgrade my kit lens to either the 22mm or the 32mm.  \n  \nRight now I can pick up the 22 for 262 USD and the 32 for 492 USD (25% discount). Prices are steep here in Denmark. Nothing used for sale unfortunately.  \n  \nI primarily wants to use it for talking head YouTube videos, so video is #1 priority and photography is #2.  \n  \nWhat for me is a pro for the 22 is the lower focal length so I have my flexibility in terms of how far away I need it to be and also the price tag of course.  \n  \nPro for the 32 is the lower aperture which I like a lot.  \n  \nAnything I'm missing or what do you guys suggest?", "link": "https://www.reddit.com/r/canon/comments/koj9xn/cant_decide_between_the_32mm_or_the_22mm_for/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "can't decide between the 32mm or the 22mm for canon m50 /!/ i'd like to upgrade my kit lens to either the 22mm or the 32mm.  \n  \nright now i can pick up the 22 for 262 usd and the 32 for 492 usd (25% discount). prices are steep here in denmark. nothing used for sale unfortunately.  \n  \ni primarily wants to use it for talking head youtube videos, so video is #1 priority and photography is #2.  \n  \nwhat for me is a pro for the 22 is the lower focal length so i have my flexibility in terms of how far away i need it to be and also the price -----> tag !!!  of course.  \n  \npro for the 32 is the lower aperture which i like a lot.  \n  \nanything i'm missing or what do you guys suggest?", "sortedWord": "None", "identifyer": 43873, "year": "2021"}], "name": "tagcanon2021"}