{"interestingcomments": [{"Unnamed: 0": 298913, "autor": "rjmcaptures", "date": 1609169904000, "content": "EOS-R 2020 Review - A Wildlife Photographer's Perspective /!/ I just finished my week with an EOS-R rental after some great conversation in here and figured I’d lend my quick impressions in return. I know this isn’t a new camera by any means, but with the new R5/R6 and RF lenses coming to fruition this year, the price-dropped first crack at Canon’s mirrorless system most certainly deserves another look for anyone looking to make the jump. Please note that this review is coming from the perspective of primarily a wild bird photographer, but I put it through the ringer with some products and people this week as well. \n\nOverall, it’s an amazing camera - as I suspected my reaction would be coming from an old T2i. However, there are certainly quirks and pitfalls worth discussing for certain purposes, and ones that make my decision and increasingly hard one. For what it’s worth, it seems Canon heard the chatter on many of these desires designing the R5/R6.\n\n**Ergonomics**\n\nThe first thing I noticed when picking this up is that it far surpassed my expectations for a mirrorless body. Having seen Sonys in the past, I assumed this will be a light, thin, compact body that would result in an awkward center of balance with my telephoto setup. Boy was I wrong! This thing has some good density to it. \n\nThe grip also runs deep, giving a great hand hold when handholding tele shots. I found this even more balanced than my APS-C. The body itself feels very solid, with a beautiful matte finish over a solid, weather sealed magnesium alloy body. \n\nThe articulating screen properly blew my mind my low crouched shots and video, as I suspect any camera from the past 7 years would do as well. High quality build all around.\n\n**Image Quality**\n\nThis is the primary concern of mine, and the 30mp sensor lifted from the 5DIV did not disappoint. Crisp detail, wonderful dynamic range all around. Advantages no doubt of the FF sensor in a (at the time) brand new mirrorless system. As a previous crop sensor shooter, I thoroughly enjoyed the increased framing and bokeh ability for still product shots and portraiture.\n\nVideo was also killer, in my limited test shots with it. The 4K is quite crisp, albeit in my limited experience with filming anything beyond short clips.\n\nThe higher resolution does point out some of the previously hidden flaws in my Teleconverter setup, as well as the need for slightly faster shutter speeds for that desired 100% zoom tack sharpness. More of a catalyst for personal improvement than anything.\n\n**Low Light/High ISO Performance**\n\nAnother win here. I was mindblown at the images I was able to salvage in borderline darkness, as well as how high I could crank the ISO to maintain the fast shutter speeds needed for clear wildlife photos. Even at 10,000 ISO, a full crop photo could take a little denoise in post and be a total keeper. Certainly a game changer.\n\nI did include a photo taken in nearly full darkness at one of the highest ISO settings, just so you can get a feel for that end of things too. Quite noisy/degraded at that point, as can be expected with any camera, but still incredibly useful for pure birding ID shots. Saved me once or twice in trying to get a glimpse at a floating shorebird that the binos and naked eyes could no longer distinguish. \n\n**AF Performance**\n\nHere’s where my glowing review gets a little mixed. I found the AF system overall to be a bit clunky. The touch and drag thumb system while using EVF seemed less than intuitive and ergonomically awkward. I often found myself tripping over my own fingers (and accidentally picking my own nose) trying to get the AF point where I wanted it to be, also often requiring multiple swipes to get across the whole screen. I messed around with both Top Right, Right Side, and even whole screen touch AF for the gamut. I’d say I liked them functionally in that order. I get the intent here was to mimic a joystick, but it seems like an afterthought.\n\nTouch AF in live view is a different story. Lightning fast, great ability to select exact focus points. However, as a wildlife photographer, I am rarely shooting in live view in the field. This was more useful at home testing out shallow depth of field product photography, as well as portraits.\n\nAs far as the actual performance of the AF accuracy, this was also a bit mixed. I felt I had less control over the exact focal point (i used to be able to focus dead on a birds eye much more often with my APS-C setup, despite having fixed focal points) but I am sure this is just a learning curve. I am also shooting on a Teleconverter setup, adapted from EF lenses, so I will not place much of the blame on the camera there. \n\n**Speed**\n\nHere’s the big failgrade on the report card. The continuous burst speed on the R is abysmal. Clocking in at 3fps while tracking in AI Servo, it is on the same level as my decade-old T2i. Granted, the R is buffering image files over twice the size of my old APS-C, but I would expect more in this department for an upper prosumer-tier price tag. I’m not usually a ‘spray and pray’ person, but this is a huge consideration with birds in flight, resulting in a very hard time tracking/framing the birds. This is due to both slow bursts and the pronounced EVF stutter between shots (often referred to as the ‘stop motion effect’).\n\nI still got some keepers, but they were far less than I would expect I’d see with a faster camera like the R6 or 90D for example. Frankly, I might be able to forgive the speed if it weren’t for the EVF stutter making it hard to keep the subject in frame and in-focus.\n\n**EVF**\n\nA common conversation between DSLR folk jumping into mirrorless, but the EVF was a new experience with many positives and negatives. \n\nFirst off, I love the exposure approximation - adds a good layer of control vs, the standard light meter only in OVFs. \n\nThe fluid AF point selections vs the fixed AF points of OVFs certainly takes some getting used to, especially for bird photography. I think the joystick control of the R5 &amp; R6 really takes this to the next level. \n\nI will admit I suffered “EVF headache” while shooting on sunny days - but given more time I’d like to work with the diopter and, hopefully, give my eyes some more time to adapt. \n\nAs I touched on in the AF section, the shot lag is certainly real. Perhaps if the burst was faster I’d notice it less, but at 3fps is quite palpable and disruptive while tracking action.\n\n**Conclusions**\n\nWhere does this leave my final take? The EOS-R is a wonderful camera, now coming in at an even more affordable price point with the release of big brothers R5 &amp; R6. It captures wonderful stills and crisp video. Plus, the native R-mount lens line keeps blossoming. As an all-around camera, this would be a no-brainer at its current price point of $1,599.\n\nIs it a good budget fit for a wildlife photographer looking to switch to mirrorless? The jury is still out for me on that one, and I return my rental joyfully conflicted. \n\nThe loss of crop factor reach with the FF sensor is palpable, meaning an upgrade to this system would also bring about the need for a lens upgrade to go along with it. While aggressive cropping still yielded somewhat impressively usable results, it also yielded low final resolution specs. I have to wonder how the results would compare to the more megapixel-dense performance of the 90D, that would require much less cropping while (theoretically) retaining more detail. More ‘pixels on the bird’ as they say.\n\nThe AF system is clearly the first incarnation of something Canon looks to have moved further toward perfection with the R5/R6. The burst speed is less than satisfactory, leaving anything other than nearby, stationary birds to have a lower hit rate and harder tracking experience. Frankly, if it wasn’t for this factor I would likely bite the bullet and order both this and a new lens tomorrow. It’s just too big of a factor to ignore outright without testing other options.\n\nThe allure of the R5, with the higher MP count and improved speed/AF system, is high. Unfortunately so is the price - and the need for a longer lens still exists for me there.\n\nI think the next (and likely final) research move for me is going to be a quick rental of the 90D to compare the overall experience before making a final decision. The future may certainly be mirrorless, but until the used market starts to get an influx of R5/6 and RF lenses it also remains a cost prohibitive one for specialist/enthusiast use. With the seemingly eminent release of Canons APS-C R-series entry ([the rumored ‘R7’](https://www.techradar.com/news/canon-eos-r7-prototype-rumored-to-be-in-the-wild-ahead-of-2021-launch)) that may also be something to keep an eye on in early to mid 2021.\n\nObviously a review rooted heavily in compatibility with personal needs, but hopefully it provides some value to anyone in a similar consideration set. \n\nCheers folks!", "link": "https://www.reddit.com/r/canon/comments/klsntg/eosr_2020_review_a_wildlife_photographers/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "eos-r 2020 review - a wildlife photographer's perspective /!/ i just finished my week with an eos-r rental after some great conversation in here and figured i’d lend my quick impressions in return. i know this isn’t a new camera by any means, but with the new r5/r6 and rf lenses coming to fruition this year, the price-dropped first crack at canon’s mirrorless system most certainly deserves another look for anyone looking to make the jump. please note that this review is coming from the perspective of primarily a wild bird photographer, but i put it through the ringer with some products and people this week as well. \n\noverall, it’s an amazing camera - as i suspected my reaction would be coming from an old t2i. however, there are certainly quirks and pitfalls worth discussing for certain purposes, and ones that make my decision and increasingly hard one. for what it’s worth, it seems canon heard the chatter on many of these desires designing the r5/r6.\n\n**ergonomics**\n\nthe first thing i noticed when picking this up is that it far surpassed my expectations for a mirrorless body. having seen sonys in the past, i assumed this will be a light, thin, compact body that would result in an awkward center of balance with my telephoto setup. boy was i wrong! this thing has some good density to it. \n\nthe grip also runs deep, giving a great hand hold when handholding tele shots. i found this even more balanced than my aps-c. the body itself feels very solid, with a beautiful matte finish over a solid, weather sealed magnesium alloy body. \n\nthe articulating screen properly blew my mind my low crouched shots and video, as i suspect any camera from the past 7 years would do as well. high quality build all around.\n\n**image quality**\n\nthis is the primary concern of mine, and the 30mp sensor lifted from the 5div did not disappoint. crisp detail, wonderful dynamic range all around. advantages no doubt of the ff sensor in a (at the time) brand new mirrorless system. as a previous crop sensor shooter, i thoroughly enjoyed the increased framing and bokeh ability for still product shots and portraiture.\n\nvideo was also killer, in my limited test shots with it. the 4k is quite crisp, albeit in my limited experience with filming anything beyond short clips.\n\nthe higher resolution does point out some of the previously hidden flaws in my teleconverter setup, as well as the need for slightly faster shutter speeds for that desired 100% zoom tack sharpness. more of a catalyst for personal improvement than anything.\n\n**low light/high iso performance**\n\nanother win here. i was mindblown at the images i was able to salvage in borderline darkness, as well as how high i could crank the iso to maintain the fast shutter speeds needed for clear wildlife photos. even at 10,000 iso, a full crop photo could take a little denoise in post and be a total keeper. certainly a game changer.\n\ni did include a photo taken in nearly full darkness at one of the highest iso settings, just so you can get a feel for that end of things too. quite noisy/degraded at that point, as can be expected with any camera, but still incredibly useful for pure birding id shots. saved me once or twice in trying to get a glimpse at a floating shorebird that the binos and naked eyes could no longer distinguish. \n\n**af performance**\n\nhere’s where my glowing review gets a little mixed. i found the af system overall to be a bit clunky. the touch and drag thumb system while using evf seemed less than intuitive and ergonomically awkward. i often found myself tripping over my own fingers (and accidentally picking my own nose) trying to get the af point where i wanted it to be, also often requiring multiple swipes to get across the whole screen. i messed around with both top right, right side, and even whole screen touch af for the gamut. i’d say i liked them functionally in that order. i get the intent here was to mimic a joystick, but it seems like an afterthought.\n\ntouch af in live view is a different story. lightning fast, great ability to select exact focus points. however, as a wildlife photographer, i am rarely shooting in live view in the field. this was more useful at home testing out shallow depth of field product photography, as well as portraits.\n\nas far as the actual performance of the af accuracy, this was also a bit mixed. i felt i had less control over the exact focal point (i used to be able to focus dead on a birds eye much more often with my aps-c setup, despite having fixed focal points) but i am sure this is just a learning curve. i am also shooting on a teleconverter setup, adapted from ef lenses, so i will not place much of the blame on the camera there. \n\n**speed**\n\nhere’s the big failgrade on the report card. the continuous burst speed on the r is abysmal. clocking in at 3fps while tracking in ai servo, it is on the same level as my decade-old t2i. granted, the r is buffering image files over twice the size of my old aps-c, but i would expect more in this department for an upper prosumer-tier price -----> tag !!! . i’m not usually a ‘spray and pray’ person, but this is a huge consideration with birds in flight, resulting in a very hard time tracking/framing the birds. this is due to both slow bursts and the pronounced evf stutter between shots (often referred to as the ‘stop motion effect’).\n\ni still got some keepers, but they were far less than i would expect i’d see with a faster camera like the r6 or 90d for example. frankly, i might be able to forgive the speed if it weren’t for the evf stutter making it hard to keep the subject in frame and in-focus.\n\n**evf**\n\na common conversation between dslr folk jumping into mirrorless, but the evf was a new experience with many positives and negatives. \n\nfirst off, i love the exposure approximation - adds a good layer of control vs, the standard light meter only in ovfs. \n\nthe fluid af point selections vs the fixed af points of ovfs certainly takes some getting used to, especially for bird photography. i think the joystick control of the r5 &amp; r6 really takes this to the next level. \n\ni will admit i suffered “evf headache” while shooting on sunny days - but given more time i’d like to work with the diopter and, hopefully, give my eyes some more time to adapt. \n\nas i touched on in the af section, the shot lag is certainly real. perhaps if the burst was faster i’d notice it less, but at 3fps is quite palpable and disruptive while tracking action.\n\n**conclusions**\n\nwhere does this leave my final take? the eos-r is a wonderful camera, now coming in at an even more affordable price point with the release of big brothers r5 &amp; r6. it captures wonderful stills and crisp video. plus, the native r-mount lens line keeps blossoming. as an all-around camera, this would be a no-brainer at its current price point of $1,599.\n\nis it a good budget fit for a wildlife photographer looking to switch to mirrorless? the jury is still out for me on that one, and i return my rental joyfully conflicted. \n\nthe loss of crop factor reach with the ff sensor is palpable, meaning an upgrade to this system would also bring about the need for a lens upgrade to go along with it. while aggressive cropping still yielded somewhat impressively usable results, it also yielded low final resolution specs. i have to wonder how the results would compare to the more megapixel-dense performance of the 90d, that would require much less cropping while (theoretically) retaining more detail. more ‘pixels on the bird’ as they say.\n\nthe af system is clearly the first incarnation of something canon looks to have moved further toward perfection with the r5/r6. the burst speed is less than satisfactory, leaving anything other than nearby, stationary birds to have a lower hit rate and harder tracking experience. frankly, if it wasn’t for this factor i would likely bite the bullet and order both this and a new lens tomorrow. it’s just too big of a factor to ignore outright without testing other options.\n\nthe allure of the r5, with the higher mp count and improved speed/af system, is high. unfortunately so is the price - and the need for a longer lens still exists for me there.\n\ni think the next (and likely final) research move for me is going to be a quick rental of the 90d to compare the overall experience before making a final decision. the future may certainly be mirrorless, but until the used market starts to get an influx of r5/6 and rf lenses it also remains a cost prohibitive one for specialist/enthusiast use. with the seemingly eminent release of canons aps-c r-series entry ([the rumored ‘r7’](https://www.techradar.com/news/canon-eos-r7-prototype-rumored-to-be-in-the-wild-ahead-of-2021-launch)) that may also be something to keep an eye on in early to mid 2021.\n\nobviously a review rooted heavily in compatibility with personal needs, but hopefully it provides some value to anyone in a similar consideration set. \n\ncheers folks!", "sortedWord": "None", "identifyer": 45657, "year": "2020"}, {"Unnamed: 0": 299898, "autor": "ironsides1231", "date": 1592877102000, "content": "Trying to choose between canon t7 and m50 /!/ Hi All,\n\nMy girlfriend is interested in getting into photograph so I am trying to set her up with decent \"starter camera\" I know a lot of people hate that term but really what I mean is something she can learn on, isn't super expensive, and is relatively lightweight. I have done a bunch of research and still can't decide what to actually get.\n\nI have narrowed it down to the m50 or the t7, the m50 seems to be a better camera and more lightweight, although I worry slightly about battery life (but I think just having a few spare batteries would solve that pretty easily). It is slightly more expensive than the T7 which is really where my hesitation lies, canon doesn't have a refurbished available with the lens included, and buying them separately is more expensive than buying it together new. There is one on Amazon for $450 or $500 new.\n\nThe T7 specs aren't as good, especially when considering video. I like the longer battery life and the price tag mainly. A refurbished T7 with both the 18-55mm and 75-300mm lenses is only $360 from canon or $450 new. I could also get just the 18-55mm for $320 or $400 respectively.\n\nI think my real question here is whether or not the cheaper price + the extra lens I can get with the T7 is worth it? I like the idea of the 2nd lens to start off with and experiment with and it's hard to beat the price. But with only a few hours of research under my belt I am still unsure just how much better the specs for the m50 really are, what I have read makes it sound like a much better bang for your buck.\n\nI considered the T7i but the price was just more than I was willing to spend. I also considered the SL2 or SL3 but while more comparable, maybe even superior specs to the m50 the price is significantly higher, there is no refurbished with a 2nd lens, and I have the same cons when it comes to size as the T7.\n\nAny feedback would be appreciated.\n\nTLDR: m50 with 15-45mm for $500 or T7 with 18-55mm and 75-300mm refurbished for $360.", "link": "https://www.reddit.com/r/canon/comments/he5mlg/trying_to_choose_between_canon_t7_and_m50/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "trying to choose between canon t7 and m50 /!/ hi all,\n\nmy girlfriend is interested in getting into photograph so i am trying to set her up with decent \"starter camera\" i know a lot of people hate that term but really what i mean is something she can learn on, isn't super expensive, and is relatively lightweight. i have done a bunch of research and still can't decide what to actually get.\n\ni have narrowed it down to the m50 or the t7, the m50 seems to be a better camera and more lightweight, although i worry slightly about battery life (but i think just having a few spare batteries would solve that pretty easily). it is slightly more expensive than the t7 which is really where my hesitation lies, canon doesn't have a refurbished available with the lens included, and buying them separately is more expensive than buying it together new. there is one on amazon for $450 or $500 new.\n\nthe t7 specs aren't as good, especially when considering video. i like the longer battery life and the price -----> tag !!!  mainly. a refurbished t7 with both the 18-55mm and 75-300mm lenses is only $360 from canon or $450 new. i could also get just the 18-55mm for $320 or $400 respectively.\n\ni think my real question here is whether or not the cheaper price + the extra lens i can get with the t7 is worth it? i like the idea of the 2nd lens to start off with and experiment with and it's hard to beat the price. but with only a few hours of research under my belt i am still unsure just how much better the specs for the m50 really are, what i have read makes it sound like a much better bang for your buck.\n\ni considered the t7i but the price was just more than i was willing to spend. i also considered the sl2 or sl3 but while more comparable, maybe even superior specs to the m50 the price is significantly higher, there is no refurbished with a 2nd lens, and i have the same cons when it comes to size as the t7.\n\nany feedback would be appreciated.\n\ntldr: m50 with 15-45mm for $500 or t7 with 18-55mm and 75-300mm refurbished for $360.", "sortedWord": "None", "identifyer": 46685, "year": "2020"}, {"Unnamed: 0": 301571, "autor": "SPER", "date": 1592579870000, "content": "Will there be a Canon T8 and if so, what timeframe will the release be? /!/ I see a lot of information about the T8i, but there is literally nothing when I do a Google search for just the T8.. I assume there will be a T8 but I have no idea.\n\nStill have the T3i and looking to upgrade but the new T7i doesn't look like a big enough upgrade in video quality. And the T8i is a bit more than I'd like to spend so if the T8 gets 4K video with a price tag similar to the T7 then I'll be all over that..", "link": "https://www.reddit.com/r/canon/comments/hc2iul/will_there_be_a_canon_t8_and_if_so_what_timeframe/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "will there be a canon t8 and if so, what timeframe will the release be? /!/ i see a lot of information about the t8i, but there is literally nothing when i do a google search for just the t8.. i assume there will be a t8 but i have no idea.\n\nstill have the t3i and looking to upgrade but the new t7i doesn't look like a big enough upgrade in video quality. and the t8i is a bit more than i'd like to spend so if the t8 gets 4k video with a price -----> tag !!!  similar to the t7 then i'll be all over that..", "sortedWord": "None", "identifyer": 48416, "year": "2020"}], "name": "tagcanon2020"}