{"interestingcomments": [{"Unnamed: 0": 241378, "autor": "cisely138", "date": 1624966034000, "content": "Tool for creating online portfolios! [I just launched it on Product Hunt] /!/ After months of 12-hour workdays, we finally launched on Product Hunt!\n\n[https://www.producthunt.com/posts/identid-me](https://www.producthunt.com/posts/identid-me)\n\nWe all pursue a dream, but achieving it is not an easy task. We have created identid.me to help creatives stand out from the crowd and have the online portfolio that really shows what they are made of. 🚀\n\nFeel free to create your free portfolio and give us your honest opinion to help us improve. 💛\n\nThank you!\n\nPS: Also, I'll be posting through the day how everything is going on and what we learn from all this in this thread: [https://twitter.com/identidme/status/1409771022925053952](https://twitter.com/identidme/status/1409771022925053952)", "link": "https://www.reddit.com/r/Tools/comments/oa6cdb/tool_for_creating_online_portfolios_i_just/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we have created", "selectorShort": "create", "MarkedSent": "tool for creating online portfolios! [i just launched it on product hunt] /!/ after months of 12-hour workdays, we finally launched on product hunt!\n\n[https://www.producthunt.com/posts/identid-me](https://www.producthunt.com/posts/identid-me)\n\nwe all pursue a dream, but achieving it is not an easy task. -----> we !!!  -----> have !!!  -----> created !!!  identid.me to help creatives stand out from the crowd and -----> have !!!  the online portfolio that really shows what they are made of. 🚀\n\nfeel free to create your free portfolio and give us your honest opinion to help us improve. 💛\n\nthank you!\n\nps: also, i'll be posting through the day how everything is going on and what we learn from all this in this thread: [https://twitter.com/identidme/status/1409771022925053952](https://twitter.com/identidme/status/1409771022925053952)", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/oa6cdb/tool_for_creating_online_portfolios_i_just/", "identifyer": 241378, "year": "2021"}, {"Unnamed: 0": 241579, "autor": "mabdullah284", "date": 1613034254000, "content": "I have built a no code app building tool for IoT. /!/ Hey everyone! Today I want to introduce a no-code app building tool I've built for IoT applications. It's called **Canvas**. I took the inspiration from Blynk and solved the limitation in it by building it as an app layer on [Grandeur](https://grandeur.tech/) backend.\n\nThis is how it works:\n\nYou program your hardware with the SDK of Grandeur. Then you can login to [Canvas](https://canvas.grandeur.tech/) and drag and drop widgets (like buttons and displays) to build a layout. You can bind these widgets with your device variables, so you can change and monitor the value of a variable and build the hardware logic around it. This way, you can focus on prototyping your hardware without spending time on coding apps.\n\nI made a tutorial on how to use it. Check it out on hackster:\n\n[https://www.hackster.io/team-grandeur/introducing-grandeur-canvas-92b090](https://www.hackster.io/team-grandeur/introducing-grandeur-canvas-92b090)\n\nSince it is based on Grandeur, when you are done with prototyping, you can use the app SDKs of Grandeur to code your own app in JS or React.\n\nIt's inspired from Blynk but unlike Blynk,\n\n😎 Canvas is limitless. Create unlimited layouts; add as many widgets as you want.\n\n🌐 It is entirely browser-based. You can share your layouts to external testers and they won't need to install anything.\n\n💵 You can use it in commercial applications.\n\n💯 When ready, you can build your custom app and reliably scale. Your hardware code will seamlessly work with your custom app.\n\nThis project is still in an early phase and there are only four widgets available at this stage. But I am working on adding graph, table and few other widgets. Let me know what you want to see in it. Any feedback is appreciated.", "link": "https://www.reddit.com/r/Tools/comments/lhgsud/i_have_built_a_no_code_app_building_tool_for_iot/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "i have built a no code app building tool for iot. /!/ hey everyone! today i want to introduce a no-code app building tool i've built for iot applications. it's called **canvas**. i took the inspiration from blynk and solved the limitation in it by building it as an app layer on [grandeur](https://grandeur.tech/) backend.\n\nthis is how it works:\n\nyou program your hardware with the sdk of grandeur. then you can login to [canvas](https://canvas.grandeur.tech/) and drag and drop widgets (like buttons and displays) to build a layout. you can bind these widgets with your device variables, so you can change and monitor the value of a variable and build the hardware logic around it. this way, you can focus on prototyping your hardware without spending time on coding apps.\n\ni made a tutorial on how to use it. check it out on hackster:\n\n[https://www.hackster.io/team-grandeur/introducing-grandeur-canvas-92b090](https://www.hackster.io/team-grandeur/introducing-grandeur-canvas-92b090)\n\nsince it is based on grandeur, when you are done with prototyping, you can use the app sdks of grandeur to code your own app in js or react.\n\nit's inspired from blynk but unlike blynk,\n\n😎 canvas is limitless. -----> create !!!  unlimited layouts; add as many widgets as you want.\n\n🌐 it is entirely browser-based. you can share your layouts to external testers and they won't need to install anything.\n\n💵 you can use it in commercial applications.\n\n💯 when ready, you can build your custom app and reliably scale. your hardware code will seamlessly work with your custom app.\n\nthis project is still in an early phase and there are only four widgets available at this stage. but i am working on adding graph, table and few other widgets. let me know what you want to see in it. any feedback is appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/lhgsud/i_have_built_a_no_code_app_building_tool_for_iot/", "identifyer": 241579, "year": "2021"}, {"Unnamed: 0": 243352, "autor": "CarmenDCork", "date": 1617879406000, "content": "Create exact genetic copies of your best fruit trees with this grafting tool", "link": "https://www.reddit.com/r/Tools/comments/mmp8vh/create_exact_genetic_copies_of_your_best_fruit/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  exact genetic copies of your best fruit trees with this grafting tool", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "link", "medialink": "https://i.imgur.com/e9s3bhT.gifv", "identifyer": 243352, "year": "2021"}, {"Unnamed: 0": 250624, "autor": "Fer_Sa", "date": 1627056150000, "content": "Are you looking for video tools? /!/ I want to share a set of [video tools](https://wideo.co/video-tools/) that we created to simplify the video creation process.\n\nIt covers different stages of the creation process and attacks different content needs ranging from marketing to internal communication.\n\nWhat do you think of these tools? Is there a tool that we are not considering that would be really useful for you?\n\n&amp;#x200B;\n\n*Processing video 5acit1bmjzc71...*\n\nThanks!", "link": "https://www.reddit.com/r/Tools/comments/oq5gbv/are_you_looking_for_video_tools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we created", "selectorShort": "create", "MarkedSent": "are you looking for video tools? /!/ i want to share a set of [video tools](https://wideo.co/video-tools/) that -----> we !!!  -----> created !!!  to simplify the video creation process.\n\nit covers different stages of the creation process and attacks different content needs ranging from marketing to internal communication.\n\nwhat do you think of these tools? is there a tool that we are not considering that would be really useful for you?\n\n&amp;#x200b;\n\n*processing video 5acit1bmjzc71...*\n\nthanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/oq5gbv/are_you_looking_for_video_tools/", "identifyer": 250624, "year": "2021"}, {"Unnamed: 0": 253501, "autor": "JulianCrisp", "date": 1628413336000, "content": "A quick thanks / appreciation /!/ Hey everyone, I hope you are all doing well during these crazy times. The last couple of years haven't been easy on any of us but I'm so thankful that we all have something in common and something we love to share.. Tools.\n\n\nTools are more than objects we use to manipulate other objects, they're items we grow to love, enjoy and appreciate. Items that inspire us to create and share ideas with each other. Tools are what separate us from the animals. \n\n\nI'd like to thank everyone for your support, helpful tips + tricks, opinions and for sharing your experiences. I'd like to thank the creator of the subreddit for creating it, and the mods for managing it and of course, your upvotes 😁 . I'm a firm believer that this is the best subreddit ever made. It is by far my favourite place on the internet to hang out.. Even if it's cost me some money over the years. Totally worth it. \n\n\nBut most importantly, thanks to all the members or r/tools. You lot have helped me with purchasing decisions, general enquiries and showed me tools I could never have dreamed of using, let alone owning. You've inspired me to built, sort, organise and buy quality over quantity. Thanks for being you, Reddit.\n\n\nI'd like to formally apply to be a mod on this sub. You mods can check out my posts history on my profile. If I don't fit the bill, thats okay too. I'm proud to be apart of such a great, informative and supportive community.\n\n\nMuch love r/tools, much love.\nThanks.", "link": "https://www.reddit.com/r/Tools/comments/p0bd9n/a_quick_thanks_appreciation/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us to create", "selectorShort": "create", "MarkedSent": "a quick thanks / appreciation /!/ hey everyone, i hope you are all doing well during these crazy times. the last couple of years haven't been easy on any of us but i'm so thankful that we all have something in common and something we love to share.. tools.\n\n\ntools are more than objects we use to manipulate other objects, they're items we grow to love, enjoy and appreciate. items that inspire -----> us !!!  -----> to !!!  -----> create !!!  and share ideas with each other. tools are what separate us from the animals. \n\n\ni'd like to thank everyone for your support, helpful tips + tricks, opinions and for sharing your experiences. i'd like to thank the creator of the subreddit for creating it, and the mods for managing it and of course, your upvotes 😁 . i'm a firm believer that this is the best subreddit ever made. it is by far my favourite place on the internet to hang out.. even if it's cost me some money over the years. totally worth it. \n\n\nbut most importantly, thanks to all the members or r/tools. you lot have helped me with purchasing decisions, general enquiries and showed me tools i could never have dreamed of using, let alone owning. you've inspired me to built, sort, organise and buy quality over quantity. thanks for being you, reddit.\n\n\ni'd like to formally apply to be a mod on this sub. you mods can check out my posts history on my profile. if i don't fit the bill, thats okay too. i'm proud to be apart of such a great, informative and supportive community.\n\n\nmuch love r/tools, much love.\nthanks.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/p0bd9n/a_quick_thanks_appreciation/", "identifyer": 253501, "year": "2021"}], "name": "createTools2021"}