{"interestingcomments": [{"Unnamed: 0": 388312, "autor": "[deleted]", "date": 1595241229000, "content": "Create exact genetic copies of your best fruit trees with this grafting tool /!/ [deleted]", "link": "https://www.reddit.com/r/Tools/comments/huj0lz/create_exact_genetic_copies_of_your_best_fruit/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  exact genetic copies of your best fruit trees with this grafting tool /!/ [deleted]", "sortedWord": "None", "removed": "deleted", "score": 3, "comments": 2, "media": null, "medialink": "https://i.imgur.com/PCINNNR.gifv", "identifyer": 388312, "year": "2020"}, {"Unnamed: 0": 388597, "autor": "Decisionsota", "date": 1598454239000, "content": "Politics on r/tools /!/ (For the rest of the world sick of hearing about American politics...sorry...again...)\n\n**TL;DR: No politics. A sticker in the background won't get you banned but...be smart. If someone posts/says something political, LET IT GO. If a post violates the no-politics rule, report it to the mods.**\n\nAlright, folks, we're in full campaign mode for the US presidency which is likely to prompt a lot of political discussions from both sides.  Over the past year, we've discussed how we'll handle political discussions and a consistent theme is **\"the focus of this sub should be on the tools.\"** That stance allows us to create a place where people from anywhere in the world can escape the partisan rhetoric and come together about something.  We will also be welcoming of anyone, regardless of age or experience.  It's great that DIYers or people looking to buy gifts for loved ones can come here and ask advice from our experienced community, and we don't want to compromise that by making anyone (on any side of the aisle) to feel unwelcome.\n\nSo, what is/is not allowed? It's a bit grey, because we don't want to come down with an absolute ban on everything that might possibly be remotely related to politics, and we understand that people put stickers on things. \n\n**Okay:** No political content\n\n**Probably Okay:** A picture of your toolbox covered in stickers, including a handful of political stickers\n\n**Not Okay, Temp Ban:** Closeup of a Political Yard Sign with a hammer \"look I used a hammer to put up this sign\", 85% of the picture is a sticker/flag/sign with some vaguely tool-related content\n\n**Not Okay, Permanent Ban:** Stickers/flags supporting genocide/known hate groups/swastikas/Nazi flags\n\n&amp;#x200B;\n\n**FAQ:**\n\n1. **\"I'm not sure if my** ***ELECT JOE TIGER KING*** **sticker will get me banned or start a war in the comments. What should I do?\"** Is it possible to shoot the photo somewhere else? Move the frame a bit.  Put something in front of the sticker. Crop the photo. The easiest solution is to just keep the political content off the sub.\n2. **\"I saw somebody put something on their post and I disagree with it, because that sticker supports a Bad Person.\"** Cool.  You have two good options at your disposal. First, you can downvote the post.  Second, report the post.\n3. **\"Number 2 wasn't a question. I thought this was FAQ.\"** Turns out #3 isn't a question either. You're smart, you'll figure it out either way.\n4. **\"I reported the blurry** ***ELECT PROF DOOFENSHMIRTZ*** **sticker on the back of someone's truck and you didn't take it down.\"** Yeah, because the focus of the photo was clearly them welding in their driveway and they probably didn't even realize the sticker was in the frame. Get over yourself.\n5. **\"But I just HAAAVE to comment and tell them that their candidate is leading us down the wrong path.\"** Not here you don't. There are subreddits for whatever political view you have (and wow, are there some crazy views out there!) but you can discuss there, in r/somesubthatisntrtools.\n6. **\"I was just telling OTHER people that they were wrong. They started it. Can I be unbanned?\"** Yeah...this is kind of like the scene in those movies where a fight starts in a bar and the sherriff just arrests everyone (\"BOTH SIDES!!\") and throws them all in the slammer together. If you responded, you still broke the no-politics rule. The mod team isn't going to trace back who started what.\n7. **\"But my argument had citations and was grounded in facts.\"** Wonderful, go back in time and you'd win your high school debate tournament. Still banned.\n8. **\"Don't you agree with me?\"** Maybe I do, maybe I don't. Banned.\n9. **\"But what about...BOTH SIDES?!\"** Aaaaaand banned.\n10. **\"Why won't this sub take a stand on this issue? You have a responsibility to take a stand.\"** People occasionally come to this sub for advice on life-threatening topics, like electrical issues. We can best help people if we stay neutral. This is also an international sub, so many of the issues need to be addressed with considerations for local culture, etc. A stand/position here may not work in another country. As mods, we are vocal/active/engaged in our communities elsewhere (other subs/offline/etc).\n11. **\"What one piece of advice would you give posters?\"** Take two seconds, see if you can keep any political content out of it.\n12. **\"What would you tell commenters?\"** See something you dislike/disagree with? Report. Downvote. Move on with your life.\n13. **\"You mods suck.\"** Reddit probably won't fire us from this unpaid job.", "link": "https://www.reddit.com/r/Tools/comments/ih0gft/politics_on_rtools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us to create", "selectorShort": "create", "MarkedSent": "politics on r/tools /!/ (for the rest of the world sick of hearing about american politics...sorry...again...)\n\n**tl;dr: no politics. a sticker in the background won't get you banned but...be smart. if someone posts/says something political, let it go. if a post violates the no-politics rule, report it to the mods.**\n\nalright, folks, we're in full campaign mode for the us presidency which is likely to prompt a lot of political discussions from both sides.  over the past year, we've discussed how we'll handle political discussions and a consistent theme is **\"the focus of this sub should be on the tools.\"** that stance allows -----> us !!!  -----> to !!!  -----> create !!!  a place where people from anywhere in the world can escape the partisan rhetoric and come together about something.  we will also be welcoming of anyone, regardless of age or experience.  it's great that diyers or people looking to buy gifts for loved ones can come here and ask advice from our experienced community, and we don't want to compromise that by making anyone (on any side of the aisle) to feel unwelcome.\n\nso, what is/is not allowed? it's a bit grey, because we don't want to come down with an absolute ban on everything that might possibly be remotely related to politics, and we understand that people put stickers on things. \n\n**okay:** no political content\n\n**probably okay:** a picture of your toolbox covered in stickers, including a handful of political stickers\n\n**not okay, temp ban:** closeup of a political yard sign with a hammer \"look i used a hammer to put up this sign\", 85% of the picture is a sticker/flag/sign with some vaguely tool-related content\n\n**not okay, permanent ban:** stickers/flags supporting genocide/known hate groups/swastikas/nazi flags\n\n&amp;#x200b;\n\n**faq:**\n\n1. **\"i'm not sure if my** ***elect joe tiger king*** **sticker will get me banned or start a war in the comments. what should i do?\"** is it possible to shoot the photo somewhere else? move the frame a bit.  put something in front of the sticker. crop the photo. the easiest solution is to just keep the political content off the sub.\n2. **\"i saw somebody put something on their post and i disagree with it, because that sticker supports a bad person.\"** cool.  you have two good options at your disposal. first, you can downvote the post.  second, report the post.\n3. **\"number 2 wasn't a question. i thought this was faq.\"** turns out #3 isn't a question either. you're smart, you'll figure it out either way.\n4. **\"i reported the blurry** ***elect prof doofenshmirtz*** **sticker on the back of someone's truck and you didn't take it down.\"** yeah, because the focus of the photo was clearly them welding in their driveway and they probably didn't even realize the sticker was in the frame. get over yourself.\n5. **\"but i just haaave to comment and tell them that their candidate is leading us down the wrong path.\"** not here you don't. there are subreddits for whatever political view you have (and wow, are there some crazy views out there!) but you can discuss there, in r/somesubthatisntrtools.\n6. **\"i was just telling other people that they were wrong. they started it. can i be unbanned?\"** yeah...this is kind of like the scene in those movies where a fight starts in a bar and the sherriff just arrests everyone (\"both sides!!\") and throws them all in the slammer together. if you responded, you still broke the no-politics rule. the mod team isn't going to trace back who started what.\n7. **\"but my argument had citations and was grounded in facts.\"** wonderful, go back in time and you'd win your high school debate tournament. still banned.\n8. **\"don't you agree with me?\"** maybe i do, maybe i don't. banned.\n9. **\"but what about...both sides?!\"** aaaaaand banned.\n10. **\"why won't this sub take a stand on this issue? you have a responsibility to take a stand.\"** people occasionally come to this sub for advice on life-threatening topics, like electrical issues. we can best help people if we stay neutral. this is also an international sub, so many of the issues need to be addressed with considerations for local culture, etc. a stand/position here may not work in another country. as mods, we are vocal/active/engaged in our communities elsewhere (other subs/offline/etc).\n11. **\"what one piece of advice would you give posters?\"** take two seconds, see if you can keep any political content out of it.\n12. **\"what would you tell commenters?\"** see something you dislike/disagree with? report. downvote. move on with your life.\n13. **\"you mods suck.\"** reddit probably won't fire us from this unpaid job.", "sortedWord": "None", "removed": null, "score": 1, "comments": 81, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/ih0gft/politics_on_rtools/", "identifyer": 388597, "year": "2020"}], "name": "createTools2020"}