{"interestingcomments": [{"Unnamed: 0": 382753, "autor": "r0hi7", "date": 1599313356000, "content": "A tool to security scan your Docker /!/ Docker runtime analysis or scanning is a tedious and repetitive job. At times there are configuration issues which got missed during  assessment and cause serious issues in production.   \nThere exists lot of  Docker image analysis tools in market but there is no free and Open  source solution to scan the run time behavior for Dockers.     \nDockerENT :  https://github.com/r0hi7/DockerENT  \nDockerENT is a step towards Docker runtime analysis scanning, designed  to keep in mind the simplicity, usability and extensibility.  It is active runtime application security scanning Tool (RAST tool) and  framework which is plug-gable and written in #**python**(Hacker's language). Developed by the security guy for security community.   #docker #security #redteam #cybersecurity", "link": "https://www.reddit.com/r/Tools/comments/in1b8q/a_tool_to_security_scan_your_docker/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "a tool to security scan your docker /!/ docker runtime analysis or scanning is a tedious and repetitive job. at times there are configuration issues which got missed during  assessment and cause serious issues in production.   \nthere exists lot of  docker image analysis tools in market but there is no free and open  source solution to scan the run time behavior for dockers.     \ndockerent :  https://github.com/r0hi7/dockerent  \ndockerent is a step towards docker runtime analysis scanning, designed  to keep in mind the simplicity, usability and extensibility.  it is active runtime application security scanning tool (rast tool) and  framework which is plug-gable and written in #**python**(hacker's language). -----> developed !!!  by the security guy for security community.   #docker #security #redteam #cybersecurity", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/in1b8q/a_tool_to_security_scan_your_docker/", "identifyer": 382753, "year": "2020"}, {"Unnamed: 0": 383005, "autor": "DeltaReader", "date": 1598609055000, "content": "Suggestions for a step between crap and a proper tool chest? /!/ I have this spot in my slowly developing workshop that's currently being wasted. I have a work desk against the wall, and a space between it and the shelves against a perpendicular wall. It's currently occupied by a cheap plastic two bin thing that maybe fills 60% of the horizontal space. I need something to fill the spot that would actually be useful. The space itself is ~25-26 in wide. I'm planning on eventually getting a proper tool chest for the space, but I'm wondering if there's a cheaper alternative for the time being.", "link": "https://www.reddit.com/r/Tools/comments/ii4d2x/suggestions_for_a_step_between_crap_and_a_proper/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "my slowly developing", "selectorShort": "develop", "MarkedSent": "suggestions for a step between crap and a proper tool chest? /!/ i have this spot in -----> my !!!  -----> slowly !!!  -----> developing !!!  workshop that's currently being wasted. i have a work desk against the wall, and a space between it and the shelves against a perpendicular wall. it's currently occupied by a cheap plastic two bin thing that maybe fills 60% of the horizontal space. i need something to fill the spot that would actually be useful. the space itself is ~25-26 in wide. i'm planning on eventually getting a proper tool chest for the space, but i'm wondering if there's a cheaper alternative for the time being.", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/ii4d2x/suggestions_for_a_step_between_crap_and_a_proper/", "identifyer": 383005, "year": "2020"}], "name": "developTools2020"}