{"interestingcomments": [{"Unnamed: 0": 375837, "autor": "Gunny-Guy", "date": 1601153754000, "content": "I'm looking for a tool for a specific job. I dont know what I need though /!/ Where i work we make parts from standardised thickness aluminium (5083) sheet from from usually 20mm and thiner.\n\nWe are cutting larger sheets manually with a bandsaw into blanks that can then be machined (we have several Haas millers).\n\nWhat tool, if any, can we use to cut the sheets quicker as we've concluded that the bandsaw seems to be where we are wasting a lot of time.\n\nWe tried a large guillotine but it warps the plates beyond what we can use.\n\nAny ideas would be greatly appreciated.", "link": "https://www.reddit.com/r/Tools/comments/j0doln/im_looking_for_a_tool_for_a_specific_job_i_dont/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "i'm looking for a tool for a specific job. i dont know what i need though /!/ where i work -----> we !!!  -----> make !!!  parts from standardised thickness aluminium (5083) sheet from from usually 20mm and thiner.\n\nwe are cutting larger sheets manually with a bandsaw into blanks that can then be machined (we have several haas millers).\n\nwhat tool, if any, can we use to cut the sheets quicker as we've concluded that the bandsaw seems to be where we are wasting a lot of time.\n\nwe tried a large guillotine but it warps the plates beyond what we can use.\n\nany ideas would be greatly appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/j0doln/im_looking_for_a_tool_for_a_specific_job_i_dont/", "identifyer": 375837, "year": "2020"}, {"Unnamed: 0": 378053, "autor": "HiSPL", "date": 1597249813000, "content": "Air or battery power tools? /!/ My Father In Law passed away two years ago. He was an aircraft mechanic and as such had quite the collection of tools. We are moving the MIL to our city this week and I’m going through the garage to see what we keep and what we sell. \n\nI am an avid car mechanic/flipper/hot rodder. The SnapOn taco cart is definitely coming home with me! \n\nBut where I’m conflicted is with the power tools. He was set up for all air tools. And he has some nice ones! Drills, die grinders, sanders, all sorts. \n\nNowadays it seems like most folks are using lithium battery tools for these jobs. Milwaukee, dewalt, etc, they make just about everything you would need to replace these air tools. \n\nMy question is, would you make the switch to battery or keep the air? Why? \n\nFwiw, all these air tools are snapon or US made ingersall rand. Not cheap stuff. If I move to battery it will probably be Milwaukee. \n\nLet me know what you think!", "link": "https://www.reddit.com/r/Tools/comments/i8gwxx/air_or_battery_power_tools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "air or battery power tools? /!/ my father in law passed away two years ago. he was an aircraft mechanic and as such had quite the collection of tools. we are moving the mil to our city this week and i’m going through the garage to see what we keep and what we sell. \n\ni am an avid car mechanic/flipper/hot rodder. the snapon taco cart is definitely coming home with me! \n\nbut where i’m conflicted is with the power tools. he was set up for all air tools. and he has some nice ones! drills, die grinders, sanders, all sorts. \n\nnowadays it seems like most folks are using lithium battery tools for these jobs. milwaukee, dewalt, etc, they make just about everything you would need to replace these air tools. \n\nmy question is, would you make the switch to battery or keep the air? why? \n\nfwiw, all these air tools are snapon or -----> us !!!  -----> made !!!  ingersall rand. not cheap stuff. if i move to battery it will probably be milwaukee. \n\nlet me know what you think!", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/i8gwxx/air_or_battery_power_tools/", "identifyer": 378053, "year": "2020"}, {"Unnamed: 0": 379550, "autor": "FiresideFarmRI", "date": 1594743106000, "content": "Portable Miter Saw Stand with Stop Block Fence /!/ Hey Guys, \n\nI just recently started woodworking and making signs with my wife on Etsy. I am making a ton of signs and we make our frames as well and I am making the same cuts over and over again. I was wondering if anyone knows of any tools to easily add a stop block fence to a Ryobi miter saw and or buy a portable stand with that included on it. I am looking to spend $100 on this just so I am not cutting on the floor and I can easily measure and cut a ton of pieces of wood. Any help would be awesome as I am stumped on this solution.", "link": "https://www.reddit.com/r/Tools/comments/hr4d2b/portable_miter_saw_stand_with_stop_block_fence/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "portable miter saw stand with stop block fence /!/ hey guys, \n\ni just recently started woodworking and making signs with my wife on etsy. i am making a ton of signs and -----> we !!!  -----> make !!!  our frames as well and i am making the same cuts over and over again. i was wondering if anyone knows of any tools to easily add a stop block fence to a ryobi miter saw and or buy a portable stand with that included on it. i am looking to spend $100 on this just so i am not cutting on the floor and i can easily measure and cut a ton of pieces of wood. any help would be awesome as i am stumped on this solution.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/hr4d2b/portable_miter_saw_stand_with_stop_block_fence/", "identifyer": 379550, "year": "2020"}, {"Unnamed: 0": 383809, "autor": "zipperzapper", "date": 1602083036000, "content": "Adjustable Wrench brands and buying advice /!/ I’ve been envious of my dad’s set of old US made Crescent brand adjustable wrenches so I’ve been on the lookout for some for my own kit. Local offerings are either Stanley, China made Crescent or generic Chinese brands, so not a lot of options and I wanted a bit more longevity and better quality. Online shows a bit more promising ones:\n\n*Gedore\n*Ega-Master\n*Bahco\n*Facom\n*Klein\n\nAnyone have any experiences with the above brands? Also if you know where these brands get their Adj. wrenches made, I’d like to know too.", "link": "https://www.reddit.com/r/Tools/comments/j6sguk/adjustable_wrench_brands_and_buying_advice/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "adjustable wrench brands and buying advice /!/ i’ve been envious of my dad’s set of old -----> us !!!  -----> made !!!  crescent brand adjustable wrenches so i’ve been on the lookout for some for my own kit. local offerings are either stanley, china made crescent or generic chinese brands, so not a lot of options and i wanted a bit more longevity and better quality. online shows a bit more promising ones:\n\n*gedore\n*ega-master\n*bahco\n*facom\n*klein\n\nanyone have any experiences with the above brands? also if you know where these brands get their adj. wrenches made, i’d like to know too.", "sortedWord": "None", "removed": null, "score": 1, "comments": 16, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/j6sguk/adjustable_wrench_brands_and_buying_advice/", "identifyer": 383809, "year": "2020"}, {"Unnamed: 0": 384879, "autor": "KnownAsHalo", "date": 1608616310000, "content": "Tekton Tools Warranty Audit - Canadian Edition /!/ &gt;If your tool doesn't work like it should, let us know and we'll make it right. We ship replacement parts within the United States and Canada.  \n&gt;  \n&gt;No time limit, No receipts required.\n\nThis is the theory. It doesn’t always work in practice. Especially for Canadians, who know that cross border complicates everything twofold - You want that replacement ratchet? No problem sir. Where should I ship it? Canada? Okay, shipping will be 2x the tool price, and theres no guarantee it will arrive this century. Great dealing with you.\n\nBefore buying my first Tekton tools off Amazon, I was a little apprehensive. Check on Reddit, check on Youtube, it's always hard to find consistent information - especially with an up and coming brand. Rave reviews one post up from a customer service horror story and you can see why we stick with brands we know and trust. \n\nSince picking up that first tool and seeing the quality and finish, I've bought many more off Tekton. All excellent. Robust and simple, yet always do the job elegantly. You won't mistake them for Snap-On bling, but Blue-Point? Maybe. Slowly, I started to appreciate the brand and take them at their word. Still though was always missing that one piece - warranty. It seemed too good to be true for such and entry level price. Finally, I got a chance to test it and wanted to share with you guys how it went. But simply - very well. \n\nI broke the 1/2 reducer. Make no mistake, I was giving her the what-for. Rusted lug-bolt to 17mm 3/8  socket to 1/2 reducer to 1/2 breaker to long zeus bar to me. Sometimes the proper shit is just too far to reach, but in that equation either the bolt is gonna give or the reducer. It wasn't the bolt. Well shit. Hop on Tekton warranty submission site. Two photos and a 3 word description. Monday morning I get an email letting me know a new one has been shipped. Week later [it shows up at my door](https://imgur.com/OZMiJsI). 10/10. Remember, I bought it off Amazon under a different name. I have an account thats never purchased any tools from them directly, no attached card or address. As far as they know I stole it. Nevertheless no questions asked and prompt, polite service. \n\nNo company will ever be able to give 100% positive service, but by god they're certainly trying. \n\nAnyone else have stories about Tekton? Positive or negative would be cool to see how you guys perceive them and condense the answers into a single thread. Bless up and stay safe out there 🙌", "link": "https://www.reddit.com/r/Tools/comments/khzbfj/tekton_tools_warranty_audit_canadian_edition/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we'll make", "selectorShort": "make", "MarkedSent": "tekton tools warranty audit - canadian edition /!/ &gt;if your tool doesn't work like it should, let us know and -----> we !!! -----> 'll !!!  -----> make !!!  it right. we ship replacement parts within the united states and canada.  \n&gt;  \n&gt;no time limit, no receipts required.\n\nthis is the theory. it doesn’t always work in practice. especially for canadians, who know that cross border complicates everything twofold - you want that replacement ratchet? no problem sir. where should i ship it? canada? okay, shipping will be 2x the tool price, and theres no guarantee it will arrive this century. great dealing with you.\n\nbefore buying my first tekton tools off amazon, i was a little apprehensive. check on reddit, check on youtube, it's always hard to find consistent information - especially with an up and coming brand. rave reviews one post up from a customer service horror story and you can see why we stick with brands we know and trust. \n\nsince picking up that first tool and seeing the quality and finish, i've bought many more off tekton. all excellent. robust and simple, yet always do the job elegantly. you won't mistake them for snap-on bling, but blue-point? maybe. slowly, i started to appreciate the brand and take them at their word. still though was always missing that one piece - warranty. it seemed too good to be true for such and entry level price. finally, i got a chance to test it and wanted to share with you guys how it went. but simply - very well. \n\ni broke the 1/2 reducer. make no mistake, i was giving her the what-for. rusted lug-bolt to 17mm 3/8  socket to 1/2 reducer to 1/2 breaker to long zeus bar to me. sometimes the proper shit is just too far to reach, but in that equation either the bolt is gonna give or the reducer. it wasn't the bolt. well shit. hop on tekton warranty submission site. two photos and a 3 word description. monday morning i get an email letting me know a new one has been shipped. week later [it shows up at my door](https://imgur.com/ozmijsi). 10/10. remember, i bought it off amazon under a different name. i have an account thats never purchased any tools from them directly, no attached card or address. as far as they know i stole it. nevertheless no questions asked and prompt, polite service. \n\nno company will ever be able to give 100% positive service, but by god they're certainly trying. \n\nanyone else have stories about tekton? positive or negative would be cool to see how you guys perceive them and condense the answers into a single thread. bless up and stay safe out there 🙌", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/khzbfj/tekton_tools_warranty_audit_canadian_edition/", "identifyer": 384879, "year": "2020"}, {"Unnamed: 0": 387672, "autor": "jafinch78", "date": 1607089723000, "content": "Service or Repair Manuals or Diagram for Hilti TE52 /!/ Just received the reply back from Hilti for my request for a Service or Repair Manual or Exploded Part Diagram.   Anyone happen to have a copy they're willing to share or part with, or know of a source that is?  \n\n\n\" We no longer have the schematic for the tool we stopped making in 1991 - and Hilti will carry parts for 20 years normally so I am sorry we do not have any parts for the tool.  I have the manual but you stated you had that- might check with a local tool repair in your area they may be able to assist you \"", "link": "https://www.reddit.com/r/Tools/comments/k6l74t/service_or_repair_manuals_or_diagram_for_hilti/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we stopped making", "selectorShort": "make", "MarkedSent": "service or repair manuals or diagram for hilti te52 /!/ just received the reply back from hilti for my request for a service or repair manual or exploded part diagram.   anyone happen to have a copy they're willing to share or part with, or know of a source that is?  \n\n\n\" -----> we !!!  no longer have the schematic for the tool -----> we !!!  -----> stopped !!!  -----> making !!!  in 1991 - and hilti will carry parts for 20 years normally so i am sorry -----> we !!!  do not have any parts for the tool.  i have the manual but you stated you had that- might check with a local tool repair in your area they may be able to assist you \"", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/k6l74t/service_or_repair_manuals_or_diagram_for_hilti/", "identifyer": 387672, "year": "2020"}, {"Unnamed: 0": 390345, "autor": "Lolzdecap", "date": 1589080408000, "content": "[Recommendation Request] Adjustable Wrench or Alternatives /!/ Name or type of tool: Adjustable Wrench\n\nBrief description of job: I work as an Audio Visual Tech and one of the main tools in my industry is an adjustable wrench.\n\nUsage Level:  \nPro I will need to use it everyday for work\n\nNeeds:  \nAdjustable Wrench or something similar that can fasten/unfasten nuts, wingnuts, and the like.   \nTetherable - I work on catwalks, lifts, and scaffolding so I tether all my gear for safety\n\nWants:  \nDecent textured grips are a plus.  \nBrushed/non-shiny surface.  \nAny additional features that don't take away from the main purpose of the tool.  \nUS made would be cool but not very important.\n\nBudget:  \nAround $70 USD\n\nCountry/region:  \nUnited States\n\nFeel free to ask me any questions. I'm also looking for a better lighting wrench but that may be a bit too unique.", "link": "https://www.reddit.com/r/Tools/comments/ggtsu5/recommendation_request_adjustable_wrench_or/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "[recommendation request] adjustable wrench or alternatives /!/ name or type of tool: adjustable wrench\n\nbrief description of job: i work as an audio visual tech and one of the main tools in my industry is an adjustable wrench.\n\nusage level:  \npro i will need to use it everyday for work\n\nneeds:  \nadjustable wrench or something similar that can fasten/unfasten nuts, wingnuts, and the like.   \ntetherable - i work on catwalks, lifts, and scaffolding so i tether all my gear for safety\n\nwants:  \ndecent textured grips are a plus.  \nbrushed/non-shiny surface.  \nany additional features that don't take away from the main purpose of the tool.  \n-----> us !!!  -----> made !!!  would be cool but not very important.\n\nbudget:  \naround $70 usd\n\ncountry/region:  \nunited states\n\nfeel free to ask me any questions. i'm also looking for a better lighting wrench but that may be a bit too unique.", "sortedWord": "None", "removed": null, "score": 1, "comments": 21, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/ggtsu5/recommendation_request_adjustable_wrench_or/", "identifyer": 390345, "year": "2020"}], "name": "makeTools2020"}