{"interestingcomments": [{"Unnamed: 0": 378317, "autor": "ski_guy_wr", "date": 1587846977000, "content": "3d print for hire? /!/ Hey /r/tools!\n\nDoes anyone of websites where you can commission 3d printed parts? MY Ridgid cordless hand vac has a broken latch and they don't sell that part. I was thinking it might not be too expensive to hire someone to make it?\n\nAny ideas?", "link": "https://www.reddit.com/r/Tools/comments/g80u54/3d_print_for_hire/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> print !!!  for hire? /!/ hey /r/tools!\n\ndoes anyone of websites where you can commission 3d printed parts? my ridgid cordless hand vac has a broken latch and they don't sell that part. i was thinking it might not be too expensive to hire someone to make it?\n\nany ideas?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/g80u54/3d_print_for_hire/", "identifyer": 378317, "year": "2020"}, {"Unnamed: 0": 378321, "autor": "FickleEMP", "date": 1587844103000, "content": "Just finished 3D printing a tool holder for my home work space. Definitely has helped with keeping it tidy.", "link": "https://www.reddit.com/r/Tools/comments/g800mr/just_finished_3d_printing_a_tool_holder_for_my/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": "just finished -----> 3d !!!  -----> printing !!!  a tool holder for my home work space. definitely has helped with keeping it tidy.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "image", "medialink": "https://i.redd.it/unm05708q0v41.jpg", "identifyer": 378321, "year": "2020"}, {"Unnamed: 0": 379906, "autor": "CactusConnoisseur", "date": 1603549700000, "content": "[Tool Upgrade] Designed and 3D printed a bit holder for my impact drill. Took a few tries but I'm happy with it.", "link": "https://www.reddit.com/r/Tools/comments/jh9u6l/tool_upgrade_designed_and_3d_printed_a_bit_holder/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "[tool upgrade] designed and -----> 3d !!!  -----> printed !!!  a bit holder for my impact drill. took a few tries but i'm happy with it.", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/gallery/jh9u6l", "identifyer": 379906, "year": "2020"}, {"Unnamed: 0": 380093, "autor": "Seth_Altobelli", "date": 1605132309000, "content": "I made these awesome custom 3D printed pegboard tool holders! /!/ [removed]", "link": "https://www.reddit.com/r/Tools/comments/jshl2x/i_made_these_awesome_custom_3d_printed_pegboard/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i made these awesome custom -----> 3d !!!  -----> printed !!!  pegboard tool holders! /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/jshl2x/i_made_these_awesome_custom_3d_printed_pegboard/", "identifyer": 380093, "year": "2020"}, {"Unnamed: 0": 380154, "autor": "along_for_the_ride11", "date": 1605050691000, "content": "Anyone else love ridgid tools but occasionally need a ryobi one+ beater tool? 3d print yourself an adapter!", "link": "https://www.reddit.com/r/Tools/comments/jrw8h2/anyone_else_love_ridgid_tools_but_occasionally/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "anyone else love ridgid tools but occasionally need a ryobi one+ beater tool? -----> 3d !!!  -----> print !!!  yourself an adapter!", "sortedWord": "None", "removed": null, "score": 1, "comments": 50, "media": "image", "medialink": "https://i.redd.it/9f9howb5yhy51.jpg", "identifyer": 380154, "year": "2020"}, {"Unnamed: 0": 380335, "autor": "TNTinRoundRock", "date": 1577909673000, "content": "Does anyone here make / 3D print a clip for drills &amp; drivers to hold multiple bits ? /!/ I'd love to get 2 or 3 of those to fit my drivers to hold 3 or 4 bits on the tool.  Any of y'all make / sell those or can direct me where to buy them online ?", "link": "https://www.reddit.com/r/Tools/comments/ein3nw/does_anyone_here_make_3d_print_a_clip_for_drills/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "does anyone here make / -----> 3d !!!  -----> print !!!  a clip for drills &amp; drivers to hold multiple bits ? /!/ i'd love to get 2 or 3 of those to fit my drivers to hold 3 or 4 bits on the tool.  any of y'all make / sell those or can direct me where to buy them online ?", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/ein3nw/does_anyone_here_make_3d_print_a_clip_for_drills/", "identifyer": 380335, "year": "2020"}, {"Unnamed: 0": 381421, "autor": "zazuaza", "date": 1588097169000, "content": "Which is the best/ longest lasting 20v lithium battery? /!/ Hi, I have a mix of tools from Hitachi and Black &amp; Decker. My Hitachi set uses the older Lithium batteries that are no longer available OEM. I wanted to get an adapter 3d printed that would allow me to use my newer Black and Decker 20v 2.0AH batteries on the Hitachi.\n\nBefore going ahead, I wanted to check with you all if one battery system is better then the other. Are Milwaukee, Makita better than Dewalt or Black and Decker. Ideally, I would like to use one set of batteries across all my equipment without breaking the bank.\n\nMy Hitachi tools are Ds18dfl drill, cr18dl reciprocating saw and the c18dl circular saw. These are for generic homeowner DIY stuff.\n\nThanks!", "link": "https://www.reddit.com/r/Tools/comments/g9s7me/which_is_the_best_longest_lasting_20v_lithium/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "which is the best/ longest lasting 20v lithium battery? /!/ hi, i have a mix of tools from hitachi and black &amp; decker. my hitachi set uses the older lithium batteries that are no longer available oem. i wanted to get an adapter -----> 3d !!!  -----> printed !!!  that would allow me to use my newer black and decker 20v 2.0ah batteries on the hitachi.\n\nbefore going ahead, i wanted to check with you all if one battery system is better then the other. are milwaukee, makita better than dewalt or black and decker. ideally, i would like to use one set of batteries across all my equipment without breaking the bank.\n\nmy hitachi tools are ds18dfl drill, cr18dl reciprocating saw and the c18dl circular saw. these are for generic homeowner diy stuff.\n\nthanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/g9s7me/which_is_the_best_longest_lasting_20v_lithium/", "identifyer": 381421, "year": "2020"}, {"Unnamed: 0": 384569, "autor": "Schrottibaer", "date": 1601487778000, "content": "Help me buying tools (and is a multitool useful?) /!/ Hello everyone,\n\nI need some help. I'm trying to get more into woodworking with my so far limited experience, but besides a handy Bosch PSR 14.4 LI combi drill I have no power tools available anymore since my jigsaw died just recently. \n\nSo far I would prefer going for battery driven brushless tools as the electrics in my apartment can't be trusted too much (no RCD, long and quite thin cables, only those neat little fuses that burn through) and I can probably only work outside on my big balcony anyway. \n\nAs I am from Germany brands such as Milwaukee, which seems to be a popular choice here, are more expensive than even Makita at times, thus I would probably go for Bosch or Makita in hopes for having them with me over the next couple of years. At first I thought about going for cheaper power tools, but going for better quality ones and buying them a tad more slowly might be the better option after all. After all I'm currently doing my vocational training, meaning that I earn some money and am able to have quite some money left at the end of the month, but my budget for one big buy is limited.\n\nHowever, my main questions are: What do I actually need? My first project would be a smaller one, building a prototype for a foot pedal for gaming (no, not racing games, but for a disabled friend who has troubles using her left hand and loves to play shooter games), mostly out of wood I can get from bulk garbage. We might try 3D printing the casing later on, but this is the cheapest option for prototyping. Don't worry, the software and soldering is in progress and seems to be working for now. Now I am missing the tools for this job and the next ones. \n\nI have planned to puchase a jigsaw first, maybe together with a multi tool if it's of any use at all. We have one at work, seemed useful for a couple of application, no idea if it actually is or if it might be just a waste of money compared to buying the real thing for its various applications. The next one might be a hand-held circular saw or a compound miter saw? What to buy after that? (for smaller projects a table saw might be overkill and currently I don't have enough room in my basement to store it there and get it up whenever I need it. I can cut bigger plates to smaller ones at a hardware store around though. Costs like 1€ per cut).\n\nThanks for whatever your answers might be from a young guy, trying to learn to build stuff himself. Maybe in the long run a desk and some outside furniture as well :-)", "link": "https://www.reddit.com/r/Tools/comments/j2qvym/help_me_buying_tools_and_is_a_multitool_useful/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": "help me buying tools (and is a multitool useful?) /!/ hello everyone,\n\ni need some help. i'm trying to get more into woodworking with my so far limited experience, but besides a handy bosch psr 14.4 li combi drill i have no power tools available anymore since my jigsaw died just recently. \n\nso far i would prefer going for battery driven brushless tools as the electrics in my apartment can't be trusted too much (no rcd, long and quite thin cables, only those neat little fuses that burn through) and i can probably only work outside on my big balcony anyway. \n\nas i am from germany brands such as milwaukee, which seems to be a popular choice here, are more expensive than even makita at times, thus i would probably go for bosch or makita in hopes for having them with me over the next couple of years. at first i thought about going for cheaper power tools, but going for better quality ones and buying them a tad more slowly might be the better option after all. after all i'm currently doing my vocational training, meaning that i earn some money and am able to have quite some money left at the end of the month, but my budget for one big buy is limited.\n\nhowever, my main questions are: what do i actually need? my first project would be a smaller one, building a prototype for a foot pedal for gaming (no, not racing games, but for a disabled friend who has troubles using her left hand and loves to play shooter games), mostly out of wood i can get from bulk garbage. we might try -----> 3d !!!  -----> printing !!!  the casing later on, but this is the cheapest option for prototyping. don't worry, the software and soldering is in progress and seems to be working for now. now i am missing the tools for this job and the next ones. \n\ni have planned to puchase a jigsaw first, maybe together with a multi tool if it's of any use at all. we have one at work, seemed useful for a couple of application, no idea if it actually is or if it might be just a waste of money compared to buying the real thing for its various applications. the next one might be a hand-held circular saw or a compound miter saw? what to buy after that? (for smaller projects a table saw might be overkill and currently i don't have enough room in my basement to store it there and get it up whenever i need it. i can cut bigger plates to smaller ones at a hardware store around though. costs like 1€ per cut).\n\nthanks for whatever your answers might be from a young guy, trying to learn to build stuff himself. maybe in the long run a desk and some outside furniture as well :-)", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/j2qvym/help_me_buying_tools_and_is_a_multitool_useful/", "identifyer": 384569, "year": "2020"}, {"Unnamed: 0": 385301, "autor": "nvldnm", "date": 1594350208000, "content": "joiner joints /!/ i picked up a cheap Wood Master Multi-tool 6\" joiner. Think shopsmith, but maybe better and from the 80s. It came with a sander too, which i already made an ugly base for and hooked up a treadmill motor. Still on the functional prototype for that, but the joiner is still on the conceptual part. I am going to use a 1.5 hp 3450 RPM motor to run it, but I don't know what pulley ratio to use. Anyone have an idea what the knives should run at? There are four knives and the cutter diameter is 3-4\". if that is necessary info i can figure out how to measure. \n\nfurthermore, these things use weird measurements. The slot for the sander miter gauge is ever so slightly smaller than a standard 3/4 slot. The drive spindle for the joiner is .67\". That most closely relates to 43/64. WTH. I can't find a pulley with that bore diameter. I could have one machined, but I'm a raging cheap ass and I would hate to corrupt this tool, which was super cheap, with some damn expensive part. I could 3d print it. I'm thinking PLA won't cut it but I could swing some nylon since I'm sure I'll use it again. Thoughts?\n\nhttps://preview.redd.it/v4tdhc0q3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=8a6259da24b17e71afe6315f3a3ed0cff25ee149\n\n&amp;#x200B;\n\nhttps://preview.redd.it/97xbkc2u3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=99303dd61f89ec5a19ecd465a91006ae5152cad7\n\n&amp;#x200B;\n\n[motor](https://preview.redd.it/jv86zorv3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=b955b47ff0168bd3fc3ad382d00070cc80d9410d)\n\n&amp;#x200B;\n\n[motor pulley](https://preview.redd.it/pfa43rtw3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=b7847513c81d3733265ff04db73ab995005a7ef0)\n\n&amp;#x200B;\n\n[original spindle thingy](https://preview.redd.it/2q55a7804y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=cd709f9e1b6877f909ef116f7642833a403ff3b4)", "link": "https://www.reddit.com/r/Tools/comments/hoha8u/joiner_joints/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "joiner joints /!/ i picked up a cheap wood master multi-tool 6\" joiner. think shopsmith, but maybe better and from the 80s. it came with a sander too, which i already made an ugly base for and hooked up a treadmill motor. still on the functional prototype for that, but the joiner is still on the conceptual part. i am going to use a 1.5 hp 3450 rpm motor to run it, but i don't know what pulley ratio to use. anyone have an idea what the knives should run at? there are four knives and the cutter diameter is 3-4\". if that is necessary info i can figure out how to measure. \n\nfurthermore, these things use weird measurements. the slot for the sander miter gauge is ever so slightly smaller than a standard 3/4 slot. the drive spindle for the joiner is .67\". that most closely relates to 43/64. wth. i can't find a pulley with that bore diameter. i could have one machined, but i'm a raging cheap ass and i would hate to corrupt this tool, which was super cheap, with some damn expensive part. i could -----> 3d !!!  -----> print !!!  it. i'm thinking pla won't cut it but i could swing some nylon since i'm sure i'll use it again. thoughts?\n\nhttps://preview.redd.it/v4tdhc0q3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=8a6259da24b17e71afe6315f3a3ed0cff25ee149\n\n&amp;#x200b;\n\nhttps://preview.redd.it/97xbkc2u3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=99303dd61f89ec5a19ecd465a91006ae5152cad7\n\n&amp;#x200b;\n\n[motor](https://preview.redd.it/jv86zorv3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=b955b47ff0168bd3fc3ad382d00070cc80d9410d)\n\n&amp;#x200b;\n\n[motor pulley](https://preview.redd.it/pfa43rtw3y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=b7847513c81d3733265ff04db73ab995005a7ef0)\n\n&amp;#x200b;\n\n[original spindle thingy](https://preview.redd.it/2q55a7804y951.jpg?width=4656&amp;format=pjpg&amp;auto=webp&amp;s=cd709f9e1b6877f909ef116f7642833a403ff3b4)", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/hoha8u/joiner_joints/", "identifyer": 385301, "year": "2020"}, {"Unnamed: 0": 385745, "autor": "svideo", "date": 1605042868000, "content": "New Tool Organization Month - Custom 3D printed tool hangers", "link": "https://www.reddit.com/r/Tools/comments/jrtrs5/new_tool_organization_month_custom_3d_printed/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "new tool organization month - custom -----> 3d !!!  -----> printed !!!  tool hangers", "sortedWord": "None", "removed": null, "score": 1, "comments": 57, "media": "image", "medialink": "https://i.imgur.com/wKGVfd3.jpg", "identifyer": 385745, "year": "2020"}, {"Unnamed: 0": 386789, "autor": "randino41", "date": 1605703705000, "content": "Bosch 12v Pocket Clip /!/ I have 2 Bosch 12v tools.  A PS41 and PS21.  (Impact and drill) Both lack any sort of pocket or belt clip.  I couldn't find anything commercially available or available from a maker that met my needs.  I remixed a design I found online and 3d printed clips that attach to the battery.  They can be found here https://www.thingiverse.com/thing:4654739 if you're interested.  Any questions, let me know.", "link": "https://www.reddit.com/r/Tools/comments/jwf6dk/bosch_12v_pocket_clip/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "bosch 12v pocket clip /!/ i have 2 bosch 12v tools.  a ps41 and ps21.  (impact and drill) both lack any sort of pocket or belt clip.  i couldn't find anything commercially available or available from a maker that met my needs.  i remixed a design i found online and -----> 3d !!!  -----> printed !!!  clips that attach to the battery.  they can be found here https://www.thingiverse.com/thing:4654739 if you're interested.  any questions, let me know.", "sortedWord": "None", "removed": null, "score": 2, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/jwf6dk/bosch_12v_pocket_clip/", "identifyer": 386789, "year": "2020"}, {"Unnamed: 0": 387993, "autor": "GioDude_", "date": 1591117319000, "content": "I 3D printed a holder for my most misplaced tools. Link in the comments.", "link": "https://www.reddit.com/r/Tools/comments/gvb4ft/i_3d_printed_a_holder_for_my_most_misplaced_tools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i -----> 3d !!!  -----> printed !!!  a holder for my most misplaced tools. link in the comments.", "sortedWord": "None", "removed": null, "score": 2, "comments": 6, "media": "image", "medialink": "https://i.redd.it/sxdbflcu2j251.jpg", "identifyer": 387993, "year": "2020"}, {"Unnamed: 0": 390913, "autor": "ack154", "date": 1606865143000, "content": "Decided to upload a version of my 3D printed wrench organizers /!/ You'll find the STL [here](https://www.thingiverse.com/thing:4671870).\n\nA lot of you have probably seen these and I've gotten numerous messages to share the STL but have been a bit reluctant to do so. I made a couple minor changes to the version I'm using and published this updated version if people want it.\n\nFor reference, you can see mine in use here: https://i.imgur.com/ntAyIKo.jpg", "link": "https://www.reddit.com/r/Tools/comments/k4ww5k/decided_to_upload_a_version_of_my_3d_printed/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "decided to upload a version of my -----> 3d !!!  -----> printed !!!  wrench organizers /!/ you'll find the stl [here](https://www.thingiverse.com/thing:4671870).\n\na lot of you have probably seen these and i've gotten numerous messages to share the stl but have been a bit reluctant to do so. i made a couple minor changes to the version i'm using and published this updated version if people want it.\n\nfor reference, you can see mine in use here: https://i.imgur.com/ntayiko.jpg", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/k4ww5k/decided_to_upload_a_version_of_my_3d_printed/", "identifyer": 390913, "year": "2020"}, {"Unnamed: 0": 391307, "autor": "WhiteStripesWS6", "date": 1596053903000, "content": "Storing batteries in the hot garage? /!/ I live in the desert where temps routinely make my garage 120+ F in the summer time. I’ve always kept my cordless tool batteries stored in the house as a result since historically heat and batteries do not get along. For modern cordless tools with li-ion batteries though is this less of an issue than I’m believing it is? Would like to 3D print a battery holder to mount on my bench in the future and was thinking maybe it’s not a great idea. \n\nThanks y’all.", "link": "https://www.reddit.com/r/Tools/comments/i07v8f/storing_batteries_in_the_hot_garage/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "storing batteries in the hot garage? /!/ i live in the desert where temps routinely make my garage 120+ f in the summer time. i’ve always kept my cordless tool batteries stored in the house as a result since historically heat and batteries do not get along. for modern cordless tools with li-ion batteries though is this less of an issue than i’m believing it is? would like to -----> 3d !!!  -----> print !!!  a battery holder to mount on my bench in the future and was thinking maybe it’s not a great idea. \n\nthanks y’all.", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/i07v8f/storing_batteries_in_the_hot_garage/", "identifyer": 391307, "year": "2020"}], "name": "printTools2020"}