{"interestingcomments": [{"Unnamed: 0": 374903, "autor": "CaptN_Cook_", "date": 1580675448000, "content": "What tools for the junkyard? /!/ I know the main pliers, needle nose, cutters, pry bar, screwdrivers, I really need help with wrench and sockets was thinking 7mm-24mm and 1\"-9/32 then the issue comes up with deep sockets what size wrenches will I need blah blah.\n\nAlso have a shit ton of extensions and some swivels mostly so I can utilize my impact as much as possible.", "link": "https://www.reddit.com/r/Tools/comments/exunkb/what_tools_for_the_junkyard/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "what tools for the junkyard? /!/ i know the main pliers, needle nose, cutters, pry bar, screwdrivers, i really need help -----> with !!!  wrench and sockets was thinking 7mm-24mm and 1\"-9/32 then the issue -----> comes !!!  -----> up !!!  -----> with !!!  deep sockets what size wrenches will i need blah blah.\n\nalso have a shit ton of extensions and some swivels mostly so i can utilize my impact as much as possible.", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/exunkb/what_tools_for_the_junkyard/", "identifyer": 374903, "year": "2020"}, {"Unnamed: 0": 376872, "autor": "B_Longbody", "date": 1607641716000, "content": "Tool Trivia Request! /!/ Hey there! I'm putting together a fun \"Tool Trivia\" youtube video, but am having trouble coming up with questions that range from easy to more difficult. Anyone have any trivia questions/answers they think would be good for this? Anything that goes over:   \n• which tool is best for a certain application  \n• tool use in general  \n• tool function facts  \n• tool repair facts  \n• anything else you think would be useful?", "link": "https://www.reddit.com/r/Tools/comments/kapypv/tool_trivia_request/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "tool trivia request! /!/ hey there! i'm putting together a fun \"tool trivia\" youtube video, but am having trouble -----> coming !!!  -----> up !!!  -----> with !!!  questions that range from easy to more difficult. anyone have any trivia questions/answers they think would be good for this? anything that goes over:   \n• which tool is best for a certain application  \n• tool use in general  \n• tool function facts  \n• tool repair facts  \n• anything else you think would be useful?", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/kapypv/tool_trivia_request/", "identifyer": 376872, "year": "2020"}, {"Unnamed: 0": 380649, "autor": "LilShroomy01", "date": 1579311719000, "content": "I recently purchased an old vise on Ebay, looking to identify the manufacturer. /!/ I've purchased [this ](http://Old vise, restoration project. https://imgur.com/gallery/tJk6zob) vise, its small with a 2.5\" jaw width. It appears to be old, has \"PAT. PENDING\" on the table clamp. On the other side it says \"MADE IN USA.\" I'm looking to find the manufacturer of the vise, as that information may come in handy during the restoration process. It is painted red, those yellow streaks are drips. \n\nThere is a barely legible sticker on the vise, an equilateral quadrilateral diamond, the left and right points visibly further apart than the top and bottom points. It says \"Red Diamond\" in an early 1900s style font, red above diamond. Below diamond the space is filled with an upside down isosceles triangle, with a very short line going about a millimeter down from the bottom point, the shape resembles a small coat hanger.\n\nI have googled various red diamond related searches, mostly coming up with gemstones. When I added \"tools\" to the search, I got a supreme toolbox, red with diamond plate. When I added \"old,\" I got an axe, but not much else. It did have red diamond engraved into the head, so I'm hopeful, but as you may can see in the photos, the font is different, and the sticker is in fact up side down.\n\n(For those concerned about me ruining an old thing, I am a machinists apprentace.)", "link": "https://www.reddit.com/r/Tools/comments/eqa0ii/i_recently_purchased_an_old_vise_on_ebay_looking/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "i recently purchased an old vise on ebay, looking to identify the manufacturer. /!/ i've purchased [this ](http://old vise, restoration project. https://imgur.com/gallery/tjk6zob) vise, its small with a 2.5\" jaw width. it appears to be old, has \"pat. pending\" on the table clamp. on the other side it says \"made in usa.\" i'm looking to find the manufacturer of the vise, as that information may come in handy during the restoration process. it is painted red, those yellow streaks are drips. \n\nthere is a barely legible sticker on the vise, an equilateral quadrilateral diamond, the left and right points visibly further apart than the top and bottom points. it says \"red diamond\" in an early 1900s style font, red above diamond. below diamond the space is filled with an upside down isosceles triangle, with a very short line going about a millimeter down from the bottom point, the shape resembles a small coat hanger.\n\ni have googled various red diamond related searches, mostly -----> coming !!!  -----> up !!!  -----> with !!!  gemstones. when i added \"tools\" to the search, i got a supreme toolbox, red with diamond plate. when i added \"old,\" i got an axe, but not much else. it did have red diamond engraved into the head, so i'm hopeful, but as you may can see in the photos, the font is different, and the sticker is in fact up side down.\n\n(for those concerned about me ruining an old thing, i am a machinists apprentace.)", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/eqa0ii/i_recently_purchased_an_old_vise_on_ebay_looking/", "identifyer": 380649, "year": "2020"}, {"Unnamed: 0": 381698, "autor": "bigbobdasloth", "date": 1595645105000, "content": "Need help deciding on a new (to me) tool cart /!/ I need help/personal experience(s) with some tool cart because I'm having a hard time deciding on which one to buy. \n\nA little background on me, I'm a 24 yr old Auto Technician. I've been in the business for about 6 years. I've worked out an overflowing BluePoint service cart (2 drawer cart w/ a 3 drawer top box) for about the past few years. I do a bit of everything but try to focus on drivetrain work. Well recently I've had the opportunity to upgrade my storage. \n\nI'm currently stuck in a 4 way tie. I've done all the reading of reviews, YouTube toolbox tours, and looking around online for every bit of info I can on each of these boxes and came up with no decisive \"This one is the one cart to get.\" \n\nThe carts I'm stuck between are; \nA Matco JSC480, brand new, handle hasn't been installed yet box. Build date of 08 of 19 \n\nA Matco JSC770 used at home as a spare, very well taken care, Build date of 12 of 15\n\nA Snapon KRSC326FPBO, guy had it given to him by Vatterott after school in 2018, went home with him and sat\n\nAnd finally, a Matco MSC4RFFDP18, guy bought it for his son, his son \"loved\" it for a month, didn't look at it again. Limited edition Rat fink 1 of however many blah blah blah. \n\nAll of the boxes are sub $1,000 and are less than 20 minutes away. I'm having a hard time deciding because I'd like to buy them all but the wife says if that happens then I'll be living out of them. So any help or personal experiences with any of them would be great. Thanks in advance.", "link": "https://www.reddit.com/r/Tools/comments/hxfbkl/need_help_deciding_on_a_new_to_me_tool_cart/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "need help deciding on a new (to me) tool cart /!/ i need help/personal experience(s) with some tool cart because i'm having a hard time deciding on which one to buy. \n\na little background on me, i'm a 24 yr old auto technician. i've been in the business for about 6 years. i've worked out an overflowing bluepoint service cart (2 drawer cart w/ a 3 drawer top box) for about the past few years. i do a bit of everything but try to focus on drivetrain work. well recently i've had the opportunity to upgrade my storage. \n\ni'm currently stuck in a 4 way tie. i've done all the reading of reviews, youtube toolbox tours, and looking around online for every bit of info i can on each of these boxes and -----> came !!!  -----> up !!!  -----> with !!!  no decisive \"this one is the one cart to get.\" \n\nthe carts i'm stuck between are; \na matco jsc480, brand new, handle hasn't been installed yet box. build date of 08 of 19 \n\na matco jsc770 used at home as a spare, very well taken care, build date of 12 of 15\n\na snapon krsc326fpbo, guy had it given to him by vatterott after school in 2018, went home with him and sat\n\nand finally, a matco msc4rffdp18, guy bought it for his son, his son \"loved\" it for a month, didn't look at it again. limited edition rat fink 1 of however many blah blah blah. \n\nall of the boxes are sub $1,000 and are less than 20 minutes away. i'm having a hard time deciding because i'd like to buy them all but the wife says if that happens then i'll be living out of them. so any help or personal experiences with any of them would be great. thanks in advance.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/hxfbkl/need_help_deciding_on_a_new_to_me_tool_cart/", "identifyer": 381698, "year": "2020"}, {"Unnamed: 0": 383685, "autor": "ISeeInHD", "date": 1587484974000, "content": "Is there a such thing as a reverse channel lock or pliers? /!/ I have a busted Febco PVB that I need to grab from the inside to back out of the outter metal sleeve.  Searched amazon but not coming up with anything. Thought it might be a fairly common tool but not finding anything.", "link": "https://www.reddit.com/r/Tools/comments/g5hxms/is_there_a_such_thing_as_a_reverse_channel_lock/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "is there a such thing as a reverse channel lock or pliers? /!/ i have a busted febco pvb that i need to grab from the inside to back out of the outter metal sleeve.  searched amazon but not -----> coming !!!  -----> up !!!  -----> with !!!  anything. thought it might be a fairly common tool but not finding anything.", "sortedWord": "None", "removed": null, "score": 3, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/g5hxms/is_there_a_such_thing_as_a_reverse_channel_lock/", "identifyer": 383685, "year": "2020"}, {"Unnamed: 0": 385916, "autor": "mrtravis2772", "date": 1603307043000, "content": "I moved in with my girlfriend and needed a place to put all of my tools, so this is what we came up with.", "link": "https://www.reddit.com/r/Tools/comments/jfjb0f/i_moved_in_with_my_girlfriend_and_needed_a_place/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i moved in -----> with !!!  my girlfriend and needed a place to put all of my tools, so this is what we -----> came !!!  -----> up !!!  -----> with !!! .", "sortedWord": "None", "removed": null, "score": 1, "comments": 17, "media": null, "medialink": "https://www.reddit.com/gallery/jfjb0f", "identifyer": 385916, "year": "2020"}, {"Unnamed: 0": 386299, "autor": "thedarkromance", "date": 1589216922000, "content": "Need help finding a solution for a tension knob /!/ Need some expertise on a Rikon Band Saw (10-305) i bought. Seller did not have the original tension knob so need to come up with a solution. It seems Rikon is out of stock on the parts 10-305-15 and 10-305-16. However, it seems something like a 3/4\" flathead will work but am looking for something that can be knob based. Something like a install tool would work but the one i have is only 1/2\" and needs to be 3/4\". [lowes install tool](https://www.lowes.com/pd/Hillman-3-1-2-in-Screwdriving-Bit-Adapter/4222747) . \nAnyone have an idea without using a weld to create a 3/4\" pipe with a flat head embedded to be used as a knob? Or is there a tool like this already on the market? \n\n[top of band saw](https://imgur.com/a/MFOtOSD)\n\nThanks in advance.", "link": "https://www.reddit.com/r/Tools/comments/ghro9n/need_help_finding_a_solution_for_a_tension_knob/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "need help finding a solution for a tension knob /!/ need some expertise on a rikon band saw (10-305) i bought. seller did not have the original tension knob so need to -----> come !!!  -----> up !!!  -----> with !!!  a solution. it seems rikon is out of stock on the parts 10-305-15 and 10-305-16. however, it seems something like a 3/4\" flathead will work but am looking for something that can be knob based. something like a install tool would work but the one i have is only 1/2\" and needs to be 3/4\". [lowes install tool](https://www.lowes.com/pd/hillman-3-1-2-in-screwdriving-bit-adapter/4222747) . \nanyone have an idea without using a weld to create a 3/4\" pipe with a flat head embedded to be used as a knob? or is there a tool like this already on the market? \n\n[top of band saw](https://imgur.com/a/mfotosd)\n\nthanks in advance.", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/ghro9n/need_help_finding_a_solution_for_a_tension_knob/", "identifyer": 386299, "year": "2020"}, {"Unnamed: 0": 388319, "autor": "OohLavaHot", "date": 1595222242000, "content": "Who came up with the first 12v compact tool line? /!/ I was browsing the cordless line at my local big box store, and I got wondering - who was the first to bring those compact 12v Lithium tools to the market? I recall Bosch and Milwaukee having those lines a decade ago, maybe, but not sure. Everyone was switching from NiCad and all sorts of oddball Lithium batteries were out. \n\nNot meaning this as a pissing match of any sort, just wondering what the history is.", "link": "https://www.reddit.com/r/Tools/comments/hufijl/who_came_up_with_the_first_12v_compact_tool_line/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "who -----> came !!!  -----> up !!!  -----> with !!!  the first 12v compact tool line? /!/ i was browsing the cordless line at my local big box store, and i got wondering - who was the first to bring those compact 12v lithium tools to the market? i recall bosch and milwaukee having those lines a decade ago, maybe, but not sure. everyone was switching from nicad and all sorts of oddball lithium batteries were out. \n\nnot meaning this as a pissing match of any sort, just wondering what the history is.", "sortedWord": "None", "removed": null, "score": 0, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/hufijl/who_came_up_with_the_first_12v_compact_tool_line/", "identifyer": 388319, "year": "2020"}, {"Unnamed: 0": 389375, "autor": "Screeching_Owl", "date": 1607714770000, "content": "Help Purchasing First Set of Tools /!/ Hello,\n\nI just moved into a smallish apartment and I have basically nothing, so I plan to buy a set of tools and just make all the odds and ends furniture I need. Things like a shoe rack, small tables/desks, standing shelves for the garage, cat furniture, squat/weightlifting stands, etc. Nothing super complex or beautiful. I need to cut things, make holes, and fasten things to other things.\n\nI'm somewhat mechanically inclined. Have rebuilt motorcycles and made some wooden furniture before, but I really don't know much about woodworking tools. I'm a designer by trade so I am constantly coming up with ideas of stuff I want that either doesn't exist or is too expensive.\n\nI'm looking to get the best bang for my buck as far as options in the future. I don't mind if I'm unable to do some very specific cuts/operations, as long as I can do the most reasonably common things. So I'm asking you to help me design a first tool set.  \n\n\nI'm looking at a cheap power tool combo that includes:\n\n* Drill/Driver\n* Impact Driver\n* Reciprocating Saw\n* Circular Saw\n* Multi-Tool\n* Batteries and shit\n\nWhat else would you recommend I add to this? What type of PPE do I absolutely need to start with? What should I look for in a bit set? Basically just help me make sure I don't have to make a ton of trips for absolute necessities once I get going.", "link": "https://www.reddit.com/r/Tools/comments/kb9eu6/help_purchasing_first_set_of_tools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "help purchasing first set of tools /!/ hello,\n\ni just moved into a smallish apartment and i have basically nothing, so i plan to buy a set of tools and just make all the odds and ends furniture i need. things like a shoe rack, small tables/desks, standing shelves for the garage, cat furniture, squat/weightlifting stands, etc. nothing super complex or beautiful. i need to cut things, make holes, and fasten things to other things.\n\ni'm somewhat mechanically inclined. have rebuilt motorcycles and made some wooden furniture before, but i really don't know much about woodworking tools. i'm a designer by trade so i am constantly -----> coming !!!  -----> up !!!  -----> with !!!  ideas of stuff i want that either doesn't exist or is too expensive.\n\ni'm looking to get the best bang for my buck as far as options in the future. i don't mind if i'm unable to do some very specific cuts/operations, as long as i can do the most reasonably common things. so i'm asking you to help me design a first tool set.  \n\n\ni'm looking at a cheap power tool combo that includes:\n\n* drill/driver\n* impact driver\n* reciprocating saw\n* circular saw\n* multi-tool\n* batteries and shit\n\nwhat else would you recommend i add to this? what type of ppe do i absolutely need to start with? what should i look for in a bit set? basically just help me make sure i don't have to make a ton of trips for absolute necessities once i get going.", "sortedWord": "None", "removed": null, "score": 1, "comments": 19, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/kb9eu6/help_purchasing_first_set_of_tools/", "identifyer": 389375, "year": "2020"}, {"Unnamed: 0": 389443, "autor": "Government-Greedy", "date": 1608497775000, "content": "Help me. I need some advice. /!/ Hello there people of r/Tools \n\nI am really having a hard time explaining what I'm looking for, so I guess the best I can come up with is - I need a vise type device, which when the nut is turned, the arms push in an outward fashion as opposed to pushing inward to hold something. I have a 8cm square hole in my wall, and I wanted to use the hole to fit a single USB camera directly above my 3D printing station, I am unable to screw into the area - and would like to know specifically if this type of tool exists?", "link": "https://www.reddit.com/r/Tools/comments/kh25bd/help_me_i_need_some_advice/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "help me. i need some advice. /!/ hello there people of r/tools \n\ni am really having a hard time explaining what i'm looking for, so i guess the best i can -----> come !!!  -----> up !!!  -----> with !!!  is - i need a vise type device, which when the nut is turned, the arms push in an outward fashion as opposed to pushing inward to hold something. i have a 8cm square hole in my wall, and i wanted to use the hole to fit a single usb camera directly above my 3d printing station, i am unable to screw into the area - and would like to know specifically if this type of tool exists?", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/kh25bd/help_me_i_need_some_advice/", "identifyer": 389443, "year": "2020"}], "name": "withTools2020"}