{"interestingcomments": [{"autor": "thegoatwrote", "date": "2019-02-08 13:15:20", "content": "Question about DIY minor repair on Nikon 105mm Micro f/2.8 AF Lens /!/ I have a Nikon 105mm f/2.8 AF MICRO-NIKKOR lens, and I bought it used with broken autofocus. It takes beautiful photos, but in addition to the lack of AF, the lens doesn't tell the body what its focal length is, so I have to set and use the non-CPU lens settings to get the EXIF tags populated and what not. Also, sadly, once in a while, I can't set the aperture using the body's wheel, and I have to un-mount/re-mount the lens to get it to work on any other f-stop. The LCD just displays f/13 or whatever I had it set on last and will not change when I spin the wheel. So the electronics in the lens are fried. But in months of ownership and fairly frequent use, that's only happened twice, and it's pretty easily \"fixed\". I got the lens pretty cheap and really only use it for macro, so I don't have a _big_ problem with this.\n\nI'm pretty sure I can pop the dandelion off the lens, cut and/or file any bits of conductor I see left sticking out from the lens body and attach one of the inexpensive \"dandelion chips\" off of eBay for $25 or so and have this fixed, or at least working as a MF lens that identifies itself to the body. Has anyone done anything like this, or know if this will work? Is there anything I need to watch out for?\n\nThanks.", "link": "https://www.reddit.com/r/Nikon/comments/aogenc/question_about_diy_minor_repair_on_nikon_105mm/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "question about diy minor -----> repair !!!  on nikon 105mm micro f/2.8 af lens /!/", "sortedWord": "repair", "Identifyer": null, "identifyer": 1484, "year": "2019"}, {"autor": "tangomango737", "date": "2020-09-03 18:00:52", "content": "D700 mirror stuck. Help! /!/ I acquired a used d700, very little signs of physical wear, and sub 10k shutter count. It was handed over with a known fault from someone who hadn't the time, nor inclination to fix it.\nBasically the mirror is stuck in the \"up\" position. An \"err\" message displays on the lcd screen, which clears after pushing the DOF preview button. This obviously renders the viewfinder completely black, as zero light is passing through the prism, as the mirror is in the opposite position to how it should be.\nOn removing the lens and pressing the shutter button, the mirror flips down and back up again, and exposes the shutter as it should. But it flips back to the \"up\" position every time. \nI've made some enquiries with local repair shops, and am awaiting replies. Has anyone out there experienced anything similar, or have any idea if a diy fix is possible?\nThanks for reading!\n\nTl;dr:\n dslr mirror stuck in the up position. Request help to fix.", "link": "https://www.reddit.com/r/photography/comments/ilylyj/d700_mirror_stuck_help/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "\ni've made some enquiries with local -----> repair !!!  shops, and am awaiting replies.", "sortedWord": "repair", "Identifyer": null, "identifyer": 71202, "year": "2020"}, {"autor": "thelensguru", "date": "2020-01-09 16:08:09", "content": "Lens repair time lapse I made the other day", "link": "https://www.reddit.com/r/photography/comments/embp8y/lens_repair_time_lapse_i_made_the_other_day/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "lens -----> repair !!!  time lapse i made the other day", "sortedWord": "repair", "Identifyer": null, "identifyer": 87830, "year": "2020"}, {"autor": "kid-blue", "date": "2019-04-08 12:03:41", "content": "Am I wrong I thinking I can de-funge my Mamiya 110mm myself? /!/ Hi all,\n\nI'm looking to get some perspective on this:\n\nI recently got a mamiya 110mm 2.8 for a really low price (€35) because it has fungus in it. I'm currently looking for a good spot for repairs here in the Netherlands (any tips are welcome!), but I'm also looking at diy fungus removal. \n\nIt seems like most of the fungus is at either the inside (duh) of the front element or on the second one. Given that, and the info from some YT videos, I reckon I might be able to open and clean the lens myself, thus learning a new thing and saving some money. \n\nDo any of you have experience with cleaning out a lens like this? Would I need anything besides a lens wrench, paper towels, surgical gloves and soap/vinegar? \n\nI don't want to embark on something made to look easy by a dude online, only to find out its super hard to do myself. \n\nAny and all tips and experience are more than welcome!\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/basy87/am_i_wrong_i_thinking_i_can_defunge_my_mamiya/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm currently looking for a good spot for -----> repairs !!!  here in the netherlands (any tips are welcome!), but i'm also looking at diy fungus removal.", "sortedWord": "repair", "Identifyer": null, "identifyer": 93004, "year": "2019"}, {"autor": "Lovehate123", "date": "2019-05-18 21:57:30", "content": "Canon AE-1 program shutter stuck! /!/ Hi everyone, \n\nI’m after a little help here, while taking a photo my Ae-1 shutter closed then then hasn’t opened again. I can’t take a photo or wind up the film now. I have changed the battery (light meter still working) \n\nI have also taken the lens off and manually opened the shutter but it just springs back to closed. Has anyone experienced this also? Is this a repair job for a camera shop or is there a DIY fix that can be done. \n\nThank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bq9dd0/canon_ae1_program_shutter_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "is this a -----> repair !!!  job for a camera shop or is there a diy fix that can be done.", "sortedWord": "repair", "Identifyer": null, "identifyer": 93226, "year": "2019"}, {"autor": "Aisjam", "date": "2019-11-25 01:17:58", "content": "Just finish referbing my Canonet QL17, question about polishing lenses to remove fungus /!/ Hi all, over the weekend, my Canonet ql17 rocked up and got stuck into repairing. the light seals disintegrated and went through the camera and lens part and some mild fungus was on the lens. it looks like someone else tried to repair it as some of the screws were stripped, however it came out well and just finished shooting a roll of film (which i will be learning to develop myself).  https://www.instagram.com/p/B5NBeIJAXai/?utm\\_source=ig\\_web\\_options\\_share\\_sheet  some photos\n\nI had an interesting thought to re polishing the lenses to remove the fungus and scratches? i know the coating would be gone, however it would be interesting to see if anyone attempted this. I live in rural Australia so its hard to get my hands on this old tech without there being any problems... and i am a glutton for punishment to try and get things to mint condition.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e18cgw/just_finish_referbing_my_canonet_ql17_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i will be learning to develop", "selectorShort": "develop", "MarkedSent": "it looks like someone else tried to -----> repair !!!  it as some of the screws were stripped, however it came out well and just finished shooting a roll of film (which i will be learning to develop myself).", "sortedWord": "repair", "Identifyer": null, "identifyer": 95186, "year": "2019"}, {"autor": "grown-quite-weary", "date": "2019-10-02 03:32:48", "content": "Fuji GS645S light leak, diy repair or recommendations in Perth? /!/ Just got two rolls developed for my GS645S and it seems to have a light leak on top and bottom, does anyone in Perth know a decent place that could fix it and roughly what that'd cost?\nOtherwise how hard would it be to diy?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dc4s9k/fuji_gs645s_light_leak_diy_repair_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "fuji gs645s light leak, diy -----> repair !!!  or recommendations in perth?", "sortedWord": "repair", "Identifyer": null, "identifyer": 95571, "year": "2019"}, {"autor": "Fenix022", "date": "2019-11-30 01:34:24", "content": "Nikon shutter curtain DIY repair? /!/ Hello! I've been having some trouble with my Nikon F2A, which I think it is the shutter curtain. My recent pictures seem to have a darker stripe at the edge. You can see it at the top of this [picture](https://i.imgur.com/BRX2SGl.jpg) and at the left of this [one](https://i.imgur.com/9U402Pz.jpg). The negatives have that stripe too. The problem seems to be happening on shutter speeds below 1/250. Here's the back of my camera after taking a picture at [1/250](https://i.imgur.com/QL2fN1w.jpg) and after taking a picture at [1/125](https://i.imgur.com/mPSRN0K.jpg). \n\nAm I right to say that there is an issue with the shutter curtain? Is there a DIY repair I can do or should I take it to a professional camera store? Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e3omzo/nikon_shutter_curtain_diy_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "nikon shutter curtain diy -----> repair !!! ?", "sortedWord": "repair", "Identifyer": null, "identifyer": 96388, "year": "2019"}, {"autor": "wompr", "date": "2021-07-03 18:24:15", "content": "Camera Repair shop wanted: Nikon D5600 water damage repair cost in Ontario, Canada - Fell into freshwater, metering error. /!/ Hello Folks, \n\nA couple of days ago I had an accident in one of the great lakes and my D5600 got submerged underneath the water for about 2 seconds but there wasn't any blunt force trauma involved - just 2 seconds under murky freshwater (not saltwater) and I took out.\n\nI shut off the camera, let it dry, took out the battery, the sd card, opened all doors and covers, didn't have any gel packs or bag of Rice so I let it dry off in the sun for about 5 hours. Then, I put everything back and turned on the camera. For the following 24 hours, the functionalities were very wonky - things were working, then not working, then working again, then not working again, in random patterns. I managed to still shoot some really good shots in Aperture mode. It seemed that the battery and the SD card were in good condition, too. During this time though, the view-finder was always foggy and the metering square wasn't showing up properly in the viewfinder. \n\nThen after 24 hours, all of a sudden, everything else started working perfectly but all other modes except Manual started showing an error: Metering Malfunction. Please consult a Nikon Technical specialist. From then on, whatever the hell I did, from watching youtube videos to reading threads on blogs, nothing worked. Manual mode still works, but flash and any other mode is blocked by the metering error. So I called Nikon Canada, and they didn't ask me how it happened (I just told them it shows a metering error), and they said it depends on the damage but the ball-park range would be around 225 - 475 CAD to repair, if not under warranty. I bought the camera in a kit from amazon.ca (the one with all the gizmos and extra lenses) - so I don't know if that would have voided the warranty. \n\nSo, I will consider worst case scenario and say it won't be under warranty and I have to pay 475 CAD to fix it from Nikon Canada. However, I was wondering if this issue could be fixed for cheaper (because I am a student on a budget). Is there a cheaper alternative to fixing this problem because I do not know anything about camera repair and this is my first camera rodeo. I live in the GTA.\n\nI am looking for cheaper repair costs from 3rd party camera repair shops or DIY tips. Thank you.", "link": "https://www.reddit.com/r/photography/comments/od3h43/camera_repair_shop_wanted_nikon_d5600_water/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "\n\ni am looking for cheaper -----> repair !!!  costs from 3rd party camera -----> repair !!!  shops or diy tips.", "sortedWord": "repair", "Identifyer": null, "identifyer": 14344, "year": "2021"}, {"autor": "p3achstat3ofmind", "date": "2021-09-18 17:31:34", "content": "Connection issue with my Sony 16-35 2.8 Gm lens. /!/ I wanted to reach out to see if anyone had any advice before I send my lens in for repair. \n\nMy lens has had an issue where the shutter sputters and the aperture becomes inoperable. I recently read about a recall impacting this lens. Though my serial number falls within the impacted range, the lens itself did not qualify. \n\nI have updated the firmware to the most recent update (3.0). \n\nAnyone out there having similar issues?? The repair at minimum will be like 500 so I want to make sure I try everything prior to sending. \n\nThank you 🙏🏻", "link": "https://www.reddit.com/r/photography/comments/pqqq1g/connection_issue_with_my_sony_1635_28_gm_lens/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "the -----> repair !!!  at minimum will be like 500 so i want to make sure i try everything prior to sending.", "sortedWord": "repair", "Identifyer": null, "identifyer": 16771, "year": "2021"}, {"autor": "Kollinphoto", "date": "2018-02-18 16:43:54", "content": "Home Developing /!/ I learned something about home developing today. I’m guessing a lot of people know about this but I wanted to share for anyone who\n\nAfter developing a role of black and white film I found my negatives had what looked like light leaks on the sprockets. I went to my local repair shop with the negatives and the tech took one look at then and asked if I developed at home. I said yes and the tech said that those are not light leaks, it’s fixer that was still on my reels. He told me that I need to wash my reels thoroughly to keep this from happening. Normally I wash my reels but I guess it wasn’t enough.  He was confident that this was the solution because the burning didn’t bleed into the image area. \n\n[example ](https://imgur.com/a/XK66D)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7yfdrh/home_developing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i went to my local -----> repair !!!  shop with the negatives and the tech took one look at then and asked if i developed at home.", "sortedWord": "repair", "Identifyer": null, "identifyer": 19606, "year": "2018"}, {"autor": "Machine120", "date": "2018-07-16 10:42:13", "content": "The zoom ring on my beloved 24-70 2.8 is dented and I am looking for info/guides on how to repair it DIY, please.", "link": "https://www.reddit.com/r/canon/comments/8z9vf7/the_zoom_ring_on_my_beloved_2470_28_is_dented_and/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the zoom ring on my beloved 24-70 2.8 is dented and i am looking for info/guides on how to -----> repair !!!  it diy, please.", "sortedWord": "repair", "Identifyer": null, "identifyer": 23352, "year": "2018"}, {"autor": "Big-Strike463", "date": "2021-09-23 19:17:04", "content": "Nikon D810 Rubber Repair Help /!/ I didn’t break my gear, it sort of broke itself - but I think a lot of you know what I am talking about. The door of my D810's memory card compartment lost its rubber and the front grip is peeling off, too (but that is just a bubble and it has been there for more than a year or two). I had my camera since march of 2017 without any issues, so I am not too mad about it.\n\nBut I am living in Austria, and I don’t know how the service repair would work (how long it would take, how much it would cost etc.). I would repair it myself but I would only want to do it with original parts and not with some DIY-methods that may be janky.\n\nHas anyone of you links for parts, tips, advice or experience with this problem? Any comments are appreciated. Thank you :D", "link": "https://www.reddit.com/r/Nikon/comments/pu2j0a/nikon_d810_rubber_repair_help/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i would -----> repair !!!  it myself but i would only want to do it with original parts and not with some diy-methods that may be janky.", "sortedWord": "repair", "Identifyer": null, "identifyer": 51799, "year": "2021"}, {"autor": "wompr", "date": "2021-07-03 18:19:48", "content": "Nikon D5600 water damage repair cost in Ontario, Canada - Fell into freshwater, metering error. /!/ Hello Folks, \n\nA couple of days ago I had an accident in one of the great lakes and my D5600 got submerged underneath the water for about 2 seconds but there wasn't any blunt force trauma involved - just 2 seconds under murky freshwater (not saltwater) and I took out.\n\nI shut off the camera, let it dry, took out the battery, the sd card, opened all doors and covers, didn't have any gel packs or bag of Rice so I let it dry off in the sun for about 5 hours. Then, I put everything back and turned on the camera. For the following 24 hours, the functionalities were very wonky - things were working, then not working, then working again, then not working again, in random patterns. I managed to still shoot some really good shots in Aperture mode. It seemed that the battery and the SD card were in good condition, too. During this time though, the view-finder was always foggy and the metering square wasn't showing up properly in the viewfinder. \n\nThen after 24 hours, all of a sudden, everything else started working perfectly but all other modes except Manual started showing an error: Metering Malfunction. Please consult a Nikon Technical specialist. From then on, whatever the hell I did, from watching youtube videos to reading threads on blogs, nothing worked. Manual mode still works, but flash and any other mode is blocked by the metering error. So I called Nikon Canada, and they didn't ask me how it happened (I just told them it shows a metering error), and they said it depends on the damage but the ball-park range would be around 225 - 475 CAD to repair, if not under warranty. I bought the camera in a kit from amazon.ca (the one with all the gizmos and extra lenses) - so I don't know if that would have voided the warranty. \n\nSo, I will consider worst case scenario and say it won't be under warranty and I have to pay 475 CAD to fix it from Nikon Canada. However, I was wondering if this issue could be fixed for cheaper (because I am a student on a budget). Is there a cheaper alternative to fixing this problem because I do not know anything about camera repair and this is my first camera rodeo. I live in the GTA.\n\nI am looking for cheaper repair costs from 3rd party camera repair shops or DIY tips. Thank you.", "link": "https://www.reddit.com/r/Nikon/comments/od3eb2/nikon_d5600_water_damage_repair_cost_in_ontario/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "\n\ni am looking for cheaper -----> repair !!!  costs from 3rd party camera -----> repair !!!  shops or diy tips.", "sortedWord": "repair", "Identifyer": null, "identifyer": 53795, "year": "2021"}, {"autor": "tangomango737", "date": "2020-09-03 18:01:57", "content": "D700 mirror stuck. Help! /!/ I acquired a used d700, very little signs of physical wear, and sub 10k shutter count. It was handed over with a known fault from someone who hadn't the time, nor inclination to fix it.\nBasically the mirror is stuck in the \"up\" position. An \"err\" message displays on the lcd screen, which clears after pushing the DOF preview button. This obviously renders the viewfinder completely black, as zero light is passing through the prism, as the mirror is in the opposite position to how it should be.\nOn removing the lens and pressing the shutter button, the mirror flips down and back up again, and exposes the shutter as it should. But it flips back to the \"up\" position every time. \nI've made some enquiries with local repair shops, and am awaiting replies. Has anyone out there experienced anything similar, or have any idea if a diy fix is possible?\nThanks for reading!\n\nTl;dr:\n dslr mirror stuck in the up position. Request help to fix.", "link": "https://www.reddit.com/r/Cameras/comments/ilympo/d700_mirror_stuck_help/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "\ni've made some enquiries with local -----> repair !!!  shops, and am awaiting replies.", "sortedWord": "repair", "Identifyer": null, "identifyer": 6549, "year": "2020"}, {"autor": "agapitok", "date": "2020-09-28 18:35:48", "content": "DIY shutter curtain repair.", "link": "https://www.reddit.com/r/Leica/comments/j1huvj/diy_shutter_curtain_repair/", "origin": "Reddit", "suborigin": "leica", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy shutter curtain -----> repair !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 12526, "year": "2020"}, {"autor": "CZTachyonsVN", "date": "2021-06-30 14:35:03", "content": "Issue with viewfinder proximity sensor on Canon 700D /!/ My dslr works fine, except that something is wrong with the proximity sensor. The camera thinks that I am using the optical viewfinder and shuts off the lcd screen (backlighting is still on). At least that is my theory. When I move away from the sensor, the screen shows information for a split second before turning blank again. It happens about 1 out of 20 tries. Is there a DIY fix for this or should I look for a repair shop?", "link": "https://www.reddit.com/r/Cameras/comments/oayl5n/issue_with_viewfinder_proximity_sensor_on_canon/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "is there a diy fix for this or should i look for a -----> repair !!!  shop?", "sortedWord": "repair", "Identifyer": null, "identifyer": 15901, "year": "2021"}, {"autor": "OneFastBurrito", "date": "2021-02-22 16:53:02", "content": "DIY Repairs to my Nikon D7200 after an unfortunate rock climbing incident", "link": "https://www.reddit.com/r/Cameras/comments/lptc2i/diy_repairs_to_my_nikon_d7200_after_an/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy -----> repairs !!!  to my nikon d7200 after an unfortunate rock climbing incident", "sortedWord": "repair", "Identifyer": null, "identifyer": 16708, "year": "2021"}, {"autor": "grimmnicholas", "date": "2021-09-14 03:17:28", "content": "DIY repair help 🌻", "link": "https://www.reddit.com/r/Cameras/comments/pnuqgb/diy_repair_help/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy -----> repair !!!  help 🌻", "sortedWord": "repair", "Identifyer": null, "identifyer": 17953, "year": "2021"}, {"autor": "EF5Cyniclone", "date": "2021-08-02 06:06:47", "content": "DIY Tamron lens repair vs KEH Lens repair. Any experiences? /!/ So the focus my Tamron 70-200 2.8 G2 stopped working on a recent trip (seemed like an issue with resistance from the helicoid, since it prevented focusing to infinity or MFD in both MF and AF). I tried to repair it myself and while I did get MF working, AF still won't focus to infinity, and in the process I also appear to have screwed up the stabilization (VC) in mode 1, as it now jumps when the shutter opens.\n\nI'm not especially afraid to open it on my own again, and had the idea of applying some white grease to some of the mechanical parts in the focus system to see if that helps, but I guess I must have screwed up the optical stabilizer's (or VC) calibration in the process last time, and I'm not sure I can fix that myself. I haven't found much info on how to go about doing that.\n\nI guess I'm wondering if anyone here might have experience with fixing VC on a Tamron lens preferably without replacing the unit since I think there's nothing mechanically wrong with it, and I'm not sure I could source the part.\n\nAnd if nobody has any advice for the DIY side, or if a VC recalibration isn't possible without something more sophisticated than hand tools, does anyone have experience using KEH or some other company for repair? KEH charges a flat $320 for zooms, so I'm also open to other services if they might give a lower estimate for the issues I've described.\n\nThanks in advance for any advice, and sorry if this is outside the scope of this subreddit.", "link": "https://www.reddit.com/r/Cameras/comments/ow8pnf/diy_tamron_lens_repair_vs_keh_lens_repair_any/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy tamron lens -----> repair !!!  vs keh lens -----> repair !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 22628, "year": "2021"}, {"autor": "wompr", "date": "2021-07-03 18:18:27", "content": "Nikon D5600 water damage repair cost in Ontario, Canada - Fell into freshwater, metering error. /!/ Hello Folks, \n\nA couple of days ago I had an accident in one of the great lakes and my D5600 got submerged underneath the water for about 2 seconds but there wasn't any blunt force trauma involved - just 2 seconds under murky freshwater (not saltwater) and I took out.\n\nI shut off the camera, let it dry, took out the battery, the sd card, opened all doors and covers, didn't have any gel packs or bag of Rice so I let it dry off in the sun for about 5 hours. Then, I put everything back and turned on the camera. For the following 24 hours, the functionalities were very wonky - things were working, then not working, then working again, then not working again, in random patterns. I managed to still shoot some really good shots in Aperture mode. It seemed that the battery and the SD card were in good condition, too. During this time though, the view-finder was always foggy and the metering square wasn't showing up properly in the viewfinder. \n\nThen after 24 hours, all of a sudden, everything else started working perfectly but all other modes except Manual started showing an error: Metering Malfunction. Please consult a Nikon Technical specialist. From then on, whatever the hell I did, from watching youtube videos to reading threads on blogs, nothing worked. Manual mode still works, but flash and any other mode is blocked by the metering error. So I called Nikon Canada, and they didn't ask me how it happened (I just told them it shows a metering error), and they said it depends on the damage but the ball-park range would be around 225 - 475 CAD to repair, if not under warranty. I bought the camera in a kit from amazon.ca (the one with all the gizmos and extra lenses) - so I don't know if that would have voided the warranty. \n\nSo, I will consider worst case scenario and say it won't be under warranty and I have to pay 475 CAD to fix it from Nikon Canada. However, I was wondering if this issue could be fixed for cheaper (because I am a student on a budget). Is there a cheaper alternative to fixing this problem because I do not know anything about camera repair and this is my first camera rodeo. I live in the GTA.\n\nI am looking for cheaper repair costs from 3rd party camera repair shops or DIY tips. Thank you.", "link": "https://www.reddit.com/r/Cameras/comments/od3dge/nikon_d5600_water_damage_repair_cost_in_ontario/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "\n\ni am looking for cheaper -----> repair !!!  costs from 3rd party camera -----> repair !!!  shops or diy tips.", "sortedWord": "repair", "Identifyer": null, "identifyer": 22712, "year": "2021"}, {"autor": "Triumph675r", "date": "2018-03-15 19:42:30", "content": "A7R2 LCD Repair DIY /!/ Hey guys, I bought a second used A7R2 on steep discount because the rear LCD didn't work. I thought, \"Hey, how hard could it be to remove 4 screws and pop the old screen out and new one in?\" Having done this once successfully on my other A7R2 after the screen shattered, I felt pretty confident. Unfortunately the new screen didn't solve the problem. My rear LCD is still dead. I also tried to fit a new flex cable (pulling off the entire rear outer housing, quite nerve-wracking!), but to no avail. Could someone give me an idea of what else I can do to get my rear LCD working again? ", "link": "https://www.reddit.com/r/SonyAlpha/comments/84pbyo/a7r2_lcd_repair_diy/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a7r2 lcd -----> repair !!!  diy /!/", "sortedWord": "repair", "Identifyer": null, "identifyer": 36936, "year": "2018"}, {"autor": "dancedar", "date": "2018-09-05 09:06:19", "content": "Dropped D7100 trail running, mode dial plate &amp; lock pin came out /!/ I dopped this thing running on my last day after 100km of utmb course and the plate and pin came out - I didn't see a spring but understand this is what causes the mode selector lock pin to engage - right now the dial turns freely and cannot be locked.\n\nOn eBay there are plates and dials but no spring from what I can see.\n\nAm I only missing the spring? Could anyone tell me if this is available anywhere - I can't find a part number and I'm in the uk so will cost £100s to get nikon to repair while I'm hoping there's a diy solution.", "link": "https://www.reddit.com/r/Nikon/comments/9d4o9q/dropped_d7100_trail_running_mode_dial_plate_lock/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "could anyone tell me if this is available anywhere - i can't find a part number and i'm in the uk so will cost £100s to get nikon to -----> repair !!!  while i'm hoping there's a diy solution.", "sortedWord": "repair", "Identifyer": null, "identifyer": 43706, "year": "2018"}, {"autor": "fotoxs", "date": "2021-10-15 00:30:54", "content": "Ideas on DIY repairing/protecting this thrifty find?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q8cjtm/ideas_on_diy_repairingprotecting_this_thrifty_find/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "ideas on diy -----> repairing !!! /protecting this thrifty find?", "sortedWord": "repair", "Identifyer": null, "identifyer": 48696, "year": "2021"}, {"autor": "PandaChainz", "date": "2021-04-30 00:32:07", "content": "Minolta Maxxum 7 /!/ I’ve run into the dreaded aperture issue with my Maxxum 7 (went through half a roll before the error popped up on the LCD). Any DIY solutions or repair shops in the NYC area? (unless the cost outweighs buying another one)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n1id65/minolta_maxxum_7/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any diy solutions or -----> repair !!!  shops in the nyc area?", "sortedWord": "repair", "Identifyer": null, "identifyer": 49253, "year": "2021"}, {"autor": "Don_Rumata_Estorsky", "date": "2021-07-21 18:09:27", "content": "A year ago I offered to make a guide on soviet cameras repair and service and you liked this idea. Here is the first full video guide on Zenit-E, Zenit-B and Zenit-3M disassembly and repair. Full english subtitles/instructions.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ooviix/a_year_ago_i_offered_to_make_a_guide_on_soviet/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i offered to make", "selectorShort": "make", "MarkedSent": "a year ago i offered to make a guide on soviet cameras -----> repair !!!  and service and you liked this idea.", "sortedWord": "repair", "Identifyer": null, "identifyer": 4631, "year": "2021"}, {"autor": "5thEditionFanboy", "date": "2021-07-26 21:50:44", "content": "Pentax Spotmatic DIY meter repair worth it? /!/ I bought a later model Spotmatic SP a few weeks ago with a broken light meter. It works fine otherwise and I've been okay with sunny 16 and the like for metering by hand, but I figured it would be nice if the meter worked - it looks fairly simple to pop the top off, and I've got enough experience with electronics that I feel confident working from there. Is it a relatively easy camera to take apart and put back together? Is the meter even that good at all? Is this venture at all worth it, or should I give up on the idea and just meter by hand?\n\nI've seen some instructions on how to take the top cover off, and it looks relatively simple, but I'd like to hear from someone who's actually done it - for what it's worth, I haven't exactly done a lot of camera repair in the past, though I've certainly disassembled and reassembled my fair share of items.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/os90ru/pentax_spotmatic_diy_meter_repair_worth_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "pentax spotmatic diy meter -----> repair !!!  worth it?", "sortedWord": "repair", "Identifyer": null, "identifyer": 4778, "year": "2021"}, {"autor": "clydestrouble", "date": "2018-09-22 16:05:08", "content": "any creative \"bad combinations\" i can explore in my photography? /!/ am brainstorming for my next photoshoot. am doing this for my A level art and am fairly a beginner. i wanna explore the theme of combinations, so am looking for some bad combinations that basically scream THIS IS THE WORST TIME AND PLACE TO DO THIS!! i feel like this would make some pretty interesting and expressive pictures. so far iv got: \nlighting a cig with birthday cake candles\nreligous worship at a club/club\nsleeping at a party\npainting in the middle of the road/traffic ?\nswimming in a burning building\neating a full course meal in pouring rain\nrepairing a lamp in a bright sunny day\nputting make up while climbing a tree\nthese are just come quick ones i came up with. what do you guys think? and do you have any other interesting bad combinations? if you could also recommend a good artist that does this kind of thing that would be MASSIVELY appreciated", "link": "https://www.reddit.com/r/photography/comments/9i0s5g/any_creative_bad_combinations_i_can_explore_in_my/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "\nswimming in a burning building\neating a full course meal in pouring rain\n-----> repairing !!!  a lamp in a bright sunny day\nputting make up while climbing a tree\nthese are just come quick ones i came up with.", "sortedWord": "repair", "Identifyer": null, "identifyer": 23890, "year": "2018"}, {"autor": "ToasterTech", "date": "2021-07-09 02:44:24", "content": "24-105 aperture is stuck wide open, any diy ways to repair or fix it?", "link": "https://www.reddit.com/r/canon/comments/ogmfme/24105_aperture_is_stuck_wide_open_any_diy_ways_to/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "24-105 aperture is stuck wide open, any diy ways to -----> repair !!!  or fix it?", "sortedWord": "repair", "Identifyer": null, "identifyer": 42499, "year": "2021"}, {"autor": "Chillin_Villan", "date": "2021-10-02 17:33:03", "content": "DIY lens repair? Or send to Canon? /!/ I had a 70-200L3iii fall face first while mounted to a tripod while taking portraits. Luckily it was on carpet. I didn’t even notice it was broken as I took a few more headshots that looked great. \n\nHowever, the zoom and focus rings are jammed. \nI was quoted about $500 for repair by canon. Should I attempt to repair myself? If I fail, I can just send it to canon to fix right? \nHow difficult do you think this is? And what areas should I be careful with to prevent any irreversible damage?\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/pzzlcs/diy_lens_repair_or_send_to_canon/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy lens -----> repair !!! ?", "sortedWord": "repair", "Identifyer": null, "identifyer": 43411, "year": "2021"}, {"autor": "jotoc0", "date": "2020-06-27 20:04:59", "content": "No AF Canon 50mm f1.4 for 40% price? /!/ Hi all, I wanted to get your opinions on this. \n\nI already have the excellent 50mm f1,8 STM lens. But i was offered the opportunity to get a f1.4 version for about 40% of the used price. \n\n&amp;#x200B;\n\nThe catch is, it took a fall. Optically it seems pretty much new, but the auto focus motor will stick and stop. It seems the ring or something might have been damaged and the ring is stiff, it can be turned somewhat easily manually, but it is a bit heavy for the motor, so it can't auto focus properly. \n\n&amp;#x200B;\n\nIs this a good deal? I know I don't NEED it, but it should be a fun lens, even if manual. Or it might turn into a DIY lens repair project. \n\nWould you say it is a good enough lens that it is worth it to have it in manual or get it repaired?\n\nUpdate:\n\nThank you all and I will be ignoring this lens. Even if it is super cheap. I will keep using the STM", "link": "https://www.reddit.com/r/canon/comments/hh0fpg/no_af_canon_50mm_f14_for_40_price/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "or it might turn into a diy lens -----> repair !!!  project.", "sortedWord": "repair", "Identifyer": null, "identifyer": 46593, "year": "2020"}, {"autor": "chelsey3564", "date": "2020-10-06 05:44:37", "content": "Worth the upgrade to R6 /!/ I do photogrpahy as a hobby and mainly photograph small birds.i currently have a 6d mark 2 and have had it for a year but had to recently get it repaired because it was coming up with errors and not turning off without taking out the battery. I like the appeal of the R6 as it has the animal eye autofocus and that would be very helpful for photographing the small birds as they dart about shrubs. I have compared them and even though the R6 has lower megapixels but it has alot more AF points and more frames per second. I use a 100-400 mark 1 lens and have also been thinking of upgrading to the mark 2 but can't decide weither to getting the new lens or a new camera. Im not sure if it is worth the upgrade as it is more expensive amd i would have to either get an adapter or buy all new lens \n\nIm wondering if anyone has any more advice or any experience in using the R6 for wildlife or bird photos.", "link": "https://www.reddit.com/r/canon/comments/j5zosx/worth_the_upgrade_to_r6/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "i do photogrpahy as a hobby and mainly photograph small birds.i currently have a 6d mark 2 and have had it for a year but had to recently get it -----> repaired !!!  because it was coming up with errors and not turning off without taking out the battery.", "sortedWord": "repair", "Identifyer": null, "identifyer": 49884, "year": "2020"}, {"autor": "Skatekov", "date": "2020-09-08 17:58:42", "content": "A little arduino shutter speed stopwatch I made for camera repairs.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ioyj59/a_little_arduino_shutter_speed_stopwatch_i_made/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "a little arduino shutter speed stopwatch i made for camera -----> repairs !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 54549, "year": "2020"}, {"autor": "Mopey_Zoo_Lion", "date": "2020-09-17 01:21:45", "content": "Burned by an ebay listing, debating about sending in for repair, or taking up a new branch of the hobby? /!/ I picked up a Pentax MX whose Ebay listing proudly declared: TESTED! Mint condition! Only to discover upon receipt that the mirror is stuck in the up position and the shutter doesn't reset upon firing until I advance the film lever.  I know Ebay would recoup my costs if I just returned it, but it came with some good glass (hilariously only two of the four lenses match the camera, and the other two do come with an adapter... for yet another mount system 9_9 ) and I'd like to hold onto those. None of the shops in my geographic area service the MX, something about two many changes made to the system while it was in production, and I'm strongly considering sending it off to Eric for repairs, but I have nothing else to shoot with and don't like the idea of waiting around...\nIs this something a total newb could service, and if it's something I enjoy, is there a way for me to actually get trained up as a vintage camera repair tech? It seems like there's a market, and as the old guard that actually worked on these cameras back in the day start to retire, we'll need new hands to keep things running... but I wouldn't know the first thing about seeking training. I know this was kind of rambly, but I'd appreciate any insight folks have on the situation", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iu9dfq/burned_by_an_ebay_listing_debating_about_sending/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "[idea, made]", "selectorShort": "idea", "MarkedSent": "none of the shops in my geographic area service the mx, something about two many changes made to the system while it was in production, and i'm strongly considering sending it off to eric for -----> repairs !!! , but i have nothing else to shoot with and don't like the idea of waiting around...\nis this something a total newb could service, and if it's something i enjoy, is there a way for me to actually get trained up as a vintage camera repair tech?", "sortedWord": "repair", "Identifyer": null, "identifyer": 56061, "year": "2020"}, {"autor": "Whatsthedaydavi", "date": "2020-07-30 14:47:01", "content": "Mamiya C330F lower shutter release not firing /!/ Hello I didn't see much action on my last post from a week ago so I wanted to repost it to see if I could get some help,\n\nI'd like to sell my Mamiya C300F here soon, but i'd like to make a small repair. Currently the lower shutter release (there are three, it's the lowest one that looks like a cylinder at the bottom of the camera) will inconsistently let the shutter fire. Does anyone know of any common fixes for this or what could be the problem? Any help is appreciated and if I need supporting documents let me know.\n\nHere is a video of the problem: [https://imgur.com/a/xaBkzof](https://imgur.com/a/xaBkzof)\n\nThank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i0nau4/mamiya_c330f_lower_shutter_release_not_firing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i'd like to make", "selectorShort": "make", "MarkedSent": "hello i didn't see much action on my last post from a week ago so i wanted to repost it to see if i could get some help,\n\ni'd like to sell my mamiya c300f here soon, but i'd like to make a small -----> repair !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 56172, "year": "2020"}, {"autor": "HurkyWakkaWakka", "date": "2020-10-19 10:18:57", "content": "Should I repair a Nikomat EL? /!/ Hello guys, I'll give you some backstory and then I'll jump yo the question.\n\nI started using my dad's analog camera (Nikkormat FT2) a couple of years ago, and I had my fair share of fun.\n\nHe also has a broken Nikomat EL which his sister used back in the days. He told me that my aunt put the camera away without removing the battery, which oxydized and made the camera stop working. He tried to clean the battery slot but it didn't help. Basically, you can't for it because the button won't go all the way down. Since you can't fire it, you can't actually wind the camera. I also think that the mirror is closed, but unfortunately I cannot confirm it since I don't have the camera with me right now.\n\nA year ago, I brought that camera to a repair lab, and they told me that they could fix it for 50€.\n\nThat's the question: Should I make them fix it? A very old school retired photograph told me that I should definitely do that, while my dad thinks that it's a waste of money since you can get a working EL body for a little bit more off the internet.\n\nWhat do you guys think?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jdz34s/should_i_repair_a_nikomat_el/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i make", "selectorShort": "make", "MarkedSent": "\n\na year ago, i brought that camera to a -----> repair !!!  lab, and they told me that they could fix it for 50€.\n\nthat's the question: should i make them fix it?", "sortedWord": "repair", "Identifyer": null, "identifyer": 56706, "year": "2020"}, {"autor": "Mecha-Dragon", "date": "2020-10-02 01:08:05", "content": "DIY Cloth Curtain Hole Repair : What to Use? /!/ I had recently bought a Nikon S2 for cheap. It looks beat up, but all the speeds above 1/30 operate correctly and the film advance feels good. However, there's a very small hole burned into the shutter curtain and will certainly cause light leaks. \n\nI've seen multiple things that people have used, from black nail polish to liquid electrical tape to Plasti Dip. It's a small enough hole that I think a small skim layer of a flexible material will fix it right up. Has anybody done the repair before on a cloth shutter curtain, and what did you use? Has it also held up? Let me know, thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j3l9q4/diy_cloth_curtain_hole_repair_what_to_use/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy cloth curtain hole -----> repair !!!  : what to use?", "sortedWord": "repair", "Identifyer": null, "identifyer": 56725, "year": "2020"}, {"autor": "oscarxblairr", "date": "2020-05-03 10:08:05", "content": "whilst attempting a repair i may have made a fully automatic ae1 that doesn’t need a shutter button", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gco5qo/whilst_attempting_a_repair_i_may_have_made_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i may have made", "selectorShort": "make", "MarkedSent": "whilst attempting a -----> repair !!!  i may have made a fully automatic ae1 that doesn’t need a shutter button", "sortedWord": "repair", "Identifyer": null, "identifyer": 56901, "year": "2020"}, {"autor": "nophoneinbed", "date": "2020-11-29 11:43:36", "content": "Pentax 6x7 shutter not opening /!/ i recently bought a pentax 6x7 MLU online\nIt was in great condition, and came with a 150mm lens\nHowever my first roll came out totally blank, so i immediately tested the shutter to find that it wasnt opening at all\nBought a new battery, still nothing. But after a couple goes of testing the shutter, it suddenly started opening, only to then stop after about 10 more dry fires. After another 10 fires it started opening up again, which it still is doing now.\n\nAbsolutely everything else about the camera works perfectly.\n\nI havent been able to find any conclusive examples of this issue online, the guy i bought it off is adament that it never had this problem while he was shooting it, but he also only used it for 2 rolls before selling it to me.\n\nI dont want to have to pay for a repair when i bought it just last week, so i really just need some insight into what the issue could actually be before i make a decision on whether i should attempt to return it or not.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k383hd/pentax_6x7_shutter_not_opening/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i make", "selectorShort": "make", "MarkedSent": "\n\ni dont want to have to pay for a -----> repair !!!  when i bought it just last week, so i really just need some insight into what the issue could actually be before i make a decision on whether i should attempt to return it or not.", "sortedWord": "repair", "Identifyer": null, "identifyer": 58671, "year": "2020"}, {"autor": "Spac3M0nkey", "date": "2020-07-28 18:41:50", "content": "DIY adjustable pin wrench, does anyone else make their own tools for camera repair?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hzkahw/diy_adjustable_pin_wrench_does_anyone_else_make/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy adjustable pin wrench, does anyone else make their own tools for camera -----> repair !!! ?", "sortedWord": "repair", "Identifyer": null, "identifyer": 59192, "year": "2020"}, {"autor": "Spac3M0nkey", "date": "2020-07-28 18:40:32", "content": "DIY adjustable pin wrench, does anyone else make their own tools for camera repair? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/ija9q5ui7nd51.jpg?width=4240&amp;format=pjpg&amp;auto=webp&amp;s=0a47bf304a858b340191329dd555ee34cbf1d19b", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hzk9lu/diy_adjustable_pin_wrench_does_anyone_else_make/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy adjustable pin wrench, does anyone else make their own tools for camera -----> repair !!! ?", "sortedWord": "repair", "Identifyer": null, "identifyer": 59193, "year": "2020"}, {"autor": "jouse_88", "date": "2020-04-30 11:51:36", "content": "Do all Mamiya 645s suffer from Mirror Stop Brake? /!/ Hey guys,\n\nI  am still not able to repair my Mamiya 645 Super's Mirror Stop, although  I got the 3D-printed Brake - that damn spring just can't stay on it's  place and I am too inexperienced to take apart the whole camera.\n\nThinking  of buying another body now. Do they all suffer from that \"plasticy\"  mirror stop? Or is there any body generation that is a bit more robust?\n\nAlso, if you know any places that repair Mamiyas in Germany, let me know :)\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gau7jg/do_all_mamiya_645s_suffer_from_mirror_stop_brake/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "3d-printed", "selectorShort": "print", "MarkedSent": "hey guys,\n\ni  am still not able to -----> repair !!!  my mamiya 645 super's mirror stop, although  i got the 3d-printed brake - that damn spring just can't stay on it's  place and i am too inexperienced to take apart the whole camera.", "sortedWord": "repair", "Identifyer": null, "identifyer": 60282, "year": "2020"}, {"autor": "PandaChainz", "date": "2020-07-09 05:15:03", "content": "Minolta Maxxum 7 /!/ I’ve run into the dreaded aperture issue with my Maxxum 7 (when through half a roll before the error popped up on the LCD). Any DIY solutions or repair shops in the NYC area? (unless the cost outweighs buying another one)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hnxabr/minolta_maxxum_7/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any diy solutions or -----> repair !!!  shops in the nyc area?", "sortedWord": "repair", "Identifyer": null, "identifyer": 62764, "year": "2020"}], "name": "Reddsortedoutrepair"}