{"interestingcomments": [{"autor": "fisheveadventures3", "date": "2019-12-22 12:24:55", "content": "DIY - Christmas BOKEH Photography Ideas and Tutorial (a6300 sel90mmf2.8)", "link": "https://www.reddit.com/r/SonyAlpha/comments/ee4cnb/diy_christmas_bokeh_photography_ideas_and/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy - christmas bokeh photography ideas and -----> tutorial !!!  (a6300 sel90mmf2.8)", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 20584, "year": "2019"}, {"autor": "SHH19", "date": "2020-05-19 09:41:02", "content": "DSLR Veterans - Can I Access My Camera Interface From Computer? /!/ I see in some YouTube videos tutors are showing camera interface on computer screen connecting the camera with the computer. Can anyone tell me how can I do so? Is there any special software dedicated for this? Can I do it in my Nikon 5000D camera? Any help will be highly appreciated.\n\nBackground: I have an old Nikon D5000 Camera. I want to create a tutorial video on YouTube for the camera. But the problem is my Camera display has big round vignette which can't be recorded using a mobile phone camera directly. Anyone can barely see the screen because of vignette. Also it looks ugly. Thats why I don't wanna show camera screen using a second mobile phone camera. Instead I want to access the camera screen from Computer.", "link": "https://www.reddit.com/r/Nikon/comments/gmlftg/dslr_veterans_can_i_access_my_camera_interface/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "i want to create a -----> tutorial !!!  video on youtube for the camera.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 23416, "year": "2020"}, {"autor": "natekillianfilms", "date": "2020-06-11 23:57:21", "content": "I made a tutorial about how you can turn your phone/tablet into an external monitor for your Sony Camera. Thought it might be helpful to other Sony users!", "link": "https://www.reddit.com/r/SonyAlpha/comments/h79poi/i_made_a_tutorial_about_how_you_can_turn_your/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  about how you can turn your phone/tablet into an external monitor for your sony camera.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 33592, "year": "2020"}, {"autor": "bradandersonjr", "date": "2020-08-20 14:53:25", "content": "Shoot true 24/30/60fps? [Sony a6000] /!/ Hey!   \n\n\nI'm looking into getting set up to do a DIY/Tutorial YouTube channel and I intend on using my a6000 as my video workhorse.    \n\n\nAs I spiral down the rabbit hole of information regarding shooting video and editing I've come across a lot of 24/30/60 and 24.976/29.97/59.9 information.  I have a decent understanding of these values so my question is, does the Sony a6000 film in true 24/30/60fps, or is it actual NTSC frame rates?  Can I record in true 24/30/60 fps?  \n\n\nI intend to do all my video editing with Davinci Resolve and audio recording with a Zoom H1n so I'm trying to get my foundation set so I can minimize any issues I'll have with developing my videos.  \n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/idbq7o/shoot_true_243060fps_sony_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "  \n\n\ni'm looking into getting set up to do a diy/-----> tutorial !!!  youtube channel and i intend on using my a6000 as my video workhorse.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 37668, "year": "2020"}, {"autor": "edom31", "date": "2019-02-08 17:11:36", "content": "Rechipping Sigma EX for 450D /!/ Hello - I found tutorials on how to Diy, but I just don't see the point in investing on the programing tools...\n\nDoes the community know of a person who does these rechippings?", "link": "https://www.reddit.com/r/canon/comments/aoinqf/rechipping_sigma_ex_for_450d/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hello - i found -----> tutorials !!!  on how to diy, but i just don't see the point in investing on the programing tools...\n\ndoes the community know of a person who does these rechippings?", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 58236, "year": "2019"}, {"autor": "wisby7676", "date": "2020-10-09 19:36:27", "content": "I made a tutorial for you, on how to take better iPhone photos! :) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/j85pgr/i_made_a_tutorial_for_you_on_how_to_take_better/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  for you, on how to take better iphone photos!", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 72349, "year": "2020"}, {"autor": "RVboulder", "date": "2020-02-15 17:21:15", "content": "Tips on making a set of your own Lightroom presets? /!/ I followed a tutorial online on a Lightroom preset, and really like how it makes my pictures look. However, the tutorial I watched only showed how to make one preset, and I want to make a whole set of presets that are similar to the one I watched on the tutorial. Does anyone have any tips on how to do this?", "link": "https://www.reddit.com/r/photography/comments/f4cfwc/tips_on_making_a_set_of_your_own_lightroom_presets/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "however, the -----> tutorial !!!  i watched only showed how to make one preset, and i want to make a whole set of presets that are similar to the one i watched on the -----> tutorial !!! .", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 74519, "year": "2020"}, {"autor": "LEOSVARAS", "date": "2020-05-07 06:21:22", "content": "Amateur photo contest /!/  Hello, everybody! I had planned to  organize a group with people who are starting or have left photography  because of confinement, with the purpose of practicing/ giving constructive criticism among us and once and for all continue improving the quality of the photos even in times of creative stagnation. It would also be an idea for them to apply with their close friends who are  already photographers and can have sessions that give them more experience even if they are not currently working on what they like.\n\nMy  idea is to choose a theme that everyone can have something to work on (not taking pictures from the window/balcony, as not everyone will have  windows in their house/it would be uncomfortable to take a picture from  there in certain types of buildings; banning pictures of pets or plants  for the same reason).\n\nThose who do not have a device to participate and feel like it could:\n\nBorrow a parent/brother's cell phone\n\nLearn to use lightroom to match the level\n\nReview some tutorials I could send you\n\nWhere  this contest would be held can be defined according to the comfort of  everyone, and for the moment it would not have a \"prize\" (apart from the  returns we make to each other, if it can be considered one). Once the  group has been created we will proceed to discuss what the content to be  exposed will be about. It would be great to be as inclusive as  possible, and get a space where people who have never taken pictures can  have more objective feedback than Instagram or Youtube offers. Once the  contest is over, the group could be dissolved or kept to project  another contest in the future, once everyone has better tools or has  noticed a change when trying with other cameras (360, lens, filter,  light or camera).\n\nI am from Latin America and I would like to have a circle of contacts in the community so that tomorrow I can go out on the streets as it should be and learn a lot. The situation in art is not easy and it is very common that most  artists have not yet had the opportunity to generate impact in the  professional field. You can talk to me privately to let me know that you  are interested and give me some contact. Also if the idea is very good in the sub could be responsible for organizing the same moderators to enrich the niche in Reddit.", "link": "https://www.reddit.com/r/photography/comments/gf17ro/amateur_photo_contest/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "we make", "selectorShort": "make", "MarkedSent": "\n\nthose who do not have a device to participate and feel like it could:\n\nborrow a parent/brother's cell phone\n\nlearn to use lightroom to match the level\n\nreview some -----> tutorials !!!  i could send you\n\nwhere  this contest would be held can be defined according to the comfort of  everyone, and for the moment it would not have a \"prize\" (apart from the  returns we make to each other, if it can be considered one).", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 79146, "year": "2020"}, {"autor": "SHH19", "date": "2020-05-19 09:23:35", "content": "DSLR Veterans - Can I Access My Camera Interface From Computer? /!/ I see in some YouTube videos tutors are showing camera interface on computer screen connecting the camera with the computer. Can anyone tell me how can I do so? Is there any special software dedicated for this? Can I do it in my Nikon 5000D camera? Any help will be highly appreciated.\n\nBackground: I have an old Nikon D5000 Camera. I want to create a tutorial video on YouTube for the camera. But the problem is my Camera display has big round vignette which can't be recorded using a mobile phone camera directly. Anyone can barely see the screen because of vignette. Also it looks ugly. Thats why I don't wanna show camera screen using a second mobile phone camera. Instead I want to access the camera screen from Computer.", "link": "https://www.reddit.com/r/photography/comments/gml8tj/dslr_veterans_can_i_access_my_camera_interface/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "i want to create a -----> tutorial !!!  video on youtube for the camera.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 79758, "year": "2020"}, {"autor": "GuyWithCam", "date": "2020-12-02 16:36:29", "content": "Black Pro Mist DIY Tutorial (Secret Advantages)", "link": "https://www.reddit.com/r/photography/comments/k5cnmt/black_pro_mist_diy_tutorial_secret_advantages/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "black pro mist diy -----> tutorial !!!  (secret advantages)", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 84802, "year": "2020"}, {"autor": "fotoloc0", "date": "2019-10-24 06:41:39", "content": "Used Negative Lab Pro for the first time, OMG, what a difference! Did anyone experience the same ? /!/ I downloaded the trial version of Negative Lab Pro and OMG, the 'developed' photos came out vastly different from what I got from the Epson V600 using epson scan directly. Now I don't know which version to trust :'(\n\nIs there something incorrect that I did during the conversion process ? I made sure to use the white balance tool and cropping within the negative before running Negative Lab Pro like the YouTube tutorial suggested.\n\nHas anyone else experienced this as well ?\n\n[Here](https://imgur.com/a/H5Ex3oG) is my previous scan using Epson scan which gave me the jpeg directly.\n\nAnd [here](https://imgur.com/NjNvSR6) is the version developed using Negative Lab Pro.\n\nHow do I know which is closer to what my film stock produces (Ektar 100) ?\n\nThanks for reading!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dmcj4h/used_negative_lab_pro_for_the_first_time_omg_what/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made sure to use the white balance tool and cropping within the negative before running negative lab pro like the youtube -----> tutorial !!!  suggested.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 95411, "year": "2019"}, {"autor": "DanielJStein", "date": "2021-04-16 13:38:25", "content": "Tired of pesky noise messing up your Milky Way shots? Let’s fix that with a little technique called image stacking. I wrote a guide on how to setup your camera to shoot a stack and clean up that noise in post! /!/ Aloha and welcome back to my derpy astro tutorial write-ups. As you may have recalled, [I wrote a piece last month on Milky Way photograpghy basics](https://www.reddit.com/r/photography/comments/lwucza/milky_way_core_season_is_right_around_the_corner/). Today I am going to continue this series and tell you about a game changing technique that you have probably maybe have already heard about. It is known as “image stacking.” The idea is to take several images over time out in the field and then use processing software later on to reduce the noise as a result of a darker, higher ISO image. **This tutorial uses a program called StarryLandscapeStacker. It is a paid Mac app**. *Rest assured, a Windoge version is coming soon, as is a version to do this in Photoshop*. **Plus, the most important part of stacking starts with getting it right when shooting.**\n\nTake a look at [this example of a 1:1 crop of what an image looks like before and after stacking.](https://i.imgur.com/lBqJKsT.jpg)\n\nThe technique requires more work, but as you can see the results speak for themselves. Some phones even have sophisticated programming to compute this process for you. Stacking is becoming more common with computational photography today, but it has been around since the film days of astrophotography. \n\nFirst of all, if you have not done so already, please [read my post](https://danieljstein.com/tutorials/milkywaybasics) on how to find and shoot the Milky Way to familiarize yourself with the techniques we will be discussing here. (Oh yeah and pls shoot RAW ok) Now, let’s move onto stacking, from start to finish. I will first be going over the core basics and describing parts of the process, then I will put everything altogether and summarize. Here we go00oo0000ooo:\n\n# Planning:\n\nStacking requires you stick to a shot for a few minutes. In other words, with single exposures, you can shoot one composition and move on to another immediately thereafter. But with stacking, you will need to setup your shot and shoot several exposures of it over time. This means leaving your camera in the same position for minutes at a time. It’s like standing in a line at a coffee shop or something.\n\nYou will really want to make sure you nail your composition before you begin this process, so take a few quick test shots before shooting your stack sequence to ensure you will be happy with the outcome. These don’t need to be long, just a few seconds with a ridiculously high ISO to understand your framing will do. Like crank it up to sandpaper levels and just do a 3 second shot.\n\nYou may have seen or heard of something called an “[intervalometer](https://www.bhphotovideo.com/c/search?InitialSearch=yes&amp;N=0&amp;Ntt=intervalometer&amp;sts=ma).” Complicated fancy word I know, but basically this is just a programmable remote that can control your camera’s shutter. They come in all different shapes and sizes. #realintervalometershavecurves Some cameras today even have this built in. Having one of these will greatly assist in this process.\n\nIf your camera has a built-in intervalometer, it is best if you familiarize yourself with this function prior to shooting your stack. Most Canon’s and Nikon’s have this built-in, as well as some Sony’s (I think?). They all operate differently, so I suggest you consult your camera’s manual or some YouTuber tutorials on how to use yours.\n\nI personally still prefer using an external intervalometer. I feel like the interface is a lot easier to control my camera versus the built-in ones. Plus, I can always see how many more shots are left in the stack. But, no pressure to get one of these if you have the function built in, use what makes you feel the most comfortable. If your camera does not have a built-in intervalometer however, I really do highly recommend getting one as it will make shooting stacks fully automated. Doing this process manually can be annoying af.\n\n# Calculating how many shots you need\n\nThe more shots you take, the cleaner the output stacked image will be. But, there is a point where diminishing returns kicks in. To keep things simple for this post though, I do not think that is something to worry about. Focus on shooting anywhere between 2 minutes to 30 minutes worth of shots, depending on what and how you are shooting.\n\nUse your intervalometer to figure out how long the sequence will take.  So let’s say according to the [NPF Rule](https://www.lonelyspeck.com/advanced-astrophotography-shutter-time-calculator/) you are going to have a 15 second shutter speed at f/2.8 and ISO 3200. If you dial in that you want 7 shots with a 1 second interval in between, that would be 112 seconds spend shooting. That is a pretty good chunk of data, but you can still get some more and get an even cleaner shot.\n\n**A few hot notes:** \n\n* Like I said, the more shots you get the better. If you find you are using a higher ISO like 6400 and above, it would be wise to get more shots.\n* If you are pressed for time in any way. For example clouds are rolling in, you gotta leave, you want to take other shots, you sandwich is getting cold, etc. then shoot less.\n* The tradeoff of shooting more shots is less noise and thus more detail.\n* If I personally am stacking I will usually go for 10-30 minutes of data for my nightscapes. Deep space is whole other ball game. For the purposes of this tut, we are focusing on nightscapes and the Milky Way with a wider lens.\n\nOnce you have toyed around with your intervalometer, shoot! Let the technology do the work for you. Set it and forget it. This is where not having the intervalometer will be dingly, because you will need to trigger the camera manually for each shot. \n\n### Now the biggy, programming your camera to shoot!!!1111!!!111!!1!11011001!!!!\n\nThere are two ways to do this as discussed. Either use your external intervalometer or your cameras built-in one. I will go over both, but just know that many intervalometers and cameras work differently. This is intended to be a guideline and the methods discussed here may not directly correlate to your setup. However, the concepts are very similar between cameras and remotes and this should help give you an idea of how to program. \n\n### Method 1: external remote:\n\n1. [Plug in your remote and set your camera to bulb mode](https://i.imgur.com/rQMkmoj.jpg). We want to give all shutter control to the remote.\n2. **Ensure long exposure noise reduction and self-timer are both off.**\n3. Dial in your other settings, such as ISO, aperture, white balance, and make sure your lens is in focus.\n4. Head over to your remote and power it on. [The first screen may indicate a delay.](https://i.imgur.com/bKeToa9.jpg) We do not need that for this so make sure everything shows a “0.”\n5. [The next screen](https://i.imgur.com/SjHtrZT.jpg)may show as “long” like my dog. He is long. This is your shutter speed. Dial it in according to the NPF rule.\n6. [The following is the interval.](https://i.imgur.com/VEnFq0Y.jpg) This is the duration between each shot. We want this as short as possible for easier processing. I set mine to “01” for 1 second.\n7. [The final screen is marked as “n.”](https://i.imgur.com/W43uaLq.jpg) This is the number of shots to do. I will do 20 for this round, giving me a total of 100 seconds of data. Eh, should probably do more.\n8. Press start and sit back while the technology does the work for you. \n\n### Method 2: Built-In\n\n1. Built-in intervalometers work a little differently to external. We want the camera to have full control here, so first step is to dial in your shutter speed. \n2. **Ensure long exposure noise reduction and self-timer are both off.**\n3. [Then dial in all your other settings, again ensure you are in focus.](https://i.imgur.com/So2MHhk.jpg)\n4. [Navigate to where the interval timer function is in you camera.](https://i.imgur.com/QOabPly.jpg)\n5. Make sure the time is set to[the time now](https://i.imgur.com/eEGnOG1.jpg)if your camera has that option. \n6. [Programming the interval is a bit different here](https://i.imgur.com/sABGQ2t.jpg). Unlike with the remote where the shutter speed was separate from the time between each shot, here it is integrated and can be a little confusing. In other words, my shutter speed is 5 seconds, but I sill want a 1 second interval beteen each shot. This means the total interval needs to be set to “6 seconds”\n7. [Set the number of shots to do, in my case again, 20.](https://i.imgur.com/EQqi714.jpg)\n\n# Processing\n\nAfter the shoot it is time to process. I mean yeah that is normally how it works but you get what I mean. There are loads of different pieces of free and paid stacking softwares out there. I personally use StarryLandscapeStacker (SLS), which is a **paid Mac application**. I will be creating an additional tutorial to use the Windoge free equivalent, Sequator as well. Both pieces of software are very similar however so if you have a basic understanding of a processing workflow you may be able to easily transfer this tutorial over to that one.\n\n1. First, we need to catalog everything in Lightroom or another similar raw image processor. While SLS can read RAW files, it is often easier to make some minor adjustments in something like LR or CaptureOne prior to loading into SLS.\n2. According to the SLS user guide, it is best to lower the contrast all the way, as well as turn off any sort of lens and vignette corrections. You also need to turn off noise reduction and sharpening. **My take:** Turn off sharpening and noise reduction, yes. But as far as contrast goes I find that sometimes dropping it down all the way and then trying to add it back in again later creates strange artifacts in the image. I would just leave this at 0. For lens corrections, your mileage may vary. Sometimes I get unwanted results with them on, sometimes with them off. You will need to experiment with this. I would first start with them **off.**\n3. I would also lower your highlights a bit and bump up the shadows a bit. I would adjust the exposure here as well if your image is too bright or too dark. **Do not** add any sort of clarity/texture/saturation adjustments however.\n4. Select all your images and apply your adjustments. \n5. Export as 16 bit TIFFs in the ProphotoRGB color space. **Do not resize your images!** Below are my export settings. If I were you, group your set of shots in a folder. This makes file management much easier to work with.\n6. Once complete, open up StarryLandscapeStacker and it will automatically prompt you to import your images. Locate the folder you made in the previous step and let em rip.\n7. SLS will automatically analyze your shots. If it detects any discrepancies, it will prompt you. It may ask you to select dark/light/flat frames. Don’t worry about these for now. Everything here is considered a “light” frame. I will talk about these other frames in a future tut.\n8. Once complete, you will notice red dottts all over your image. Red dots are what SLS uses to determine where the sky is and isn’t. With that in mind, you need to erase red dots where they are present in the foreground. Do this by clicking “erase red dots” over on the left. Wild, I know.\n9. The next thing that needs to be done in order for the software to work properly is some red dots actually need to be drawn back in following the horizon. Do so by clicking add red dots on the left. Draw your dots following your horizon line. It doesn’t need to be perfect. What we are doing here is telling the software where the foreground stops and the sky begins. This will improve how it aligns and stacks your images.\n10. Now it is time to make the sky mask. Click the “Find Sky” button on the left and watch SLS do magic.\n11. The mask will most likely not be clean right outta the box, so it needs to be cleaned up. At this point, we need to use the blue paint to make sure the entire sky is covered. Likewise, the ground needs to be completely blue free. Eifel 65 would not be proud of the ground. The sky on the other hand…\n12. If you are familiar with Photoshop, the brush works similarly to the one found in there. You can use the brackets to increase or decrease the brush size. You can also increase or decrease the opacity of the blue overlay if that helps you clean up the mask.\n13. In the end, only the sky should be blue. Try your best to clean up the horizon. It doesn’t need to be perfect (unlike my dog, who is perfect), there just needs to be absolutely no blue in the foreground. If you are not sure if you missed a spot, crank up the opacity of the blue. Missed a spot.\n14. Once the mask is ready to rave, mash that “Align and Composite” button on the left and let the show begin.\n15. At this point, SLS has used the mask to create two different photos which have been seamlessly blended together. The first is the sky photo, which has been aligned using the stars in each photo. Since the stars move relative to the Earth’s rotation, they need to be aligned.\n16. The second image is the foreground which does not move. There is no need to align these images. Doing so relative to the star layer would actually cause it to be blurred. Thus, it is stacked separately.\n17. There is a lot going on in the background of this software. In my opinion I feel like it is crazy how quick and effective it is. 2021 man. (altho pretty sure this joint came out in 2014)\n18. At this point, the software presents several algorithms you can choose from over on the left. If you hover over them, you will find a brief explanation of what they do. Play around with these and see which algo fits your image best. **My take:** I have had the best results with “Mean Min Horizon Noise,” and “Mean Min Horizon Star Dupe.” Again play around with these, your mileage may vary.\n19. Use the “Z” key to zoom in 100% while messing with these. This can help determine which one works best.\n20. Once complete, press “Save the Current” image. You can also save the mask you created with the blue paint. This can be helpful if you are masking in a different foreground image, for example if you took a blue hour foreground shot.\n21. Images will be saved as a 16-bit TIFF. Once you are done, continue with your edits by importing in an image editor of your choice.\n\n# Let’s Recap\n\nOkay so here is what we learned in boating school today kids. \n\n1. Plan out your shot by taking quick test compositions of what you want to shoot.\n2. Figure out how long it is going to take to shoot your stack. The more shots you shoot, the cleaner your image will be, but the longer it will take.\n3. Use an external intervalometer or your camera’s built-in function to take your shots.\n4. Once you get back to your computer, apply the same edits to each RAW file and export.\n5. Open the files in StarryLandscapeStacker and let it work its magic.\n6. Erase the dots in your foreground, and add dots in your sky and horizon where applicable.\n7. Find the sky and refine the mask with your brush, ensuring nothing in your foreground is painted.\n8. Composite your image and select an algorithm that works best for your shot.\n9. Save your image and enjoy an astro image that has significantly less noise than a single exposure. Continue working with your shot in your processing software of choice.", "link": "https://www.reddit.com/r/photography/comments/ms3bv1/tired_of_pesky_noise_messing_up_your_milky_way/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i will be creating", "selectorShort": "create", "MarkedSent": "i will be creating an additional -----> tutorial !!!  to use the windoge free equivalent, sequator as well.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 98544, "year": "2021"}, {"autor": "Jmeynn", "date": "2019-08-07 07:51:17", "content": "Started designing a magazine out of my own photos. I'm planning on documenting the whole thing with small tutorials on some of the effects I create.", "link": "https://www.reddit.com/r/photography/comments/cn2uvw/started_designing_a_magazine_out_of_my_own_photos/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i create", "selectorShort": "create", "MarkedSent": "i'm planning on documenting the whole thing with small -----> tutorials !!!  on some of the effects i create.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 793, "year": "2019"}, {"autor": "shian243", "date": "2019-07-19 09:39:43", "content": "What are some photography necessities a photographer should budget/shouldn't budget on? /!/ I know this varies, depending on the field of photography you want to do, and whether or not you're a pro or not.\n\nAfter my first camera, I see no reason to get lens and cameras brand new. Assuming that the second hand lens and cameras are well taken care of, it saves me so much money just by buying a second hand lens. You have more negotiating power with sellers, and sellers usually drop quite a substantial amount of money for you just because it's 'second hand' even though they might had spent 2 weeks with a lens and find out they didn't enjoyed it as much. There's always room to bargain for a better deal, and I don't really care for physical scratches and stuff as long as the equipment still function and perform. Plus, it's even cheaper if they are more 'damaged' \n\nThere's always the risk that the items you received may not be as stellar as the online marketplace says, but I've never really had issues, always communicate with the sellers and make sure the site you buy off from has some sort of buyer protection (like allow returns etc.) \n\nI've had friends asked me for opinions and recommendations about gear, and I just tell to find second hand markets if they want a decent quality equipment but on a budget, but they tell me 'but its not newww' \n\nTough luck, you gotta make a choice, and it's better on the wallet. \n\nI wouldn't cheap out on lighting equipment. I know there are DIY tutorials on making paper bowls into some tiny beauty dish, which is totally fine, if you're doing a home studio or doing portraits as a hobby. But I would just get a decent light shaper as a pro if I have clients, because, even though they might not be photographers, they'll be aware of build quality. But if you're able to DIY such that they don't look too shabby, then I think it's a pass (foam core and v flats are technically DIY stuff and alot of studio stuff are made from hardware shop items) \n\nLight stands and c-stands is sorta 50-50, while I wouldn't want a cheap crappy lightstand that can barely hold the weight of my light, I don't see a need to buy a really pricey c-stand since there are cheaper options and equally good ones found second hand or from aliexpress.", "link": "https://www.reddit.com/r/photography/comments/cf5iay/what_are_some_photography_necessities_a/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i know there are diy -----> tutorials !!!  on making paper bowls into some tiny beauty dish, which is totally fine, if you're doing a home studio or doing portraits as a hobby.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 6340, "year": "2019"}, {"autor": "pocoboi", "date": "2021-03-13 19:55:22", "content": "I made an easy to follow tutorial on how to add simple smoke and lightning effects to your image with downloadable effects", "link": "https://www.reddit.com/r/photography/comments/m4dxrz/i_made_an_easy_to_follow_tutorial_on_how_to_add/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made an easy to follow -----> tutorial !!!  on how to add simple smoke and lightning effects to your image with downloadable effects", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 5759, "year": "2021"}, {"autor": "Massdogg3", "date": "2021-02-22 12:33:01", "content": "In response to \"Anything goes Monday\" I created a Camera Basics tutorial!", "link": "https://www.reddit.com/r/photography/comments/lpmy99/in_response_to_anything_goes_monday_i_created_a/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i created a camera basics -----> tutorial !!! !", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 12587, "year": "2021"}, {"autor": "Divya_Abhishek", "date": "2021-04-02 04:30:40", "content": "I have made a tutorial video on how you can shoot night sky timelapse/starlapse (or even Milky Way timelapse if its visible from your place) using your ANDROID smartphone. No tripod or PC (for video rendering) required. Hope this video will help you guys:", "link": "https://www.reddit.com/r/photography/comments/micwi3/i_have_made_a_tutorial_video_on_how_you_can_shoot/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "i have made a -----> tutorial !!!  video on how you can shoot night sky timelapse/starlapse (or even milky way timelapse if its visible from your place) using your android smartphone.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 12958, "year": "2021"}, {"autor": "AlexNyeArt", "date": "2021-09-22 16:04:02", "content": "I made this detailed Photoshop Tutorial for Urban Photographers", "link": "https://www.reddit.com/r/photography/comments/ptaomm/i_made_this_detailed_photoshop_tutorial_for_urban/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made this detailed photoshop -----> tutorial !!!  for urban photographers", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 16846, "year": "2021"}, {"autor": "nam_arts", "date": "2018-10-25 22:44:09", "content": "Ive made a tutorial on how to make your own camera case, not just for vloggers, just sharing if some of you guys are interested", "link": "https://www.reddit.com/r/Cameras/comments/9rf57m/ive_made_a_tutorial_on_how_to_make_your_own/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "ive made", "selectorShort": "make", "MarkedSent": "ive made a -----> tutorial !!!  on how to make your own camera case, not just for vloggers, just sharing if some of you guys are interested", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 72800, "year": "2018"}, {"autor": "BradyBessette", "date": "2020-09-16 19:06:13", "content": "I made a tutorial on how to get cinematic soft lighting on faces, I hope it helps and people can take something from it!", "link": "https://www.reddit.com/r/Cameras/comments/iu26h6/i_made_a_tutorial_on_how_to_get_cinematic_soft/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  on how to get cinematic soft lighting on faces, i hope it helps and people can take something from it!", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 6036, "year": "2020"}, {"autor": "minimal-camera", "date": "2021-09-17 15:53:00", "content": "Recommend a camera for 90% video use and 10% travel/street photography /!/ TL:DR: Looking for a new small body camera mostly for video work, budget around $1000 USD.\n\nHowdy! First post in this sub, but I've been doing photo/video for over 20 years now. I'm looking for a new 'B cam' and wanted to get some input. My 'A cam' is a Canon 80D with EF-S 17-55mm f/2.8, which is perfect for indoor photo/video (and I have a variety of other canon EF and EF-S lenses as well, all of which are lower quality). My other DSLRs are also Canons with Magic Lantern (SL1 and 50D), which I plan to sell or give away, probably with some of my older lenses. And my phone is a Pixel 4, which has a decent camera, but I only really use it for still photos of my kid, and work stuff.\n\nFor the new camera I want to buy, the primary use-case will be over-the-shoulder or overhead flatlay video, I would use it for this 90% of the time. I have a YouTube channel and post everything there. Everything I publish is 1080p, but I'm somewhat interested in 4K for the ability to zoom in post (I make a lot of tutorials, so this would be very useful for highlighting something I'm talking about). I'm OK with sticking with 1080p though. I have a beefy computer (with GTX-1080 GPU) which should be able to handle 4K video editing, but I've never tried it.\n\nCurrently I don't use autofocus for video work, but instead I tend to use zone focusing. I'm happy to stick with this, but if the camera has high quality autofocus, I would probably use it. I would also prefer to have a flipout screen, and/or the ability to use an external monitor as a screen, to help with focus on overhead shots. One of my primary motivations for a new camera is the difficulty of getting a good in-focus video shot with the SL1 (I have it connected to a computer monitor to help with this, but still the results are often garbage).\n\nThe secondary use case (\\~10%) would be travel and street photography. I want something compact enough that it can fit in my pocket. I really prefer an OVF for street photography, but I don't think I'm going to get one here (a rangefinder style OVF would be fine with me). I don't like EVFs at all, if it is all digital then I would prefer to just use the screen.\n\nDecent low light video performance is also important to me, because I really don't enjoy sitting in my home studio with bright video lights. So I tend to shoot in warmer and dimmer light conditions (typically bouncing light off the wall or ceiling for a softbox effect). My SL1 video comes out pretty grainy a lot of the time in low light, but the 80D handles it no problem.\n\nIt would also be super nice if the video didn't have the stupid 30 min video recording limit, but I know most do. I'm used to working around that with my Canons, so no big deal. Another thing that is very convenient is the ability to power it with AC or USB power, and I'm happy to buy an adapter for this. This helps prolong battery lifespan and is just generally more convenient when I'm in my home studio. The ability to charge the camera battery via USB would be nice for travel.\n\nHere's an example of the problem I'm trying to solve. At the beginning of the video you'll see my A Cam (80D) shot looks nice:\n\n[https://youtu.be/xBXPumtlB04?t=8](https://youtu.be/xBXPumtlB04?t=8)  \n\n\nBut skip ahead and you'll see my B cam (SL1) overhead shot looks pretty bad, and where I zoom in on the screen in post looks downright terrible:\n\n[https://youtu.be/xBXPumtlB04?t=445](https://youtu.be/xBXPumtlB04?t=445)\n\n&amp;#x200B;\n\nI'm open to buying two separate cameras for these use cases, because I understand that asking a single camera to do both things is a lot to ask. Frankly it would be more convenient to have separate cameras. But the concern then becomes the cost. I'm comfortable with a budget in the $1000 USD range, and could stretch to $1500 USD. But I'm just not ready to plop down $2k-$3k.  \n\n\nOne camera I've looked at thus far is the Sony ZV-1. The price is right and it seems like a good fit for my B Cam video work, but I doubt its abilities as a travel/street photography camera. I also kind of hate the branding as a 'vlogger camera' but I can get past that :)  In the past I've also drooled over Panasonic and Fujifilm offerings. I'm definitely most comfortable with Canon, though their menu systems aren't great, I love the image quality. I've never got along all that well with Nikon, mostly because the zoom/focus ring being reverse of Canon lenses, which throws me off. I'm open to anything though.\n\nAt some point I'll create a post of my vintage film camera collection, I have shelves full of them :)\n\nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/pq2sqj/recommend_a_camera_for_90_video_use_and_10/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i make", "selectorShort": "make", "MarkedSent": "everything i publish is 1080p, but i'm somewhat interested in 4k for the ability to zoom in post (i make a lot of -----> tutorials !!! , so this would be very useful for highlighting something i'm talking about).", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 21381, "year": "2021"}, {"autor": "hvris", "date": "2019-11-29 23:04:43", "content": "Frustrated that you can't fit your Peak Design anchors onto your Fuji bodies because the hole is too small? I made a tutorial on how to do this!", "link": "https://www.reddit.com/r/fujifilm/comments/e3mpcm/frustrated_that_you_cant_fit_your_peak_design/", "origin": "Reddit", "suborigin": "fujifilm", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  on how to do this!", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 28768, "year": "2019"}, {"autor": "xIperbole", "date": "2018-09-25 13:42:50", "content": "How to use your α as a WEBCAM without any capture cards. https://www.youtube.com/watch?v=HaU4l6OjRpM /!/ Hello, i've been searching for a long time how to use my sony  α 5100 as a webcam without a capture card. \n\nRecently i came up with a solution and i decided to make a tutorial out of it to help those who need to use their camera as a webcam.\n\nThis is my first tutorial and i tried to make it as clear as possible but i still lack of experience. It is in italian but i've added english subtitles on YouTube to make it the most understandable to everyone i could.\n\nI hope it is usefull .\n\n[https://www.youtube.com/watch?v=HaU4l6OjRpM](https://www.youtube.com/watch?v=HaU4l6OjRpM)", "link": "https://www.reddit.com/r/SonyAlpha/comments/9is83q/how_to_use_your_α_as_a_webcam_without_any_capture/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "\n\nrecently i came up with a solution and i decided to make a -----> tutorial !!!  out of it to help those who need to use their camera as a webcam.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 34468, "year": "2018"}, {"autor": "emiliotakas", "date": "2018-11-08 12:34:57", "content": "[TUTORIAL] Color Grade S-Log /!/ Hello to the community. Would it interesting to share with you a tutorial I created of how to color grade S-Log footage in FCPX? I just didn't want to publish the video without asking first what would you think. Appreciate your answers.\n\nhttps://i.redd.it/xjmjidb3q3x11.jpg", "link": "https://www.reddit.com/r/SonyAlpha/comments/9v9lq5/tutorial_color_grade_slog/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "i created", "selectorShort": "create", "MarkedSent": "would it interesting to share with you a -----> tutorial !!!  i created of how to color grade s-log footage in fcpx?", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 38116, "year": "2018"}, {"autor": "soilliam", "date": "2021-06-27 20:01:49", "content": "Hey I just made a tutorial for converting dslr scans in lightroom, check it out if interested!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o94gea/hey_i_just_made_a_tutorial_for_converting_dslr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "hey i just made a -----> tutorial !!!  for converting dslr scans in lightroom, check it out if interested!", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 1892, "year": "2021"}, {"autor": "soilliam", "date": "2021-05-10 23:20:23", "content": "Hey I made a tutorial on my dslr scanning set up—check it out if you’re interested!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n9j2fd/hey_i_made_a_tutorial_on_my_dslr_scanning_set/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "hey i made a -----> tutorial !!!  on my dslr scanning set up—check it out if you’re interested!", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 9626, "year": "2021"}, {"autor": "sawyerhhh", "date": "2018-04-08 16:35:25", "content": "Building a Camera from SCRATCH for Under $40! | DIY Camera Tutorial", "link": "https://www.reddit.com/r/photography/comments/8ar2ph/building_a_camera_from_scratch_for_under_40_diy/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy camera -----> tutorial !!! ", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 14318, "year": "2018"}, {"autor": "homelessmuppet", "date": "2018-05-05 04:00:01", "content": "TUTORIAL: DIY Scrim Jim / Butterfly", "link": "https://www.reddit.com/r/photography/comments/8h52d9/tutorial_diy_scrim_jim_butterfly/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> tutorial !!! : diy scrim jim / butterfly", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 14924, "year": "2018"}, {"autor": "Zarzill", "date": "2018-06-19 14:15:15", "content": "I made a tutorial on how to take Milky Way photos with your phone /!/ Hey guys,\n\nI made a written tutorial and a video tutorial for anyone wanting to attempt astrophotography with their phone. It goes over the basics of camera settings through to planning which night to go out and take the photos.\n\n[Written Tutorial](http://www.matthewreillyphotography.com/blog)\n\n[Video Tutorial](https://www.youtube.com/watch?v=Aw0WUb2HhNo)\n\nLet me know if you guys have any questions or feedback for a follow up video.", "link": "https://www.reddit.com/r/photography/comments/8s96xs/i_made_a_tutorial_on_how_to_take_milky_way_photos/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  on how to take milky way photos with your phone /!/", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 15742, "year": "2018"}, {"autor": "brinked", "date": "2018-10-15 22:17:17", "content": "We get asked a lot about color correcting at our print lab, so I made a simple easy to follow tutorial", "link": "https://www.reddit.com/r/photography/comments/9ohgyv/we_get_asked_a_lot_about_color_correcting_at_our/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "we get asked a lot about color correcting at our print lab, so i made a simple easy to follow -----> tutorial !!! ", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 17006, "year": "2018"}, {"autor": "jordan917", "date": "2018-12-09 00:02:05", "content": "I made an in depth tutorial video on shooting and editing ring jewelry covering shooting, focus stacking and retouching.", "link": "https://www.reddit.com/r/photography/comments/a4g2vf/i_made_an_in_depth_tutorial_video_on_shooting_and/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made an in depth -----> tutorial !!!  video on shooting and editing ring jewelry covering shooting, focus stacking and retouching.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 17588, "year": "2018"}, {"autor": "vanillabambi", "date": "2018-06-05 16:44:41", "content": "DIY Diffusion Panel for Still Life Photography (+ bottle gradient tutorial)", "link": "https://www.reddit.com/r/photography/comments/8osci5/diy_diffusion_panel_for_still_life_photography/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy diffusion panel for still life photography (+ bottle gradient -----> tutorial !!! )", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 21247, "year": "2018"}, {"autor": "zparkar", "date": "2018-07-24 17:10:01", "content": "DIY Product Photography for your Ecommerce Store /!/ Check out my latest tutorial on product photography. What is your favorite software for product image processing?\n\n[https://medium.com/@materialgirlus/product-photography-for-beginners-a-thrifty-entrepreneurs-guide-7357468b4947](https://medium.com/@materialgirlus/product-photography-for-beginners-a-thrifty-entrepreneurs-guide-7357468b4947)", "link": "https://www.reddit.com/r/photography/comments/91ja7u/diy_product_photography_for_your_ecommerce_store/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy product photography for your ecommerce store /!/ check out my latest -----> tutorial !!!  on product photography.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 22880, "year": "2018"}, {"autor": "antongorlin", "date": "2018-01-21 07:45:16", "content": "I have created a massive Seascape tutorial guide. It covers planning, composition, camera settings, etc. Hopefully, it is useful for some of you guys.", "link": "https://www.reddit.com/r/photography/comments/7rwhlc/i_have_created_a_massive_seascape_tutorial_guide/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "i have created a massive seascape -----> tutorial !!!  guide.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 26740, "year": "2018"}, {"autor": "quangdog", "date": "2018-04-05 23:10:21", "content": "I made a tutorial video showing how I stretch my canvases with a beautiful gallery wrap using simple tools and stuff from a local home center. It's cheap and easy, and provides fantastic results. I'd love to know what you think of the process.", "link": "https://www.reddit.com/r/photography/comments/8a4j5s/i_made_a_tutorial_video_showing_how_i_stretch_my/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made a -----> tutorial !!!  video showing how i stretch my canvases with a beautiful gallery wrap using simple tools and stuff from a local home center.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 26748, "year": "2018"}, {"autor": "Its_Obvi_PShopped", "date": "2018-10-09 09:04:43", "content": "What would YOU like to see in a tutorial? /!/ Hello r/photography. (Obligatory Sorry mods if this isn't allowed)\n\nI have been a photographer for over 13 years and have worked in just about every facet of photography. From portraits, to weddings, products and fashion, my career has evolved and for the last 6-7 years I've been working as a commercial and advertising photographer for some pretty big brands. \n\nI recently moved to the UK with my family and have kind of hit the reset button a bit. Im continuing to work as a photographer but now I have a bit of freedom to focus on the next biggest thing I love about photography and that's teaching. In this ever flooded sea of youtube tutorials and how to's, I have decided to make the style of tutorial that I would like to see. Slightly different from whats out there because nobody has had the exact career and experiences that I have. \n\nI have been following r/photography for a while and there are a range of people here, from lifelong pros, to new hobbyists but I genuinely believe that everyone can learn a little something new. \n\nI have a list of about 30 different topics to touch on. Some videos being short and to the point photoshop tutorials, to some more in depth walk through type videos. I believe that even if Im touching on a topic that has 1000 other videos about it, perhaps my experience has put me in a position to explain things a little differently and if SOMEONE learns something, then I've accomplished my goal. \n\nIf I were to ask you, r/photography, what you want to see in videos. Whats something you would like to learn that you have yet to find a clear explanation on? I love the idea of a weekly reddit question where I answer in a video and can give a better detailed response with examples. \n\n", "link": "https://www.reddit.com/r/photography/comments/9mnk5z/what_would_you_like_to_see_in_a_tutorial/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i have decided to make", "selectorShort": "make", "MarkedSent": "in this ever flooded sea of youtube -----> tutorials !!!  and how to's, i have decided to make the style of tutorial that i would like to see.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 32323, "year": "2018"}, {"autor": "Amadeus_Ray", "date": "2018-08-28 11:03:58", "content": "How to ghost mannequin a head band? [product photography] /!/ I come from video production and I'm a bit nervous for my first product photo for a friend. It's going to be a sports head band and I need it to have the form of someone wearing it without seeing a person in it.\n\nDoing it for clothes like a shirt, I can make sense of the process from what I seen in tutorials but a head band, yikes. Any tips? \n\nIdeally I'd like to make it work more within the still than in post. \n\nExample:\n\nhttps://images-na.ssl-images-amazon.com/images/I/71ugFc%2B24DL._SL1500_.jpg\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/9axxrj/how_to_ghost_mannequin_a_head_band_product/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "\n\ndoing it for clothes like a shirt, i can make sense of the process from what i seen in -----> tutorials !!!  but a head band, yikes.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 36369, "year": "2018"}, {"autor": "coldfollow", "date": "2021-02-02 04:27:19", "content": "Looking to get into Cinematic Film...should I use C-LOG? Or not? And why? /!/ I have a Canon EOS 80D, and I’ve been really looking into shooting a more “cinematic-style”, and I’ve read many places that shooting in “LOG” can really open up post-production capabilities, and give me that look I want if I color grade and use a good cinematic LUT. I’ve done some tests with LOG and followed some solid tutorials online, and have came up with a really solid look, but before I dive too deep into it, just wanted to get some opinions of others.", "link": "https://www.reddit.com/r/canon/comments/landmu/looking_to_get_into_cinematic_filmshould_i_use/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i’ve done some tests with log and followed some solid -----> tutorials !!!  online, and have came up with a really solid look, but before i dive too deep into it, just wanted to get some opinions of others.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 41018, "year": "2021"}, {"autor": "Tappiocca", "date": "2020-09-17 17:55:58", "content": "Canon M6 MKII Autofocus Question /!/ Hello.\nI am using Canon M6 MKII (15-45mm lens at about 18\"-20\" away) to shoot 4K video with and I had a question about auto focus. I am making painting tutorial videos (objects that are between 2\"-3\" tall) with the zoom pulled back and then I use FCPX to zoom into my subject. When I allow the camera to Auto Focus, I am having issues where it keeps switching its focus to my hands/fingers and my subject is being blurred out. I know that I can allow the camera to set its focus and then freeze it on a specific object, but then if I move the subject up or down from that point it will loose focus. Should I be using a Spot or 1-Point Focus, I believe it is generally set for Zone Focus.", "link": "https://www.reddit.com/r/canon/comments/iuooxb/canon_m6_mkii_autofocus_question/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "i am making", "selectorShort": "make", "MarkedSent": "i am making painting -----> tutorial !!!  videos (objects that are between 2\"-3\" tall) with the zoom pulled back", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 51290, "year": "2020"}, {"autor": "arisjerome", "date": "2019-11-02 08:53:35", "content": "Youtube photography tutorials from an industry pro /!/ Hello my name is Aris Jerome and I'm a portrait photographer originally from California. I am licensed by Art Partner and have worked with many agencies across the world. Published in many magazines such as Vogue and Harpers Bazaar. Worked with brands such as Nike and HBO. I have created photography tutorials on my YouTube under Aris Jerome and am wanting to spread what I've learned over the years. I also am doing this to connect more with the photo community as most creatives keep their experience to themselves. Visit me on Youtube and ask me questions for my upcoming tutorials.", "link": "https://www.reddit.com/r/photography/comments/dqhmna/youtube_photography_tutorials_from_an_industry_pro/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "i have created photography -----> tutorials !!!  on my youtube under aris jerome and am wanting to spread what i've learned over the years.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 70700, "year": "2019"}, {"autor": "fisheveadventures3", "date": "2019-12-22 12:14:30", "content": "DIY - Christmas BOKEH Photography Ideas and Tutorial", "link": "https://www.reddit.com/r/photography/comments/ee49yv/diy_christmas_bokeh_photography_ideas_and_tutorial/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "diy - christmas bokeh photography ideas and -----> tutorial !!! ", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 78758, "year": "2019"}, {"autor": "maybevaibhav", "date": "2019-04-24 14:29:39", "content": "Tutorial - How to create a logo for your photography site /!/ I have written a tutorial on how to [make a simple logo in 4 mins](https://tricky-photoshop.com/how-to-make-a-logo-in-photoshop/?utm_source=Site&amp;utm_medium=Reddit&amp;utm_campaign=make_a_logo) in Photoshop. Let me know if you easily follow the tutorial or should I make the tutorial even simpler.\n\n&amp;#x200B;\n\nGIFs are also there in the tutorial to help you understand better.", "link": "https://www.reddit.com/r/photography/comments/bgvalk/tutorial_how_to_create_a_logo_for_your/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i make", "selectorShort": "make", "MarkedSent": "let me know if you easily follow the -----> tutorial !!!  or should i make the -----> tutorial !!!  even simpler.", "sortedWord": "tutorial", "Identifyer": null, "identifyer": 83864, "year": "2019"}], "name": "Reddsortedouttutorial"}