{"interestingcomments": [{"autor": "timp_bizkit", "date": "2019-01-21 11:37:50", "content": "Travel Lens Combinations for A7iii - Should I swap out my Zeiss 16-35 f4 for two smaller, lighter primes? /!/ Hey gang, \n\nI'l in the midst of planning a 9 month long backpacking trip through Asia and want to optimize my photography kit for this purpose. I currently own a Sony A7iii as well as the Zeiss 16-35 f4 and Sony 24-105 f4. I'm also bringing along my a6000 body as a backup and potentially use it when I need a more lightweight, compact option. \n\nI typically shoot landscapes but I would like to make sure the lenses I take along will allow me to adequately shoot in the wide variety of situations I'll find myself in, especially street photography, which is something I'd like to improve my skill in. I would like to also get more into astro but not having a lens for purpose is not a deal breaker.\n\nHaving traveled with these lenses in the past I typically shoot with the 24-105 around 80-90% of the time and I consider it an indispensable general purpose lens.  \n\nHowever, I generally use the Zeiss 16-35 f4 on a tripod for planned compositions, typically at the wider end of its focal length. This has led me to consider whether a lighter, faster, cheaper wide angle prime such as the Samyang AF 14mm f2.8 would be just as adequate for this purpose, especially while travelling where weight is a consideration. I could then use the extra cash to buy another lightweight prime like the Sony 50mm f1.8 to be used for street photography. \n\nWhat your thoughts are on the above lens options or is there another lens combination that you think I should consider? \n\nThanks :) ", "link": "https://www.reddit.com/r/SonyAlpha/comments/ai9bww/travel_lens_combinations_for_a7iii_should_i_swap/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "i would like to make", "selectorShort": "make", "MarkedSent": "\n\ni typically shoot landscapes but i would like to make sure the lenses i take along will allow me to adequately shoot in the wide variety of situations i'll find myself in, especially street photography, which is something i'd like to improve my -----> skill !!!  in.", "sortedWord": "skill", "Identifyer": null, "identifyer": 17354, "year": "2019"}, {"autor": "factysays", "date": "2020-06-20 07:01:35", "content": "FREE Advanced Adobe Photoshop Course /!/ Photography is an art. Just like a make-up, Photoshop makes your photography look a bit edgy!\n\nAdobe Photoshop is  the most widely used editing software, so of course the most demanding skill.\n\nBut we've come up with a solution! We've got you a FREE Advanced Adobe Photoshop Course that will equip you with great photography skills. \n\nWe've emphasized more on the advanced editing stuff. Some amazing tricks and skills that would make out outperform the others.\n\nGrab it now for free - bit.ly/adobephotoshopfreecourse", "link": "https://www.reddit.com/r/photography/comments/hchiug/free_advanced_adobe_photoshop_course/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "\n\nadobe photoshop is  the most widely used editing software, so of course the most demanding -----> skill !!! .\n\nbut we've come up with a solution!", "sortedWord": "skill", "Identifyer": null, "identifyer": 63921, "year": "2020"}, {"autor": "needfultosay", "date": "2020-09-01 03:02:08", "content": "Thematic Art Challenge /!/ I hope this will be allowed!\n\nI've created a discord server around a monthly Art Challenge that aims to focus more on thematic exploration than skill, while getting rid of the pressure to get likes and follows. I really hope to build a small community that creates a better space for support and growth where art gets the time, effort and attention it deserves. Any medium is welcome!\n\nFeel free to join! [https://discord.gg/KgZ99e](https://discord.gg/KgZ99e)", "link": "https://www.reddit.com/r/photography/comments/ikchz7/thematic_art_challenge/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "\n\ni've created a discord server around a monthly art challenge that aims to focus more on thematic exploration than -----> skill !!! , while getting rid of the pressure to get likes and follows.", "sortedWord": "skill", "Identifyer": null, "identifyer": 64525, "year": "2020"}, {"autor": "Minigiant2709", "date": "2020-09-19 01:33:50", "content": "Thank you for giving me the confidence to take pictures of people /!/ I have never addressed taking portraits of people on the streets on this subreddit but it is a conversation that is frequently brought up. Every time it is I read with great interest.\n\nTo those people who offer great advice, and encouragement I want to thank you. \n\nI am an expat in China and while I speak relatively good Chinese for a foreigner I am still subconscious about it. I always worry about taking pictures of people and then worry more about having to deal with any unwanted attention or disgruntled locals in a language that I'm outclassed in. \n\nThanks to this sub I finally got up the courage to just go and do it (And prepare a few key phrases I thought I might need). The pictures are nothing in comparison to my landscapes but hopefully now I can develop that skill set with a bit more confidence.", "link": "https://www.reddit.com/r/photography/comments/ivj5k8/thank_you_for_giving_me_the_confidence_to_take/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "the pictures are nothing in comparison to my landscapes but hopefully now i can develop that -----> skill !!!  set with a bit more confidence.", "sortedWord": "skill", "Identifyer": null, "identifyer": 64758, "year": "2020"}, {"autor": "FishtheFisher", "date": "2020-01-21 21:18:53", "content": "Constructive criticism? /!/ Hi Guys,\n\nI'm a chef and have been working in the industry for a long time, I'm in between jobs and the moment so decided to do some home cooking and set up a sub-reddit to pass a bit of time and keep my skills sharpe.\n\nI've been cooking and taking photo's of some of the food I've made but have come under criticism about my photography skills. I've taken pictures before but have never been an avid photographer and realize it's quite important when trying to set the scene or atmosphere of a dish or enviroment.\n\nMy sub reddit is here newish, I haven't concentrated on it much but have some spare time at the moment. I don't have cameras or specialized equipment just my phone, however the phone was ment to have the best camera in the shop when I bought it.\n\nMy sub reddit is [https://old.reddit.com/r/CarlsVeggiefoodSub/](https://old.reddit.com/r/CarlsVeggiefoodSub/) please don't mock my picture on the sub but if you can offer constuctive feed back here I'm willing to learn.\n\nMany thanks,\n\nCarl Heenan.", "link": "https://www.reddit.com/r/photography/comments/es18o6/constructive_criticism/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "\n\ni've been cooking and taking photo's of some of the food i've made but have come under criticism about my photography -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 68149, "year": "2020"}, {"autor": "FishtheFisher", "date": "2020-01-21 21:08:55", "content": "Constructive criticism? /!/ Hi Guys,\n\nI'm a chef and have been working in the industry for a long time, I'm in between jobs and the moment so decided to do some home cooking and set up a sub-reddit to pass a bit of time and keep my skills sharpe.\n\nI've been cooking and taking photo's of some of the food I've made but have come under criticism about my photography skills. I've taken pictures before but have never been an avid photographer and realize it's quite important when trying to set the scene or atmosphere of a dish or enviroment.\n\nMy sub reddit is here newish, I haven't concentrated on it much but have some spare time at the moment. I don't have cameras or specialized equipment just my phone, however the phone was ment to have the best camera in the shop when I bought it.\n\nMy sub reddit is [https://old.reddit.com/r/CarlsVeggiefoodSub/](https://old.reddit.com/r/CarlsVeggiefoodSub/) please don't mock my picture on the sub but if you can offer constuctive feed back here I'm willing to learn.\n\nMany thanks,\n\nCarl Heenan.", "link": "https://www.reddit.com/r/photography/comments/es13f6/constructive_criticism/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "\n\ni've been cooking and taking photo's of some of the food i've made but have come under criticism about my photography -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 68151, "year": "2020"}, {"autor": "shutterlove18", "date": "2020-02-02 17:22:04", "content": "Photography degree? /!/ I’m currently in graphic design even through photo has always been my passion. I chose design because I figured it was more practical and would give me more transferable skills. I include a lot of my photos in my projects, and I’ve had 3 professors now suggest I look into a photo major. I know a lot of my skills are innate- not that I’m claiming I’m some natural born expert. But what do you all think about pursuing a photography degree? Looking at internships, I find myself gravitating towards layout, lifestyle, and fashion.  I’m sorry for the biography, I just thought some context could help. Thank you!", "link": "https://www.reddit.com/r/photography/comments/exrni0/photography_degree/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i chose design", "selectorShort": "design", "MarkedSent": "i chose design because i figured it was more practical and would give me more transferable -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 68466, "year": "2020"}, {"autor": "foamoirefresher", "date": "2020-05-21 17:35:33", "content": "Struggling with Storytelling in photography - Discussion, Video, Images and Journal entry - Long Post! /!/ Im a part-time photographer and I used to have this real passion for landscape images.  I live on a relatively small island so seascapes, landscapes etc are abundant.  Anyway I have been feeling that I have exhausted all the spots on my island, visiting them throughout the years in different seasons, different light, times of day to get the best shots of the area.\n\nBut as of late, really since the beginning of the year it just doesn't seem to be cutting it anymore, I feel like its rinse and repeat, over and over again and since my other work has been slow since wedding have been cancelled and my other part time job I only work 10 hours a week it has got me into somewhat of a rut.\n\nI was looking back at my first few years of photographs from around 15-18 years ago, shooting on film, self developing and they all have such a quality to them, I look at them and I see this story, of my friends and I, hanging out, life growing up and it suddenly felt that I don't have this emotional connection with any of my current landscape images, my newer work or any photographs I have taken in the last 3-5 years.  \n\nI stopping picking up my camera, no clients and no desire to get out shooting so I just stopped.  This went on for a few weeks and I began to pick up my older DSLR and film camera and just casually shooting a couple of weeks ago, not really paying much attention but just trying to have fun, I watched a few youtube videos earlier this week and I began to think about what photography really meant to me.  I wanted to meditate on this idea and get some thoughts down on paper, this is what I wrote:\n\n&amp;#x200B;\n\n*‘What does photography mean to me?  Looking back at the beginning of my photography journey I’m not sure if it is nostalgia or just the great (but not always) memories but everything (the photographs) seem to have a more of a magical sparkle to them.  Things are just too easy now, I have every variable available to me at all times in post production that it seems to be a wish-list of skills and looks that is just rinse and repeat, image after image.*\n\n*Not photograph after photograph, these digital recreations of time is but a digital fingerprint of where I have been and what I have seen.  Emptiness, lifeless landscape image with nobody to share them with.  They only become photographs either when I print them to bring them into the physical world, or when that moment of capture is shared with somebody else.*\n\n*I have been a slave to the digital realm, focusing on sharpness, colour, micro-contrast, focus stacking, exposure bracketing, like seeking nothingness and it has not made me any happier, I think far from it.  And has it moulded me into an inferior photography?*\n\n*Maybe…*\n\n*Digital darkroom, photographic enhancement, luminosity masks and AI algorithms to stitch 120 megapixel monsters, pointless.  Look at me, I have the latest PANIKONY MK7ii with XY2 lens and every other accessory available to man.  But it is ok to use these, the question is should I?*\n\n*The landscapes I create used to mean so much to me finding perfection everywhere I go, the best light, composition, what filters, how to process and it all very well said and done, I have learnt many skills along the way, but at what sacrifice?  To no longer look at the world with fresh eyes, but just to see a look, a feed, no story soul or meaning.*\n\n*I want to narrow my focus, and that focus has to be relevant and have meaning, at least to me.  It is all about the story after all isn’t it?  To narrow my focus on the things that really mean something to me, my friends, family and life.  Adventure is everywhere, I feel like I was in such a rush to quit Funky (old job) and have time, that I quit more than that job when I left.  My work ethic has changed inside me, my fuel and fire has dwindled as I have had more opportunities.*\n\n*Is it because I feel I must suffer to succeed, No.  But I need to be challenged, to be inquisitive, to be interested.  Maybe if I was more interested in my own landscape images then somebody else would be too.  I think thats why I made them, for others to look at, but I’m still not sure what they see when they look at them.  There is no story or meaning to them and I’m not sure if just beauty is enough.*\n\n*Im not sure that this is a moment of self doubt, nut more the lines of realisation that a photographer can be whoever they want to be.  They don’t need to fit into genres or follow trends.  They don’t need to create new trends or even bring back old ones.  They don’t need to be bold and think big, they don’t need to be perfect and have all the answers.  I think the only thing a photographer needs is the passion to tell a story.  And I think it's time I carried on telling the only story I know.  Mine.’*\n\n&amp;#x200B;\n\nI felt like this really challenged my beliefs on what I was trying to do and get out of my images, where I wanted to see them and question who I was really pleasing.  Myself, a random person, or another photographer.  I think that its important to take steps back and re-evaluate whats happening in your photographic journey at whatever skill level you might be at.\n\nIt has led me to believe that I am just not that bothered about landscapes anymore and I don't really want to carry on pursuing them.  I am going back to older projects and coming up with new ideas of projects I want to do in the future to create the work that really means something to me.  \n\nIf you are relatively new to photography I think you should ask yourself what kind of images would you like to look back on in 20 years, what will tell that story for you.  If you are picking up a camera just to get likes and follow trends then you might just be wasting your time, and money.\n\nIf you are an experienced photographer I ask you this; \n\nWhat does photography mean to you and what are your goals or projects you are working on that captivates you over long periods of time?\n\n&amp;#x200B;\n\nI made a follow up video about my journal entry the next day which is [here](https://www.youtube.com/watch?v=XktF0GMqFgQ) if you want to check it out.\n\nAnd I also made a blog post discussing the same thoughts and ideas behind my struggles with storytelling in photography [here](https://www.luismoraisphoto.com/blog/my-struggles-with-storytelling-in-photography) if you want to check it out.\n\n&amp;#x200B;\n\nThanks for reading and have a great day!\n\n&amp;#x200B;\n\nLuis", "link": "https://www.reddit.com/r/photography/comments/go1awk/struggling_with_storytelling_in_photography/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i create", "selectorShort": "create", "MarkedSent": "but it is ok to use these, the question is should i?*\n\n*the landscapes i create used to mean so much to me finding perfection everywhere i go, the best light, composition, what filters, how to process and it all very well said and done, i have learnt many -----> skills !!!  along the way, but at what sacrifice?  to no longer look at the world with fresh eyes, but just to see a look, a feed, no story soul or meaning.", "sortedWord": "skill", "Identifyer": null, "identifyer": 69291, "year": "2020"}, {"autor": "Nuka-Cola1", "date": "2020-06-06 09:41:59", "content": "Can anyone recommend what lenses to use for different types of photography /!/ Hi, \n\nI'm new to all off this and I would love some advice. I have the canon M50 camera with EF-M15-45 IS  STM &amp; EF-M22 STM lens. I've took photos on my phone that people have loved and asked for them to have them printed. everything seems so easy on the phone lol, so camera is a bit scary.\n\nThe type of photography i would love to get into would be landscape I live in Scotland so the site you see here is just amazing.\n\nPortraits like kid portraits.\n\nStock photo a couple of family members have there own business so I would like to get into that to get them better pictures to help them grow. So ones got a bakery and the other does like high end car detailing and finally one does baby clothes, so she takes pictures of customers baby's in the clothes and uses them for her site.\n\nThen i would love to get into Wedding photography \n\nThe lenses I have with my camera can they do any of the above?\n\nSo the goal would be as I'm developing my skills up would be to make a little bit of money so I can invest that in more lenses and better equipment and to keep my subscription to lightroom and photoshop.", "link": "https://www.reddit.com/r/photography/comments/gxo0x0/can_anyone_recommend_what_lenses_to_use_for/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i'm developing", "selectorShort": "develop", "MarkedSent": "\n\nthen i would love to get into wedding photography \n\nthe lenses i have with my camera can they do any of the above?\n\nso the goal would be as i'm developing my -----> skills !!!  up would be to make a little bit of money so i can invest that in more lenses and better equipment and to keep my subscription to lightroom and photoshop.", "sortedWord": "skill", "Identifyer": null, "identifyer": 69516, "year": "2020"}, {"autor": "Jadafaa", "date": "2020-08-08 18:18:04", "content": "Improving my photography skills, what do you all think of this shot? what can I do better?", "link": "https://www.reddit.com/r/photography/comments/i63wvk/improving_my_photography_skills_what_do_you_all/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "improving my photography -----> skills !!! , what do you all think of this shot?", "sortedWord": "skill", "Identifyer": null, "identifyer": 70303, "year": "2020"}, {"autor": "truegamer90001", "date": "2020-04-21 07:21:39", "content": "Hey guys! I just wanted to ask some questions because I'm thinking of starting a career as a photographer /!/ Hi! So, for starters. I am quite young, I live In Ottawa ( if that help) and I want to be a photographer. I have the skill but in all honesty I just want to know how i can make a living off photography. It's a passion that I've had ever since I was little and I really enjoy it so I would love to make it my career. I just dont know how. I'm planning to take some courses in High School ( I'm 8th grade) and then hopefully go to Uni for it.  I know I'm just some kid on the internet but if you could help me out that would be Amazing!  \n\nHave a great day 💙", "link": "https://www.reddit.com/r/photography/comments/g5ap86/hey_guys_i_just_wanted_to_ask_some_questions/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "i have the -----> skill !!!  but in all honesty i just want to know how i can make a living off photography.", "sortedWord": "skill", "Identifyer": null, "identifyer": 78609, "year": "2020"}, {"autor": "wowbobwow", "date": "2020-11-28 22:59:21", "content": "Took an after-dinner walk, found a cool vintage Nikon camera set in a box on the sidewalk /!/ I've been trying to get into the habit of taking walks after dinner recently, so last night after we finished eating I headed out for a stroll around my neighborhood. I ended up walking by a \"Little Free Library\" - not sure if these are \"a thing\" in other parts of the world, but my town is heavily populated with these little things that look like a small cupboard on a pole, usually filled with random books or items for passers-by to take and enjoy. It was pretty dark so I used my phone flashlight to peek inside but didn't see anything that appealed to me. However, I did notice a cardboard box on the ground next to the Little Free Library, so I peeked in the box too. The box was mostly filled with kids books written in Chinese (I think - again, it was super dark), and just as I was about to give up, I spotted something unexpected: a camera lens. I dug a little deeper, and [here's what I ended up finding at the bottom of the box](https://imgur.com/a/P6jO5Ir): a Nikon F-301 SLR camera with a Nikkor 35-105mm zoom lens, a Sunpak flash unit, a small flipbook filled with colored lenses that slot into the flash unit, and a Sigma lens which looks to my untrained eye like it's intended for a newer Canon camera. Crazy! I grabbed it all up and hurried home, probably looking suspicious as hell LOL, but it was worth it.\n\nAs you can see in the album linked above, the camera itself is in surprisingly good condition given its age (the date-stamp sticker indicates it was made in 1985) - other than a bit of easily-cleaned corrosion in the battery compartment, it looks clean. I've never used a film camera as an adult (my mom *loved* her Kodak Disc Camera when I was a kid) and so I'm hopeful that it's functional - it would be so cool to try apply some of the skills I've been developing with my Sony Alpha a6400 over the past year to this camera, if it works!\n\nHappy for any tips, suggestions, guidance, etc. - I'm completely out of my depth here but excited to play and learn!\n\n**TL;DR:** Took a walk, found a cool old camera in a box of random free children's books, now excited to get it working and shoot some pics like it's 1985 again!", "link": "https://www.reddit.com/r/photography/comments/k2xof1/took_an_afterdinner_walk_found_a_cool_vintage/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i've been developing", "selectorShort": "develop", "MarkedSent": "and so i'm hopeful that it's functional - it would be so cool to try apply some of the -----> skills !!!  i've been developing with my sony alpha", "sortedWord": "skill", "Identifyer": null, "identifyer": 84718, "year": "2020"}, {"autor": "thenerdyphoto", "date": "2020-03-31 13:55:32", "content": "What are you doing to remain productive/hone your skills in isolation? /!/ I've been spending a lot of time organizing and putting together lists of things I can do at home to improve my business when this is all over. I came up with a list:\n\n \n\n* Hone skills. For me that means improving macro work\n* Revamp website - go through and pick new photos to add/re-design, etc.\n* Pivot marketing strategy - the world has changed and most likely will remain changed after this is over. That means approaching things in a different way, especially at the moment. Become a resource for your potential clients instead of just telling them they should book a shoot for when this is over.\n* Learn a new skill – take an online class or study up with some YouTube tutorials.\n* Add  new revenue streams – what can I add that will bring in new clients, or bring old clients back to hire you again!\n* Stockpiling blog posts. \n\nI also put together [a list of at home photo projects](https://nerdyphotographer.com/tips-techniques/at-home-photo-projects-challenges/) that photographers can do OR that people can do with their kids to keep them occupied since most of them can be done on a camera phone.\n\nSo what are you doing?", "link": "https://www.reddit.com/r/photography/comments/fsdbi7/what_are_you_doing_to_remain_productivehone_your/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i came up with a list:\n\n \n\n* hone -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 87383, "year": "2020"}, {"autor": "lilpanda95", "date": "2019-10-21 19:44:49", "content": "Is surreal composite / conceptual fine art photography a skill still in demand or appreciated? /!/ Hey everyone, I was wondering if Conceptual Fine Art / Surreal Composite/ Photo Manipulation photography still be in demand in these days and in the future? Like can I follow this path and not get starved lol\n\nThis is something I really enjoy doing and was wondering if I can make some money from it or a good skill that will be highly appreciate in the creative or marketing industry.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/dl5sg6/is_surreal_composite_conceptual_fine_art/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "like can i follow this path and not get starved lol\n\nthis is something i really enjoy doing and was wondering if i can make some money from it or a good -----> skill !!!  that will be highly appreciate in the creative or marketing industry.\n\nthanks!", "sortedWord": "skill", "Identifyer": null, "identifyer": 7627, "year": "2019"}, {"autor": "alcosexual", "date": "2021-08-28 23:24:10", "content": "Some lessons learned from my first restaurant shoot. /!/ I have been into photography for a couple years but my focus has been landscapes mostly. Recently I've been in touch with some friends who have opened a restaurant and I offered to come by and help them with photographs of the space and menus. I made sure that I was up front about my skill level. I spent many years working in restaurants so I know my way around them and always thought it would be cool to offer some marketing help as a side gig. This seemed like a good opportunity to learn and get experience with relatively low stakes.\n\nFor the shoot I arrived in early afternoon just as the restaurant was opening and shot till 9pm or so. I had my Sony A7iii, 90mm f2.8 macro, a 24mm f1.4, and a Speedlight with diffuser along with some modifiers.\n\n1.) Communication. These guys are my friends and they're very busy at the moment with the chaos of opening a new place, so communication with them about the date and time of my arrival was sporadic. In short, if I did this for paying clients I would insist on as much detail as possible. Where will I be shooting? How long will I have? How many dishes/cocktails will I shoot? Can I be near natural light (window) and still out of the way? \n\nBecause these details hadn't been worked out in advance, I worried needlessly over how much equipment to bring, how to organize my shoot, and what my shot list should be.\n\n2.) Timing when shooting a restaurant is really key. Time of day is important. You may want people in the restaurant so as to get some pictures of the place looking busy, but if it's too busy then the kitchen won't have time to make you dishes. If happy hour is popping off, the bartender isn't going to have time to make you cocktails. If you allow the chef to bombard you with dishes, garnishes may wilt, sauces will separate, and things will dry out before you're ready for them.\n\nSome things I'd do differently with future clients:\n\nPreparation: Visit the site prior to a shoot to take test shots of the space and identify good locations for setting up and shooting. Identify a shot list of things I want to catch during service. Where can I stand to get pictures of the line and be out of the way? Where will I be when the bar is packed during happy hour? Where are some sources of natural light? Is there space for me to set up a controlled scene for the plates?\n\nCommunication: Be direct and up front about physical and schedule needs. Manage expectations. Armed with some knowledge from the preliminary visit, convey where I'd like to be, what time I'll be arriving, when I'd like dishes to start coming, how many dishes they expect me to shoot, estimate how much time it will take to photograph each one.  \n\nTiming: Despite being on site from 4:00 to 9:00, I still felt like I hadn't given myself enough time, and I wish that I had divided the trip into two visits: one for space, crowd, and kitchen shots and then another for dishes and cocktails. Trying to do it all in one night was too much for me at this level of my journey. \n\nMostly I'm typing this out for me to remember what to do better. Lots of restaurants are opening back up and I think they're a very underserved and under-capitalized market. Small and medium independent owners often overlook photography and marketing and there's a lot that have the money and want to increase their presence on the web and just need to meet someone who understands their needs.", "link": "https://www.reddit.com/r/photography/comments/pdk8e9/some_lessons_learned_from_my_first_restaurant/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i made sure that i was up front about my -----> skill !!!  level.", "sortedWord": "skill", "Identifyer": null, "identifyer": 3499, "year": "2021"}, {"autor": "camhabib", "date": "2021-08-22 19:36:56", "content": "Editing tips / tricks / apps / lessons that elevated your post processing? /!/ First let me say that despite carrying a camera around with me for probably 3/4 of my life, I am very much an amateur photographer, probably not too dissimilar from many here. I’ve never had any formal training and have largely acquired any skill or knowledge through lots of trial and error. While this has allowed me to really develop my skills in some areas, it’s left me a bit lacking in others, namely my editing. I’m fairly proficient with Photoshop and Lightroom as far as the basics (and a bit beyond) go, but I feel like I could get a lot more out of my photos if I had a better grasp on things. Right now I’m shooting strictly digital, putting them through Lightroom with VSCO presets loaded on there, and just basically clicking around until I get something that looks decent to my untrained eye. Example of some of my work [here](https://www.camhabib.com/Select-Images).\n\nSo this leads me to my primary question: what tip / trick / app / lesson / anything else has helped move your editing game to the next level? Did you take some MasterClass course, find a preset pack, or pick up some tricks that really changed things for you? Looking back, short of going to school or working for a studio, what do you felt helped your editing the most?", "link": "https://www.reddit.com/r/photography/comments/p9j9kc/editing_tips_tricks_apps_lessons_that_elevated/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "me to really develop", "selectorShort": "develop", "MarkedSent": "while this has allowed me to really develop my -----> skills !!!  in some areas, it’s left me a bit lacking in others, namely my editing.", "sortedWord": "skill", "Identifyer": null, "identifyer": 3575, "year": "2021"}, {"autor": "obviologist", "date": "2021-01-03 13:59:46", "content": "Photography is my skill, not business, but I want to make photography my business... /!/ In my attempts to make money as a photographer I've always been thwarted by the business side of having a business (ironic I know) I've thought about finding someone who has business skills to do that end of things and allow me to shoot.  Is this pheasible? Anyone here struggled with the same thing, and what have you done about it?", "link": "https://www.reddit.com/r/photography/comments/kpl1rw/photography_is_my_skill_not_business_but_i_want/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "photography is my -----> skill !!! , not business, but i want to make photography my business...", "sortedWord": "skill", "Identifyer": null, "identifyer": 3980, "year": "2021"}, {"autor": "thebigrace", "date": "2021-01-20 06:18:12", "content": "Portrait Photographers: Do you feel you have a skill for coming up with unique concepts/set design/stylization? /!/ I'm an amateur portrait photographer who has mainly worked with models/friends. I've realized about myself that I don't feel like I'm super creative when it comes to conjuring up conceptual portrait ideas or even being able to suggest set design or wardrobe ideas. \n\nThe things I love about portrait photography are emotion, mood, energy, lighting, composition, editing, etc. Lately I've been feeling like that isn't enough to bring to the table and I'm not sure if I'm just being too hard on myself. \n\nI'd love to hear from other portrait pros/enthusiasts/hobbyists on this subject.", "link": "https://www.reddit.com/r/photography/comments/l13ddf/portrait_photographers_do_you_feel_you_have_a/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "portrait photographers: do you feel you have a -----> skill !!!  for coming up with unique concepts/set design/stylization? /!/", "sortedWord": "skill", "Identifyer": null, "identifyer": 4422, "year": "2021"}, {"autor": "CaptCardboard", "date": "2018-02-08 00:51:34", "content": "I weaseled my way into getting an interview as a lab tech in a camera shop. How do I ace it? /!/ In a desperate attempt to find work in Austin, I hit up a film camera shop asking if they needed a lab tech or any other help at the store. They didn't have a help wanted ad up or anything, but I actually got a response back and an interview scheduled for friday!\n\nMy darkroom skills are amateur and I've only developed C41 and B&amp;W films at home. I've only printed my own photos a couple times. I love working with antique cameras and definitely lust after several of them, but my knowledge might be inadequate for what they're looking for. Does anyone have any tips for getting in the door in this industry? I've been a semi professional photographer for years, but never worked for anyone else in the photo industry. I'd appreciate any insight!\n\nEDIT: Thanks for the responses folks! I'm mostly interested in things that I should say or aleady be aware of at the interview to ensure I get the job. I've never applied for a position like this before and it would be a dream to make it. I don't wanna screw it up!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7w0zsv/i_weaseled_my_way_into_getting_an_interview_as_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "i've only developed", "selectorShort": "develop", "MarkedSent": "\n\nmy darkroom -----> skills !!!  are amateur and i've only developed c41 and b&amp;w films at home.", "sortedWord": "skill", "Identifyer": null, "identifyer": 19653, "year": "2018"}, {"autor": "Rich_Firefighter_102", "date": "2021-09-15 18:43:38", "content": "HELP NEEDED!!😅 /!/ I am now into my 1st of photography,i owned a nikon d3100 3 months ago,i only shot cars cause i love them , i developed a lot my photography and editing skills with time,this week i am having my first photoshot for a client ,i have a Sigma 70-300 that i am using but i am sure that i need to do more close ups for the shot.\nIf you have any recommendations for where should i take those picture,what lens should i use etc.\nThanks i advance", "link": "https://www.reddit.com/r/Nikon/comments/pow89n/help_needed/", "origin": "Reddit", "suborigin": "nikon", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i am now into my 1st of photography,i owned a nikon d3100 3 months ago,i only shot cars cause i love them , i developed a lot my photography and editing -----> skills !!!  with time,this week i am having my first photoshot for a client ,i have a sigma 70-300 that i am using but i am sure that i need to do more close ups for the shot.", "sortedWord": "skill", "Identifyer": null, "identifyer": 54900, "year": "2021"}, {"autor": "flounderjaw", "date": "2018-06-22 14:38:42", "content": "Olympus OM-D E-M10 Mark II - Decent camera for YouTube videos? /!/ Just curious to know if the   Olympus EM10 Mark II would be able to hold up as a camera for making youtube videos (make up/tutorial type stuff)?I know the internal mic might not be all that great but I do have a standalone recording mic I could use and sync up later. Im looking to purchase a camera to learn photography and make YouTube videos with my SO. Logic tells me I should get the Canon Rebel t6i but I just can't keep my eye off the olympus for some reason. Does anyone have experience with it? I'm new to photography and looking to make this purchase so I can develop some photography skill which will be useful later on down the road. (I'm currently a background investigator but I am looking to make the move into surveillance investigations within the next year or two). Any insight or recommendations would be greatly appreciated.\n\n# ", "link": "https://www.reddit.com/r/Cameras/comments/8t1u0c/olympus_omd_em10_mark_ii_decent_camera_for/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "i'm new to photography and looking to make this purchase so i can develop some photography -----> skill !!!  which will be useful later on down the road.", "sortedWord": "skill", "Identifyer": null, "identifyer": 70493, "year": "2018"}, {"autor": "franikolai", "date": "2020-02-19 17:59:23", "content": "Need Help Deciding Between Nikon D3500 or Sony A6500 /!/ Yes, I know it's a totally obvious and unfair comparison but my question dives deeper than just camera specs. I am new to photography. I owned a Nikon a few years back but never really got into it so I ended up selling it. \n\nI want to get a camera that can take really nice pictures and help me develop my skills/style. The reason I am asking which one of these two cameras I should get is because I would love to get into photography again but (1) with my part time job it would take me forever to save up for the Sony and (2) I would probably have enough to get the Nikon next week but I don't want to buy something that won't take really nice pictures.. I guess my question is; will the Nikon be enough to take pictures worthy of being posted to the public, or will they look \"cheap\" and I should just save up for the Sony?", "link": "https://www.reddit.com/r/Cameras/comments/f6eirk/need_help_deciding_between_nikon_d3500_or_sony/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "me develop", "selectorShort": "develop", "MarkedSent": "\n\ni want to get a camera that can take really nice pictures and help me develop my -----> skills !!! /style.", "sortedWord": "skill", "Identifyer": null, "identifyer": 2546, "year": "2020"}, {"autor": "tino18_gameplay", "date": "2020-07-22 21:00:47", "content": "Should I upgrade my Canon G7x Mark II for a Sony A6000? /!/ I’m entering in the photography world and I need help for make a final decision,because I bought my Canon G7x Mark II for make vlogs but I made it a few times,I often take photos and a friend have offered change his Sony A6000 with a 28-70mm lens for my Canon G7x Mark II.\nBecause I personally need to improve my skills in photography \nShould I say Yes?", "link": "https://www.reddit.com/r/Cameras/comments/hw22rl/should_i_upgrade_my_canon_g7x_mark_ii_for_a_sony/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "but i made it a few times,i often take photos and a friend have offered change his sony a6000 with a 28-70mm lens for my canon g7x mark ii.\nbecause i personally need to improve my -----> skills !!!  in photography \nshould i say yes?", "sortedWord": "skill", "Identifyer": null, "identifyer": 7838, "year": "2020"}, {"autor": "alexl1994", "date": "2021-01-11 22:19:06", "content": "Which lens completes this collection? Looking for a standard zoom for Canon APS-C cameras /!/ I'm a hobbyist/enthusiast photography shooting on a Canon EOS 90D. I primarily shoot landscapes, wildlife (when the occasion calls for it), and street/urban photography.\n\nAs I develop my skills and move away from kit lenses, I've bought a **Sigma 18-35mm f/1.8** and a **Canon 70-200mm f/4L**. I love the wide aperture of the Sigma, and the focal range isn't as limiting as I originally thought it'd be. Even though I don't often find myself needing something in the 40/50/60mm range, it *does* feel like there's a big gap between these two lenses, and I'd like to fill it.\n\nSo, what fills the space of that 35-70mm range? I've looked at the:\n\n* Canon 17-55mm f/2.8, which I'm worried has too much focal-length overlap with the Sigma and so one wouldn't get used much compared to the other\n* Several 24-70mm f/2.8 lenses—these seem to be for full frame but might also be compatible with APS-C (at least in the case of the Sigma 24-70mm); these also have the most attractive focal length, but again compatibility might be an issue\n* Sigma 50-100mm f/1.8, which would complement the other Sigma well\n\nAny thoughts?", "link": "https://www.reddit.com/r/Cameras/comments/kvdn4o/which_lens_completes_this_collection_looking_for/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "\n\nas i develop my -----> skills !!!  and move away from kit lenses, i've bought a **sigma 18-35mm f/1.8** and a **canon 70-200mm f/4l**.", "sortedWord": "skill", "Identifyer": null, "identifyer": 17036, "year": "2021"}, {"autor": "bluelectricurrent", "date": "2021-02-12 21:27:09", "content": "I need your guys help! /!/ I am currently in search of a camera. I would say I’m a past beginner, but definitely not in the intermediate zone. I’m looking for something that can take magnificent stills as well as amazing, *professional looking* video. I want to develop my skills further in photography and videography. My budget is $500-700(max). Any help or suggestions would be greatly appreciated! Thanks much.", "link": "https://www.reddit.com/r/Cameras/comments/lil7gu/i_need_your_guys_help/", "origin": "Reddit", "suborigin": "Cameras", "result": false, "Selector": "i want to develop", "selectorShort": "develop", "MarkedSent": "i want to develop my -----> skills !!!  further in photography and videography.", "sortedWord": "skill", "Identifyer": null, "identifyer": 18722, "year": "2021"}, {"autor": "pud110", "date": "2019-02-24 15:04:55", "content": "X-T100 (new) or X-T20 (used) for beginner? /!/ Have decided on Fujifilm over Sony and Panasonic and is pretty much new to mirrorless camera (moving from smartphone camera...yes smartphone).\n\nWhat would you recommend between the two as a beginner? Camera will be used mostly for casual / travel (landscape, street, city, food). Once I develop more skills, may use it for casual blogging. For application, \\~70% Still photos and maybe 30% or even less for Video (1080p, do not care about 4K). Budget is somewhat limited taking into account of the lens. Thanks.", "link": "https://www.reddit.com/r/fujifilm/comments/au8qmd/xt100_new_or_xt20_used_for_beginner/", "origin": "Reddit", "suborigin": "fujifilm", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "once i develop more -----> skills !!! , may use it for casual blogging.", "sortedWord": "skill", "Identifyer": null, "identifyer": 26299, "year": "2019"}, {"autor": "jakedeleon", "date": "2018-11-28 16:14:44", "content": "Looking to upgrade from my RX100 IV /!/  \n\nI am currently shooting with the Sony RX100 IV. I originally got this camera because I was looking for something lightweight but high quality that I could take on my frequent hiking and backpacking trips. It’s definitely served me well, but I feel as though I am pushing the limits of what it is capable of. The fixed 24-70mm equivalent lens has hindered me when trying to get some of the shots I would like, specifically wide angle astros and landscapes, as well as telephoto for wildlife. I am looking to make the jump to a body that will allow me to expand my focal range with new lenses and grow my skill in landscapes.\n\nI have been evaluating my options and am unsure what would be best for me. I would love to get the A7iii, but I’m not sure I can afford $3k+ for the body and a good starting lens. To lower the price, I’ve been looking at the A7ii and the a6000. I know the A7ii is a significant downgrade over the A7iii, but at sub $1k for the body it seems like a good deal, especially as an introduction to full frame mirrorless cameras. The other option is the a6000, but that means giving up full frame for APS-C. I am not the biggest fan of the a6000 body style, but anything probably feels better in hand than my tiny RX100. Generally speaking, video capability is not a huge concern me as I almost exclusively shoot stills.\n\nWhat do you think would be the best option for me?", "link": "https://www.reddit.com/r/SonyAlpha/comments/a17lrl/looking_to_upgrade_from_my_rx100_iv/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": false, "Selector": "i am looking to make", "selectorShort": "make", "MarkedSent": "i am looking to make the jump to a body that will allow me to expand my focal range with new lenses and grow my -----> skill !!!  in landscapes.", "sortedWord": "skill", "Identifyer": null, "identifyer": 42271, "year": "2018"}, {"autor": "concretestudiosla", "date": "2018-04-11 10:09:37", "content": "Develop photography skills with Studio space available for rent", "link": "https://www.reddit.com/r/photography/comments/8bfxoz/develop_photography_skills_with_studio_space/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "develop photography -----> skills !!!  with studio space available for rent", "sortedWord": "skill", "Identifyer": null, "identifyer": 18946, "year": "2018"}, {"autor": "thehedgefrog", "date": "2021-07-29 19:39:24", "content": "A \"thank you\" to the salesperson that convinced me to spend more money, or how I got the passion back. /!/ I recently found myself in the unique position to start anew with photo gear. I had a Rebel XTi (400D) that I bought new when it came out and a handful of cheap EF-S lenses that I used to take tens of thousands of shots over 8-10 years. It made me develop frankly the only artistic skill that I possess and has been very rewarding. \n\nHowever, over the last few years, I progressively took less and less photos as I was hitting the limits of my equipment, and I barely touched the camera in the last 18 months. A friend lent me his 5D IV for a week and I fell right back in it, so I figured it was time for me to get some new gear. I went to my trusted local store and asked to see the 6D II and the Nikon D760, as I always look to competition to compare when I upgrade gear. \n\nI initially felt a bit insulted that the salesperson considered those less than ideal choices and encouraged me to try mirrorless, citing the DSLRs being a slowly dying breed and mirrorless being the future. Mind you, I thought the EVFs had not changed much since the family's camcorder we had when I was a child.  He then pulled out a D760, a 6D II and an R6, brought them to a separate room along with a handful of lenses and told me to take as much time with them as I needed, and then sleep on it/read up on the camera before making up my mind. \n\nIt didn't take me 5 minutes to figure out that the R6 was what I wanted, and what I later read only confirmed that.  Obviously, I'm glad that I could stretch my budget, but I have to recognize I should have approached it with more of an open mind. \n\n2 weeks later, I can say that my R6 with the RF 24-105 f/4 L is absolutely perfect, and I'm already researching my next glass.", "link": "https://www.reddit.com/r/canon/comments/ou4ngl/a_thank_you_to_the_salesperson_that_convinced_me/", "origin": "Reddit", "suborigin": "canon", "result": false, "Selector": "me develop", "selectorShort": "develop", "MarkedSent": "it made me develop frankly the only artistic -----> skill !!!  that i possess and has been very rewarding.", "sortedWord": "skill", "Identifyer": null, "identifyer": 38634, "year": "2021"}, {"autor": "videochatwithgod", "date": "2020-05-25 17:54:03", "content": "First time developing and scanning at home. Really happy how it turned out. Might have been a bit underexposed. I'm not sure if that was the cameras fault or my developing skills (Or lack of). Shot with a Konica ef3 on Kodak gold. Does anybody have any tips for washing the film after development?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gqfnyc/first_time_developing_and_scanning_at_home_really/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": false, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "i'm not sure if that was the cameras fault or my developing -----> skills !!!  (or lack of).", "sortedWord": "skill", "Identifyer": null, "identifyer": 63222, "year": "2020"}, {"autor": "Keinwa", "date": "2019-11-12 09:38:24", "content": "Improve your mindset not your skills. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/dv7rpu/improve_your_mindset_not_your_skills/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "improve your mindset not your -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 70752, "year": "2019"}, {"autor": "oregano_13", "date": "2019-05-18 01:35:13", "content": "What is the Photo Editing Line? /!/ Im not a professional photographer, but I take as many photos as I can where I go of flowers and plants. it's really a hobby of mine, but this question has been nagging my mind for quite awhile.\n\nWhen editing your photos, how much is too much in your opinion? I'm worried I won't develop my skills if I rely on editing, but I know many people still tweak their photos. \n\nI can send some before and after photos of the ones I've edited if I can find them, but they might be deleted. I really would appreciate the help.\n\nps love all of the photos here, y'all are so talented!!!", "link": "https://www.reddit.com/r/photography/comments/bpziqr/what_is_the_photo_editing_line/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i won't develop", "selectorShort": "develop", "MarkedSent": "i'm worried i won't develop my -----> skills !!!  if i rely on editing, but i know many people still tweak their photos.", "sortedWord": "skill", "Identifyer": null, "identifyer": 75131, "year": "2019"}, {"autor": "Mohamedmdi", "date": "2019-02-28 09:29:12", "content": "Feel free to criticize /!/ Hi, so i really love taking pictures, and i'm stunning with idea of \"*taking  split second of life*\", i do shots from now and then, but i don't call my self an expert at all, i really like to improve my photography skills, as the gear as well - and i know the skills  is way more important than the gears, if u have skills and not great gear you could make better results anyway and vice versa- \nSo as the title said feel free to criticize and here is my insta profile : **the.mohamed.chergui**\nI really want to hear from you the mistakes that i made whether it's composition, colors, better choices anything. \nThanks. \n", "link": "https://www.reddit.com/r/photography/comments/avp6uw/feel_free_to_criticize/", "origin": "Reddit", "suborigin": "photography", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": " is way more important than the gears, if u have -----> skills !!!  and not great gear you could make better results anyway and vice versa- \nso as the title said feel free to criticize and here is my insta profile : **the.mohamed.chergui**\ni really want to hear from you the mistakes that i made whether it's composition, colors, better choices anything.", "sortedWord": "skill", "Identifyer": null, "identifyer": 81412, "year": "2019"}], "name": "Reddsortedoutskill"}