{"interestingcomments": [{"Unnamed: 0": 217, "autor": 217, "date": null, "content": "Pronounced as \"huːbz\"\nBuild your Smart Home with HOOBS. Connect over 2,000 Accessories from your favorite ecosystems.\nWhat is HOOBS?\nHOOBS™ makes smart accessories compatible with your favorite ecosystem. Whether you prefer Apple Homekit™, Google Home™, or Amazon Alexa™, you’re unlikely to find compatible accessories and services that all work together nicely under one roof.\nThere are many different Smart Home Solutions out there, but many of them are still built as walled garden. HOOBS™ is here to close the gaps make connections to all different kind of home automation system and bring them together and communicate with eachother.\nWe believe your choice of an ecosystem should not dictate which accessories you can purchase and use. HOOBS™ aims to unify and simplify your smart home. It is designed to be accessible for beginners, yet robust and versatile for advanced users, opening a world of possibilities for automating your home.\nHOOBS Community\nHOOBS Website\nHOOBS Support\nPlugin Community\nLegal\nHOOBS™ Inc. CP 3211 L’Assomption, QC J5W 4M9, Canada\nHOOBS™ and the HOOBS™ logo are registered trademarks of HOOBS™ Inc.\nCopyright (C) 2020 HOOBS™ Inc. All rights reserved.\nThe products supplied are not certified for/to use with products of Apple Inc. / Alphabet Inc. / Google LLC / Amazon.com, Inc. HOOBS™ assumes no liability for wrong use of delivered products in connection with products from Apple Inc. / Alphabet Inc. / Google LLC / Amazon.com, Inc. or any other third party product. A warranty for legal deficiencies is excluded. HOOBS™ is not in any way afflilated or endorsed by Apple Inc. / Alphabet Inc. / Google LLC / Amazon.com, Inc. or any subsidiary companies related to companies mentioned.", "link": "https://github.com/hoobs-org/HOOBS", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "pronounced as \"huːbz\"\nbuild your smart home with hoobs. connect over 2,000 accessories from your favorite ecosystems.\nwhat is hoobs?\nhoobs™ makes smart accessories compatible with your favorite ecosystem. whether you prefer apple homekit™, google home™, or amazon alexa™, you’re unlikely to find compatible accessories and services that all work together nicely under one roof.\nthere are many different smart home solutions out there, but many of them are still built as walled -----> garden !!! . hoobs™ is here to close the gaps make connections to all different kind of home automation system and bring them together and communicate with eachother.\nwe believe your choice of an ecosystem should not dictate which accessories you can purchase and use. hoobs™ aims to unify and simplify your smart home. it is designed to be accessible for beginners, yet robust and versatile for advanced users, opening a world of possibilities for automating your home.\nhoobs community\nhoobs website\nhoobs support\nplugin community\nlegal\nhoobs™ inc. cp 3211 l’assomption, qc j5w 4m9, canada\nhoobs™ and the hoobs™ logo are registered trademarks of hoobs™ inc.\ncopyright (c) 2020 hoobs™ inc. all rights reserved.\nthe products supplied are not certified for/to use with products of apple inc. / alphabet inc. / google llc / amazon.com, inc. hoobs™ assumes no liability for wrong use of delivered products in connection with products from apple inc. / alphabet inc. / google llc / amazon.com, inc. or any other third party product. a warranty for legal deficiencies is excluded. hoobs™ is not in any way afflilated or endorsed by apple inc. / alphabet inc. / google llc / amazon.com, inc. or any subsidiary companies related to companies mentioned.", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000217, "year": null}, {"Unnamed: 0": 547, "autor": 547, "date": null, "content": "Home Assistant Configuration by @Norien\nThis is my Home Assistant configuration running in docker on an Intel SkullCanyon NUC\nSoftware on the server:\nUbuntu Desktop 18.04\nHome Assistant\nGlances\nMosquitto\nPi-Hole\nKodi\nPlex w Pass\nZoneminder\nDevices in Use:\nUniFi USG\nUniFi AC-PRO\nUniFi UAP\nNest Thermostat - 2nd Gen\nNest Protect - 1st Gen\nEcho Dot Gen 2\nGoogle Home\nGoogle Home Mini\nChromecast\nChromecast Audio\nD-Link DCS 933L\nD-Link DCS-936L\nWyze Cam v2 / rtsp\nPhilips Hue A19 RGB\nPhilips Hue A19 White\nPhilips Hue A19 White Ambiance\nPhilips Hue GU10 RGB\nPhilips Hue GO\nPhilips Hue Dimmer Switch\nPhilips Hue Motion Sensor\nWeMo Garden Spot\nWeMo Switch\nWeMo Light Switch\nRaspberry Pi 1 Model B\nRaspberry Pi 3\nRaspberry Pi Zero W\nH801 Wifi RGB Controller\nCarlon RC3105R Modded to NodeMcu for Doorbell\nTP-Link HS110\nTP-Link LB130\nFlic Wireless Smart button\nSonoff WiFi Smart Switch - Firmware\nSonoff Dual WiFi Smart Switch - Firmware\nSonoff POW - Firmware\nSonoff SV - Firmware\nWeMos D1 Mini\nNodeMcu ESP8266\nNortek Z-wave Adapter\nNanoleaf Aurora Rhythm\niRobot Roomba 690", "link": "https://github.com/Norien/Home-Assistant-Config", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "home assistant configuration by @norien\nthis is my home assistant configuration running in docker on an intel skullcanyon nuc\nsoftware on the server:\nubuntu desktop 18.04\nhome assistant\nglances\nmosquitto\npi-hole\nkodi\nplex w pass\nzoneminder\ndevices in use:\nunifi usg\nunifi ac-pro\nunifi uap\nnest thermostat - 2nd gen\nnest protect - 1st gen\necho dot gen 2\ngoogle home\ngoogle home mini\nchromecast\nchromecast audio\nd-link dcs 933l\nd-link dcs-936l\nwyze cam v2 / rtsp\nphilips hue a19 rgb\nphilips hue a19 white\nphilips hue a19 white ambiance\nphilips hue gu10 rgb\nphilips hue go\nphilips hue dimmer switch\nphilips hue motion sensor\nwemo -----> garden !!!  spot\nwemo switch\nwemo light switch\nraspberry pi 1 model b\nraspberry pi 3\nraspberry pi zero w\nh801 wifi rgb controller\ncarlon rc3105r modded to nodemcu for doorbell\ntp-link hs110\ntp-link lb130\nflic wireless smart button\nsonoff wifi smart switch - firmware\nsonoff dual wifi smart switch - firmware\nsonoff pow - firmware\nsonoff sv - firmware\nwemos d1 mini\nnodemcu esp8266\nnortek z-wave adapter\nnanoleaf aurora rhythm\nirobot roomba 690", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000547, "year": null}, {"Unnamed: 0": 749, "autor": 749, "date": null, "content": "$ raspap-awesome\nThis list is a collection of projects, tutorials, public access points, GitHub forks and applications either based on or using RaspAP as a component in one form or another.\nContributions are very welcome. See contributing.\nWhy this repo?\nThe open source community is doing amazing things with RaspAP. Just when we think we've seen it all, something new and unexpected comes along. With the low cost of the Raspberry Pi and the ease of setup with our famous Quick Installer, RaspAP-powered projects are popping up all over the globe. Do you run a public or personal access point powered by RaspAP? Have an innovative project you've developed with it? Showcase your resource here!\nProjects\nCarry your Mobile Kubernetes - Kubernetes Cluster using RaspAP in wifi client AP mode with an iPad Pro\nConnecting a Raspberry Pi, iPad, HoloLens, and Magic Leap ML1 - via @mikebuss 🏆\nCreate your own portable RFID pentest kit - Based on the Proxmark 3 with RaspAP for remote control over wifi\nDrumming robot - MIDI drum machine to complement live electronic music\nEnerserve Smart Pi - A smart energy meter based on the Raspberry Pi\nFreedomEV - Unlocking the full potential of Linux on your EV ( 📸 RaspAP on a rooted Tesla )\nHam Radio Winter Tent Camping | Winter Field Day - Preparedness & off-grid communications 📽\nInteractive media installation at the Helinä Rautavaara Museum, Finland\nLow-cost wireless endoscope camera: a preliminary report\nPool pH Level and Temperature Wifi Monitor ( 📸 Project photo )\nSecure Scuttlebutt Weather Station - Replicating, peer-to-peer database of weather log data\nTravelPlex - a portable, offline 1TB Plex shared media server\nV1 Engineering - RPi-powered OctoPrint, CNC.js, CNC control from your phone\nWiPi – A RaspberryPi Hotspot To Go - AP & portable local network with a Sixfab cellular HAT, built for travel\nWiFi Access points\nStaying connected in Italy during coronavirus lockdown - tweet via @lewixlabs\nTelescope configured with PiZeroW, Rpi_Cam and RaspAP ( 📸 Project photo )\nWiFi Hotspot for the Garden\nTutorials\n5 minutes pour créer son hotspot Wifi sur Raspberry Pi\nAdafruit: RaspAP WiFi Configuration Portal\nCartographie faible coût et partagée à base de raspberry Pi et Opencpn\nBitblokes.de: RaspAP – Raspberry Pi als Hotspot / Access Point (WLAN / Wi-Fi)\nBitblokes.de: VPN router with Raspberry Pi, RaspAP and NordVPN / OpenVPN (simple)\nBitreporter.de: Raspberry Pi als WLAN-Hotspot nutzen\nBuilding private WiFi hotspot with RaspberryPi, RaspAP, and VPN\nConfigurer un serveur MQTT avec Raspberry Pi\nCreate a Wi-Fi hotspot in less than 10 minutes\nCreate an AP to gain remote control of the Raspberry - Realtek chipset wifi dongle with a RPi Zero W\nFramboise314: Créez votre hotspot Wifi avec un Raspberry Pi de façon express\nGeekzone.fr: Transformez votre Raspberry Pi en point d’accès WiFi avec RaspAP\nInstructables: Raspberry Pi As Completely Wireless Router\nLesfrerespoulain: Boitier WIFI VPN\nMonter sa borne wifi en 5mn avec un raspberry\nRaspberry Pi as 4G LTE Router\nRaspberry Pi as a Wifi Hotspot\nRéaliser un routeur WiFi/4G sois-même\nRock Pi S WiFi Access Point with Armbian\nTurn Your Raspberry Pi into a Captive Portal Wi‐Fi Access Point\nTurn your Raspberry Pi into a VPN with Tor as Access Point\nArticles\nLow-cost Raspberry Pi Zero endoscope camera\nRaspberry Pi Weekly - Issue #157 - Commander\nRaspberry Pi Weekly - Issue #351 - We’re on the home stretch!\nOther resources\nRaspberry Pi Wireless Access Point - YouTube instructional video\nTop 16 useful tools for Raspberry Pi lovers\nContributing\nContribution guidelines can be found here.\nLicense\nCC0 - \"No Rights Reserved\".", "link": "https://github.com/RaspAP/raspap-awesome", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "$ raspap-awesome\nthis list is a collection of projects, tutorials, public access points, github forks and applications either based on or using raspap as a component in one form or another.\ncontributions are very welcome. see contributing.\nwhy this repo?\nthe open source community is doing amazing things with raspap. just when we think we've seen it all, something new and unexpected comes along. with the low cost of the raspberry pi and the ease of setup with our famous quick installer, raspap-powered projects are popping up all over the globe. do you run a public or personal access point powered by raspap? have an innovative project you've developed with it? showcase your resource here!\nprojects\ncarry your mobile kubernetes - kubernetes cluster using raspap in wifi client ap mode with an ipad pro\nconnecting a raspberry pi, ipad, hololens, and magic leap ml1 - via @mikebuss 🏆\ncreate your own portable rfid pentest kit - based on the proxmark 3 with raspap for remote control over wifi\ndrumming robot - midi drum machine to complement live electronic music\nenerserve smart pi - a smart energy meter based on the raspberry pi\nfreedomev - unlocking the full potential of linux on your ev ( 📸 raspap on a rooted tesla )\nham radio winter tent camping | winter field day - preparedness & off-grid communications 📽\ninteractive media installation at the helinä rautavaara museum, finland\nlow-cost wireless endoscope camera: a preliminary report\npool ph level and temperature wifi monitor ( 📸 project photo )\nsecure scuttlebutt weather station - replicating, peer-to-peer database of weather log data\ntravelplex - a portable, offline 1tb plex shared media server\nv1 engineering - rpi-powered octoprint, cnc.js, cnc control from your phone\nwipi – a raspberrypi hotspot to go - ap & portable local network with a sixfab cellular hat, built for travel\nwifi access points\nstaying connected in italy during coronavirus lockdown - tweet via @lewixlabs\ntelescope configured with pizerow, rpi_cam and raspap ( 📸 project photo )\nwifi hotspot for the -----> garden !!! \ntutorials\n5 minutes pour créer son hotspot wifi sur raspberry pi\nadafruit: raspap wifi configuration portal\ncartographie faible coût et partagée à base de raspberry pi et opencpn\nbitblokes.de: raspap – raspberry pi als hotspot / access point (wlan / wi-fi)\nbitblokes.de: vpn router with raspberry pi, raspap and nordvpn / openvpn (simple)\nbitreporter.de: raspberry pi als wlan-hotspot nutzen\nbuilding private wifi hotspot with raspberrypi, raspap, and vpn\nconfigurer un serveur mqtt avec raspberry pi\ncreate a wi-fi hotspot in less than 10 minutes\ncreate an ap to gain remote control of the raspberry - realtek chipset wifi dongle with a rpi zero w\nframboise314: créez votre hotspot wifi avec un raspberry pi de façon express\ngeekzone.fr: transformez votre raspberry pi en point d’accès wifi avec raspap\ninstructables: raspberry pi as completely wireless router\nlesfrerespoulain: boitier wifi vpn\nmonter sa borne wifi en 5mn avec un raspberry\nraspberry pi as 4g lte router\nraspberry pi as a wifi hotspot\nréaliser un routeur wifi/4g sois-même\nrock pi s wifi access point with armbian\nturn your raspberry pi into a captive portal wi‐fi access point\nturn your raspberry pi into a vpn with tor as access point\narticles\nlow-cost raspberry pi zero endoscope camera\nraspberry pi weekly - issue #157 - commander\nraspberry pi weekly - issue #351 - we’re on the home stretch!\nother resources\nraspberry pi wireless access point - youtube instructional video\ntop 16 useful tools for raspberry pi lovers\ncontributing\ncontribution guidelines can be found here.\nlicense\ncc0 - \"no rights reserved\".", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000749, "year": null}, {"Unnamed: 0": 913, "autor": 913, "date": null, "content": "STEMinds Eduponics Mini smart agriculture kit\nThe Eduponics Mini is ESP32 based smart agriculture modular kit that enables you to build your own smart garden with ease.\nIn this repository you'll find all the example code necessary to get started with your Eduponics mini ESP32 learning kit. The MQTT client found in the Micropython repository within the eduponics_mqtt folder, it can be used with the Eduponics Mini app which is currently available on the Android play store (search for \"Eduponics\") and soon will be available on the Apple appstore.\nEduponics-Micropython\nThe Micropython library has been moved to github.com/STEMinds/micropython-eduponics, if you are looking for the Micropython code, please make sure to visit the correct repository.\nCrowdfunded successfully!\nEduponics Mini successfully crowdfunded on CrowdSupply, you can enter the website now and pre-order your own.\nDocumentation\nThe entire documentation is freely available at STEMinds wiki: wiki.steminds.com Feel free to follow along or just go to the bottom to understand how to connect and use the Eduponics mobile app combined with Eduponics mini kit.\nConfiguring WiFi for the MQTT client\nAll the code should work AS IS the only modification required is for the boot.py python file to modify the WiFi SSID and Password in order for the ESP32 to connect successfully to your home WiFi. From there, the Eduponics Mini can be controlled from anywhere, even outside of your own network.\nAnother thing not to forget is to generate a unique UUID either using MicroPython or through online service. in main.py where it says:\nUUID = \"YOUR_UUID_GENERATED_ID\"\nMake sure to enter the UUID you've generated and input it into the app.\nFirmwares\nAny ESP32 supported framework should work on the Eduponics Mini but we can't promise software support for all the firmwares. At This moment we only support the MicroPython framework but we might add software examples and drivers for other frameworks in the future.\nHere is a list of popular frameworks you could explore using the Eduponics Mini ESP32 board:\nESP-IDF Generic Firmware (MicroPython, also work on Arduino IDE)\nESPDuino Firmware\nLua RTOS\nYou might also consider a generic ESP32-IDF3 image with built in ulab (a numpy like library) this firmware can be downloaded from here: esp32_generic_idf3_ulab\nHow to use the IDF3 firmware\nThe IDF3 ESP32 firmware is generic firmware. it will work both on Arduino IDE and MicroPython. We install and test the MicroPython Generic IDF3 firmware when we ship the kits, if you want to use the Arduino IDE you can BUT note the following:\nOnce you use the Arduino IDE you might not be able to use Thonny IDE (MicroPython) again so easily, Thonny IDE might tell you:\nCould not enter REPL. Trying again with 1 second waiting time...\nThis is due to Arduino IDE removing REPL (The MicroPython interpreter) in order to solve it, go to your Thonny IDE settings under interpreter and press \"Open the dialog for installing or upgrading MicroPython\" and select the firmware esp32-idf3-20200902-v1.13.bin (version might be different) which you can download from the links above.\nThis will install REPL again and you'll be able to use MicroPython without any problem. if you'll use Arduino IDE again, you might need to repeat the process.\nEduponics Mini Extension board\nThe Extension board allows to connect extra 4 soil moisture sensors (or any other analog input devices) and extra output devices (digital output devices with 12V support by using relays). The board designed using ADS1115 for ADC support and MCP23017 for GPIO control with some advance functionalities such as interrupt on change and precise analog data reading.\nBoth chips use the I2C protocol which means we can control all the functionalities using only 2 pins (SDA and SCL) it also means it's 100% compatible with Raspberry Pi as it doesn't have a built in ADC.\nThe Extension board code can be found at extension_module/ folder\nLicense\nSome of the code is taken from other repositories, proper credits and license is given at the beginning of each file. All the example code and files are under MIT License.\nCopyright (c) 2020-2021 STEMinds\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.", "link": "https://github.com/STEMinds/Eduponics-Mini", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "steminds eduponics mini smart agriculture kit\nthe eduponics mini is esp32 based smart agriculture modular kit that enables you to build your own smart -----> garden !!!  with ease.\nin this repository you'll find all the example code necessary to get started with your eduponics mini esp32 learning kit. the mqtt client found in the micropython repository within the eduponics_mqtt folder, it can be used with the eduponics mini app which is currently available on the android play store (search for \"eduponics\") and soon will be available on the apple appstore.\neduponics-micropython\nthe micropython library has been moved to github.com/steminds/micropython-eduponics, if you are looking for the micropython code, please make sure to visit the correct repository.\ncrowdfunded successfully!\neduponics mini successfully crowdfunded on crowdsupply, you can enter the website now and pre-order your own.\ndocumentation\nthe entire documentation is freely available at steminds wiki: wiki.steminds.com feel free to follow along or just go to the bottom to understand how to connect and use the eduponics mobile app combined with eduponics mini kit.\nconfiguring wifi for the mqtt client\nall the code should work as is the only modification required is for the boot.py python file to modify the wifi ssid and password in order for the esp32 to connect successfully to your home wifi. from there, the eduponics mini can be controlled from anywhere, even outside of your own network.\nanother thing not to forget is to generate a unique uuid either using micropython or through online service. in main.py where it says:\nuuid = \"your_uuid_generated_id\"\nmake sure to enter the uuid you've generated and input it into the app.\nfirmwares\nany esp32 supported framework should work on the eduponics mini but we can't promise software support for all the firmwares. at this moment we only support the micropython framework but we might add software examples and drivers for other frameworks in the future.\nhere is a list of popular frameworks you could explore using the eduponics mini esp32 board:\nesp-idf generic firmware (micropython, also work on arduino ide)\nespduino firmware\nlua rtos\nyou might also consider a generic esp32-idf3 image with built in ulab (a numpy like library) this firmware can be downloaded from here: esp32_generic_idf3_ulab\nhow to use the idf3 firmware\nthe idf3 esp32 firmware is generic firmware. it will work both on arduino ide and micropython. we install and test the micropython generic idf3 firmware when we ship the kits, if you want to use the arduino ide you can but note the following:\nonce you use the arduino ide you might not be able to use thonny ide (micropython) again so easily, thonny ide might tell you:\ncould not enter repl. trying again with 1 second waiting time...\nthis is due to arduino ide removing repl (the micropython interpreter) in order to solve it, go to your thonny ide settings under interpreter and press \"open the dialog for installing or upgrading micropython\" and select the firmware esp32-idf3-20200902-v1.13.bin (version might be different) which you can download from the links above.\nthis will install repl again and you'll be able to use micropython without any problem. if you'll use arduino ide again, you might need to repeat the process.\neduponics mini extension board\nthe extension board allows to connect extra 4 soil moisture sensors (or any other analog input devices) and extra output devices (digital output devices with 12v support by using relays). the board designed using ads1115 for adc support and mcp23017 for gpio control with some advance functionalities such as interrupt on change and precise analog data reading.\nboth chips use the i2c protocol which means we can control all the functionalities using only 2 pins (sda and scl) it also means it's 100% compatible with raspberry pi as it doesn't have a built in adc.\nthe extension board code can be found at extension_module/ folder\nlicense\nsome of the code is taken from other repositories, proper credits and license is given at the beginning of each file. all the example code and files are under mit license.\ncopyright (c) 2020-2021 steminds\npermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"software\"), to deal in the software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the software, and to permit persons to whom the software is furnished to do so, subject to the following conditions: the above copyright notice and this permission notice shall be included in all copies or substantial portions of the software.\nthe software is provided \"as is\", without warranty of any kind, express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose and non-infringement. in no event shall the authors or copyright holders be liable for any claim, damages or other liability, whether in an action of contract, tort or otherwise, arising from, out of or in connection with the software or the use or other dealings in the software.", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000913, "year": null}], "name": "gardenIot"}