{"interestingcomments": [{"Unnamed: 0": 222, "autor": 222, "date": null, "content": "A curated list of awesome CircuitPython guides, videos, libraries, frameworks, software and resources.\nCircuitPython-github.mov\nCircuitPython is Adafruit's branch of MicroPython designed to simplify experimentation and education on low-cost microcontrollers. It makes it easier than ever to start prototyping by requiring no upfront desktop software downloads. With CircuitPython you can write clean and simple Python code to control hardware instead of having to use complex low-level languages like C or C++ (what Arduino uses for programming). It's great for beginners!\nContents\nCircuitPython.org\nGuides\nCommunity\nBooks\nCode\nFrameworks\nHardware\nNewsletter\nIn the news\nArt, logos, graphics\nSocial media\nPodcasts\nEvents\nSwag\nTalks\nContributing\nCircuitPython.org\nCircuitPython.org is the first stop on the information snake highway. Here you can see all the supported boards and download the specific firmware for each one, including beta, latest, and previous versions. Downloads can be sorted by: maker, features, name, and more. At this time there are over 80 boards supported in the CircuitPython family!\nGuides\nWelcome to CircuitPython! - An overview of CircuitPython and the community.\nCircuitPython Essentials - Learning the essential functions of CircuitPython.\nlearn.adafruit.com CircuitPython - Adafruit Learning Guides on CircuitPython.\nlearn.adafruit.com CircuitPython & MicroPython - Guides on both CircuitPython and MicroPython.\nCommunity\nAdafruit CircuitPython Discord channel #CircuitPython - 24/7 chat and support on CircuitPython including a weekly podcast.\nPython on Hardware weekly VideoCast - The wonderful world of Python on hardware. Video-newsletter-podcast of all things Python and electronics.\nCircuitPython Weekly Meeting - Video archive of weekly community meeting via Discord, starting from September, 2017.\nAdafruit CircuitPython Forums - The Adafruit discussion forum on CircuitPython.\nBooks\nGetting started with Circuit Playground Express by Anne Barela (or purchase as part of your order from the Adafruit store) - Introduction and discussion of the Circuit Playground Express including programming via CircuitPython, MakeCode and Arduino.\nCircuitPython Development Workshop by Agus Kurniawan - This book helps you to get started with CircuitPython development. This book uses the Adafruit ItsyBitsy M0 Express board for development.\nCircuitPython for beginners with Adafruit Circuit Playground Express & Mu - Japanese by author Aoyama_PROD coming in September, 2019 from TechBookFest.\nProgramming with MicroPython - by Nicholas H. Tollervey, includes CircuitPython - Discusses the MicroPython language.\nWearable Tech Projects by Sophy Wong - Contains many wearable projects using CircuitPython.\nCircuitPython for beginners with Adafruit Circuit Playground Express & Mu - Japanese.\nLearning IoT with Python and Raspberry Pi by E.I. Horvath, E.A. Horvath\nMake Music with the Circuit Playground Express by Rick Leander - Twelve projects that make music, sound and noise with Circuit Python.\nTen Games for the Circuit Playground Express by Rick Leander - Ten classic games adapted for Circuit Python.\nInitiation au langage CircuitPython et à la puce nRF52840 - A French introduction to CircuitPython and the nRF52840.\nCode\nCircuitPython Versions: Select per board at CircuitPython.org (easiest) or visit GitHub.\nCircuitPython Beta Releases: Select per board at CircuitPython.org (easiest)\nCircuitPython API Reference - A list of functions and documentation available for CircuitPython.\nCircuitPython Essentials - Learning the essential functions of CircuitPython.\nCircuit Playground Express CircuitPython API Reference - The functions and documentation specific to the Circuit Playground Express using CircuitPython.\nCircuitPython GitHub Repository - The source code for CircuitPython on GitHub.\nAdafruit CircuitPython Libraries - Current Adafruit CircuitPython Libraries. There are over 150+ libraries available. More on Libraries on CircuitPython.org.\nCircuitPython Community Libraries - CircuitPython Community Libraries. There are over 45+ libraries available.\nAdafruit Blinka - SBC Compatibility - CircuitPython Libraries on Raspberry Pi and other compatible single-board computers (SBC) running Linux.\nCoding CircuitPython on iOS 13.x - With the launch of iOS 13, iPhone users now have the ability to edit code on CircuitPython USB devices!\nAwesome List for the rp2040 Macropad - A list of awesome Macropad applications, macros, 3D printed plans, and more.\nFrameworks\nGlider: An app for editing Python on mobile devices wirelessly - Also a video, in development.\nThe Mu Editor, IDE, REPL, and plotter for CircuitPython - The recommended Python editor for CircuitPython.\nFor developers, Mu: A Python Code Editor - The documentation for Mu.\nUsing Microsoft VSCode for CircuitPython - Blog post discussing the process.\nA helper for CircuitPython development with Atom - A helper for the Atom editor.\nThonny, a Python IDE for beginners - An editor with support for CircuitPython and MicroPython.\nMicrosoft Device Simulator Express - Virtual Circuit Playground Express and CircuitPython programming in Visual Studio Code.\nSlappy.io, a browser-based IDE and REPL for CircuitPython - An in-browser editor designed especially for Chromebooks. Works on almost any computer that can run a Chromium-based browser.\nCircuitPython extension for VS Code - A full featured extension for VS Code that downloads the latest CircuitPython bundle automatically, includes access to the serial console, and auto complete.\nHardware\nAll supported boards may be viewed at circuitpython.org to include descriptions, pictures, and compatible CircuitPython builds. A summary of current boards on circuitpython.org:\nAdafruit CircuitPython boards - Adafruit Circuit Playground Express, Adafruit Feather M0 Basic, Adafruit Feather M0 Express, Adafruit Feather M0 Adalogger, Adafruit Feather M0 RFM9x, Adafruit Feather M0 RFM69, Adafruit Feather M4 Express, Adafruit Feather nRF52832, Adafruit Feather nRF52840 Express, Adafruit nRF52840 Sense, Adafruit CLUE, Adafruit Gemma M0, Adafruit Grand Central M4 Express, Adafruit HalloWing M0 Express, Adafruit HalloWing M4 Expres, Adafruit ItsyBitsy M0 Express, Adafruit ItsyBitsy M4 Express, Adafruit ItsyBitsy NRF52840 Express, Adafruit Metro M0 Express, Adafruit Metro M4 Express, Adafruit Metro ESP32-S2, Adafruit Metro nRF52840 Express, Adafruit NeoTrellis M4, Adafruit Trinket M0, Adafruit PyPortal, Adafruit PyPortal Titano, Adafruit PyPortal Pynt, Adafruit pIRkey, Adafruit Feather Huzzah, Adafruit PyBadge, Adafruit PyBadge AirLift, Adafruit PyBadge LC, Adafruit PyGamer, Adafruit PyGamer Advance, Adafruit Metro M4 AirLift Lite, Adafruit Gemma M0 PyCon 2018, Adafruit Circuit Playground Express Digi-Key, Adafruit Circuit Playground Express 4-H, Adafruit Circuit Playground Express + Crickit, Adafruit Circuit Playground Express Bluefruit, Adafruit Feather M0 Express + Crickit, Adafruit PyRuler, Adafruit EdgeBadge, Adafruit M7 1011, Adafruit Matrix Portal M4, Adafruit Feather M4 CAN, Adafruit Feather STM32F405 Express, Adafruit MagTag, Adafruit MONSTER M4SK, Adafruit QT Py, Adafruit QT Py Haxpress, Adafruit Macropad RP2040, Adafruit Neo Trinkey - SAMD21 USB Key, Adafruit QT Py RP2040, Adafruit Trinkey QT2040, Adafruit ItsyBitsy RP2040, Adafruit Metro ESP32-S2, Adafruit KB2040, Adafruit Feather RP2040.\nArduino - Arduino MKR WAN 1300, Arduino MKR Zero, Arduino Zero, Arduino Nano 33 BLE, Arduino Nano 33 IoT.\nElectronic Cats - CatWAN USB Stick, Meow Meow, Escornabot Makech, NFC Copy Cat bast_pro_mini_m0, Bast Wifi.\nMakerDiary - nRF52840 Micro Dev Kit, nRF52840 Micro Dev Kit USB Dongle, M60 Mechanical Keyboard, Pitaya Go, nRF52840 M.2 Developer Kit.\nNordic Semiconductor - nRF52840 DK board PCA10056, nRF52840 Dongle PCA10059.\nNXP - MIMXRT1010 Eval Kit, MIMXRT1060 Eval Kit, MIMXRT1020 Eval Kit.\nParticle - Particle Argon, Particle Boron, Particle Xenon.\nBenjamin Shockley - Mini SAM M4.\nRadomir Dopieralski - PewPew, μGame, PewPew M4, Fluff M0.\nSparkFun - SparkFun Pro nRF52840 Mini, SparkFun SAMD21 Mini, SparkFun SAMD21 Dev, SparkFun Pro nRF52840 Mini, SparkFun SAMD21 Dev, SparkFun RedBoard Turbo, SparkFun LumiDrive, Sparkfun Qwiic Micro, SparkFun Qwiic Micro without Flash, SparkFun Qwiic Micro with Flash, SAMD51 Thing Plus.\nDave Astels - Feather M0 Supersized, Trinket M0 Haxpress.\nMax Holiday - KickSat Sprite, SAM32.\nItaca Innovation - uChip M0.\nCapable Robot Components - Programmable USB Hub, SenseTemp.\nRobotics Masters - Robo HAT MM1 M4.\nRobot Exploration Lab - PyCubed, PyCubed w/MRAM.\nAmitabh Shrivastava - Hearrings.\nProf. Fartsparkle - Numberwang badge\narturo182 - Serpente, Feather MIMXRT1062, Feather MIMXRT1011.\nSony - Spresense.\nPJRC - Teensy 4.0, Teensy 4.1.\nElectronut Labs - Papyr, Blip.\nTZT - STM32F411CE Black Pill.\nJ&J Studios - datum-IMU, datum-Distance, datum-Weather, datum-Light.\nKittenBot - Meowbit.\nOSHWA - Open Hardware Summit 2020 Badge.\nDamien George - PyBoard 1.1.\nSeeed Studio - Seeeduino XIAO, Wio Terminal.\nOddly Specific Objects - The Open Book.\nST - STM32F412 Discovery Kit, STM32F411 Discovery kit, STM32F407 Discovery Kit, STM32H743 Nucleo, STM32F767 Nucleo, STM32F746 Nucleo, STM32F746 Discovery kit.\nAlethea Flowers - Winterbloom Sol, Winterbloom Big Honking Button.\nCedar Grove Studios - StringCar M0 Express.\nkeithp.com - Snekboard.\nElecrow - PYB Nano v2.\nXinaBox - XinaBox CS11, XinaBox CC03.\nTeknikio - Bluebird.\nSarfata - ShIRtty Board.\nScott Shawcroft - Python powered GameBoy-compatible cartridge.\nndGarage - Ndbit6.\nNull Byte Labs LLC - CircuitBrains Deluxe, CircuitBrains Basic.\n8086 Consultancy - Commander.\nAlorium Technology, LLC - AloriumTech Evo M51.\nARAMCON Badge Team - ARAMCON Badge 2019.\nBDMICRO, LLC - Vina-D51, Vina-D21.\nBH Dynamics - DynOSSAT-EDU OBC, DynOSSAT-EDU EPS.\nbleeptrack - PicoPlanet.\nEspressif - Saola 1 w/WROOM, Saola 1 w/WROVER, ESP32-S2 Kaluga Dev Kit featuring WROVER.\nEspruino - Espruino Pico, Espruino WiFi.\nHangzhou LeBan - HiiBot BlueFi, HiiBot IoTs2.\nIkigaisense - Ikigaisense Vita.\nJeremy Gillick - Thunderpack.\nJPConstantineau - BlueMicro840, PyKey60\nMicrochip - SAM E54 Xplained Pro.\nmicroDev - microS2.\nMuselab - NanoESP32 S2.\nNice Keyboards - Nice!Nano.\nOak Development Technologies - CP Sapling.\nOpenMV - OpenMV H7.\nRaytac Corporation - MDBT50Q-DB-40.\nSean 'xobs' Cross - Fomu.\nSimmel Project - Simmel Board.\nSwitch Science, Inc. - BLE-SS Dev Board Multi Sensor\nTG-Techie - TG-Watch02A.\nTinkeringTech - ScoutMakes Azul.\nUnexpected Maker - Unexpected Maker FeatherS2.\nS2 Nugget - a Wi-Fi Nugget breakout board combined with an ESP32S2 based S2 Mini development board.\nAdding new boards to the CircuitPython list on circuitpython.org: Please do a pull request on GitHub at https://github.com/adafruit/circuitpython. CircuitPython developers may help get the correct pin data and other information to map a new board.\nCircuitPython sensors and accessories - Complete listing of sensors, LCDs, displays, robotics, breakout boards, and more.\npython.digikey.com - Digi-Key electronics has a listing of all Python-supported boards on their site in one location including CircuitPython and MicroPython boards.\nNewsletter\nAdafruit Daily, Python for microcontrollers - A weekly newsletter on MicroPython and CircuitPython, a spam-free list.\nContribute to newsletter - Guidelines on contributing to the newsletter.\nArchives of all newsletters - List of every newsletter published from the start, November 2016.\nNews\nProgram CircuitPython devices with iPhone & iOS 13 - With the launch of iOS 13, iPhone users now have the ability to edit code on CircuitPython USB devices!\nChanging Lives through Open Source, Passion and Mentoring - the keynote talk at PyOhio, July 27, 2019 by Kattni Rembor.\nControl servos with CircuitPython and Raspberry Pi - The MagPi Magazine, Issue 84, Melissa LeBlanc-Williams, July, 2019.\nPyDev of the Week: Scott Shawcroft - July 1, 2019.\nScott Shawcroft: History of CircuitPython - A discussion of CircuitPython for the core developers of Python, PyCon 2019.\nFive Things You Didn't Know Python Could Do - YouTube video, June 19, 2019.\nPyCon2019 Keynote - Light Up Your Life - With Python and LEDs - By Nina Zakharenko. Python opens a whole new world of working with wearable electronics. The slides are also available.\nLearn Hardware Programming with CircuitPython - A course offered by Codecademy in collaboration with Adafruit.\nUse CircuitPython boards on the TI-83 Premium CE calculator - CircuitPython runs on Texas Instrument calculators.\nMake: Vol. 68 Boards guide - Make: Magazine names Python the #1 Tech Trend for boards in 2019!\nScott Shawcroft Is Squeezing Python Into Microcontrollers - IEEE Spectrum Magazine article on the Python programming language for makers.\nCircuit Playground Express 4-H edition approved - The 4-H branded version was approved by the USDA, this is the first CircuitPython powered board that is also 4-H approved!\nCircuitPython in Space - CircuitPython provides an approachable and logical means of conducting science with hardware. Paired with low-cost hardware shown to work in space, we can enable an new generation to question and explore the unknown. With the necessary “satellite stuff” already baked in, students can spend their time trying something new rather than reinventing the wheel.\nAdafruit PyPortal: GUI meets CircuitPython in a Big Way - Disrupt It Yourself podcast on CircuitPython and the IoT device, PyPortal.\nCool Tools - Sophy Wong Talks Circuit Playground Express including CircuitPython.\nCircuitPython for Rapid Microcontroller-Based Prototyping and Development - Digi-Key on the open source community's efforts adapting specific microcontrollers and dev boards to support serious microcontroller development using CircuitPython.\nHackSpace Magazine - Issue 17 - CircuitPython powered Adafruit Grand Central M4 Express review.\nPython on Hardware Means Choices for Makers - By Liz Clark - Apress. CircuitPython (a fork of MicroPython that is designed from the ground up to be beginner friendly.) This allows end users to use Python for their electronics hardware projects similar to how they may have used C/C++ with the Arduino IDE.\nMethod's Magazine - Methods eZine: Design Trends & the Transformation of Everything features Python on hardware, page 35 - PDF.\nHackSpace Magazine - Issue 15 - CircuitPython makes the cover on HackSpace Magazine with feature article, and projects.\nCircuitPython in 2019 - Community call for what's wanted and needed in CircuitPython for 2019.\nCircuitPython in 2018 - An article discussing the future directions for CircuitPython 2018 edition.\nCircuitPython on the Adafruit.com/blog - Adafruit Blog posts discussing CircuitPython.\nCircuitPython in MicroSolutions Digital Magazine - Microchip’s MicroSolutions, “Python on Microcontrollers” in Design Corner article. MicroSolutions is Microchip’s bi-monthly digital magazine.\nCircuitPython Snakes its Way onto Adafruit Hardware - An article by MAKE on CircuitPython.\nAdafruit Circuit Playground Express review - Raspberry Pi reviews the Circuit Playground Express.\nThe Amp Hour #383 - An Interview with Scott Shawcroft.\nCircuitPython on Hackaday - Hackaday posts related to CircuitPython.\nCircuitPython on hackster.io - Posts on hackster.io related to CircuitPython.\nCircuitPython on MAKE - CircuitPython related content on MAKE.\nArt\nCircuitPython Art Pack! Logos, banners, photos and Blinka! - Adafruit art relating to CircuitPython.\nSocial\n#CircuitPython tagged on Twitter, latest - Twitter posts tagged CircuitPython.\nCircuitPython Twitter - Twitter account aggregator for CircuitPython news and more.\nCircuitPython videos on YouTube, latest - YouTube posts tagged CircuitPython.\n#CircuitPython tagged photos & videos on Instagram - Posts on Instagram tagged CircuitPython.\nCircuitPython - micropython.org forums - Articles on the MicroPython forums tagged for CircuitPython.\nCircuitPython tagged on Reddit - Reddit posts relating to CircuitPython.\nCircuitPython community on Reddit - Dedicated home of CircuitPython on reddit /r/circuitpython/.\nCircuitPython on Hackaday.io - Curated list of projects on hackaday.io.\nCircuitPython on hackster.io - Python on hardware projects on hackster.io including CircuitPython.\nCircuitPython on Instructables - How-tos, guides, and more, using CircuitPython on Autodesk's Instructables.\nPodcasts\nWeekly community chat on Adafruit Discord server CircuitPython channel - Audio / Podcast edition - Audio from the Discord chat space for CircuitPython, meetings are usually Mondays at 2pm ET, this is the audio version on iTunes, Pocket Casts, Spotify, and XML feed.\nPython on hardware weekly video cast - The wonderful world of Python on hardware! This is our video-newsletter-podcast of all things Python and electronics! The news comes from the Python community, discord, Adafruit communities and more. It’s part of the weekly newsletter, then we have a segment on ASK an ENGINEER and this is the video slice from that! This video podcast is on iTunes, YouTube, IGTV (Instagram TV), and XML.\nThe Best Python Podcasts - The Best Python Podcasts.\nPodcast Episodes about CircuitPython\nThe Best Python Podcasts\nHanselminutes Technology Podcast – Learning CircuitPython with Scott Shawcroft\nReal Python Podcast Episode 5: Exploring CircuitPython with host Christopher Bailey and guest Thea Flowers\nReal Python Podcast Episode 75: Building With CircuitPython & Constraints of Python for Microcontrollers with host Christopher Bailey and guest Scott Shawcroft\nEpisode #272: No IoT things in hand? Simulate them with Device Simulator Express\nEpisode #325: MicroPython + CircuitPython\nEvents\nWeekly community chat on Adafruit Discord server CircuitPython channel - The Discord chat space for CircuitPython, meetings are usually Mondays at 2pm ET.\nWeekly Adafruit Show-and-tell, Wednesday 7:30pm ET on Google+ Hangouts - The weekly Adafruit Show-and-tell program often has CircuitPython-related projects on display.\nASK AN ENGINEER, Wednesday 8pm ET on YouTube LIVE - The longest running YouTube live show about electronics, information on CircuitPython each week during \"Python on hardware segment\".\nPyCon 2022 - Salt Lake City, Utah USA April 27 - May 5, 2022.\nSwag\nCircuitPython 7 release poster - CircuitPython release version 7 poster.\nCircuitPython 6 release poster - CircuitPython release version 6 poster.\nCircuitPython 5 release poster - CircuitPython release version 5 poster.\nCircuitPython 4 release poster - CircuitPython release version 4 poster featuring Nordic.\nCircuitPython 3 release poster - CircuitPython release version 3 poster.\nBlinka the CircuitPython Limited Edition Enamel Pin - An enamel pin with the CircuitPython mascot.\nBlinka the CircuitPython Sticker - A sticker featuring Blinka, the CircuitPython mascot.\nBlinka the CircuitPython Temporary Tattoo - A temporary tattoo featuring the Blinka character.\nCircuitPlayground lanyard - CircuitPlayground lanyard featuring Blinka.\nTalks\nCircuitPython 入门 - CircuitPython 程序！An entry level CircuitPython tutorial in Chinese 01: From zero to Hello World (YouTube).\nChanging Lives through Open Source, Passion and Mentoring - Changing Lives through Open Source, Passion and Mentoring, Keynote by Kattni Rembor at PyOhio 2019.\nCircuitPython: Python on hardware - CircuitPython: Python on hardware by Dave Astels at PyCon Canada.\nEmbedded Programming for everyone using MicroPython and CircuitPython - Embedded Programming for everyone using MicroPython and CircuitPython by Ayan Pahwa at FOSSASIA Summit.\nEuroPython 2019 talk video: Nicholas Tollervey – Tools of the Trade: The Making of a Code Editor - Nicholas Tollervey.\nEuroPython 2019 talk video: Radomir Dopieralski – Game Development with CircuitPython - Radomir Dopieralski.\nExtending MicroPython: Using C for good - A look at how MicroPython can be extended to add features and improve performance. By Matt Trentini at PyCon Australia.\nHanselminutes Technology Podcast – Learning CircuitPython with Scott Shawcroft - Scott Shawcroft.\nLighting Macro Photographs with CircuitPython - Lighting Macro Photographs with CircuitPython by Stacy Morse at PyCon Australia.\nMax Holiday - CircuitPython in space, SmallSats and more! - Max Holiday.\nMicroPython & the Internet of Things - MicroPython & the Internet of Things by Damien George at GOTO 2016.\nPyCon2019 Keynote: Python on Hardware – Nina Zakharenko - Nina Zakharenko.\nPyCon India - 2019 Interactive Hardware Poster Presentation powered by CircuitPython by Ayan Pahwa and Aakanksha Agrawal - Ayan Pahwa and Aakanksha Agrawal.\nVIDEO: PyCascades – Light Up Your Life – With Python and LEDs - Nina Zakharenko.\nWriting fast and efficient MicroPython - Writing fast and efficient MicroPython by Damien George at PyCon Australia.\nMore Fun with Hardware and CircuitPython -- IoT, Wearables, and More! - Nina Zakharenko at PyCon 2021.\nContributing\nContributions and suggestions are always welcome! Please make pull requests from your own fork to modify Awesome CircuitPython.\nThe workflow is explained in detail here: Adafruit : Contribute to CircuitPython with Git and GitHub.\nContribution Workflow Overview\nFork this repository on GitHub.\nClone the forked repo to your drive.\nAdd a remote using owner adafruit and the original URL.\nFetch the remote.\nMerge adafruit or main.\nCreate a branch.\nMake a change.\nCommit and push to your repo.\nCreate a pull request on the official repo.\nOnce accepted, repeat by merging from the official repo to your fork's master, and re-branch.\nQuestions? We're happy to help you to contribute on Discord.\nLicense & Trademarks\nTo the extent possible under law, the authors have waived all copyright and related or neighbouring rights to this work.\nLast updated: November 24, 2021", "link": "https://github.com/adafruit/awesome-circuitpython", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "sapling", "selectorShort": "sapling", "MarkedSent": "a curated list of awesome circuitpython guides, videos, libraries, frameworks, software and resources.\ncircuitpython-github.mov\ncircuitpython is adafruit's branch of micropython designed to simplify experimentation and education on low-cost microcontrollers. it makes it easier than ever to start prototyping by requiring no upfront desktop software downloads. with circuitpython you can write clean and simple python code to control hardware instead of having to use complex low-level languages like c or c++ (what arduino uses for programming). it's great for beginners!\ncontents\ncircuitpython.org\nguides\ncommunity\nbooks\ncode\nframeworks\nhardware\nnewsletter\nin the news\nart, logos, graphics\nsocial media\npodcasts\nevents\nswag\ntalks\ncontributing\ncircuitpython.org\ncircuitpython.org is the first stop on the information snake highway. here you can see all the supported boards and download the specific firmware for each one, including beta, latest, and previous versions. downloads can be sorted by: maker, features, name, and more. at this time there are over 80 boards supported in the circuitpython family!\nguides\nwelcome to circuitpython! - an overview of circuitpython and the community.\ncircuitpython essentials - learning the essential functions of circuitpython.\nlearn.adafruit.com circuitpython - adafruit learning guides on circuitpython.\nlearn.adafruit.com circuitpython & micropython - guides on both circuitpython and micropython.\ncommunity\nadafruit circuitpython discord channel #circuitpython - 24/7 chat and support on circuitpython including a weekly podcast.\npython on hardware weekly videocast - the wonderful world of python on hardware. video-newsletter-podcast of all things python and electronics.\ncircuitpython weekly meeting - video archive of weekly community meeting via discord, starting from september, 2017.\nadafruit circuitpython forums - the adafruit discussion forum on circuitpython.\nbooks\ngetting started with circuit playground express by anne barela (or purchase as part of your order from the adafruit store) - introduction and discussion of the circuit playground express including programming via circuitpython, makecode and arduino.\ncircuitpython development workshop by agus kurniawan - this book helps you to get started with circuitpython development. this book uses the adafruit itsybitsy m0 express board for development.\ncircuitpython for beginners with adafruit circuit playground express & mu - japanese by author aoyama_prod coming in september, 2019 from techbookfest.\nprogramming with micropython - by nicholas h. tollervey, includes circuitpython - discusses the micropython language.\nwearable tech projects by sophy wong - contains many wearable projects using circuitpython.\ncircuitpython for beginners with adafruit circuit playground express & mu - japanese.\nlearning iot with python and raspberry pi by e.i. horvath, e.a. horvath\nmake music with the circuit playground express by rick leander - twelve projects that make music, sound and noise with circuit python.\nten games for the circuit playground express by rick leander - ten classic games adapted for circuit python.\ninitiation au langage circuitpython et à la puce nrf52840 - a french introduction to circuitpython and the nrf52840.\ncode\ncircuitpython versions: select per board at circuitpython.org (easiest) or visit github.\ncircuitpython beta releases: select per board at circuitpython.org (easiest)\ncircuitpython api reference - a list of functions and documentation available for circuitpython.\ncircuitpython essentials - learning the essential functions of circuitpython.\ncircuit playground express circuitpython api reference - the functions and documentation specific to the circuit playground express using circuitpython.\ncircuitpython github repository - the source code for circuitpython on github.\nadafruit circuitpython libraries - current adafruit circuitpython libraries. there are over 150+ libraries available. more on libraries on circuitpython.org.\ncircuitpython community libraries - circuitpython community libraries. there are over 45+ libraries available.\nadafruit blinka - sbc compatibility - circuitpython libraries on raspberry pi and other compatible single-board computers (sbc) running linux.\ncoding circuitpython on ios 13.x - with the launch of ios 13, iphone users now have the ability to edit code on circuitpython usb devices!\nawesome list for the rp2040 macropad - a list of awesome macropad applications, macros, 3d printed plans, and more.\nframeworks\nglider: an app for editing python on mobile devices wirelessly - also a video, in development.\nthe mu editor, ide, repl, and plotter for circuitpython - the recommended python editor for circuitpython.\nfor developers, mu: a python code editor - the documentation for mu.\nusing microsoft vscode for circuitpython - blog post discussing the process.\na helper for circuitpython development with atom - a helper for the atom editor.\nthonny, a python ide for beginners - an editor with support for circuitpython and micropython.\nmicrosoft device simulator express - virtual circuit playground express and circuitpython programming in visual studio code.\nslappy.io, a browser-based ide and repl for circuitpython - an in-browser editor designed especially for chromebooks. works on almost any computer that can run a chromium-based browser.\ncircuitpython extension for vs code - a full featured extension for vs code that downloads the latest circuitpython bundle automatically, includes access to the serial console, and auto complete.\nhardware\nall supported boards may be viewed at circuitpython.org to include descriptions, pictures, and compatible circuitpython builds. a summary of current boards on circuitpython.org:\nadafruit circuitpython boards - adafruit circuit playground express, adafruit feather m0 basic, adafruit feather m0 express, adafruit feather m0 adalogger, adafruit feather m0 rfm9x, adafruit feather m0 rfm69, adafruit feather m4 express, adafruit feather nrf52832, adafruit feather nrf52840 express, adafruit nrf52840 sense, adafruit clue, adafruit gemma m0, adafruit grand central m4 express, adafruit hallowing m0 express, adafruit hallowing m4 expres, adafruit itsybitsy m0 express, adafruit itsybitsy m4 express, adafruit itsybitsy nrf52840 express, adafruit metro m0 express, adafruit metro m4 express, adafruit metro esp32-s2, adafruit metro nrf52840 express, adafruit neotrellis m4, adafruit trinket m0, adafruit pyportal, adafruit pyportal titano, adafruit pyportal pynt, adafruit pirkey, adafruit feather huzzah, adafruit pybadge, adafruit pybadge airlift, adafruit pybadge lc, adafruit pygamer, adafruit pygamer advance, adafruit metro m4 airlift lite, adafruit gemma m0 pycon 2018, adafruit circuit playground express digi-key, adafruit circuit playground express 4-h, adafruit circuit playground express + crickit, adafruit circuit playground express bluefruit, adafruit feather m0 express + crickit, adafruit pyruler, adafruit edgebadge, adafruit m7 1011, adafruit matrix portal m4, adafruit feather m4 can, adafruit feather stm32f405 express, adafruit magtag, adafruit monster m4sk, adafruit qt py, adafruit qt py haxpress, adafruit macropad rp2040, adafruit neo trinkey - samd21 usb key, adafruit qt py rp2040, adafruit trinkey qt2040, adafruit itsybitsy rp2040, adafruit metro esp32-s2, adafruit kb2040, adafruit feather rp2040.\narduino - arduino mkr wan 1300, arduino mkr zero, arduino zero, arduino nano 33 ble, arduino nano 33 iot.\nelectronic cats - catwan usb stick, meow meow, escornabot makech, nfc copy cat bast_pro_mini_m0, bast wifi.\nmakerdiary - nrf52840 micro dev kit, nrf52840 micro dev kit usb dongle, m60 mechanical keyboard, pitaya go, nrf52840 m.2 developer kit.\nnordic semiconductor - nrf52840 dk board pca10056, nrf52840 dongle pca10059.\nnxp - mimxrt1010 eval kit, mimxrt1060 eval kit, mimxrt1020 eval kit.\nparticle - particle argon, particle boron, particle xenon.\nbenjamin shockley - mini sam m4.\nradomir dopieralski - pewpew, μgame, pewpew m4, fluff m0.\nsparkfun - sparkfun pro nrf52840 mini, sparkfun samd21 mini, sparkfun samd21 dev, sparkfun pro nrf52840 mini, sparkfun samd21 dev, sparkfun redboard turbo, sparkfun lumidrive, sparkfun qwiic micro, sparkfun qwiic micro without flash, sparkfun qwiic micro with flash, samd51 thing plus.\ndave astels - feather m0 supersized, trinket m0 haxpress.\nmax holiday - kicksat sprite, sam32.\nitaca innovation - uchip m0.\ncapable robot components - programmable usb hub, sensetemp.\nrobotics masters - robo hat mm1 m4.\nrobot exploration lab - pycubed, pycubed w/mram.\namitabh shrivastava - hearrings.\nprof. fartsparkle - numberwang badge\narturo182 - serpente, feather mimxrt1062, feather mimxrt1011.\nsony - spresense.\npjrc - teensy 4.0, teensy 4.1.\nelectronut labs - papyr, blip.\ntzt - stm32f411ce black pill.\nj&j studios - datum-imu, datum-distance, datum-weather, datum-light.\nkittenbot - meowbit.\noshwa - open hardware summit 2020 badge.\ndamien george - pyboard 1.1.\nseeed studio - seeeduino xiao, wio terminal.\noddly specific objects - the open book.\nst - stm32f412 discovery kit, stm32f411 discovery kit, stm32f407 discovery kit, stm32h743 nucleo, stm32f767 nucleo, stm32f746 nucleo, stm32f746 discovery kit.\nalethea flowers - winterbloom sol, winterbloom big honking button.\ncedar grove studios - stringcar m0 express.\nkeithp.com - snekboard.\nelecrow - pyb nano v2.\nxinabox - xinabox cs11, xinabox cc03.\nteknikio - bluebird.\nsarfata - shirtty board.\nscott shawcroft - python powered gameboy-compatible cartridge.\nndgarage - ndbit6.\nnull byte labs llc - circuitbrains deluxe, circuitbrains basic.\n8086 consultancy - commander.\nalorium technology, llc - aloriumtech evo m51.\naramcon badge team - aramcon badge 2019.\nbdmicro, llc - vina-d51, vina-d21.\nbh dynamics - dynossat-edu obc, dynossat-edu eps.\nbleeptrack - picoplanet.\nespressif - saola 1 w/wroom, saola 1 w/wrover, esp32-s2 kaluga dev kit featuring wrover.\nespruino - espruino pico, espruino wifi.\nhangzhou leban - hiibot bluefi, hiibot iots2.\nikigaisense - ikigaisense vita.\njeremy gillick - thunderpack.\njpconstantineau - bluemicro840, pykey60\nmicrochip - sam e54 xplained pro.\nmicrodev - micros2.\nmuselab - nanoesp32 s2.\nnice keyboards - nice!nano.\noak development technologies - cp -----> sapling !!! .\nopenmv - openmv h7.\nraytac corporation - mdbt50q-db-40.\nsean 'xobs' cross - fomu.\nsimmel project - simmel board.\nswitch science, inc. - ble-ss dev board multi sensor\ntg-techie - tg-watch02a.\ntinkeringtech - scoutmakes azul.\nunexpected maker - unexpected maker feathers2.\ns2 nugget - a wi-fi nugget breakout board combined with an esp32s2 based s2 mini development board.\nadding new boards to the circuitpython list on circuitpython.org: please do a pull request on github at https://github.com/adafruit/circuitpython. circuitpython developers may help get the correct pin data and other information to map a new board.\ncircuitpython sensors and accessories - complete listing of sensors, lcds, displays, robotics, breakout boards, and more.\npython.digikey.com - digi-key electronics has a listing of all python-supported boards on their site in one location including circuitpython and micropython boards.\nnewsletter\nadafruit daily, python for microcontrollers - a weekly newsletter on micropython and circuitpython, a spam-free list.\ncontribute to newsletter - guidelines on contributing to the newsletter.\narchives of all newsletters - list of every newsletter published from the start, november 2016.\nnews\nprogram circuitpython devices with iphone & ios 13 - with the launch of ios 13, iphone users now have the ability to edit code on circuitpython usb devices!\nchanging lives through open source, passion and mentoring - the keynote talk at pyohio, july 27, 2019 by kattni rembor.\ncontrol servos with circuitpython and raspberry pi - the magpi magazine, issue 84, melissa leblanc-williams, july, 2019.\npydev of the week: scott shawcroft - july 1, 2019.\nscott shawcroft: history of circuitpython - a discussion of circuitpython for the core developers of python, pycon 2019.\nfive things you didn't know python could do - youtube video, june 19, 2019.\npycon2019 keynote - light up your life - with python and leds - by nina zakharenko. python opens a whole new world of working with wearable electronics. the slides are also available.\nlearn hardware programming with circuitpython - a course offered by codecademy in collaboration with adafruit.\nuse circuitpython boards on the ti-83 premium ce calculator - circuitpython runs on texas instrument calculators.\nmake: vol. 68 boards guide - make: magazine names python the #1 tech trend for boards in 2019!\nscott shawcroft is squeezing python into microcontrollers - ieee spectrum magazine article on the python programming language for makers.\ncircuit playground express 4-h edition approved - the 4-h branded version was approved by the usda, this is the first circuitpython powered board that is also 4-h approved!\ncircuitpython in space - circuitpython provides an approachable and logical means of conducting science with hardware. paired with low-cost hardware shown to work in space, we can enable an new generation to question and explore the unknown. with the necessary “satellite stuff” already baked in, students can spend their time trying something new rather than reinventing the wheel.\nadafruit pyportal: gui meets circuitpython in a big way - disrupt it yourself podcast on circuitpython and the iot device, pyportal.\ncool tools - sophy wong talks circuit playground express including circuitpython.\ncircuitpython for rapid microcontroller-based prototyping and development - digi-key on the open source community's efforts adapting specific microcontrollers and dev boards to support serious microcontroller development using circuitpython.\nhackspace magazine - issue 17 - circuitpython powered adafruit grand central m4 express review.\npython on hardware means choices for makers - by liz clark - apress. circuitpython (a fork of micropython that is designed from the ground up to be beginner friendly.) this allows end users to use python for their electronics hardware projects similar to how they may have used c/c++ with the arduino ide.\nmethod's magazine - methods ezine: design trends & the transformation of everything features python on hardware, page 35 - pdf.\nhackspace magazine - issue 15 - circuitpython makes the cover on hackspace magazine with feature article, and projects.\ncircuitpython in 2019 - community call for what's wanted and needed in circuitpython for 2019.\ncircuitpython in 2018 - an article discussing the future directions for circuitpython 2018 edition.\ncircuitpython on the adafruit.com/blog - adafruit blog posts discussing circuitpython.\ncircuitpython in microsolutions digital magazine - microchip’s microsolutions, “python on microcontrollers” in design corner article. microsolutions is microchip’s bi-monthly digital magazine.\ncircuitpython snakes its way onto adafruit hardware - an article by make on circuitpython.\nadafruit circuit playground express review - raspberry pi reviews the circuit playground express.\nthe amp hour #383 - an interview with scott shawcroft.\ncircuitpython on hackaday - hackaday posts related to circuitpython.\ncircuitpython on hackster.io - posts on hackster.io related to circuitpython.\ncircuitpython on make - circuitpython related content on make.\nart\ncircuitpython art pack! logos, banners, photos and blinka! - adafruit art relating to circuitpython.\nsocial\n#circuitpython tagged on twitter, latest - twitter posts tagged circuitpython.\ncircuitpython twitter - twitter account aggregator for circuitpython news and more.\ncircuitpython videos on youtube, latest - youtube posts tagged circuitpython.\n#circuitpython tagged photos & videos on instagram - posts on instagram tagged circuitpython.\ncircuitpython - micropython.org forums - articles on the micropython forums tagged for circuitpython.\ncircuitpython tagged on reddit - reddit posts relating to circuitpython.\ncircuitpython community on reddit - dedicated home of circuitpython on reddit /r/circuitpython/.\ncircuitpython on hackaday.io - curated list of projects on hackaday.io.\ncircuitpython on hackster.io - python on hardware projects on hackster.io including circuitpython.\ncircuitpython on instructables - how-tos, guides, and more, using circuitpython on autodesk's instructables.\npodcasts\nweekly community chat on adafruit discord server circuitpython channel - audio / podcast edition - audio from the discord chat space for circuitpython, meetings are usually mondays at 2pm et, this is the audio version on itunes, pocket casts, spotify, and xml feed.\npython on hardware weekly video cast - the wonderful world of python on hardware! this is our video-newsletter-podcast of all things python and electronics! the news comes from the python community, discord, adafruit communities and more. it’s part of the weekly newsletter, then we have a segment on ask an engineer and this is the video slice from that! this video podcast is on itunes, youtube, igtv (instagram tv), and xml.\nthe best python podcasts - the best python podcasts.\npodcast episodes about circuitpython\nthe best python podcasts\nhanselminutes technology podcast – learning circuitpython with scott shawcroft\nreal python podcast episode 5: exploring circuitpython with host christopher bailey and guest thea flowers\nreal python podcast episode 75: building with circuitpython & constraints of python for microcontrollers with host christopher bailey and guest scott shawcroft\nepisode #272: no iot things in hand? simulate them with device simulator express\nepisode #325: micropython + circuitpython\nevents\nweekly community chat on adafruit discord server circuitpython channel - the discord chat space for circuitpython, meetings are usually mondays at 2pm et.\nweekly adafruit show-and-tell, wednesday 7:30pm et on google+ hangouts - the weekly adafruit show-and-tell program often has circuitpython-related projects on display.\nask an engineer, wednesday 8pm et on youtube live - the longest running youtube live show about electronics, information on circuitpython each week during \"python on hardware segment\".\npycon 2022 - salt lake city, utah usa april 27 - may 5, 2022.\nswag\ncircuitpython 7 release poster - circuitpython release version 7 poster.\ncircuitpython 6 release poster - circuitpython release version 6 poster.\ncircuitpython 5 release poster - circuitpython release version 5 poster.\ncircuitpython 4 release poster - circuitpython release version 4 poster featuring nordic.\ncircuitpython 3 release poster - circuitpython release version 3 poster.\nblinka the circuitpython limited edition enamel pin - an enamel pin with the circuitpython mascot.\nblinka the circuitpython sticker - a sticker featuring blinka, the circuitpython mascot.\nblinka the circuitpython temporary tattoo - a temporary tattoo featuring the blinka character.\ncircuitplayground lanyard - circuitplayground lanyard featuring blinka.\ntalks\ncircuitpython 入门 - circuitpython 程序！an entry level circuitpython tutorial in chinese 01: from zero to hello world (youtube).\nchanging lives through open source, passion and mentoring - changing lives through open source, passion and mentoring, keynote by kattni rembor at pyohio 2019.\ncircuitpython: python on hardware - circuitpython: python on hardware by dave astels at pycon canada.\nembedded programming for everyone using micropython and circuitpython - embedded programming for everyone using micropython and circuitpython by ayan pahwa at fossasia summit.\neuropython 2019 talk video: nicholas tollervey – tools of the trade: the making of a code editor - nicholas tollervey.\neuropython 2019 talk video: radomir dopieralski – game development with circuitpython - radomir dopieralski.\nextending micropython: using c for good - a look at how micropython can be extended to add features and improve performance. by matt trentini at pycon australia.\nhanselminutes technology podcast – learning circuitpython with scott shawcroft - scott shawcroft.\nlighting macro photographs with circuitpython - lighting macro photographs with circuitpython by stacy morse at pycon australia.\nmax holiday - circuitpython in space, smallsats and more! - max holiday.\nmicropython & the internet of things - micropython & the internet of things by damien george at goto 2016.\npycon2019 keynote: python on hardware – nina zakharenko - nina zakharenko.\npycon india - 2019 interactive hardware poster presentation powered by circuitpython by ayan pahwa and aakanksha agrawal - ayan pahwa and aakanksha agrawal.\nvideo: pycascades – light up your life – with python and leds - nina zakharenko.\nwriting fast and efficient micropython - writing fast and efficient micropython by damien george at pycon australia.\nmore fun with hardware and circuitpython -- iot, wearables, and more! - nina zakharenko at pycon 2021.\ncontributing\ncontributions and suggestions are always welcome! please make pull requests from your own fork to modify awesome circuitpython.\nthe workflow is explained in detail here: adafruit : contribute to circuitpython with git and github.\ncontribution workflow overview\nfork this repository on github.\nclone the forked repo to your drive.\nadd a remote using owner adafruit and the original url.\nfetch the remote.\nmerge adafruit or main.\ncreate a branch.\nmake a change.\ncommit and push to your repo.\ncreate a pull request on the official repo.\nonce accepted, repeat by merging from the official repo to your fork's master, and re-branch.\nquestions? we're happy to help you to contribute on discord.\nlicense & trademarks\nto the extent possible under law, the authors have waived all copyright and related or neighbouring rights to this work.\nlast updated: november 24, 2021", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000222, "year": null}], "name": "saplingIot"}