{"interestingcomments": [{"Unnamed: 0": 276, "autor": 276, "date": null, "content": "TerrariumPI 4.1.0\nSoftware for cheap home automation of your reptile terrarium or any other enclosed environment. With this software you are able to control for example a terrarium so that the temperature and humidity is of a constant value. Controlling the temperature can be done with heat lights, external heating or cooling system. As long as there is one temperature sensor available the software is able to keep a constant temperature.\nFor humidity control there is support for a spraying system. The sprayer can be configured to spray for an X amount of seconds and there is a minumal period between two spray actions. Use at least one humitidy sensors to get a constant humidity value. In order to lower the humidity you can add a dehumidifier.\nThe software is that flexible that there is no limit in amount of sensors, relay boards or door sensors. The usage can be endless. All power switches have support for timers to trigger based on a time pattern.\nIf you are using this software for your animals or plants, please post some pictures\nExtra documentation can be found at https://theyosh.github.io/TerrariumPI/\nThink off:\nTerrarium (wet or dry)\nAquarium\nTanks with animals or plants\nGrowhouse\nAnd all this is controlled with a nice webinterface based on AdminLTE 3 with Bootstrap 4.\nTable of Contents\nFeatures\nTranslations\nInstallation\nUpdating\nHardware\nGPIO numbering\nNew hardware\nRemote data\nScreenshots\nTesting\nAbout\nFeatures\nControlling electronic devices like lights, sprayers, heating, cooling, water pump equipment etc\nSupport for dimming electronic devices\nManual dimming through web interface\nPredefined on and off dimming durations\nPredefined on and off dimming percentages\nPredefined dimming steps for environment system (heater and cooler)\nSupport for timmers in power switches and environment #72\nPredefined start and stop times based on timer or weather\nPredefined on and off durations in minutes\nSupport for Energenie USB, LAN and RF power switches EG-PM(s)2\nSupport for WeMo Wifi power switches\nSupport for Meross MSS425E Power Switches (Requires Python 3 setup)\nSupport for Sonoff remote power devices\nTasmota\nSupport for multiple type of sensors\nTemperature\nHumidity\nMoisture\nConductivity\nDistance\npH\nLight intensity\nUV A and B\nFertility\nVolume\nSupport for webcams and native Raspberry Pi cam out of the box\nRaspberry Pi cam can be streamed live with 6 seconds delay\nArchiving images based on motion or time interval\nSupport for analog devices through a MCP3008\nSupport for PH probe SKU SEN0161\nSupport for MiFlora Bluetooth sensors\nOpen door detection. This can be used in different environment parts\nTotal power and water usage for costs calculation\nLights control based on sun rise and sun set or timers\nRain control based on humidity sensors and timers\nTemperature control based on temperature sensors or timers\nVariable day and night difference for min and max temperature\nWatertank level control based on ultrasonic sound range sensors or volume sensors\nWeather forecast from external source for lighting schema\nSupports https://openweathermap.org\nTemperatures in Celsius or Fahrenheit\nDistances in centimetres or inches\nAlarm detections\nAudio support through interal audio jack or USB soundcards #42\nCreate playlists (loop and repeat)\nVolume controle in the webinterface\nUploading audio files through webinterface\nAudio meta data support (mediainfo)\nRemote temperature and humidity sensors through HTTP(S) JSON API's. JSON Data format can be found on Remote data wiki.\nDisplay support\nLCD 16x2 or 20x4 screens either through I2C or Serial\nOLED based on SSD1306\nCalendar system when hardware is replacement and when new hardware needs to be installed\nNotifications system. Custom messages for custom actions with use of variables in the messages\nGet notifications through\nEmail\nDisplay\nWebhooks\nNotifications for\nEnvironment part low and high alarm\nSensor high and low measurements\nPower switch toggle on and off\nOpen and close doors\nSystem error and warning messages\nIt is currently controling my reptile terrarium since 2015! And my Madagascar Day Gecko is very happy with it!\nTranslations\nThe software has support for the following languages:\nYour language not in the list or not up to date? Create your own language translation\nInstallation\nThe installation expects a Pi with working network and ssh. It is tested with Raspberry Pi OS Lite. For now the Desktop/Full version is not working somehow.... So use the lite image! A new installation will take about 45 minutes. This is due to manually compiling python modules for the latest versions. Upgrades will go much faster. It is possible to use USB or SSD drives to speed things up: https://www.tomshardware.com/how-to/boot-raspberry-pi-4-usb\nGet a working Raspberry Pi and login as user 'pi'\nssh pi@[raspberry_ip]\nInstall git\nsudo apt -y install git\nClone this repository and submodules!\ngit clone --depth 1 https://github.com/theyosh/TerrariumPI.git\nEnter the new TerrariumPI folder\ncd TerrariumPI\nRun the installer script and wait\nsudo ./install.sh\nReboot Raspberry PI to get all the needed modules loaded\nsudo reboot (if done manual)\nGo to the webinterface at http://[raspberry_ip]:8090 (login: admin/password)\nAll needed options and modules are setup by the installer script. This means that I2C and 1Wire overlay are enabled by default.\nMake sure that your Pi is secured when you put it to the Internet. Would be a shame if TerrariumPI gets next fictum of 'A smart fish tank left a casino vulnerable to hackers' :P\nUpdating\nThis updating is based on that the software is installed with the steps in the Installation above. When updating between release versions it will take more time due to database updates and cleanups. This can be seen in the logfile.\nGet a working Raspberry Pi and login as user 'pi'\nssh pi@[raspberry_ip]\nEnter the TerrariumPI folder\ncd TerrariumPI\nUpdate the new code with git\ngit pull\nRe-run the installation script in order to update software dependencies\nsudo ./install.sh\nRestart TerrariumPI: sudo service terrariumpi restart\nNow clear your browser cache and reload the webinterface. A brand new version should be running.\nHardware\nThis software requires a Raspberry Pi and some extra hardware in order to run and work. The bare minimun and tested hardware is\nRaspberry PI with at least 4GB SD card running Raspberry Pi OS Lite.\nPi 2 (At own risk/no support)\nPi 3 (At own risk/limited support)\nZero (At own risk/no support)\nPi 4\nPower relay board\nUSB versions (Serial and Bitbang)\nGPIO versions\nPWM Dimmer versions\nTemperature/humdity/ultrasonic/PH sensors DHT11, DHT22, AM2303, DS1820, HIH4000, HC-SR04, SEN0161, etc through\nOWFS\nGPIO\n1 Wire interface\nMCP3008 (RasPiO Analog Zero)\nFull list of supported hardware\nGPIO numbering\nAll hardware that connects to the GPIO pins use Physical GPIO numbering (1 - 40). The software will translate it to BCM if needed for a supported device or sensor. More information about GPIO pin numbering\nFor the analog devices use numbers of the channel on the analog device which is from 0 to 7 (8 channels). Also the software expect the analog MCP3008 on GPIO ports 19,21,23,24 physical (default). More information about GPIO pin numbering\nNew hardware\nIf there is some other hardware which is not working with TerrariumPI, open an issue on Github and we will try to support it. We can only test it on a Raspberry PI 4.\nRemote data\nIt is possible to use external sensor data that is available through HTTP(S) in JSON format. This way you can combine multiple Raspberry Pi's with TerrariumPI running to one single system. By using multiple Rapsberry PI's you can cover a bigger area. But there are limitations.\nCurrently it is READONLY. So you can read out remote sensors and switches but you cannot control the remote switches. But this way you can combine the power swiches total costs and power usage.\nmore information is here: Remote data wiki\nScreenshots\n(made on a very big screen :P )\nDashboard\nSensors\nRelays\nEnclosure setup\nArea setup\nSystem settings\nMOTD (Message Of The Day)\nMore screenshots can be found here\nTesting\nFree tested with BrowserStack for opensource\nAbout\nA live version is running at: https://terrarium.theyosh.nl/index.html. Go to 'Help' menu for more information about used hardware, software and how to setup.\nLicense", "link": "https://github.com/theyosh/TerrariumPI", "origin": "Github", "suborigin": "Iot", "result": true, "Selector": "sprayers", "selectorShort": "sprayer", "MarkedSent": "terrariumpi 4.1.0\nsoftware for cheap home automation of your reptile terrarium or any other enclosed environment. with this software you are able to control for example a terrarium so that the temperature and humidity is of a constant value. controlling the temperature can be done with heat lights, external heating or cooling system. as long as there is one temperature sensor available the software is able to keep a constant temperature.\nfor humidity control there is support for a spraying system. the sprayer can be configured to spray for an x amount of seconds and there is a minumal period between two spray actions. use at least one humitidy sensors to get a constant humidity value. in order to lower the humidity you can add a dehumidifier.\nthe software is that flexible that there is no limit in amount of sensors, relay boards or door sensors. the usage can be endless. all power switches have support for timers to trigger based on a time pattern.\nif you are using this software for your animals or plants, please post some pictures\nextra documentation can be found at https://theyosh.github.io/terrariumpi/\nthink off:\nterrarium (wet or dry)\naquarium\ntanks with animals or plants\ngrowhouse\nand all this is controlled with a nice webinterface based on adminlte 3 with bootstrap 4.\ntable of contents\nfeatures\ntranslations\ninstallation\nupdating\nhardware\ngpio numbering\nnew hardware\nremote data\nscreenshots\ntesting\nabout\nfeatures\ncontrolling electronic devices like lights, -----> sprayers !!! , heating, cooling, water pump equipment etc\nsupport for dimming electronic devices\nmanual dimming through web interface\npredefined on and off dimming durations\npredefined on and off dimming percentages\npredefined dimming steps for environment system (heater and cooler)\nsupport for timmers in power switches and environment #72\npredefined start and stop times based on timer or weather\npredefined on and off durations in minutes\nsupport for energenie usb, lan and rf power switches eg-pm(s)2\nsupport for wemo wifi power switches\nsupport for meross mss425e power switches (requires python 3 setup)\nsupport for sonoff remote power devices\ntasmota\nsupport for multiple type of sensors\ntemperature\nhumidity\nmoisture\nconductivity\ndistance\nph\nlight intensity\nuv a and b\nfertility\nvolume\nsupport for webcams and native raspberry pi cam out of the box\nraspberry pi cam can be streamed live with 6 seconds delay\narchiving images based on motion or time interval\nsupport for analog devices through a mcp3008\nsupport for ph probe sku sen0161\nsupport for miflora bluetooth sensors\nopen door detection. this can be used in different environment parts\ntotal power and water usage for costs calculation\nlights control based on sun rise and sun set or timers\nrain control based on humidity sensors and timers\ntemperature control based on temperature sensors or timers\nvariable day and night difference for min and max temperature\nwatertank level control based on ultrasonic sound range sensors or volume sensors\nweather forecast from external source for lighting schema\nsupports https://openweathermap.org\ntemperatures in celsius or fahrenheit\ndistances in centimetres or inches\nalarm detections\naudio support through interal audio jack or usb soundcards #42\ncreate playlists (loop and repeat)\nvolume controle in the webinterface\nuploading audio files through webinterface\naudio meta data support (mediainfo)\nremote temperature and humidity sensors through http(s) json api's. json data format can be found on remote data wiki.\ndisplay support\nlcd 16x2 or 20x4 screens either through i2c or serial\noled based on ssd1306\ncalendar system when hardware is replacement and when new hardware needs to be installed\nnotifications system. custom messages for custom actions with use of variables in the messages\nget notifications through\nemail\ndisplay\nwebhooks\nnotifications for\nenvironment part low and high alarm\nsensor high and low measurements\npower switch toggle on and off\nopen and close doors\nsystem error and warning messages\nit is currently controling my reptile terrarium since 2015! and my madagascar day gecko is very happy with it!\ntranslations\nthe software has support for the following languages:\nyour language not in the list or not up to date? create your own language translation\ninstallation\nthe installation expects a pi with working network and ssh. it is tested with raspberry pi os lite. for now the desktop/full version is not working somehow.... so use the lite image! a new installation will take about 45 minutes. this is due to manually compiling python modules for the latest versions. upgrades will go much faster. it is possible to use usb or ssd drives to speed things up: https://www.tomshardware.com/how-to/boot-raspberry-pi-4-usb\nget a working raspberry pi and login as user 'pi'\nssh pi@[raspberry_ip]\ninstall git\nsudo apt -y install git\nclone this repository and submodules!\ngit clone --depth 1 https://github.com/theyosh/terrariumpi.git\nenter the new terrariumpi folder\ncd terrariumpi\nrun the installer script and wait\nsudo ./install.sh\nreboot raspberry pi to get all the needed modules loaded\nsudo reboot (if done manual)\ngo to the webinterface at http://[raspberry_ip]:8090 (login: admin/password)\nall needed options and modules are setup by the installer script. this means that i2c and 1wire overlay are enabled by default.\nmake sure that your pi is secured when you put it to the internet. would be a shame if terrariumpi gets next fictum of 'a smart fish tank left a casino vulnerable to hackers' :p\nupdating\nthis updating is based on that the software is installed with the steps in the installation above. when updating between release versions it will take more time due to database updates and cleanups. this can be seen in the logfile.\nget a working raspberry pi and login as user 'pi'\nssh pi@[raspberry_ip]\nenter the terrariumpi folder\ncd terrariumpi\nupdate the new code with git\ngit pull\nre-run the installation script in order to update software dependencies\nsudo ./install.sh\nrestart terrariumpi: sudo service terrariumpi restart\nnow clear your browser cache and reload the webinterface. a brand new version should be running.\nhardware\nthis software requires a raspberry pi and some extra hardware in order to run and work. the bare minimun and tested hardware is\nraspberry pi with at least 4gb sd card running raspberry pi os lite.\npi 2 (at own risk/no support)\npi 3 (at own risk/limited support)\nzero (at own risk/no support)\npi 4\npower relay board\nusb versions (serial and bitbang)\ngpio versions\npwm dimmer versions\ntemperature/humdity/ultrasonic/ph sensors dht11, dht22, am2303, ds1820, hih4000, hc-sr04, sen0161, etc through\nowfs\ngpio\n1 wire interface\nmcp3008 (raspio analog zero)\nfull list of supported hardware\ngpio numbering\nall hardware that connects to the gpio pins use physical gpio numbering (1 - 40). the software will translate it to bcm if needed for a supported device or sensor. more information about gpio pin numbering\nfor the analog devices use numbers of the channel on the analog device which is from 0 to 7 (8 channels). also the software expect the analog mcp3008 on gpio ports 19,21,23,24 physical (default). more information about gpio pin numbering\nnew hardware\nif there is some other hardware which is not working with terrariumpi, open an issue on github and we will try to support it. we can only test it on a raspberry pi 4.\nremote data\nit is possible to use external sensor data that is available through http(s) in json format. this way you can combine multiple raspberry pi's with terrariumpi running to one single system. by using multiple rapsberry pi's you can cover a bigger area. but there are limitations.\ncurrently it is readonly. so you can read out remote sensors and switches but you cannot control the remote switches. but this way you can combine the power swiches total costs and power usage.\nmore information is here: remote data wiki\nscreenshots\n(made on a very big screen :p )\ndashboard\nsensors\nrelays\nenclosure setup\narea setup\nsystem settings\nmotd (message of the day)\nmore screenshots can be found here\ntesting\nfree tested with browserstack for opensource\nabout\na live version is running at: https://terrarium.theyosh.nl/index.html. go to 'help' menu for more information about used hardware, software and how to setup.\nlicense", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000276, "year": null}], "name": "sprayerIot"}