{"interestingcomments": [{"Unnamed: 0": 140423, "autor": "Henri_Dupont", "date": 1633054350000, "content": "The Three Rules of Painting /!/ Trying to teach a guy to be a better painter, so I came up with The Three Rules of Painting,\n\n1. A bad painter cleans up their messes, but a good painter doesn't make messes in the first place (we don't even talk about the painters that make messes and don't clean them up, they're demoted to fetching sodies for the painters at break time) \n\n2. You can't paint if you can't see! Put some damn lights on your work. \n\n3. Clean up your damn brushes and tools at the end of each day! \n\n\nWhat would you put down as the three rules of painting?", "link": "https://www.reddit.com/r/HomeImprovement/comments/pyycu5/the_three_rules_of_painting/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "the three rules of painting /!/ trying to teach a guy to be a better painter, so i -----> came !!!  -----> up !!!  -----> with !!!  the three rules of painting,\n\n1. a bad painter cleans up their messes, but a good painter doesn't make messes in the first place (we don't even talk about the painters that make messes and don't clean them up, they're demoted to fetching sodies for the painters at break time) \n\n2. you can't paint if you can't see! put some damn lights on your work. \n\n3. clean up your damn brushes and tools at the end of each day! \n\n\nwhat would you put down as the three rules of painting?", "sortedWord": "None", "removed": null, "score": 1, "comments": 18, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/pyycu5/the_three_rules_of_painting/", "identifyer": 140423, "year": "2021"}, {"Unnamed: 0": 143773, "autor": "possumtree", "date": 1619215589000, "content": "How does one spray deck balusters/railings without getting overspray everywhere? /!/ I'm refinishing my deck, including the railings, which are painted white. I figured the easiest way to go about this is to spray the paint (have new Graco sprayer I've never used). I\"m trying to figure out the logistics of doing this without getting overspray everywhere. Best I can come up with is just lay drop cloths on stained deck and put plastic behind rails I'm painting. Is this the best way?", "link": "https://www.reddit.com/r/HomeImprovement/comments/mx6asc/how_does_one_spray_deck_balustersrailings_without/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how does one spray deck balusters/railings without getting overspray everywhere? /!/ i'm refinishing my deck, including the railings, which are painted white. i figured the easiest way to go about this is to spray the paint (have new graco sprayer i've never used). i\"m trying to figure out the logistics of doing this without getting overspray everywhere. best i can -----> come !!!  -----> up !!!  -----> with !!!  is just lay drop cloths on stained deck and put plastic behind rails i'm painting. is this the best way?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/mx6asc/how_does_one_spray_deck_balustersrailings_without/", "identifyer": 143773, "year": "2021"}, {"Unnamed: 0": 145188, "autor": "cantpickaclevername", "date": 1627756698000, "content": "Is this armour stone wall acceptable? /!/ Pics here: https://imgur.com/a/4Cnp3JN\n\nWe’re getting some landscaping done in our backyard by a reputable company and spending a lot of money, so we have high expectations. So far the experience hasn’t been stellar because of missed days not showing up without notice, then delays starting again, small damage to the trim of the garage and damage to our neighbours fence by the excavator (which they’ve agreed to fix). \n\nAnyway, we have an L shaped retaining wall with armour stone that runs along side the garage and then across the yard, and want a sanity check on two things:\n\n* The top two stones towards the end are much less wide (as much as 6.5 inches) than the ones below so it tapers towards the end. When flagged, the worker’s explanation was first “this is a good thing so that it’s more stable”. Raised it with the project manager and he said that’s how it goes with armour stone - the sizing isn’t consistent, and because they had to place it against the wall the front ends up uneven. And that this is the stone that they have, if they had wider stone (on site) they’d use it. We’re not 100% happy with how it looks, are we being too fussy? Is it reasonable to ask them to bring in new stone that’s as wide as those below?\n\n* The drawings specifically showed that they armour stone should extend further than the back of the garage (see pics) to hide the concrete blocks that we had to put behind the garage, but instead it’s in line with the back of the garage. It should be noted that they started laying the blocks here, so I think they just missed it. Spoke to the PM and he said again it’s just how it goes with armour stone, and they can’t always get it done exactly as it is in the drawings. His solution is that we should get the designer to put in some grass or something to hide it. Again, we’re paying a lot of money for this and the drawing was very clear, are we being too fussy by insisting they should fix it?\n\nI should add that we had this exact problem at the other end of the retaining wall, it was shorter than it should have been, and they came up with a solution. \n\nAnd again, we know this isn't huge in the big scheme of things, but we've waited a long time for the project to start and we're paying a lot, so it's important to us.", "link": "https://www.reddit.com/r/HomeImprovement/comments/ovchdq/is_this_armour_stone_wall_acceptable/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "is this armour stone wall acceptable? /!/ pics here: https://imgur.com/a/4cnp3jn\n\nwe’re getting some landscaping done in our backyard by a reputable company and spending a lot of money, so we have high expectations. so far the experience hasn’t been stellar because of missed days not showing up without notice, then delays starting again, small damage to the trim of the garage and damage to our neighbours fence by the excavator (which they’ve agreed to fix). \n\nanyway, we have an l shaped retaining wall with armour stone that runs along side the garage and then across the yard, and want a sanity check on two things:\n\n* the top two stones towards the end are much less wide (as much as 6.5 inches) than the ones below so it tapers towards the end. when flagged, the worker’s explanation was first “this is a good thing so that it’s more stable”. raised it with the project manager and he said that’s how it goes with armour stone - the sizing isn’t consistent, and because they had to place it against the wall the front ends up uneven. and that this is the stone that they have, if they had wider stone (on site) they’d use it. we’re not 100% happy with how it looks, are we being too fussy? is it reasonable to ask them to bring in new stone that’s as wide as those below?\n\n* the drawings specifically showed that they armour stone should extend further than the back of the garage (see pics) to hide the concrete blocks that we had to put behind the garage, but instead it’s in line with the back of the garage. it should be noted that they started laying the blocks here, so i think they just missed it. spoke to the pm and he said again it’s just how it goes with armour stone, and they can’t always get it done exactly as it is in the drawings. his solution is that we should get the designer to put in some grass or something to hide it. again, we’re paying a lot of money for this and the drawing was very clear, are we being too fussy by insisting they should fix it?\n\ni should add that we had this exact problem at the other end of the retaining wall, it was shorter than it should have been, and they -----> came !!!  -----> up !!!  -----> with !!!  a solution. \n\nand again, we know this isn't huge in the big scheme of things, but we've waited a long time for the project to start and we're paying a lot, so it's important to us.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/ovchdq/is_this_armour_stone_wall_acceptable/", "identifyer": 145188, "year": "2021"}, {"Unnamed: 0": 147041, "autor": "TezlaCoil", "date": 1613456920000, "content": "Strain Relief for Garage Outlet /!/ Hi all,\nLocation: USA, Chicagoland\n\nI have an outlet in my garage, about 4.5' off the ground, used nearly exclusively for lawn tools. After accidentally running out of cord a couple times and having it pull out of the outlet, I'm thinking some sort of strain relief is probably a good idea.\n\nRight now, I'm thinking of DIYing a ~3' extension cable with a right-angle plug on one end, attaching it to a nearby stud, and allowing most of it to move freely as stress is applied. The idea being if I do something dumb again, the force is put on the stud, not the outlet, and the plug won't try to remove itself at an angle.\n\nWhere I'm running into trouble, is how to fix the cord to the wall. The best I've come up with so far, is to hold the extension in a cord grip, threaded into a brass tee, which is threaded into a flange, and attached to the stud (parts list below). This project is likely already well into the realm of \"overkill\", but I feel like cord strain relief is a common enough problem to avoid having to plumb an extension cord.\nhttps://www.mcmaster.com/7529K577/\nhttps://www.homedepot.com/p/Everbilt-3-4-in-FIP-Brass-Tee-Fitting-801879/300095969\nhttps://www.homedepot.com/p/HOME-FLEX-3-4-in-CSST-x-3-4-in-MIPT-Brass-Termination-Flange-11-464-008/204367280\n\nAnyone here run into a similar issue, and have a simpler way to solve it?", "link": "https://www.reddit.com/r/HomeImprovement/comments/lkxt68/strain_relief_for_garage_outlet/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "strain relief for garage outlet /!/ hi all,\nlocation: usa, chicagoland\n\ni have an outlet in my garage, about 4.5' off the ground, used nearly exclusively for lawn tools. after accidentally running out of cord a couple times and having it pull out of the outlet, i'm thinking some sort of strain relief is probably a good idea.\n\nright now, i'm thinking of diying a ~3' extension cable with a right-angle plug on one end, attaching it to a nearby stud, and allowing most of it to move freely as stress is applied. the idea being if i do something dumb again, the force is put on the stud, not the outlet, and the plug won't try to remove itself at an angle.\n\nwhere i'm running into trouble, is how to fix the cord to the wall. the best i've -----> come !!!  -----> up !!!  -----> with !!!  so far, is to hold the extension in a cord grip, threaded into a brass tee, which is threaded into a flange, and attached to the stud (parts list below). this project is likely already well into the realm of \"overkill\", but i feel like cord strain relief is a common enough problem to avoid having to plumb an extension cord.\nhttps://www.mcmaster.com/7529k577/\nhttps://www.homedepot.com/p/everbilt-3-4-in-fip-brass-tee-fitting-801879/300095969\nhttps://www.homedepot.com/p/home-flex-3-4-in-csst-x-3-4-in-mipt-brass-termination-flange-11-464-008/204367280\n\nanyone here run into a similar issue, and have a simpler way to solve it?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/lkxt68/strain_relief_for_garage_outlet/", "identifyer": 147041, "year": "2021"}, {"Unnamed: 0": 152321, "autor": "skronick", "date": 1631047051000, "content": "I DIY'ed a full structural seismic retrofit on my 1920's SF Bay Area house /!/ # OK, what's a \"seismic retrofit\"?\n\nIf you don't live in California, the title of this post probably won't make much sense. I'm not from here originally, so I had no idea what a \"seismic retrofit\" was either before we bought our first house last Fall and saw it called out on the home inspection. In short: most of the wood-framed houses in this area were built without sufficient side-to-side (\"shear\") strength on their lower (\"cripple\") walls to withstand the forces of a big earthquake. They can slide off the foundation or collapse completely. Not good. Over the years, structural engineers have come up with ways to retrofit existing houses with plywood and some special metal connectors to add the strength they need.\n\n([Read more about seismic retrofits and \"shear walls\" here](http://www.shearwalls.com/)— I can also recommend the book sold on this site as a good DIY resource)\n\n# Why did I do this (myself)?\n\nRetrofitting your house in this way is, surprisingly, completely optional. It's not against code or the law to leave your old house in a vulnerable state indefinitely. It's also, not surprisingly, rather expensive to fix it. I heard numbers ranging from $25,000 - $45,000 for this sort of thing if you went with a full service contractor. So most of the houses we looked at buying simply didn't have the work done. Chalk this up as one more crazy thing about buying a house in this area. In any case, a few things came together that convinced me that this was a must-have upgrade for our new-to-us 1920's house:\n\n* I'm not afraid to learn new things and put in the work to DIY a job like this\n* I am (perhaps to an irrational degree) afraid of earthquakes\n* The city I'm in (Berkeley) provides a significant tax refund if you retrofit your house within the first year of ownership (based on a percentage of the purchase price— for me it wound up being worth about $6500)\n* The lower level of the house we bought was completely unfinished so I didn't have to tear up drywall or anything to do the job\n* The lower level has 7' tall walls/ceilings— many houses have cripple walls that are &lt; 3' tall so doing the work would involve worming around in a crawl space that was never meant for human habitation. I was able to do it all while comfortably standing up and could load tools and materials in at ground level through the garage.\n\n# What did I have to do?\n\nImgur album here shows some of the process: [https://imgur.com/a/8Qeg57U](https://imgur.com/a/8Qeg57U)\n\nThe basic process involves the creation of several strong \"shear walls\" throughout the floor plan of the house. Constructing these requires:\n\n* Drilling holes through the existing mudsill and into the foundation for anchor bolts\n* Installing anchor bolts with structural epoxy to tie the mudsills to the foundation\n* Installing metal connector hardware to tie the floor above to the walls below\n* Installing additional stud framing within the designated shear walls\n* Installing metal hold downs to tie the framing into the foundation within the shear walls\n* Cutting to size and nailing plywood to the face of the shear walls\n\nThe engineering involved to know exactly how many shear walls are needed, where to place them, and the details of their construction is not really a DIY process, and I needed to have plans drawn up by a real licensed engineer in order to get money back from the city, so I hired that part out. Note that many houses can use a free set of standard plans called [\"Plan Set A\"](https://abag.ca.gov/sites/default/files/plan-set-a.pdf) which gives conservative guidelines for many homes, but I could not use it because the cripple walls in my house are too tall.\n\nUnfortunately the engineer's plans came back with one additional complication: he specified a new foundation footing to be poured in the middle of the house so that one of the interior walls could be constructed as a shear wall. Just anchoring it down to the concrete slab would not suffice. So I had to cut open the slab, excavate down 24\" for the footing, and pour new concrete. When I saw this I almost changed my mind about doing the job myself... but after a week of thinking it through I forged ahead and made it happen.\n\n# How much did it cost?\n\n**Engineered plans: $2,000** (The structural engineer came out to my house with a helper, took measurements, looked at the condition of the existing foundation and walls, made a few notes, and sent me a set of plans with engineered calculations a couple of weeks later)\n\n**\"Special inspection\" for the anchor bolts: $500** (a complete racket— these are required by code but a total joke. The inspector came by for less than 15 minutes but charged a minimum of 4 hours at $125/hr)\n\n**Framing lumber and plywood: $1,475** (I bought most of this before lumber prices went through the roof, but I also had to buy a couple of $95 sheets of plywood in June)\n\n**Nails: $124** (This job required a surprisingly large quantity... worth listing out on its own)\n\n**New SDS hammer drill: $300** (could have rented this, but I decided to buy and am glad I did— this was annoying work that I was happy to split across a couple of weekends)\n\n**Metal connectors, anchor bolts, hold downs, and structural epoxy for anchors:** **$1,500** (Almost all of this stuff comes from Simpson Strong-Tie who more or less hold a monopoly on the market. But it's easy enough to use and seems high quality so I'm not complaining)\n\n**Tool rentals to excavate and pour new foundation: $360** (Concrete saw, jackhammer, electric concrete mixer)\n\n**Concrete mix, rebar, and delivery for new foundation: $680**\n\n**Day laborers to help dig foundation &amp; mix concrete: $600**\n\n\\- - -\n\n**Total spent: $7540**\n\n**Minus tax refund from the city: $6500**\n\n# Net cost: $1,040\n\n**Bottom line is that I did this job almost entirely myself for the cost of materials, tool rentals (and some new tool purchases), and got most of that money back from the city tax refund.** It took me many weekends over several months, but it was easy to pick up and put down since it didn't affect our finished living space at all. Now our house is stronger than ever and we are planning out how to finish out the lower level and add even more value.\n\nHope this inspires someone else out there!", "link": "https://www.reddit.com/r/HomeImprovement/comments/pjvf36/i_diyed_a_full_structural_seismic_retrofit_on_my/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i diy'ed a full structural seismic retrofit on my 1920's sf bay area house /!/ # ok, what's a \"seismic retrofit\"?\n\nif you don't live in california, the title of this post probably won't make much sense. i'm not from here originally, so i had no idea what a \"seismic retrofit\" was either before we bought our first house last fall and saw it called out on the home inspection. in short: most of the wood-framed houses in this area were built without sufficient side-to-side (\"shear\") strength on their lower (\"cripple\") walls to withstand the forces of a big earthquake. they can slide off the foundation or collapse completely. not good. over the years, structural engineers have -----> come !!!  -----> up !!!  -----> with !!!  ways to retrofit existing houses -----> with !!!  plywood and some special metal connectors to add the strength they need.\n\n([read more about seismic retrofits and \"shear walls\" here](http://www.shearwalls.com/)— i can also recommend the book sold on this site as a good diy resource)\n\n# why did i do this (myself)?\n\nretrofitting your house in this way is, surprisingly, completely optional. it's not against code or the law to leave your old house in a vulnerable state indefinitely. it's also, not surprisingly, rather expensive to fix it. i heard numbers ranging from $25,000 - $45,000 for this sort of thing if you went with a full service contractor. so most of the houses we looked at buying simply didn't have the work done. chalk this up as one more crazy thing about buying a house in this area. in any case, a few things came together that convinced me that this was a must-have upgrade for our new-to-us 1920's house:\n\n* i'm not afraid to learn new things and put in the work to diy a job like this\n* i am (perhaps to an irrational degree) afraid of earthquakes\n* the city i'm in (berkeley) provides a significant tax refund if you retrofit your house within the first year of ownership (based on a percentage of the purchase price— for me it wound up being worth about $6500)\n* the lower level of the house we bought was completely unfinished so i didn't have to tear up drywall or anything to do the job\n* the lower level has 7' tall walls/ceilings— many houses have cripple walls that are &lt; 3' tall so doing the work would involve worming around in a crawl space that was never meant for human habitation. i was able to do it all while comfortably standing up and could load tools and materials in at ground level through the garage.\n\n# what did i have to do?\n\nimgur album here shows some of the process: [https://imgur.com/a/8qeg57u](https://imgur.com/a/8qeg57u)\n\nthe basic process involves the creation of several strong \"shear walls\" throughout the floor plan of the house. constructing these requires:\n\n* drilling holes through the existing mudsill and into the foundation for anchor bolts\n* installing anchor bolts with structural epoxy to tie the mudsills to the foundation\n* installing metal connector hardware to tie the floor above to the walls below\n* installing additional stud framing within the designated shear walls\n* installing metal hold downs to tie the framing into the foundation within the shear walls\n* cutting to size and nailing plywood to the face of the shear walls\n\nthe engineering involved to know exactly how many shear walls are needed, where to place them, and the details of their construction is not really a diy process, and i needed to have plans drawn up by a real licensed engineer in order to get money back from the city, so i hired that part out. note that many houses can use a free set of standard plans called [\"plan set a\"](https://abag.ca.gov/sites/default/files/plan-set-a.pdf) which gives conservative guidelines for many homes, but i could not use it because the cripple walls in my house are too tall.\n\nunfortunately the engineer's plans came back with one additional complication: he specified a new foundation footing to be poured in the middle of the house so that one of the interior walls could be constructed as a shear wall. just anchoring it down to the concrete slab would not suffice. so i had to cut open the slab, excavate down 24\" for the footing, and pour new concrete. when i saw this i almost changed my mind about doing the job myself... but after a week of thinking it through i forged ahead and made it happen.\n\n# how much did it cost?\n\n**engineered plans: $2,000** (the structural engineer came out to my house with a helper, took measurements, looked at the condition of the existing foundation and walls, made a few notes, and sent me a set of plans with engineered calculations a couple of weeks later)\n\n**\"special inspection\" for the anchor bolts: $500** (a complete racket— these are required by code but a total joke. the inspector came by for less than 15 minutes but charged a minimum of 4 hours at $125/hr)\n\n**framing lumber and plywood: $1,475** (i bought most of this before lumber prices went through the roof, but i also had to buy a couple of $95 sheets of plywood in june)\n\n**nails: $124** (this job required a surprisingly large quantity... worth listing out on its own)\n\n**new sds hammer drill: $300** (could have rented this, but i decided to buy and am glad i did— this was annoying work that i was happy to split across a couple of weekends)\n\n**metal connectors, anchor bolts, hold downs, and structural epoxy for anchors:** **$1,500** (almost all of this stuff comes from simpson strong-tie who more or less hold a monopoly on the market. but it's easy enough to use and seems high quality so i'm not complaining)\n\n**tool rentals to excavate and pour new foundation: $360** (concrete saw, jackhammer, electric concrete mixer)\n\n**concrete mix, rebar, and delivery for new foundation: $680**\n\n**day laborers to help dig foundation &amp; mix concrete: $600**\n\n\\- - -\n\n**total spent: $7540**\n\n**minus tax refund from the city: $6500**\n\n# net cost: $1,040\n\n**bottom line is that i did this job almost entirely myself for the cost of materials, tool rentals (and some new tool purchases), and got most of that money back from the city tax refund.** it took me many weekends over several months, but it was easy to pick up and put down since it didn't affect our finished living space at all. now our house is stronger than ever and we are planning out how to finish out the lower level and add even more value.\n\nhope this inspires someone else out there!", "sortedWord": "None", "removed": null, "score": 1, "comments": 23, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/pjvf36/i_diyed_a_full_structural_seismic_retrofit_on_my/", "identifyer": 152321, "year": "2021"}, {"Unnamed: 0": 152625, "autor": "curlyfacephil", "date": 1632325492000, "content": "Cleaning lime mortar off a brick wall? /!/ Looking for some suggestions on how to clean lime mortar off a brick wall. The wall is an interior wall, we removed plaster off the wall and want to leave it exposed but are having some issues coming up with the best way to clean it. The mortar is pretty soft - you can use your nail and get most of it off. We want to do as little damage to the brick as possible and we also want to create as little dust as possible so something with a vaccuum attachment is ideal. The house does have a dust barrier up but its not fool proof so we're trying to avoid as much dust as possible still...\n\nIdeally it would be a tool we could rent? I thought about using an orbital sander with an attachment but sanding doesn't seem like the correct way to do this as it'll also sand the brick. I found a youtube video of a guy using a drill attachment with a wire brush. This does work but it also scratches the brick and creates a TON of dust. \n\nPhotos here:\nhttps://imgur.com/a/uIRzOQv\n\nAny suggestions, please?", "link": "https://www.reddit.com/r/HomeImprovement/comments/pta9ud/cleaning_lime_mortar_off_a_brick_wall/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "cleaning lime mortar off a brick wall? /!/ looking for some suggestions on how to clean lime mortar off a brick wall. the wall is an interior wall, we removed plaster off the wall and want to leave it exposed but are having some issues -----> coming !!!  -----> up !!!  -----> with !!!  the best way to clean it. the mortar is pretty soft - you can use your nail and get most of it off. we want to do as little damage to the brick as possible and we also want to create as little dust as possible so something with a vaccuum attachment is ideal. the house does have a dust barrier up but its not fool proof so we're trying to avoid as much dust as possible still...\n\nideally it would be a tool we could rent? i thought about using an orbital sander with an attachment but sanding doesn't seem like the correct way to do this as it'll also sand the brick. i found a youtube video of a guy using a drill attachment with a wire brush. this does work but it also scratches the brick and creates a ton of dust. \n\nphotos here:\nhttps://imgur.com/a/uirzoqv\n\nany suggestions, please?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/pta9ud/cleaning_lime_mortar_off_a_brick_wall/", "identifyer": 152625, "year": "2021"}, {"Unnamed: 0": 155024, "autor": "whendonow", "date": 1635596817000, "content": "What type of person/role can help decide on exterior house color and new windows? /!/ The house needs a lot of wood repair and the windows are shot, beyond repair I am told. Thinking of getting new style of windows, likely larger etc and then doing wood repair and painting. I am at a loss in the decision making process and want to hire someone with good style and talent to assist. What kind of position would I be searching for?  Everything I am googling is coming up with interior designers rather and virtual tools.", "link": "https://www.reddit.com/r/HomeImprovement/comments/qj0gh9/what_type_of_personrole_can_help_decide_on/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "what type of person/role can help decide on exterior house color and new windows? /!/ the house needs a lot of wood repair and the windows are shot, beyond repair i am told. thinking of getting new style of windows, likely larger etc and then doing wood repair and painting. i am at a loss in the decision making process and want to hire someone with good style and talent to assist. what kind of position would i be searching for?  everything i am googling is -----> coming !!!  -----> up !!!  -----> with !!!  interior designers rather and virtual tools.", "sortedWord": "None", "removed": null, "score": 1, "comments": 30, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/qj0gh9/what_type_of_personrole_can_help_decide_on/", "identifyer": 155024, "year": "2021"}, {"Unnamed: 0": 161922, "autor": "crabby_old_dude", "date": 1622676918000, "content": "Finishing Basement Part 1, Rough-in /!/ https://imgur.com/gallery/Bz6p3s7\n\n\nThought I'd share some pictures of the process I'm going through to finish my basement, so far I've done all the work myself.  My wife was gung-ho on finishing it, I kinda liked it unfinished, usually just exercise, work on my bikes and storage.  The full sub-floor access to the first floor is also very convenient, I'm going to miss that.\n\n\nThe plan I came up with was to add a large room with a TV, a kitchen area, gym and a bathroom.  The builder stubbed out a bathroom that ran to a sewage bin beneath the stairs, but that was across the basement from the back door.  We've got a pool and want the bathroom to be close to the back door, so kids don't have to walk across the entire basement.  I also wanted to open the dark side of the basement a bit, where the gym would be, that involved removing 3 load bearing walls.\n\n\nI came up with a plan and so far have stuck to it, the order of the list was planned to get the more difficult stuff in the ceiling first, large rigid pipes, inflexible wires followed by easier stuff.\n\n\n* Got an engineer on site ($450)\n\n* Added new smoke detectors (Needed to add SDs to all bedrooms for the permit, when I'd done there will be 12 smoke detectors in the house)\n\n* Replace 15 year old gas water heater\n\n* Run fresh air duct to utility room, 8\" rigid duct.  (this was difficult because of the space restrictions)\n\n* Run 100amp sub panel, 2/0 service wire\n\n* Run 2\" plumbing vent to new kitchen and bath area\n\n* In slab plumbing  (Passed inspection)\n\n* Replace window with door.  (new room for  storage, lawnmower etc.)\n\n* Framing, beams, walls\n\n* Ran bathroom vent\n\n* Begin soffit work\n\n* In wall and soffit plumbing work\n\n* Ran some electrical\n\n\nOrder now gets complicated because I had to add electrical and HVAC ducts to the soffits, but I needed to enclose the soffit for draft stopping.  I did what I had to in the joist bays, enclosed the soffits and then ran wire for lights within the soffit.\n\n\n* HVAC ducts  (8 registers, 3 returns, 3 - 8\" ducts and one 6\".  HVAC guy said I was a bit oversized for the basement but it looked good, better than being undersized.  He aslo said he'd hire me)\n\n\n* More electrical\n\n\nI'm mostly done with the rough-in, I'm still working on the draft-stopping.  A/C should be going in in 2 weeks, and I'll then request my second inspection.\n\n\nI'm going to hire out the drywall, while I probably could do it, a pro will be much faster and much better.  Drywall takes a lot of time to get good at it.  \n\n\nThere is also an endless list after drywall, but I kinda don't want to think about it now.\n\n* Prime\n\n* Trim, doors, crown\n\n* Build kitchen cabinets, paint cabinets\n\n* Bathroom work, Schluter, tile, build bath vanity\n\n* Paint\n\n* Flooring (most likely LVP)\n\n* Finishing basement stairs.\n\n* lots more", "link": "https://www.reddit.com/r/HomeImprovement/comments/nqzkf3/finishing_basement_part_1_roughin/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "finishing basement part 1, rough-in /!/ https://imgur.com/gallery/bz6p3s7\n\n\nthought i'd share some pictures of the process i'm going through to finish my basement, so far i've done all the work myself.  my wife was gung-ho on finishing it, i kinda liked it unfinished, usually just exercise, work on my bikes and storage.  the full sub-floor access to the first floor is also very convenient, i'm going to miss that.\n\n\nthe plan i -----> came !!!  -----> up !!!  -----> with !!!  was to add a large room -----> with !!!  a tv, a kitchen area, gym and a bathroom.  the builder stubbed out a bathroom that ran to a sewage bin beneath the stairs, but that was across the basement from the back door.  we've got a pool and want the bathroom to be close to the back door, so kids don't have to walk across the entire basement.  i also wanted to open the dark side of the basement a bit, where the gym would be, that involved removing 3 load bearing walls.\n\n\ni came up with a plan and so far have stuck to it, the order of the list was planned to get the more difficult stuff in the ceiling first, large rigid pipes, inflexible wires followed by easier stuff.\n\n\n* got an engineer on site ($450)\n\n* added new smoke detectors (needed to add sds to all bedrooms for the permit, when i'd done there will be 12 smoke detectors in the house)\n\n* replace 15 year old gas water heater\n\n* run fresh air duct to utility room, 8\" rigid duct.  (this was difficult because of the space restrictions)\n\n* run 100amp sub panel, 2/0 service wire\n\n* run 2\" plumbing vent to new kitchen and bath area\n\n* in slab plumbing  (passed inspection)\n\n* replace window with door.  (new room for  storage, lawnmower etc.)\n\n* framing, beams, walls\n\n* ran bathroom vent\n\n* begin soffit work\n\n* in wall and soffit plumbing work\n\n* ran some electrical\n\n\norder now gets complicated because i had to add electrical and hvac ducts to the soffits, but i needed to enclose the soffit for draft stopping.  i did what i had to in the joist bays, enclosed the soffits and then ran wire for lights within the soffit.\n\n\n* hvac ducts  (8 registers, 3 returns, 3 - 8\" ducts and one 6\".  hvac guy said i was a bit oversized for the basement but it looked good, better than being undersized.  he aslo said he'd hire me)\n\n\n* more electrical\n\n\ni'm mostly done with the rough-in, i'm still working on the draft-stopping.  a/c should be going in in 2 weeks, and i'll then request my second inspection.\n\n\ni'm going to hire out the drywall, while i probably could do it, a pro will be much faster and much better.  drywall takes a lot of time to get good at it.  \n\n\nthere is also an endless list after drywall, but i kinda don't want to think about it now.\n\n* prime\n\n* trim, doors, crown\n\n* build kitchen cabinets, paint cabinets\n\n* bathroom work, schluter, tile, build bath vanity\n\n* paint\n\n* flooring (most likely lvp)\n\n* finishing basement stairs.\n\n* lots more", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/nqzkf3/finishing_basement_part_1_roughin/", "identifyer": 161922, "year": "2021"}, {"Unnamed: 0": 164470, "autor": "Walts_Ahole", "date": 1625976022000, "content": "Formal sharing of tools amongst neighbors /!/ Good evening Reddit,\n\n&amp;#x200B;\n\nOur neighborhood is finally moving away from nextdoor (finally) and setting up a website.  Here's what I'm needing thoughts on; I'm wanting to setup a section of the forum section where neighbors can share tools somehow, maybe with a fee, but much less than what it'd be to rent at home depot or wherever, plus it'd be in the neighborhood so it's much closer.\n\n&amp;#x200B;\n\nFor example, I have a lawn aerator wood chipper, chainsaw, polesaw, 8x10 trailer &amp; a 18' car hauler trailer that get rarely used along with a large workshop full of wood/metal-working tools that I can't use all at once and if I can help someone else out by loaning out a tool or something here &amp; there, I'm all for that - just gotta get it back at the agreed time!\n\n&amp;#x200B;\n\nIf I'm allowed to proceed with this, I'll get a few of the neighbors together to get a concensus some some standard rules &amp; how to deal with issues, but I'd like to start with a few thoughts to get things rolling.\n\n&amp;#x200B;\n\nI've come up with;\n\n\\- The goal of this site is to help one another with projects we're taking on at our homes without incurring unnecesary fees &amp; costs to rent tools that others may be willing loan.\n\n\\- All parties using this website for loaning tools will hold the HOA harmless for any/all incidents (lawyers can figure out what they want in here)\n\n\\- Any &amp; all parties entering into agreements through this site are expected to be civil &amp; courteous to one another on this site as well as offline.  \n\n\\- The loanee in all instances shall hold the owner of the tool/equipment harmless from any &amp; all damages or injuries related to the use of said tool\n\n\\- Any fees for use, especially on high-value items should be discussed beforehand and paid before use.  The loanee should always offer this upfront.  \n\n\\- Any deposits required should be provided up front for high-value items or items to be used for extended periods.\n\n\\- A simple written agreement form will be available for download on this website and should be signed by bother parties, photographed by the loanee and kept by the owner.\n\n\\- Both parties of each agreement are highly encouraged to take photos of the equipment before &amp; after use by the loanee.\n\n\\- It is suggested that powered devices should be supplied with fuel/etc for the duration of use to avoid incorrect/bad gas being used.\n\n\\- The \"loanee\" should reimburse the owner for new blades/etc unless agreed prior that this is not necessary unless damages are incurred during use.\n\n&amp;#x200B;\n\nThis isn't necessarily just for tools, this could be for cooking items such as BBQ pits, specialty cake pans, etc...  Any of the buy &amp; use once/few times.  Also thinking about using this for group buys on bbq pellets, fertilizer, etc...\n\n&amp;#x200B;\n\nI know there's all kinds of safety concerns related to doing this, but I feel like most folks can tell if someone shouldn't be using a certain tool and I certainly wouldn't loan out any tool if I'm not comfortable that my neighbor could use safely.\n\n&amp;#x200B;\n\nAny thoughts or suggestions on this?", "link": "https://www.reddit.com/r/HomeImprovement/comments/ohxeiw/formal_sharing_of_tools_amongst_neighbors/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "formal sharing of tools amongst neighbors /!/ good evening reddit,\n\n&amp;#x200b;\n\nour neighborhood is finally moving away from nextdoor (finally) and setting up a website.  here's what i'm needing thoughts on; i'm wanting to setup a section of the forum section where neighbors can share tools somehow, maybe with a fee, but much less than what it'd be to rent at home depot or wherever, plus it'd be in the neighborhood so it's much closer.\n\n&amp;#x200b;\n\nfor example, i have a lawn aerator wood chipper, chainsaw, polesaw, 8x10 trailer &amp; a 18' car hauler trailer that get rarely used along with a large workshop full of wood/metal-working tools that i can't use all at once and if i can help someone else out by loaning out a tool or something here &amp; there, i'm all for that - just gotta get it back at the agreed time!\n\n&amp;#x200b;\n\nif i'm allowed to proceed with this, i'll get a few of the neighbors together to get a concensus some some standard rules &amp; how to deal with issues, but i'd like to start with a few thoughts to get things rolling.\n\n&amp;#x200b;\n\ni've -----> come !!!  -----> up !!!  -----> with !!! ;\n\n\\- the goal of this site is to help one another -----> with !!!  projects we're taking on at our homes without incurring unnecesary fees &amp; costs to rent tools that others may be willing loan.\n\n\\- all parties using this website for loaning tools will hold the hoa harmless for any/all incidents (lawyers can figure out what they want in here)\n\n\\- any &amp; all parties entering into agreements through this site are expected to be civil &amp; courteous to one another on this site as well as offline.  \n\n\\- the loanee in all instances shall hold the owner of the tool/equipment harmless from any &amp; all damages or injuries related to the use of said tool\n\n\\- any fees for use, especially on high-value items should be discussed beforehand and paid before use.  the loanee should always offer this upfront.  \n\n\\- any deposits required should be provided up front for high-value items or items to be used for extended periods.\n\n\\- a simple written agreement form will be available for download on this website and should be signed by bother parties, photographed by the loanee and kept by the owner.\n\n\\- both parties of each agreement are highly encouraged to take photos of the equipment before &amp; after use by the loanee.\n\n\\- it is suggested that powered devices should be supplied with fuel/etc for the duration of use to avoid incorrect/bad gas being used.\n\n\\- the \"loanee\" should reimburse the owner for new blades/etc unless agreed prior that this is not necessary unless damages are incurred during use.\n\n&amp;#x200b;\n\nthis isn't necessarily just for tools, this could be for cooking items such as bbq pits, specialty cake pans, etc...  any of the buy &amp; use once/few times.  also thinking about using this for group buys on bbq pellets, fertilizer, etc...\n\n&amp;#x200b;\n\ni know there's all kinds of safety concerns related to doing this, but i feel like most folks can tell if someone shouldn't be using a certain tool and i certainly wouldn't loan out any tool if i'm not comfortable that my neighbor could use safely.\n\n&amp;#x200b;\n\nany thoughts or suggestions on this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/ohxeiw/formal_sharing_of_tools_amongst_neighbors/", "identifyer": 164470, "year": "2021"}, {"Unnamed: 0": 167222, "autor": "theblackvneck", "date": 1628563964000, "content": "Advice for a “Samurai” bamboo-cutting training tool /!/ So, this isn’t EXACTLY home improvement… But, I feel like this community is better equipped to help me come up with creative solutions for this project. \n\nI am building a “Samurai” training tool / game. The basic idea is that we’ve got a polypropylene practice samurai sword… And we want to build something out of PVC pipe to simulate “cutting through bamboo”. \n\nConcept Image: \nhttps://imgur.com/IvtLmBM\n\nI’m thinking that we can build something out of PVC pipe, but I’m not sure how to get around some of these challenges:\n\n• The bamboo can’t fly across the room when cut. It needs to remain attached to the structure. Maybe some kind of hinge or something? Suggestions please.\n• It needs to be easy and quick to “reset”. I was thinking maybe putting magnets in the pipe at break in the “bamboo”? Suggestions please on how to attach magnets securely?\n\nWe plan on spray painting the final result to look like bamboo. All suggestions are welcome!", "link": "https://www.reddit.com/r/HomeImprovement/comments/p1gl11/advice_for_a_samurai_bamboocutting_training_tool/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "advice for a “samurai” bamboo-cutting training tool /!/ so, this isn’t exactly home improvement… but, i feel like this community is better equipped to help me -----> come !!!  -----> up !!!  -----> with !!!  creative solutions for this project. \n\ni am building a “samurai” training tool / game. the basic idea is that we’ve got a polypropylene practice samurai sword… and we want to build something out of pvc pipe to simulate “cutting through bamboo”. \n\nconcept image: \nhttps://imgur.com/ivtlmbm\n\ni’m thinking that we can build something out of pvc pipe, but i’m not sure how to get around some of these challenges:\n\n• the bamboo can’t fly across the room when cut. it needs to remain attached to the structure. maybe some kind of hinge or something? suggestions please.\n• it needs to be easy and quick to “reset”. i was thinking maybe putting magnets in the pipe at break in the “bamboo”? suggestions please on how to attach magnets securely?\n\nwe plan on spray painting the final result to look like bamboo. all suggestions are welcome!", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/p1gl11/advice_for_a_samurai_bamboocutting_training_tool/", "identifyer": 167222, "year": "2021"}, {"Unnamed: 0": 175314, "autor": "TechSupportLarry", "date": 1611870499000, "content": "I have an addiction to buying new tools /!/ I keep coming up with new things to do around the house and I think it's because I want a new tool. Once I get a new tool I get a little too excited about it. Anyone else share in this obsession?", "link": "https://www.reddit.com/r/HomeImprovement/comments/l79xdt/i_have_an_addiction_to_buying_new_tools/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "i have an addiction to buying new tools /!/ i keep -----> coming !!!  -----> up !!!  -----> with !!!  new things to do around the house and i think it's because i want a new tool. once i get a new tool i get a little too excited about it. anyone else share in this obsession?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/l79xdt/i_have_an_addiction_to_buying_new_tools/", "identifyer": 175314, "year": "2021"}, {"Unnamed: 0": 176725, "autor": "hotdangitsme", "date": 1615342740000, "content": "How to make a custom quartz dining table? /!/ I cant seem to find a dining table I like anywhere. I came up with the thought of purchasing a quartz slab from a stone/countertop company, roughly 72\"x 36\" and a premade base, something like https://www.rusticdeco.com/collections/home-bar-lounge/products/retro-farmhouse-chrome-x-style-dining-table-base\n\nI have no experience with stone, but am in the commercial HVAC industry so I have access to welders, tools and some metal fabrication equipment.\n\n* Would I buy a base and directly attach it to the stone? \n* How do you attach the base to stone? \n* Do I use a sub base of some sort of plywood, attach the plywood to the base and glue the slab to the plywood?", "link": "https://www.reddit.com/r/HomeImprovement/comments/m1mwf0/how_to_make_a_custom_quartz_dining_table/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "how to make a custom quartz dining table? /!/ i cant seem to find a dining table i like anywhere. i -----> came !!!  -----> up !!!  -----> with !!!  the thought of purchasing a quartz slab from a stone/countertop company, roughly 72\"x 36\" and a premade base, something like https://www.rusticdeco.com/collections/home-bar-lounge/products/retro-farmhouse-chrome-x-style-dining-table-base\n\ni have no experience -----> with !!!  stone, but am in the commercial hvac industry so i have access to welders, tools and some metal fabrication equipment.\n\n* would i buy a base and directly attach it to the stone? \n* how do you attach the base to stone? \n* do i use a sub base of some sort of plywood, attach the plywood to the base and glue the slab to the plywood?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/m1mwf0/how_to_make_a_custom_quartz_dining_table/", "identifyer": 176725, "year": "2021"}, {"Unnamed: 0": 184610, "autor": "Johnsoir", "date": 1622817894000, "content": "HVLP Paint Gun /!/ I've done a bunch of searching and research and haven't really come up with any direct answers to this quandary. \n\nI'm gearing up to repaint my kitchen cabinets. I've looked into the plug in sprayers and everything up to the Graco X5, which though on the expensive side for a single project appears to be the best airless system for lower usage.\n\nI have a 26 Gallon compressor rated at 4.2CFM @ 90 PSI and 5.2 CFM @ 40 PSI. theses stats seem to indicate that I could support the majority of HVLP guns out there that are at lest semi-efficient. \n\nI'm wondering if anyone out there has utilized a HVLP and compressor for similar projects and what your experience was and if you have any insight into the process.\n\nAny recommendations on guns would also be helpful.", "link": "https://www.reddit.com/r/HomeImprovement/comments/ns6t8m/hvlp_paint_gun/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hvlp paint gun /!/ i've done a bunch of searching and research and haven't really -----> come !!!  -----> up !!!  -----> with !!!  any direct answers to this quandary. \n\ni'm gearing up to repaint my kitchen cabinets. i've looked into the plug in sprayers and everything up to the graco x5, which though on the expensive side for a single project appears to be the best airless system for lower usage.\n\ni have a 26 gallon compressor rated at 4.2cfm @ 90 psi and 5.2 cfm @ 40 psi. theses stats seem to indicate that i could support the majority of hvlp guns out there that are at lest semi-efficient. \n\ni'm wondering if anyone out there has utilized a hvlp and compressor for similar projects and what your experience was and if you have any insight into the process.\n\nany recommendations on guns would also be helpful.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/ns6t8m/hvlp_paint_gun/", "identifyer": 184610, "year": "2021"}, {"Unnamed: 0": 184776, "autor": "Miss_ChanandelerBong", "date": 1623274073000, "content": "Are there any gadgets or tools or sensors to track someone's bathroom habits? /!/ Ok yeah I know this is weird. Let me explain- my granny has severe memory problems and cannot remember using the bathroom, so then she wants to take laxatives that she doesn't actually need. She lives with my parents in her own sort of suite that's on the other end of the house from their bedroom, so they can't monitor 24/7. They've tried calendars but she forgets what day it is and to fill it out. \n\nThe only thing I've come up with is a motion activated camera, which seems like a HUGE invasion of privacy because there are no good angles that won't get set off all the time or record her actually using the toilet. So I'm turning to people who like to come up with ways to improve their homes in hopes that there's something we can use (likely not its original purpose). I'm thinking something across the bathroom doorway that tracks when someone crosses it, or something that counts the number of toilet flushes. \n\nThanks for any suggestions!", "link": "https://www.reddit.com/r/HomeImprovement/comments/nw6uc2/are_there_any_gadgets_or_tools_or_sensors_to/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "are there any gadgets or tools or sensors to track someone's bathroom habits? /!/ ok yeah i know this is weird. let me explain- my granny has severe memory problems and cannot remember using the bathroom, so then she wants to take laxatives that she doesn't actually need. she lives with my parents in her own sort of suite that's on the other end of the house from their bedroom, so they can't monitor 24/7. they've tried calendars but she forgets what day it is and to fill it out. \n\nthe only thing i've -----> come !!!  -----> up !!!  -----> with !!!  is a motion activated camera, which seems like a huge invasion of privacy because there are no good angles that won't get set off all the time or record her actually using the toilet. so i'm turning to people who like to come up with ways to improve their homes in hopes that there's something we can use (likely not its original purpose). i'm thinking something across the bathroom doorway that tracks when someone crosses it, or something that counts the number of toilet flushes. \n\nthanks for any suggestions!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/nw6uc2/are_there_any_gadgets_or_tools_or_sensors_to/", "identifyer": 184776, "year": "2021"}, {"Unnamed: 0": 186751, "autor": "TacoGuitar", "date": 1627329202000, "content": "Small ramp design advice /!/ So I’m looking to build a little ramp to aid in getting a push mower into and out of a shed. No huge weight requirements or anything. Plus it was an opportunity to learn sketchup. \n\nI came up with the following two designs.  Is the first one good enough?  It’ll be simpler to build and as I said, it’s just gotta support me and a push mower.   \n\nAny other suggestions or advice?  \n\nFor what it’s worth, I’m leaning towards the second one anyway, even if overkill, to practice building, but curious what others think as far as design. \n\n[design album](https://imgur.com/a/FB0CRMB/)", "link": "https://www.reddit.com/r/HomeImprovement/comments/os6lji/small_ramp_design_advice/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "small ramp design advice /!/ so i’m looking to build a little ramp to aid in getting a push mower into and out of a shed. no huge weight requirements or anything. plus it was an opportunity to learn sketchup. \n\ni -----> came !!!  -----> up !!!  -----> with !!!  the following two designs.  is the first one good enough?  it’ll be simpler to build and as i said, it’s just gotta support me and a push mower.   \n\nany other suggestions or advice?  \n\nfor what it’s worth, i’m leaning towards the second one anyway, even if overkill, to practice building, but curious what others think as far as design. \n\n[design album](https://imgur.com/a/fb0crmb/)", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/os6lji/small_ramp_design_advice/", "identifyer": 186751, "year": "2021"}, {"Unnamed: 0": 189792, "autor": "chedderchez", "date": 1632099741000, "content": "New kitchen - what do you think of these choices? /!/ I'm purchasing new construction and am using the builder to upgrade the kitchen.  After an upgrade to wood cabinetry, the color choices were white, grey (not light grey), and \"anew grey\" from Sherwin Williams.\n\nI had originally chosen grey because white is so generic, but it's actually somewhat hard to find something that goes well with it and doesn't make the whole room seem monochrome.  Light grey would have been fine, but the grey used is actually somewhat dark.  There's not really hints of blue or brown in it.   [Napoli (hartmark.com)](https://www.hartmark.com/hartmark-Napoli.html)  (it's the \"slate\" color).\n\nMy thought was the included quartz countertops are essentially white (there are some black specs like pencil point marks that I guess make it look slightly off-white).  I wanted a quartz slab backsplash since it would be the easiest to clean.  No grout lines!\n\nI used an online design tool to see about mixing and matching.  Turns out a darkish shade of grey is tough to design.  Do any of these stand out as being nice?  I was trying to stick with white countertops and only change the backsplash since that would allow me to keep the free quartz.  Here's my random designs.\n\n[Backsplash examples - Imgur](https://imgur.com/a/bbF9wwd) \n\n&amp;#x200B;\n\nSwitching to white makes everything look nice.  I just think white is a tad generic and what everyone uses.  For good reason I guess, since it's classic and goes with everything.  I'm either going to upgrade quartz for both the island and the deck and have the island match the backsplash and use a darker quartz for the deck around the sides, or just try to use the free quartz on countertops and just add a quartz backsplash.  Here's what I came up with:\n\n [Imgur: The magic of the Internet](https://imgur.com/a/wdPduOF) \n\n&amp;#x200B;\n\nOther thought was to take a chance on \"Anew Grey\".  Hard to tell from the small sample door I saw, but it might be the solution to not wanting pure white but not wanting darkish grey.  And it'd lend some warmth to the room as well.  Random google search result for the color.  Go to the bottom to see it as a kitchen.\n\n [Anew Gray SW 7030 Review by Laura Rugh | Rugh Design](https://www.rughdesign.com/2018/06/21/anew-gray-review/) \n\n&amp;#x200B;\n\nThanks for any suggestions you may have!", "link": "https://www.reddit.com/r/HomeImprovement/comments/prkgyj/new_kitchen_what_do_you_think_of_these_choices/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "new kitchen - what do you think of these choices? /!/ i'm purchasing new construction and am using the builder to upgrade the kitchen.  after an upgrade to wood cabinetry, the color choices were white, grey (not light grey), and \"anew grey\" from sherwin williams.\n\ni had originally chosen grey because white is so generic, but it's actually somewhat hard to find something that goes well with it and doesn't make the whole room seem monochrome.  light grey would have been fine, but the grey used is actually somewhat dark.  there's not really hints of blue or brown in it.   [napoli (hartmark.com)](https://www.hartmark.com/hartmark-napoli.html)  (it's the \"slate\" color).\n\nmy thought was the included quartz countertops are essentially white (there are some black specs like pencil point marks that i guess make it look slightly off-white).  i wanted a quartz slab backsplash since it would be the easiest to clean.  no grout lines!\n\ni used an online design tool to see about mixing and matching.  turns out a darkish shade of grey is tough to design.  do any of these stand out as being nice?  i was trying to stick with white countertops and only change the backsplash since that would allow me to keep the free quartz.  here's my random designs.\n\n[backsplash examples - imgur](https://imgur.com/a/bbf9wwd) \n\n&amp;#x200b;\n\nswitching to white makes everything look nice.  i just think white is a tad generic and what everyone uses.  for good reason i guess, since it's classic and goes with everything.  i'm either going to upgrade quartz for both the island and the deck and have the island match the backsplash and use a darker quartz for the deck around the sides, or just try to use the free quartz on countertops and just add a quartz backsplash.  here's what i -----> came !!!  -----> up !!!  -----> with !!! :\n\n [imgur: the magic of the internet](https://imgur.com/a/wdpduof) \n\n&amp;#x200b;\n\nother thought was to take a chance on \"anew grey\".  hard to tell from the small sample door i saw, but it might be the solution to not wanting pure white but not wanting darkish grey.  and it'd lend some warmth to the room as well.  random google search result for the color.  go to the bottom to see it as a kitchen.\n\n [anew gray sw 7030 review by laura rugh | rugh design](https://www.rughdesign.com/2018/06/21/anew-gray-review/) \n\n&amp;#x200b;\n\nthanks for any suggestions you may have!", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/prkgyj/new_kitchen_what_do_you_think_of_these_choices/", "identifyer": 189792, "year": "2021"}, {"Unnamed: 0": 190240, "autor": "Space8lues", "date": 1631559328000, "content": "A bit of cabinet, door, and drawer painting advice needed please. /!/ I’ve done my fair share of painting in my life but just walls and trim. Our bathrooms and kitchen need to be repainted and I’m not sure how to go about it. I have experience with Sherwin Williams Emerald when doing trim and it doesn’t seem to leave brush strokes when I’ve used it. Will that be okay? I don’t have a sprayer or experience using one. \n\nNot sure how to tackle painting 20 doors or however many there are. I have a couple sawhorses I can sit a few on but what does everyone else do? Save up Amazon boxes I suppose is all I can come up with. \n\nAny help would be greatly appreciated!", "link": "https://www.reddit.com/r/HomeImprovement/comments/pnlut3/a_bit_of_cabinet_door_and_drawer_painting_advice/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "a bit of cabinet, door, and drawer painting advice needed please. /!/ i’ve done my fair share of painting in my life but just walls and trim. our bathrooms and kitchen need to be repainted and i’m not sure how to go about it. i have experience with sherwin williams emerald when doing trim and it doesn’t seem to leave brush strokes when i’ve used it. will that be okay? i don’t have a sprayer or experience using one. \n\nnot sure how to tackle painting 20 doors or however many there are. i have a couple sawhorses i can sit a few on but what does everyone else do? save -----> up !!!  amazon boxes i suppose is all i can -----> come !!!  -----> up !!!  -----> with !!! . \n\nany help would be greatly appreciated!", "sortedWord": "None", "removed": null, "score": 2, "comments": 15, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/pnlut3/a_bit_of_cabinet_door_and_drawer_painting_advice/", "identifyer": 190240, "year": "2021"}, {"Unnamed: 0": 193192, "autor": "thebadger87", "date": 1609612460000, "content": "What to do with these open basement stairs? /!/ Hello /r/homeimprovement,  \n\n\nI've got this set of open-sided basement stairs ([pic 1](https://i.imgur.com/5emSpzg.jpg)) ([pic 2](https://i.imgur.com/GpEKCpU.jpg))and I'm wondering if anyone has any advice for how to enclose/child-proof them without necessarily hiring out the work to a contractor.  I'm decently handy and have most of the tools I'd need (I think), just wondering logistically what would work best in this space.  Previous owner had left the treads bare (painted wood) and had set up a cheesy railing with glued-in ballusters that allowed it to meet code, but when we got them carpeted we opted to rip the old railing out and re-do it properly.  \n\n\nMy wife wants something like [this](https://cdn.homedit.com/wp-content/uploads/2015/11/Wood-staircase-divider.jpg), which looks good, but I think I'd have to chop off the ends of the steps to make it work?  Maybe something like [this](https://cdn.homedit.com/wp-content/uploads/2015/11/Storage-and-staircase-wall-design.jpg) would allow me to keep from cutting into the overhang on each step?  I think we'll run the handrail down the full wall on the right as you go up, so we just need to come up with a code-compliant balluster system for the open side so our kid doesn't get past the gate at the top and fall 6+ feet off the stairs.\n\nAny ideas, reddit?  Or is this a specialized enough job that I'll need to wait out the local contractor backlog to get it done by a pro?", "link": "https://www.reddit.com/r/HomeImprovement/comments/kp2s4g/what_to_do_with_these_open_basement_stairs/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what to do with these open basement stairs? /!/ hello /r/homeimprovement,  \n\n\ni've got this set of open-sided basement stairs ([pic 1](https://i.imgur.com/5emspzg.jpg)) ([pic 2](https://i.imgur.com/gpekcpu.jpg))and i'm wondering if anyone has any advice for how to enclose/child-proof them without necessarily hiring out the work to a contractor.  i'm decently handy and have most of the tools i'd need (i think), just wondering logistically what would work best in this space.  previous owner had left the treads bare (painted wood) and had set up a cheesy railing with glued-in ballusters that allowed it to meet code, but when we got them carpeted we opted to rip the old railing out and re-do it properly.  \n\n\nmy wife wants something like [this](https://cdn.homedit.com/wp-content/uploads/2015/11/wood-staircase-divider.jpg), which looks good, but i think i'd have to chop off the ends of the steps to make it work?  maybe something like [this](https://cdn.homedit.com/wp-content/uploads/2015/11/storage-and-staircase-wall-design.jpg) would allow me to keep from cutting into the overhang on each step?  i think we'll run the handrail down the full wall on the right as you go -----> up !!! , so we just need to -----> come !!!  -----> up !!!  -----> with !!!  a code-compliant balluster system for the open side so our kid doesn't get past the gate at the top and fall 6+ feet off the stairs.\n\nany ideas, reddit?  or is this a specialized enough job that i'll need to wait out the local contractor backlog to get it done by a pro?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/kp2s4g/what_to_do_with_these_open_basement_stairs/", "identifyer": 193192, "year": "2021"}, {"Unnamed: 0": 194083, "autor": "zendawg", "date": 1633568913000, "content": "Assistance identifying a shower valve. /!/ \nNoticed that there is a slow drip coming from the faucet of the shower. It is coming from the cold side. I need assistance in ID'ing the valve. I went through the Danco site and tried there online tool but the valve stem I have is threaded and the escutcheon threads over it. I've tried every query that I can come up with \n\nI thought that this could be the right one but the item description is lacking a lot of important information like the number of splines on the stem.  https://www.faucetshark.com/Crane-2-Handle-Shower-Rebuild-Kit-CR102KIT-p/fshark-cr102kit.htm\n\nI don't want to have to replace the faucet at this time and it will be getting gutted and renovated in the spring.\n\nThought about taking it out and going to a local supply house but it is an hr + round trip and I cannot leave the water off for that long. Any advice is greatly appreciated. \n\n\n\npics of the valve. \nhttps://imgur.com/qEOhNtH\nhttps://imgur.com/Ujzybo3\nhttps://imgur.com/BofWTA4\nhttps://imgur.com/vRqOvrx", "link": "https://www.reddit.com/r/HomeImprovement/comments/q2xzv8/assistance_identifying_a_shower_valve/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "assistance identifying a shower valve. /!/ \nnoticed that there is a slow drip coming from the faucet of the shower. it is coming from the cold side. i need assistance in id'ing the valve. i went through the danco site and tried there online tool but the valve stem i have is threaded and the escutcheon threads over it. i've tried every query that i can -----> come !!!  -----> up !!!  -----> with !!!  \n\ni thought that this could be the right one but the item description is lacking a lot of important information like the number of splines on the stem.  https://www.faucetshark.com/crane-2-handle-shower-rebuild-kit-cr102kit-p/fshark-cr102kit.htm\n\ni don't want to have to replace the faucet at this time and it will be getting gutted and renovated in the spring.\n\nthought about taking it out and going to a local supply house but it is an hr + round trip and i cannot leave the water off for that long. any advice is greatly appreciated. \n\n\n\npics of the valve. \nhttps://imgur.com/qeohnth\nhttps://imgur.com/ujzybo3\nhttps://imgur.com/bofwta4\nhttps://imgur.com/vrqovrx", "sortedWord": "None", "removed": null, "score": 2, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/q2xzv8/assistance_identifying_a_shower_valve/", "identifyer": 194083, "year": "2021"}, {"Unnamed: 0": 202824, "autor": "Expensive_Scheme_734", "date": 1625565488000, "content": "How to grind out inside of pvc pipe outside? /!/ Bought a house.  The sump pump has 1.5\" pvc pipe out to the storm sewer I think.  (Why didn't they just use 3 or 4\" pcv pipe???)  It fills up quickly with water so it doesn't really function well.  I believe that water does seep through.  I stuck a simple sink gunk cleaner in (thick, metal roll that goes in with a Christmas tree spring on the end).  That came up with some green stuff, so I think there is vegetation growing in the pvc pipe.\n\nHow can I remove the blockage in the pvc pipe?  It's 1.5\".  It's sticking up six inches out of the ground.  It's got paved stones all around it. I'm not planning on removing or replacing it if I don't have to.  Yes, I could dig it out and put in 4\" pvc pipe, but if it can work, I'll just keep it as it is.  \n\nIs there another tool I can stick in the pvc pipe that won't damage the pipe but can grind out some vegetation in there?  Or a chemical I can dump in to eat away at the blockage?", "link": "https://www.reddit.com/r/HomeImprovement/comments/oeruq6/how_to_grind_out_inside_of_pvc_pipe_outside/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "how to grind out inside of pvc pipe outside? /!/ bought a house.  the sump pump has 1.5\" pvc pipe out to the storm sewer i think.  (why didn't they just use 3 or 4\" pcv pipe???)  it fills up quickly with water so it doesn't really function well.  i believe that water does seep through.  i stuck a simple sink gunk cleaner in (thick, metal roll that goes in with a christmas tree spring on the end).  that -----> came !!!  -----> up !!!  -----> with !!!  some green stuff, so i think there is vegetation growing in the pvc pipe.\n\nhow can i remove the blockage in the pvc pipe?  it's 1.5\".  it's sticking up six inches out of the ground.  it's got paved stones all around it. i'm not planning on removing or replacing it if i don't have to.  yes, i could dig it out and put in 4\" pvc pipe, but if it can work, i'll just keep it as it is.  \n\nis there another tool i can stick in the pvc pipe that won't damage the pipe but can grind out some vegetation in there?  or a chemical i can dump in to eat away at the blockage?", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/oeruq6/how_to_grind_out_inside_of_pvc_pipe_outside/", "identifyer": 202824, "year": "2021"}, {"Unnamed: 0": 204517, "autor": "jrteeter", "date": 1625859023000, "content": "Shallow Well Problems /!/ I spent the first couple weeks of summer drilling for a shallow well that I plan on connecting to an antique pitcher pump.  I thought it would be an easy task as we are in walking distance to a major river and our neighbors all have trouble keeping water out of their basements.  \n\n\nThe methods I was using ultimately didn't work as we have too much shale in the ground.  I was able to hand dig about 8ft down, but no matter what I do I am still running into densely packed rock.  I contacted professional drilling companies and the starting price for them to drill is about $3,000.  So that's out of the question.  \n\n\nNow I am thinking of installing a sump basin or drywell basin in the hole that I dug and running the piping for the pitcher pump into it.  So I think I'm closer to my goal, but there are still some outstanding problems.  \n\n\n\\-Whatever basin  I use needs to hold about 50 gallons, be one piece, have a bottom and a top and be able to connect to a drainage pipe.  I've been looking through all the home improvement sites for something like this and am coming up with nothing that meets my specs.  Any suggestions?", "link": "https://www.reddit.com/r/HomeImprovement/comments/oh2tfn/shallow_well_problems/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "shallow well problems /!/ i spent the first couple weeks of summer drilling for a shallow well that i plan on connecting to an antique pitcher pump.  i thought it would be an easy task as we are in walking distance to a major river and our neighbors all have trouble keeping water out of their basements.  \n\n\nthe methods i was using ultimately didn't work as we have too much shale in the ground.  i was able to hand dig about 8ft down, but no matter what i do i am still running into densely packed rock.  i contacted professional drilling companies and the starting price for them to drill is about $3,000.  so that's out of the question.  \n\n\nnow i am thinking of installing a sump basin or drywell basin in the hole that i dug and running the piping for the pitcher pump into it.  so i think i'm closer to my goal, but there are still some outstanding problems.  \n\n\n\\-whatever basin  i use needs to hold about 50 gallons, be one piece, have a bottom and a top and be able to connect to a drainage pipe.  i've been looking through all the home improvement sites for something like this and am -----> coming !!!  -----> up !!!  -----> with !!!  nothing that meets my specs.  any suggestions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/oh2tfn/shallow_well_problems/", "identifyer": 204517, "year": "2021"}], "name": "withHomeImprovement2021"}