{"interestingcomments": [{"Unnamed: 0": 156466, "autor": "NikeFlex", "date": 1614784082000, "content": "New construction home sitting on bare lot, where to start with having a yard? Advice? /!/ I've been reading articles on landscaping and watching a ton of videos on it. I also had a few landscapers come out and give me quotes to get an idea how much it would cost for their labor. My total yard space is around 3,000 square feet, excluding what the house is sitting on. \n\nWhile I will probably contract out the sprinkler system (step 2), I'd like to do the topsoil raking (step 1), grass sodding (step 3), and mulching/flowerbedding (step 4) myself. \n\nI've read posts here and I know a lot of you have done it yourselves. I will need a landscape rake (for spreading/mixing topsoil), a 6-cu-ft wheelbarrow, at least one shovel, landscape stakes and string, and plastic edging for between the grass and mulch. \n\nI don't have any equipment or tools as this is my first home. Costco, Lowes, Home Depot, Menards - which is the best to start on this?", "link": "https://www.reddit.com/r/HomeImprovement/comments/lww10s/new_construction_home_sitting_on_bare_lot_where/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "done it yourselves", "selectorShort": "yourself", "MarkedSent": "new construction home sitting on bare lot, where to start with having a yard? advice? /!/ i've been reading articles on landscaping and watching a ton of videos on it. i also had a few landscapers come out and give me quotes to get an idea how much it would cost for their labor. my total yard space is around 3,000 square feet, excluding what the house is sitting on. \n\nwhile i will probably contract out the sprinkler system (step 2), i'd like to do the topsoil raking (step 1), grass sodding (step 3), and mulching/flowerbedding (step 4) myself. \n\ni've read posts here and i know a lot of you have -----> done !!!  -----> it !!!  -----> yourselves !!! . i will need a landscape rake (for spreading/mixing topsoil), a 6-cu-ft wheelbarrow, at least one shovel, landscape stakes and string, and plastic edging for between the grass and mulch. \n\ni don't have any equipment or tools as this is my first home. costco, lowes, home depot, menards - which is the best to start on this?", "sortedWord": "None", "removed": null, "score": 3, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/lww10s/new_construction_home_sitting_on_bare_lot_where/", "identifyer": 156466, "year": "2021"}, {"Unnamed: 0": 179562, "autor": "notwhoyouthinkmaybe", "date": 1618680382000, "content": "There is no good option other than doing it yourself /!/ Usually I did things myself, but I bought a new house a few years ago and had contractor do a lot of renovations (big mistake).\n\nFlash forward to now, I have some extra cash and another child, so I decided to hire a carpenter to make some built-ins and upgrade 2 little closets, this is my tale:\n\nThe built-ins were simple shelves on either side of the fireplace (4'x4'x1' each), the closets were about 4'x4' and 5'x7'; just wanted something slightly better than wire shelves. I or a contractor would do all the walls and room prep, literally just make the shelves and install. \n\nThe quote?\n$25k, that's right $25,000.00 USD\n\nMy kitchen, with appliances, quartz countertops, removing a wall, electrical, plumbing, etc. was barely more than that.\n\nNow back to the contractor, he fucked up everything he touched, I've been slowly fixing everything, but what I learned a week ago was that he didn't fill a single hole he made in the house.  I found holes that I could fit my fist in with ease when I was in the crawl space. Exterminators only leave traps for the rodents that found those holes. \n\nThe morale of the story, just do these things yourself. \n\nI have priced out the lumber for the closets and the built-ins and that will be a couple of hundred dollars (even with the huge increase in lumber prices); even if I had to buy the needed tools, I could probably do everything for under $5k (that's some really nice tools and over buying supplies).\n\n$100 in expanding foam and traps, and all the holes are filled and the rats are gone.", "link": "https://www.reddit.com/r/HomeImprovement/comments/msuyxs/there_is_no_good_option_other_than_doing_it/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "there is no good option other than -----> doing !!!  -----> it !!!  -----> yourself !!!  /!/ usually i did things myself, but i bought a new house a few years ago and had contractor do a lot of renovations (big mistake).\n\nflash forward to now, i have some extra cash and another child, so i decided to hire a carpenter to make some built-ins and upgrade 2 little closets, this is my tale:\n\nthe built-ins were simple shelves on either side of the fireplace (4'x4'x1' each), the closets were about 4'x4' and 5'x7'; just wanted something slightly better than wire shelves. i or a contractor would do all the walls and room prep, literally just make the shelves and install. \n\nthe quote?\n$25k, that's right $25,000.00 usd\n\nmy kitchen, with appliances, quartz countertops, removing a wall, electrical, plumbing, etc. was barely more than that.\n\nnow back to the contractor, he fucked up everything he touched, i've been slowly fixing everything, but what i learned a week ago was that he didn't fill a single hole he made in the house.  i found holes that i could fit my fist in with ease when i was in the crawl space. exterminators only leave traps for the rodents that found those holes. \n\nthe morale of the story, just do these things yourself. \n\ni have priced out the lumber for the closets and the built-ins and that will be a couple of hundred dollars (even with the huge increase in lumber prices); even if i had to buy the needed tools, i could probably do everything for under $5k (that's some really nice tools and over buying supplies).\n\n$100 in expanding foam and traps, and all the holes are filled and the rats are gone.", "sortedWord": "None", "removed": null, "score": 1, "comments": 34, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/msuyxs/there_is_no_good_option_other_than_doing_it/", "identifyer": 179562, "year": "2021"}, {"Unnamed: 0": 179758, "autor": "praxiq", "date": 1620418897000, "content": "Is there any company that sells custom cut plywood or MDF in the US? /!/ I've been searching for a couple of hours for a website where I can get materials custom cut to size, and there seem to be a dozen UK-based websites where you can choose a plywood, MDF, etc. material, type in your dimensions, and they'll cut it and ship it to you - fast and easy. For some reason I can't find any US equivalent.\n\nHome Depot has a cutting service, but they don't promise accuracy - it's just meant to roughly cut boards to fit in your vehicle, with the assumption that more precise cutting will be done yourself.\n\nI just want a few boards (ideally melamine-faced MDF, but I'll take what I can get) that I can use as shelves with custom dimensions inside a cabinet. (My home is small enough that it doesn't make sense for me to own a circular saw and do my own cutting - I don't really have an appropriate space for that sort of thing.)\n\nThe closest I've found is ponoko.com, the laser cutting company, but their maximum dimensions are too small for what I'm looking to cut (about 17x22\")\n\nWhat's the best way to get a few boards cut to a custom size, if you don't have the tools to do it yourself?", "link": "https://www.reddit.com/r/HomeImprovement/comments/n77zdp/is_there_any_company_that_sells_custom_cut/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "is there any company that sells custom cut plywood or mdf in the us? /!/ i've been searching for a couple of hours for a website where i can get materials custom cut to size, and there seem to be a dozen uk-based websites where you can choose a plywood, mdf, etc. material, type in your dimensions, and they'll cut it and ship it to you - fast and easy. for some reason i can't find any us equivalent.\n\nhome depot has a cutting service, but they don't promise accuracy - it's just meant to roughly cut boards to fit in your vehicle, with the assumption that more precise cutting will be done yourself.\n\ni just want a few boards (ideally melamine-faced mdf, but i'll take what i can get) that i can use as shelves with custom dimensions inside a cabinet. (my home is small enough that it doesn't make sense for me to own a circular saw and do my own cutting - i don't really have an appropriate space for that sort of thing.)\n\nthe closest i've found is ponoko.com, the laser cutting company, but their maximum dimensions are too small for what i'm looking to cut (about 17x22\")\n\nwhat's the best way to get a few boards cut to a custom size, if you -----> do !!! n't have the tools to -----> do !!!  -----> it !!!  -----> yourself !!! ?", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/n77zdp/is_there_any_company_that_sells_custom_cut/", "identifyer": 179758, "year": "2021"}], "name": "yourselfHomeImprovement2021"}