{"interestingcomments": [{"Unnamed: 0": 310757, "autor": "hwy4", "date": 1588525009000, "content": "Creating low maintenance privacy /!/ Hi! I bought my first home in Oakland, CA at the beginning of March; I’ve only ever lived in apartments, so I don’t really know where to start with landscaping and yard maintenance. I would love to do plant some shrubs or trees (or other plants) to help make my backyard feel more private. The backyard gets lots of sun. The fence that’s...missing...is a result of my neighbors halted construction, but will go back up eventually. \n\nI don’t play boules, so that sand strip to the side can definitely go. \n\nI’d love some suggestions on plants and/or books/videos I could watch to start making my backyard more private. I’m not experienced with plants, so am hoping to create something low maintenance. And! I have a mower arriving on Monday so I can take care of that grass. \n\n[photos of the backyard](https://imgur.com/gallery/35r1AnF)", "link": "https://www.reddit.com/r/landscaping/comments/gctxhm/creating_low_maintenance_privacy/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  low maintenance privacy /!/ hi! i bought my first home in oakland, ca at the beginning of march; i’ve only ever lived in apartments, so i don’t really know where to start with landscaping and yard maintenance. i would love to do plant some shrubs or trees (or other plants) to help make my backyard feel more private. the backyard gets lots of sun. the fence that’s...missing...is a result of my neighbors halted construction, but will go back up eventually. \n\ni don’t play boules, so that sand strip to the side can definitely go. \n\ni’d love some suggestions on plants and/or books/videos i could watch to start making my backyard more private. i’m not experienced with plants, so am hoping to create something low maintenance. and! i have a mower arriving on monday so i can take care of that grass. \n\n[photos of the backyard](https://imgur.com/gallery/35r1anf)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/landscaping/comments/gctxhm/creating_low_maintenance_privacy/", "identifyer": 310757, "year": "2020"}], "name": "createlandscaping2020"}