{"interestingcomments": [{"Unnamed: 0": 308571, "autor": "egamble", "date": 1590274655000, "content": "DIY Backyard Landscaping /!/ Finally finished my landscaping project, pretty happy with how it turned out.\n\nI posted before I started and didn't get a lot of traction, but figured I'd give an update.\n\nPrep took a lot longer than I thought. I had to have 2 5-yard bins brought in to get all the excess dirt and other debris and took about a week and a half. But that was between minding my toddler and working full time at my job so it was slow going for sure.\n\nAfter that prepping the fresh triple mix and laying the sod was quick, I did the prep in the afternoon and finished up the sod that evening after work.\n\nTotal Cost:\n\nRemoval: 8 cu/yard dirt, 2 cu/yard other crap $850 (OUCH)\n\nTriple Mix: 2 cu/yard - $120\n\nSod: half palette - $200\n\nTamper: $50\n\nPressure Washer: $90\n\nTotal: $1310 (CAD)\n\nTools already owned: Wheelbarrow, shovels, work gloves, bow rake.\n\nWe had a landscaper do the front and he estimated 4-5k to do the back yard which we put off till now. It was a lot of work, but we are happy with the results and look forward to our son(s) having a safe place to play in the back. The previous dirt pile had about 100 years of crap buried back there (bricks, glass, tiles, 3 cats and 1 dog). Now we are on the watering train 3-4 times a day.", "link": "https://www.reddit.com/r/landscaping/comments/gpej2l/diy_backyard_landscaping/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  backyard landscaping /!/ finally finished my landscaping project, pretty happy with how it turned out.\n\ni posted before i started and didn't get a lot of traction, but figured i'd give an update.\n\nprep took a lot longer than i thought. i had to have 2 5-yard bins brought in to get all the excess dirt and other debris and took about a week and a half. but that was between minding my toddler and working full time at my job so it was slow going for sure.\n\nafter that prepping the fresh triple mix and laying the sod was quick, i did the prep in the afternoon and finished up the sod that evening after work.\n\ntotal cost:\n\nremoval: 8 cu/yard dirt, 2 cu/yard other crap $850 (ouch)\n\ntriple mix: 2 cu/yard - $120\n\nsod: half palette - $200\n\ntamper: $50\n\npressure washer: $90\n\ntotal: $1310 (cad)\n\ntools already owned: wheelbarrow, shovels, work gloves, bow rake.\n\nwe had a landscaper do the front and he estimated 4-5k to do the back yard which we put off till now. it was a lot of work, but we are happy with the results and look forward to our son(s) having a safe place to play in the back. the previous dirt pile had about 100 years of crap buried back there (bricks, glass, tiles, 3 cats and 1 dog). now we are on the watering train 3-4 times a day.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/gpej2l/diy_backyard_landscaping/", "identifyer": 308571, "year": "2020"}, {"Unnamed: 0": 308850, "autor": "XIII_Chapters", "date": 1605809416000, "content": "Are these the proper steps for grading land against my foundation? /!/ I've been reading here and watching YouTube videos to see what it would take to DIY grading against my home. Not every source is consistent so I wanted to check if I have these steps down correctly. Would this be the proper way to grade the yard?\n\n1. Land should slope down 1in every 4 feet away from the home. Place grading stakes and connect with string to determine what the slope needs to be.\n\n2. Bring in top soil. I can remove the sod first or not. Doesn't matter. Use a tool to compact the top soil and fill in up to the string from step 1.\n\n3. Plant grass seed or sod on top of soil. Either works.\n\nIs that pretty much it or is there more to consider? Currently, we don't have any basement water issues. I'm just being proactive as some areas of lawn near the home are not properly graded. Some sources claimed my slope from my house to the edge of the yard should be 1in per foot my basement is below ground. Is that more correct than 1in per 4 feet? I also found sources where they put gravel against the home and then put soil on top. Is that necessary?", "link": "https://www.reddit.com/r/landscaping/comments/jx7ud3/are_these_the_proper_steps_for_grading_land/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "are these the proper steps for grading land against my foundation? /!/ i've been reading here and watching youtube videos to see what it would take to -----> diy !!!  grading against my home. not every source is consistent so i wanted to check if i have these steps down correctly. would this be the proper way to grade the yard?\n\n1. land should slope down 1in every 4 feet away from the home. place grading stakes and connect with string to determine what the slope needs to be.\n\n2. bring in top soil. i can remove the sod first or not. doesn't matter. use a tool to compact the top soil and fill in up to the string from step 1.\n\n3. plant grass seed or sod on top of soil. either works.\n\nis that pretty much it or is there more to consider? currently, we don't have any basement water issues. i'm just being proactive as some areas of lawn near the home are not properly graded. some sources claimed my slope from my house to the edge of the yard should be 1in per foot my basement is below ground. is that more correct than 1in per 4 feet? i also found sources where they put gravel against the home and then put soil on top. is that necessary?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/jx7ud3/are_these_the_proper_steps_for_grading_land/", "identifyer": 308850, "year": "2020"}, {"Unnamed: 0": 308856, "autor": "testedhq", "date": 1605771171000, "content": "Doing Stone in Garden Beds and Product Testing Opportunity /!/ Hey guys,\n\nI am newer to Reddit and to this page.  We recently bought a house and are currently in the process of renovating just about all of it.  The front of the house has fairly large garden beds that were covered in pine straw, a very large holly bush, and a Crape Myrtle that has started growing against the house.  We originally tried to take up all the pine straw and put mulch down, but now we are looking to do all river stone.  I can attach some pictures later.  I have a few questions. what kind of preparation is required for river stone (how deep to dig, weed barrier, border, etc.)?  And is there any other stone or anything else in general that we should prepare for?\n\nAlso I wanted to mentioned an opportunity to you guys as well.  I own a company called TestedHQ.  We do consumer product testing and research for consumer product companies.  We work with companies who make a variety of things including shovels, rakes, lawn equipment, gas lawn equipment, cordless lawn equipment, yard games (think cornhole, Kan Jam, etc.), power tools, and even grilling equipment.  We have some opportunities coming up from both Pro and DIY companies and we are looking for more testers.  You will receive the products completely free of charge. All we ask is that you give HONEST feedback through occasional surveys about the performance of the products you are testing, and you get to keep the products as well! We provide honest feedback from actual users to help companies develop better products. If you are interested, you can click the link below. It will take you to our website, just click the \"Become a Tester\" button to get started.\n\n[https://www.testedhq.com/](https://www.testedhq.com/)\n\nIf you have any questions about my garden bed situation (could really use some guidance here) or TestedHQ, I will be happy to answer them! I could really use the help.", "link": "https://www.reddit.com/r/landscaping/comments/jwyg1g/doing_stone_in_garden_beds_and_product_testing/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "doing stone in garden beds and product testing opportunity /!/ hey guys,\n\ni am newer to reddit and to this page.  we recently bought a house and are currently in the process of renovating just about all of it.  the front of the house has fairly large garden beds that were covered in pine straw, a very large holly bush, and a crape myrtle that has started growing against the house.  we originally tried to take up all the pine straw and put mulch down, but now we are looking to do all river stone.  i can attach some pictures later.  i have a few questions. what kind of preparation is required for river stone (how deep to dig, weed barrier, border, etc.)?  and is there any other stone or anything else in general that we should prepare for?\n\nalso i wanted to mentioned an opportunity to you guys as well.  i own a company called testedhq.  we do consumer product testing and research for consumer product companies.  we work with companies who make a variety of things including shovels, rakes, lawn equipment, gas lawn equipment, cordless lawn equipment, yard games (think cornhole, kan jam, etc.), power tools, and even grilling equipment.  we have some opportunities coming up from both pro and -----> diy !!!  companies and we are looking for more testers.  you will receive the products completely free of charge. all we ask is that you give honest feedback through occasional surveys about the performance of the products you are testing, and you get to keep the products as well! we provide honest feedback from actual users to help companies develop better products. if you are interested, you can click the link below. it will take you to our website, just click the \"become a tester\" button to get started.\n\n[https://www.testedhq.com/](https://www.testedhq.com/)\n\nif you have any questions about my garden bed situation (could really use some guidance here) or testedhq, i will be happy to answer them! i could really use the help.", "sortedWord": "None", "removed": null, "score": 0, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/landscaping/comments/jwyg1g/doing_stone_in_garden_beds_and_product_testing/", "identifyer": 308856, "year": "2020"}, {"Unnamed: 0": 309308, "autor": "LittleBirdie14", "date": 1593527579000, "content": "We are DIY landscaping with the tools we have available... Including a Jeep and an old pallet!", "link": "https://www.reddit.com/r/landscaping/comments/hioglo/we_are_diy_landscaping_with_the_tools_we_have/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "we are -----> diy !!!  landscaping with the tools we have available... including a jeep and an old pallet!", "sortedWord": "None", "removed": null, "score": 0, "comments": 0, "media": "rich:video", "medialink": "https://youtu.be/jyiUHEowtlA", "identifyer": 309308, "year": "2020"}, {"Unnamed: 0": 309355, "autor": "cadet311", "date": 1593438565000, "content": "Root removal - rip and tear? /!/ Hello everyone.  I’m a novice DIY guy that’s trying to pull out some plants that have overgrown. The roots have essentially formed an 3-4” layer of impenetrable root and dirt spaghetti that I could probably sell as a Kevlar alternative.  I’ve been able to get some out with a shovel but man is it a pain in the ass. Lots of work for little reward. \n\nMy question to you all is are there better tools for accomplishing this?  I’ve been using a shovel. A machine isn’t exactly an option.  Is there a tool or approach that might suit me better?", "link": "https://www.reddit.com/r/landscaping/comments/hi06d1/root_removal_rip_and_tear/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "root removal - rip and tear? /!/ hello everyone.  i’m a novice -----> diy !!!  guy that’s trying to pull out some plants that have overgrown. the roots have essentially formed an 3-4” layer of impenetrable root and dirt spaghetti that i could probably sell as a kevlar alternative.  i’ve been able to get some out with a shovel but man is it a pain in the ass. lots of work for little reward. \n\nmy question to you all is are there better tools for accomplishing this?  i’ve been using a shovel. a machine isn’t exactly an option.  is there a tool or approach that might suit me better?", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/hi06d1/root_removal_rip_and_tear/", "identifyer": 309355, "year": "2020"}, {"Unnamed: 0": 309580, "autor": "m223856", "date": 1602197146000, "content": "Uneven Lawn /!/ We recently bought a house, and the backyard was full of large planter boxes. We’ve removed most of them, but our issue is that they put a large amount of small rocks (I’m assuming for drainage) below them. This has left us with a rocky backyard. In addition, the backyard is quite uneven- due to the rocks, planter box removal, and just the layout. We want a more flat, grassy backyard so our kids can play. Can we add some fill dirt to level and then plant grass over it, or should we rent some kind of tool  to filter out all of the rocks and then rake the soil even? We tried a large tiller, but the soil hardness mixed with the amount of rocks didn’t accomplish much. We are trying to DIY as much as possible. Thanks in advance!", "link": "https://www.reddit.com/r/landscaping/comments/j7nbco/uneven_lawn/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "uneven lawn /!/ we recently bought a house, and the backyard was full of large planter boxes. we’ve removed most of them, but our issue is that they put a large amount of small rocks (i’m assuming for drainage) below them. this has left us with a rocky backyard. in addition, the backyard is quite uneven- due to the rocks, planter box removal, and just the layout. we want a more flat, grassy backyard so our kids can play. can we add some fill dirt to level and then plant grass over it, or should we rent some kind of tool  to filter out all of the rocks and then rake the soil even? we tried a large tiller, but the soil hardness mixed with the amount of rocks didn’t accomplish much. we are trying to -----> diy !!!  as much as possible. thanks in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/j7nbco/uneven_lawn/", "identifyer": 309580, "year": "2020"}, {"Unnamed: 0": 310693, "autor": "TheSettledNomad", "date": 1588607406000, "content": "Pro and DIY landscapers, please help me understand what tools I need to keep the English ivy in check.", "link": "https://www.reddit.com/r/landscaping/comments/gde0xz/pro_and_diy_landscapers_please_help_me_understand/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "pro and -----> diy !!!  landscapers, please help me understand what tools i need to keep the english ivy in check.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": "link", "medialink": "http://imgur.com/gallery/3ArOb8V", "identifyer": 310693, "year": "2020"}, {"Unnamed: 0": 312487, "autor": "bossbausbaws", "date": 1607199927000, "content": "First Time DIY Root Removal Help /!/ Sorry for the beginnger question but I'm looking for advice and approaches on how to remove this root system.  Can rely on the standard tools or is there an \"I'm not asking\" tool/device to better conquer this.  Any help would be awesome!", "link": "https://www.reddit.com/r/landscaping/comments/k7f17q/first_time_diy_root_removal_help/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "first time -----> diy !!!  root removal help /!/ sorry for the beginnger question but i'm looking for advice and approaches on how to remove this root system.  can rely on the standard tools or is there an \"i'm not asking\" tool/device to better conquer this.  any help would be awesome!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/k7f17q/first_time_diy_root_removal_help/", "identifyer": 312487, "year": "2020"}, {"Unnamed: 0": 312488, "autor": "bossbausbaws", "date": 1607199107000, "content": "First Time DIY Root Removal Help /!/ Sorry for the beginner question... Digging up the roots of what I've been told might be a large tree-like weed.  Regardless, I'm looking for advice and approaches on how to get these out.  Do I use the standard tools or is there an \"I'm not asking\" tool to help churn the root system.  Any advice would be awesome!", "link": "https://www.reddit.com/r/landscaping/comments/k7eryc/first_time_diy_root_removal_help/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "first time -----> diy !!!  root removal help /!/ sorry for the beginner question... digging up the roots of what i've been told might be a large tree-like weed.  regardless, i'm looking for advice and approaches on how to get these out.  do i use the standard tools or is there an \"i'm not asking\" tool to help churn the root system.  any advice would be awesome!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/k7eryc/first_time_diy_root_removal_help/", "identifyer": 312488, "year": "2020"}, {"Unnamed: 0": 314764, "autor": "itswithinmyreach", "date": 1588380937000, "content": "Looking for advice or tools for design diy backyard", "link": "https://www.reddit.com/r/landscaping/comments/gbvtfk/looking_for_advice_or_tools_for_design_diy/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "looking for advice or tools for design -----> diy !!!  backyard", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://imgur.com/a/1SLj07C", "identifyer": 314764, "year": "2020"}, {"Unnamed: 0": 315073, "autor": "dthorpe14", "date": 1587669389000, "content": "Lawn Mower Repair? /!/ After buying a used craftsman lawn mower last summer, the crack in its base (pic below) has become increasingly large to the point of it being nearly impossible to make a 90 degree turn (along with probably being a safety hazard). Think it's worth trying to somehow seal (either DIY or taking to a repair shop) or should I just break down and get something new? It's a Craftsman and still runs well, but I only paid $60 for it so figured I'd need a new one eventually anyway\n\n*Processing img kx7ywqmoamu41...*", "link": "https://www.reddit.com/r/landscaping/comments/g6swbn/lawn_mower_repair/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "lawn mower repair? /!/ after buying a used craftsman lawn mower last summer, the crack in its base (pic below) has become increasingly large to the point of it being nearly impossible to make a 90 degree turn (along with probably being a safety hazard). think it's worth trying to somehow seal (either -----> diy !!!  or taking to a repair shop) or should i just break down and get something new? it's a craftsman and still runs well, but i only paid $60 for it so figured i'd need a new one eventually anyway\n\n*processing img kx7ywqmoamu41...*", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/g6swbn/lawn_mower_repair/", "identifyer": 315073, "year": "2020"}, {"Unnamed: 0": 315084, "autor": "velveteentouch", "date": 1587656841000, "content": "DIY Redo Brick Patio /!/ I’ve been pulling up a 100 year old brick patio from a home I rent in plans to redo it using the same bricks. I am a somewhat handy woman, and although this is very new to me, I started expecting to finish it! With that being said, the patio before has been *almost* un-usable due to large tree roots that pushed up brick, missing bricks, and an overall unlevel surface. I want this to be a usable patio, but I am not trying to do the absolute best job possible (I want it to be the best job I can do), hence why I’m interested in completing it and not hiring someone.  The first 3 [photos](https://imgur.com/gallery/02kZcmc) are relevant to my questions, the others are just a bonus of images featuring the patio.      \n      \n                                      \n A couple questions to start......                        -Can I reuse “wavy” bricks (example in photos)?     -What about slightly broken? I’m separating into usable and nonusable piles as I pull them out. Also shown in photos. \n-What will be the best way to go about digging the roots up? I am willing to get help with some things, as I am limited in tools. \n\nThose are it for now and any other tips you may want to throw in during this part if the process! I’m sure I’ll have more!", "link": "https://www.reddit.com/r/landscaping/comments/g6p1di/diy_redo_brick_patio/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  redo brick patio /!/ i’ve been pulling up a 100 year old brick patio from a home i rent in plans to redo it using the same bricks. i am a somewhat handy woman, and although this is very new to me, i started expecting to finish it! with that being said, the patio before has been *almost* un-usable due to large tree roots that pushed up brick, missing bricks, and an overall unlevel surface. i want this to be a usable patio, but i am not trying to do the absolute best job possible (i want it to be the best job i can do), hence why i’m interested in completing it and not hiring someone.  the first 3 [photos](https://imgur.com/gallery/02kzcmc) are relevant to my questions, the others are just a bonus of images featuring the patio.      \n      \n                                      \n a couple questions to start......                        -can i reuse “wavy” bricks (example in photos)?     -what about slightly broken? i’m separating into usable and nonusable piles as i pull them out. also shown in photos. \n-what will be the best way to go about digging the roots up? i am willing to get help with some things, as i am limited in tools. \n\nthose are it for now and any other tips you may want to throw in during this part if the process! i’m sure i’ll have more!", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/g6p1di/diy_redo_brick_patio/", "identifyer": 315084, "year": "2020"}, {"Unnamed: 0": 318277, "autor": "hrguyinSC", "date": 1598115930000, "content": "Clearing a lot for building - DIY tips? /!/ Hey!\nWe have a lot that we are going to start building on in the spring and I would like to do some DIY clearing this winter. We will have a long driveway and at the least I would like to clear that path and maybe some of where the home will go. \n\nI have a chainsaw but looking at what it costs to have land cleared by pros vs the amount of time it would take me seems like this may not be worth the time investment. \n\nStill, I want to save some money since I have this time and I am willing to do the work so I am trying to find that balance of efficiency of my time and money. \n\nWhat have you done in a similar situation? Equipment rental? One tree at a time with the chainsaw?\n\nAll experience welcome!! Thanks!", "link": "https://www.reddit.com/r/landscaping/comments/iem5jr/clearing_a_lot_for_building_diy_tips/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "clearing a lot for building - -----> diy !!!  tips? /!/ hey!\nwe have a lot that we are going to start building on in the spring and i would like to do some diy clearing this winter. we will have a long driveway and at the least i would like to clear that path and maybe some of where the home will go. \n\ni have a chainsaw but looking at what it costs to have land cleared by pros vs the amount of time it would take me seems like this may not be worth the time investment. \n\nstill, i want to save some money since i have this time and i am willing to do the work so i am trying to find that balance of efficiency of my time and money. \n\nwhat have you done in a similar situation? equipment rental? one tree at a time with the chainsaw?\n\nall experience welcome!! thanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/iem5jr/clearing_a_lot_for_building_diy_tips/", "identifyer": 318277, "year": "2020"}, {"Unnamed: 0": 318535, "autor": "Toukaloop", "date": 1584897842000, "content": "DIY Landscape advice, /!/ Hi! I've got a backyard garden filled with stones that I've been shoveling and removing by hand in order to set up a vegetable garden. Could anyone recommend, a better way/tool/machine that would help me remove or at least make shoveling easier. \n\n&amp;#x200B;\n\nAll advice much appreciated!\n\nhttps://preview.redd.it/qtlkcp0ed9o41.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=141c754bf59838bd32e9b16da81b3699be8a6a9b", "link": "https://www.reddit.com/r/landscaping/comments/fn3a67/diy_landscape_advice/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  landscape advice, /!/ hi! i've got a backyard garden filled with stones that i've been shoveling and removing by hand in order to set up a vegetable garden. could anyone recommend, a better way/tool/machine that would help me remove or at least make shoveling easier. \n\n&amp;#x200b;\n\nall advice much appreciated!\n\nhttps://preview.redd.it/qtlkcp0ed9o41.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=141c754bf59838bd32e9b16da81b3699be8a6a9b", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/fn3a67/diy_landscape_advice/", "identifyer": 318535, "year": "2020"}], "name": "diylandscaping2020"}