{"interestingcomments": [{"Unnamed: 0": 312102, "autor": "the_wandering", "date": 1584740286000, "content": "Unable to find a landscaper /!/ Hello,\n\nOur yard sits in a slope. We have fallen trees that are leaning on a fence. Sink holes that need to be filled with sand. Sapling trees that need to be removed. The land is approx one acre and was well maintained before my husband bought the house.\n\nEvery landscaper that comes out says they cannot help us or that we can do it ourselves. The land is sloped but the back 1/4 is fairly flat. The backyard is cut in half by the slope. It’s about a 45* angle and about 5ft high. That section may need to be done by hand. We’ve been told that no one will do it because their equipment may roll down the hill and damage our home. \n\nI’m most worried about the sapling trees and overgrown weeds popping up on the slope itself. Of course we could do it ourselves but I’m pregnant and my husbands chainsaw and lawnmower are broken.. and there many other projects we’d want to do and it would be much easier to pay someone.\n\nNo one will give us an estimate. Every asks what is our budget. We don’t really have a budget. We want the problems fixed but would like to know what $1k, $3k, $5k would get us. I also feel like we need a professional opinion on the sinkholes as they may pose a danger. \n\nI have no clue how to prioritize what needs to be done since I am unable to find out how much anything costs.\n\nI don’t know if we just don’t look like we make any money but my husband and I make over $100,000 combined which is well above average household income for our area. \n\nI’m getting frustrated and don’t know what else to do.\n\nIf it costs more than a few thousand we could take out a loan to pay for it or save it up.. paying for the work really isn’t an issue. \n\nThe rear of the yard would not be accessible by truck. We could do with someone just chopping the trees up so they aren’t leaning on the fence anymore. But we do have trees in the front that are small but dead and in danger of falling in the road.", "link": "https://www.reddit.com/r/landscaping/comments/fm3am5/unable_to_find_a_landscaper/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "unable to find a landscaper /!/ hello,\n\nour yard sits in a slope. we have fallen trees that are leaning on a fence. sink holes that need to be filled with sand. sapling trees that need to be removed. the land is approx one acre and was well maintained before my husband bought the house.\n\nevery landscaper that comes out says they cannot help us or that we can do it ourselves. the land is sloped but the back 1/4 is fairly flat. the backyard is cut in half by the slope. it’s about a 45* angle and about 5ft high. that section may need to be done by hand. we’ve been told that no one will do it because their equipment may roll down the hill and damage our home. \n\ni’m most worried about the sapling trees and overgrown weeds popping up on the slope itself. of course we could do it ourselves but i’m pregnant and my husbands chainsaw and lawnmower are broken.. and there many other projects we’d want to do and it would be much easier to pay someone.\n\nno one will give us an estimate. every asks what is our budget. we don’t really have a budget. we want the problems fixed but would like to know what $1k, $3k, $5k would get us. i also feel like we need a professional opinion on the sinkholes as they may pose a danger. \n\ni have no clue how to prioritize what needs to be done since i am unable to find out how much anything costs.\n\ni don’t know if -----> we !!!  just don’t look like -----> we !!!  -----> make !!!  any money but my husband and i -----> make !!!  over $100,000 combined which is well above average household income for our area. \n\ni’m getting frustrated and don’t know what else to do.\n\nif it costs more than a few thousand we could take out a loan to pay for it or save it up.. paying for the work really isn’t an issue. \n\nthe rear of the yard would not be accessible by truck. we could do with someone just chopping the trees up so they aren’t leaning on the fence anymore. but we do have trees in the front that are small but dead and in danger of falling in the road.", "sortedWord": "None", "removed": null, "score": 1, "comments": 20, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/fm3am5/unable_to_find_a_landscaper/", "identifyer": 312102, "year": "2020"}], "name": "makelandscaping2020"}