{"interestingcomments": [{"Unnamed: 0": 5267, "autor": "infinapps", "date": 1588263802000, "content": "Solar-powered 2g/3g Wifi hotspot /!/ I'm in the planning phase of IoT garden watering project based on ESP32.  As the garden is on a remote weekend house I want to have all data from sensors pushed to a web server so I can watch over them and possibly control it. ESP32 has wifi built in but at the location, there's no wifi or internet connection at all so I'm stuck at point how to reliably deliver an internet connection to it.\n\nMy first idea is to buy a 3g USB dongle, e.g. Huawei 3131 (\\~$15 on Aliexpress), for which max drawn current seems [not to be over 260ma](https://blog.atx.name/modem-power-consumption/) and then connect it to 10000mah (at 3.7V) power bank which has output 5V/2.1A. Some quick calculation (in which I'm not quite sure) gives me that it should last with maximum current pull around 28-30 hours. I could extend it with 5V solar panels that would then recharge this power bank or buy a bigger power bank but both seem that are not that good solutions for 10+ days of autonomy. Ideally, this hotspot would be on the whole time so I can check for commands from the server every 1-5 mins and send sensor data in real-time. The alternative is to turn on via relay this 3g dongle 3-5 times per hour to send the data and then turn it off.\n\nI also thought about getting own SIM module like SIM800L but it seems to draw 1-2.5 Amps so this would use up the battery even quicker.  \n\n\nSo my question is, is there any way to have long autonomy hotspot which I'm not seeing that's within $20-$30 budget?\n\nAnd, do you have recommendations for EU based/fast shipping IoT related stuff webshop with prices and shipping comparable to Aliexpress? ", "link": "https://www.reddit.com/r/IOT/comments/gayunv/solarpowered_2g3g_wifi_hotspot/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "solar-powered 2g/3g wifi hotspot /!/ i'm in the planning phase of iot -----> garden !!!  watering project based on esp32.  as the -----> garden !!!  is on a remote weekend house i want to have all data from sensors pushed to a web server so i can watch over them and possibly control it. esp32 has wifi built in but at the location, there's no wifi or internet connection at all so i'm stuck at point how to reliably deliver an internet connection to it.\n\nmy first idea is to buy a 3g usb dongle, e.g. huawei 3131 (\\~$15 on aliexpress), for which max drawn current seems [not to be over 260ma](https://blog.atx.name/modem-power-consumption/) and then connect it to 10000mah (at 3.7v) power bank which has output 5v/2.1a. some quick calculation (in which i'm not quite sure) gives me that it should last with maximum current pull around 28-30 hours. i could extend it with 5v solar panels that would then recharge this power bank or buy a bigger power bank but both seem that are not that good solutions for 10+ days of autonomy. ideally, this hotspot would be on the whole time so i can check for commands from the server every 1-5 mins and send sensor data in real-time. the alternative is to turn on via relay this 3g dongle 3-5 times per hour to send the data and then turn it off.\n\ni also thought about getting own sim module like sim800l but it seems to draw 1-2.5 amps so this would use up the battery even quicker.  \n\n\nso my question is, is there any way to have long autonomy hotspot which i'm not seeing that's within $20-$30 budget?\n\nand, do you have recommendations for eu based/fast shipping iot related stuff webshop with prices and shipping comparable to aliexpress? ", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/gayunv/solarpowered_2g3g_wifi_hotspot/", "identifyer": 3510474, "year": "2020"}], "name": "gardenIOT2020"}