{"interestingcomments": [{"Unnamed: 0": 5079, "autor": "TimArchy55", "date": 1587231704000, "content": "Looking to add wireless fare sensor and status light /!/ I’m looking to add outdoor wireless gate sensors to my two gates.  I’d like those to control a simple light of some sort near my back door so I have a quick reference to whether any of the gates are open before letting the dog out.  I have an outlet near the door I can plug something into.  I don’t have any current smart home hub so looking to set something up specifically for this, although having the ability to expand in the future would be nice too.  Can anyone point me in the direction of a solution that might work?", "link": "https://www.reddit.com/r/IOT/comments/g3rkcd/looking_to_add_wireless_fare_sensor_and_status/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "looking to add wireless fare sensor and status light /!/ i’m looking to add -----> outdoor !!!  wireless gate sensors to my two gates.  i’d like those to control a simple light of some sort near my back door so i have a quick reference to whether any of the gates are open before letting the dog out.  i have an outlet near the door i can plug something into.  i don’t have any current smart home hub so looking to set something up specifically for this, although having the ability to expand in the future would be nice too.  can anyone point me in the direction of a solution that might work?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/g3rkcd/looking_to_add_wireless_fare_sensor_and_status/", "identifyer": 3510280, "year": "2020"}, {"Unnamed: 0": 5190, "autor": "8solutions", "date": 1590025672000, "content": "So, if a person wanted to build a cheap, single-sensor, weather-proof, battery-powered, IoT device that they could throw around a farm to take a single sensor measurement (air, soil, etc.) and report back through a gateway and to the cloud... is there a module for that? /!/ My background is in RF and electrical engineering, so I'm 100% aware that there is a ton of complexity that I'm leaving out for the sake of the question. I've been away from the industry for about 4 years so I'm curious if there has been progress towards modularity and general purpose modules.\n\nThe heart of the question, is is there a de facto \"general-purpose\" outdoor IoT module that has a modular sensor and sends it to a gateway (LoRa, bluetooth, zigbee, etc.) which forward the sensor data to the sky. Nothing extra complicated like RA or OTA firmware updates. Are there many such modules? Are Arduinos used in producttion?", "link": "https://www.reddit.com/r/IOT/comments/gnnv95/so_if_a_person_wanted_to_build_a_cheap/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "so, if a person wanted to build a cheap, single-sensor, weather-proof, battery-powered, iot device that they could throw around a farm to take a single sensor measurement (air, soil, etc.) and report back through a gateway and to the cloud... is there a module for that? /!/ my background is in rf and electrical engineering, so i'm 100% aware that there is a ton of complexity that i'm leaving out for the sake of the question. i've been away from the industry for about 4 years so i'm curious if there has been progress towards modularity and general purpose modules.\n\nthe heart of the question, is is there a de facto \"general-purpose\" -----> outdoor !!!  iot module that has a modular sensor and sends it to a gateway (lora, bluetooth, zigbee, etc.) which forward the sensor data to the sky. nothing extra complicated like ra or ota firmware updates. are there many such modules? are arduinos used in producttion?", "sortedWord": "None", "removed": null, "score": 1, "comments": 18, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/gnnv95/so_if_a_person_wanted_to_build_a_cheap/", "identifyer": 3510394, "year": "2020"}, {"Unnamed: 0": 5437, "autor": "tj_lucero", "date": 1602014426000, "content": "ZigBee antenna help - outdoor well light /!/ I've developed an outdoor low voltage ZigBee RGBW light fixture. I'm looking to create a prototype well light using a lot of the same components. The issue is that the well light is flush with the ground which means any antenna will be just below ground inside the fixture. Does anyone have a recommendation on a specific antenna to use or any other feedback on trying to maximize the distance between fixtures?", "link": "https://www.reddit.com/r/IOT/comments/j6ccj6/zigbee_antenna_help_outdoor_well_light/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "zigbee antenna help - -----> outdoor !!!  well light /!/ i've developed an outdoor low voltage zigbee rgbw light fixture. i'm looking to create a prototype well light using a lot of the same components. the issue is that the well light is flush with the ground which means any antenna will be just below ground inside the fixture. does anyone have a recommendation on a specific antenna to use or any other feedback on trying to maximize the distance between fixtures?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/j6ccj6/zigbee_antenna_help_outdoor_well_light/", "identifyer": 3510645, "year": "2020"}, {"Unnamed: 0": 5700, "autor": "mycatistoofat", "date": 1595838864000, "content": "Any idea how would I record sound wavelengths in this scenario? /!/ Hi, I literally know nothing about IOT so thought I would ask the experts. This is the IOT scenario:\n\n1. User records their voice in different situations using Audacity and sends me the audio files\n2. I upload their sound wave files to an AI platform \n3. This is the part I don't know: Some kind of 3G/mobile enabled, preferably battery-powered, sound wave meter attached to an outdoor surface listens to its environment, or triggers on the sound of a human voice, and sends any human voices to the AI platform. \n4. When the AI platform finds a match, it alerts me. \n\nAssumes that human voices are unique to every individual.\n\nHow possible/not possible is this in your opinions?", "link": "https://www.reddit.com/r/IOT/comments/hyoglx/any_idea_how_would_i_record_sound_wavelengths_in/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "any idea how would i record sound wavelengths in this scenario? /!/ hi, i literally know nothing about iot so thought i would ask the experts. this is the iot scenario:\n\n1. user records their voice in different situations using audacity and sends me the audio files\n2. i upload their sound wave files to an ai platform \n3. this is the part i don't know: some kind of 3g/mobile enabled, preferably battery-powered, sound wave meter attached to an -----> outdoor !!!  surface listens to its environment, or triggers on the sound of a human voice, and sends any human voices to the ai platform. \n4. when the ai platform finds a match, it alerts me. \n\nassumes that human voices are unique to every individual.\n\nhow possible/not possible is this in your opinions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/hyoglx/any_idea_how_would_i_record_sound_wavelengths_in/", "identifyer": 3510916, "year": "2020"}, {"Unnamed: 0": 6526, "autor": "GreenappsWeb", "date": 1603206404000, "content": "Outdoor Air Quality Monitors 2020 Q4 /!/ Air quality monitors for professional use in cities and industrial sites and homeowners who want to supervise the ambient air quality outside their houses/apartments\n\n[https://seetheair.wordpress.com/2020/10/19/outdoor-air-quality-monitors-2020q4/](https://seetheair.wordpress.com/2020/10/19/outdoor-air-quality-monitors-2020q4/)", "link": "https://www.reddit.com/r/IOT/comments/jerbxi/outdoor_air_quality_monitors_2020_q4/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "-----> outdoor !!!  air quality monitors 2020 q4 /!/ air quality monitors for professional use in cities and industrial sites and homeowners who want to supervise the ambient air quality outside their houses/apartments\n\n[https://seetheair.wordpress.com/2020/10/19/outdoor-air-quality-monitors-2020q4/](https://seetheair.wordpress.com/2020/10/19/outdoor-air-quality-monitors-2020q4/)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/IOT/comments/jerbxi/outdoor_air_quality_monitors_2020_q4/", "identifyer": 3511774, "year": "2020"}, {"Unnamed: 0": 6554, "autor": "mikeliceta", "date": 1606220574000, "content": "What is the best outdoor air quality monitor? /!/ [removed]", "link": "https://www.reddit.com/r/IOT/comments/k040oi/what_is_the_best_outdoor_air_quality_monitor/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "what is the best -----> outdoor !!!  air quality monitor? /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/k040oi/what_is_the_best_outdoor_air_quality_monitor/", "identifyer": 3511803, "year": "2020"}], "name": "outdoorIOT2020"}