{"interestingcomments": [{"Unnamed: 0": 9056, "autor": "krash86", "date": 1622100213000, "content": "Wiz lights extreme data usage /!/ I am a longtime Asus Merlin user. I've never really had to ask for help before because  like every tech savvy guru, I know that my problems are not unique. Someone... at least one person has had the same issue as I, and most likely there are multiple solutions available. This is not a unique situation either. \n\nAbout six months ago I purchased my first smart home devices, two Philips Wiz Light Bulbs. Not counting the original Google Home purchased on launch day, and two outdoor Nest cams.  \n\n\nI recently started trying to monitor and be aware of what all the devices in the house have been doing. This month I was surprised to see the amount of data that these light bulbs have been transmitting/uploading. I am not sure exactly what they are sending, I am hoping for some help as to how to figure that out. For now though I leave you with the screenshots of the Traffic Analyzer tab for each bulb.  \n\n\nI would like any pointers or help with trying to figure out exactly what these bulbs are doing. I am sure that they are not really browsing CNN or watching TikTok. Highly unlikely.  \n\n\nWhat are some methods to capture the traffic from the bulbs and analyze it?  \nI did notice that each bulb only connects to one IP address and there are no dns queries in my logs. (logging may not have been implemented at the time the bulbs were being wonky)  \n\n\nI can only assume that they are infected with some sort of malware or are being used in a bot network.  \n\n\nThank you all in advance.\n\nhttps://preview.redd.it/a5vzo9h77m171.png?width=1021&amp;format=png&amp;auto=webp&amp;s=50ebdedd55c1e9ee71844a0d0a8018f7824a6a10\n\nhttps://preview.redd.it/dw0r99h77m171.png?width=1049&amp;format=png&amp;auto=webp&amp;s=d0ac41583f04abf9d6316c9eda99fcccc48e2964", "link": "https://www.reddit.com/r/IOT/comments/nm1yw4/wiz_lights_extreme_data_usage/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "wiz lights extreme data usage /!/ i am a longtime asus merlin user. i've never really had to ask for help before because  like every tech savvy guru, i know that my problems are not unique. someone... at least one person has had the same issue as i, and most likely there are multiple solutions available. this is not a unique situation either. \n\nabout six months ago i purchased my first smart home devices, two philips wiz light bulbs. not counting the original google home purchased on launch day, and two -----> outdoor !!!  nest cams.  \n\n\ni recently started trying to monitor and be aware of what all the devices in the house have been doing. this month i was surprised to see the amount of data that these light bulbs have been transmitting/uploading. i am not sure exactly what they are sending, i am hoping for some help as to how to figure that out. for now though i leave you with the screenshots of the traffic analyzer tab for each bulb.  \n\n\ni would like any pointers or help with trying to figure out exactly what these bulbs are doing. i am sure that they are not really browsing cnn or watching tiktok. highly unlikely.  \n\n\nwhat are some methods to capture the traffic from the bulbs and analyze it?  \ni did notice that each bulb only connects to one ip address and there are no dns queries in my logs. (logging may not have been implemented at the time the bulbs were being wonky)  \n\n\ni can only assume that they are infected with some sort of malware or are being used in a bot network.  \n\n\nthank you all in advance.\n\nhttps://preview.redd.it/a5vzo9h77m171.png?width=1021&amp;format=png&amp;auto=webp&amp;s=50ebdedd55c1e9ee71844a0d0a8018f7824a6a10\n\nhttps://preview.redd.it/dw0r99h77m171.png?width=1049&amp;format=png&amp;auto=webp&amp;s=d0ac41583f04abf9d6316c9eda99fcccc48e2964", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/nm1yw4/wiz_lights_extreme_data_usage/", "identifyer": 3514558, "year": "2021"}, {"Unnamed: 0": 9366, "autor": "birkenstab", "date": 1629734103000, "content": "Bachelor Thesis Ideas for a Public Swimming Pool /!/ I am looking for a Computer Science Bachelor Thesis Topic at a Local Indoor and Outdoor Swimming Pool Facility. They also have Water Slides and Saunas.\n\nDo you have ideas for IoT related topics that improve the experience for the facility managers of the pool or their guests?\n\nOr phrased differently: What annoys you or can be improved using IoT in a public swimming pool?\n\nExamples:\n\n* Recognizing the license plates of the cars using a camera and then analyzing from which counties the people travel from to the swimming pool.\n* Monitoring and Alerting based on sensor values e.g. open refrigerator doors, weather, fluid levels in tanks\n\nThank you :)", "link": "https://www.reddit.com/r/IOT/comments/pa2ob1/bachelor_thesis_ideas_for_a_public_swimming_pool/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "bachelor thesis ideas for a public swimming pool /!/ i am looking for a computer science bachelor thesis topic at a local indoor and -----> outdoor !!!  swimming pool facility. they also have water slides and saunas.\n\ndo you have ideas for iot related topics that improve the experience for the facility managers of the pool or their guests?\n\nor phrased differently: what annoys you or can be improved using iot in a public swimming pool?\n\nexamples:\n\n* recognizing the license plates of the cars using a camera and then analyzing from which counties the people travel from to the swimming pool.\n* monitoring and alerting based on sensor values e.g. open refrigerator doors, weather, fluid levels in tanks\n\nthank you :)", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/pa2ob1/bachelor_thesis_ideas_for_a_public_swimming_pool/", "identifyer": 3514876, "year": "2021"}, {"Unnamed: 0": 9474, "autor": "5SpeedFun", "date": 1631792913000, "content": "New to IOT...where are the ipv6 enabled/5ghz wifi devices? /!/ So I've been poking around Amazon &amp; googling &amp; I simply can't find much for ipv6 enabled/5ghz devices.  It's 2021 and all my devices outside of, I think, my old 3ds support 5ghz.  They all support ipv6 as well.  My Xbox &amp; pc both support/use ipv6, as does my ISP.   Am I missing something obvious?  Am I using the wrong search terms?  I'm looking for light bulbs, light switches &amp; that sort of thing, nothing fancy like a full blown appliance.  We have an outdoor controlled light in the back of the house controlled by a normal light switch.  I'd like to replace that switch so it turns on at sunset &amp; off at sunrise automatically.  I was hoping something \"smart\" could do this and I could monitor energy usage as wel (the bulb eats 150w).", "link": "https://www.reddit.com/r/IOT/comments/ppbr09/new_to_iotwhere_are_the_ipv6_enabled5ghz_wifi/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "new to iot...where are the ipv6 enabled/5ghz wifi devices? /!/ so i've been poking around amazon &amp; googling &amp; i simply can't find much for ipv6 enabled/5ghz devices.  it's 2021 and all my devices outside of, i think, my old 3ds support 5ghz.  they all support ipv6 as well.  my xbox &amp; pc both support/use ipv6, as does my isp.   am i missing something obvious?  am i using the wrong search terms?  i'm looking for light bulbs, light switches &amp; that sort of thing, nothing fancy like a full blown appliance.  we have an -----> outdoor !!!  controlled light in the back of the house controlled by a normal light switch.  i'd like to replace that switch so it turns on at sunset &amp; off at sunrise automatically.  i was hoping something \"smart\" could do this and i could monitor energy usage as wel (the bulb eats 150w).", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/ppbr09/new_to_iotwhere_are_the_ipv6_enabled5ghz_wifi/", "identifyer": 3514993, "year": "2021"}], "name": "outdoorIOT2021"}