{"interestingcomments": [{"Unnamed: 0": 2808, "autor": 768, "date": null, "content": "rf1101se-teensy\nHi! This is my repo for learning about microcontrollers and packetised radio with the CC1101 by Texas Instruments chip driven by 'Arduino-compatible' devices.\nYou're going to want to have at least one (or a dozen) of these really really cheap RF1101SE radio module based on a Texas Instruments CC1101 chip (that's the one with no MCU and no USB, just the radio).\nI'm driving this 3.3v chip directly from the Atmega328 with 5v... but other chips have acted in super weird ways. So now you've been warned(!), it really shouldn't work. YMMV ¯\\(ツ)/¯\ncc1101 — Just the radio\ncc1110 — radio and MCU (Radica IM-ME used in OpenSesame)\ncc1111 — radio, mcu, usb (YARD Stick One)\nYou're also going to want to have a Teensy, Arduino or basically any microcontroller that can speak SPI.\nNow all of this works with the Arduino 'whatever' but if you have a 'whatever' then you'll need Logic Converters because \"whatever's\" do 5V on the digital pins and the Teensy can deal with either 3.3V or 5V because...\nTeensy don't care.\nTeensy is your basic honey badger of small inexpensive microcontroller boards. It runs a Cortex-M4 which comes with a whole bunch of functionality built right into the chip.\nPlease note that the cheap rf1101se-v3.1/whatever radio board you got from Aliexpress is probably only good for 433MHz because they all seem to be missing resistors on the circuit board that would enable it to be useful at any other frequencies. So it's not the chip that's at fault, just the cheap board design.\nEncode all the things!\nThe example presented currently enables:\n16 bit preamble\n2 byte Sync Word (0xEEEE)\nCRC Checking\nGaussian frequency-shift keying\nManchester encoding\nAddress filtering (byte after sync word for specific device selection)\nRead The Fine Manual\nI've tried to document what the registers do in the Arduino code. You really need to read the manual though to understand what's going on.\nhttp://www.ti.com/lit/ds/symlink/cc1101.pdf\nTODO Move to the default Arduino SPI library. I would like to drive two slave devices (cc1101 chips) with a single microcontroller but the included panstamp library has it's own spi.c and spi.h which don't allow SPI.setSCK(pin)\nI include Yardstick One (YS1) code in this repo because I have one. If you don't have one then get one because they're awesome.\nLinks to things\nJared Boone's manchester decoding function\nYARD Stick One\ngareth__ on the twitters\nFreenode IRC — gareth__ on #HackRF #RFCat etc.", "link": "https://github.com/gyaresu/rf1101se-teensy", "origin": "Github", "suborigin": "arduino", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "rf1101se-teensy\nhi! this is my repo for learning about microcontrollers and packetised radio with the cc1101 by texas instruments chip driven by 'arduino-compatible' devices.\nyou're going to want to have at least one (or a dozen) of these really really cheap rf1101se radio module based on a texas instruments cc1101 chip (that's the one with no mcu and no usb, just the radio).\ni'm driving this 3.3v chip directly from the atmega328 with 5v... but other chips have acted in super weird ways. so now you've been warned(!), it really shouldn't work. ymmv ¯\\(ツ)/¯\ncc1101 — just the radio\ncc1110 — radio and mcu (radica im-me used in opensesame)\ncc1111 — radio, mcu, usb (-----> yard !!!  stick one)\nyou're also going to want to have a teensy, arduino or basically any microcontroller that can speak spi.\nnow all of this works with the arduino 'whatever' but if you have a 'whatever' then you'll need logic converters because \"whatever's\" do 5v on the digital pins and the teensy can deal with either 3.3v or 5v because...\nteensy don't care.\nteensy is your basic honey badger of small inexpensive microcontroller boards. it runs a cortex-m4 which comes with a whole bunch of functionality built right into the chip.\nplease note that the cheap rf1101se-v3.1/whatever radio board you got from aliexpress is probably only good for 433mhz because they all seem to be missing resistors on the circuit board that would enable it to be useful at any other frequencies. so it's not the chip that's at fault, just the cheap board design.\nencode all the things!\nthe example presented currently enables:\n16 bit preamble\n2 byte sync word (0xeeee)\ncrc checking\ngaussian frequency-shift keying\nmanchester encoding\naddress filtering (byte after sync word for specific device selection)\nread the fine manual\ni've tried to document what the registers do in the arduino code. you really need to read the manual though to understand what's going on.\nhttp://www.ti.com/lit/ds/symlink/cc1101.pdf\ntodo move to the default arduino spi library. i would like to drive two slave devices (cc1101 chips) with a single microcontroller but the included panstamp library has it's own spi.c and spi.h which don't allow spi.setsck(pin)\ni include yardstick one (ys1) code in this repo because i have one. if you don't have one then get one because they're awesome.\nlinks to things\njared boone's manchester decoding function\nyard stick one\ngareth__ on the twitters\nfreenode irc — gareth__ on #hackrf #rfcat etc.", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000768, "year": null}], "name": "yardarduino"}