{"interestingcomments": [{"autor": "moetsi_op", "date": 1634304914000, "content": "excited for this image/video dataset, Ego4D (3,025 hours of daily-life activity video) /!/ [https://ego4d-data.org/](https://ego4d-data.org/)\n\nEgo4D is a massive-scale Egocentric dataset of unprecedented diversity. It consists of 3,025 hours of video collected by **855 unique participants** from **74 worldwide locations** in 9 different countries.\n\nEgo4D, a massive-scale egocentric video dataset and benchmark suite. It offers 3,025 hours of daily-life activity video spanning hundreds of scenarios (household, outdoor, workplace, leisure, etc.) captured by 855 unique camera wearers from 74 worldwide locations and 9 different countries. The approach to collection is designed to uphold rigorous privacy and ethics standards with consenting participants and robust de-identification procedures where relevant. Ego4D dramatically expands the volume of diverse egocentric video footage publicly available to the research community. Portions of the video are accompanied by audio, 3D meshes of the environment, eye gaze, stereo, and/or synchronized videos from multiple egocentric cameras at the same event. Furthermore, we present a host of new benchmark challenges centered around understanding the first-person visual experience in the past (querying an episodic memory), present (analyzing hand-object manipulation, audio-visual conversation, and social interactions), and future (forecasting activities). By publicly sharing this massive annotated dataset and benchmark suite, we aim to push the frontier of first-person perception. Project page: [this https URL](https://ego4d-data.org/)", "link": "https://www.reddit.com/r/neuralnetworks/comments/q8okv7/excited_for_this_imagevideo_dataset_ego4d_3025/", "origin": "Reddit", "suborigin": "neuralnetworks", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "excited for this image/video dataset, ego4d (3,025 hours of daily-life activity video) /!/ [https://ego4d-data.org/](https://ego4d-data.org/)\n\nego4d is a massive-scale egocentric dataset of unprecedented diversity. it consists of 3,025 hours of video collected by **855 unique participants** from **74 worldwide locations** in 9 different countries.\n\nego4d, a massive-scale egocentric video dataset and benchmark suite. it offers 3,025 hours of daily-life activity video spanning hundreds of scenarios (household, -----> outdoor !!! , workplace, leisure, etc.) captured by 855 unique camera wearers from 74 worldwide locations and 9 different countries. the approach to collection is designed to uphold rigorous privacy and ethics standards with consenting participants and robust de-identification procedures where relevant. ego4d dramatically expands the volume of diverse egocentric video footage publicly available to the research community. portions of the video are accompanied by audio, 3d meshes of the environment, eye gaze, stereo, and/or synchronized videos from multiple egocentric cameras at the same event. furthermore, we present a host of new benchmark challenges centered around understanding the first-person visual experience in the past (querying an episodic memory), present (analyzing hand-object manipulation, audio-visual conversation, and social interactions), and future (forecasting activities). by publicly sharing this massive annotated dataset and benchmark suite, we aim to push the frontier of first-person perception. project page: [this https url](https://ego4d-data.org/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('self',)", "medialink": "('https://www.reddit.com/r/neuralnetworks/comments/q8okv7/excited_for_this_imagevideo_dataset_ego4d_3025/',)", "identifyer": 5755292, "year": "2021"}], "name": "outdoorneuralnetworks2021"}