{"interestingcomments": [{"Unnamed: 0": 1067, "autor": "CLDavi", "date": 1586060758000, "content": "Romo Robot Score! /!/ I happened to find something interesting at a local antique and curio shop here in Australia. It was a Romo Mk II Base, which I found odd given the assorted goods there. But for $19AU, I thought it was a good item, so I decided after a little research to buy it. It did not have the recharge cable, but since it was basically a USB connector, a Playstation 3 recharge cable would work just as well.\n\nI then took it upon myself to find a suitable smart device to operate it with. I found a second hand, refurbished iPhone 4S to use with it, via eBay, and brought it for $35AU, excluding postage. Thankfully, the phones second hand nature made it easy to use without a SIM card, that is, basically, as an iPod Touch.\n\nI tried it out with the \"My Romo\" app, and while some parts of it worked, such as the AI, others didn't, like the control app with it. So I decided to purchase the \"Romo X\" app for $14AU, putting it onto the iPhone and making it work well with practically all functions.\n\nAnd in the end, it works perfectly! \n\nThe antique and curio shop were selling it \"as is\", and it operates quite well. The motors and tilt mechanism run good. I can control it via my iPad Mini. And the phone and base interconnect well. So for those who still yearn for any good robot action, be patient and you'll find a good amount of treasure. Why pay $129US for one, when you can get the item for a fraction of that.\n\nI wonder what anyone else thinks of my recent acquisition?", "link": "https://www.reddit.com/r/robotics/comments/fv7u3l/romo_robot_score/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "romo robot score! /!/ i happened to find something interesting at a local -----> antique !!!  and curio shop here in australia. it was a romo mk ii base, which i found odd given the assorted goods there. but for $19au, i thought it was a good item, so i decided after a little research to buy it. it did not have the recharge cable, but since it was basically a usb connector, a playstation 3 recharge cable would work just as well.\n\ni then took it upon myself to find a suitable smart device to operate it with. i found a second hand, refurbished iphone 4s to use with it, via ebay, and brought it for $35au, excluding postage. thankfully, the phones second hand nature made it easy to use without a sim card, that is, basically, as an ipod touch.\n\ni tried it out with the \"my romo\" app, and while some parts of it worked, such as the ai, others didn't, like the control app with it. so i decided to purchase the \"romo x\" app for $14au, putting it onto the iphone and making it work well with practically all functions.\n\nand in the end, it works perfectly! \n\nthe antique and curio shop were selling it \"as is\", and it operates quite well. the motors and tilt mechanism run good. i can control it via my ipad mini. and the phone and base interconnect well. so for those who still yearn for any good robot action, be patient and you'll find a good amount of treasure. why pay $129us for one, when you can get the item for a fraction of that.\n\ni wonder what anyone else thinks of my recent acquisition?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/fv7u3l/romo_robot_score/", "identifyer": 3501076, "year": "2020"}, {"Unnamed: 0": 2092, "autor": "UrbanIndianaJones", "date": 1595977982000, "content": "Antique mechanical elevator indicator to one-hour-clock conversion project, planning to use a servo motor. Any suggestions? More info in comments", "link": "https://www.reddit.com/r/robotics/comments/hzpbjo/antique_mechanical_elevator_indicator_to/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "-----> antique !!!  mechanical elevator indicator to one-hour-clock conversion project, planning to use a servo motor. any suggestions? more info in comments", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "image", "medialink": "https://i.redd.it/clkq6jcfkod51.jpg", "identifyer": 3502110, "year": "2020"}], "name": "antiquerobotics2020"}