{"interestingcomments": [{"Unnamed: 0": 2497, "autor": "Ramvqcraft", "date": 1634794408000, "content": "Are better legs or tank tracks to carry load in stairs climbing robot? /!/ Hi! Electronics Engineer writing here. As a hobby I want to build a robot able to carry 100Kg (2 bags of concrete), that is able to climb a few stairs steps (probably 1 foot high total). I imagine something like a military mule but for home - so it has to be &lt;80cm length/width, to be able to enter most doors.\n\nI was thinking if it's better to use tank tracks or using legs like a greyhound. Professional tank tracks can be very expensive, so I wonder if using  homemade legs could cut the costs.\n\nFor now I am concerned about building the mechanical part - chassis and motors. For the electronic control I will take care later. The terrain where I'd use the robot is indoor and backyard, that is fairly flat. Except for the stairs at the garage.\n\nI am unsure if aluminum chassis is strong enough to carry 100Kg with such small measurements. I have the basic tools for wood and metal jobs, but I don't own specialized tools like plasma cutter, torch or lathe. I could hire such services instead.\n\nI'd like to know if any of you have suggestions on this.", "link": "https://www.reddit.com/r/robotics/comments/qckksf/are_better_legs_or_tank_tracks_to_carry_load_in/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "backyard", "selectorShort": "backyard", "MarkedSent": "are better legs or tank tracks to carry load in stairs climbing robot? /!/ hi! electronics engineer writing here. as a hobby i want to build a robot able to carry 100kg (2 bags of concrete), that is able to climb a few stairs steps (probably 1 foot high total). i imagine something like a military mule but for home - so it has to be &lt;80cm length/width, to be able to enter most doors.\n\ni was thinking if it's better to use tank tracks or using legs like a greyhound. professional tank tracks can be very expensive, so i wonder if using  homemade legs could cut the costs.\n\nfor now i am concerned about building the mechanical part - chassis and motors. for the electronic control i will take care later. the terrain where i'd use the robot is indoor and -----> backyard !!! , that is fairly flat. except for the stairs at the garage.\n\ni am unsure if aluminum chassis is strong enough to carry 100kg with such small measurements. i have the basic tools for wood and metal jobs, but i don't own specialized tools like plasma cutter, torch or lathe. i could hire such services instead.\n\ni'd like to know if any of you have suggestions on this.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/qckksf/are_better_legs_or_tank_tracks_to_carry_load_in/", "identifyer": 3507622, "year": "2021"}, {"Unnamed: 0": 4334, "autor": "titanicbutwithbears", "date": 1622735025000, "content": "next step beyond simple kit /!/ My son and I built a gopigo, attached a few sensors, and made a few programs.  That was fun, and we impressed his sister.\n\nBut now we want to build something a little bigger, with a little more room.\n\nI'm not worried about the programming, but I'm having a hard time finding a good parts list, or getting a good idea for a build.  I was kind of hoping to buy most of the components separately and assemble the same way you would build a PC.\n\nHere is what I'd like to do with the robot.\n\nAutonomously drive around my backyard at night, searching for intruders (racoons, moles, coyotes), getting cool video of said intruders, and following/chasing them out of the yard.  Nothing inhumane.  The coyotes and raccoons make my dog go crazy at night, which then wakes our sleeping baby.  The moles ruin my grass.\n\nSo I'm hoping to get some big wheels, a tough looking body that has a good platform for structure/sensors.\n\nAnyone how just a simple parts list for basic frame/motor/wheels that I can use?\n\nI saw a few kits online that would work, but they were close to $300.\n\nThanks very much.", "link": "https://www.reddit.com/r/robotics/comments/nrgj0m/next_step_beyond_simple_kit/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "backyard", "selectorShort": "backyard", "MarkedSent": "next step beyond simple kit /!/ my son and i built a gopigo, attached a few sensors, and made a few programs.  that was fun, and we impressed his sister.\n\nbut now we want to build something a little bigger, with a little more room.\n\ni'm not worried about the programming, but i'm having a hard time finding a good parts list, or getting a good idea for a build.  i was kind of hoping to buy most of the components separately and assemble the same way you would build a pc.\n\nhere is what i'd like to do with the robot.\n\nautonomously drive around my -----> backyard !!!  at night, searching for intruders (racoons, moles, coyotes), getting cool video of said intruders, and following/chasing them out of the yard.  nothing inhumane.  the coyotes and raccoons make my dog go crazy at night, which then wakes our sleeping baby.  the moles ruin my grass.\n\nso i'm hoping to get some big wheels, a tough looking body that has a good platform for structure/sensors.\n\nanyone how just a simple parts list for basic frame/motor/wheels that i can use?\n\ni saw a few kits online that would work, but they were close to $300.\n\nthanks very much.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/nrgj0m/next_step_beyond_simple_kit/", "identifyer": 3509512, "year": "2021"}], "name": "backyardrobotics2021"}