{"interestingcomments": [{"Unnamed: 0": 5, "autor": "samizdat1888", "date": 1587210089000, "content": "What's are the biggest reasons we don't have robots that can do every day tasks like cooking, cleaning, making the bed, doing the dishes, taking out the trash, doing the laundry, etc? Is it processing power? Software? Sensors? /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/g3m6lv/whats_are_the_biggest_reasons_we_dont_have_robots/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "what's are the biggest reasons we don't have robots that can do every day tasks like cooking, cleaning, making the -----> bed !!! , doing the dishes, taking out the trash, doing the laundry, etc? is it processing power? software? sensors? /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/g3m6lv/whats_are_the_biggest_reasons_we_dont_have_robots/", "identifyer": 3500005, "year": "2020"}, {"Unnamed: 0": 2786, "autor": "BKHalpin", "date": 1607459137000, "content": "Project Idea - Mobile Spider Robot /!/ Hey everyone.\n\nI just finished my Udemy course on ROS for beginners (it's by Edouard Renard, highly recommend if you're interested). He recommended that we try to do a personal project to test out our skills, which is something I'd love to do since it sounds fun.  \nI'd like to do a mobile spider robot; my inspiration comes from the \"Chiang Arcbot Model 5\" from Deus Ex (pic below). It's a tad complicated for my first scratch build, but I'm also taking Ian Juby's courses on building and programming robots (also recommend).   \nSince I'm trying to get a job as a robotics software engineer, I'd like to use my spider robot as a test bed for learning in-demand skills, especially AI and machine learning.\n\nAny tips or suggestions? Also, do y'all think that building a robot to learn these subjects worthwhile, or even something I could put on a resume? Or am I better off just sticking to courses? I'd probably build it regardless cause why not build a pet spider robo, but it'd be great if this is something that could impress companies.\n\nhttps://preview.redd.it/0xo2fe8eu0461.png?width=421&amp;format=png&amp;auto=webp&amp;s=09a999ee631cb39e81f878f9782b79a77e95f5bb", "link": "https://www.reddit.com/r/robotics/comments/k9c86x/project_idea_mobile_spider_robot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "project idea - mobile spider robot /!/ hey everyone.\n\ni just finished my udemy course on ros for beginners (it's by edouard renard, highly recommend if you're interested). he recommended that we try to do a personal project to test out our skills, which is something i'd love to do since it sounds fun.  \ni'd like to do a mobile spider robot; my inspiration comes from the \"chiang arcbot model 5\" from deus ex (pic below). it's a tad complicated for my first scratch build, but i'm also taking ian juby's courses on building and programming robots (also recommend).   \nsince i'm trying to get a job as a robotics software engineer, i'd like to use my spider robot as a test -----> bed !!!  for learning in-demand skills, especially ai and machine learning.\n\nany tips or suggestions? also, do y'all think that building a robot to learn these subjects worthwhile, or even something i could put on a resume? or am i better off just sticking to courses? i'd probably build it regardless cause why not build a pet spider robo, but it'd be great if this is something that could impress companies.\n\nhttps://preview.redd.it/0xo2fe8eu0461.png?width=421&amp;format=png&amp;auto=webp&amp;s=09a999ee631cb39e81f878f9782b79a77e95f5bb", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/k9c86x/project_idea_mobile_spider_robot/", "identifyer": 3502810, "year": "2020"}, {"Unnamed: 0": 2820, "autor": "Innov8Disrupt", "date": 1607305005000, "content": "This caregiver robot is enabling social connections for disabled and bed-ridden people in Japan.", "link": "https://www.reddit.com/r/robotics/comments/k86tqj/this_caregiver_robot_is_enabling_social/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "this caregiver robot is enabling social connections for disabled and -----> bed !!! -ridden people in japan.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "link", "medialink": "https://disruptiveinnovation.tech/news/this-caregiver-robot-is-enabling-social-connections-for-disabled-in-japan/", "identifyer": 3502844, "year": "2020"}, {"Unnamed: 0": 3587, "autor": "DragonRider0744", "date": 1587732114000, "content": "Which Components Do I Need To Build A Robot That Slaps Me Awake? /!/ I am preparing for two extremely difficult exams at the same time so I need to wake up each day by 3:30 am (I go to sleep at 20:30). I have tried everything from bed shakers to extremely loud alarms to ones that make me solve complicated Maths problems before it can be turned off. Although I have found the extremely loud, siren-like ones to be the most effective in startling me awake, the other member of my household and my neighbours were not very happy with the situation. Maths ones-- I would just turn off the device rather than being bothered to multiply two four digit numbers in my head. Bed shakers-- did nothing. Absolutely nothing whatsoever. I would just turn it off without even being aware of it in that semi-conscious sleepy state. So in my case, violence unfortunately seems to be the only remaining solution (open to other ideas but it should be a fun project to build at any rate). Maybe being in constant fear of a robotic arm hovering at the top of my bed, just over my head can finally help fix my over-sleeping problem.\n\nI have conceptualised the rough design in my head but since I have only recently gotten started with learning robotics, I am open to any advice and suggestions as to which components to use, etc. Thanks.", "link": "https://www.reddit.com/r/robotics/comments/g77oxz/which_components_do_i_need_to_build_a_robot_that/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "which components do i need to build a robot that slaps me awake? /!/ i am preparing for two extremely difficult exams at the same time so i need to wake up each day by 3:30 am (i go to sleep at 20:30). i have tried everything from -----> bed !!!  shakers to extremely loud alarms to ones that make me solve complicated maths problems before it can be turned off. although i have found the extremely loud, siren-like ones to be the most effective in startling me awake, the other member of my household and my neighbours were not very happy with the situation. maths ones-- i would just turn off the device rather than being bothered to multiply two four digit numbers in my head. bed shakers-- did nothing. absolutely nothing whatsoever. i would just turn it off without even being aware of it in that semi-conscious sleepy state. so in my case, violence unfortunately seems to be the only remaining solution (open to other ideas but it should be a fun project to build at any rate). maybe being in constant fear of a robotic arm hovering at the top of my bed, just over my head can finally help fix my over-sleeping problem.\n\ni have conceptualised the rough design in my head but since i have only recently gotten started with learning robotics, i am open to any advice and suggestions as to which components to use, etc. thanks.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/g77oxz/which_components_do_i_need_to_build_a_robot_that/", "identifyer": 3503622, "year": "2020"}, {"Unnamed: 0": 3588, "autor": "HaddocksAtDawn", "date": 1587729799000, "content": "A remotely controlled Zimmer frame? /!/ I have a crazy idea!\nMy Mum is 97 (flew barrage balloons on Wandsworth common, London during WW2!) has severe dementia and somewhat limited mobility.\nSince a fall two months ago Mum has needed to use a very light, aluminium Zimmer/walking frame which has helped considerably.\nOccasionally she leaves it in another room and then uses a few fixed handrails dotted around her flat.\nIs there anyway of fixing 2 lightweight (IP?) motors which drive the two wheels currently on the frame, and then be controlled via an app on my Android phone?\nThen if she left it out of reach I could drive it back to her!\nA bit of background:\nMum lives on her own in her flat but has four carer visits per day plus 1 night-time visit by either myself or my sister to ensure she gets to bed safely.\nOver a period of around 6 years I have installed 4 nest cameras, a broadlink pro to control her TV, DVD player and some lights.\nThe broadlink pro also allows me 2 switch HDMI input to a mini PC/NUC on which I have installed Skype with the facility for auto answer/auto video.\nJust trying to keep mum taking over safely for however long her dear soul is on this planet.\nThank you,\nMark", "link": "https://www.reddit.com/r/robotics/comments/g776ck/a_remotely_controlled_zimmer_frame/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "a remotely controlled zimmer frame? /!/ i have a crazy idea!\nmy mum is 97 (flew barrage balloons on wandsworth common, london during ww2!) has severe dementia and somewhat limited mobility.\nsince a fall two months ago mum has needed to use a very light, aluminium zimmer/walking frame which has helped considerably.\noccasionally she leaves it in another room and then uses a few fixed handrails dotted around her flat.\nis there anyway of fixing 2 lightweight (ip?) motors which drive the two wheels currently on the frame, and then be controlled via an app on my android phone?\nthen if she left it out of reach i could drive it back to her!\na bit of background:\nmum lives on her own in her flat but has four carer visits per day plus 1 night-time visit by either myself or my sister to ensure she gets to -----> bed !!!  safely.\nover a period of around 6 years i have installed 4 nest cameras, a broadlink pro to control her tv, dvd player and some lights.\nthe broadlink pro also allows me 2 switch hdmi input to a mini pc/nuc on which i have installed skype with the facility for auto answer/auto video.\njust trying to keep mum taking over safely for however long her dear soul is on this planet.\nthank you,\nmark", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/g776ck/a_remotely_controlled_zimmer_frame/", "identifyer": 3503623, "year": "2020"}], "name": "bedrobotics2020"}