{"interestingcomments": [{"Unnamed: 0": 538, "autor": "risingrace", "date": 1617258149000, "content": "Looking to build Dragger, a robot to drag things to you in the house /!/ I am looking to build a self-sustaining robot that can navigate indoors, take commands, and grab small things and bring them to you.\n\nExample use case: I'm laying in bed and I say \"hey siri, bring me some water\". Tells the robot to go grab a bottle from a corner of my wooden kitchen and drag it to me in my carpeted bedroom, and then goes back to dock.\n\nThis seems to entail the following:\n\n* can move on wood and carpet (so quadrupod/hexapod rather than wheels likely since carpet can get stuck in wheels)\n* connect over wifi to my server/computer\n* has some sort of arm that can hold on to things (water bottles, shoes, food)\n* has enough power to drag/carry about 2lbs\n* self-sustaining -&gt; doesn't require direct maintenance or supervision. it will go to it's back and dock until it has further tasks like a roomba\n\nand finally, it should look cute so that it's not an eye sore. I think the iRobot create could be an option if I could make it look nice and not ugly after attaching whatever needs to be added on there.\n\nsomething like this that can _drag_ things to me would be ideal, but I'm not sure this how to contend with the fact that the item being dragged would be in blocking the view of the robot, until the arm can grab the item and swivel it around, or it has two cameras so it can walk forwards and backwards.\n\nhttps://www.youtube.com/watch?v=R6kvBNsAwWs\n\nAny ideas? If I can get exactly what I want with a high quality product, I can spend a couple grand on this. I am also an expert experienced coder.", "link": "https://www.reddit.com/r/robotics/comments/mhp6r7/looking_to_build_dragger_a_robot_to_drag_things/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "looking to build dragger, a robot to drag things to you in the house /!/ i am looking to build a self-sustaining robot that can navigate indoors, take commands, and grab small things and bring them to you.\n\nexample use case: i'm laying in -----> bed !!!  and i say \"hey siri, bring me some water\". tells the robot to go grab a bottle from a corner of my wooden kitchen and drag it to me in my carpeted bedroom, and then goes back to dock.\n\nthis seems to entail the following:\n\n* can move on wood and carpet (so quadrupod/hexapod rather than wheels likely since carpet can get stuck in wheels)\n* connect over wifi to my server/computer\n* has some sort of arm that can hold on to things (water bottles, shoes, food)\n* has enough power to drag/carry about 2lbs\n* self-sustaining -&gt; doesn't require direct maintenance or supervision. it will go to it's back and dock until it has further tasks like a roomba\n\nand finally, it should look cute so that it's not an eye sore. i think the irobot create could be an option if i could make it look nice and not ugly after attaching whatever needs to be added on there.\n\nsomething like this that can _drag_ things to me would be ideal, but i'm not sure this how to contend with the fact that the item being dragged would be in blocking the view of the robot, until the arm can grab the item and swivel it around, or it has two cameras so it can walk forwards and backwards.\n\nhttps://www.youtube.com/watch?v=r6kvbnsawws\n\nany ideas? if i can get exactly what i want with a high quality product, i can spend a couple grand on this. i am also an expert experienced coder.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/mhp6r7/looking_to_build_dragger_a_robot_to_drag_things/", "identifyer": 3505605, "year": "2021"}, {"Unnamed: 0": 3725, "autor": "newpickles", "date": 1632074949000, "content": "Mobile Robot Plasma Cutter /!/ Making a mobile plasma cutting robot which will traverse on the surface  of the work piece which is placed on the ground on spacers (unlike over  the surface in a traditional gantry system with the work piece placed on a water bed). This system is designed so because the work piece is 15m x 3m in size.  **Has to have 1mm accuracy of cut over the full range of travel.**\n\nThe bot layout:  \n\nhttps://preview.redd.it/nj49ymh53io71.png?width=332&amp;format=png&amp;auto=webp&amp;s=a9f4eb071ad87567a261335de68aaa408a3b5d15\n\nUsing 4 steppers for XY Locomotion and 2 perpendicular rotary encoders  and an IMU for feedback. The 2 encoders are mounted separately on  pivoted/spring loaded omni wheels to try to negate any slippage in the  powered wheels and provide accurate feedback.\n\nFor the Z axis there will be another stepper and lead screw which will enable torch height control ability and add a rotary degree of freedom to the end effector to enable bevel cutting of sheet metal.\n\nIf fiducials are placed on the material as well as the robot a camera system can keep track of the cutting head from above. Similar to: [https://www.youtube.com/watch?v=\\_0clzXWSaCw](https://www.youtube.com/watch?v=_0clzXWSaCw)  Some big fans are cheap and can provide cross flow over the cutting area to keep  the sightline clear.  2 HD cameras placed above per sq meter will easily get the 1mm accuracy. Another idea to lower cost is to mount cameras on the bot and have a grid system overhead.\n\nAny other low cost ideas (budget under $1,500 USD) for position sensing over this range of travel and the accuracy required?", "link": "https://www.reddit.com/r/robotics/comments/prd4qn/mobile_robot_plasma_cutter/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "mobile robot plasma cutter /!/ making a mobile plasma cutting robot which will traverse on the surface  of the work piece which is placed on the ground on spacers (unlike over  the surface in a traditional gantry system with the work piece placed on a water -----> bed !!! ). this system is designed so because the work piece is 15m x 3m in size.  **has to have 1mm accuracy of cut over the full range of travel.**\n\nthe bot layout:  \n\nhttps://preview.redd.it/nj49ymh53io71.png?width=332&amp;format=png&amp;auto=webp&amp;s=a9f4eb071ad87567a261335de68aaa408a3b5d15\n\nusing 4 steppers for xy locomotion and 2 perpendicular rotary encoders  and an imu for feedback. the 2 encoders are mounted separately on  pivoted/spring loaded omni wheels to try to negate any slippage in the  powered wheels and provide accurate feedback.\n\nfor the z axis there will be another stepper and lead screw which will enable torch height control ability and add a rotary degree of freedom to the end effector to enable bevel cutting of sheet metal.\n\nif fiducials are placed on the material as well as the robot a camera system can keep track of the cutting head from above. similar to: [https://www.youtube.com/watch?v=\\_0clzxwsacw](https://www.youtube.com/watch?v=_0clzxwsacw)  some big fans are cheap and can provide cross flow over the cutting area to keep  the sightline clear.  2 hd cameras placed above per sq meter will easily get the 1mm accuracy. another idea to lower cost is to mount cameras on the bot and have a grid system overhead.\n\nany other low cost ideas (budget under $1,500 usd) for position sensing over this range of travel and the accuracy required?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/prd4qn/mobile_robot_plasma_cutter/", "identifyer": 3508882, "year": "2021"}, {"Unnamed: 0": 4596, "autor": "SarahC", "date": 1633158484000, "content": "Worlds smallest robot arm... the beginning. /!/ If anyone knows of a DIY robot arm that's smaller, please let me know before I print all the parts out!\n\n \n\nI discovered these 1.7g 180 degree servos: [https://www.ebay.com/itm/322376897053](https://www.ebay.com/itm/322376897053)\n\nI've got 3 coming and some male connectors to wire them up to my Arduino, and I've got a linear slider thing.... [https://www.amazon.co.uk/gp/product/B08KWFFNF7/](https://www.amazon.co.uk/gp/product/B08KWFFNF7/)\n\nTo save money, I might use that for the pincher as I already have it? Super accurate I suppose. Though another servo could do it too.\n\nI've got a 140x140x140mm beginner 3D printer Flashforge Finder... which curls up when I print anything large. (I know..... heat, sticky bed etc.... when it works).\n\nSo I'm thinking I could combine the small 3D prints with the mini servos for a super-mini robot arm!\n\nI've got the printer, the Arduino, the servo libraries, and the wires. The servos and plugs are on their way!\n\nThe cost of the parts is around £8 per servo, (some places sell for £4 but out of stock).... So hopefully it wont cost more than £40 - for a robot arm about 50mm tall!\n\nMy two questions are...\n\n1: Robot arm tips are very welcome. If you've made a robot arm, what are the pitfalls you found?\n\n2 : Is there a \"World's first mini robot arm\" already? I didn't find one... so I'm more motivated to make a \"first\" than just an old tried and tested project.\n\nI'll be putting everything on Thingiverse (I use OpenSCAD for scripting 3D parts), and the code on Github.\n\nI've already made a start with some inverse/forward kinematics to get a feel for how all the maths will work.\n\nInverse Kinematics : \"2 DOF 2D Robot Arm\" or \"Art Plotter\", the maths. Note it's \"hanging from the ceiling\"... =)\n\n[https://codepen.io/SarahC/pen/ExXMgJx](https://codepen.io/SarahC/pen/ExXMgJx)\n\nInverse Kinematics : Wall-plotter, the maths.\n\n[https://codepen.io/SarahC/pen/ExXrOMO](https://codepen.io/SarahC/pen/ExXrOMO)\n\nSo using this IK code, I can code the arm to pick up a (5mm, lol) box ... say.... 18mm away from the robot arm, and place it on a pedestal 25mm away and 10mm high.... without needing to calculate a single servo angle! yay!\n\nThoughts, suggestions, and issues you see me about to smack forcefully into are gladly accepted!\n\n[The STL files hooked up in OpenScad.  Bluetac can be applied to the feet to stop it falling over.](https://preview.redd.it/hkkm4ourkzq71.png?width=882&amp;format=png&amp;auto=webp&amp;s=bbdafaf604c7d1be7564c28959005e3e3c0ded3f)", "link": "https://www.reddit.com/r/robotics/comments/pzqch5/worlds_smallest_robot_arm_the_beginning/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "worlds smallest robot arm... the beginning. /!/ if anyone knows of a diy robot arm that's smaller, please let me know before i print all the parts out!\n\n \n\ni discovered these 1.7g 180 degree servos: [https://www.ebay.com/itm/322376897053](https://www.ebay.com/itm/322376897053)\n\ni've got 3 coming and some male connectors to wire them up to my arduino, and i've got a linear slider thing.... [https://www.amazon.co.uk/gp/product/b08kwffnf7/](https://www.amazon.co.uk/gp/product/b08kwffnf7/)\n\nto save money, i might use that for the pincher as i already have it? super accurate i suppose. though another servo could do it too.\n\ni've got a 140x140x140mm beginner 3d printer flashforge finder... which curls up when i print anything large. (i know..... heat, sticky -----> bed !!!  etc.... when it works).\n\nso i'm thinking i could combine the small 3d prints with the mini servos for a super-mini robot arm!\n\ni've got the printer, the arduino, the servo libraries, and the wires. the servos and plugs are on their way!\n\nthe cost of the parts is around £8 per servo, (some places sell for £4 but out of stock).... so hopefully it wont cost more than £40 - for a robot arm about 50mm tall!\n\nmy two questions are...\n\n1: robot arm tips are very welcome. if you've made a robot arm, what are the pitfalls you found?\n\n2 : is there a \"world's first mini robot arm\" already? i didn't find one... so i'm more motivated to make a \"first\" than just an old tried and tested project.\n\ni'll be putting everything on thingiverse (i use openscad for scripting 3d parts), and the code on github.\n\ni've already made a start with some inverse/forward kinematics to get a feel for how all the maths will work.\n\ninverse kinematics : \"2 dof 2d robot arm\" or \"art plotter\", the maths. note it's \"hanging from the ceiling\"... =)\n\n[https://codepen.io/sarahc/pen/exxmgjx](https://codepen.io/sarahc/pen/exxmgjx)\n\ninverse kinematics : wall-plotter, the maths.\n\n[https://codepen.io/sarahc/pen/exxromo](https://codepen.io/sarahc/pen/exxromo)\n\nso using this ik code, i can code the arm to pick up a (5mm, lol) box ... say.... 18mm away from the robot arm, and place it on a pedestal 25mm away and 10mm high.... without needing to calculate a single servo angle! yay!\n\nthoughts, suggestions, and issues you see me about to smack forcefully into are gladly accepted!\n\n[the stl files hooked up in openscad.  bluetac can be applied to the feet to stop it falling over.](https://preview.redd.it/hkkm4ourkzq71.png?width=882&amp;format=png&amp;auto=webp&amp;s=bbdafaf604c7d1be7564c28959005e3e3c0ded3f)", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/pzqch5/worlds_smallest_robot_arm_the_beginning/", "identifyer": 3509781, "year": "2021"}], "name": "bedrobotics2021"}