{"interestingcomments": [{"Unnamed: 0": 86, "autor": "aweltig", "date": 1586618157000, "content": "Support My Channel /!/ Hey, guys. I'm a 17 year old FPV pilot and I love making cinematic fpv videos. I have been involved in a few commercial shoots and I'm looking to branch out and expand. If you have any filming needs, please let me know because I would love to work with you. Anyway, I was just hoping that some of you guys could support my YouTube channel too. I have been creating better content lately and I appreciate every person who supports me. Thank you. Please feel free to post your channel below and I will gladly subscribe back.\n\n[https://www.youtube.com/channel/UCTPsF6jwY7EP2Tm9jbxuyeQ?view\\_as=subscriber](https://www.youtube.com/channel/UCTPsF6jwY7EP2Tm9jbxuyeQ?view_as=subscriber)", "link": "https://www.reddit.com/r/robotics/comments/fz7akf/support_my_channel/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "support my channel /!/ hey, guys. i'm a 17 year old fpv pilot and i love making cinematic fpv videos. i have been involved in a few commercial shoots and i'm looking to -----> branch !!!  out and expand. if you have any filming needs, please let me know because i would love to work with you. anyway, i was just hoping that some of you guys could support my youtube channel too. i have been creating better content lately and i appreciate every person who supports me. thank you. please feel free to post your channel below and i will gladly subscribe back.\n\n[https://www.youtube.com/channel/uctpsf6jwy7ep2tm9jbxuyeq?view\\_as=subscriber](https://www.youtube.com/channel/uctpsf6jwy7ep2tm9jbxuyeq?view_as=subscriber)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/fz7akf/support_my_channel/", "identifyer": 3500086, "year": "2020"}, {"Unnamed: 0": 1649, "autor": "storytelleradityaraj", "date": 1588195785000, "content": "Introduction to ROBOTICS /!/ \n\n\nIntroduction and control programs for robots\n\n\nLet’s face it, robots are cool. They’re also going to run the world some day, and hopefully, at that time they will take pity on their poor soft fleshy creators (a.k.a. robotics developers) and help us build a space utopia filled with plenty.\n\n\n\n\n\nRobot Defined:\n\n· Word robot was coined by a Czech novelist Karel Capek in a 1920 play titled Rassum’s Universal Robots (RUR)\n\n· Robot in Czech is a word for worker or servant.\n\n\nDefinition of robot: (What are Robots)\n\n\nAny machine made by by one our members:\n\n\nRobot Institute of America - A robot is a reprogrammable, multifunctional manipulator designed to move material, parts, tools or specialized devices through variable programmed motions for the performance of a variety of tasks: Robot Institute of America, 1979\n\n\nRobotics is a branch of engineering and science that includes electronics engineering, mechanical engineering and computer science and so on. \n\nThis branch deals with the design, construction, use to control robots, sensory feedback and information processing. \n\nRobots are designed to be used for any purpose but these are using in sensitive environments like bomb detection, deactivation of various bombs etc.\n\nRobots can take any form but many of them have given the human appearance. The robots which have taken the form of human appearance may likely to have the walk like humans, speech, cognition and most importantly all the things a human can do. Most of the robots of today are inspired by nature and are known as bio-inspired robots.\n\n\nRobotics is that branch of engineering that deals with conception, design, operation, and manufacturing of robots. There was an author named Issac Asimov, he said that he was the first person to give robotics name in a short story composed in 1940’s. In that story, Issac suggested three principles about how to guide these types of robotic machines. Later on, these three principleswere given the name of Issac’s three laws of Robotics. These three laws state that:\n\n·         Robots will never harm human beings.\n\n·         Robots will follow instructions given by humans with breaking law one.\n\n·         Robots will protect themselves without breaking other rules.\n\n\nLaws of Robotics\n\n\nAsimov proposed three “Laws of Robotics ” and later added the “zeroth law ”\n\n\n       Law 0: A robot may not injure humanity or through inaction, allow humanity to come to harm\n\n       Law 1: A robot may not injure a human being or through inaction, allow a human being to come to harm, unless this would violate a higher order law\n\n      Law 2: A robot must obey orders given to it by human beings, except where such orders would conflict with a higher order law\n\n       Law 3: A robot must protect its own existence as long as such protection does not conflict with a higher order law\n\n\nHistory of Robotics: I\n\n\nThe first industrial robot: UNIMATE\n\n\n1954: The first programmable robot is designed by George Devol, who coins the term Universal Automation. He later shortens this to Unimation, which becomes the name of the first robot company (1962).\n\n\nHistory of Robotics: II\n\n\n1978: The Puma (Programmable Universal Machine for Assembly) robot is developed by Unimation with a General Motors design support\n\nPUMA 560 Manipulator (img)\n\n\nHistory of Robotics: III\n\n\n1980s: The robot industry enters a phase of rapid growth. Many institutions introduce programs and courses in robotics. Robotics courses are spread across mechanical engineering, electrical engineering, and computer science departments.\n\nAdept’s SCARA robots\n\nCognex In-Sight Robot \n\nBarrett Technology Manipulator \n\n\nHistory of Robotics: IV\n\n1995-present: Emerging applications in small robotics and mobile robots drive a second growth of start-up companies and research\n\n2003: NASA’s Mars Exploration Rovers will launch toward Mars in search of answers about the history of water on Mars (img)\n\n\n\nKnowledge base for Robotics\n\nTypical knowledgebase for the design and operation of robotics systems\n\n\n·           Dynamic system modeling and analysis\n\n·           Feedback control\n\n·           Sensors and signal conditioning\n\n·           Actuators (muscles) and power electronics\n\n·           Hardware/computer interfacing\n\n·           Computer programming Knowledgebase for Robotics\n\n\nDisciplines: mathematics, physics, biology, mechanical engineering, electrical engineering, computer engineering, and computer science.\n\n\nThe challenge of the Programmable Robot: Perception vs Reality, and the fragile of control\n\nRead more[The Hacking Dad](https://thehackingdad.blogspot.com/b/search/label/Robotics)", "link": "https://www.reddit.com/r/robotics/comments/gai6qo/introduction_to_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "introduction to robotics /!/ \n\n\nintroduction and control programs for robots\n\n\nlet’s face it, robots are cool. they’re also going to run the world some day, and hopefully, at that time they will take pity on their poor soft fleshy creators (a.k.a. robotics developers) and help us build a space utopia filled with plenty.\n\n\n\n\n\nrobot defined:\n\n· word robot was coined by a czech novelist karel capek in a 1920 play titled rassum’s universal robots (rur)\n\n· robot in czech is a word for worker or servant.\n\n\ndefinition of robot: (what are robots)\n\n\nany machine made by by one our members:\n\n\nrobot institute of america - a robot is a reprogrammable, multifunctional manipulator designed to move material, parts, tools or specialized devices through variable programmed motions for the performance of a variety of tasks: robot institute of america, 1979\n\n\nrobotics is a -----> branch !!!  of engineering and science that includes electronics engineering, mechanical engineering and computer science and so on. \n\nthis branch deals with the design, construction, use to control robots, sensory feedback and information processing. \n\nrobots are designed to be used for any purpose but these are using in sensitive environments like bomb detection, deactivation of various bombs etc.\n\nrobots can take any form but many of them have given the human appearance. the robots which have taken the form of human appearance may likely to have the walk like humans, speech, cognition and most importantly all the things a human can do. most of the robots of today are inspired by nature and are known as bio-inspired robots.\n\n\nrobotics is that branch of engineering that deals with conception, design, operation, and manufacturing of robots. there was an author named issac asimov, he said that he was the first person to give robotics name in a short story composed in 1940’s. in that story, issac suggested three principles about how to guide these types of robotic machines. later on, these three principleswere given the name of issac’s three laws of robotics. these three laws state that:\n\n·         robots will never harm human beings.\n\n·         robots will follow instructions given by humans with breaking law one.\n\n·         robots will protect themselves without breaking other rules.\n\n\nlaws of robotics\n\n\nasimov proposed three “laws of robotics ” and later added the “zeroth law ”\n\n\n       law 0: a robot may not injure humanity or through inaction, allow humanity to come to harm\n\n       law 1: a robot may not injure a human being or through inaction, allow a human being to come to harm, unless this would violate a higher order law\n\n      law 2: a robot must obey orders given to it by human beings, except where such orders would conflict with a higher order law\n\n       law 3: a robot must protect its own existence as long as such protection does not conflict with a higher order law\n\n\nhistory of robotics: i\n\n\nthe first industrial robot: unimate\n\n\n1954: the first programmable robot is designed by george devol, who coins the term universal automation. he later shortens this to unimation, which becomes the name of the first robot company (1962).\n\n\nhistory of robotics: ii\n\n\n1978: the puma (programmable universal machine for assembly) robot is developed by unimation with a general motors design support\n\npuma 560 manipulator (img)\n\n\nhistory of robotics: iii\n\n\n1980s: the robot industry enters a phase of rapid growth. many institutions introduce programs and courses in robotics. robotics courses are spread across mechanical engineering, electrical engineering, and computer science departments.\n\nadept’s scara robots\n\ncognex in-sight robot \n\nbarrett technology manipulator \n\n\nhistory of robotics: iv\n\n1995-present: emerging applications in small robotics and mobile robots drive a second growth of start-up companies and research\n\n2003: nasa’s mars exploration rovers will launch toward mars in search of answers about the history of water on mars (img)\n\n\n\nknowledge base for robotics\n\ntypical knowledgebase for the design and operation of robotics systems\n\n\n·           dynamic system modeling and analysis\n\n·           feedback control\n\n·           sensors and signal conditioning\n\n·           actuators (muscles) and power electronics\n\n·           hardware/computer interfacing\n\n·           computer programming knowledgebase for robotics\n\n\ndisciplines: mathematics, physics, biology, mechanical engineering, electrical engineering, computer engineering, and computer science.\n\n\nthe challenge of the programmable robot: perception vs reality, and the fragile of control\n\nread more[the hacking dad](https://thehackingdad.blogspot.com/b/search/label/robotics)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gai6qo/introduction_to_robotics/", "identifyer": 3501661, "year": "2020"}, {"Unnamed: 0": 3014, "autor": "i-make-robots", "date": 1585759359000, "content": "Looking for some help with IK on my robot arm /!/ Please!  I'm looking for someone that has experience with inverse kinematics for robot arms.  I've got a solver at [https://github.com/MarginallyClever/Robot-Overlord-App/blob/2020-03-dev/src/main/java/com/marginallyclever/robotOverlord/entity/scene/dhRobotEntity/solvers/DHIKSolver\\_RTTRTR.java](https://github.com/MarginallyClever/Robot-Overlord-App/blob/2020-03-dev/src/main/java/com/marginallyclever/robotOverlord/entity/scene/dhRobotEntity/solvers/DHIKSolver_RTTRTR.java) that is *nearly* correct.  Having stared at it a few days, I'd really love an outsider to lean over and tell me where I forgot to put the red six on the black seven. \n\nThe whole project should run in Eclipse Mars if you import a Maven project.  Not that it's required, but it might be useful.  There's also a getting started guide at [https://github.com/MarginallyClever/Robot-Overlord-App/wiki/Getting-Started](https://github.com/MarginallyClever/Robot-Overlord-App/wiki/Getting-Started).  Note that the problem is on the github branch \"2020-03-dev\", where the latest work is being done.\n\nIf you know someone who can help, please share.\n\nThank you!", "link": "https://www.reddit.com/r/robotics/comments/ft3a76/looking_for_some_help_with_ik_on_my_robot_arm/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "looking for some help with ik on my robot arm /!/ please!  i'm looking for someone that has experience with inverse kinematics for robot arms.  i've got a solver at [https://github.com/marginallyclever/robot-overlord-app/blob/2020-03-dev/src/main/java/com/marginallyclever/robotoverlord/entity/scene/dhrobotentity/solvers/dhiksolver\\_rttrtr.java](https://github.com/marginallyclever/robot-overlord-app/blob/2020-03-dev/src/main/java/com/marginallyclever/robotoverlord/entity/scene/dhrobotentity/solvers/dhiksolver_rttrtr.java) that is *nearly* correct.  having stared at it a few days, i'd really love an outsider to lean over and tell me where i forgot to put the red six on the black seven. \n\nthe whole project should run in eclipse mars if you import a maven project.  not that it's required, but it might be useful.  there's also a getting started guide at [https://github.com/marginallyclever/robot-overlord-app/wiki/getting-started](https://github.com/marginallyclever/robot-overlord-app/wiki/getting-started).  note that the problem is on the github -----> branch !!!  \"2020-03-dev\", where the latest work is being done.\n\nif you know someone who can help, please share.\n\nthank you!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/ft3a76/looking_for_some_help_with_ik_on_my_robot_arm/", "identifyer": 3503040, "year": "2020"}, {"Unnamed: 0": 3052, "autor": "Kelarov", "date": 1585515084000, "content": "From EE to Robotics /!/ I will start Electrical Engineering, but the first 3 semesters will be like Mechatronics Engineering (that's actually the reason why I chose this course at this Uni). \nBasically, I wanna get into the field of Robotics and wanna do it from scratch - from designing, building all the way to controlling). Everything as a hobby, as I will start working for Siemens(dual/cooperative studies), but it will be in the Smart Infrastructures Division - a lot to do with Building Automation, Optimisation of energy use, etc... - that may help a bit, mainly in the programming/control area, but Robotics stuff isn't the real focus of the branch, that's why I said it'd be personal interests, not really exactly because of the job.\n\nBackground and further info:\n- I am taking an online course and am learning C++. \n- I have only high school, but I have taken the 3 Calculus and Linear Algebra classes already (learning stuff is also a hobby), and my next step would be Differential Equations (just got Advanced Engineering Mathematics, by Dennis G. Zill, 6th Ed.) \n- I am also learning some EE stuff with Fundamentals of Electric Circuits, by Charles Alexander, 7th Ed.\n\nI know I will definitely have to learn the things I mentioned above, but I am sure there are other things I could already start learning. \n\nWhat skills should I add to my project? \nI have read a lot about the topic already, but I would like other opinions. \n\nI will mention the topics I have found in common the most, and if you guys have some thoughts on it, please share. If not, it's fine too. \n\nROS/Gazebo, SLAM, MATLAB, Atmega32, SolidWorks, Eagle, Python, Artificial Intelligence, Lagragian and Hamilton Mechanics, Electronics, Control Systems, Computer Vision, Embedded Systems. \n\nNow, for example, your comments should be of the type:\n - ROS: This one is programmed in C++ or Python, so, you should wait till you have learned C++ or Python. \n- MATLAB:  It's good to know, but mostly for... and when you... \n- Electronics: The electronics background you will need can be learnt in/using/...\n- Embedded Systems: you should start with... \n\nand so on, this way I can make a plan. \n\nThanks a lot for you time.", "link": "https://www.reddit.com/r/robotics/comments/frd299/from_ee_to_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "from ee to robotics /!/ i will start electrical engineering, but the first 3 semesters will be like mechatronics engineering (that's actually the reason why i chose this course at this uni). \nbasically, i wanna get into the field of robotics and wanna do it from scratch - from designing, building all the way to controlling). everything as a hobby, as i will start working for siemens(dual/cooperative studies), but it will be in the smart infrastructures division - a lot to do with building automation, optimisation of energy use, etc... - that may help a bit, mainly in the programming/control area, but robotics stuff isn't the real focus of the -----> branch !!! , that's why i said it'd be personal interests, not really exactly because of the job.\n\nbackground and further info:\n- i am taking an online course and am learning c++. \n- i have only high school, but i have taken the 3 calculus and linear algebra classes already (learning stuff is also a hobby), and my next step would be differential equations (just got advanced engineering mathematics, by dennis g. zill, 6th ed.) \n- i am also learning some ee stuff with fundamentals of electric circuits, by charles alexander, 7th ed.\n\ni know i will definitely have to learn the things i mentioned above, but i am sure there are other things i could already start learning. \n\nwhat skills should i add to my project? \ni have read a lot about the topic already, but i would like other opinions. \n\ni will mention the topics i have found in common the most, and if you guys have some thoughts on it, please share. if not, it's fine too. \n\nros/gazebo, slam, matlab, atmega32, solidworks, eagle, python, artificial intelligence, lagragian and hamilton mechanics, electronics, control systems, computer vision, embedded systems. \n\nnow, for example, your comments should be of the type:\n - ros: this one is programmed in c++ or python, so, you should wait till you have learned c++ or python. \n- matlab:  it's good to know, but mostly for... and when you... \n- electronics: the electronics background you will need can be learnt in/using/...\n- embedded systems: you should start with... \n\nand so on, this way i can make a plan. \n\nthanks a lot for you time.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/frd299/from_ee_to_robotics/", "identifyer": 3503078, "year": "2020"}], "name": "branchrobotics2020"}