{"interestingcomments": [{"Unnamed: 0": 706, "autor": "arlteam", "date": 1632750015000, "content": "Team CERBERUS wins the DARPA Subterranean Challenge! /!/ &amp;#x200B;\n\n[Team CERBERUS won the DARPA Subterranean Challenge! Happy team members!](https://preview.redd.it/u3n0cx69t1q71.png?width=1920&amp;format=png&amp;auto=webp&amp;s=0ae5fe17efa5a03f912f89deaee58b398fa01be0)\n\n**Team** [**CERBERUS**](https://www.subt-cerberus.org/) **won the** [**DARPA Subterranean Challenge**](https://subtchallenge.com/) **and a $2,000,000 prize reward that comes along!** Team CERBERUS involves the international collaboration of the University of Nevada Reno, ETH Zurich, NTNU, University of California Berkeley, University of Oxford, Flyability, and Sierra Nevada Corporation. \n\n**In the Final Event,** DARPA designed an environment involving branches representing all three challenges of the “Tunnel Circuit”, the “Urban Circuit” and the “Cave Circuit”. Robots had to explore, search for objects (“artifacts”) of interest, and report their accurate location within underground tunnels, infrastructure similar to a subway, and natural caves and paths with extremely confined geometries, tough terrain, and severe visual degradation (including dense smoke). \n\n**Team CERBERUS** deployed a diverse set of robots with the *prime systems being four ANYmal C legged systems*. In the Prize Round of the Final Event, the team won the competition and scored 23 points by correctly detecting and localizing 23 of 40 of the artifacts DARPA had placed inside the environment. The second team, “CSIRO Data61” also scored 23 points but reported the last artifact with a slight further delay to DARPA thus the tiebraker was in favor of Team CERBERUS. The third team, “MARBLE” scored 18 points. \n\n**The DARPA Subterranean Challenge** was one of the rare types of global robotic competition events pushing the frontiers for resilient autonomy and calling teams to develop novel and innovative solutions with the capacity to help critical sectors such as search and rescue personnel and the industry in domains such as mining and beyond. The level of achievement of Team CERBERUS is best understood by looking at all the competitors in the “Systems Competition” of the Final Event. The participating teams including members from top international institutions, namely:\n\n* CERBERUS (Score = 23): University of Nevada, Reno, ETH Zurich, NTNU, University of California Berkeley, Oxford Robotics Institute, Flyability, Sierra Nevada Corporation\n* CSIRO Data61 (Score = 23): CSIRO, Emesent, Georgia Institute of Technology\n* MARBLE (Score = 18): University of Colorado Boulder, University of Colorado Denver, Scientific Systems Company, University of California Santa Cruz\n* Explorer (Score = 17): Carnegie Mellon University, Oregon State University\n* CoSTAR (Score = 13): NASA Jet Propulsion Laboratory, California Institute of Technology, MIT, KAIST, Lulea University of Technology\n* CTU-CRAS-NORLAB (Score = 7): Czech Technological University, Université Laval\n* Coordinated Robotics (Score = 2): Coordinated Robotics, California State University Channel Islands, Oke Onwuka, Sequoia Middle School\n* Robotika (Score = 2): Robotika International, [Robotika.cz](https://Robotika.cz), Czech University of Life Science, Centre for Field Robotics, Cogito Team\n\nWe congratulate all members of the team and we are proud of this incredible and historic achievement! Most importantly, we are excited to be part of this amazing community pushing the frontier of resilient robotic autonomy in extreme environments.", "link": "https://www.reddit.com/r/robotics/comments/pwhb5n/team_cerberus_wins_the_darpa_subterranean/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "team cerberus wins the darpa subterranean challenge! /!/ &amp;#x200b;\n\n[team cerberus won the darpa subterranean challenge! happy team members!](https://preview.redd.it/u3n0cx69t1q71.png?width=1920&amp;format=png&amp;auto=webp&amp;s=0ae5fe17efa5a03f912f89deaee58b398fa01be0)\n\n**team** [**cerberus**](https://www.subt-cerberus.org/) **won the** [**darpa subterranean challenge**](https://subtchallenge.com/) **and a $2,000,000 prize reward that comes along!** team cerberus involves the international collaboration of the university of nevada reno, eth zurich, ntnu, university of california berkeley, university of oxford, flyability, and sierra nevada corporation. \n\n**in the final event,** darpa designed an environment involving -----> branches !!!  representing all three challenges of the “tunnel circuit”, the “urban circuit” and the “cave circuit”. robots had to explore, search for objects (“artifacts”) of interest, and report their accurate location within underground tunnels, infrastructure similar to a subway, and natural caves and paths with extremely confined geometries, tough terrain, and severe visual degradation (including dense smoke). \n\n**team cerberus** deployed a diverse set of robots with the *prime systems being four anymal c legged systems*. in the prize round of the final event, the team won the competition and scored 23 points by correctly detecting and localizing 23 of 40 of the artifacts darpa had placed inside the environment. the second team, “csiro data61” also scored 23 points but reported the last artifact with a slight further delay to darpa thus the tiebraker was in favor of team cerberus. the third team, “marble” scored 18 points. \n\n**the darpa subterranean challenge** was one of the rare types of global robotic competition events pushing the frontiers for resilient autonomy and calling teams to develop novel and innovative solutions with the capacity to help critical sectors such as search and rescue personnel and the industry in domains such as mining and beyond. the level of achievement of team cerberus is best understood by looking at all the competitors in the “systems competition” of the final event. the participating teams including members from top international institutions, namely:\n\n* cerberus (score = 23): university of nevada, reno, eth zurich, ntnu, university of california berkeley, oxford robotics institute, flyability, sierra nevada corporation\n* csiro data61 (score = 23): csiro, emesent, georgia institute of technology\n* marble (score = 18): university of colorado boulder, university of colorado denver, scientific systems company, university of california santa cruz\n* explorer (score = 17): carnegie mellon university, oregon state university\n* costar (score = 13): nasa jet propulsion laboratory, california institute of technology, mit, kaist, lulea university of technology\n* ctu-cras-norlab (score = 7): czech technological university, université laval\n* coordinated robotics (score = 2): coordinated robotics, california state university channel islands, oke onwuka, sequoia middle school\n* robotika (score = 2): robotika international, [robotika.cz](https://robotika.cz), czech university of life science, centre for field robotics, cogito team\n\nwe congratulate all members of the team and we are proud of this incredible and historic achievement! most importantly, we are excited to be part of this amazing community pushing the frontier of resilient robotic autonomy in extreme environments.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/pwhb5n/team_cerberus_wins_the_darpa_subterranean/", "identifyer": 3505778, "year": "2021"}, {"Unnamed: 0": 875, "autor": "lanetownes", "date": 1610326974000, "content": "Joining school robotics team? /!/ Hello, I’m thinking of joining my schools FIRST robotics team next year. I’m not too sure what robotics is all about. Does anyone have a run through of the main things one does in a club like that, what main branch of science it is, any tips so I don’t look dumb, is junior year too late, or any thing other things I should know? Thank you!\nEdit: I have experience in beginner python, I should be pretty decent by next year.", "link": "https://www.reddit.com/r/robotics/comments/kurn7b/joining_school_robotics_team/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "joining school robotics team? /!/ hello, i’m thinking of joining my schools first robotics team next year. i’m not too sure what robotics is all about. does anyone have a run through of the main things one does in a club like that, what main -----> branch !!!  of science it is, any tips so i don’t look dumb, is junior year too late, or any thing other things i should know? thank you!\nedit: i have experience in beginner python, i should be pretty decent by next year.", "sortedWord": "None", "removed": null, "score": 2, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/kurn7b/joining_school_robotics_team/", "identifyer": 3505950, "year": "2021"}, {"Unnamed: 0": 2301, "autor": "AstronautTiger", "date": 1632285209000, "content": "Peter Corke conference tomorrow @ 5pm GMT-5 /!/  Hi everybody! In case anyone's interested, Professor Peter Corke will be giving a conference titled \"Robots Application and Investigation\" at the UDLAP IEEE Student Branch tomorrow @ 5:00pm Mexico City time (CDT/GMT-5), I'm sure it's gonna be pretty cool, so if you do have time you're all invited to check it out! The Facebook Live transmission will be available at the /ieeeudlap Facebook page. Don't be intimidated if the page is in Spanish, the conference will be in English!\n\n \n\nhttps://preview.redd.it/sr4kpzfbgzo71.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=d136c941b04f969c8ebf66d091c4edd6e89fdc62", "link": "https://www.reddit.com/r/robotics/comments/pszyxg/peter_corke_conference_tomorrow_5pm_gmt5/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "peter corke conference tomorrow @ 5pm gmt-5 /!/  hi everybody! in case anyone's interested, professor peter corke will be giving a conference titled \"robots application and investigation\" at the udlap ieee student -----> branch !!!  tomorrow @ 5:00pm mexico city time (cdt/gmt-5), i'm sure it's gonna be pretty cool, so if you do have time you're all invited to check it out! the facebook live transmission will be available at the /ieeeudlap facebook page. don't be intimidated if the page is in spanish, the conference will be in english!\n\n \n\nhttps://preview.redd.it/sr4kpzfbgzo71.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=d136c941b04f969c8ebf66d091c4edd6e89fdc62", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pszyxg/peter_corke_conference_tomorrow_5pm_gmt5/", "identifyer": 3507417, "year": "2021"}, {"Unnamed: 0": 2532, "autor": "michaellong-evsrobot", "date": 1610004620000, "content": "ASD East Intelligent Factory(Wenling) is located in the Zhejiang Coastal Industrial Gathering Area. The factory has a total area of 270,000 square meters, it consists of seven independent branch factories, using nearly 500 units of QJAR robots, 1026 sets of Intelligent Equipment, 97 units of AGVs...", "link": "https://www.reddit.com/r/robotics/comments/ks8a3a/asd_east_intelligent_factorywenling_is_located_in/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "asd east intelligent factory(wenling) is located in the zhejiang coastal industrial gathering area. the factory has a total area of 270,000 square meters, it consists of seven independent -----> branch !!!  factories, using nearly 500 units of qjar robots, 1026 sets of intelligent equipment, 97 units of agvs...", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "link", "medialink": "https://www.evsint.com/qjar-robots-asd-east-intelligent-factorywenling/", "identifyer": 3507657, "year": "2021"}, {"Unnamed: 0": 3491, "autor": "TarantinoFan23", "date": 1609519266000, "content": "New England is under attack! Help us destroy Brown Tail Moth nests /!/ Your mission, should you choose to accept it: Remove the invaders nests while they are nesting for the winter.\nThe challenge: On the tip of every high branch of the mighty oak are the insidious pests. The nest should be cut down and disposed. Otherwise, from April to August there will be a horrible rain of brown tail moth hairs. Their hairs are tiny hypodermic needles that last up to 3 years. They cause prolonged rashes and breathing problems. And the moths will destroy the tree if there are too many nests. I will post a picture of the tree if you can't find one online.", "link": "https://www.reddit.com/r/robotics/comments/koe9ct/new_england_is_under_attack_help_us_destroy_brown/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "new england is under attack! help us destroy brown tail moth nests /!/ your mission, should you choose to accept it: remove the invaders nests while they are nesting for the winter.\nthe challenge: on the tip of every high -----> branch !!!  of the mighty oak are the insidious pests. the nest should be cut down and disposed. otherwise, from april to august there will be a horrible rain of brown tail moth hairs. their hairs are tiny hypodermic needles that last up to 3 years. they cause prolonged rashes and breathing problems. and the moths will destroy the tree if there are too many nests. i will post a picture of the tree if you can't find one online.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/koe9ct/new_england_is_under_attack_help_us_destroy_brown/", "identifyer": 3508640, "year": "2021"}, {"Unnamed: 0": 4586, "autor": "MuazMahmood", "date": 1633195584000, "content": "📢 Are you a B2B Tech Marketer. Working at Robotic Startup? I need your help. Thanks 🙏 /!/ #  [📢](https://emojipedia.org/loudspeaker/) Fellow Robotic Marketers  [📢](https://emojipedia.org/loudspeaker/) \n\n### Are you a marketer who work for Robotics Startup?\n\n### I'm Muaz. Paid Search Marketer. Was providing marketing services to B2C niche. [Hated every sec of it]. Now doing market research to discover how I can serve Robotic Startups [the niche I'm most passionate about]. \n\nI'm not here to sell you any solution. But need your assistance to help me serve Robotic Startups better.\n\nQ1: What are your favorite websites, thought leaders, or blogs? Are there any specific websites or magazines in your industry? \n\nQ2: What were the most recent events/webinars you attended (or were planning to attend)? \n\nQ3: What were the most recent courses you followed (or were planning to follow)? \n\nQ4: What Social Media platform (LinkedIn, Instagram, Reddit, etc.) you use mostly? Which online communities &amp; groups (Slack groups/channels, Facebook groups, Discord, etc.) you are part of?\n\nQ5: Are there any specific federations, associations or network organizations in your branches?  \n\nQ6: What Content Platforms (Apple podcast, Spotify, YouTube, etc.) you use mostly?\n\nQ7: When looking for a vendor. Who is involved in decision making process (CEO, CMO, etc)?\n\n&amp;#x200B;\n\nThanks for your help   **🙏**  \n\nI'll be more than glad to be of any assistance to you too **🙏**\n\nMay your Robotic Startup dominate it's space  👊 \n\n&amp;#x200B;\n\nhttps://i.redd.it/4jo8k09pi2r71.gif", "link": "https://www.reddit.com/r/robotics/comments/pzzgxt/are_you_a_b2b_tech_marketer_working_at_robotic/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "📢 are you a b2b tech marketer. working at robotic startup? i need your help. thanks 🙏 /!/ #  [📢](https://emojipedia.org/loudspeaker/) fellow robotic marketers  [📢](https://emojipedia.org/loudspeaker/) \n\n### are you a marketer who work for robotics startup?\n\n### i'm muaz. paid search marketer. was providing marketing services to b2c niche. [hated every sec of it]. now doing market research to discover how i can serve robotic startups [the niche i'm most passionate about]. \n\ni'm not here to sell you any solution. but need your assistance to help me serve robotic startups better.\n\nq1: what are your favorite websites, thought leaders, or blogs? are there any specific websites or magazines in your industry? \n\nq2: what were the most recent events/webinars you attended (or were planning to attend)? \n\nq3: what were the most recent courses you followed (or were planning to follow)? \n\nq4: what social media platform (linkedin, instagram, reddit, etc.) you use mostly? which online communities &amp; groups (slack groups/channels, facebook groups, discord, etc.) you are part of?\n\nq5: are there any specific federations, associations or network organizations in your -----> branches !!! ?  \n\nq6: what content platforms (apple podcast, spotify, youtube, etc.) you use mostly?\n\nq7: when looking for a vendor. who is involved in decision making process (ceo, cmo, etc)?\n\n&amp;#x200b;\n\nthanks for your help   **🙏**  \n\ni'll be more than glad to be of any assistance to you too **🙏**\n\nmay your robotic startup dominate it's space  👊 \n\n&amp;#x200b;\n\nhttps://i.redd.it/4jo8k09pi2r71.gif", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/pzzgxt/are_you_a_b2b_tech_marketer_working_at_robotic/", "identifyer": 3509771, "year": "2021"}], "name": "branchrobotics2021"}