{"interestingcomments": [{"Unnamed: 0": 765, "autor": "papajo_r", "date": 1602451722000, "content": "Question about the use of hydraulics in robotics /!/ Hi I wonder why I dont see many robots (especially for limbs such as feet) using hydraulics (like the ones a and excavator would have well maybe not these exact model of cylinders but a more precise counterpart) \n\nWouldn't this increase the strength of a robot and also lower it's power usage (since the hydraulics only have to be triggered electronically for the amount of pressure to be exerted and no power is used by the cylinders themselves to apply pressure)", "link": "https://www.reddit.com/r/robotics/comments/j9dxbn/question_about_the_use_of_hydraulics_in_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "excavator", "selectorShort": "excavator", "MarkedSent": "question about the use of hydraulics in robotics /!/ hi i wonder why i dont see many robots (especially for limbs such as feet) using hydraulics (like the ones a and -----> excavator !!!  would have well maybe not these exact model of cylinders but a more precise counterpart) \n\nwouldn't this increase the strength of a robot and also lower it's power usage (since the hydraulics only have to be triggered electronically for the amount of pressure to be exerted and no power is used by the cylinders themselves to apply pressure)", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/j9dxbn/question_about_the_use_of_hydraulics_in_robotics/", "identifyer": 3500773, "year": "2020"}, {"Unnamed: 0": 1227, "autor": "Gur1g0n3", "date": 1581873473000, "content": "[Q] Excavator Arm School Project. Need some help. /!/ &amp;#x200B;\n\n![video](2sntsv6dkbh41)\n\nI am currently working on a school  project and would like to have some thoughts from you guys. The goal is  to build an excavator arm. We are only given three linear actuators and a  control unit to program and power these.\n\nThe actuators are:\n\n\\- one actuator  20,5cm/80.7'' long with a 10cm/3.9'' lift\n\nu- two actuators 15,5cm/61'' long with a 5cm/1.9'' lift\n\nI've  programmed a simulation of the arm in JavaScript with the actual  size/angles of the parts. The unit is cm. I still don't know out of  which material I should build the arm. I've considered 3d printing but I  don't know if it will hold together. The other options are metal or  wood. What would you recommend ? With a range of about a meter the will  be a lot of force on the parts.\n\nThe  other thing i need to think about is what I should mount on the end of  the arm. A shovel/bucket would work with the third actuator but is kind  of unpractical. I've considered a electromagnet and also a claw(not  quite sure how to move a claw with an actuator). What are some other  cool mounts I could put on there ?\n\nThank you.", "link": "https://www.reddit.com/r/robotics/comments/f4tnzc/q_excavator_arm_school_project_need_some_help/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "excavator", "selectorShort": "excavator", "MarkedSent": "[q] -----> excavator !!!  arm school project. need some help. /!/ &amp;#x200b;\n\n![video](2sntsv6dkbh41)\n\ni am currently working on a school  project and would like to have some thoughts from you guys. the goal is  to build an excavator arm. we are only given three linear actuators and a  control unit to program and power these.\n\nthe actuators are:\n\n\\- one actuator  20,5cm/80.7'' long with a 10cm/3.9'' lift\n\nu- two actuators 15,5cm/61'' long with a 5cm/1.9'' lift\n\ni've  programmed a simulation of the arm in javascript with the actual  size/angles of the parts. the unit is cm. i still don't know out of  which material i should build the arm. i've considered 3d printing but i  don't know if it will hold together. the other options are metal or  wood. what would you recommend ? with a range of about a meter the will  be a lot of force on the parts.\n\nthe  other thing i need to think about is what i should mount on the end of  the arm. a shovel/bucket would work with the third actuator but is kind  of unpractical. i've considered a electromagnet and also a claw(not  quite sure how to move a claw with an actuator). what are some other  cool mounts i could put on there ?\n\nthank you.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/f4tnzc/q_excavator_arm_school_project_need_some_help/", "identifyer": 3501238, "year": "2020"}, {"Unnamed: 0": 2139, "autor": "SubBass100", "date": 1595717774000, "content": "Fight boredom and help me test battery life on Live Bots Powered on at 6PM EST 7/25 /!/ Hey all, I've fitted an omni-directional Rovio from the early 2000s and a 7 motor excavator with raspberry pi's  [https://imgur.com/a/IxjkOfc](https://imgur.com/a/IxjkOfc)   I put them on-line @6pm 7/25/20 (links below).  They are free to roam the house right now. I've set some things out for them to interact with. There is a German Shepherd (Scout) and a cat (Kitty Cat) which you may see from time to time. \n\nRovio: [https://www.remo.tv/SubBass100/rbot-67fea43d-937e-4f84-8246-70b548a7ec42](https://www.remo.tv/SubBass100/rbot-67fea43d-937e-4f84-8246-70b548a7ec42) \n\n is powered by an Anchor 20,000mah battery while,\n\nMobileClaw: [https://www.remo.tv/SubBass100/rbot-c0ff6d0e-5c10-46ad-8e7d-fdc4fb9b4b0d](https://www.remo.tv/SubBass100/rbot-c0ff6d0e-5c10-46ad-8e7d-fdc4fb9b4b0d) \n\nis powered by a 22,000mah RAV battery. \n\nBoth run at  5V  to power a Raspberry Pi 3 and a buck converter for the motor controllers.  I have a discord  server if the bots break / get stuck / or you want to see what else I am working on:  [https://discord.gg/kNPpssP](https://discord.gg/kNPpssP)\n\nHave fun and be safe during these trying times,\n\nSubBass100", "link": "https://www.reddit.com/r/robotics/comments/hxw05f/fight_boredom_and_help_me_test_battery_life_on/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "excavator", "selectorShort": "excavator", "MarkedSent": "fight boredom and help me test battery life on live bots powered on at 6pm est 7/25 /!/ hey all, i've fitted an omni-directional rovio from the early 2000s and a 7 motor -----> excavator !!!  with raspberry pi's  [https://imgur.com/a/ixjkofc](https://imgur.com/a/ixjkofc)   i put them on-line @6pm 7/25/20 (links below).  they are free to roam the house right now. i've set some things out for them to interact with. there is a german shepherd (scout) and a cat (kitty cat) which you may see from time to time. \n\nrovio: [https://www.remo.tv/subbass100/rbot-67fea43d-937e-4f84-8246-70b548a7ec42](https://www.remo.tv/subbass100/rbot-67fea43d-937e-4f84-8246-70b548a7ec42) \n\n is powered by an anchor 20,000mah battery while,\n\nmobileclaw: [https://www.remo.tv/subbass100/rbot-c0ff6d0e-5c10-46ad-8e7d-fdc4fb9b4b0d](https://www.remo.tv/subbass100/rbot-c0ff6d0e-5c10-46ad-8e7d-fdc4fb9b4b0d) \n\nis powered by a 22,000mah rav battery. \n\nboth run at  5v  to power a raspberry pi 3 and a buck converter for the motor controllers.  i have a discord  server if the bots break / get stuck / or you want to see what else i am working on:  [https://discord.gg/knppssp](https://discord.gg/knppssp)\n\nhave fun and be safe during these trying times,\n\nsubbass100", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/hxw05f/fight_boredom_and_help_me_test_battery_life_on/", "identifyer": 3502157, "year": "2020"}], "name": "excavatorrobotics2020"}