{"interestingcomments": [{"Unnamed: 0": 902, "autor": "B8F1F488", "date": 1609228611000, "content": "So why doesn't robotics work? /!/ As a society, we do have some classical machinery that in recent years can probably fit the definition of robots, like: cars, planes, trains, ships, farming equipment, probably even elevators, etc. What I don't understand is why robotics is still not prevalent and why do so many people actually try to make it happen. For example, programmers keep focusing on incredibly saturated fields like web technologies, while in comparison the real world is wide open for automation in all sorts of sci-fi ways.\n\n&amp;#x200B;\n\nI wonder if people fail to see that or I fail to see issues internal to the field that are non-obvious to people outside the field.\n\n&amp;#x200B;\n\nSo why doesn't robotics work?", "link": "https://www.reddit.com/r/robotics/comments/kma1ld/so_why_doesnt_robotics_work/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "so why doesn't robotics work? /!/ as a society, we do have some classical machinery that in recent years can probably fit the definition of robots, like: cars, planes, trains, ships, -----> farming !!!  equipment, probably even elevators, etc. what i don't understand is why robotics is still not prevalent and why do so many people actually try to make it happen. for example, programmers keep focusing on incredibly saturated fields like web technologies, while in comparison the real world is wide open for automation in all sorts of sci-fi ways.\n\n&amp;#x200b;\n\ni wonder if people fail to see that or i fail to see issues internal to the field that are non-obvious to people outside the field.\n\n&amp;#x200b;\n\nso why doesn't robotics work?", "sortedWord": "None", "removed": null, "score": 1, "comments": 19, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/kma1ld/so_why_doesnt_robotics_work/", "identifyer": 3500911, "year": "2020"}, {"Unnamed: 0": 1196, "autor": "3Dvision_guru", "date": 1582046436000, "content": "[P] Maximising crop efficiency with quality 3D data /!/ **Problem:**\n\nWheat yield per acre has plateaued in the last 10 years. The challenge facing world seed producers is to create a variety of wheat that can achieve 20 tons per acre by 2020 (currently the average farming yield is about 13 tons per acre). Government bodies worldwide are aware that there is not enough wheat being produced and that wheat yields (or farm land) will need to increase by 70% to feed the population by 2050.\n\nEach year seed producers send their wheat seed samples to be graded. The results are published and farmers then purchase their next year’s seed based on the results of this information. Phenotyping data is used to guide cross breeding programs for seed producers, with the aim to create a better variety of wheat. Currently data is gathered manually with sample crops of wheat measured by hand with a ruler. Measurements across hundreds of plots within the same field record the ear length, ear height, volume and spikelet numbers (number of grains per ear). These four factors indicate the quality of the wheat and how much a particular seed variety could yield.\n\nBecause this process is very time consuming, the method of capturing and analyzing phenotyping data must become an automated process in order to help create the next variety of ‘Super Seed’ wheat.\n\n**Solution:**\n\nPhotoneo PhoXi 3D XL scanner with Halcon image analysis software.\n\nThe aim of the vision solution is to capture plant traits of the wheat in an outdoor environment (fields) with a mobile rig. A rectangle shaped rig is fitted with 2 PhoXi 3D Scanners capable of capturing a standard sample area of 2 x 5 meters, with a turnaround speed of 30 seconds. The 3D point cloud information obtained from the structured light laser scanners provides millimeter resolution. Post processing of the cloud formation takes place within MVTec’s Halcon Imaging Software with proprietary algorithms.", "link": "https://www.reddit.com/r/robotics/comments/f5v700/p_maximising_crop_efficiency_with_quality_3d_data/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "[p] maximising crop efficiency with quality 3d data /!/ **problem:**\n\nwheat yield per acre has plateaued in the last 10 years. the challenge facing world seed producers is to create a variety of wheat that can achieve 20 tons per acre by 2020 (currently the average -----> farming !!!  yield is about 13 tons per acre). government bodies worldwide are aware that there is not enough wheat being produced and that wheat yields (or farm land) will need to increase by 70% to feed the population by 2050.\n\neach year seed producers send their wheat seed samples to be graded. the results are published and farmers then purchase their next year’s seed based on the results of this information. phenotyping data is used to guide cross breeding programs for seed producers, with the aim to create a better variety of wheat. currently data is gathered manually with sample crops of wheat measured by hand with a ruler. measurements across hundreds of plots within the same field record the ear length, ear height, volume and spikelet numbers (number of grains per ear). these four factors indicate the quality of the wheat and how much a particular seed variety could yield.\n\nbecause this process is very time consuming, the method of capturing and analyzing phenotyping data must become an automated process in order to help create the next variety of ‘super seed’ wheat.\n\n**solution:**\n\nphotoneo phoxi 3d xl scanner with halcon image analysis software.\n\nthe aim of the vision solution is to capture plant traits of the wheat in an outdoor environment (fields) with a mobile rig. a rectangle shaped rig is fitted with 2 phoxi 3d scanners capable of capturing a standard sample area of 2 x 5 meters, with a turnaround speed of 30 seconds. the 3d point cloud information obtained from the structured light laser scanners provides millimeter resolution. post processing of the cloud formation takes place within mvtec’s halcon imaging software with proprietary algorithms.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/f5v700/p_maximising_crop_efficiency_with_quality_3d_data/", "identifyer": 3501207, "year": "2020"}, {"Unnamed: 0": 1767, "autor": "industrywired", "date": 1582631775000, "content": "How Robots are Lending a Hand in Shaping the Future of Farming", "link": "https://www.reddit.com/r/robotics/comments/f99656/how_robots_are_lending_a_hand_in_shaping_the/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how robots are lending a hand in shaping the future of -----> farming !!! ", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "link", "medialink": "https://industrywired.com/how-robots-are-lending-a-hand-in-shaping-the-future-of-farming/", "identifyer": 3501782, "year": "2020"}, {"Unnamed: 0": 3558, "autor": "BrainstormHQ", "date": 1587905144000, "content": "Robots in the modern farming industry", "link": "https://www.reddit.com/r/robotics/comments/g8dqrz/robots_in_the_modern_farming_industry/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "robots in the modern -----> farming !!!  industry", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": "rich:video", "medialink": "https://youtu.be/LGnNIs3VMWc", "identifyer": 3503593, "year": "2020"}, {"Unnamed: 0": 4872, "autor": "sad_physicist8", "date": 1601734131000, "content": "How to Begin /!/ What knowledge is required to build an advanced robot with real world applications (like in costruction or farming)??\n\n I know python &amp; have intermediate electronics knowledge is there any other thing required?\n\n and what will be steps or order of building the robot?", "link": "https://www.reddit.com/r/robotics/comments/j4fmmy/how_to_begin/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how to begin /!/ what knowledge is required to build an advanced robot with real world applications (like in costruction or -----> farming !!! )??\n\n i know python &amp; have intermediate electronics knowledge is there any other thing required?\n\n and what will be steps or order of building the robot?", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/j4fmmy/how_to_begin/", "identifyer": 3504929, "year": "2020"}], "name": "farmingrobotics2020"}