{"interestingcomments": [{"Unnamed: 0": 950, "autor": "dmalawey", "date": 1613831044000, "content": "Farmo in Malaysia at a community garden called Edible Park", "link": "https://www.reddit.com/r/robotics/comments/lo84gh/farmo_in_malaysia_at_a_community_garden_called/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "farmo in malaysia at a community -----> garden !!!  called edible park", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "link", "medialink": "https://v.redd.it/r7y5xbi5s5i61", "identifyer": 3506030, "year": "2021"}, {"Unnamed: 0": 2415, "autor": "ganjaptics", "date": 1635244507000, "content": "How hard is it to make something drive straight on bumpy terrain? /!/ I want to try making a wheeled robot that can sow seeds in my garden. I have rows of ~150 feet (50 meters) that are straight (I use string to lay it out) but not flat or smooth enough for anything to driver over without veering off course. How can I make it go completely straight within the row? \n\nThe simplest solution I can think of is to use colored string to lay out the rows and detect that via opencv or something. I'd have to place string between all rows (right now only the boundaries of the field and a few internal rows are marked with string...), which is a negative. If I could place markers at the end of the rows, that would be easier, but not sure how that would work. \n\nMaybe I can put some sort of wireless beacons on the corners of the field so I can triangulate it's location?\n\nCommercial farming robots and autonomous tractors apparently GPS to drive straight, even making perfect 180 degree turns at the end to align it self to the next row... honestly that sounds too accurate for GPS, is that possible? \n\n(The sowing mechanism I already have figured out so no worry there).", "link": "https://www.reddit.com/r/robotics/comments/qg3ict/how_hard_is_it_to_make_something_drive_straight/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "how hard is it to make something drive straight on bumpy terrain? /!/ i want to try making a wheeled robot that can sow seeds in my -----> garden !!! . i have rows of ~150 feet (50 meters) that are straight (i use string to lay it out) but not flat or smooth enough for anything to driver over without veering off course. how can i make it go completely straight within the row? \n\nthe simplest solution i can think of is to use colored string to lay out the rows and detect that via opencv or something. i'd have to place string between all rows (right now only the boundaries of the field and a few internal rows are marked with string...), which is a negative. if i could place markers at the end of the rows, that would be easier, but not sure how that would work. \n\nmaybe i can put some sort of wireless beacons on the corners of the field so i can triangulate it's location?\n\ncommercial farming robots and autonomous tractors apparently gps to drive straight, even making perfect 180 degree turns at the end to align it self to the next row... honestly that sounds too accurate for gps, is that possible? \n\n(the sowing mechanism i already have figured out so no worry there).", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/qg3ict/how_hard_is_it_to_make_something_drive_straight/", "identifyer": 3507535, "year": "2021"}, {"Unnamed: 0": 2618, "autor": "Dave_8787", "date": 1613384098000, "content": "Need some ideas to make a robot automatic /!/ I won't write too much info but essentially I'm making a portable irrigation robot which would just go around the garden and water the grass and plants...now controlling it using a rf controller would be quite simple but my aim is to calibrate it to map out my garden and just follow the same path everyday and quite honestly I haven't found anything useful online...any help down in the comments would be appreciated\n\nP.S I'm just in high school and this is a high school project so my knowledge regarding these systems isn't quite enormous", "link": "https://www.reddit.com/r/robotics/comments/lkasq6/need_some_ideas_to_make_a_robot_automatic/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "need some ideas to make a robot automatic /!/ i won't write too much info but essentially i'm making a portable irrigation robot which would just go around the -----> garden !!!  and water the grass and plants...now controlling it using a rf controller would be quite simple but my aim is to calibrate it to map out my -----> garden !!!  and just follow the same path everyday and quite honestly i haven't found anything useful online...any help down in the comments would be appreciated\n\np.s i'm just in high school and this is a high school project so my knowledge regarding these systems isn't quite enormous", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/lkasq6/need_some_ideas_to_make_a_robot_automatic/", "identifyer": 3507745, "year": "2021"}, {"Unnamed: 0": 2644, "autor": "Lavish_Gupta", "date": 1613211000000, "content": "And now we play in the Cartesian garden ䷪䷢", "link": "https://www.reddit.com/r/robotics/comments/lixx65/and_now_we_play_in_the_cartesian_garden/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "and now we play in the cartesian -----> garden !!!  ䷪䷢", "sortedWord": "None", "removed": null, "score": 1, "comments": 24, "media": "hosted:video", "medialink": "https://v.redd.it/td2zglh0y7h61", "identifyer": 3507772, "year": "2021"}, {"Unnamed: 0": 3893, "autor": "Dave_8787", "date": 1615337843000, "content": "Automating a robot /!/ Just a small overview... I'm making a autonomous irrigation robot for my high school project...now my aim is to make the robot to follow a predefined path with no obstacles.. essentially a small garden now i could use ultrasonic sensors and stuff but i feel like they'll be useless in this because as the garden has no obstacles...so is there any way to get the Arduino or whichever controller i use to go 10m straight then turn right then go straight... like if that makes?\n\nOne thing that came to my mind was 3 years ago we played around with lego Mindstorms and ev3 and essentially in the application you had to make a loop and you can specify the motors to travel a specific distance then stop and then turn...so i essentially wanna do the same thing", "link": "https://www.reddit.com/r/robotics/comments/m1la9v/automating_a_robot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "automating a robot /!/ just a small overview... i'm making a autonomous irrigation robot for my high school project...now my aim is to make the robot to follow a predefined path with no obstacles.. essentially a small -----> garden !!!  now i could use ultrasonic sensors and stuff but i feel like they'll be useless in this because as the garden has no obstacles...so is there any way to get the arduino or whichever controller i use to go 10m straight then turn right then go straight... like if that makes?\n\none thing that came to my mind was 3 years ago we played around with lego mindstorms and ev3 and essentially in the application you had to make a loop and you can specify the motors to travel a specific distance then stop and then turn...so i essentially wanna do the same thing", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/m1la9v/automating_a_robot/", "identifyer": 3509056, "year": "2021"}, {"Unnamed: 0": 4185, "autor": "ghla", "date": 1619441316000, "content": "Requesting Advice: How to build a hydraulic, non-lethal motion-activated, motion-targeting water cannon to keep squirrels from destroying the garden. /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/mywvr2/requesting_advice_how_to_build_a_hydraulic/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "requesting advice: how to build a hydraulic, non-lethal motion-activated, motion-targeting water cannon to keep squirrels from destroying the -----> garden !!! . /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mywvr2/requesting_advice_how_to_build_a_hydraulic/", "identifyer": 3509357, "year": "2021"}], "name": "gardenrobotics2021"}