{"interestingcomments": [{"Unnamed: 0": 2928, "autor": "Due_Capital_9249", "date": 1626362265000, "content": "Following a driveway using image processing? /!/ Hi - I'm working on a rover type robot that I need to follow a very long driveway that is blacktop surrounded by grass. I'm thinking the color delineation between the drive and grass should be enough for an image processing algorithm to feed my motion control.\n\nI'm not looking to invent some new algorithm or processing. So if this isn't something that is typical and relatively accessible for a fun project then i'll look for some other option. I know how to do this using sensors or more simple optics with a contrasting white line. Was hoping not to have to do that given the long length of the drive.\n\nAny pointers to hardware/software for me to dig into?", "link": "https://www.reddit.com/r/robotics/comments/okuxvz/following_a_driveway_using_image_processing/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "following a driveway using image processing? /!/ hi - i'm working on a rover type robot that i need to follow a very long driveway that is blacktop surrounded by -----> grass !!! . i'm thinking the color delineation between the drive and grass should be enough for an image processing algorithm to feed my motion control.\n\ni'm not looking to invent some new algorithm or processing. so if this isn't something that is typical and relatively accessible for a fun project then i'll look for some other option. i know how to do this using sensors or more simple optics with a contrasting white line. was hoping not to have to do that given the long length of the drive.\n\nany pointers to hardware/software for me to dig into?", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/okuxvz/following_a_driveway_using_image_processing/", "identifyer": 3508062, "year": "2021"}], "name": "grassrobotics2021"}