{"interestingcomments": [{"Unnamed: 0": 2428, "autor": "cjjammer", "date": 1600803583000, "content": "Cool to see this high-tech vertical farm created by a Singapore's start-up, that can grow strawberries indoor with 40% more energy efficient. The vertical farm also features #robotic arms to help with pollination of the flowers and harvesting of the strawberries.", "link": "https://www.reddit.com/r/robotics/comments/ixumov/cool_to_see_this_hightech_vertical_farm_created/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "cool to see this high-tech vertical farm created by a singapore's start-up, that can grow strawberries indoor with 40% more energy efficient. the vertical farm also features #robotic arms to help with pollination of the flowers and -----> harvesting !!!  of the strawberries.", "sortedWord": "None", "removed": null, "score": 1, "comments": 28, "media": null, "medialink": "https://www.reddit.com/gallery/ixumov", "identifyer": 3502447, "year": "2020"}, {"Unnamed: 0": 2837, "autor": "dominiquely", "date": 1607218990000, "content": "Is there library/open source project of (cognitive) robot skills in some challenging environment? Maybe question for research resources? /!/ OK, I have installed ROS and I am reading how to create my first ROS program. I will seek for some robotic hand ([https://www.sciencedirect.com/science/article/pii/S2468067220300092](https://www.sciencedirect.com/science/article/pii/S2468067220300092)) or InMoov robot, they have URDF files for their robots (which specifies links, joints and geometry of robot, also - I guess - masses and inertial moments of the parts) I can also build up some environment of even a industrial work cell. Then I can specify target points and use MoveIt! to generate plan and then I can execute all this in rviz simulation and be happy. That is fine. Every schoolchildren and do it.\n\nBut I want more - I would like to do something that contributed to the overall benefit of humanity. So - **my question is** \\- is there some library of robotic movements/skills primitives and library of increasingly complex movements/skills. I guess that that each such primitive can have some label (concept) and some parameters (which can be specified for each instance of such motion primitive or skill) and such labels/concepts can be put into global knowledge graph (like one extracted from the WordNet or Cyc) and then I can build relations between this concept of some primitive/complex skill/motion and some other concepts. And then I can create program (cognitive architecture like OpenCog, in fact - I am building one myself, only better, more general one and using off-the-shelf industrial quality graph database and reasoning facilities) that is doing some reasoning over combined knowledge base of commonsense knowledge and motion intelligence as specified by the skills. And then I can use all this for big-step/small-step motion planning and autonomy.\n\nJust wanted to know whether someone is doing something like this? I know that Springer has 4-volume set of ROS books and one of them have article about some library in Europe, but - it is not so big. \n\nThere can be marketplace for such robotic skills - someone can ask for specific skill and someone can build it.\n\nSuch robotic skills can also be acquired from the videos: one can read the body motion from the video file, decode this motion as the motion of the skeleton, then - using the inverse dynamics extraction - extract the forces and torques for the joins and maybe - even the control rule. And - if such motion can be segmented into primitives and if primitive can have labels/concepts assigned - then - there can be skills database from the demonstrations or even from the everyday videos.\n\nI have read also papers about inverse reinforcement learning in which sequences of demonstrations and converted into the reward function or even utility function of some non-Markovian task-environment.\n\nI have also heard about test environments - like IKEA kitchen (I am very fond of idea to build robots for food processing - this is are which requires a lot of mundane human work), but I can not found it in net.\n\nGenerally - ***what I am seeking is some open source research or programming project that builds such library of robotic skills and that also combines and build infrastructure how to update/increase such library more or less automatically from the video files or real-world observations made by robots.***\n\nAny hints are welcome. I am feeling that I can program robots but I would like to go ahead with some challenges to solve problems. My intention is to create robots for humanity - if there are enough high-skilled robots in the world then there will be no human exploitation and world can end the suffering and poverty. In my country I have been always told - get out of college and go and do real jobs like agriculture harvesting, food processing in plant or building. Yes, I can do this, but I have also this passion to learn, to create robots and programs, to automate jobs so that people have the opportunity to do creative and rewarding things.", "link": "https://www.reddit.com/r/robotics/comments/k7ke4g/is_there_libraryopen_source_project_of_cognitive/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "is there library/open source project of (cognitive) robot skills in some challenging environment? maybe question for research resources? /!/ ok, i have installed ros and i am reading how to create my first ros program. i will seek for some robotic hand ([https://www.sciencedirect.com/science/article/pii/s2468067220300092](https://www.sciencedirect.com/science/article/pii/s2468067220300092)) or inmoov robot, they have urdf files for their robots (which specifies links, joints and geometry of robot, also - i guess - masses and inertial moments of the parts) i can also build up some environment of even a industrial work cell. then i can specify target points and use moveit! to generate plan and then i can execute all this in rviz simulation and be happy. that is fine. every schoolchildren and do it.\n\nbut i want more - i would like to do something that contributed to the overall benefit of humanity. so - **my question is** \\- is there some library of robotic movements/skills primitives and library of increasingly complex movements/skills. i guess that that each such primitive can have some label (concept) and some parameters (which can be specified for each instance of such motion primitive or skill) and such labels/concepts can be put into global knowledge graph (like one extracted from the wordnet or cyc) and then i can build relations between this concept of some primitive/complex skill/motion and some other concepts. and then i can create program (cognitive architecture like opencog, in fact - i am building one myself, only better, more general one and using off-the-shelf industrial quality graph database and reasoning facilities) that is doing some reasoning over combined knowledge base of commonsense knowledge and motion intelligence as specified by the skills. and then i can use all this for big-step/small-step motion planning and autonomy.\n\njust wanted to know whether someone is doing something like this? i know that springer has 4-volume set of ros books and one of them have article about some library in europe, but - it is not so big. \n\nthere can be marketplace for such robotic skills - someone can ask for specific skill and someone can build it.\n\nsuch robotic skills can also be acquired from the videos: one can read the body motion from the video file, decode this motion as the motion of the skeleton, then - using the inverse dynamics extraction - extract the forces and torques for the joins and maybe - even the control rule. and - if such motion can be segmented into primitives and if primitive can have labels/concepts assigned - then - there can be skills database from the demonstrations or even from the everyday videos.\n\ni have read also papers about inverse reinforcement learning in which sequences of demonstrations and converted into the reward function or even utility function of some non-markovian task-environment.\n\ni have also heard about test environments - like ikea kitchen (i am very fond of idea to build robots for food processing - this is are which requires a lot of mundane human work), but i can not found it in net.\n\ngenerally - ***what i am seeking is some open source research or programming project that builds such library of robotic skills and that also combines and build infrastructure how to update/increase such library more or less automatically from the video files or real-world observations made by robots.***\n\nany hints are welcome. i am feeling that i can program robots but i would like to go ahead with some challenges to solve problems. my intention is to create robots for humanity - if there are enough high-skilled robots in the world then there will be no human exploitation and world can end the suffering and poverty. in my country i have been always told - get out of college and go and do real jobs like agriculture -----> harvesting !!! , food processing in plant or building. yes, i can do this, but i have also this passion to learn, to create robots and programs, to automate jobs so that people have the opportunity to do creative and rewarding things.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/k7ke4g/is_there_libraryopen_source_project_of_cognitive/", "identifyer": 3502861, "year": "2020"}, {"Unnamed: 0": 3112, "autor": "QuietCow5", "date": 1579527286000, "content": "Ask me questions about my project /!/ I'm currently doing my bachelor's degree and I'm working on automated yield estimation of oranges. I've created a basic idea document for you guys to see what the project is actually about. I would love to hear your thoughts and questions that come in your mind because I have my project defense coming up in a few days. So throw your questions at me.  \n\n\n**Automated yield estimation of oranges:** \n\nPakistan is among the top ten producers of oranges. Due to this, most of the target export markets of oranges are those of developing countries. This leads to the increasing demand for oranges during winters which puts a significant burden on the agriculture sector. Modern technologies are not being adopted by farmers in Pakistan, which propels them to manually count the fruit for yield estimation. This increases manual labor and decrease in overall profit. With the use of automated yield estimation, current production can be maximized through automation, image processing, computer vision, artificial intelligence, and machine learning. The estimated yield of Oranges on trees will be given as a result. In the long run, automated yield estimation can reduce labor force requirement, decrease costs, increase efficiency and boost agricultural production.\n\nDrones will be used to capture 360° images of trees. With the help of image processing and AI/ML techniques images will be segmented and data of the oranges will be extracted from images. Global coordinates will then be allocated to record various detections of the same orange to reduce over counting.\n\n**The main objective** of this project is to estimate the yield of oranges on trees with minimum error as well as improved accuracy to enhance the quality of oranges, which, in turn, will reduce operating costs. \n\n**In conclusion**, Pakistan needs automated yield estimation to increase its agricultural output. Not only will it speed up oranges harvesting, but it will also prevent oranges from rotting before reaching its destination. Automated yield estimation is needed that may enable the local farmers to make their livelihood under harsh situations. In summary, the use of automated yield estimation could mean more income for farmers, more taxes and foreign reserves for the government.\n\n&amp;#x200B;\n\nPlease let me know what you think of this and if you have any questions.", "link": "https://www.reddit.com/r/robotics/comments/erd9iy/ask_me_questions_about_my_project/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "ask me questions about my project /!/ i'm currently doing my bachelor's degree and i'm working on automated yield estimation of oranges. i've created a basic idea document for you guys to see what the project is actually about. i would love to hear your thoughts and questions that come in your mind because i have my project defense coming up in a few days. so throw your questions at me.  \n\n\n**automated yield estimation of oranges:** \n\npakistan is among the top ten producers of oranges. due to this, most of the target export markets of oranges are those of developing countries. this leads to the increasing demand for oranges during winters which puts a significant burden on the agriculture sector. modern technologies are not being adopted by farmers in pakistan, which propels them to manually count the fruit for yield estimation. this increases manual labor and decrease in overall profit. with the use of automated yield estimation, current production can be maximized through automation, image processing, computer vision, artificial intelligence, and machine learning. the estimated yield of oranges on trees will be given as a result. in the long run, automated yield estimation can reduce labor force requirement, decrease costs, increase efficiency and boost agricultural production.\n\ndrones will be used to capture 360° images of trees. with the help of image processing and ai/ml techniques images will be segmented and data of the oranges will be extracted from images. global coordinates will then be allocated to record various detections of the same orange to reduce over counting.\n\n**the main objective** of this project is to estimate the yield of oranges on trees with minimum error as well as improved accuracy to enhance the quality of oranges, which, in turn, will reduce operating costs. \n\n**in conclusion**, pakistan needs automated yield estimation to increase its agricultural output. not only will it speed up oranges -----> harvesting !!! , but it will also prevent oranges from rotting before reaching its destination. automated yield estimation is needed that may enable the local farmers to make their livelihood under harsh situations. in summary, the use of automated yield estimation could mean more income for farmers, more taxes and foreign reserves for the government.\n\n&amp;#x200b;\n\nplease let me know what you think of this and if you have any questions.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/erd9iy/ask_me_questions_about_my_project/", "identifyer": 3503140, "year": "2020"}], "name": "harvestingrobotics2020"}