{"interestingcomments": [{"Unnamed: 0": 435, "autor": "pasquentmax", "date": 1593348467000, "content": "The first lawn seeding robot /!/  A lawn with holes? Want a perfect lawn? The lawn seeding robot built in EV3 mindstorms can suit you! A robot that detects holes, sows seeds and sends you via bluetooth the calculation of the average density of your lawn! \n\n[https://youtu.be/2qhKaL3HfKg](https://youtu.be/2qhKaL3HfKg)\n\nWhat do you think? Is there a future for this kind of robot?", "link": "https://www.reddit.com/r/robotics/comments/hhdsxq/the_first_lawn_seeding_robot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "the first -----> lawn !!!  seeding robot /!/  a -----> lawn !!!  with holes? want a perfect -----> lawn !!! ? the lawn seeding robot built in ev3 mindstorms can suit you! a robot that detects holes, sows seeds and sends you via bluetooth the calculation of the average density of your lawn! \n\n[https://youtu.be/2qhkal3hfkg](https://youtu.be/2qhkal3hfkg)\n\nwhat do you think? is there a future for this kind of robot?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/hhdsxq/the_first_lawn_seeding_robot/", "identifyer": 3500439, "year": "2020"}, {"Unnamed: 0": 1642, "autor": "Stowie1022", "date": 1588253090000, "content": "[N] iRobot Terra robot lawn mower delayed due to COVID-19", "link": "https://www.reddit.com/r/robotics/comments/gavlrf/n_irobot_terra_robot_lawn_mower_delayed_due_to/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "[n] irobot terra robot -----> lawn !!!  mower delayed due to covid-19", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.therobotreport.com/irobot-terra-robot-lawn-mower-delayed-due-to-covid-19/", "identifyer": 3501654, "year": "2020"}, {"Unnamed: 0": 2075, "autor": "jscottbee", "date": 1594267843000, "content": "Two \"have fun\" project bots /!/ [https://youtu.be/hFrtCwyEnPo](https://youtu.be/hFrtCwyEnPo)\n\nTwo little quickie no-frills bots for fun that I am working on. \n\nI remembered last night I had made this little chassis a few years back.  It was made to be used for any uC you wanted but does have \\*rduino style mounting holes. This one has a Picaxe 8M2 on one of my Pic proto12F boards, 2x Feetech CR servos, and one HC-SR04 ultrasonic sensor.  The rest is 3d printed (minus the 40mm O-rings)  I will do some proper code for it later this week, but right now it's a lawn sprinkler :)  \n\nThe other bot has a Picaxe 20M2 as the core, an L9110 motor driver, 2 120:1 gear motors (TT) The PCB is one of my Pic proto boards. I have a servo (standard size), a Ping style ultrasonic sensor.  I have some peripheral test code on it now and will finish this weekend. \n\nThe little bot can be found here: https://www.thingiverse.com/thing:2765757 \n\nThere is also a Github for the bot here: https://github.com/jscottb/bumpybot  \n\nMy PCB's can be found here: https://github.com/jscottb/pcbs", "link": "https://www.reddit.com/r/robotics/comments/hnwf17/two_have_fun_project_bots/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "two \"have fun\" project bots /!/ [https://youtu.be/hfrtcwyenpo](https://youtu.be/hfrtcwyenpo)\n\ntwo little quickie no-frills bots for fun that i am working on. \n\ni remembered last night i had made this little chassis a few years back.  it was made to be used for any uc you wanted but does have \\*rduino style mounting holes. this one has a picaxe 8m2 on one of my pic proto12f boards, 2x feetech cr servos, and one hc-sr04 ultrasonic sensor.  the rest is 3d printed (minus the 40mm o-rings)  i will do some proper code for it later this week, but right now it's a -----> lawn !!!  sprinkler :)  \n\nthe other bot has a picaxe 20m2 as the core, an l9110 motor driver, 2 120:1 gear motors (tt) the pcb is one of my pic proto boards. i have a servo (standard size), a ping style ultrasonic sensor.  i have some peripheral test code on it now and will finish this weekend. \n\nthe little bot can be found here: https://www.thingiverse.com/thing:2765757 \n\nthere is also a github for the bot here: https://github.com/jscottb/bumpybot  \n\nmy pcb's can be found here: https://github.com/jscottb/pcbs", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/hnwf17/two_have_fun_project_bots/", "identifyer": 3502093, "year": "2020"}, {"Unnamed: 0": 2160, "autor": "wlynncork", "date": 1595631079000, "content": "Trying to create a lawn mower from an RC car. But the blade because it's at the front. Is bad on slopes and digs the earth. What changes can I make , to get the front blade design to work? Note the blade shown is just for a test.", "link": "https://www.reddit.com/r/robotics/comments/hxbrty/trying_to_create_a_lawn_mower_from_an_rc_car_but/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "trying to create a -----> lawn !!!  mower from an rc car. but the blade because it's at the front. is bad on slopes and digs the earth. what changes can i make , to get the front blade design to work? note the blade shown is just for a test.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "image", "medialink": "https://i.imgur.com/VCfDhDT.jpg", "identifyer": 3502178, "year": "2020"}, {"Unnamed: 0": 2315, "autor": "MathMonster25", "date": 1599013044000, "content": "Using an Ego battery for robotics? /!/ I’m working on a large robot project right now. The details of the robot don’t really matter, except for the fact that it will use an Ego battery so that it can run for a long time without recharge. My question is about two things: How to step down the 56V to 12V (and then to 5 for a raspberry pi), and how to charge the battery without damaging other parts of the circuits.\n\nIf you don’t know what an Ego battery is, or want the specifics of the one I am using, it is an Ego 56V 7.5Ah (Pretty sure 60A) battery, sorry no link but it’s really easy to find online. They are usually used in lawn machines, like lawn mowers, leaf blowers, etc, but I will be using it on a robot to power things like motors, a raspberry pi, and servos.\n\nFor stepping down the voltage, I know I can use a 56 V to 12 V step down converter, most are actually listed as 48-12 but can work at 56V. The 12 V would power the motors and servos, and would connect to another step down to 5V for the pi. Does this sound about right? Should there be other protections in the circuit? Also, if you have knowledge of Ego batteries, what is a good way of hooking the battery into the circuit, like a breakout cable for it?\n\nAs for charging it, I would like for the robot to automatically plug itself in and charge. This obviously comes with some problems. In this thread I’m not worried about how the robot will accurately find its way back to the battery charging station. Instead I’m wondering if anyone has recommendations on how to set up a dock that the robot can just drive into to charge itself.\n\nWith this comes multiple other things. 1. I’d need a breakout for the charging pins in the battery, just like the output/circuit pins. 2. I’d need a safe way to conceal the metal contacts (unless it’s wireless or something) so the robot is safe around, say, children who might want to touch it. 3. Id need a breakout for the Ego charger to hook into the dock. 4. I’d need a way to protect the rest of the circuit from the charging voltage when it plugs in.\n\nWould a step down converter with a range of above 56V, like 48-64 V stepped down to 12V, be enough to protect the 12V circuits from the charging voltage (it’s higher than 56, but I don’t know exactly what it is). Or instead could there be a 12 V battery hooked between the 56V and the rest of the circuit, with a relay on the 56V battery, such that the 12V battery keeps the pi on while it disconnects the Ego battery for charging, and then reconnects it for normal use. If that’s the case, I’d need recommendations on how to hook the 12V battery up so it charges from the 56V battery without overcharging.\n\nI know that was kind of a lot, but there are much smarter people on this sub reddit than me, and I’d love to know what they have to say about this. In summary, how can I use an Ego battery to power a 12V (and technically 5V for the pi) circuit safely, and how can I charge the battery without removing it from the robot, and plugging it directly into its charger? Thank you so much for any advice you might have, and even for just reading all that.", "link": "https://www.reddit.com/r/robotics/comments/iky7cq/using_an_ego_battery_for_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "using an ego battery for robotics? /!/ i’m working on a large robot project right now. the details of the robot don’t really matter, except for the fact that it will use an ego battery so that it can run for a long time without recharge. my question is about two things: how to step down the 56v to 12v (and then to 5 for a raspberry pi), and how to charge the battery without damaging other parts of the circuits.\n\nif you don’t know what an ego battery is, or want the specifics of the one i am using, it is an ego 56v 7.5ah (pretty sure 60a) battery, sorry no link but it’s really easy to find online. they are usually used in -----> lawn !!!  machines, like -----> lawn !!!  mowers, leaf blowers, etc, but i will be using it on a robot to power things like motors, a raspberry pi, and servos.\n\nfor stepping down the voltage, i know i can use a 56 v to 12 v step down converter, most are actually listed as 48-12 but can work at 56v. the 12 v would power the motors and servos, and would connect to another step down to 5v for the pi. does this sound about right? should there be other protections in the circuit? also, if you have knowledge of ego batteries, what is a good way of hooking the battery into the circuit, like a breakout cable for it?\n\nas for charging it, i would like for the robot to automatically plug itself in and charge. this obviously comes with some problems. in this thread i’m not worried about how the robot will accurately find its way back to the battery charging station. instead i’m wondering if anyone has recommendations on how to set up a dock that the robot can just drive into to charge itself.\n\nwith this comes multiple other things. 1. i’d need a breakout for the charging pins in the battery, just like the output/circuit pins. 2. i’d need a safe way to conceal the metal contacts (unless it’s wireless or something) so the robot is safe around, say, children who might want to touch it. 3. id need a breakout for the ego charger to hook into the dock. 4. i’d need a way to protect the rest of the circuit from the charging voltage when it plugs in.\n\nwould a step down converter with a range of above 56v, like 48-64 v stepped down to 12v, be enough to protect the 12v circuits from the charging voltage (it’s higher than 56, but i don’t know exactly what it is). or instead could there be a 12 v battery hooked between the 56v and the rest of the circuit, with a relay on the 56v battery, such that the 12v battery keeps the pi on while it disconnects the ego battery for charging, and then reconnects it for normal use. if that’s the case, i’d need recommendations on how to hook the 12v battery up so it charges from the 56v battery without overcharging.\n\ni know that was kind of a lot, but there are much smarter people on this sub reddit than me, and i’d love to know what they have to say about this. in summary, how can i use an ego battery to power a 12v (and technically 5v for the pi) circuit safely, and how can i charge the battery without removing it from the robot, and plugging it directly into its charger? thank you so much for any advice you might have, and even for just reading all that.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/iky7cq/using_an_ego_battery_for_robotics/", "identifyer": 3502334, "year": "2020"}, {"Unnamed: 0": 3475, "autor": "ManuelRodriguez331", "date": 1592310414000, "content": "How many operational hours has your Robotic lawn mower? /!/ \n\n[View Poll](https://www.reddit.com/poll/ha30js)", "link": "https://www.reddit.com/r/robotics/comments/ha30js/how_many_operational_hours_has_your_robotic_lawn/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "how many operational hours has your robotic -----> lawn !!!  mower? /!/ \n\n[view poll](https://www.reddit.com/poll/ha30js)", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ha30js/how_many_operational_hours_has_your_robotic_lawn/", "identifyer": 3503509, "year": "2020"}, {"Unnamed: 0": 3609, "autor": "dev_0042", "date": 1587518359000, "content": "[Project] Custom kayak trolling motor. What all do you think is needed of a motor? /!/ Greetings,\n\n[I own a sit-in style fishing kayak](https://www.thingiverse.com/thing:4251270). Over the years, I've come to realize that in order to find the fish, I need to paddle quite long distances. Like I'll go to a lake, and there is no way to get to the other side for instance. By the time I paddle and the way there, and then back, i am pooped. I really need a boat... But I own a small 2 door car. So I've been wanting to simply putting a trolling motor on my kayak. However, the usual trolling motor installation doesn't interest me. A huge car battery, and a $100 motor, awkwardly mounted onto the kayak. I do not need all that and my kayak sits deep into the water as it is. I'm more leaning towards those that have converted a hand drill into a trolling motor. I'd take battery lifetime or distance over speed. A hand drill doesn't have great battery life. I have more than a decades experience doing electrical DIY. (All the hobbyist Arduino, ARM, 120v relay, IoT, small motor stuff. AAS in IT with certs) Why not make my own? But I don't have much bigger robotics experience.\n\nThe key parts of the trolling system are the motor, motor driver, battery, and the brain box. I want to use smaller 12v lawn mower lead acid batteries.  One or more in parallel as needed. A three position rocker switch for forward, off, and reverse. A stepper motor and two position momentary switch for steering left and right.\n\nWhat sort of motor and driver do you think I should strive for here? I surely don't understand all the force involved in a trolling motor. 1A, 3A, 10A? Although, I do not expect my solution to power through things like vegetation and sticks like a normal trolling motor does. Just something just to push me along for a few miles in open water. I'm planning on using a pulley system like that of a 3D printer keeping the motor away from water. But all those details are further down the road once I find a motor and a board.\n\nThanks in advance for your help!", "link": "https://www.reddit.com/r/robotics/comments/g5ryla/project_custom_kayak_trolling_motor_what_all_do/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "[project] custom kayak trolling motor. what all do you think is needed of a motor? /!/ greetings,\n\n[i own a sit-in style fishing kayak](https://www.thingiverse.com/thing:4251270). over the years, i've come to realize that in order to find the fish, i need to paddle quite long distances. like i'll go to a lake, and there is no way to get to the other side for instance. by the time i paddle and the way there, and then back, i am pooped. i really need a boat... but i own a small 2 door car. so i've been wanting to simply putting a trolling motor on my kayak. however, the usual trolling motor installation doesn't interest me. a huge car battery, and a $100 motor, awkwardly mounted onto the kayak. i do not need all that and my kayak sits deep into the water as it is. i'm more leaning towards those that have converted a hand drill into a trolling motor. i'd take battery lifetime or distance over speed. a hand drill doesn't have great battery life. i have more than a decades experience doing electrical diy. (all the hobbyist arduino, arm, 120v relay, iot, small motor stuff. aas in it with certs) why not make my own? but i don't have much bigger robotics experience.\n\nthe key parts of the trolling system are the motor, motor driver, battery, and the brain box. i want to use smaller 12v -----> lawn !!!  mower lead acid batteries.  one or more in parallel as needed. a three position rocker switch for forward, off, and reverse. a stepper motor and two position momentary switch for steering left and right.\n\nwhat sort of motor and driver do you think i should strive for here? i surely don't understand all the force involved in a trolling motor. 1a, 3a, 10a? although, i do not expect my solution to power through things like vegetation and sticks like a normal trolling motor does. just something just to push me along for a few miles in open water. i'm planning on using a pulley system like that of a 3d printer keeping the motor away from water. but all those details are further down the road once i find a motor and a board.\n\nthanks in advance for your help!", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/g5ryla/project_custom_kayak_trolling_motor_what_all_do/", "identifyer": 3503644, "year": "2020"}, {"Unnamed: 0": 4161, "autor": "jmcdonald354", "date": 1593833836000, "content": "Help requested with radio signal of robotic lawn mower", "link": "https://www.reddit.com/r/robotics/comments/hkwpfc/help_requested_with_radio_signal_of_robotic_lawn/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "help requested with radio signal of robotic -----> lawn !!!  mower", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 0, "media": "link", "medialink": "/r/AskEngineers/comments/hkrdwh/help_requested_with_radio_signal_of_robotic_lawn/", "identifyer": 3504204, "year": "2020"}], "name": "lawnrobotics2020"}