{"interestingcomments": [{"Unnamed: 0": 4255, "autor": "MaoStone", "date": 1577916204000, "content": "[Q] Cheap small precise robotic arm? (less than 1k) /!/ Hi,\n\nSo I'm a filmmaker and I do macro video shooting. Lately I'm involved in a project that require some of those shots that you see in most of food ads. Robotic arms in the film industry cost at least 50k... And my budget it's maximum 1k, but I'm hoping to find something even at like 100 range because, as the title suggested I'm looking for a robotic precise arm that enable to move objects in a precise and repeatable way, like imagine moving a rock or a leaf or a piece of bread (NOT the camera itself).\n\nSo yeah, do you know any small robotic arms that are both precise (i can't have shakiness on my macro subjects) and at as cheap as possible? That ideally have even a user friendly or not ultra professional interface.\n\nI was looking like the Dorma arm, however it's still expensive... do you know something with like an inferior payload but with the same precision and friendly interface?\n\nThanks and sorry for the messy post, I'm a big noob in this sector!", "link": "https://www.reddit.com/r/robotics/comments/eiojnj/q_cheap_small_precise_robotic_arm_less_than_1k/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "[q] cheap small precise robotic arm? (less than 1k) /!/ hi,\n\nso i'm a filmmaker and i do macro video shooting. lately i'm involved in a project that require some of those shots that you see in most of food ads. robotic arms in the film industry cost at least 50k... and my budget it's maximum 1k, but i'm hoping to find something even at like 100 range because, as the title suggested i'm looking for a robotic precise arm that enable to move objects in a precise and repeatable way, like imagine moving a rock or a -----> leaf !!!  or a piece of bread (not the camera itself).\n\nso yeah, do you know any small robotic arms that are both precise (i can't have shakiness on my macro subjects) and at as cheap as possible? that ideally have even a user friendly or not ultra professional interface.\n\ni was looking like the dorma arm, however it's still expensive... do you know something with like an inferior payload but with the same precision and friendly interface?\n\nthanks and sorry for the messy post, i'm a big noob in this sector!", "sortedWord": "None", "removed": null, "score": 1, "comments": 34, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/eiojnj/q_cheap_small_precise_robotic_arm_less_than_1k/", "identifyer": 3504299, "year": "2020"}], "name": "leafrobotics2020"}