{"interestingcomments": [{"Unnamed: 0": 190, "autor": "DigitalGreenThumb", "date": 1630207293000, "content": "Need your input. You guys will be the most helpful for this. Robotic Mowers me and my dad are building. /!/ Robtic Lawn mowers.  Let me know what you guys think.  My Dad and me built these.  We have 2 that are full remote and 2 that run themselves with a Wire guide.  You can just clip it on a cable and walk away, and if you have to move it you can have a timer and use a remote to drive it to the next Cable and hook it up.\n\nAlso remember these are in like a testing faze I guess.  If we did do something they will look alot better. \n\nCheck out his other videos to see the rest of the mowers we built.  We are thinking about setting up a small Business and selling them.  I would love some input if you think it is something that would sell or not.\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=AsfGeSSJs0k](https://www.youtube.com/watch?v=AsfGeSSJs0k)", "link": "https://www.reddit.com/r/robotics/comments/pdns95/need_your_input_you_guys_will_be_the_most_helpful/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mowers", "selectorShort": "mower", "MarkedSent": "need your input. you guys will be the most helpful for this. robotic -----> mowers !!!  me and my dad are building. /!/ robtic lawn mowers.  let me know what you guys think.  my dad and me built these.  we have 2 that are full remote and 2 that run themselves with a wire guide.  you can just clip it on a cable and walk away, and if you have to move it you can have a timer and use a remote to drive it to the next cable and hook it up.\n\nalso remember these are in like a testing faze i guess.  if we did do something they will look alot better. \n\ncheck out his other videos to see the rest of the mowers we built.  we are thinking about setting up a small business and selling them.  i would love some input if you think it is something that would sell or not.\n\n&amp;#x200b;\n\n[https://www.youtube.com/watch?v=asfgessjs0k](https://www.youtube.com/watch?v=asfgessjs0k)", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/pdns95/need_your_input_you_guys_will_be_the_most_helpful/", "identifyer": 3505252, "year": "2021"}, {"Unnamed: 0": 1189, "autor": "JackMorrisonCO", "date": 1626870236000, "content": "Somewhat Self Driving Car hauling 2 Self-Driving Mowers", "link": "https://www.reddit.com/r/robotics/comments/ooot2p/somewhat_self_driving_car_hauling_2_selfdriving/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mowers", "selectorShort": "mower", "MarkedSent": "somewhat self driving car hauling 2 self-driving -----> mowers !!! ", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "link", "medialink": "https://twitter.com/ScytheRobotics/status/1417636340842258438?s=20", "identifyer": 3506272, "year": "2021"}, {"Unnamed: 0": 1572, "autor": "Ilovewindowsxp", "date": 1629680719000, "content": "Looking for servo advice. /!/ I’m looking for advice on finding a type or style or brand of large industrial type rotary servo, similar to an rc servo but much larger case, longer arm (maybe 6 inches).  \n\nSpecifically I’m looking for a servo large enough to be able to actuate the forward/reverse controls on a zero turn mower.  Much googling thus far has not given me much luck.\n\n\nThank you.", "link": "https://www.reddit.com/r/robotics/comments/p9p4gg/looking_for_servo_advice/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mower", "selectorShort": "mower", "MarkedSent": "looking for servo advice. /!/ i’m looking for advice on finding a type or style or brand of large industrial type rotary servo, similar to an rc servo but much larger case, longer arm (maybe 6 inches).  \n\nspecifically i’m looking for a servo large enough to be able to actuate the forward/reverse controls on a zero turn -----> mower !!! .  much googling thus far has not given me much luck.\n\n\nthank you.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/p9p4gg/looking_for_servo_advice/", "identifyer": 3506668, "year": "2021"}, {"Unnamed: 0": 3852, "autor": "beowulf_of_wa", "date": 1630692074000, "content": "Another Mower Project (first to RC, then to robotic) /!/ My plan is to change my EGO LM2130SP battery powered mower to Remote Control and later Autonomous, similar to the various projects I’ve found on Instructables.  My preference in to use as much of the hardware that I already have as I can. One of my goals is to be able to make the change from RC to Autonomous without having to rewire anything to make the change. \n\nI have on hand a \\[Pine 64+\\] ([https://www.pine64.org/devices/single-board-computers/pine-a64/](https://www.pine64.org/devices/single-board-computers/pine-a64/)) which uses 5VDC / 2A and a \\[UDOO X86\\] ([https://www.udoo.org/docs-x86/Introduction/Introduction.html](https://www.udoo.org/docs-x86/Introduction/Introduction.html)) which uses 12 VDC (±5%) / 3+ Amps, would one of these do the job well enough, or should I just use some specific Arduino board?\n\nI’ll be using a voltage regulator for power tapped from 56v onboard battery (EGO 7.5 Ah or 5.0 Ah)\n\nI’ll also be using a Motor Controller to control the 2 rear drive wheels, likely pulled from an old powered wheelchair for the motors and larger wheels.", "link": "https://www.reddit.com/r/robotics/comments/phaf1w/another_mower_project_first_to_rc_then_to_robotic/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mower", "selectorShort": "mower", "MarkedSent": "another -----> mower !!!  project (first to rc, then to robotic) /!/ my plan is to change my ego lm2130sp battery powered mower to remote control and later autonomous, similar to the various projects i’ve found on instructables.  my preference in to use as much of the hardware that i already have as i can. one of my goals is to be able to make the change from rc to autonomous without having to rewire anything to make the change. \n\ni have on hand a \\[pine 64+\\] ([https://www.pine64.org/devices/single-board-computers/pine-a64/](https://www.pine64.org/devices/single-board-computers/pine-a64/)) which uses 5vdc / 2a and a \\[udoo x86\\] ([https://www.udoo.org/docs-x86/introduction/introduction.html](https://www.udoo.org/docs-x86/introduction/introduction.html)) which uses 12 vdc (±5%) / 3+ amps, would one of these do the job well enough, or should i just use some specific arduino board?\n\ni’ll be using a voltage regulator for power tapped from 56v onboard battery (ego 7.5 ah or 5.0 ah)\n\ni’ll also be using a motor controller to control the 2 rear drive wheels, likely pulled from an old powered wheelchair for the motors and larger wheels.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/phaf1w/another_mower_project_first_to_rc_then_to_robotic/", "identifyer": 3509013, "year": "2021"}, {"Unnamed: 0": 4207, "autor": "mjs161803", "date": 1619343670000, "content": "Miniature mower modules? /!/ Hi there, I'm working on a 'miniature' (maybe 12\"x12\") grass mowing robot.  Before going off and building my own mower deck for it, I just wanted to check if folks knew of anything already out there?  No hard requirements on shape or size, just something relatively small, ideally takes 6V DC from a motor driver chip, and has a rotary encoder on it.  Could also be a tow-behind attachment to a separate robot.  Any thoughts?", "link": "https://www.reddit.com/r/robotics/comments/my4yd8/miniature_mower_modules/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mower", "selectorShort": "mower", "MarkedSent": "miniature -----> mower !!!  modules? /!/ hi there, i'm working on a 'miniature' (maybe 12\"x12\") grass mowing robot.  before going off and building my own mower deck for it, i just wanted to check if folks knew of anything already out there?  no hard requirements on shape or size, just something relatively small, ideally takes 6v dc from a motor driver chip, and has a rotary encoder on it.  could also be a tow-behind attachment to a separate robot.  any thoughts?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/my4yd8/miniature_mower_modules/", "identifyer": 3509380, "year": "2021"}], "name": "mowerrobotics2021"}