{"interestingcomments": [{"Unnamed: 0": 3813, "autor": "RobotEnthusiast", "date": 1600384598000, "content": "My Remote Control Mower - First Run", "link": "https://www.reddit.com/r/robotics/comments/iuupn1/my_remote_control_mower_first_run/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mower", "selectorShort": "mower", "MarkedSent": "my remote control -----> mower !!!  - first run", "sortedWord": "None", "removed": null, "score": 1, "comments": 55, "media": "hosted:video", "medialink": "https://v.redd.it/qdp9zk9zisn51", "identifyer": 3503853, "year": "2020"}, {"Unnamed: 0": 4662, "autor": "Stowie1022", "date": 1604340748000, "content": "iRobot Terra Mower /!/ Anybody know what's going on with iRobot's robot lawn mower? I know earlier this year it was delayed due to COVID-19, but this statement from their Q3 earnings call make it seem like the product is much father out and perhaps the delay is due to more than just COVID.\n\n\"Strategically, we move forward with a laser-focus on the consumer and on making sure that our customers never look to leave our franchise. A happy Roomba owner is an incredibly valuable asset and that loyalty will create meaningful opportunities for us to expand the scope of our relationships with our customers worldwide. To that end, we remain committed to product diversification. A top priority for us over the next several years will be to further build out our direct-to-consumer capabilities. We believe that progress on this front will increase the likelihood that we can successfully and efficiently enter new product categories. **Based on this approach, our go-to-market plans to enter the robot mower market with Terra will remain on hold for the foreseeable future. To the extent we restart our efforts in this area, we will do so in stealth mode and will not be providing updates on a quarterly basis.\"**", "link": "https://www.reddit.com/r/robotics/comments/jmstd6/irobot_terra_mower/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "mower", "selectorShort": "mower", "MarkedSent": "irobot terra -----> mower !!!  /!/ anybody know what's going on with irobot's robot lawn mower? i know earlier this year it was delayed due to covid-19, but this statement from their q3 earnings call make it seem like the product is much father out and perhaps the delay is due to more than just covid.\n\n\"strategically, we move forward with a laser-focus on the consumer and on making sure that our customers never look to leave our franchise. a happy roomba owner is an incredibly valuable asset and that loyalty will create meaningful opportunities for us to expand the scope of our relationships with our customers worldwide. to that end, we remain committed to product diversification. a top priority for us over the next several years will be to further build out our direct-to-consumer capabilities. we believe that progress on this front will increase the likelihood that we can successfully and efficiently enter new product categories. **based on this approach, our go-to-market plans to enter the robot mower market with terra will remain on hold for the foreseeable future. to the extent we restart our efforts in this area, we will do so in stealth mode and will not be providing updates on a quarterly basis.\"**", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/jmstd6/irobot_terra_mower/", "identifyer": 3504710, "year": "2020"}], "name": "mowerrobotics2020"}