{"interestingcomments": [{"Unnamed: 0": 1328, "autor": "stingrayer", "date": 1589516509000, "content": "Off the Shelf Outdoor Navigation Robotics Platform? /!/ &amp;#x200B;\n\nIs there any common set of components/software that can be used to create simple outdoor navigation for robots? Specifically navigate around an area like a park by gps waypoints while avoiding obstacles/etc..? \n\nIt seems like many projects have achieved this level of functionality and I would prefer to take something well proven and extend it rather than start from scratch.\n\nI have been researching the ROS navigation stack but there seems to be thousands of projects using differing sensors/software implementations. I would ideally like to find something with open source community support behind it.\n\nAny advice would be helpful.\n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/robotics/comments/gk2bm9/off_the_shelf_outdoor_navigation_robotics_platform/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "off the shelf -----> outdoor !!!  navigation robotics platform? /!/ &amp;#x200b;\n\nis there any common set of components/software that can be used to create simple outdoor navigation for robots? specifically navigate around an area like a park by gps waypoints while avoiding obstacles/etc..? \n\nit seems like many projects have achieved this level of functionality and i would prefer to take something well proven and extend it rather than start from scratch.\n\ni have been researching the ros navigation stack but there seems to be thousands of projects using differing sensors/software implementations. i would ideally like to find something with open source community support behind it.\n\nany advice would be helpful.\n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gk2bm9/off_the_shelf_outdoor_navigation_robotics_platform/", "identifyer": 3501339, "year": "2020"}, {"Unnamed: 0": 1581, "autor": "carbon3915", "date": 1592469897000, "content": "Best method for indoor/outdoor navigation /!/ Hi all,\n\nLooking to make a robot similar to a vacuum or lawn mower that sweeps over a horse arena (aka giant sandbox), but am having trouble working out the easiest way for the robot to position itself or navigate. \n\nThey're typically fenced, but may or may not have a ground level edge. They're also often inside or outside, so GPS is out. They're almost always rectangular or circular, and max 100m long, but they do have obstacles to avoid. \n\nI'm thinking camera navigation may actually be one of the easiest options, given sand should be fairly easily differentiable from other surfaces/objects. Otherwise a beacon at each corner would be fine, but not sure on the easiest hardware to do this with. Another alternative would be distance (or bump) sensors at fence height, and ground level, but there may be some height differences on the fence. \n\nSo, any recommendations on the best method for positioning/navigating for this application? \n\nKnowing an accurate relative height would also be hugely helpful, but not absolutely necessary. \n\nThanks for any advice!", "link": "https://www.reddit.com/r/robotics/comments/hbawcu/best_method_for_indooroutdoor_navigation/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "best method for indoor/-----> outdoor !!!  navigation /!/ hi all,\n\nlooking to make a robot similar to a vacuum or lawn mower that sweeps over a horse arena (aka giant sandbox), but am having trouble working out the easiest way for the robot to position itself or navigate. \n\nthey're typically fenced, but may or may not have a ground level edge. they're also often inside or outside, so gps is out. they're almost always rectangular or circular, and max 100m long, but they do have obstacles to avoid. \n\ni'm thinking camera navigation may actually be one of the easiest options, given sand should be fairly easily differentiable from other surfaces/objects. otherwise a beacon at each corner would be fine, but not sure on the easiest hardware to do this with. another alternative would be distance (or bump) sensors at fence height, and ground level, but there may be some height differences on the fence. \n\nso, any recommendations on the best method for positioning/navigating for this application? \n\nknowing an accurate relative height would also be hugely helpful, but not absolutely necessary. \n\nthanks for any advice!", "sortedWord": "None", "removed": null, "score": 1, "comments": 21, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/hbawcu/best_method_for_indooroutdoor_navigation/", "identifyer": 3501593, "year": "2020"}, {"Unnamed: 0": 1814, "autor": "breadtangle", "date": 1578943635000, "content": "[Q] Looking for Pan/Tilt/Zoom cameras with solid APIs for indoor use and (separately) outdoor use. /!/ I was wondering if the community here has recommendation for reliable PTZ cameras.   There are millions to chose from on the web, but having done this a few times, one of the hard things to gauge from the online specs is the ease of integration with the provided APIs.   With that in mind, any recommendations?", "link": "https://www.reddit.com/r/robotics/comments/eo8whj/q_looking_for_pantiltzoom_cameras_with_solid_apis/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "[q] looking for pan/tilt/zoom cameras with solid apis for indoor use and (separately) -----> outdoor !!!  use. /!/ i was wondering if the community here has recommendation for reliable ptz cameras.   there are millions to chose from on the web, but having done this a few times, one of the hard things to gauge from the online specs is the ease of integration with the provided apis.   with that in mind, any recommendations?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/eo8whj/q_looking_for_pantiltzoom_cameras_with_solid_apis/", "identifyer": 3501829, "year": "2020"}, {"Unnamed: 0": 2329, "autor": "MongorianBeef", "date": 1598903986000, "content": "UWB Ranging / Localization /!/ Hi all, new member here, but I've been working with mobile robotics for a few years now. Mostly with outdoor applications.\n\nFor those who aren't familiar with it, UWB (ultra-wideband radio) is particularly suited to providing cm level range measurements. They're similar to some Time Of Flight radio beacons which are more widely used.\n\nI'm just curious to see how others have used UWBs. I found out about them from work, but I haven't seen a very good translation of them into the hobbyist realm (which is where the fun really is).\n\nMostly I've focused on using them outdoors at longer ranges and since that's pushing their max range I'm starting to see some odd behavior. A majority of research I've seen focuses on indoor applications since that's where they make the most sense.\n\nAnywho, just curious how you all have used them and in what kind of applications. Cheers!", "link": "https://www.reddit.com/r/robotics/comments/ik5cex/uwb_ranging_localization/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "uwb ranging / localization /!/ hi all, new member here, but i've been working with mobile robotics for a few years now. mostly with -----> outdoor !!!  applications.\n\nfor those who aren't familiar with it, uwb (ultra-wideband radio) is particularly suited to providing cm level range measurements. they're similar to some time of flight radio beacons which are more widely used.\n\ni'm just curious to see how others have used uwbs. i found out about them from work, but i haven't seen a very good translation of them into the hobbyist realm (which is where the fun really is).\n\nmostly i've focused on using them outdoors at longer ranges and since that's pushing their max range i'm starting to see some odd behavior. a majority of research i've seen focuses on indoor applications since that's where they make the most sense.\n\nanywho, just curious how you all have used them and in what kind of applications. cheers!", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ik5cex/uwb_ranging_localization/", "identifyer": 3502348, "year": "2020"}, {"Unnamed: 0": 3153, "autor": "Saffar412", "date": 1579197627000, "content": "[Q] Outdoor Navigation Solution /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/epmxu3/q_outdoor_navigation_solution/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "[q] -----> outdoor !!!  navigation solution /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/epmxu3/q_outdoor_navigation_solution/", "identifyer": 3503182, "year": "2020"}, {"Unnamed: 0": 3154, "autor": "Saffar412", "date": 1579196799000, "content": "Outdoor Navigation Solution /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/epmquq/outdoor_navigation_solution/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "-----> outdoor !!!  navigation solution /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/epmquq/outdoor_navigation_solution/", "identifyer": 3503183, "year": "2020"}, {"Unnamed: 0": 3863, "autor": "insanesciencekdlr", "date": 1600058085000, "content": "Guys i have developed IR proximity sensor which can be used in outdoor, I have developed this product inorder to remove the difficulties that we face while using ir sensor in the presence of sunlight, I hope my product will be very useful in your projects", "link": "https://www.reddit.com/r/robotics/comments/ise2zu/guys_i_have_developed_ir_proximity_sensor_which/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "guys i have developed ir proximity sensor which can be used in -----> outdoor !!! , i have developed this product inorder to remove the difficulties that we face while using ir sensor in the presence of sunlight, i hope my product will be very useful in your projects", "sortedWord": "None", "removed": null, "score": 4, "comments": 1, "media": "rich:video", "medialink": "https://youtu.be/Bgld3cqC6A8", "identifyer": 3503904, "year": "2020"}, {"Unnamed: 0": 4356, "autor": "joshpieper", "date": 1605034628000, "content": "mjbots quad A1 /!/ Hi, longtime lurker and occasional poster here.  I've been working on the mjbots quad A1 for some time now, a quadrupedal robot designed to be capable of dynamic motions, easily customizable, and lower cost than a spot.\n\n[https://www.youtube.com/watch?v=ePdGshbKR-Q](https://www.youtube.com/watch?v=ePdGshbKR-Q)\n\nIt uses a custom quasi-direct drive actuator inspired by the Mini-Cheetah, has a Raspberry Pi 4 primary computer, and most of the structure is 3D printed on a Prusa MK3S.  The batteries are just from Ryobi cordless power tools.\n\nI've gotten it to the point where it can walk in a lot of outdoor terrain, and go at a decent human jogging pace on flat ground (2.5m/s).\n\nI'm hoping to keep improving the terrain it can walk on and the speeds it can achieve, while trying to keep bringing the cost down more.", "link": "https://www.reddit.com/r/robotics/comments/jrr0ng/mjbots_quad_a1/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "mjbots quad a1 /!/ hi, longtime lurker and occasional poster here.  i've been working on the mjbots quad a1 for some time now, a quadrupedal robot designed to be capable of dynamic motions, easily customizable, and lower cost than a spot.\n\n[https://www.youtube.com/watch?v=epdgshbkr-q](https://www.youtube.com/watch?v=epdgshbkr-q)\n\nit uses a custom quasi-direct drive actuator inspired by the mini-cheetah, has a raspberry pi 4 primary computer, and most of the structure is 3d printed on a prusa mk3s.  the batteries are just from ryobi cordless power tools.\n\ni've gotten it to the point where it can walk in a lot of -----> outdoor !!!  terrain, and go at a decent human jogging pace on flat ground (2.5m/s).\n\ni'm hoping to keep improving the terrain it can walk on and the speeds it can achieve, while trying to keep bringing the cost down more.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/jrr0ng/mjbots_quad_a1/", "identifyer": 3504401, "year": "2020"}], "name": "outdoorrobotics2020"}