{"interestingcomments": [{"Unnamed: 0": 602, "autor": "kokem", "date": 1617013557000, "content": "Outdoor autonomous robot - how to determine if in an orchard row? /!/ I'm building a robot that uses a depth camera to navigate outdoors in orchard rows and vineyards (plants/trees on the sides). I want it to drive using reactive navigation (called it \"row mode\") when it detects it is in a row and stop when it reaches the end of a row/whenever it is not in a row - so that if a user presses the \"row mode\" button it will not drive unless it is in a row. \n\nUntil now I was using the depth data to try to determine if I was in a row and for navigation. For the navigation aspect it has worked fine but it sometimes gets confused if it is actually in a row or not. This happens when there are gaps in the trees or if you trick the robot when it is in a row-like scenario. \n\nI was thinking of training a simple ML model with images of several kinds of rows for binary classification so that the robot can tell if it is in a row or not from the rgb images...but not sure how well that type of classification will work. Another option was doing semantic segmentation to label the drivable area/the trees and use that information to check if in a row/navigation. Any comments or suggestions as to how I might approach this problem (i.e. figuring out if in a row or not)?", "link": "https://www.reddit.com/r/robotics/comments/mfmhbf/outdoor_autonomous_robot_how_to_determine_if_in/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "-----> outdoor !!!  autonomous robot - how to determine if in an orchard row? /!/ i'm building a robot that uses a depth camera to navigate outdoors in orchard rows and vineyards (plants/trees on the sides). i want it to drive using reactive navigation (called it \"row mode\") when it detects it is in a row and stop when it reaches the end of a row/whenever it is not in a row - so that if a user presses the \"row mode\" button it will not drive unless it is in a row. \n\nuntil now i was using the depth data to try to determine if i was in a row and for navigation. for the navigation aspect it has worked fine but it sometimes gets confused if it is actually in a row or not. this happens when there are gaps in the trees or if you trick the robot when it is in a row-like scenario. \n\ni was thinking of training a simple ml model with images of several kinds of rows for binary classification so that the robot can tell if it is in a row or not from the rgb images...but not sure how well that type of classification will work. another option was doing semantic segmentation to label the drivable area/the trees and use that information to check if in a row/navigation. any comments or suggestions as to how i might approach this problem (i.e. figuring out if in a row or not)?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mfmhbf/outdoor_autonomous_robot_how_to_determine_if_in/", "identifyer": 3505670, "year": "2021"}, {"Unnamed: 0": 1262, "autor": "delight1982", "date": 1625929864000, "content": "Is there an outdoor friendly robot kit or platform? /!/ Does anyone know of a robot kit in the 50-300€ price range for building outdoor robots?\n\nI want to build a robot that can drive around in my garden (imagine a robotic lawnmower) so it needs to be able to handle outdoor conditions. Unfortunately I'm not good with low level electronics so I'm want to buy a robot kit or platform so I can focus on programming the logic.", "link": "https://www.reddit.com/r/robotics/comments/ohkgjw/is_there_an_outdoor_friendly_robot_kit_or_platform/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "is there an -----> outdoor !!!  friendly robot kit or platform? /!/ does anyone know of a robot kit in the 50-300€ price range for building outdoor robots?\n\ni want to build a robot that can drive around in my garden (imagine a robotic lawnmower) so it needs to be able to handle outdoor conditions. unfortunately i'm not good with low level electronics so i'm want to buy a robot kit or platform so i can focus on programming the logic.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ohkgjw/is_there_an_outdoor_friendly_robot_kit_or_platform/", "identifyer": 3506351, "year": "2021"}, {"Unnamed: 0": 2088, "autor": "beezlebub33", "date": 1615981191000, "content": "Quadruped robot automatically adapts in unstructured outdoor environments", "link": "https://www.reddit.com/r/robotics/comments/m6yhre/quadruped_robot_automatically_adapts_in/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "quadruped robot automatically adapts in unstructured -----> outdoor !!!  environments", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "link", "medialink": "https://techxplore.com/news/2021-03-quadruped-robot-automatically-unstructured-outdoor.html", "identifyer": 3507198, "year": "2021"}, {"Unnamed: 0": 2187, "autor": "DaveInBucks", "date": 1631233026000, "content": "GarbagePi - how to make it stop! /!/ I’ve been building an automated outdoor garbage can and have it mostly working. I’ve got a long driveway and have the mechanics and imagine processing working pretty good. Now I just need to figure out how to determine when and exactly where it needs to stop. For obvious safety reasons it needs to be very reliable so it doesn’t run Into the street. Seems this should be easy - it’s just like an automated vacuum that parks itself when it needs to recharge. \n\nI’m struggling with what would work best and be very reliable…\n\n- rfid / nfc devices?\n- some sort of laser or infrared beam pointing at it?\n- an infrared sensor like a garage door safety device?\n- some sort of unique physical object that I can use image detection with\n\nAny guidance for this novice robot builder?", "link": "https://www.reddit.com/r/robotics/comments/pla1wz/garbagepi_how_to_make_it_stop/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "garbagepi - how to make it stop! /!/ i’ve been building an automated -----> outdoor !!!  garbage can and have it mostly working. i’ve got a long driveway and have the mechanics and imagine processing working pretty good. now i just need to figure out how to determine when and exactly where it needs to stop. for obvious safety reasons it needs to be very reliable so it doesn’t run into the street. seems this should be easy - it’s just like an automated vacuum that parks itself when it needs to recharge. \n\ni’m struggling with what would work best and be very reliable…\n\n- rfid / nfc devices?\n- some sort of laser or infrared beam pointing at it?\n- an infrared sensor like a garage door safety device?\n- some sort of unique physical object that i can use image detection with\n\nany guidance for this novice robot builder?", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pla1wz/garbagepi_how_to_make_it_stop/", "identifyer": 3507300, "year": "2021"}, {"Unnamed: 0": 2198, "autor": "sudhanv99", "date": 1631169818000, "content": "A discussion about robotics /!/ I couldnt think of anything else for the title, sorry. I am going for my masters and was thinking about my research area. I would like your opinions on the following topics. \n\n1. Mapless navigation. I know of frontier exploration but im not sure if it works. Any recent developments or is this a dead end?\n2. Are manipulators solved? Gripping with RL is a hot topic. Any others?\n3. Outdoor navigation with camera vs lidar. Is object detection/tracking necessary?\n\nThese are some of the questions to give me some perspective rather than ask suggest me masters topic. Thanks", "link": "https://www.reddit.com/r/robotics/comments/pksh1j/a_discussion_about_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "a discussion about robotics /!/ i couldnt think of anything else for the title, sorry. i am going for my masters and was thinking about my research area. i would like your opinions on the following topics. \n\n1. mapless navigation. i know of frontier exploration but im not sure if it works. any recent developments or is this a dead end?\n2. are manipulators solved? gripping with rl is a hot topic. any others?\n3. -----> outdoor !!!  navigation with camera vs lidar. is object detection/tracking necessary?\n\nthese are some of the questions to give me some perspective rather than ask suggest me masters topic. thanks", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pksh1j/a_discussion_about_robotics/", "identifyer": 3507311, "year": "2021"}, {"Unnamed: 0": 2345, "autor": "kingc95", "date": 1634005020000, "content": "Power wheels wild thing controlled over esp8266 wifi joystick. If you can find one cheap on Craigslist its alot of fun. I have some video if you wanna see it. I plan to do a full ros setup with jetson nano or tx2. Honestly this is a great starting base for an outdoor robot.", "link": "https://www.reddit.com/r/robotics/comments/q6brt4/power_wheels_wild_thing_controlled_over_esp8266/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "power wheels wild thing controlled over esp8266 wifi joystick. if you can find one cheap on craigslist its alot of fun. i have some video if you wanna see it. i plan to do a full ros setup with jetson nano or tx2. honestly this is a great starting base for an -----> outdoor !!!  robot.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/gallery/q6brt4", "identifyer": 3507461, "year": "2021"}, {"Unnamed: 0": 2802, "autor": "lasicapogardy", "date": 1624545345000, "content": "The R.A.T. - First Outdoor Test", "link": "https://www.reddit.com/r/robotics/comments/o725e0/the_rat_first_outdoor_test/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "the r.a.t. - first -----> outdoor !!!  test", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.youtube.com/watch?v=0Lrmrn--saY", "identifyer": 3507933, "year": "2021"}, {"Unnamed: 0": 2803, "autor": "masfennub9", "date": 1624542067000, "content": "Full Leg prosthetic for cat /!/ Hey guys! So I have a cat who lost his leg at his hip, and I think I could make a prosthetic with my printer. But I want it to be able to move with him and absorb impact since he's and indoor/ outdoor cat! The issue is I don't know enough about how prosthetics work, I think it could be done with robotics and sensors but don't have a jumping off pooint. Would you guys have any links or knowledge on this? Thank you so much!", "link": "https://www.reddit.com/r/robotics/comments/o713vb/full_leg_prosthetic_for_cat/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "full leg prosthetic for cat /!/ hey guys! so i have a cat who lost his leg at his hip, and i think i could make a prosthetic with my printer. but i want it to be able to move with him and absorb impact since he's and indoor/ -----> outdoor !!!  cat! the issue is i don't know enough about how prosthetics work, i think it could be done with robotics and sensors but don't have a jumping off pooint. would you guys have any links or knowledge on this? thank you so much!", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/o713vb/full_leg_prosthetic_for_cat/", "identifyer": 3507934, "year": "2021"}, {"Unnamed: 0": 3912, "autor": "here_to_create", "date": 1615258025000, "content": "The best real-world robotics simulator? /!/ The goal is to build a humanoid robot with agility similar to that of Boston Dynamic's Atlas.  I plan to model the entire system in SolidWorks.  After I have the robot build in SolidWorks I want to use reinforcement learning in a simulator to create a model for the robot to use in the real world.  From my research ing-gazebo seems to be the latest version of gazebo that I can use with ROS to build such an intelligent model.  Another simulator that seems popular is Simscape Multibody.  I want a simulator that can use an exact model of the robot (as in import a CAD design, eg from SolidWorks), in realistic indoor and outdoor environments, so that this model can be then be used to control the real-world robot.\n\n&amp;#x200B;\n\nWhat would be the best simulator to train a bipedal robot in, so that the model can be used in the real-world?", "link": "https://www.reddit.com/r/robotics/comments/m0wxui/the_best_realworld_robotics_simulator/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "the best real-world robotics simulator? /!/ the goal is to build a humanoid robot with agility similar to that of boston dynamic's atlas.  i plan to model the entire system in solidworks.  after i have the robot build in solidworks i want to use reinforcement learning in a simulator to create a model for the robot to use in the real world.  from my research ing-gazebo seems to be the latest version of gazebo that i can use with ros to build such an intelligent model.  another simulator that seems popular is simscape multibody.  i want a simulator that can use an exact model of the robot (as in import a cad design, eg from solidworks), in realistic indoor and -----> outdoor !!!  environments, so that this model can be then be used to control the real-world robot.\n\n&amp;#x200b;\n\nwhat would be the best simulator to train a bipedal robot in, so that the model can be used in the real-world?", "sortedWord": "None", "removed": null, "score": 1, "comments": 46, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/m0wxui/the_best_realworld_robotics_simulator/", "identifyer": 3509077, "year": "2021"}, {"Unnamed: 0": 4571, "autor": "traemand2", "date": 1628955005000, "content": "Mechanically robust differential drive platform? /!/ Hi there,\n\nI want to build another differential drive robot, after a successful turtlebot 3 clone project a while back. I now want to take things further.\n\nI often see differential drive builds that lack effort put into the mechanical side of things. In fact, this goes for many amateur robots I encounter, though I totally get why this is not often a priority. As a mech.eng. I’ve decided to try and design my own build, where I try to build a solid  “jack of all trades” differential drive platform, that I can then keep on using in the future for prototyping. I’m also interested in keeping everything open, modular and scalable, so that other people can benefit from the build if they see a use case. \n\nI’d like to know of any similar projects, and also some feedback on designs that you thought were clever. This can be both amateur and professional stuff.  \n\nProjects I’m already studying are:\n- James Brutons Really useful robot\n- Turtlebot 1+2+3\n- MiR models\n- The NoX project\n- A number of lawnmowers\n- Roombas\n\nConcepts I’m currently working on:\n- Mainly stock materials, like alu extrusions and bolts for the chassis\n- 3D printing where customization is deemed necessary\n- Quick change tires for indoor/outdoor\n- suspension system\n- LEDs + LCD for visual debugging\n- Accessible ports and switches \n- Wheels inside chassis vs outside chassis", "link": "https://www.reddit.com/r/robotics/comments/p4a3tp/mechanically_robust_differential_drive_platform/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "mechanically robust differential drive platform? /!/ hi there,\n\ni want to build another differential drive robot, after a successful turtlebot 3 clone project a while back. i now want to take things further.\n\ni often see differential drive builds that lack effort put into the mechanical side of things. in fact, this goes for many amateur robots i encounter, though i totally get why this is not often a priority. as a mech.eng. i’ve decided to try and design my own build, where i try to build a solid  “jack of all trades” differential drive platform, that i can then keep on using in the future for prototyping. i’m also interested in keeping everything open, modular and scalable, so that other people can benefit from the build if they see a use case. \n\ni’d like to know of any similar projects, and also some feedback on designs that you thought were clever. this can be both amateur and professional stuff.  \n\nprojects i’m already studying are:\n- james brutons really useful robot\n- turtlebot 1+2+3\n- mir models\n- the nox project\n- a number of lawnmowers\n- roombas\n\nconcepts i’m currently working on:\n- mainly stock materials, like alu extrusions and bolts for the chassis\n- 3d printing where customization is deemed necessary\n- quick change tires for indoor/-----> outdoor !!! \n- suspension system\n- leds + lcd for visual debugging\n- accessible ports and switches \n- wheels inside chassis vs outside chassis", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/p4a3tp/mechanically_robust_differential_drive_platform/", "identifyer": 3509756, "year": "2021"}, {"Unnamed: 0": 4853, "autor": "m1900kang2", "date": 1618541563000, "content": "[ICLR 2021] RECON: Rapid Exploration for Open-World Navigation with Latent Goal Models /!/ This new paper from the *International Conference on Learning Representations* (*ICLR 2021)* looks into a model that is trained on a large dataset of prior experience to predict the expected amount of time and next action needed to transit between the current image and a goal image with the help of a novel robot. \n\n\\[[Paper Presentation](https://crossminds.ai/video/recon-rapid-exploration-for-open-world-navigation-with-latent-goal-models-60774add3a020ad369b344f7/)\\] \\[[arXiv Link](https://arxiv.org/abs/2104.05859)\\]\n\n**Abstract:** We describe a robotic learning system for autonomous navigation in diverse environments. At the core of our method are two components: (i) a non-parametric map that reflects the connectivity of the environment but does not require geometric reconstruction or localization, and (ii) a latent variable model of distances and actions that enables efficiently constructing and traversing this map. The model is trained on a large dataset of prior experience to predict the expected amount of time and next action needed to transit between the current image and a goal image. Training the model in this way enables it to develop a representation of goals robust to distracting information in the input images, which aids in deploying the system to quickly explore new environments. We demonstrate our method on a mobile ground robot in a range of outdoor navigation scenarios. Our method can learn to reach new goals, specified as images, in a radius of up to 80 meters in just 20 minutes, and reliably revisit these goals in changing environments. We also demonstrate our method's robustness to previously-unseen obstacles and variable weather conditions.\n\n[RECON in action](https://preview.redd.it/zjq49prc9gt61.png?width=939&amp;format=png&amp;auto=webp&amp;s=4ed6cdc3029ddb7049724274566df6e3d23a0af9)\n\n**Authors:** Dhruv Shah, Benjamin Eysenbach, Gregory Kahn, Nicholas Rhinehart, Sergey Levine (UC Berkeley, Carnegie Mellon University)", "link": "https://www.reddit.com/r/robotics/comments/mrub0c/iclr_2021_recon_rapid_exploration_for_openworld/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "[iclr 2021] recon: rapid exploration for open-world navigation with latent goal models /!/ this new paper from the *international conference on learning representations* (*iclr 2021)* looks into a model that is trained on a large dataset of prior experience to predict the expected amount of time and next action needed to transit between the current image and a goal image with the help of a novel robot. \n\n\\[[paper presentation](https://crossminds.ai/video/recon-rapid-exploration-for-open-world-navigation-with-latent-goal-models-60774add3a020ad369b344f7/)\\] \\[[arxiv link](https://arxiv.org/abs/2104.05859)\\]\n\n**abstract:** we describe a robotic learning system for autonomous navigation in diverse environments. at the core of our method are two components: (i) a non-parametric map that reflects the connectivity of the environment but does not require geometric reconstruction or localization, and (ii) a latent variable model of distances and actions that enables efficiently constructing and traversing this map. the model is trained on a large dataset of prior experience to predict the expected amount of time and next action needed to transit between the current image and a goal image. training the model in this way enables it to develop a representation of goals robust to distracting information in the input images, which aids in deploying the system to quickly explore new environments. we demonstrate our method on a mobile ground robot in a range of -----> outdoor !!!  navigation scenarios. our method can learn to reach new goals, specified as images, in a radius of up to 80 meters in just 20 minutes, and reliably revisit these goals in changing environments. we also demonstrate our method's robustness to previously-unseen obstacles and variable weather conditions.\n\n[recon in action](https://preview.redd.it/zjq49prc9gt61.png?width=939&amp;format=png&amp;auto=webp&amp;s=4ed6cdc3029ddb7049724274566df6e3d23a0af9)\n\n**authors:** dhruv shah, benjamin eysenbach, gregory kahn, nicholas rhinehart, sergey levine (uc berkeley, carnegie mellon university)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/mrub0c/iclr_2021_recon_rapid_exploration_for_openworld/", "identifyer": 3510046, "year": "2021"}], "name": "outdoorrobotics2021"}