{"interestingcomments": [{"Unnamed: 0": 1435, "autor": "kevinut27", "date": 1612806550000, "content": "Torque measurement /!/ Hello guys, I watched this video from Skyentific, where the build a setup with a controller, driver, encoder, can bus and the motor and he gets the torque in the motor, he even plot it in a graph. \n\nSo I understood he only uses the encoder to get value of the torque with the formula in the picture, I ask in the section comment but didn't get replied, do you know how is this formula with stiffness and the damping works? or do you have a link to a explanation or tutorial? could this be done with a raspberry pi?  I guess this is used in collaborative robots.  \n\n\nThanks in advance for the answers :) \n\n&amp;#x200B;\n\nhttps://preview.redd.it/i4z5fvzckag61.jpg?width=1246&amp;format=pjpg&amp;auto=webp&amp;s=280b00e1fefb0d6ce3bca8125d37568383bbbafc\n\nhttps://preview.redd.it/322a1xzckag61.jpg?width=1252&amp;format=pjpg&amp;auto=webp&amp;s=ffc7483028824da6e2f1d43d2ac7a17a4fbe738b\n\nP.D: the link of the Youtube videos:  \n [https://www.youtube.com/watch?v=HzY9vzgPZkA&amp;feature=emb\\_title](https://www.youtube.com/watch?v=HzY9vzgPZkA&amp;feature=emb_title)  \n[https://www.youtube.com/watch?v=WKRLlthr9kY](https://www.youtube.com/watch?v=WKRLlthr9kY)", "link": "https://www.reddit.com/r/robotics/comments/lfhbmt/torque_measurement/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "torque measurement /!/ hello guys, i watched this video from skyentific, where the build a setup with a controller, driver, encoder, can bus and the motor and he gets the torque in the motor, he even -----> plot !!!  it in a graph. \n\nso i understood he only uses the encoder to get value of the torque with the formula in the picture, i ask in the section comment but didn't get replied, do you know how is this formula with stiffness and the damping works? or do you have a link to a explanation or tutorial? could this be done with a raspberry pi?  i guess this is used in collaborative robots.  \n\n\nthanks in advance for the answers :) \n\n&amp;#x200b;\n\nhttps://preview.redd.it/i4z5fvzckag61.jpg?width=1246&amp;format=pjpg&amp;auto=webp&amp;s=280b00e1fefb0d6ce3bca8125d37568383bbbafc\n\nhttps://preview.redd.it/322a1xzckag61.jpg?width=1252&amp;format=pjpg&amp;auto=webp&amp;s=ffc7483028824da6e2f1d43d2ac7a17a4fbe738b\n\np.d: the link of the youtube videos:  \n [https://www.youtube.com/watch?v=hzy9vzgpzka&amp;feature=emb\\_title](https://www.youtube.com/watch?v=hzy9vzgpzka&amp;feature=emb_title)  \n[https://www.youtube.com/watch?v=wkrllthr9ky](https://www.youtube.com/watch?v=wkrllthr9ky)", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/lfhbmt/torque_measurement/", "identifyer": 3506527, "year": "2021"}, {"Unnamed: 0": 2275, "autor": "camnagg", "date": 1632421100000, "content": "Kinova Gen3 Robot Search Functionality Idea /!/ Hey guys I am trying to do something and I wanted to see if anyone had any ideas.\n\nLet's say there is a wall near my gen3 robot. I want to identify a space on the surface of the wall (say a rectangle). The arm will then move very closely to say the top left corner of the rectangle and \"scan\" it line by line. Represented in this image...\nhttp://imgur.com/a/yHdM4BG\nRed: area needed to be scanned\nBlue: path of the end effector\n\nI was thinking of trying to make an algorithm that creates like a plot (or matrix?) That is made up of way points for the end effector to travel to but I am unsure of how to relate that with the kinova API. I am currently working with the robot on Ubuntu with ROS noetic. I have set everything up and am able to run the test examples. I planned to do this by providing the 4 corner waypoints of the red area and then have the algorithm create the rest of the inner waypoints\n\n I will be using an external realsense camera not the one they offered.", "link": "https://www.reddit.com/r/robotics/comments/pu1af8/kinova_gen3_robot_search_functionality_idea/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "kinova gen3 robot search functionality idea /!/ hey guys i am trying to do something and i wanted to see if anyone had any ideas.\n\nlet's say there is a wall near my gen3 robot. i want to identify a space on the surface of the wall (say a rectangle). the arm will then move very closely to say the top left corner of the rectangle and \"scan\" it line by line. represented in this image...\nhttp://imgur.com/a/yhdm4bg\nred: area needed to be scanned\nblue: path of the end effector\n\ni was thinking of trying to make an algorithm that creates like a -----> plot !!!  (or matrix?) that is made up of way points for the end effector to travel to but i am unsure of how to relate that with the kinova api. i am currently working with the robot on ubuntu with ros noetic. i have set everything up and am able to run the test examples. i planned to do this by providing the 4 corner waypoints of the red area and then have the algorithm create the rest of the inner waypoints\n\n i will be using an external realsense camera not the one they offered.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/pu1af8/kinova_gen3_robot_search_functionality_idea/", "identifyer": 3507391, "year": "2021"}, {"Unnamed: 0": 2394, "autor": "Fun-Moose-3841", "date": 1633702157000, "content": "Estimating velocity from position value using the Extended Kalman Filter /!/ Hi all,\n\nI am trying to estimate velocity values from my encoder (=position) values by applying the Extended Kalman Filter:\n\nAs you can see below, the upper images visualizes the position values and the other one the estimated velocity value. The peak value \\~-0.35 seems to be correct, but as you can see the course of the red plot after t&gt;14s, the velocity is slowly decreasing to 0, whereas the position value after t&gt; 14s does not change at all. \n\nCan someone with experiences in EKF say whether this problem lies in the setting of the controller or in the EKF itself? I am using this package ([https://github.com/kth-ros-pkg/joint\\_state\\_estimator](https://github.com/kth-ros-pkg/joint_state_estimator))\n\nhttps://preview.redd.it/xqxbr7nzg8s71.png?width=1394&amp;format=png&amp;auto=webp&amp;s=74f88bc869745900116f280516a88dbb5cc0fafc", "link": "https://www.reddit.com/r/robotics/comments/q3yids/estimating_velocity_from_position_value_using_the/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "estimating velocity from position value using the extended kalman filter /!/ hi all,\n\ni am trying to estimate velocity values from my encoder (=position) values by applying the extended kalman filter:\n\nas you can see below, the upper images visualizes the position values and the other one the estimated velocity value. the peak value \\~-0.35 seems to be correct, but as you can see the course of the red -----> plot !!!  after t&gt;14s, the velocity is slowly decreasing to 0, whereas the position value after t&gt; 14s does not change at all. \n\ncan someone with experiences in ekf say whether this problem lies in the setting of the controller or in the ekf itself? i am using this package ([https://github.com/kth-ros-pkg/joint\\_state\\_estimator](https://github.com/kth-ros-pkg/joint_state_estimator))\n\nhttps://preview.redd.it/xqxbr7nzg8s71.png?width=1394&amp;format=png&amp;auto=webp&amp;s=74f88bc869745900116f280516a88dbb5cc0fafc", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/q3yids/estimating_velocity_from_position_value_using_the/", "identifyer": 3507514, "year": "2021"}, {"Unnamed: 0": 2631, "autor": "obnoxiousgolem", "date": 1613304762000, "content": "Peter Corke Robotics Toolbox - Matlab query, please help /!/ Does anyone have any experience with the Peter Corke robotics toolbox for matlab? That could explain how I can plot the Roll pitch and yaw of an end effector position against time on a graph, for the movements between three poses q0 (initial pose) q1 (middle pose) q2 (end pose).\n\nIf anyone could explain how I could do this you would be a life saver", "link": "https://www.reddit.com/r/robotics/comments/ljnbvt/peter_corke_robotics_toolbox_matlab_query_please/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "peter corke robotics toolbox - matlab query, please help /!/ does anyone have any experience with the peter corke robotics toolbox for matlab? that could explain how i can -----> plot !!!  the roll pitch and yaw of an end effector position against time on a graph, for the movements between three poses q0 (initial pose) q1 (middle pose) q2 (end pose).\n\nif anyone could explain how i could do this you would be a life saver", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ljnbvt/peter_corke_robotics_toolbox_matlab_query_please/", "identifyer": 3507759, "year": "2021"}, {"Unnamed: 0": 3633, "autor": "Learninglavender", "date": 1633470569000, "content": "Workspace Calculation of a Five Bar parallel Manupulator. /!/ I was trying to calculate the workspace of a five bar parallel manipulator. Is it possible to plot the workspace by using only python or is it mandatory to use only Matlab or is there any other software which one can use. I am a beginner so I am quite clueless on this one.", "link": "https://www.reddit.com/r/robotics/comments/q26gow/workspace_calculation_of_a_five_bar_parallel/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "workspace calculation of a five bar parallel manupulator. /!/ i was trying to calculate the workspace of a five bar parallel manipulator. is it possible to -----> plot !!!  the workspace by using only python or is it mandatory to use only matlab or is there any other software which one can use. i am a beginner so i am quite clueless on this one.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/q26gow/workspace_calculation_of_a_five_bar_parallel/", "identifyer": 3508786, "year": "2021"}], "name": "plotrobotics2021"}