{"interestingcomments": [{"Unnamed: 0": 207, "autor": "suche132", "date": 1630127404000, "content": "Future prospective of ROS for a beginner. /!/ Hey everyone, I was learning ros and progressed quite a bit in the past few weeks. I was very curious about how far can I take it with ROS. Do companies like BostonDynamics and Tesla use ROS as their primary tool too? What is the maximum you can stretch ROS to?\nIt would be amazing to have a discussion about this.", "link": "https://www.reddit.com/r/robotics/comments/pd3rss/future_prospective_of_ros_for_a_beginner/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "future prospective of ros for a beginner. /!/ hey everyone, i was learning ros and progressed quite a bit in the past few weeks. i was very curious about how far can i take it with ros. do companies like bostondynamics and tesla use ros as their primary -----> tool !!!  too? what is the maximum you can stretch ros to?\nit would be amazing to have a discussion about this.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pd3rss/future_prospective_of_ros_for_a_beginner/", "identifyer": 3505271, "year": "2021"}, {"Unnamed: 0": 413, "autor": "Leonhard_Euler_278", "date": 1611632548000, "content": "New Mechanical Design Tool /!/ Computer science classes generally taught me to take a \"top-down\" design approach to writing large software projects, meaning we think about big picture components and connect them together *before* fleshing out the details.\n\nHowever, when I try to make robots and other machines in SolidWorks and Inventor, they seem to take a \"bottom-up\" approach where users have to make drawings and extrude them, noting many small details *before* assembling the components.\n\nIntroducing the first top-down mechanical CAD tool! (At least, as far as I know)\n\n*Processing img 1uq0x4nbhld61...*\n\nFurther documentation and mockups, including descriptions of each feature shown in the mockup, can be found on the slide show [here](https://docs.google.com/presentation/d/1LaSYEUj2M9j_-PVDlftm24MFIp9538CjGdLuW0pvQY0/edit?usp=sharing).\n\nIf you're interested in simulation, computer graphics, or web development, DM me and I'd be more than happy to work with you on this project.\n\nOtherwise, if you'd never touch it, or you just have suggestions to make it better, please don't hesitate to drop a critical comment; I'd hate to make a tool that I thought would be helpful but never actually will be.", "link": "https://www.reddit.com/r/robotics/comments/l55d3g/new_mechanical_design_tool/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new mechanical design -----> tool !!!  /!/ computer science classes generally taught me to take a \"top-down\" design approach to writing large software projects, meaning we think about big picture components and connect them together *before* fleshing out the details.\n\nhowever, when i try to make robots and other machines in solidworks and inventor, they seem to take a \"bottom-up\" approach where users have to make drawings and extrude them, noting many small details *before* assembling the components.\n\nintroducing the first top-down mechanical cad tool! (at least, as far as i know)\n\n*processing img 1uq0x4nbhld61...*\n\nfurther documentation and mockups, including descriptions of each feature shown in the mockup, can be found on the slide show [here](https://docs.google.com/presentation/d/1lasyeuj2m9j_-pvdlftm24mfip9538cjgdluw0pvqy0/edit?usp=sharing).\n\nif you're interested in simulation, computer graphics, or web development, dm me and i'd be more than happy to work with you on this project.\n\notherwise, if you'd never touch it, or you just have suggestions to make it better, please don't hesitate to drop a critical comment; i'd hate to make a tool that i thought would be helpful but never actually will be.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/l55d3g/new_mechanical_design_tool/", "identifyer": 3505478, "year": "2021"}, {"Unnamed: 0": 497, "autor": "skythedragon64", "date": 1622201515000, "content": "Connecting servos to the things they need to move /!/ I've created a compact eye mechanism:\n\nhttps://preview.redd.it/xvxo0a8ziu171.png?width=1115&amp;format=png&amp;auto=webp&amp;s=bc55ae80c53e7020dd5230ff1e3eed923ed49838\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nj4ds383ju171.png?width=1218&amp;format=png&amp;auto=webp&amp;s=7c075616628928bfd6306a06af5f6d7d8014e329\n\nI connect the eye I need to move to the servo horn with a small bit of iron wire (wire not shown here, but it goes from the front servo into the dark red ring on the inside of the eye)\n\nhttps://preview.redd.it/5nipyvjjju171.png?width=1084&amp;format=png&amp;auto=webp&amp;s=0d153e20d183ce6d19f61dede7257602e1234089\n\nWhile this works, it's quite hard to assemble. My first though would be to make some helper tool to bend the wire correctly, or trying a different configuration (ring towards the outside of the eye, with the servos spaced a bit) but I was wondering if there were other ways of doing it, while keeping the mechanism easy to 3d print.\n\nAny advice?", "link": "https://www.reddit.com/r/robotics/comments/nmvu6u/connecting_servos_to_the_things_they_need_to_move/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "connecting servos to the things they need to move /!/ i've created a compact eye mechanism:\n\nhttps://preview.redd.it/xvxo0a8ziu171.png?width=1115&amp;format=png&amp;auto=webp&amp;s=bc55ae80c53e7020dd5230ff1e3eed923ed49838\n\n&amp;#x200b;\n\nhttps://preview.redd.it/nj4ds383ju171.png?width=1218&amp;format=png&amp;auto=webp&amp;s=7c075616628928bfd6306a06af5f6d7d8014e329\n\ni connect the eye i need to move to the servo horn with a small bit of iron wire (wire not shown here, but it goes from the front servo into the dark red ring on the inside of the eye)\n\nhttps://preview.redd.it/5nipyvjjju171.png?width=1084&amp;format=png&amp;auto=webp&amp;s=0d153e20d183ce6d19f61dede7257602e1234089\n\nwhile this works, it's quite hard to assemble. my first though would be to make some helper -----> tool !!!  to bend the wire correctly, or trying a different configuration (ring towards the outside of the eye, with the servos spaced a bit) but i was wondering if there were other ways of doing it, while keeping the mechanism easy to 3d print.\n\nany advice?", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/nmvu6u/connecting_servos_to_the_things_they_need_to_move/", "identifyer": 3505564, "year": "2021"}, {"Unnamed: 0": 607, "autor": "emilgil", "date": 1616992111000, "content": "Im programming one of these 5 DOF + gripper robots for college, is there a tool i could use that would give me the required angles given the x,y,z position?", "link": "https://www.reddit.com/r/robotics/comments/mfhnyt/im_programming_one_of_these_5_dof_gripper_robots/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "im programming one of these 5 dof + gripper robots for college, is there a -----> tool !!!  i could use that would give me the required angles given the x,y,z position?", "sortedWord": "None", "removed": null, "score": 1, "comments": 21, "media": "image", "medialink": "https://i.redd.it/36ndiyo7awp61.jpg", "identifyer": 3505676, "year": "2021"}, {"Unnamed: 0": 683, "autor": "cynical-seeker", "date": 1632822189000, "content": "I get an error after installing CoppeliaSim Edu version 4.2.0 on Windows and can't open the software. /!/ I'm a final year student studying engineering and for my final year project, we are needed to install the simulation tool CoppeliaSim Edu. I downloaded the software from the website and installed it. The software only just after the installation when I check the checkbox labeled 'Launch CoppeliaSim now'. When I exit the launched program and try to open it again it pops up an error saying,\n\n\"C:\\\\Prpgram Files\\\\CoppeliaRobotics\\\\CoppeliaSimEdu\\\\coppeliaSim.exe\n\nWindows cannot access the specified device, path, or file. You may not have the appropriate permissions to access the item.\"\n\nUpon searching for fixes online, I have tried the following remedies suggested but non of them worked.\n\n1. Giving permission through the security tab in the properties menu. When navigating to the properties tab, windows give a pop-up saying \"The permissions on coppeliaSim.exe are incorrectly ordered, which may cause some entries to be ineffective.\" After selecting Ok (which is the only option), I can access and change the permission to the Groups and usernames. When trying to edit the permission another pop-up make me reorder the permissions as suggested by windows.\n2. To disable the windows defender setting reputation-based protection to allow .exe files to run.\n3. Re-installing the program a bunch of times.\n4. Disabling my antivirus.\n\nI would very much appreciate any help anyone can give to resolve this because I'm in real need of this software. Thanks in advance.", "link": "https://www.reddit.com/r/robotics/comments/px2thm/i_get_an_error_after_installing_coppeliasim_edu/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i get an error after installing coppeliasim edu version 4.2.0 on windows and can't open the software. /!/ i'm a final year student studying engineering and for my final year project, we are needed to install the simulation -----> tool !!!  coppeliasim edu. i downloaded the software from the website and installed it. the software only just after the installation when i check the checkbox labeled 'launch coppeliasim now'. when i exit the launched program and try to open it again it pops up an error saying,\n\n\"c:\\\\prpgram files\\\\coppeliarobotics\\\\coppeliasimedu\\\\coppeliasim.exe\n\nwindows cannot access the specified device, path, or file. you may not have the appropriate permissions to access the item.\"\n\nupon searching for fixes online, i have tried the following remedies suggested but non of them worked.\n\n1. giving permission through the security tab in the properties menu. when navigating to the properties tab, windows give a pop-up saying \"the permissions on coppeliasim.exe are incorrectly ordered, which may cause some entries to be ineffective.\" after selecting ok (which is the only option), i can access and change the permission to the groups and usernames. when trying to edit the permission another pop-up make me reorder the permissions as suggested by windows.\n2. to disable the windows defender setting reputation-based protection to allow .exe files to run.\n3. re-installing the program a bunch of times.\n4. disabling my antivirus.\n\ni would very much appreciate any help anyone can give to resolve this because i'm in real need of this software. thanks in advance.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/px2thm/i_get_an_error_after_installing_coppeliasim_edu/", "identifyer": 3505754, "year": "2021"}, {"Unnamed: 0": 814, "autor": "oldjar07", "date": 1610509391000, "content": "The potential problems with hobbyism /!/ Hi all, I see the enormous potential for robotics in society, but I also see that hobbyist robotics can sometimes work against that goal.  I've followed industry robotics for a long time, and I see some massive differences between the goals to improve robotic utilization and bring new talent into industry and using hobbyist robotics as an education tool. \n\n Although using tools like Arduino and building a simple project can be a great first step to learn about electronics and microcontrollers, it's only really a first step and many hobbyists never go beyond that.  I also see people on here ask about getting into the industry, and this is one of the most common things people suggest is starting an Arduino or Raspberry Pi project.  I honestly don't think a lot of employers care about these projects and would rather see some experience or a project specific to their needs and whatever systems they use.  ROS or a similar software framework would probably be more useful for someone wanting to break into the Industry to learn rather than Arduino.  ROS can even be used to learn the hardware side as well as, if not better than Arduino.  If you're only wanting to do robotics as a hobby and build a simple robot, than Arduino works just fine.  But if you want to work in the industry at some point, I think ROS is a much better starting point.  \n\nAlthough Arduino can be a good starting point in some circumstances, a plateau will be reached if you never move beyond that.  ROS can be used to expand skills, but breaking into the industry also requires some knowledge and experience specific to the systems employers use, while of course also having a strong background in control theory, electronics, programming, etc.  \n\nThis brings me to my main point.  We should be steering individuals who want to have a career in robotics to pursue career goals rather than hobbyist goals that may lead to a dead end.  In my view, robotics is so much more than hobbyist projects to do in our spare time.  Robots are going to play an enormous role in the future economy.  We're going to rely on them and live amongst them in our everyday lives.  There's some people in this sub who have done some incredibly cool and creative things with hobbyist robots, but yet have no idea what industry robots are capable of.  My interest in robots deals more with how they effect industry and their impact on the economy and society.  Although I'm not as interested in the hobbyist aspect, I think hobbyists should learn as much as they can from industry to inspire projects.\n\n  Robotics is a very easy field to get distracted in.    And for the younger members, it's important to know if you're pursuing robotics more as a career or a hobby, and we as a community should make sure we're giving advice that best fits their needs rather than our own.", "link": "https://www.reddit.com/r/robotics/comments/kw86ko/the_potential_problems_with_hobbyism/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the potential problems with hobbyism /!/ hi all, i see the enormous potential for robotics in society, but i also see that hobbyist robotics can sometimes work against that goal.  i've followed industry robotics for a long time, and i see some massive differences between the goals to improve robotic utilization and bring new talent into industry and using hobbyist robotics as an education -----> tool !!! . \n\n although using tools like arduino and building a simple project can be a great first step to learn about electronics and microcontrollers, it's only really a first step and many hobbyists never go beyond that.  i also see people on here ask about getting into the industry, and this is one of the most common things people suggest is starting an arduino or raspberry pi project.  i honestly don't think a lot of employers care about these projects and would rather see some experience or a project specific to their needs and whatever systems they use.  ros or a similar software framework would probably be more useful for someone wanting to break into the industry to learn rather than arduino.  ros can even be used to learn the hardware side as well as, if not better than arduino.  if you're only wanting to do robotics as a hobby and build a simple robot, than arduino works just fine.  but if you want to work in the industry at some point, i think ros is a much better starting point.  \n\nalthough arduino can be a good starting point in some circumstances, a plateau will be reached if you never move beyond that.  ros can be used to expand skills, but breaking into the industry also requires some knowledge and experience specific to the systems employers use, while of course also having a strong background in control theory, electronics, programming, etc.  \n\nthis brings me to my main point.  we should be steering individuals who want to have a career in robotics to pursue career goals rather than hobbyist goals that may lead to a dead end.  in my view, robotics is so much more than hobbyist projects to do in our spare time.  robots are going to play an enormous role in the future economy.  we're going to rely on them and live amongst them in our everyday lives.  there's some people in this sub who have done some incredibly cool and creative things with hobbyist robots, but yet have no idea what industry robots are capable of.  my interest in robots deals more with how they effect industry and their impact on the economy and society.  although i'm not as interested in the hobbyist aspect, i think hobbyists should learn as much as they can from industry to inspire projects.\n\n  robotics is a very easy field to get distracted in.    and for the younger members, it's important to know if you're pursuing robotics more as a career or a hobby, and we as a community should make sure we're giving advice that best fits their needs rather than our own.", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/kw86ko/the_potential_problems_with_hobbyism/", "identifyer": 3505889, "year": "2021"}, {"Unnamed: 0": 848, "autor": "Leonhard_Euler_278", "date": 1610423084000, "content": "Mechanical/Mechatronics engineers, how would you improve existing CAD tools for robotics? /!/ I saw a cartoon about the gap between mechanical engineering and computer engineering in [this post](https://www.reddit.com/r/robotics/comments/b5xls1/any_mechanical_engineers_feel_this_way/) earlier. As an undergrad in computer engineering, I was wondering why MEs feel this way. If there could be a dream tool for designing and simulating robots, what would it be?\n\nBased on my limited experience building/programming robots in my free time, these are some things I might put in such a tool:\n\n* **Power transmission generators:** If you're making a robotic arm with a motorized elbow joint, but the gearbox shaft can't be directly connected to the joint, these tools could help create systems comprising cables and pulleys, levers, belts, and/or gears. I'm not sure how this would exactly work after seeing how diverse robots can be, though.\n* **A marketplace for purchasing and integrating COTS items like motors and gearboxes:** With this tool, you might be able to browse and integrate CAD files directly into your design, and then you could purchase them all at once when you're ready to assemble the robot. It looks like some small companies like [Vention](https://vention.io/) have made their own small-scale marketplaces for industrial machines, but they restrict custom hardware integration.\n* **A rigid-body simulator.** The simulator could verify that parts function correctly and don't break under normal amounts of stress.\n* **Support for plugins:** These plugins could: \t  \n\n1. Interface the simulator and ROS and NVIDIA Omniverse, allowing software developers to write code for robots that aren't yet manufactured.\n2. Create new tools that aid the design process.\n3. Send designs to manufacturers if tools aren't available for fabricating parts.\n4. Export parts for 3D printing.\n\nI'm curious, would you use/change these tools? Would you recommend adding new ones?", "link": "https://www.reddit.com/r/robotics/comments/kvjkx1/mechanicalmechatronics_engineers_how_would_you/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "mechanical/mechatronics engineers, how would you improve existing cad tools for robotics? /!/ i saw a cartoon about the gap between mechanical engineering and computer engineering in [this post](https://www.reddit.com/r/robotics/comments/b5xls1/any_mechanical_engineers_feel_this_way/) earlier. as an undergrad in computer engineering, i was wondering why mes feel this way. if there could be a dream -----> tool !!!  for designing and simulating robots, what would it be?\n\nbased on my limited experience building/programming robots in my free time, these are some things i might put in such a -----> tool !!! :\n\n* **power transmission generators:** if you're making a robotic arm with a motorized elbow joint, but the gearbox shaft can't be directly connected to the joint, these tools could help create systems comprising cables and pulleys, levers, belts, and/or gears. i'm not sure how this would exactly work after seeing how diverse robots can be, though.\n* **a marketplace for purchasing and integrating cots items like motors and gearboxes:** with this tool, you might be able to browse and integrate cad files directly into your design, and then you could purchase them all at once when you're ready to assemble the robot. it looks like some small companies like [vention](https://vention.io/) have made their own small-scale marketplaces for industrial machines, but they restrict custom hardware integration.\n* **a rigid-body simulator.** the simulator could verify that parts function correctly and don't break under normal amounts of stress.\n* **support for plugins:** these plugins could: \t  \n\n1. interface the simulator and ros and nvidia omniverse, allowing software developers to write code for robots that aren't yet manufactured.\n2. create new tools that aid the design process.\n3. send designs to manufacturers if tools aren't available for fabricating parts.\n4. export parts for 3d printing.\n\ni'm curious, would you use/change these tools? would you recommend adding new ones?", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/kvjkx1/mechanicalmechatronics_engineers_how_would_you/", "identifyer": 3505923, "year": "2021"}, {"Unnamed: 0": 894, "autor": "speedx10", "date": 1610214840000, "content": "Coordinate Transformation - Camera to Robot - help please ! /!/ I am trying to make a simple pick and place system using a 5 Degree of freedom Dorna Robotic arm and a Realsense camera.\n\nNow, I have found the point (u,v on image frame) on my object towards which my end effector is supposed to move.\n\nI obtain Camera Co-ordinates (Cx,Cy,Cz) for u,v image pixels.\n\nNow my camera has some rotation and translation based on how its mounted w.r.t the robotic arm.\n\nso I apply Rotation and Translation to get \\[Rx,Ry,Rz\\] in robotic arm coordinates.\n\nBut when i apply the inverse kinematics to Rx,Ry,Rz my end effector is 3cm off from the object on x direction and 0.5cm off from the objext in its y axis, its close enough but not perfect!... how can i fix this?\n\nI measured the Translation between camera origin and robot origin using a Laser Measurement tool.\n\nBut 1cm on the laser measurement tool is not exactly 1cm in Robot Coordinates. Is this the source of the problem? if so how can i solve it. Pls Help !!", "link": "https://www.reddit.com/r/robotics/comments/ktvnj9/coordinate_transformation_camera_to_robot_help/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "coordinate transformation - camera to robot - help please ! /!/ i am trying to make a simple pick and place system using a 5 degree of freedom dorna robotic arm and a realsense camera.\n\nnow, i have found the point (u,v on image frame) on my object towards which my end effector is supposed to move.\n\ni obtain camera co-ordinates (cx,cy,cz) for u,v image pixels.\n\nnow my camera has some rotation and translation based on how its mounted w.r.t the robotic arm.\n\nso i apply rotation and translation to get \\[rx,ry,rz\\] in robotic arm coordinates.\n\nbut when i apply the inverse kinematics to rx,ry,rz my end effector is 3cm off from the object on x direction and 0.5cm off from the objext in its y axis, its close enough but not perfect!... how can i fix this?\n\ni measured the translation between camera origin and robot origin using a laser measurement -----> tool !!! .\n\nbut 1cm on the laser measurement tool is not exactly 1cm in robot coordinates. is this the source of the problem? if so how can i solve it. pls help !!", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ktvnj9/coordinate_transformation_camera_to_robot_help/", "identifyer": 3505970, "year": "2021"}, {"Unnamed: 0": 980, "autor": "thermbug", "date": 1613670134000, "content": "Robotic blocks i.e Moss, Cubelets /!/ I'm looking at cubelets and MOSS from [modrobotics.com](https://modrobotics.com) I see a new version of cubelets from last year. \n\nThe tool looks interesting but is expensive. Is anyone actively using either these platforms or know anything about the health of the company?\n\nI don't see any social media updates since last year.\n\nAre there similar products that you had good experiences with?", "link": "https://www.reddit.com/r/robotics/comments/lmseze/robotic_blocks_ie_moss_cubelets/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "robotic blocks i.e moss, cubelets /!/ i'm looking at cubelets and moss from [modrobotics.com](https://modrobotics.com) i see a new version of cubelets from last year. \n\nthe -----> tool !!!  looks interesting but is expensive. is anyone actively using either these platforms or know anything about the health of the company?\n\ni don't see any social media updates since last year.\n\nare there similar products that you had good experiences with?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/lmseze/robotic_blocks_ie_moss_cubelets/", "identifyer": 3506061, "year": "2021"}, {"Unnamed: 0": 1194, "autor": "Loudmonster", "date": 1626851118000, "content": "Anyone knows any simulation tool? /!/ Hello, I've been interested in learning robotics and mechanics for a good while now, but because of personal reasons I can't have materials for those in the house, so I wanted to ask if anyone knew any simulation tool I could use.", "link": "https://www.reddit.com/r/robotics/comments/ookv9q/anyone_knows_any_simulation_tool/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "anyone knows any simulation -----> tool !!! ? /!/ hello, i've been interested in learning robotics and mechanics for a good while now, but because of personal reasons i can't have materials for those in the house, so i wanted to ask if anyone knew any simulation tool i could use.", "sortedWord": "None", "removed": null, "score": 1, "comments": 16, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ookv9q/anyone_knows_any_simulation_tool/", "identifyer": 3506277, "year": "2021"}, {"Unnamed: 0": 1214, "autor": "jamdonuts13", "date": 1626227500000, "content": "onshape-to-robot 403 error /!/ Hi, I'm trying to import an Onshape CAD design of a robot to urdf format so I can simulate and test some ros controls in gazebo. I'm using the onshape-to-robot tool but it's giving me the 403 error. My onshape is the student version if that matters? Furthermore, when I try the api in my browser logged in with the same account as my onshape it works and returns a bunch of things. However if I try it in incognito, I get the same 403 error. Is there some auth stuff we are supposed to add?", "link": "https://www.reddit.com/r/robotics/comments/oju8sj/onshapetorobot_403_error/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "onshape-to-robot 403 error /!/ hi, i'm trying to import an onshape cad design of a robot to urdf format so i can simulate and test some ros controls in gazebo. i'm using the onshape-to-robot -----> tool !!!  but it's giving me the 403 error. my onshape is the student version if that matters? furthermore, when i try the api in my browser logged in with the same account as my onshape it works and returns a bunch of things. however if i try it in incognito, i get the same 403 error. is there some auth stuff we are supposed to add?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/oju8sj/onshapetorobot_403_error/", "identifyer": 3506297, "year": "2021"}, {"Unnamed: 0": 1286, "autor": "graybotics", "date": 1625815038000, "content": "Grayhound v7 wiring has proven to be a huge chunk of my time on this build, but all systems are go in the interchangeable Dewalt 20v Max tool battery power system as of today! Just a sneak peak before I document some more at the Graybotics blog.", "link": "https://www.reddit.com/r/robotics/comments/ogqfmh/grayhound_v7_wiring_has_proven_to_be_a_huge_chunk/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "grayhound v7 wiring has proven to be a huge chunk of my time on this build, but all systems are go in the interchangeable dewalt 20v max -----> tool !!!  battery power system as of today! just a sneak peak before i document some more at the graybotics blog.", "sortedWord": "None", "removed": "reddit", "score": 1, "comments": 0, "media": "image", "medialink": "https://i.redd.it/zc8qbsba15a71.jpg", "identifyer": 3506376, "year": "2021"}, {"Unnamed: 0": 1814, "autor": "EditorExtreme672", "date": 1620905959000, "content": "I watched a video of a guy strapping and spot soldering lithium ion batteries. Anyone ever strap their own blocks of batteries? What’s that tool called? Had fangs like a snake. /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/nbelvv/i_watched_a_video_of_a_guy_strapping_and_spot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i watched a video of a guy strapping and spot soldering lithium ion batteries. anyone ever strap their own blocks of batteries? what’s that -----> tool !!!  called? had fangs like a snake. /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/nbelvv/i_watched_a_video_of_a_guy_strapping_and_spot/", "identifyer": 3506916, "year": "2021"}, {"Unnamed: 0": 1843, "autor": "PlasticBlaze", "date": 1620747237000, "content": "Spec'ing motor for slow, heavy robot. /!/  Hello,\n\nI guess no one really follows the pages rules about posting general questions in the \"Weekly Question\" thread.   \nI’ve been looking around at some of the other posts and also used this [calculator](https://www.robotshop.com/community/blog/show/drive-motor-sizing-tool) to find my general specs. I figured someone with more experience could basically flat out tell me what I need just by looking at some details about my project.\n\nSo when I first started thinking about building a 4 wheeled robot, I went ahead and bought 4 stepper motors that are [here](https://www.omc-stepperonline.com/nema-17-stepper-motor/nema-17-bipolar-45ncm-6374ozin-15a-42x42x39mm-4-wires-w--1m-pin-connector.html). The wheels are 97mm Mecanum wheels so I'm not sure how that affects required torque if at all. After mechanically designing the robot (backwards process I know), and building the bot, it weighs roughly 30 lbs with the 2 - 12V batteries. I have them connected in series to power a different 24V device on board just FYI. I’m using an Arduino with CNC hat that also uses 24V supply to power the 4 steppers. The application is very low speed (0.5 ft/s) and more about positional accuracy than anything. I haven’t wired everything up yet but based on the specs of the steppers listed will they be strong enough? I assume not due to the results I got from the calculator site were 171 Ncm per motor… I tried looking around on for DC motors but there are so many and I want to be sure to get something that will work if the stepper’s won’t.", "link": "https://www.reddit.com/r/robotics/comments/n9zrig/specing_motor_for_slow_heavy_robot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "spec'ing motor for slow, heavy robot. /!/  hello,\n\ni guess no one really follows the pages rules about posting general questions in the \"weekly question\" thread.   \ni’ve been looking around at some of the other posts and also used this [calculator](https://www.robotshop.com/community/blog/show/drive-motor-sizing------> tool !!! ) to find my general specs. i figured someone with more experience could basically flat out tell me what i need just by looking at some details about my project.\n\nso when i first started thinking about building a 4 wheeled robot, i went ahead and bought 4 stepper motors that are [here](https://www.omc-stepperonline.com/nema-17-stepper-motor/nema-17-bipolar-45ncm-6374ozin-15a-42x42x39mm-4-wires-w--1m-pin-connector.html). the wheels are 97mm mecanum wheels so i'm not sure how that affects required torque if at all. after mechanically designing the robot (backwards process i know), and building the bot, it weighs roughly 30 lbs with the 2 - 12v batteries. i have them connected in series to power a different 24v device on board just fyi. i’m using an arduino with cnc hat that also uses 24v supply to power the 4 steppers. the application is very low speed (0.5 ft/s) and more about positional accuracy than anything. i haven’t wired everything up yet but based on the specs of the steppers listed will they be strong enough? i assume not due to the results i got from the calculator site were 171 ncm per motor… i tried looking around on for dc motors but there are so many and i want to be sure to get something that will work if the stepper’s won’t.", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/n9zrig/specing_motor_for_slow_heavy_robot/", "identifyer": 3506946, "year": "2021"}, {"Unnamed: 0": 1927, "autor": "SouthHurled", "date": 1621774636000, "content": "Where can I get a pneumatic oscillating actuator? /!/ I'm looking for a small oscillating head - like that of an electric toothbrush. It's for a custom drawing tool [https://we.tl/t-fL2jwWos2P](https://we.tl/t-fL2jwWos2P)\n\nAll I am finding are rotary or reciprocating and I need oscillating.\n\n&amp;#x200B;\n\nThanks for any ideas - based in the UK", "link": "https://www.reddit.com/r/robotics/comments/nj789l/where_can_i_get_a_pneumatic_oscillating_actuator/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "where can i get a pneumatic oscillating actuator? /!/ i'm looking for a small oscillating head - like that of an electric toothbrush. it's for a custom drawing -----> tool !!!  [https://we.tl/t-fl2jwwos2p](https://we.tl/t-fl2jwwos2p)\n\nall i am finding are rotary or reciprocating and i need oscillating.\n\n&amp;#x200b;\n\nthanks for any ideas - based in the uk", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/nj789l/where_can_i_get_a_pneumatic_oscillating_actuator/", "identifyer": 3507032, "year": "2021"}, {"Unnamed: 0": 2060, "autor": "Reference-Mobile", "date": 1615423481000, "content": "Find out what career in tech is a best fit for you! We built this free assessment tool using data from our 5 years helping over 1700 students successfully transition into in-demand careers.", "link": "https://www.reddit.com/r/robotics/comments/m2dq3o/find_out_what_career_in_tech_is_a_best_fit_for/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "find out what career in tech is a best fit for you! we built this free assessment -----> tool !!!  using data from our 5 years helping over 1700 students successfully transition into in-demand careers.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "link", "medialink": "https://www.springboard.com/career-assessment-test/", "identifyer": 3507168, "year": "2021"}, {"Unnamed: 0": 2306, "autor": "djaycat", "date": 1632257419000, "content": "What's your why? /!/ Do you build robots because you like to build? Or do you build to make a tool that improves an aspect your life? Or other?", "link": "https://www.reddit.com/r/robotics/comments/psrqcr/whats_your_why/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what's your why? /!/ do you build robots because you like to build? or do you build to make a -----> tool !!!  that improves an aspect your life? or other?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/psrqcr/whats_your_why/", "identifyer": 3507422, "year": "2021"}, {"Unnamed: 0": 2338, "autor": "eshuhie", "date": 1634063020000, "content": "Share your tool setups across your robotics team (Team Layouts) /!/ With v0.19 of the [Foxglove Studio](https://foxglove.dev/) app, you can sync your customized visualization / debugging workspaces (called [layouts](https://foxglove.dev/docs/layouts)) to cloud storage. \n\n&amp;#x200B;\n\n[Example of a custom layout](https://preview.redd.it/oczs8p0la2t71.png?width=2880&amp;format=png&amp;auto=webp&amp;s=7bd21c9dcc3fa4316200a5f6796becc95f14ee6c)\n\nThis allows you to:\n\n* Sync your personal layouts across your devices\n* Collaborate on team layouts with your larger robotics organization\n\nRead the full announcement here: [https://foxglove.dev/blog/announcing-foxglove-for-teams](https://foxglove.dev/blog/announcing-foxglove-for-teams)\n\n# To get started\n\nOpen the Foxglove Studio app ([download here](https://foxglove.dev/download)), then create or sign in to your Foxglove account. From the web console, you can add your teammates by email address. Now, you can create &amp; share layouts with your teammates - inside the Foxglove Studio app, with the click of a button.\n\n[Share your development workspaces &amp; data insights across your robotics team with a single click from within the Foxglove Studio app.](https://preview.redd.it/wg2xyviv82t71.png?width=2099&amp;format=png&amp;auto=webp&amp;s=860d1517b4b77a131d97084e6713c832675158a2)\n\n# Share your feedback\n\nThis is our first team collaboration feature, so we're excited to hear your feedback - share your thoughts with the team on [Slack](https://foxglove.dev/join-slack), [Twitter](https://twitter.com/foxglovedev), or [GitHub](https://github.com/foxglove/studio).", "link": "https://www.reddit.com/r/robotics/comments/q6sdz6/share_your_tool_setups_across_your_robotics_team/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "share your -----> tool !!!  setups across your robotics team (team layouts) /!/ with v0.19 of the [foxglove studio](https://foxglove.dev/) app, you can sync your customized visualization / debugging workspaces (called [layouts](https://foxglove.dev/docs/layouts)) to cloud storage. \n\n&amp;#x200b;\n\n[example of a custom layout](https://preview.redd.it/oczs8p0la2t71.png?width=2880&amp;format=png&amp;auto=webp&amp;s=7bd21c9dcc3fa4316200a5f6796becc95f14ee6c)\n\nthis allows you to:\n\n* sync your personal layouts across your devices\n* collaborate on team layouts with your larger robotics organization\n\nread the full announcement here: [https://foxglove.dev/blog/announcing-foxglove-for-teams](https://foxglove.dev/blog/announcing-foxglove-for-teams)\n\n# to get started\n\nopen the foxglove studio app ([download here](https://foxglove.dev/download)), then create or sign in to your foxglove account. from the web console, you can add your teammates by email address. now, you can create &amp; share layouts with your teammates - inside the foxglove studio app, with the click of a button.\n\n[share your development workspaces &amp; data insights across your robotics team with a single click from within the foxglove studio app.](https://preview.redd.it/wg2xyviv82t71.png?width=2099&amp;format=png&amp;auto=webp&amp;s=860d1517b4b77a131d97084e6713c832675158a2)\n\n# share your feedback\n\nthis is our first team collaboration feature, so we're excited to hear your feedback - share your thoughts with the team on [slack](https://foxglove.dev/join-slack), [twitter](https://twitter.com/foxglovedev), or [github](https://github.com/foxglove/studio).", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/q6sdz6/share_your_tool_setups_across_your_robotics_team/", "identifyer": 3507454, "year": "2021"}, {"Unnamed: 0": 2418, "autor": "pacemarker", "date": 1635217315000, "content": "How to go from toy to tool? /!/ So arm repairs are basically done and now I'd like to set up some robotic milling. It seems like software to do this stuff is really expensive. I've already got ROS MoveIt set up with the arm and I was wondering if I could just buy the fusion license so that I can generate toolpaths for the robot arm and then send some sort of target position to MoveIt. At least as a first step towards something cleaner?", "link": "https://www.reddit.com/r/robotics/comments/qfx5j8/how_to_go_from_toy_to_tool/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how to go from toy to -----> tool !!! ? /!/ so arm repairs are basically done and now i'd like to set up some robotic milling. it seems like software to do this stuff is really expensive. i've already got ros moveit set up with the arm and i was wondering if i could just buy the fusion license so that i can generate toolpaths for the robot arm and then send some sort of target position to moveit. at least as a first step towards something cleaner?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/qfx5j8/how_to_go_from_toy_to_tool/", "identifyer": 3507538, "year": "2021"}, {"Unnamed: 0": 2586, "autor": "nikunjbhoraniya", "date": 1609699062000, "content": "Join OperationExcellence Sub for gettting regular updates of Various Tools and Techniques of Lean Manufacturing, Lean Six Sigma, Core Tool, APQP, PPAP, FMEA, MSA, SPC, 7 QC Tools, Leadersip, Management Skills, VSM Study, 7 Waste, 5S, Kaizen, OEE, Total Productive Maintenance (TPM), Problem Solving t", "link": "https://www.reddit.com/r/robotics/comments/kpq0ku/join_operationexcellence_sub_for_gettting_regular/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "join operationexcellence sub for gettting regular updates of various tools and techniques of lean manufacturing, lean six sigma, core -----> tool !!! , apqp, ppap, fmea, msa, spc, 7 qc tools, leadersip, management skills, vsm study, 7 waste, 5s, kaizen, oee, total productive maintenance (tpm), problem solving t", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/OperationExcellence?utm_medium=android_app&amp;utm_source=share", "identifyer": 3507712, "year": "2021"}, {"Unnamed: 0": 2612, "autor": "boostedsandcrawler", "date": 1613403233000, "content": "6x6 Rover I designed and built to use as a tool to learn how to write software. Purpose is autonomous driving, enhanced driving dynamics and object avoidance. Running manual mode in this shot.", "link": "https://www.reddit.com/r/robotics/comments/lkfz5u/6x6_rover_i_designed_and_built_to_use_as_a_tool/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "6x6 rover i designed and built to use as a -----> tool !!!  to learn how to write software. purpose is autonomous driving, enhanced driving dynamics and object avoidance. running manual mode in this shot.", "sortedWord": "None", "removed": null, "score": 1, "comments": 30, "media": "hosted:video", "medialink": "https://v.redd.it/n7tj2t4lsnh61", "identifyer": 3507739, "year": "2021"}, {"Unnamed: 0": 2769, "autor": "cookedsashimipotato", "date": 1623158435000, "content": "No-code solution to annotate, train, and deploy an AI model to my robot /!/ I was wondering if there is a tool that I can use to create an AI that my robot can use? I understand that I would be able to do this if I created my own annotations, then trained a CNN to do the predictions, but I would much rather no have to go down this route.\n\nHas anyone faced the same problem as me?", "link": "https://www.reddit.com/r/robotics/comments/nv3vc8/nocode_solution_to_annotate_train_and_deploy_an/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "no-code solution to annotate, train, and deploy an ai model to my robot /!/ i was wondering if there is a -----> tool !!!  that i can use to create an ai that my robot can use? i understand that i would be able to do this if i created my own annotations, then trained a cnn to do the predictions, but i would much rather no have to go down this route.\n\nhas anyone faced the same problem as me?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/nv3vc8/nocode_solution_to_annotate_train_and_deploy_an/", "identifyer": 3507899, "year": "2021"}, {"Unnamed: 0": 3067, "autor": "northwestener", "date": 1628358368000, "content": "Robot Selection Help /!/ I need help selecting a robot for an R&amp;D project.\n\nPurpose: to move a pneumatic actuator into position that will press on a part with 2-3kg of force for 10seconds. The robot will be completly stopped when the actuator starts. Speed is not a big issue. Repeatability of 0.05mm would be ideal. Reach needed is about 600mm. End of arm tool will weigh about 2-3kg I'm guessing\n\nI'm nervous about the rigidity of the robot and the external load from the pneumatics will fault or hurt the robot long term.\n\nMy first thought was a fanuc LRMate, but I'm trying to keep my budget to within $15k USD. I've been searching the used market but haven't one and don't know other brands very well. \n\nAny advice is appreciated.", "link": "https://www.reddit.com/r/robotics/comments/ozxtot/robot_selection_help/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "robot selection help /!/ i need help selecting a robot for an r&amp;d project.\n\npurpose: to move a pneumatic actuator into position that will press on a part with 2-3kg of force for 10seconds. the robot will be completly stopped when the actuator starts. speed is not a big issue. repeatability of 0.05mm would be ideal. reach needed is about 600mm. end of arm -----> tool !!!  will weigh about 2-3kg i'm guessing\n\ni'm nervous about the rigidity of the robot and the external load from the pneumatics will fault or hurt the robot long term.\n\nmy first thought was a fanuc lrmate, but i'm trying to keep my budget to within $15k usd. i've been searching the used market but haven't one and don't know other brands very well. \n\nany advice is appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ozxtot/robot_selection_help/", "identifyer": 3508208, "year": "2021"}, {"Unnamed: 0": 3347, "autor": "FoxgloveDev", "date": 1617763052000, "content": "Foxglove Studio - new open source robotics visualization and debugging tool /!/ We recently launched a new open source robotics visualization and debugging tool called [Foxglove Studio](https://foxglove.dev/), and would love feedback from this sub.\n\n[Foxglove visualizing the Udacity CHX\\_001 dataset](https://preview.redd.it/oqekx5s8wnr61.png?width=1113&amp;format=png&amp;auto=webp&amp;s=601bd07dfbfad7aa1ca4d2773d1ac07df9889ab1)\n\nWe built Foxglove to make it easier for robotics developers to debug their locally running or previously recorded robot data. It's cross-platform (written in TypeScript+Electron, the underlying code is also usable in custom web applications), so you can easily remotely connect to a robot running Linux from a Windows or macOS machine.\n\nWe currently support ROS 1 (connect directly to a ROS master, or via a rosbridge websocket) and loading ROS 1 bags (local filesystem or remote http). We plan to add ROS 2 support and other non-ROS formats in the future (let us know what your needs are).\n\nQuestions/feedback appreciated!\n\n[https://foxglove.dev/](https://foxglove.dev/)\n\n[https://github.com/foxglove/studio](https://github.com/foxglove/studio)\n\nPS - for those of you who have seen or used [Webviz](https://github.com/cruise-automation/webviz), Foxglove may look familiar. Some of our team previously worked on Webviz at Cruise, and we reused much of their code, although it has been heavily refactored, several new features added, and we have more coming soon.", "link": "https://www.reddit.com/r/robotics/comments/mlsbd0/foxglove_studio_new_open_source_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "foxglove studio - new open source robotics visualization and debugging -----> tool !!!  /!/ we recently launched a new open source robotics visualization and debugging tool called [foxglove studio](https://foxglove.dev/), and would love feedback from this sub.\n\n[foxglove visualizing the udacity chx\\_001 dataset](https://preview.redd.it/oqekx5s8wnr61.png?width=1113&amp;format=png&amp;auto=webp&amp;s=601bd07dfbfad7aa1ca4d2773d1ac07df9889ab1)\n\nwe built foxglove to make it easier for robotics developers to debug their locally running or previously recorded robot data. it's cross-platform (written in typescript+electron, the underlying code is also usable in custom web applications), so you can easily remotely connect to a robot running linux from a windows or macos machine.\n\nwe currently support ros 1 (connect directly to a ros master, or via a rosbridge websocket) and loading ros 1 bags (local filesystem or remote http). we plan to add ros 2 support and other non-ros formats in the future (let us know what your needs are).\n\nquestions/feedback appreciated!\n\n[https://foxglove.dev/](https://foxglove.dev/)\n\n[https://github.com/foxglove/studio](https://github.com/foxglove/studio)\n\nps - for those of you who have seen or used [webviz](https://github.com/cruise-automation/webviz), foxglove may look familiar. some of our team previously worked on webviz at cruise, and we reused much of their code, although it has been heavily refactored, several new features added, and we have more coming soon.", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mlsbd0/foxglove_studio_new_open_source_robotics/", "identifyer": 3508494, "year": "2021"}, {"Unnamed: 0": 3523, "autor": "eshuhie", "date": 1634589990000, "content": "Manage your team's robotics data in one central platform, for easier discovery, exploration, &amp; analysis /!/ Today, our team is extremely proud to announce [Foxglove Data Platform](https://foxglove.dev/data-platform) \\- a scalable new service to explore, manage, &amp; analyze your team’s robotics data! \n\nFoxglove Data Platform was born from the idea that you should be able to find, explore, and understand your data at lightning speed \n\n* Convenient **web interface, API endpoints, and CLI tool** let you upload data to a central team repository\n* **Strategic data partitioning / indexing** helps you retrieve the information you need efficiently\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7m706wkot9u71.png?width=942&amp;format=png&amp;auto=webp&amp;s=423291547caf97be6430c6b840cc24b7847a5d26\n\nWe hope Foxglove Data Platform helps your robotics team spend less time wrangling bag files and more time iterating on your robots.\n\n**Read the full announcement below:**\n\n[**https://foxglove.dev/blog/manage-your-robotics-data-with-foxglove-data-platform**](https://foxglove.dev/blog/manage-your-robotics-data-with-foxglove-data-platform)", "link": "https://www.reddit.com/r/robotics/comments/qavntf/manage_your_teams_robotics_data_in_one_central/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "manage your team's robotics data in one central platform, for easier discovery, exploration, &amp; analysis /!/ today, our team is extremely proud to announce [foxglove data platform](https://foxglove.dev/data-platform) \\- a scalable new service to explore, manage, &amp; analyze your team’s robotics data! \n\nfoxglove data platform was born from the idea that you should be able to find, explore, and understand your data at lightning speed \n\n* convenient **web interface, api endpoints, and cli -----> tool !!! ** let you upload data to a central team repository\n* **strategic data partitioning / indexing** helps you retrieve the information you need efficiently\n\n&amp;#x200b;\n\nhttps://preview.redd.it/7m706wkot9u71.png?width=942&amp;format=png&amp;auto=webp&amp;s=423291547caf97be6430c6b840cc24b7847a5d26\n\nwe hope foxglove data platform helps your robotics team spend less time wrangling bag files and more time iterating on your robots.\n\n**read the full announcement below:**\n\n[**https://foxglove.dev/blog/manage-your-robotics-data-with-foxglove-data-platform**](https://foxglove.dev/blog/manage-your-robotics-data-with-foxglove-data-platform)", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/qavntf/manage_your_teams_robotics_data_in_one_central/", "identifyer": 3508672, "year": "2021"}, {"Unnamed: 0": 3572, "autor": "robo4869", "date": 1634390928000, "content": "A platform for a virtual RL self-driving car /!/ Hi everyone,\n\nI'm an undergraduate student. I am working on the autonomous vehicle with RL project and am having trouble choosing a tool to build a simulation environment for the RL algorithm. I have tried CARLA but it is also quite demanding on hardware, can you help me?\n\nThanks a lot @@@", "link": "https://www.reddit.com/r/robotics/comments/q9c0b1/a_platform_for_a_virtual_rl_selfdriving_car/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a platform for a virtual rl self-driving car /!/ hi everyone,\n\ni'm an undergraduate student. i am working on the autonomous vehicle with rl project and am having trouble choosing a -----> tool !!!  to build a simulation environment for the rl algorithm. i have tried carla but it is also quite demanding on hardware, can you help me?\n\nthanks a lot @@@", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/q9c0b1/a_platform_for_a_virtual_rl_selfdriving_car/", "identifyer": 3508723, "year": "2021"}, {"Unnamed: 0": 3647, "autor": "lessthanoptimal", "date": 1633445168000, "content": "New Camera Calibration Tool for Monocular and Stereo Cameras", "link": "https://www.reddit.com/r/robotics/comments/q1xurl/new_camera_calibration_tool_for_monocular_and/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new camera calibration -----> tool !!!  for monocular and stereo cameras", "sortedWord": "None", "removed": null, "score": 4, "comments": 2, "media": "rich:video", "medialink": "https://youtu.be/wgPzlokxbXw", "identifyer": 3508800, "year": "2021"}, {"Unnamed: 0": 3648, "autor": "barackoghanja", "date": 1633443701000, "content": "Do standards exist for fast tool changes on the end effector of robot arms? /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/q1xe5a/do_standards_exist_for_fast_tool_changes_on_the/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "do standards exist for fast -----> tool !!!  changes on the end effector of robot arms? /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/q1xe5a/do_standards_exist_for_fast_tool_changes_on_the/", "identifyer": 3508801, "year": "2021"}, {"Unnamed: 0": 3665, "autor": "hans-hearth", "date": 1633354629000, "content": "Pointers on programming the Tool Center Point for an articulating robot /!/ Hi there, I have a 5 axes articulating robot similar to [this](https://youtu.be/_B3gWd3A_SI). Currently it's motion is controlled by moving each individual joint as shown in that video. \n\nCould anyone in this subreddit point me to resources such that I can program it to move the tool center point for my gripper.\nI understand the kinematics would a little more complicated, but I appreciate any pointers.", "link": "https://www.reddit.com/r/robotics/comments/q15ld7/pointers_on_programming_the_tool_center_point_for/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "pointers on programming the -----> tool !!!  center point for an articulating robot /!/ hi there, i have a 5 axes articulating robot similar to [this](https://youtu.be/_b3gwd3a_si). currently it's motion is controlled by moving each individual joint as shown in that video. \n\ncould anyone in this subreddit point me to resources such that i can program it to move the tool center point for my gripper.\ni understand the kinematics would a little more complicated, but i appreciate any pointers.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/q15ld7/pointers_on_programming_the_tool_center_point_for/", "identifyer": 3508819, "year": "2021"}, {"Unnamed: 0": 3853, "autor": "SouthHurled", "date": 1630688169000, "content": "Drag and drop learning resource /!/ As a complete novice I'm looking for a tool - browser based or software - that helps you design simple mechanical builds. For example, I want to build a reciprocating rod attached to a DC motor. \n\nAre there any tools, programs that can help with simulating simple builds like this?\n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/robotics/comments/ph95if/drag_and_drop_learning_resource/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "drag and drop learning resource /!/ as a complete novice i'm looking for a -----> tool !!!  - browser based or software - that helps you design simple mechanical builds. for example, i want to build a reciprocating rod attached to a dc motor. \n\nare there any tools, programs that can help with simulating simple builds like this?\n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ph95if/drag_and_drop_learning_resource/", "identifyer": 3509014, "year": "2021"}, {"Unnamed: 0": 4173, "autor": "Naversnik", "date": 1619510308000, "content": "Hello, i'm doing a project in RobotStudio and i'm completly stuck and in need of help /!/ So my project is: using soft servo to make the robot fit the current tool in the hole if the tool is not directly above the hole (So it is offset by a bit). I've added a gif for extra clerification. Right now i've managed to simulate this but i can't get any further... I'm simply stuck i can't figure out how to make the program work... i don't know what i'm doing wrong so i'm in desperate need of help. If there are any suggestions i'd greatly appreciate it!! (also the program isn't working as intended)\n\nhttps://i.redd.it/rwh67lxf9ov61.gif\n\nhttps://preview.redd.it/0dp09kpg9ov61.png?width=592&amp;format=png&amp;auto=webp&amp;s=1c6579372098ed6d5b5a30fd50dad9576281bfc7", "link": "https://www.reddit.com/r/robotics/comments/mzjcr3/hello_im_doing_a_project_in_robotstudio_and_im/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "hello, i'm doing a project in robotstudio and i'm completly stuck and in need of help /!/ so my project is: using soft servo to make the robot fit the current -----> tool !!!  in the hole if the -----> tool !!!  is not directly above the hole (so it is offset by a bit). i've added a gif for extra clerification. right now i've managed to simulate this but i can't get any further... i'm simply stuck i can't figure out how to make the program work... i don't know what i'm doing wrong so i'm in desperate need of help. if there are any suggestions i'd greatly appreciate it!! (also the program isn't working as intended)\n\nhttps://i.redd.it/rwh67lxf9ov61.gif\n\nhttps://preview.redd.it/0dp09kpg9ov61.png?width=592&amp;format=png&amp;auto=webp&amp;s=1c6579372098ed6d5b5a30fd50dad9576281bfc7", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mzjcr3/hello_im_doing_a_project_in_robotstudio_and_im/", "identifyer": 3509345, "year": "2021"}, {"Unnamed: 0": 4188, "autor": "alohamanMr", "date": 1619429479000, "content": "What's your tool for diagrams? /!/ There are a number of labs/companies out there with high-quality technical diagrams of their robots. They show frames, transforms, rotation directions, sensor FoV etc.  Usually the \"simpler\" the diagram the clearer it is. But I'm struggling to find the right tool for the job. Things I've considered are:\n\n[Draw.io](https://Draw.io) \\--&gt; nice basic shapes but difficult to work in 3D. Objects don't like to overlap. \n\nStraight up RViz --&gt; Taking rviz screenshots and painting over them looks \"flashy\" but is a lot of work and in the end is bit overcomplex for simple diagrams. \n\nThis is a great [example](https://www.researchgate.net/publication/345902778/figure/fig5/AS:963467624329239@1606719990595/Setup-diagram-A-available-stones-B-constructed-wall-C-search-space-D-rim-path-with_W640.jpg)  of what I mean and what I'm looking for. Tho this paper is in collab with architects who probably used some dance graphical design tools. But is there a \"simpler\" way to do this? For example, simpler [wireframe](https://www.greatamericaninsurancegroup.com/images/default-source/corporate/news/robot-diagram.jpg) diagrams also look nice and clear, but I have no idea how they are made.\n\nAlso, how are images like [this](https://www.researchgate.net/profile/Shehryar-Khattak/publication/345767007/figure/fig1/AS:957038012162052@1605187051817/ANYmal-during-an-autonomous-exploration-and-mapping-mission-at-ETH-Zuerich-with-the_W640.jpg) made? Looks like you'd have to align the picture frame with the data? Which means - it took a while?", "link": "https://www.reddit.com/r/robotics/comments/mytsaf/whats_your_tool_for_diagrams/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what's your -----> tool !!!  for diagrams? /!/ there are a number of labs/companies out there with high-quality technical diagrams of their robots. they show frames, transforms, rotation directions, sensor fov etc.  usually the \"simpler\" the diagram the clearer it is. but i'm struggling to find the right tool for the job. things i've considered are:\n\n[draw.io](https://draw.io) \\--&gt; nice basic shapes but difficult to work in 3d. objects don't like to overlap. \n\nstraight up rviz --&gt; taking rviz screenshots and painting over them looks \"flashy\" but is a lot of work and in the end is bit overcomplex for simple diagrams. \n\nthis is a great [example](https://www.researchgate.net/publication/345902778/figure/fig5/as:963467624329239@1606719990595/setup-diagram-a-available-stones-b-constructed-wall-c-search-space-d-rim-path-with_w640.jpg)  of what i mean and what i'm looking for. tho this paper is in collab with architects who probably used some dance graphical design tools. but is there a \"simpler\" way to do this? for example, simpler [wireframe](https://www.greatamericaninsurancegroup.com/images/default-source/corporate/news/robot-diagram.jpg) diagrams also look nice and clear, but i have no idea how they are made.\n\nalso, how are images like [this](https://www.researchgate.net/profile/shehryar-khattak/publication/345767007/figure/fig1/as:957038012162052@1605187051817/anymal-during-an-autonomous-exploration-and-mapping-mission-at-eth-zuerich-with-the_w640.jpg) made? looks like you'd have to align the picture frame with the data? which means - it took a while?", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/mytsaf/whats_your_tool_for_diagrams/", "identifyer": 3509360, "year": "2021"}, {"Unnamed: 0": 4263, "autor": "thrillux", "date": 1623017388000, "content": "o mighty automaton gods, hear my plea for wisdom on modular robotics components design /!/ *Places a bag of random motor HATs, sensors, steppers and servos on a shrine-looking rock and addresses the sky* \n\nI'm going for as close as possible to a set of interchangable robotic body components.\n\nWhat would be simplest / most cost effective:\n\n1. Driving parts centrally via a bus type connector for power and sensors. from like a single pi\n2. Pi pico on every part\n\nLet's say I want to a few components like:\n\n1. Really strong direct drive high torque motors for serious leg (MIT mini cheetah / atlas type) parts\n2. A variety of different strength servo components\n3. Some stepper components with like NEMA 17 - NEMA 34 or whatever the bigguns are.\n\nWhat's a good way to simplify power distribution and regulation throughout the body / its parts?\n\nI don't want to buy a specific power supply for a specific robot config, I'd be looking to have a few different levels of say battery pack that can just be slapped in.  Maybe on a linear or fibonnaci scale of power levels it can supply a robot \n\n&amp;#x200B;\n\n1. A little RC car would take a little power pack\n2. A desktop robot arm would get a power-tool level battery pack\n3. A 3 ft mechanical spider intended to be able to do a backflip would get the next size up\n\n&amp;#x200B;\n\nWhat's the simplest way to supply power throughout the robot body part connections, (I imagine like a central nervous system branching out) so that I can have body components draw what power they need and work consistently regardless of what the other components are doing - For example, a small pinchy claw - I'd like to be able to connect it to a RC car size robot (lil power pack) through a common power/communication bus connection and work properly, OR a giant robot spider and over that connection have no issue with having access to the power to do a backflip.\n\nI have a few hunches about what ya'll might say - I understand that say a USB-C 3.1 port as the interface between components would work fine up to what, 90w or whatever the limit for power delivery is and fry out if used for anything more demanding.\n\n&amp;#x200B;\n\nSo I'm thinking maybe the direct connection interfaces between components could be comm-oriented - not carrying power for driving motors. just PI components and comms\n\nThen each component would be designed so it accommodates, i guess you could think of it as arteries / veins that are like a secondary set of components that are layered in/on the robot just for carrying the highest power needed by any components further along down its anatomy (shoulder - upper arm high level power... tube.. or something.. that would be connected to a step-down part for the smaller  power levels required by the little finger servos if they were all running at full strain at once.\n\nI know this must sound like the rambling of a total noob that has a long way to go before attempting to answer would be comprehended or worthwhile, but toss me any thoughts at all and I will treat thre like golden breadcrumbs and clues from the sky and it WILL help greatly.\n\nI am really shooting high here and I've learned a ton already, but I don't know how to frame my questions properly yet, or what to search for to find the right, say, Adafruit components / etc that might already exist in the pi ecosystem that do exactly what I'm talking about. - So please see past my poorly framed words and try to translate it into as much sense as you can make it :)\n\nOverall I really want to get some modular robotics bits going to move fast and design prototype test bigger ideas, so whatever i can do to make it as easy as possible to mix and match robo components, slap on a strong enough battery, and abstract away as much gruelling electronics tedium as possible would be soooo welcome.\n\nI'd totally pay someone for short bits of their free time to just let me ask a series of questions here and there to get quickly set straight or told \"sounds like you're talking about xyz\" because I just haven't yet heard \"xyz\" so my searches with blathering lay-queries come up empty sometimes", "link": "https://www.reddit.com/r/robotics/comments/ntx0eh/o_mighty_automaton_gods_hear_my_plea_for_wisdom/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "o mighty automaton gods, hear my plea for wisdom on modular robotics components design /!/ *places a bag of random motor hats, sensors, steppers and servos on a shrine-looking rock and addresses the sky* \n\ni'm going for as close as possible to a set of interchangable robotic body components.\n\nwhat would be simplest / most cost effective:\n\n1. driving parts centrally via a bus type connector for power and sensors. from like a single pi\n2. pi pico on every part\n\nlet's say i want to a few components like:\n\n1. really strong direct drive high torque motors for serious leg (mit mini cheetah / atlas type) parts\n2. a variety of different strength servo components\n3. some stepper components with like nema 17 - nema 34 or whatever the bigguns are.\n\nwhat's a good way to simplify power distribution and regulation throughout the body / its parts?\n\ni don't want to buy a specific power supply for a specific robot config, i'd be looking to have a few different levels of say battery pack that can just be slapped in.  maybe on a linear or fibonnaci scale of power levels it can supply a robot \n\n&amp;#x200b;\n\n1. a little rc car would take a little power pack\n2. a desktop robot arm would get a power------> tool !!!  level battery pack\n3. a 3 ft mechanical spider intended to be able to do a backflip would get the next size up\n\n&amp;#x200b;\n\nwhat's the simplest way to supply power throughout the robot body part connections, (i imagine like a central nervous system branching out) so that i can have body components draw what power they need and work consistently regardless of what the other components are doing - for example, a small pinchy claw - i'd like to be able to connect it to a rc car size robot (lil power pack) through a common power/communication bus connection and work properly, or a giant robot spider and over that connection have no issue with having access to the power to do a backflip.\n\ni have a few hunches about what ya'll might say - i understand that say a usb-c 3.1 port as the interface between components would work fine up to what, 90w or whatever the limit for power delivery is and fry out if used for anything more demanding.\n\n&amp;#x200b;\n\nso i'm thinking maybe the direct connection interfaces between components could be comm-oriented - not carrying power for driving motors. just pi components and comms\n\nthen each component would be designed so it accommodates, i guess you could think of it as arteries / veins that are like a secondary set of components that are layered in/on the robot just for carrying the highest power needed by any components further along down its anatomy (shoulder - upper arm high level power... tube.. or something.. that would be connected to a step-down part for the smaller  power levels required by the little finger servos if they were all running at full strain at once.\n\ni know this must sound like the rambling of a total noob that has a long way to go before attempting to answer would be comprehended or worthwhile, but toss me any thoughts at all and i will treat thre like golden breadcrumbs and clues from the sky and it will help greatly.\n\ni am really shooting high here and i've learned a ton already, but i don't know how to frame my questions properly yet, or what to search for to find the right, say, adafruit components / etc that might already exist in the pi ecosystem that do exactly what i'm talking about. - so please see past my poorly framed words and try to translate it into as much sense as you can make it :)\n\noverall i really want to get some modular robotics bits going to move fast and design prototype test bigger ideas, so whatever i can do to make it as easy as possible to mix and match robo components, slap on a strong enough battery, and abstract away as much gruelling electronics tedium as possible would be soooo welcome.\n\ni'd totally pay someone for short bits of their free time to just let me ask a series of questions here and there to get quickly set straight or told \"sounds like you're talking about xyz\" because i just haven't yet heard \"xyz\" so my searches with blathering lay-queries come up empty sometimes", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ntx0eh/o_mighty_automaton_gods_hear_my_plea_for_wisdom/", "identifyer": 3509437, "year": "2021"}, {"Unnamed: 0": 4316, "autor": "L_Amenya", "date": 1622792860000, "content": "ROS2 Basics for Python /!/ **ROS2 Basics for Python Course 👉**\n\n[https://www.theconstructsim.com/robotigniteacademy\\_learnros/ros-courses-library/ros2-basics-python/](https://www.theconstructsim.com/robotigniteacademy_learnros/ros-courses-library/ros2-basics-python/)\n\n*Processing img b339lkuke7371...*\n\n&amp;#x200B;\n\n[Services](https://preview.redd.it/6xdiq4pne7371.png?width=1926&amp;format=png&amp;auto=webp&amp;s=2b8db9a4ed9e5d41ce4d1bb5c074157f6bbfabbd)\n\n&amp;#x200B;\n\n[Actions](https://preview.redd.it/9dxv1wape7371.png?width=1724&amp;format=png&amp;auto=webp&amp;s=2396b4af7a0b4f303a0f79b496beed5dd34f8ad3)\n\n**Exercises you will be doing**\n\n**Topics**\n\n* Control the TurtleBot3 robot based on the laser readings.\n\n**Services**\n\n* Create a service to control the TurtleBot3 robot using input strings.\n\n**Actions**\n\n* Create a custom action to control the TurtleBot3 robot while reading the robot’s status.\n\n**Course Summary**\n\n**Unit 1: Introduction to the ROS2 Basics Python Course**\n\nA brief introduction to the concepts you will be covering during the course.\n\n**Unit 2: Basic Concepts**\n\nStructure and launch ROS2 programs (packages and launch files)\n\nCreate basic ROS2 programs (Python-based)\n\nBasic ROS2 concepts: nodes, client libraries, etc.\n\n**Unit 3: ROS2 Topics**\n\nTopics\n\nBasic topic commands\n\nTopic publishers\n\nTopic subscribers\n\nHow to mix publishers and subscribers\n\nCustomer interfaces\n\n**Unit 4: ROS2 Services**\n\nServices\n\nBasic service commands\n\nService clients\n\nService servers\n\nCustom interfaces\n\n**Unit 5: ROS2 Actions**\n\nActions\n\nCall on action\n\nWrite an action server\n\nWrite an action server\n\nCreate an action interface\n\nUse your action interface\n\n**Unit 6: Debugging Tools**\n\nHow to use logs in ROS2\n\nBasic use of RVIZ2 debugging tool\n\nview\\_frames tool\n\nROS2 Doctor", "link": "https://www.reddit.com/r/robotics/comments/nrzhm1/ros2_basics_for_python/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ros2 basics for python /!/ **ros2 basics for python course 👉**\n\n[https://www.theconstructsim.com/robotigniteacademy\\_learnros/ros-courses-library/ros2-basics-python/](https://www.theconstructsim.com/robotigniteacademy_learnros/ros-courses-library/ros2-basics-python/)\n\n*processing img b339lkuke7371...*\n\n&amp;#x200b;\n\n[services](https://preview.redd.it/6xdiq4pne7371.png?width=1926&amp;format=png&amp;auto=webp&amp;s=2b8db9a4ed9e5d41ce4d1bb5c074157f6bbfabbd)\n\n&amp;#x200b;\n\n[actions](https://preview.redd.it/9dxv1wape7371.png?width=1724&amp;format=png&amp;auto=webp&amp;s=2396b4af7a0b4f303a0f79b496beed5dd34f8ad3)\n\n**exercises you will be doing**\n\n**topics**\n\n* control the turtlebot3 robot based on the laser readings.\n\n**services**\n\n* create a service to control the turtlebot3 robot using input strings.\n\n**actions**\n\n* create a custom action to control the turtlebot3 robot while reading the robot’s status.\n\n**course summary**\n\n**unit 1: introduction to the ros2 basics python course**\n\na brief introduction to the concepts you will be covering during the course.\n\n**unit 2: basic concepts**\n\nstructure and launch ros2 programs (packages and launch files)\n\ncreate basic ros2 programs (python-based)\n\nbasic ros2 concepts: nodes, client libraries, etc.\n\n**unit 3: ros2 topics**\n\ntopics\n\nbasic topic commands\n\ntopic publishers\n\ntopic subscribers\n\nhow to mix publishers and subscribers\n\ncustomer interfaces\n\n**unit 4: ros2 services**\n\nservices\n\nbasic service commands\n\nservice clients\n\nservice servers\n\ncustom interfaces\n\n**unit 5: ros2 actions**\n\nactions\n\ncall on action\n\nwrite an action server\n\nwrite an action server\n\ncreate an action interface\n\nuse your action interface\n\n**unit 6: debugging tools**\n\nhow to use logs in ros2\n\nbasic use of rviz2 debugging -----> tool !!! \n\nview\\_frames -----> tool !!! \n\nros2 doctor", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/nrzhm1/ros2_basics_for_python/", "identifyer": 3509494, "year": "2021"}, {"Unnamed: 0": 4417, "autor": "TheProffalken", "date": 1623782526000, "content": "I've released an open source inventory management tool that I'm hoping helps people like us organise their workspaces more efficiently! /!/ Hey all,\n\nI've just released the first version of my new inventory system to help anyone who needs to track \"stuff\" log where it is and how much they have of it.\n\nYou can download the source from https://github.com/proffalken/mventory and there are docker containers for AMD64, ARMv6, ARMv7, and ARM64 so it should run on just about any hardware.\n\nIt's entirely API-driven, although you can use the Django Admin interface if you want a GUI for adding components, and at the moment it just lists items by location - search will be coming soon.\n\nI'm hoping to integrate it with octopart in future as well, and I'd love other people to get involved even if it's writing a GUI in another language that talks to the API!\n\nLet me know what you think!", "link": "https://www.reddit.com/r/robotics/comments/o0lfn7/ive_released_an_open_source_inventory_management/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i've released an open source inventory management -----> tool !!!  that i'm hoping helps people like us organise their workspaces more efficiently! /!/ hey all,\n\ni've just released the first version of my new inventory system to help anyone who needs to track \"stuff\" log where it is and how much they have of it.\n\nyou can download the source from https://github.com/proffalken/mventory and there are docker containers for amd64, armv6, armv7, and arm64 so it should run on just about any hardware.\n\nit's entirely api-driven, although you can use the django admin interface if you want a gui for adding components, and at the moment it just lists items by location - search will be coming soon.\n\ni'm hoping to integrate it with octopart in future as well, and i'd love other people to get involved even if it's writing a gui in another language that talks to the api!\n\nlet me know what you think!", "sortedWord": "None", "removed": null, "score": 3, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/o0lfn7/ive_released_an_open_source_inventory_management/", "identifyer": 3509595, "year": "2021"}, {"Unnamed: 0": 4507, "autor": "Real_Source7831", "date": 1617457439000, "content": "How to make a robot arm (6 DOF) go straight down? /!/ Hey. I am building a system that the robot is pick the cd on top of the stack and put it in the dc draw. It is arduino beast. Any program that can make the arm go straight down with the tool? Remember low budget.\n\nThanks in advance.", "link": "https://www.reddit.com/r/robotics/comments/mj8rjr/how_to_make_a_robot_arm_6_dof_go_straight_down/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how to make a robot arm (6 dof) go straight down? /!/ hey. i am building a system that the robot is pick the cd on top of the stack and put it in the dc draw. it is arduino beast. any program that can make the arm go straight down with the -----> tool !!! ? remember low budget.\n\nthanks in advance.", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mj8rjr/how_to_make_a_robot_arm_6_dof_go_straight_down/", "identifyer": 3509688, "year": "2021"}, {"Unnamed: 0": 4660, "autor": "thtRobotics", "date": 1630476476000, "content": "Programming Collaborative robots with OpenAI Codex! We wanted to test and see if new machine learning tool OpenAI Codex can help us in writing code for programming Collaborative robots. It worked! See the preview below and full video here: https://youtu.be/gre8DX8m6U8.", "link": "https://www.reddit.com/r/robotics/comments/pfnvgs/programming_collaborative_robots_with_openai/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "programming collaborative robots with openai codex! we wanted to test and see if new machine learning -----> tool !!!  openai codex can help us in writing code for programming collaborative robots. it worked! see the preview below and full video here: https://youtu.be/gre8dx8m6u8.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "hosted:video", "medialink": "https://v.redd.it/6v16c5uk1uk71", "identifyer": 3509847, "year": "2021"}, {"Unnamed: 0": 4697, "autor": "Robotics420", "date": 1619086784000, "content": "Manufactors Conversion /!/ Can I convert a Kawasaki program into an ABB ?\n\n&amp;#x200B;\n\nI know i can convert X,Y and Z, but i need the tool angles too and i can't do that", "link": "https://www.reddit.com/r/robotics/comments/mw1o2d/manufactors_conversion/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "manufactors conversion /!/ can i convert a kawasaki program into an abb ?\n\n&amp;#x200b;\n\ni know i can convert x,y and z, but i need the -----> tool !!!  angles too and i can't do that", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/mw1o2d/manufactors_conversion/", "identifyer": 3509885, "year": "2021"}, {"Unnamed: 0": 4861, "autor": "dmalawey", "date": 1618521210000, "content": "nice tool if you don’t have your own app 😊", "link": "https://www.reddit.com/r/robotics/comments/mroabi/nice_tool_if_you_dont_have_your_own_app/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "nice -----> tool !!!  if you don’t have your own app 😊", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/gallery/mro8vz", "identifyer": 3510054, "year": "2021"}], "name": "toolrobotics2021"}