{"interestingcomments": [{"Unnamed: 0": 133, "autor": "CitizenShips", "date": 1580820680000, "content": "[Q] Are there any good swarm robotics resources out there? /!/ I'm gearing up to start a project to create a basic swarm platform to tool around with. I have some ideas for synchronization, mapping, and job handling, but I'd like to read some literature on the subject as I don't have much of a clue about the current state of the field. Additionally, if anyone has any recommendations for modeling toolkits (I was just going to use Octave), I'd appreciate it. I haven't built even a rudimentary robot in a long time, so I need all the help I can get.", "link": "https://www.reddit.com/r/robotics/comments/eypl2p/q_are_there_any_good_swarm_robotics_resources_out/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[q] are there any good swarm robotics resources out there? /!/ i'm gearing up to start a project to create a basic swarm platform to -----> tool !!!  around with. i have some ideas for synchronization, mapping, and job handling, but i'd like to read some literature on the subject as i don't have much of a clue about the current state of the field. additionally, if anyone has any recommendations for modeling toolkits (i was just going to use octave), i'd appreciate it. i haven't built even a rudimentary robot in a long time, so i need all the help i can get.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/eypl2p/q_are_there_any_good_swarm_robotics_resources_out/", "identifyer": 3500134, "year": "2020"}, {"Unnamed: 0": 164, "autor": "Shiva_uchiha", "date": 1580627104000, "content": "[Question] Incorporating tool offset in robot arm kinematic model /!/ Hi! I am new to kinematics, have mostly worked on the software side. I want to build my own ForwardK and InverseK solver and visualize it in MATLAB.\n\nI have roughly worked out how to implement ForwardK using DH parameter, I build a homogenous matrix and use it to find the position of the end effector. However the issue was how do , I incorporate a tool offset into the calculation.\n\nI understand the tool offset is an offset from TCP and is defined in terms of TCP reference frame. I am confused on how to find its location with respect to the base reference frame.\n\nThe program function should be like this\n\nInput:(Joint position space(J1,J2,J3 .... such that Ji represent angle), tool offset(x,y,z)(yaw,pitch,roll)) Output:((x,y,z)(yaw,pitch,roll) about TCP)", "link": "https://www.reddit.com/r/robotics/comments/exkp3z/question_incorporating_tool_offset_in_robot_arm/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[question] incorporating -----> tool !!!  offset in robot arm kinematic model /!/ hi! i am new to kinematics, have mostly worked on the software side. i want to build my own forwardk and inversek solver and visualize it in matlab.\n\ni have roughly worked out how to implement forwardk using dh parameter, i build a homogenous matrix and use it to find the position of the end effector. however the issue was how do , i incorporate a tool offset into the calculation.\n\ni understand the tool offset is an offset from tcp and is defined in terms of tcp reference frame. i am confused on how to find its location with respect to the base reference frame.\n\nthe program function should be like this\n\ninput:(joint position space(j1,j2,j3 .... such that ji represent angle), tool offset(x,y,z)(yaw,pitch,roll)) output:((x,y,z)(yaw,pitch,roll) about tcp)", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/exkp3z/question_incorporating_tool_offset_in_robot_arm/", "identifyer": 3500166, "year": "2020"}, {"Unnamed: 0": 526, "autor": "FreedomRobotics", "date": 1596499355000, "content": "A new tool to mitigate robot bugs and issues related to system resources /!/ TLDR: We built a tool - [The Freedom Resource Monitor](https://www.freedomrobotics.ai/blog/robotics-resource-monitor?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror) \\- to log and monitor system resources on any robot (GPU, network connectivity, topic data, webRTC diagnostics). It’s all logged historically so you can go back in time... and [we're giving it away for free for a year here](https://app.freedomrobotics.ai/#/signup?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror).\n\n\\----\n\nWe've experienced our fair share of robots that seem to randomly stop dead in their tracks and it's never as simple as a broken actuator. Instead we call it the butterfly effect of robotics and it always seems to be because of various cpu/memory/process/gpu/temperature issues that lead to the eventual failure of a core component in the robot. \n\n[Freedom Robotics Resource Monitor shows network utilization for the robot and breaks that utilization down by topic showing individual message size and bandwidth attributed to each datapoint. Upload exactly what you need and no more.](https://preview.redd.it/a2atsmbnmve51.png?width=1311&amp;format=png&amp;auto=webp&amp;s=13dbc2cfb9197e11a59b0a99d55230fc3562fb53)\n\nFor example:\n\nFull usage of the GPU, combined with poor cooling, increased the temperature of the unit and the CPU switched to a lower-compute mode. Perception algorithms weren’t able to keep up with the frame rate, so frame callbacks start to stack up with unstable consequences. Finally motor updates slowed down and became unstable, which created a resonance in the robot. All of this was identified and tracked by viewing historical system resources.\n\nIf this sounds like a familiar problem, we would love to hear about your experiences as well as any feedback you have from trying out the tool! Check out our announcement [blog here](https://www.freedomrobotics.ai/blog/robotics-resource-monitor?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror)!", "link": "https://www.reddit.com/r/robotics/comments/i38q50/a_new_tool_to_mitigate_robot_bugs_and_issues/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a new -----> tool !!!  to mitigate robot bugs and issues related to system resources /!/ tldr: we built a -----> tool !!!  - [the freedom resource monitor](https://www.freedomrobotics.ai/blog/robotics-resource-monitor?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror) \\- to log and monitor system resources on any robot (gpu, network connectivity, topic data, webrtc diagnostics). it’s all logged historically so you can go back in time... and [we're giving it away for free for a year here](https://app.freedomrobotics.ai/#/signup?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror).\n\n\\----\n\nwe've experienced our fair share of robots that seem to randomly stop dead in their tracks and it's never as simple as a broken actuator. instead we call it the butterfly effect of robotics and it always seems to be because of various cpu/memory/process/gpu/temperature issues that lead to the eventual failure of a core component in the robot. \n\n[freedom robotics resource monitor shows network utilization for the robot and breaks that utilization down by topic showing individual message size and bandwidth attributed to each datapoint. upload exactly what you need and no more.](https://preview.redd.it/a2atsmbnmve51.png?width=1311&amp;format=png&amp;auto=webp&amp;s=13dbc2cfb9197e11a59b0a99d55230fc3562fb53)\n\nfor example:\n\nfull usage of the gpu, combined with poor cooling, increased the temperature of the unit and the cpu switched to a lower-compute mode. perception algorithms weren’t able to keep up with the frame rate, so frame callbacks start to stack up with unstable consequences. finally motor updates slowed down and became unstable, which created a resonance in the robot. all of this was identified and tracked by viewing historical system resources.\n\nif this sounds like a familiar problem, we would love to hear about your experiences as well as any feedback you have from trying out the tool! check out our announcement [blog here](https://www.freedomrobotics.ai/blog/robotics-resource-monitor?utm_source=reddit&amp;utm_medium=organic+social&amp;utm_campaign=g20_ror)!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/i38q50/a_new_tool_to_mitigate_robot_bugs_and_issues/", "identifyer": 3500530, "year": "2020"}, {"Unnamed: 0": 527, "autor": "FreedomRobotics", "date": 1596499141000, "content": "A new tool to mitigate robot bugs and issues related to system resources /!/ [removed]", "link": "https://www.reddit.com/r/robotics/comments/i38o31/a_new_tool_to_mitigate_robot_bugs_and_issues/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a new -----> tool !!!  to mitigate robot bugs and issues related to system resources /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/i38o31/a_new_tool_to_mitigate_robot_bugs_and_issues/", "identifyer": 3500531, "year": "2020"}, {"Unnamed: 0": 668, "autor": "another_statistic123", "date": 1599343381000, "content": "Flux: a cool threejs powered google docs style collaborative hardware/circuit design tool in early access: /!/ [https://medium.com/buildwithflux/flux-is-the-collaborative-circuit-design-platform-youve-been-waiting-for-72dd7fcc2654](https://medium.com/buildwithflux/flux-is-the-collaborative-circuit-design-platform-youve-been-waiting-for-72dd7fcc2654)", "link": "https://www.reddit.com/r/robotics/comments/in9zyz/flux_a_cool_threejs_powered_google_docs_style/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "flux: a cool threejs powered google docs style collaborative hardware/circuit design -----> tool !!!  in early access: /!/ [https://medium.com/buildwithflux/flux-is-the-collaborative-circuit-design-platform-youve-been-waiting-for-72dd7fcc2654](https://medium.com/buildwithflux/flux-is-the-collaborative-circuit-design-platform-youve-been-waiting-for-72dd7fcc2654)", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/in9zyz/flux_a_cool_threejs_powered_google_docs_style/", "identifyer": 3500675, "year": "2020"}, {"Unnamed: 0": 780, "autor": "Snapdragon_625", "date": 1602342177000, "content": "Need help in getting the end effector orientation from normal vectors of a point cloud /!/ How do I get the end effector (6 dof robot) orientation in quaternions from the normal vectors from a point cloud ? Need to align the tool perpendicular to a surface detected from the point cloud", "link": "https://www.reddit.com/r/robotics/comments/j8lyln/need_help_in_getting_the_end_effector_orientation/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "need help in getting the end effector orientation from normal vectors of a point cloud /!/ how do i get the end effector (6 dof robot) orientation in quaternions from the normal vectors from a point cloud ? need to align the -----> tool !!!  perpendicular to a surface detected from the point cloud", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/j8lyln/need_help_in_getting_the_end_effector_orientation/", "identifyer": 3500788, "year": "2020"}, {"Unnamed: 0": 942, "autor": "tomhannen", "date": 1609110371000, "content": "The Artie 3000 kids toy drawing robot - a few thoughts and questions /!/ [https://youtu.be/erOzp20E9ck](https://youtu.be/erOzp20E9ck)\n\nThe Artie 3000 is a wifi-enabled drawing robot for kids.  It's great fun, but here are a few things I've run into whilst playing with it - if anyone knows any of the answers, please post below!\n\n1. What is the gold standard for getting pen height right?  Better than using the little plastic calibrator.\n2. Is there a way to run Artie's simulator without powering artie?  Is it online anywhere else?\n3. Is there a way to run Artie on a Mac and not lose access to your home wifi at the same time? Bridging somehow?\n4. Can anyone point me towards something that might convert simple SVG images to artie-friendly conversion?\n5. Best pens for plotting? Found sparkly gel pens set slightly further from the paper than the calibration tool work better than the ones that come with it.\n6. Why do the javascript alphabet shapes on the download page not do a pen-up command during each rotation?  It helps avoid ink blobs on the rotation points!", "link": "https://www.reddit.com/r/robotics/comments/kldocn/the_artie_3000_kids_toy_drawing_robot_a_few/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the artie 3000 kids toy drawing robot - a few thoughts and questions /!/ [https://youtu.be/erozp20e9ck](https://youtu.be/erozp20e9ck)\n\nthe artie 3000 is a wifi-enabled drawing robot for kids.  it's great fun, but here are a few things i've run into whilst playing with it - if anyone knows any of the answers, please post below!\n\n1. what is the gold standard for getting pen height right?  better than using the little plastic calibrator.\n2. is there a way to run artie's simulator without powering artie?  is it online anywhere else?\n3. is there a way to run artie on a mac and not lose access to your home wifi at the same time? bridging somehow?\n4. can anyone point me towards something that might convert simple svg images to artie-friendly conversion?\n5. best pens for plotting? found sparkly gel pens set slightly further from the paper than the calibration -----> tool !!!  work better than the ones that come with it.\n6. why do the javascript alphabet shapes on the download page not do a pen-up command during each rotation?  it helps avoid ink blobs on the rotation points!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/kldocn/the_artie_3000_kids_toy_drawing_robot_a_few/", "identifyer": 3500951, "year": "2020"}, {"Unnamed: 0": 982, "autor": "ifazconcerer", "date": 1608918405000, "content": "What am I getting myself into? Self balancing robot from scratch /!/ Hi,\n\nI want to make a self balancing robot on 2 wheels from scratch. I am familiar with PID theory, arduino, have a 3D printer, tool savvy etc. \n\nHowever.... I think my issue comes from implementing the PID theory into actual code, i don't really have a time limit for this project as Im doing it for fun. Is this a realistic idea to build from scratch, or am I better off using pre programmed controllers to control the gyro/accel. angle and motor encoders?\n\nAny people that can point me in the right direction, I'd appreciate.", "link": "https://www.reddit.com/r/robotics/comments/kk2w9m/what_am_i_getting_myself_into_self_balancing/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what am i getting myself into? self balancing robot from scratch /!/ hi,\n\ni want to make a self balancing robot on 2 wheels from scratch. i am familiar with pid theory, arduino, have a 3d printer, -----> tool !!!  savvy etc. \n\nhowever.... i think my issue comes from implementing the pid theory into actual code, i don't really have a time limit for this project as im doing it for fun. is this a realistic idea to build from scratch, or am i better off using pre programmed controllers to control the gyro/accel. angle and motor encoders?\n\nany people that can point me in the right direction, i'd appreciate.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/kk2w9m/what_am_i_getting_myself_into_self_balancing/", "identifyer": 3500991, "year": "2020"}, {"Unnamed: 0": 1366, "autor": "FreedomRobotics", "date": 1589323848000, "content": "Launching “Link ROS” would love your feedback! /!/ tl;dr: Looking for feedback on our Cloud Logging and Visualization tool for ROS 1 and 2, which we launched [on Product Hunt today](https://www.producthunt.com/posts/link-ros-cloud-logging-viz-for-robots). Part of the Product Hunt post has a coupon for 1 free robot for a year on our platform with code “PRODUCTHUNT” (case sensitive).\n\n\\---\n\nWe just launched Link ROS, a cloud logging and visualization tool for ROS 1 and 2, on Product Hunt. We launched this morning and we're already the most voted cloud logging tool for robotics of all time 🤖❤️. \n\nWe would love to get as much feedback as possible on our new product from the community, and in exchange we are giving away a license to one robot free for a year! We’ll be watching this page and the product hunt page to answer your questions and take note of your feedback!\n\nTo get started you will need to [create a free account](https://www.freedomrobotics.ai/link-ros-product-hunt?utm_source=reddit&amp;utm_medium=organic_social&amp;utm_campaign=D20_CL4R) (the Product Hunt specific page has a better offer code ;) and then install our agent on your robot using 1-line of code (provided when you create your account). If you need help getting started you can message us using the in app chat, or self-help by reading [our documentation](https://docs.freedomrobotics.ai/docs/connect-with-ros). \n\nIf you want to learn more about the product you can read more about the feature in [our blog post](https://www.freedomrobotics.ai/blog/link-ros-cloud-logging-for-ros/?utm_source=reddit&amp;utm_medium=organic_social&amp;utm_campaign=D20_CL4R).\n\nLook forward to your feedback!\n\nThe Freedom Robotics Team", "link": "https://www.reddit.com/r/robotics/comments/gimda1/launching_link_ros_would_love_your_feedback/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "launching “link ros” would love your feedback! /!/ tl;dr: looking for feedback on our cloud logging and visualization -----> tool !!!  for ros 1 and 2, which we launched [on product hunt today](https://www.producthunt.com/posts/link-ros-cloud-logging-viz-for-robots). part of the product hunt post has a coupon for 1 free robot for a year on our platform with code “producthunt” (case sensitive).\n\n\\---\n\nwe just launched link ros, a cloud logging and visualization tool for ros 1 and 2, on product hunt. we launched this morning and we're already the most voted cloud logging tool for robotics of all time 🤖❤️. \n\nwe would love to get as much feedback as possible on our new product from the community, and in exchange we are giving away a license to one robot free for a year! we’ll be watching this page and the product hunt page to answer your questions and take note of your feedback!\n\nto get started you will need to [create a free account](https://www.freedomrobotics.ai/link-ros-product-hunt?utm_source=reddit&amp;utm_medium=organic_social&amp;utm_campaign=d20_cl4r) (the product hunt specific page has a better offer code ;) and then install our agent on your robot using 1-line of code (provided when you create your account). if you need help getting started you can message us using the in app chat, or self-help by reading [our documentation](https://docs.freedomrobotics.ai/docs/connect-with-ros). \n\nif you want to learn more about the product you can read more about the feature in [our blog post](https://www.freedomrobotics.ai/blog/link-ros-cloud-logging-for-ros/?utm_source=reddit&amp;utm_medium=organic_social&amp;utm_campaign=d20_cl4r).\n\nlook forward to your feedback!\n\nthe freedom robotics team", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/gimda1/launching_link_ros_would_love_your_feedback/", "identifyer": 3501377, "year": "2020"}, {"Unnamed: 0": 1456, "autor": "hiamitabha", "date": 1591344404000, "content": "Online course on learning Artificial Intelligence with the Vector robot /!/ When I started playing with Vector 1.5 years ago, I realized that the Vector SDK is an extremely valuable tool to learn concepts in the intersection of how AI is applied in robotics. I am now releasing a short 3 hour course based on what I learnt. This course is ideal for upper middle/ high school students / undergraduate students who want to get a flair of AI and how it is used in robotics. First 25% of the course is available free.\n\nPlease access the course [here](https://robotics.thinkific.com/courses/aiwitharobot)\n\nSome more details on the course are documented [https://medium.com/programming-robots/learn-ai-with-a-robot-8de7c5779972](https://medium.com/programming-robots/learn-ai-with-a-robot-8de7c5779972)\n\nI will be honored to have you as my student. Many thanks!", "link": "https://www.reddit.com/r/robotics/comments/gx0f64/online_course_on_learning_artificial_intelligence/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "online course on learning artificial intelligence with the vector robot /!/ when i started playing with vector 1.5 years ago, i realized that the vector sdk is an extremely valuable -----> tool !!!  to learn concepts in the intersection of how ai is applied in robotics. i am now releasing a short 3 hour course based on what i learnt. this course is ideal for upper middle/ high school students / undergraduate students who want to get a flair of ai and how it is used in robotics. first 25% of the course is available free.\n\nplease access the course [here](https://robotics.thinkific.com/courses/aiwitharobot)\n\nsome more details on the course are documented [https://medium.com/programming-robots/learn-ai-with-a-robot-8de7c5779972](https://medium.com/programming-robots/learn-ai-with-a-robot-8de7c5779972)\n\ni will be honored to have you as my student. many thanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gx0f64/online_course_on_learning_artificial_intelligence/", "identifyer": 3501468, "year": "2020"}, {"Unnamed: 0": 1482, "autor": "mrtinmouse", "date": 1591188136000, "content": "the best tool to fight racism is just to make friends, and robot cows", "link": "https://www.reddit.com/r/robotics/comments/gvt8cv/the_best_tool_to_fight_racism_is_just_to_make/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the best -----> tool !!!  to fight racism is just to make friends, and robot cows", "sortedWord": "None", "removed": null, "score": 1, "comments": 17, "media": "image", "medialink": "https://i.redd.it/k9r3t5cixo251.jpg", "identifyer": 3501494, "year": "2020"}, {"Unnamed: 0": 1596, "autor": "The_Sacred_Machine", "date": 1588454035000, "content": "ROS, RTOS, Do we need prettier things? /!/ Greetings my Magnanimous Lords of Machines,\n\nI'm an engineer, Electronic/Telecomms engineering. I'm doing a Robotics &amp; Automation Master's Degree focused on research. Lately, I've been kinda wondering about a couple of things gnawing the back of my brain.\n\nCurrently, everyone is looking at ROS with pretty eyes, interesting as it is ROS is a framework to manage IPC within an OS, please correct me if wrong in this, it's not a real OS (as far as I know). Also, I've been trying to use it outside of Ubuntu and quite frankly, is a pain in the ass to configure, mainly in CentOS 7/8 ( should try Debian to find an alternative to Ubuntu).\n\nIn many classes, there is a common denominator: \"The hard part is to make the comms work well and not lose too much data\". I asked a couple of people in the department and they were reluctant to talk about RTOS (its not their research focus) since the hardware they want to try is not supported, the argument is that it is not strictly necessary on high-level applications. So far so good, but here's the catch: you are not using the RTOS since you don't have the support for your hardware, that is probably Open Source/Hardware (so no problem if we edit some of the code), and distributed systems tend to need a tight window of synchronicity. I'm no expert at any of this but is just a thought I've tried to touch many times and it has been ignored as in \"no OS is really real-time\" (well butter my buns and call me a biscuit then since not even US operate on real-time)\n\nThe problem was some path planning of humanoid with more than 25 DOFs and if you are using TCP/IP and Containers you are getting REALLY high levels of abstraction (in my opinion), then we have slow machines and blame the tin can. \n\nWhy do I say we need \"prettier things\"?\n\nDon't get me wrong about ROS/YARP, great tools but we might need to develop more, ROS2 is supposed to have RTOS support so I might be \"not that wrong\".\n\nIn biology there are layers of processing, not all the brain takes the processing at all levels, I think when want to solve a location problem but I can do that and scratch my ass simultaneously. I might be pissing outside the bucket here but looking at Research Gate's questions about RTOS for Robotics only a person stated that ROS isn't an OS. In no way I'm questioning the intellectual capacity of these people, I'm just thinking that they could need help with that little problem, you just can't know all the secrets of the universe.\n\nThe other point is that currently there is no competition for ROS as a whole that I can find, YARP is also a middleware but not as developed as ROS, not as fancy or supported also. It's never a great idea to put all eggs in the same basket. Competition is the key to progress I think.\n\nDo you think we could get prettier things with a mix of RTOS and classic OS?\n\nI feel Robotics is having a slow entry to the real world, let us be honest robot parts ain't cheap chief. If someone wants to invest in a project and hears that the Doc is not getting something important right might not risk funding the endeavor.\n\nPlease, I'm just a loyalist of machines as the tool for mankind. The answers got were disappointing and I want to do a reality check. For the sound of it if, you could get something to run RTOS/OS mix and support all you need (besides a comprehensive sodding guide on \"RTOS for dummies\")\n\nAll this being said I feel it's great since we will have tons of problems to solve, this means more opportunities in the future. I'm just deeply confused with the balance of the marriage of Computer Science, Mech Eng, EEng (may this holy trinity bless us), and other stuff you need to seam together. So I am here to listen.", "link": "https://www.reddit.com/r/robotics/comments/gce312/ros_rtos_do_we_need_prettier_things/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ros, rtos, do we need prettier things? /!/ greetings my magnanimous lords of machines,\n\ni'm an engineer, electronic/telecomms engineering. i'm doing a robotics &amp; automation master's degree focused on research. lately, i've been kinda wondering about a couple of things gnawing the back of my brain.\n\ncurrently, everyone is looking at ros with pretty eyes, interesting as it is ros is a framework to manage ipc within an os, please correct me if wrong in this, it's not a real os (as far as i know). also, i've been trying to use it outside of ubuntu and quite frankly, is a pain in the ass to configure, mainly in centos 7/8 ( should try debian to find an alternative to ubuntu).\n\nin many classes, there is a common denominator: \"the hard part is to make the comms work well and not lose too much data\". i asked a couple of people in the department and they were reluctant to talk about rtos (its not their research focus) since the hardware they want to try is not supported, the argument is that it is not strictly necessary on high-level applications. so far so good, but here's the catch: you are not using the rtos since you don't have the support for your hardware, that is probably open source/hardware (so no problem if we edit some of the code), and distributed systems tend to need a tight window of synchronicity. i'm no expert at any of this but is just a thought i've tried to touch many times and it has been ignored as in \"no os is really real-time\" (well butter my buns and call me a biscuit then since not even us operate on real-time)\n\nthe problem was some path planning of humanoid with more than 25 dofs and if you are using tcp/ip and containers you are getting really high levels of abstraction (in my opinion), then we have slow machines and blame the tin can. \n\nwhy do i say we need \"prettier things\"?\n\ndon't get me wrong about ros/yarp, great tools but we might need to develop more, ros2 is supposed to have rtos support so i might be \"not that wrong\".\n\nin biology there are layers of processing, not all the brain takes the processing at all levels, i think when want to solve a location problem but i can do that and scratch my ass simultaneously. i might be pissing outside the bucket here but looking at research gate's questions about rtos for robotics only a person stated that ros isn't an os. in no way i'm questioning the intellectual capacity of these people, i'm just thinking that they could need help with that little problem, you just can't know all the secrets of the universe.\n\nthe other point is that currently there is no competition for ros as a whole that i can find, yarp is also a middleware but not as developed as ros, not as fancy or supported also. it's never a great idea to put all eggs in the same basket. competition is the key to progress i think.\n\ndo you think we could get prettier things with a mix of rtos and classic os?\n\ni feel robotics is having a slow entry to the real world, let us be honest robot parts ain't cheap chief. if someone wants to invest in a project and hears that the doc is not getting something important right might not risk funding the endeavor.\n\nplease, i'm just a loyalist of machines as the -----> tool !!!  for mankind. the answers got were disappointing and i want to do a reality check. for the sound of it if, you could get something to run rtos/os mix and support all you need (besides a comprehensive sodding guide on \"rtos for dummies\")\n\nall this being said i feel it's great since we will have tons of problems to solve, this means more opportunities in the future. i'm just deeply confused with the balance of the marriage of computer science, mech eng, eeng (may this holy trinity bless us), and other stuff you need to seam together. so i am here to listen.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gce312/ros_rtos_do_we_need_prettier_things/", "identifyer": 3501608, "year": "2020"}, {"Unnamed: 0": 1895, "autor": "greengoblinirl", "date": 1585240325000, "content": "Can you specify robotic arm tool path in cartesian space? /!/ My company is evaluating using a robotic arm for actuation of a specific task in our factory. There are some obstacles that would lie within the workspace of the robotic arm. I have seen Cartesian control of robotic arms, but that was in a lab in college. With off the shelf robotic arms, can you typically specify the toolpath of the end effector so as to avoid obstacles? We are looking for a quick off the shelf solution", "link": "https://www.reddit.com/r/robotics/comments/fpekku/can_you_specify_robotic_arm_tool_path_in/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "can you specify robotic arm -----> tool !!!  path in cartesian space? /!/ my company is evaluating using a robotic arm for actuation of a specific task in our factory. there are some obstacles that would lie within the workspace of the robotic arm. i have seen cartesian control of robotic arms, but that was in a lab in college. with off the shelf robotic arms, can you typically specify the toolpath of the end effector so as to avoid obstacles? we are looking for a quick off the shelf solution", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/fpekku/can_you_specify_robotic_arm_tool_path_in/", "identifyer": 3501910, "year": "2020"}, {"Unnamed: 0": 2051, "autor": "SparkCoder", "date": 1594383444000, "content": "Need help learning robotics. (Inverse Kinematics) /!/ Could someone kindly provide me a good source to learn how to properly solve the inverse kinematics of a robot manipulator? Or at least how to implement a Jacobian properly? Also, I calculated the transformation matrices without DH Parameters so hopefully, that's not an issue.\n\nI have 6 DOF manipulator (even though the last degree of freedom is the tool rotation).\n\nI would appreciate it if the source provided has a more programmer's perspective as well as if it explained the math in depth (most sources I found skims over the same assuming the reader already knows most of it)\n\nAlso, I am simulating the robot in PyBullet on Windows (So no ROS or GAZEBO). I don't wish to use MatLab.\n\nPS: Please don't link any courses (I only want short youtube series, single videos, articles or if possible direct explanations here). :)", "link": "https://www.reddit.com/r/robotics/comments/honwju/need_help_learning_robotics_inverse_kinematics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "need help learning robotics. (inverse kinematics) /!/ could someone kindly provide me a good source to learn how to properly solve the inverse kinematics of a robot manipulator? or at least how to implement a jacobian properly? also, i calculated the transformation matrices without dh parameters so hopefully, that's not an issue.\n\ni have 6 dof manipulator (even though the last degree of freedom is the -----> tool !!!  rotation).\n\ni would appreciate it if the source provided has a more programmer's perspective as well as if it explained the math in depth (most sources i found skims over the same assuming the reader already knows most of it)\n\nalso, i am simulating the robot in pybullet on windows (so no ros or gazebo). i don't wish to use matlab.\n\nps: please don't link any courses (i only want short youtube series, single videos, articles or if possible direct explanations here). :)", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/honwju/need_help_learning_robotics_inverse_kinematics/", "identifyer": 3502069, "year": "2020"}, {"Unnamed: 0": 2205, "autor": "OpenRobotics", "date": 1597797463000, "content": "New Simulation World Tool: AWS RoboMaker WorldForge", "link": "https://www.reddit.com/r/robotics/comments/icdg4s/new_simulation_world_tool_aws_robomaker_worldforge/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new simulation world -----> tool !!! : aws robomaker worldforge", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "link", "medialink": "https://discourse.ros.org/t/announcing-aws-robomaker-worldforge/15967", "identifyer": 3502223, "year": "2020"}, {"Unnamed: 0": 2302, "autor": "thellertik", "date": 1599105630000, "content": "Interest in general \"parts manager\" for robotics projects? /!/ Kinda a sounding-out post here, want to get people's thoughts.\n\nThere are good BOM managers that exist for electronics components, like [https://octopart.com/bom-tool](https://octopart.com/bom-tool) and built-in BOM tools on specific sites like digikey: [https://www.digikey.com/bom](https://www.digikey.com/bom)\n\nIt'd be cool if there were a similar tool for managing ALL the parts, both mechanical and electrical, that go into a robotics project. For example, the Open Source Rover project by JPL ([https://github.com/nasa-jpl/open-source-rover](https://github.com/nasa-jpl/open-source-rover) \\- I didn't create it, but cool project, check it out!) has a master parts list as a csv, and a bunch of build documentation that lists parts from that master list. Keeping all of those references aligned has been a pain. What if the tool could make autogenerating parts tables in docs a breeze?\n\nThat's just one useful feature. Other features might include:\n\n* visual diffs of different versions of the parts list (not just a diff of a csv file)\n* more flexible versioning/exploration of design and part alternatives\n* auto-grabbing of CAD files for things like fasteners, brackets, etc\n\nDoes this exist already? Does it seem useful, or way too niche? Would hobbyists use it (maybe with a freemium model), or is this definitely enterprise software territory?\n\nThanks for your thoughts!", "link": "https://www.reddit.com/r/robotics/comments/ilmcb6/interest_in_general_parts_manager_for_robotics/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "interest in general \"parts manager\" for robotics projects? /!/ kinda a sounding-out post here, want to get people's thoughts.\n\nthere are good bom managers that exist for electronics components, like [https://octopart.com/bom-tool](https://octopart.com/bom-tool) and built-in bom tools on specific sites like digikey: [https://www.digikey.com/bom](https://www.digikey.com/bom)\n\nit'd be cool if there were a similar -----> tool !!!  for managing all the parts, both mechanical and electrical, that go into a robotics project. for example, the open source rover project by jpl ([https://github.com/nasa-jpl/open-source-rover](https://github.com/nasa-jpl/open-source-rover) \\- i didn't create it, but cool project, check it out!) has a master parts list as a csv, and a bunch of build documentation that lists parts from that master list. keeping all of those references aligned has been a pain. what if the tool could make autogenerating parts tables in docs a breeze?\n\nthat's just one useful feature. other features might include:\n\n* visual diffs of different versions of the parts list (not just a diff of a csv file)\n* more flexible versioning/exploration of design and part alternatives\n* auto-grabbing of cad files for things like fasteners, brackets, etc\n\ndoes this exist already? does it seem useful, or way too niche? would hobbyists use it (maybe with a freemium model), or is this definitely enterprise software territory?\n\nthanks for your thoughts!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/ilmcb6/interest_in_general_parts_manager_for_robotics/", "identifyer": 3502321, "year": "2020"}, {"Unnamed: 0": 2592, "autor": "_pranavjain", "date": 1604219137000, "content": "Simulation Tools? /!/ Hey guys, I'm working on a quadruped robot project, is there any dynamics analysis simulation tool?  Which one would be the best to choose and later integrate with ROS?", "link": "https://www.reddit.com/r/robotics/comments/jlz0y5/simulation_tools/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "simulation tools? /!/ hey guys, i'm working on a quadruped robot project, is there any dynamics analysis simulation -----> tool !!! ?  which one would be the best to choose and later integrate with ros?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/jlz0y5/simulation_tools/", "identifyer": 3502613, "year": "2020"}, {"Unnamed: 0": 3169, "autor": "nehapatil07", "date": 1581481216000, "content": "UiPath Tool In RPA: Robotic Automation Process", "link": "https://www.reddit.com/r/robotics/comments/f2lebn/uipath_tool_in_rpa_robotic_automation_process/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "uipath -----> tool !!!  in rpa: robotic automation process", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.kausalvikash.in/blog/rpa-ui-path-tool-in-action/", "identifyer": 3503199, "year": "2020"}, {"Unnamed: 0": 3235, "autor": "x1sc0", "date": 1581057148000, "content": "[P] Arduino Bi-pedal Robot Step-By-Step Build /!/ I built a bi-pedal, arduino-powered, robot that I launched on kickstarter a \\[couple of years ago\\]([http://kck.st/2qFTxxc](http://kck.st/2qFTxxc)). It uses an Arduino PRO Micro, 4 micro-sized servos, a buzzer, and an ultrasonic sensor to interact with his users. It can walk, sing, detect obstacles, and by coordination the motion of the servos, even dance!\n\nIn this video, I show you how to assemble, program, and calibrate your very own Otto. Once programmed, this bi-pedal robot can walk, dance, sing, avoid obstacles, and more! The body is 3d-printed and the code is written in C++/Arduino. It's a simple project that would be great, for example, used as a teaching tool for robotics at a middle- or high-school level:\n\n\\[[https://youtu.be/57SubBrt-HY](https://youtu.be/57SubBrt-HY)\\]([https://youtu.be/57SubBrt-HY](https://youtu.be/57SubBrt-HY))\n\nShort demo of the motor control in action:\n\n![video](gx45zydz4gf41)\n\n[\\[P\\] Arduino Bi-pedal Robot Step-By-Step Build](https://youtu.be/57SubBrt-HY) As always, ask me any questions if you got'em!", "link": "https://www.reddit.com/r/robotics/comments/f06mla/p_arduino_bipedal_robot_stepbystep_build/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[p] arduino bi-pedal robot step-by-step build /!/ i built a bi-pedal, arduino-powered, robot that i launched on kickstarter a \\[couple of years ago\\]([http://kck.st/2qftxxc](http://kck.st/2qftxxc)). it uses an arduino pro micro, 4 micro-sized servos, a buzzer, and an ultrasonic sensor to interact with his users. it can walk, sing, detect obstacles, and by coordination the motion of the servos, even dance!\n\nin this video, i show you how to assemble, program, and calibrate your very own otto. once programmed, this bi-pedal robot can walk, dance, sing, avoid obstacles, and more! the body is 3d-printed and the code is written in c++/arduino. it's a simple project that would be great, for example, used as a teaching -----> tool !!!  for robotics at a middle- or high-school level:\n\n\\[[https://youtu.be/57subbrt-hy](https://youtu.be/57subbrt-hy)\\]([https://youtu.be/57subbrt-hy](https://youtu.be/57subbrt-hy))\n\nshort demo of the motor control in action:\n\n![video](gx45zydz4gf41)\n\n[\\[p\\] arduino bi-pedal robot step-by-step build](https://youtu.be/57subbrt-hy) as always, ask me any questions if you got'em!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/f06mla/p_arduino_bipedal_robot_stepbystep_build/", "identifyer": 3503267, "year": "2020"}, {"Unnamed: 0": 3299, "autor": "padiniz", "date": 1588866574000, "content": "Software for robot motion simulation /!/ Hello colleagues.  \nI am an electronic engineer  \nI can program STM32 microcontrollers, design PCBs, program in C and python.\n\n  \nNow I have a lot of free time and I want to start studying robotics, and especially quadruped and human-like robots.  \nI understand how to make a simple walking robot using an arduino board and several servo motors, but I don’t know where to go next.  \nI am interested in how to model more complex systems with robot balancing, how to use reinforcement learning, lidars, etc.\n\n  \nFor example:  \nhttps://www.reddit.com/r/robotics/comments/gd5zkz/pupper\\_low\\_cost\\_open\\_source\\_quadruped/  \nthe project is ready. it remains only to repeat it. But how do you start creating something like this yourself?\n\n  \nIf I understand correctly, then everyone starts with modeling in a 3D environment.  \nThere are many ways to model robot behavior.  \nYou can use game engines. They are simple enough to get started, but they have primitive physics. Maybe I'm wrong.\n\nYou can take a 3D engine with physics and start modeling there.\n\n  \nYou can use matlab. This is a very powerful tool, but I am not familiar with it and am drowning in an abundance of information. There are also a lot of ready-made built-in functions, but I would like to understand more deeply, and not just call ready-made functions.  \nDue to such an abundance of opportunities and information, I don’t understand which way is better to go.  \nI set myself this goal:  \n1. Deal with modeling the movement of the robot in a 3D environment  \n2. Start applying reinforcement learning so that the model can learn to move  \n3. Construct a robot model and port the code to the microcontroller.  \n\n\nI will be happy with your advice and opinions, as well as literature and courses on this topic. \n\nThanks!", "link": "https://www.reddit.com/r/robotics/comments/gf917i/software_for_robot_motion_simulation/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "software for robot motion simulation /!/ hello colleagues.  \ni am an electronic engineer  \ni can program stm32 microcontrollers, design pcbs, program in c and python.\n\n  \nnow i have a lot of free time and i want to start studying robotics, and especially quadruped and human-like robots.  \ni understand how to make a simple walking robot using an arduino board and several servo motors, but i don’t know where to go next.  \ni am interested in how to model more complex systems with robot balancing, how to use reinforcement learning, lidars, etc.\n\n  \nfor example:  \nhttps://www.reddit.com/r/robotics/comments/gd5zkz/pupper\\_low\\_cost\\_open\\_source\\_quadruped/  \nthe project is ready. it remains only to repeat it. but how do you start creating something like this yourself?\n\n  \nif i understand correctly, then everyone starts with modeling in a 3d environment.  \nthere are many ways to model robot behavior.  \nyou can use game engines. they are simple enough to get started, but they have primitive physics. maybe i'm wrong.\n\nyou can take a 3d engine with physics and start modeling there.\n\n  \nyou can use matlab. this is a very powerful -----> tool !!! , but i am not familiar with it and am drowning in an abundance of information. there are also a lot of ready-made built-in functions, but i would like to understand more deeply, and not just call ready-made functions.  \ndue to such an abundance of opportunities and information, i don’t understand which way is better to go.  \ni set myself this goal:  \n1. deal with modeling the movement of the robot in a 3d environment  \n2. start applying reinforcement learning so that the model can learn to move  \n3. construct a robot model and port the code to the microcontroller.  \n\n\ni will be happy with your advice and opinions, as well as literature and courses on this topic. \n\nthanks!", "sortedWord": "None", "removed": null, "score": 2, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gf917i/software_for_robot_motion_simulation/", "identifyer": 3503332, "year": "2020"}, {"Unnamed: 0": 3718, "autor": "matthieugarrigues", "date": 1595519206000, "content": "I'm coding a new robot offline programming tool. What feature would you like ? /!/ Hi there,\n\nI'm coding from scratch a new offline programming tool to program industrial robots. If you have experience with robot programming, what are you missing in other offline programming tools ? Also, would you like something that runs entirely in a browser ? \n\nAny ideas or suggestions are welcome.\n\nI already put some video previews if you want to have a look: [https://www.linkedin.com/company/stara-robotics](https://www.linkedin.com/company/stara-robotics)", "link": "https://www.reddit.com/r/robotics/comments/hwhyjv/im_coding_a_new_robot_offline_programming_tool/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i'm coding a new robot offline programming -----> tool !!! . what feature would you like ? /!/ hi there,\n\ni'm coding from scratch a new offline programming tool to program industrial robots. if you have experience with robot programming, what are you missing in other offline programming tools ? also, would you like something that runs entirely in a browser ? \n\nany ideas or suggestions are welcome.\n\ni already put some video previews if you want to have a look: [https://www.linkedin.com/company/stara-robotics](https://www.linkedin.com/company/stara-robotics)", "sortedWord": "None", "removed": null, "score": 0, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/hwhyjv/im_coding_a_new_robot_offline_programming_tool/", "identifyer": 3503756, "year": "2020"}, {"Unnamed: 0": 3862, "autor": "Muneerr", "date": 1600065276000, "content": "How can I become a robotics engineer? /!/ A little about my background.  I have a Masters in Electrical and computer engineering\\[US\\], Bachelors in Electronics\\[India\\], and have about 4 years of work experience. Currently working as a Controls Engineer in a manufacturing environment. I am skilled in working with PLC's, HMI's, and drives. My current work is in maintenance and revolves around troubleshooting faults/failures, doing root cause analysis, and some part of the integration of machines. I had the opportunity to receive a 5-day training for Fanuc Handling tool operation and programming which got me familiar with frames, jogging, handling IO. I enjoy working in the field of automation and would like to get out of maintenance and work either in the design or programming side of robotics/automation.\n\n1. What are the list of skills needed to become a robotics or automation engineer\n2. Are there any good educational courses/projects available online?\n3. What are the best companies that I can get into? \n\n I would really appreciate if you guys could kindly give me some direction. Thanks!", "link": "https://www.reddit.com/r/robotics/comments/isfo0b/how_can_i_become_a_robotics_engineer/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how can i become a robotics engineer? /!/ a little about my background.  i have a masters in electrical and computer engineering\\[us\\], bachelors in electronics\\[india\\], and have about 4 years of work experience. currently working as a controls engineer in a manufacturing environment. i am skilled in working with plc's, hmi's, and drives. my current work is in maintenance and revolves around troubleshooting faults/failures, doing root cause analysis, and some part of the integration of machines. i had the opportunity to receive a 5-day training for fanuc handling -----> tool !!!  operation and programming which got me familiar with frames, jogging, handling io. i enjoy working in the field of automation and would like to get out of maintenance and work either in the design or programming side of robotics/automation.\n\n1. what are the list of skills needed to become a robotics or automation engineer\n2. are there any good educational courses/projects available online?\n3. what are the best companies that i can get into? \n\n i would really appreciate if you guys could kindly give me some direction. thanks!", "sortedWord": "None", "removed": null, "score": 3, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/isfo0b/how_can_i_become_a_robotics_engineer/", "identifyer": 3503903, "year": "2020"}, {"Unnamed: 0": 4055, "autor": "russtuna", "date": 1596866255000, "content": "Making a Business of Robotics - How do I go from a prototype to a product? /!/ I've been programming 20 years. Building robots, RC cars, 3d printers and cnc machines for about 12. Mostly little simple stepper motor controllers and tool path planning for industrial 6 axis cnc machines, NUM and Fanuc controllers, micron level precision, plus Arduino and random micro electronics.\n\nLately I have ideas to build robots and sell them like a business, but I don't know where to begin.  I can make just about anything in my back yard, but how do I go about making something like a roomba commercially? \n\nI know all common programing languages, arduino, linux raspberry pi, openCV and I'm teaching myself ROS and FPGA.  I have ideas for some awesome robots, but once I get my prototype made... then what?  I have a basic RC car that drives around the yard on it's own. It's all bare wires and batteries. Roomba is just beautiful in it's design and simplicity. I tend to use sticky tape and zip ties.\n\nAny books or websites or random conversations you could help me with would be appreciated. Hell I'll buy you a pizza or something if you'll do a zoom meeting. \n\nThank you so much.", "link": "https://www.reddit.com/r/robotics/comments/i5u2cc/making_a_business_of_robotics_how_do_i_go_from_a/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "making a business of robotics - how do i go from a prototype to a product? /!/ i've been programming 20 years. building robots, rc cars, 3d printers and cnc machines for about 12. mostly little simple stepper motor controllers and -----> tool !!!  path planning for industrial 6 axis cnc machines, num and fanuc controllers, micron level precision, plus arduino and random micro electronics.\n\nlately i have ideas to build robots and sell them like a business, but i don't know where to begin.  i can make just about anything in my back yard, but how do i go about making something like a roomba commercially? \n\ni know all common programing languages, arduino, linux raspberry pi, opencv and i'm teaching myself ros and fpga.  i have ideas for some awesome robots, but once i get my prototype made... then what?  i have a basic rc car that drives around the yard on it's own. it's all bare wires and batteries. roomba is just beautiful in it's design and simplicity. i tend to use sticky tape and zip ties.\n\nany books or websites or random conversations you could help me with would be appreciated. hell i'll buy you a pizza or something if you'll do a zoom meeting. \n\nthank you so much.", "sortedWord": "None", "removed": null, "score": 1, "comments": 15, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/i5u2cc/making_a_business_of_robotics_how_do_i_go_from_a/", "identifyer": 3504097, "year": "2020"}, {"Unnamed: 0": 4179, "autor": "UCantHandleTheTruth8", "date": 1584392714000, "content": "Gazebo installation on Cloud-based Virtual Machine /!/ As stated, I'm trying to install Gazebo simulation tool on a virtual machine of Google Cloud Platform, the installation is successful but crashed once I open it.\n\nGCP: Ubuntu 18 LTS (Bionic Beaver) NE1 8vCPU 32GB RAM\n\nI suspect it has something to do with NVDIA graphic driver since Gazebo do camera render with OpenGL (?). If anyone has done it, can you share the required dependencies for it to work or some insight so I can re-produce your step?\n\nFWIW, Amazon has AWS RoboMaker and they claim it supports Gazebo 9, but before I switch to them, I want to exhaust GCP-powered options first since I've worked around with it more.", "link": "https://www.reddit.com/r/robotics/comments/fjse8z/gazebo_installation_on_cloudbased_virtual_machine/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "gazebo installation on cloud-based virtual machine /!/ as stated, i'm trying to install gazebo simulation -----> tool !!!  on a virtual machine of google cloud platform, the installation is successful but crashed once i open it.\n\ngcp: ubuntu 18 lts (bionic beaver) ne1 8vcpu 32gb ram\n\ni suspect it has something to do with nvdia graphic driver since gazebo do camera render with opengl (?). if anyone has done it, can you share the required dependencies for it to work or some insight so i can re-produce your step?\n\nfwiw, amazon has aws robomaker and they claim it supports gazebo 9, but before i switch to them, i want to exhaust gcp-powered options first since i've worked around with it more.", "sortedWord": "None", "removed": null, "score": 2, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/fjse8z/gazebo_installation_on_cloudbased_virtual_machine/", "identifyer": 3504222, "year": "2020"}, {"Unnamed: 0": 4274, "autor": "meldiwin", "date": 1603560639000, "content": "Joshuah Wolper \"Which Simulation Techniques Are Reliable For Simulating Continuum Soft Robots?\" IEEE Soft Robotics Podcast /!/ Which Simulation Techniques Are Reliable For Simulating Continuum Soft Robots and how to select the Right Tool?  Which route do we have to investigate: mesh or meshless based techniques? What are the limitations and challenges of simulating nonlinear viscoelastic materials; isotropic and anisotropic behaviors. In this episode, we have Joshuah Wolper, a senior Ph.D. researcher at the University of Pennsylvania. Josh is very knowledgeable, I hope you enjoy listening to him.\n\nYou can find Josh’s work here: [https://joshuahwolper.com/](https://joshuahwolper.com/)  and if you want to connect with him via Twitter @JoshuahWolper\n\nThe episode: [https://soundcloud.com/ieeeras-softrobotics/joshuah-wolper-which-simulation-techniques-are-reliable-for-simulating-continuum-soft-robots](https://soundcloud.com/ieeeras-softrobotics/joshuah-wolper-which-simulation-techniques-are-reliable-for-simulating-continuum-soft-robots)", "link": "https://www.reddit.com/r/robotics/comments/jhcx6k/joshuah_wolper_which_simulation_techniques_are/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "joshuah wolper \"which simulation techniques are reliable for simulating continuum soft robots?\" ieee soft robotics podcast /!/ which simulation techniques are reliable for simulating continuum soft robots and how to select the right -----> tool !!! ?  which route do we have to investigate: mesh or meshless based techniques? what are the limitations and challenges of simulating nonlinear viscoelastic materials; isotropic and anisotropic behaviors. in this episode, we have joshuah wolper, a senior ph.d. researcher at the university of pennsylvania. josh is very knowledgeable, i hope you enjoy listening to him.\n\nyou can find josh’s work here: [https://joshuahwolper.com/](https://joshuahwolper.com/)  and if you want to connect with him via twitter @joshuahwolper\n\nthe episode: [https://soundcloud.com/ieeeras-softrobotics/joshuah-wolper-which-simulation-techniques-are-reliable-for-simulating-continuum-soft-robots](https://soundcloud.com/ieeeras-softrobotics/joshuah-wolper-which-simulation-techniques-are-reliable-for-simulating-continuum-soft-robots)", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/jhcx6k/joshuah_wolper_which_simulation_techniques_are/", "identifyer": 3504318, "year": "2020"}, {"Unnamed: 0": 4511, "autor": "dominiquely", "date": 1606688668000, "content": "Is there software tool that generate the symbolic equations (not necessarily solutions) for the kinematics and dynamics of the robot from the 3D models of its parts? /!/ I am new to robotics. As I understand then each robot part (e.g. link) have 3D model (e.g. SolidWorks or Blender). Parts are joined together by the links which usually are DC motors. I don't know currently which type of software can be used for such complex structure of multiple parts togher.\n\nMy question is - is there software tool that receives the 3D model files and some information how those parts are joined together and which outputs the symbolic equations for kinematics and dynamics for this robot? E.g. in the Mathematica format or in the MatLab file format?\n\nThere are 2 considerations:\n\n1) The dynamics require some set of assumptions, e.g. how the friction or viscous forces are modelled. But I guess - symbolic generation tools can have pre-specified templated for such assumptions and the possibility to add such templated by the user.\n\n2) The generation of the symbolic equations are sufficient for my. I am fully aware that the solution of the is not always possible  in the symbolic form, so - other tools can be used for the finding of the path, e.g. as the optimization of some other criteria - costs, etc.\n\nSo - is there such tool for the generation of the equations? I am reading papers from 2000-2010 and they are talking about the robot software generation from the CAD files. Maybe such generation is the standard process for years. I have heard that the Energid Actin software is the best, but it is quite expensive for the hobbyist/citizen scientist", "link": "https://www.reddit.com/r/robotics/comments/k3irke/is_there_software_tool_that_generate_the_symbolic/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "is there software -----> tool !!!  that generate the symbolic equations (not necessarily solutions) for the kinematics and dynamics of the robot from the 3d models of its parts? /!/ i am new to robotics. as i understand then each robot part (e.g. link) have 3d model (e.g. solidworks or blender). parts are joined together by the links which usually are dc motors. i don't know currently which type of software can be used for such complex structure of multiple parts togher.\n\nmy question is - is there software tool that receives the 3d model files and some information how those parts are joined together and which outputs the symbolic equations for kinematics and dynamics for this robot? e.g. in the mathematica format or in the matlab file format?\n\nthere are 2 considerations:\n\n1) the dynamics require some set of assumptions, e.g. how the friction or viscous forces are modelled. but i guess - symbolic generation tools can have pre-specified templated for such assumptions and the possibility to add such templated by the user.\n\n2) the generation of the symbolic equations are sufficient for my. i am fully aware that the solution of the is not always possible  in the symbolic form, so - other tools can be used for the finding of the path, e.g. as the optimization of some other criteria - costs, etc.\n\nso - is there such tool for the generation of the equations? i am reading papers from 2000-2010 and they are talking about the robot software generation from the cad files. maybe such generation is the standard process for years. i have heard that the energid actin software is the best, but it is quite expensive for the hobbyist/citizen scientist", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/k3irke/is_there_software_tool_that_generate_the_symbolic/", "identifyer": 3504556, "year": "2020"}, {"Unnamed: 0": 4651, "autor": "TheOddArtisan", "date": 1596718773000, "content": "Anyone else a fan of McMaster-Carr to get parts for your robotics projects? I made a Chrome Extension to have fun browsing their catalog /!/ McMaster is a great resource to get parts for my projects and I love to browse through the massive catalog of products that McMaster-Carr sells and always thought that a tool to bring you to a random product page would be fun. Here is my attempt at making that dream come true as a free Chrome Extension. I've also incorporated a search tool and have some other ideas to add down the line.\n\nThe extension is available here: [https://chrome.google.com/webstore/detail/mcmaster-extension/bnfflmnhnenmijpfmkcafcecdpmfncph?hl=en-US](https://chrome.google.com/webstore/detail/mcmaster-extension/bnfflmnhnenmijpfmkcafcecdpmfncph?hl=en-US)  \nCode is here: [https://github.com/theoddartisan/ChromeMcMasterExtension](https://github.com/theoddartisan/ChromeMcMasterExtension)\n\nWith v1.0.0 the random feature references an array of URLs pulled from one of McMaster's sitemap XML files with over 57,000 unique URLs for browsing their online catalog. While this won't auto-update with any new products McMaster adds and it doesn't get you the resolution that individual part numbers would, it's the best way I figured out how to make this happen so far and is still a blast to see the vast scope of product offerings from McMaster this way.\n\nThis is a fan made project and is not affiliated with McMaster-Carr. I am no coding expert so there are likely many improvements that can be made to the code for efficiency and such - feel free to contribute to the project! I'm just happy to be having fun with learning how to make this happen.", "link": "https://www.reddit.com/r/robotics/comments/i4rd39/anyone_else_a_fan_of_mcmastercarr_to_get_parts/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "anyone else a fan of mcmaster-carr to get parts for your robotics projects? i made a chrome extension to have fun browsing their catalog /!/ mcmaster is a great resource to get parts for my projects and i love to browse through the massive catalog of products that mcmaster-carr sells and always thought that a -----> tool !!!  to bring you to a random product page would be fun. here is my attempt at making that dream come true as a free chrome extension. i've also incorporated a search tool and have some other ideas to add down the line.\n\nthe extension is available here: [https://chrome.google.com/webstore/detail/mcmaster-extension/bnfflmnhnenmijpfmkcafcecdpmfncph?hl=en-us](https://chrome.google.com/webstore/detail/mcmaster-extension/bnfflmnhnenmijpfmkcafcecdpmfncph?hl=en-us)  \ncode is here: [https://github.com/theoddartisan/chromemcmasterextension](https://github.com/theoddartisan/chromemcmasterextension)\n\nwith v1.0.0 the random feature references an array of urls pulled from one of mcmaster's sitemap xml files with over 57,000 unique urls for browsing their online catalog. while this won't auto-update with any new products mcmaster adds and it doesn't get you the resolution that individual part numbers would, it's the best way i figured out how to make this happen so far and is still a blast to see the vast scope of product offerings from mcmaster this way.\n\nthis is a fan made project and is not affiliated with mcmaster-carr. i am no coding expert so there are likely many improvements that can be made to the code for efficiency and such - feel free to contribute to the project! i'm just happy to be having fun with learning how to make this happen.", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": "self", "medialink": "https://www.reddit.com/r/robotics/comments/i4rd39/anyone_else_a_fan_of_mcmastercarr_to_get_parts/", "identifyer": 3504699, "year": "2020"}, {"Unnamed: 0": 4681, "autor": "potesd", "date": 1606496764000, "content": "My coworkers got a pretty spectacular custom ceramic extrusion tool working for the small ABB!!", "link": "https://www.reddit.com/r/robotics/comments/k2507q/my_coworkers_got_a_pretty_spectacular_custom/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "my coworkers got a pretty spectacular custom ceramic extrusion -----> tool !!!  working for the small abb!!", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": "hosted:video", "medialink": "https://v.redd.it/znr0jrd1et161", "identifyer": 3504730, "year": "2020"}, {"Unnamed: 0": 4785, "autor": "flaixed1234", "date": 1594934236000, "content": "first project: automatic curtains that open at specific time /!/ Hey everybody!\n\nI'm a big fan of Michael Reeves and his videos and bc of that wanted to start small projects to get into robotics/electro engineering. I don't have any experience with electro engineering what so ever and I'm currently in my first semester of computer science. \n\nMy idea for my first project was to build something to automate my curtains to open at a specific time in the morning. I quickly realised that without any help its gonna be a real struggle to figure out how I can achieve something like that. The base concept I thought about was to get a motor that has a rope attached to it, which Is also attached to the curtain and can pull it to close/open the curtains. \n\nI didn't figure out which kind of motor I can use for that, I bought a small one from a store for remote controlled cars its called: Absima 80T Brushed, on the back it says Thrust B-Spec is 2310079 80 T.   \nI'm not sure tho if it is fit for the purpose of the project , if it has enough power etc, since its quite a big curtain.   \nI've seen in some videos and other projects from people on the internet that you can program Arduino's and raspberry pi's to control the power for motors. I have no idea tho how to exactly do that, and what is a good fit for my problem.   \nI know it are a lot of I don't knows  and that explaining everything is to much to ask for, but it would be really helpful if I can get some directions on where to get information fit for the idea and maybe what kind of motor would work and what the beginner friendliest tool is to program something like that.\n\n&amp;#x200B;\n\nI appreciate all help and if you need more specific information I am happy to give it! :)\n\n&amp;#x200B;\n\nKind regards \n\nSimon", "link": "https://www.reddit.com/r/robotics/comments/hsilyb/first_project_automatic_curtains_that_open_at/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "first project: automatic curtains that open at specific time /!/ hey everybody!\n\ni'm a big fan of michael reeves and his videos and bc of that wanted to start small projects to get into robotics/electro engineering. i don't have any experience with electro engineering what so ever and i'm currently in my first semester of computer science. \n\nmy idea for my first project was to build something to automate my curtains to open at a specific time in the morning. i quickly realised that without any help its gonna be a real struggle to figure out how i can achieve something like that. the base concept i thought about was to get a motor that has a rope attached to it, which is also attached to the curtain and can pull it to close/open the curtains. \n\ni didn't figure out which kind of motor i can use for that, i bought a small one from a store for remote controlled cars its called: absima 80t brushed, on the back it says thrust b-spec is 2310079 80 t.   \ni'm not sure tho if it is fit for the purpose of the project , if it has enough power etc, since its quite a big curtain.   \ni've seen in some videos and other projects from people on the internet that you can program arduino's and raspberry pi's to control the power for motors. i have no idea tho how to exactly do that, and what is a good fit for my problem.   \ni know it are a lot of i don't knows  and that explaining everything is to much to ask for, but it would be really helpful if i can get some directions on where to get information fit for the idea and maybe what kind of motor would work and what the beginner friendliest -----> tool !!!  is to program something like that.\n\n&amp;#x200b;\n\ni appreciate all help and if you need more specific information i am happy to give it! :)\n\n&amp;#x200b;\n\nkind regards \n\nsimon", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/hsilyb/first_project_automatic_curtains_that_open_at/", "identifyer": 3504838, "year": "2020"}], "name": "toolrobotics2020"}