{"interestingcomments": [{"Unnamed: 0": 2161, "autor": "GSEninja", "date": 1631371649000, "content": "Looking for a particular actuator /!/ Hello r/robotics, love what you girls and guys have done with the place!\n\nPosting here because I am looking for something that would probably be most often used in robotics.\n\nI’m looking for a linear actuator that can be triggered by a 12v momentary switch, 10a preferred, no more than 30a. This actuator needs to have a spring back or plunger effect. Essentially, I press the momentary and the actuator rod retracts (or pulls), then as soon as I let go of the momentary it returns back to its original position.\n\nSpecifics\n- 1” stroke\n- no more than 2” in diameter, 4” in length (max)\n- 12v DC, 10A\n- ~5-10lbs of force should be enough\n\nI’ll be using this internally on a car door. The previous owner of my ‘69 Mustang shaved off the door handles and had a loose cable ran to the trunk to open the door, highly ineffective. I want to correct this with a remote triggered momentary switch and linear actuator.\n\nThanks!", "link": "https://www.reddit.com/r/robotics/comments/pm8pzo/looking_for_a_particular_actuator/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "trunk", "selectorShort": "trunk", "MarkedSent": "looking for a particular actuator /!/ hello r/robotics, love what you girls and guys have done with the place!\n\nposting here because i am looking for something that would probably be most often used in robotics.\n\ni’m looking for a linear actuator that can be triggered by a 12v momentary switch, 10a preferred, no more than 30a. this actuator needs to have a spring back or plunger effect. essentially, i press the momentary and the actuator rod retracts (or pulls), then as soon as i let go of the momentary it returns back to its original position.\n\nspecifics\n- 1” stroke\n- no more than 2” in diameter, 4” in length (max)\n- 12v dc, 10a\n- ~5-10lbs of force should be enough\n\ni’ll be using this internally on a car door. the previous owner of my ‘69 mustang shaved off the door handles and had a loose cable ran to the -----> trunk !!!  to open the door, highly ineffective. i want to correct this with a remote triggered momentary switch and linear actuator.\n\nthanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pm8pzo/looking_for_a_particular_actuator/", "identifyer": 3507273, "year": "2021"}, {"Unnamed: 0": 3918, "autor": "yawniesleeps", "date": 1615233167000, "content": "Question about use of Robot dog? /!/ Hi, I'm just wondering what people would use a robot dog for. I see all the practical usages in the military, police work, and research. But what does everyone think they'll use one for if they were avaliable commercially like buying a car or computer? let's assume that battery power is relatively long lasting 10h (or similar to a smartphone battery life). I saw the A1 dog robot that you could jog with, walk it, and it can interact with other A1 dog robots. I thought it was really funny that the programers would make them like dogs. But i can see how practical it could be having a \"companion\" with you for jogs or daily activities. I would think it would be odd to give a robot exercise lol\n\nI can imagine taking it on hikes or trails where it can record the start and end point to lead you back, survey the land, alert dangers while hiking or camping, carry some hiking gear, record hiking footage and it could bring you things. Maybe down the line, seeing eye dogs or guard replaced by robots? You could probably have it jump into your trunk and unload itself. Take it to Costco or malls to have it follow you around and help you carry and unload your stuff (if the A1 and gets an arm). I think the Boston Dynamic dog robot is too big for day to day usage. But it would be cool to have a little dog or spider go on trips with you.", "link": "https://www.reddit.com/r/robotics/comments/m0ocvw/question_about_use_of_robot_dog/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "trunk", "selectorShort": "trunk", "MarkedSent": "question about use of robot dog? /!/ hi, i'm just wondering what people would use a robot dog for. i see all the practical usages in the military, police work, and research. but what does everyone think they'll use one for if they were avaliable commercially like buying a car or computer? let's assume that battery power is relatively long lasting 10h (or similar to a smartphone battery life). i saw the a1 dog robot that you could jog with, walk it, and it can interact with other a1 dog robots. i thought it was really funny that the programers would make them like dogs. but i can see how practical it could be having a \"companion\" with you for jogs or daily activities. i would think it would be odd to give a robot exercise lol\n\ni can imagine taking it on hikes or trails where it can record the start and end point to lead you back, survey the land, alert dangers while hiking or camping, carry some hiking gear, record hiking footage and it could bring you things. maybe down the line, seeing eye dogs or guard replaced by robots? you could probably have it jump into your -----> trunk !!!  and unload itself. take it to costco or malls to have it follow you around and help you carry and unload your stuff (if the a1 and gets an arm). i think the boston dynamic dog robot is too big for day to day usage. but it would be cool to have a little dog or spider go on trips with you.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/m0ocvw/question_about_use_of_robot_dog/", "identifyer": 3509083, "year": "2021"}], "name": "trunkrobotics2021"}