{"interestingcomments": [{"Unnamed: 0": 1200, "autor": "chonman01", "date": 1626806988000, "content": "What is a stiffness frame? /!/ Hello everyone, \n\nI am an EE, so robotics terminology and mathematics is a little foreign to me. I have encountered some language that I am not quite sure how to make sense of. \n\nIn the documentation there are two ways to measure the F/T sensor values for a specific robotic arm. They are defined as follows: \n\n&amp;#x200B;\n\n&gt; Estimated external wrench (force, torque) acting on stiffness frame, expressed relative to the stiffness frame. \n\nAnd\n\n&gt; Estimated external wrench (force, torque) acting on stiffness frame, expressed relative to the base frame. \n\n&amp;#x200B;\n\nWhat is the stiffness frame?", "link": "https://www.reddit.com/r/robotics/comments/oo8e9l/what_is_a_stiffness_frame/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "wrench", "selectorShort": "wrench", "MarkedSent": "what is a stiffness frame? /!/ hello everyone, \n\ni am an ee, so robotics terminology and mathematics is a little foreign to me. i have encountered some language that i am not quite sure how to make sense of. \n\nin the documentation there are two ways to measure the f/t sensor values for a specific robotic arm. they are defined as follows: \n\n&amp;#x200b;\n\n&gt; estimated external -----> wrench !!!  (force, torque) acting on stiffness frame, expressed relative to the stiffness frame. \n\nand\n\n&gt; estimated external wrench (force, torque) acting on stiffness frame, expressed relative to the base frame. \n\n&amp;#x200b;\n\nwhat is the stiffness frame?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/oo8e9l/what_is_a_stiffness_frame/", "identifyer": 3506283, "year": "2021"}, {"Unnamed: 0": 3789, "autor": "chonman01", "date": 1631054082000, "content": "Displacement Control Using Wrench as Input /!/ Hello, \n\nI am an electrical engineer by trade and have been tasked with a project that requires the use of a robotic arm to actuate forces on a specimen (the end-effector is connected to a rigid body). I have tried to use pure force control, but have come to the understanding that this is somewhat of an abstraction within the field of robotics and that often time there is a hybrid motion-force control that is used. Is this understanding correct? \n\nCurrently the robotic arm accepts a wrench (three forces and three torques) as the input and then I am tracking those forces using internal torque sensors at each joint (7 DOF). This tracking is good, but not great and I gather that displacement control (or some form of this) is the way to go because these arms can track displacement very well. \n\nSo, can I still do some form of displacement control while still accepting the wrench as the input? What would this look like? \n\nAny thoughts and resources would be greatly appreciated. Thank you in advance!", "link": "https://www.reddit.com/r/robotics/comments/pjxq7m/displacement_control_using_wrench_as_input/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "wrench", "selectorShort": "wrench", "MarkedSent": "displacement control using -----> wrench !!!  as input /!/ hello, \n\ni am an electrical engineer by trade and have been tasked with a project that requires the use of a robotic arm to actuate forces on a specimen (the end-effector is connected to a rigid body). i have tried to use pure force control, but have come to the understanding that this is somewhat of an abstraction within the field of robotics and that often time there is a hybrid motion-force control that is used. is this understanding correct? \n\ncurrently the robotic arm accepts a wrench (three forces and three torques) as the input and then i am tracking those forces using internal torque sensors at each joint (7 dof). this tracking is good, but not great and i gather that displacement control (or some form of this) is the way to go because these arms can track displacement very well. \n\nso, can i still do some form of displacement control while still accepting the wrench as the input? what would this look like? \n\nany thoughts and resources would be greatly appreciated. thank you in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/pjxq7m/displacement_control_using_wrench_as_input/", "identifyer": 3508947, "year": "2021"}], "name": "wrenchrobotics2021"}