{"interestingcomments": [{"Unnamed: 0": 315, "autor": "thecoremiester", "date": 1590248773000, "content": "Yard grooming robot. /!/ Hey I'm new to robotics, I'm actually a welder. I wanted to know how ridiculous it would be to attempt to make a robot to rake the dirt and small rocks in my yard (I live in the desert). \nI was thinking of an aluminum frame, two axles with wheels, a small wire rake and a small solar array to keep it powered. The idea would be to be a kind of Roomba function where it changes course when it runs into my fence and other objects in the yard. \nI'm so green I honestly don't know if this is ludacris or something I can piece together with existing softwares and sensors. \nJust looking for something to focus on in these long days at home it doesn't have to function with great efficacy I'd just be super amused if I had a robot running around my yard. \nOpen to any other suggestions along those lines where I could build the structure and have an automated robot hanging around.\nThanks! What you guys do here is super cool!", "link": "https://www.reddit.com/r/robotics/comments/gp73z9/yard_grooming_robot/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "-----> yard !!!  grooming robot. /!/ hey i'm new to robotics, i'm actually a welder. i wanted to know how ridiculous it would be to attempt to make a robot to rake the dirt and small rocks in my yard (i live in the desert). \ni was thinking of an aluminum frame, two axles with wheels, a small wire rake and a small solar array to keep it powered. the idea would be to be a kind of roomba function where it changes course when it runs into my fence and other objects in the yard. \ni'm so green i honestly don't know if this is ludacris or something i can piece together with existing softwares and sensors. \njust looking for something to focus on in these long days at home it doesn't have to function with great efficacy i'd just be super amused if i had a robot running around my yard. \nopen to any other suggestions along those lines where i could build the structure and have an automated robot hanging around.\nthanks! what you guys do here is super cool!", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/gp73z9/yard_grooming_robot/", "identifyer": 3500318, "year": "2020"}, {"Unnamed: 0": 1976, "autor": "wikidot", "date": 1584529555000, "content": "ASI Facility Robotics' Smart Yard Shifting edit", "link": "https://www.reddit.com/r/robotics/comments/fknsul/asi_facility_robotics_smart_yard_shifting_edit/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "asi facility robotics' smart -----> yard !!!  shifting edit", "sortedWord": "None", "removed": null, "score": 1, "comments": 27, "media": "rich:video", "medialink": "https://gfycat.com/impishbeneficialanole", "identifyer": 3501992, "year": "2020"}, {"Unnamed: 0": 2964, "autor": "maxg404", "date": 1608324979000, "content": "4wd Wheelchair Motor Skid Steer /!/  To start, I am very new to the robotics/electronic motors space. I am trying to learn as much as possible. I have read lots information and watched lots of videos, but I still have lots of questions. This is a lengthy post, so thanks to anyone who reads it!\n\n I am looking to build a mini skid steer/electric loader to help with yardwork, specifically mulch moving. I would like to make this a rideable machine. I have a very steep yard, so whatever I build will need to be able to handle sloped and off-road terrain.\n\nI plan on powering it with 4 electric wheelchair motors.  I have a Quantum 1650 base—a large bariatric wheelchair. The base has two large 24v motors and I also have the wheelchair controller module and joystick.\n\nI also have two motors (brakes removed) from a disassembled Jazzy 1113 wheelchairs. I have the controller, although it was not working to control the motors—I believe it is simply a ribbon connector issue in the joystick.\n\nI have a few key decisions/questions which is what brings me here:\n\n**Question #1:** Does anyone have any build plans or suggestions? I have thought about getting some welding work to extend the front of the Quantum 1650 frame, add lift arms, and add sheet metal to the frame to protect electronics. Additional disclaimer: I cannot weld, so any work I would have to pay for.\n\nAnother thought I had was modifying a zero-turn mower frame (ie: strip engine and mount wheelchair motors) to use the 4 motors/wheelchair wheels. My intention is to use mower wheels (or similar), but I am aware I will need to either use couplers or get a hub conversion fabricated as well.  I would also consider a normal riding mower stripped down and modified to support 4 wheels. My concern with both of these approaches is if these platforms would be too heavy.\n\nI have also thought about track drive, but I did not know how well that would work with 4 motors as most tracks (for purchase) I have seen use single drive sprockets. Additionally, to buy these tracks seems quite expensive—even if I go with the cheap ones from Alibaba.\n\n**Question #2:** I have read that the best way to control the motors is to use a Sabretooth 2x60 controller. Does this seem like the best approach, or would anyone recommend any other controller? Additionally, since I am looking to make it a ride on machine, does anyone have any ideas for the best controls? I have seen the sabretooth can support analog controls but have no idea what type of analog controls are available to be used.\n\n**Question #3:** I am thinking of powering the lift arms with either strong electric linear actuators, or with an electric hydraulic pump (like used on a dump trailer). Does anyone have an thoughts on which one is better?\n\nAny other comments/feedbacks/criticisms are welcome. Thanks for any help!\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dt43eff3e0661.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=1122255c516a662c59da1d3973b126f77820a950", "link": "https://www.reddit.com/r/robotics/comments/kfthcq/4wd_wheelchair_motor_skid_steer/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "4wd wheelchair motor skid steer /!/  to start, i am very new to the robotics/electronic motors space. i am trying to learn as much as possible. i have read lots information and watched lots of videos, but i still have lots of questions. this is a lengthy post, so thanks to anyone who reads it!\n\n i am looking to build a mini skid steer/electric loader to help with yardwork, specifically mulch moving. i would like to make this a rideable machine. i have a very steep -----> yard !!! , so whatever i build will need to be able to handle sloped and off-road terrain.\n\ni plan on powering it with 4 electric wheelchair motors.  i have a quantum 1650 base—a large bariatric wheelchair. the base has two large 24v motors and i also have the wheelchair controller module and joystick.\n\ni also have two motors (brakes removed) from a disassembled jazzy 1113 wheelchairs. i have the controller, although it was not working to control the motors—i believe it is simply a ribbon connector issue in the joystick.\n\ni have a few key decisions/questions which is what brings me here:\n\n**question #1:** does anyone have any build plans or suggestions? i have thought about getting some welding work to extend the front of the quantum 1650 frame, add lift arms, and add sheet metal to the frame to protect electronics. additional disclaimer: i cannot weld, so any work i would have to pay for.\n\nanother thought i had was modifying a zero-turn mower frame (ie: strip engine and mount wheelchair motors) to use the 4 motors/wheelchair wheels. my intention is to use mower wheels (or similar), but i am aware i will need to either use couplers or get a hub conversion fabricated as well.  i would also consider a normal riding mower stripped down and modified to support 4 wheels. my concern with both of these approaches is if these platforms would be too heavy.\n\ni have also thought about track drive, but i did not know how well that would work with 4 motors as most tracks (for purchase) i have seen use single drive sprockets. additionally, to buy these tracks seems quite expensive—even if i go with the cheap ones from alibaba.\n\n**question #2:** i have read that the best way to control the motors is to use a sabretooth 2x60 controller. does this seem like the best approach, or would anyone recommend any other controller? additionally, since i am looking to make it a ride on machine, does anyone have any ideas for the best controls? i have seen the sabretooth can support analog controls but have no idea what type of analog controls are available to be used.\n\n**question #3:** i am thinking of powering the lift arms with either strong electric linear actuators, or with an electric hydraulic pump (like used on a dump trailer). does anyone have an thoughts on which one is better?\n\nany other comments/feedbacks/criticisms are welcome. thanks for any help!\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nhttps://preview.redd.it/dt43eff3e0661.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=1122255c516a662c59da1d3973b126f77820a950", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/kfthcq/4wd_wheelchair_motor_skid_steer/", "identifyer": 3502990, "year": "2020"}, {"Unnamed: 0": 4371, "autor": "bobobado2", "date": 1604971971000, "content": "How difficult would this be? /!/ I would like to program some kind of small vehicle to recognize and pick up poop in my yard. (Don’t ask lol...)\n\nAre there any projects or tutorials I could follow to get most of the way there?\n\nConceptually it seems fairly straight forward. Start with an RC car, add one or more cameras or sensors for navigation and poop finding, a poop pickup device, and some kind of mini computer to control everything.\n\nI already know how to build an AI model to recognize poop and waypoints (for navigation) and think I could build something to pick it up. \n\nThanks for any links or guidance you can share!", "link": "https://www.reddit.com/r/robotics/comments/jrbc6s/how_difficult_would_this_be/", "origin": "Reddit", "suborigin": "robotics", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "how difficult would this be? /!/ i would like to program some kind of small vehicle to recognize and pick up poop in my -----> yard !!! . (don’t ask lol...)\n\nare there any projects or tutorials i could follow to get most of the way there?\n\nconceptually it seems fairly straight forward. start with an rc car, add one or more cameras or sensors for navigation and poop finding, a poop pickup device, and some kind of mini computer to control everything.\n\ni already know how to build an ai model to recognize poop and waypoints (for navigation) and think i could build something to pick it up. \n\nthanks for any links or guidance you can share!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/robotics/comments/jrbc6s/how_difficult_would_this_be/", "identifyer": 3504416, "year": "2020"}], "name": "yardrobotics2020"}