{"interestingcomments": [{"autor": "ntoporcov", "date": "2019-01-18 06:21:37", "content": "I created a web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.", "link": "https://www.reddit.com/r/Nikon/comments/ah7lvu/i_created_a_web_app_for_photographers_who_use/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.", "sortedWord": "None", "Identifyer": null, "identifyer": 1248, "year": "2019"}, {"autor": "mister2forme", "date": "2019-08-01 16:39:38", "content": "LPT: Use an \"old\" cell phone or tablet as a field backup device /!/ After switching to the Z7, I went in search of a way to backup the XQD cards in the field.  Purpose built devices appeared to be expensive, so I started fiddling with an \"old\" phone (ZTE Axon 7).  400-512GB micro SD cards have come down a lot in price - [This](https://www.amazon.com/Lexar-High-Performance-512GB-microSDXC-UHS-I/dp/B07KBQQ82D/ref=sr_1_7?keywords=512gb+micro+sd+card&amp;qid=1564676633&amp;s=gateway&amp;sr=8-7) is under 70$ from a reputable storage company\n\nYou can toss the card into the phone, load up Lightroom mobile (or just use Google Photos Importer) and configure it to point to the SD card rather than internal storage.  Using a USB cable from the camera to the phone, the phone immediately picks up on the images and lets you select which to import and even gave me the option to choose between JPG and RAW.  It uses OTG on Android.\n\nA bonus of this is that you can use the phone to directly import into Lightroom back on your computer.  So for those of us who didn't go spend $$$$ on giant XQD/SD cards, this can save a little time by allowing you to import everything in one bulk load.  I think there might even be a setting to have LR mobile generate previews, too. \n\nAdditionally, I'm going to create a way to bulk upload from the phone to my personal cloud (on my NAS), and then create a script to have that copy the files automatically to the photo repository (also on the NAS).  This would allow me to let the photos upload automatically overnight while at a hotel, and have them ready to go when I get home.  I could point the personal cloud straight to my photo repository and take out the script, but I like having the extra exposure buffer.  \n\nSo if you have an old phone kicking around that supports SD and OTG, you could repurpose it.", "link": "https://www.reddit.com/r/Nikon/comments/ckqsqi/lpt_use_an_old_cell_phone_or_tablet_as_a_field/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "i'm going to create", "selectorShort": "create", "MarkedSent": "lpt: use an \"old\" cell phone or tablet as a field backup device /!/ after switching to the z7, i went in search of a way to backup the xqd cards in the field.  purpose built devices appeared to be expensive, so i started fiddling with an \"old\" phone (zte axon 7).  400-512gb micro sd cards have come down a lot in price - [this](https://www.amazon.com/lexar-high-performance-512gb-microsdxc-uhs-i/dp/b07kbqq82d/ref=sr_1_7?keywords=512gb+micro+sd+card&amp;qid=1564676633&amp;s=gateway&amp;sr=8-7) is under 70$ from a reputable storage company\n\nyou can toss the card into the phone, load up lightroom mobile (or just use google photos importer) and configure it to point to the sd card rather than internal storage.  using a usb cable from the camera to the phone, the phone immediately picks up on the images and lets you select which to import and even gave me the option to choose between jpg and raw.  it uses otg on android.\n\na bonus of this is that you can use the phone to directly import into lightroom back on your computer.  so for those of us who didn't go spend $$$$ on giant xqd/sd cards, this can save a little time by allowing you to import everything in one bulk load.  i think there might even be a setting to have lr mobile generate previews, too. \n\nadditionally, -----> i !!! 'm -----> going !!!  -----> to !!!  -----> create !!!  a way -----> to !!!  bulk upload from the phone -----> to !!!  my personal cloud (on my nas), and then -----> create !!!  a script -----> to !!!  have that copy the files automatically -----> to !!!  the photo repository (also on the nas).  this would allow me to let the photos upload automatically overnight while at a hotel, and have them ready to go when i get home.  i could point the personal cloud straight to my photo repository and take out the script, but i like having the extra exposure buffer.  \n\nso if you have an old phone kicking around that supports sd and otg, you could repurpose it.", "sortedWord": "None", "Identifyer": null, "identifyer": 8527, "year": "2019"}, {"autor": "technodean", "date": "2019-04-16 21:48:13", "content": "Creating sparks in the Chapel. Nikon D5200 &amp; nikon 18-105mm", "link": "https://www.reddit.com/r/Nikon/comments/bdzoru/creating_sparks_in_the_chapel_nikon_d5200_nikon/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  sparks in the chapel. nikon d5200 &amp; nikon 18-105mm", "sortedWord": "None", "Identifyer": null, "identifyer": 9079, "year": "2019"}, {"autor": "raghavsaini02", "date": "2019-11-12 17:44:19", "content": "Clicked this one on a hazy morning. As much as I hate haze which is due to pollution, this time it helped me to create this ghostly vibe. But I still hate haze. Clicked with NikonD810 and Tamron 70-210", "link": "https://www.reddit.com/r/Nikon/comments/dvde6x/clicked_this_one_on_a_hazy_morning_as_much_as_i/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "clicked this one on a hazy morning. as much as i hate haze which is due -----> to !!!  pollution, this time it helped -----> me !!!  -----> to !!!  -----> create !!!  this ghostly vibe. but i still hate haze. clicked with nikond810 and tamron 70-210", "sortedWord": "None", "Identifyer": null, "identifyer": 10607, "year": "2019"}], "name": "createnikon2019"}