{"interestingcomments": [{"autor": "raven55six", "date": "2020-08-22 08:41:06", "content": "Shot On: Nikon D3400 • Lens: 18-55 mm • Focal Length: 55mm • Shutter Speed: 1/250 Sec. • f/8.0 • ISO 200. Its 100+ years old castle abandoned from day 1 of completion. Designed by a French architect, situated in upper Shimla-HP, India. There's not even a single iron nail used to bind it together.", "link": "https://www.reddit.com/r/Nikon/comments/ief23s/shot_on_nikon_d3400_lens_1855_mm_focal_length/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "shot on: nikon d3400 • lens: 18-55 mm • focal length: 55mm • shutter speed: 1/250 sec. • f/8.0 • iso 200. its 100+ years old castle abandoned from day 1 of completion. -----> designed !!!  by a french architect, situated in upper shimla-hp, india. there's not even a single iron nail used to bind it together.", "sortedWord": "None", "Identifyer": null, "identifyer": 24749, "year": "2020"}, {"autor": "rishabhkapoor20", "date": "2020-11-04 18:42:16", "content": "Tips needed: Clicking good interior shots of my design projects /!/ Hi. I'm an interior designer. I current own a D5300 with the kit lens 18-55mm lens and a sigma 18-200mm lens. \n\nI'm not really into photography and its not possible to have a professional with me whenever I visit a site nearing completion or around handover. \n\nWould like inputs as to how to click the best images. Main purpose is to post on social media, website, and if really great images come out then magazines too.\n\nFocus being wide angle pictures with details, clarity, close up picturea of artefacts. \n\nWould love to hear from you guys!\n\nAlso what settings to use, keeping in mind I'm a complete amateur. \n\nI currently use my cellphone, but have high hopes that using a dslr might just help me level up.\n\nThanks guys!", "link": "https://www.reddit.com/r/Nikon/comments/jo29yl/tips_needed_clicking_good_interior_shots_of_my/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "tips needed: clicking good interior shots of -----> my !!!  -----> design !!!  projects /!/ hi. i'm an interior designer. i current own a d5300 with the kit lens 18-55mm lens and a sigma 18-200mm lens. \n\ni'm not really into photography and its not possible to have a professional with me whenever i visit a site nearing completion or around handover. \n\nwould like inputs as to how to click the best images. main purpose is to post on social media, website, and if really great images come out then magazines too.\n\nfocus being wide angle pictures with details, clarity, close up picturea of artefacts. \n\nwould love to hear from you guys!\n\nalso what settings to use, keeping in mind i'm a complete amateur. \n\ni currently use my cellphone, but have high hopes that using a dslr might just help me level up.\n\nthanks guys!", "sortedWord": "None", "Identifyer": null, "identifyer": 31803, "year": "2020"}], "name": "designnikon2020"}