{"interestingcomments": [{"autor": "dnm_mm", "date": "2019-12-03 07:36:27", "content": "Z7 beginner, STM r.i.p. /!/ So, my dad was a Nikon guy. He was a “professional” in the way that you are when you take less money to do weddings and events because they are people you know who can’t afford a professional that charges like one. He passed away just more than 2 years ago, and it hit me really hard. When he passed I learned to golf, and that made me feel good, so now I’m going to study some photography. It was never something he shared with me, he never let me touch his camera, but that doesn’t bother me now. I was tempted by the new Sony “god camera” and its 61 mp plus it’s wonderful ability to track eyes in focus, but my dad never had the Nikon he wanted, so I wanted to have the best Nikon kind of for him, and I figured if I was gonna spend any of my meager inheritance on anything for myself, that he would at least respect and appreciate the purchase. Went with the Z7 for the first party lenses as well. I’m hopeful that the Chinese made kit 24-70, 14-30 and 85prime last as long as my dads lenses did. His lenses were sold at auction unfortunately. I couldn’t be there, so Hopefully someone got a deal.\n\n I’m newly of California and an outdoors person who does a lot of hiking and spends a lot of time in the water as well. I love birds, but I won’t be buying a “big” lens anytime soon. I also want to do portraits with the 85mm z lens. I have a small dog I wish to immortalize in ‘film’ , as well as product shots from a brand new business I’m trying to start. Fancy healthy bread. \n\n\nSo, what are the best diy learning resources for photography these days? I’m starting off with the David Busch guide to the z7. What should be my next stop? What should my thought process be?", "link": "https://www.reddit.com/r/Nikon/comments/e5dmye/z7_beginner_stm_rip/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "z7 beginner, stm r.i.p. /!/ so, my dad was a nikon guy. he was a “professional” in the way that you are when you take less money to do weddings and events because they are people you know who can’t afford a professional that charges like one. he passed away just more than 2 years ago, and it hit me really hard. when he passed i learned to golf, and that made me feel good, so now i’m going to study some photography. it was never something he shared with me, he never let me touch his camera, but that doesn’t bother me now. i was tempted by the new sony “god camera” and its 61 mp plus it’s wonderful ability to track eyes in focus, but my dad never had the nikon he wanted, so i wanted to have the best nikon kind of for him, and i figured if i was gonna spend any of my meager inheritance on anything for myself, that he would at least respect and appreciate the purchase. went with the z7 for the first party lenses as well. i’m hopeful that the chinese made kit 24-70, 14-30 and 85prime last as long as my dads lenses did. his lenses were sold at auction unfortunately. i couldn’t be there, so hopefully someone got a deal.\n\n i’m newly of california and an outdoors person who does a lot of hiking and spends a lot of time in the water as well. i love birds, but i won’t be buying a “big” lens anytime soon. i also want to do portraits with the 85mm z lens. i have a small dog i wish to immortalize in ‘film’ , as well as product shots from a brand new business i’m trying to start. fancy healthy bread. \n\n\nso, what are the best -----> diy !!!  learning resources for photography these days? i’m starting off with the david busch guide to the z7. what should be my next stop? what should my thought process be?", "sortedWord": "None", "Identifyer": null, "identifyer": 460, "year": "2019"}, {"autor": "OutbreakMonkey", "date": "2019-07-28 02:39:04", "content": "Just dust or something serious? I'm contemplating a 2nd hand D7200 for high quality family photos. I took a dust photo of clear blue sky and I can see quite few dark splotches. How difficult is this to clean DIY or Professionally? Thoughts? Recommendations?", "link": "https://www.reddit.com/r/Nikon/comments/ciqk23/just_dust_or_something_serious_im_contemplating_a/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "just dust or something serious? i'm contemplating a 2nd hand d7200 for high quality family photos. i took a dust photo of clear blue sky and i can see quite few dark splotches. how difficult is this to clean -----> diy !!!  or professionally? thoughts? recommendations?", "sortedWord": "None", "Identifyer": null, "identifyer": 10419, "year": "2019"}, {"autor": "Jforjustice", "date": "2019-04-08 14:59:03", "content": "Question about Nikon Extension Tube + DSLR + non-AI lenses /!/ Hey folks!\nA question for those who shoot macro + also work with older nikon gear.\n\nI recently got a Nikon 55mm 3.5 micro (non-AI). I also have a D750.\n\nI know the dangers about mounting a non-AI lens on, and the risk of damaging the body. I don't have the energy or the tools to do a cheap DIY conversion from non-AI to AI.\n\nMy question: If I picked up the proper extension tube (M2, PK13, PK3), would this solve my problem? I don't mind manual metering. I just want to shoot this lens on my current body.\n\nThanks in advance.", "link": "https://www.reddit.com/r/Nikon/comments/bautax/question_about_nikon_extension_tube_dslr_nonai/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "question about nikon extension tube + dslr + non-ai lenses /!/ hey folks!\na question for those who shoot macro + also work with older nikon gear.\n\ni recently got a nikon 55mm 3.5 micro (non-ai). i also have a d750.\n\ni know the dangers about mounting a non-ai lens on, and the risk of damaging the body. i don't have the energy or the tools to do a cheap -----> diy !!!  conversion from non-ai to ai.\n\nmy question: if i picked up the proper extension tube (m2, pk13, pk3), would this solve my problem? i don't mind manual metering. i just want to shoot this lens on my current body.\n\nthanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 11228, "year": "2019"}], "name": "diynikon2019"}