{"interestingcomments": [{"autor": "ttstacks", "date": "2020-12-29 19:47:27", "content": "DIY wedding photo booth with Nikon Coolpix /!/ Hi there!\n\nWe are looking at doing a DIY photobooth at our wedding with the point and shoot camera that we already own.\nDoes anyone know of a remote (doesn't have to be wireless) that would work with the Nikon Coolpix w100? I have a older version, bought in 2015, and it's the waterproof one if that makes a difference.", "link": "https://www.reddit.com/r/Nikon/comments/kmlehx/diy_wedding_photo_booth_with_nikon_coolpix/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  wedding photo booth with nikon coolpix /!/ hi there!\n\nwe are looking at doing a diy photobooth at our wedding with the point and shoot camera that we already own.\ndoes anyone know of a remote (doesn't have to be wireless) that would work with the nikon coolpix w100? i have a older version, bought in 2015, and it's the waterproof one if that makes a difference.", "sortedWord": "None", "Identifyer": null, "identifyer": 23054, "year": "2020"}, {"autor": "lsfoto", "date": "2020-07-05 19:36:25", "content": "The ultimate DIY Nikon wireless tethering tool. Built with the Raspberry Pi. For more details please check the video description. Hope you will enjoy this little project. If you like the project pls don't forget to like, share and subscribe 😉", "link": "https://www.reddit.com/r/Nikon/comments/hlsobq/the_ultimate_diy_nikon_wireless_tethering_tool/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the ultimate -----> diy !!!  nikon wireless tethering tool. built with the raspberry pi. for more details please check the video description. hope you will enjoy this little project. if you like the project pls don't forget to like, share and subscribe 😉", "sortedWord": "None", "Identifyer": null, "identifyer": 25686, "year": "2020"}, {"autor": "trixfan", "date": "2020-11-03 17:12:27", "content": "AI modification options for old Nikkor-UD 20mm f/3.5 lens /!/ Note: This post refers to the initial late 1960s version of Nikon's 20mm f/3.5 lens. This lens predates the AI aperture ring, and also has a 72mm filter diameter.\n\nPosing this question to long-time Nikon shooters, or even people who have done a DIY AI conversion process on a Pre-AI lens.\n\nI bought a used 20mm f/3.5 Nikkor-UD lens with good glass, and good mechanicals. The only problem is that this particular copy has a improper aperture ring modification. \n\nThe previous owner of my lens attempted to do his own AI conversion by shaving off several mm of the bottom of the aperture ring. Because there was nothing left on the aperture ring to catch onto the aperture coupling ring, the former owner drilled a tiny screw into the aperture ring. \n\nThe problem is that the screw is a few mm off from where it should be for a lens with f/3.5 maximum aperture. When I open this lens to maximum aperture, or even f/4, the screw doesn't catch onto the aperture coupling ring until I stop the lens down to f/5.6. The result is that I can't meter reliably if the lens aperture is opened wide. I think this is a rather serious limitation. \n\nI've thought about what to do about this problem. I've considered working around the problem by using this lens on a Nikon F3 or Nikon F4 with the metering tab flipped up. This method allows me to shoot this lens with stop-down metering. I suppose I could also only use the lens at  f/5.6 or higher, but this is also very limiting. \n\nAs for fixing the problem, I'm not sure if it's worth the time. I've come up with three possible fixes:\n\n1. Re-drill the screw into the right spot\n2. Swap the aperture ring with another one\n3. Find Nikon's specific AI conversion kit, and install that in place of the original aperture ring\n\nI'm not comfortable with the idea of drilling a second hole into the aperture ring, as I have no experience doing so. The second and third options don't seem very feasible either; I would somehow have to find a spare aperture ring for this lens which is unlikely nowadays. The third option is akin to finding a needle in a haystack, because Nikon stopped making the AI conversion kits several decades ago.\n\nAny thoughts on this problem would be greatly appreciated. Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/jnea5x/ai_modification_options_for_old_nikkorud_20mm_f35/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "ai modification options for old nikkor-ud 20mm f/3.5 lens /!/ note: this post refers to the initial late 1960s version of nikon's 20mm f/3.5 lens. this lens predates the ai aperture ring, and also has a 72mm filter diameter.\n\nposing this question to long-time nikon shooters, or even people who have done a -----> diy !!!  ai conversion process on a pre-ai lens.\n\ni bought a used 20mm f/3.5 nikkor-ud lens with good glass, and good mechanicals. the only problem is that this particular copy has a improper aperture ring modification. \n\nthe previous owner of my lens attempted to do his own ai conversion by shaving off several mm of the bottom of the aperture ring. because there was nothing left on the aperture ring to catch onto the aperture coupling ring, the former owner drilled a tiny screw into the aperture ring. \n\nthe problem is that the screw is a few mm off from where it should be for a lens with f/3.5 maximum aperture. when i open this lens to maximum aperture, or even f/4, the screw doesn't catch onto the aperture coupling ring until i stop the lens down to f/5.6. the result is that i can't meter reliably if the lens aperture is opened wide. i think this is a rather serious limitation. \n\ni've thought about what to do about this problem. i've considered working around the problem by using this lens on a nikon f3 or nikon f4 with the metering tab flipped up. this method allows me to shoot this lens with stop-down metering. i suppose i could also only use the lens at  f/5.6 or higher, but this is also very limiting. \n\nas for fixing the problem, i'm not sure if it's worth the time. i've come up with three possible fixes:\n\n1. re-drill the screw into the right spot\n2. swap the aperture ring with another one\n3. find nikon's specific ai conversion kit, and install that in place of the original aperture ring\n\ni'm not comfortable with the idea of drilling a second hole into the aperture ring, as i have no experience doing so. the second and third options don't seem very feasible either; i would somehow have to find a spare aperture ring for this lens which is unlikely nowadays. the third option is akin to finding a needle in a haystack, because nikon stopped making the ai conversion kits several decades ago.\n\nany thoughts on this problem would be greatly appreciated. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 25956, "year": "2020"}, {"autor": "huntin-is-livin", "date": "2020-12-15 17:05:17", "content": "How to Fix 'Press Shutter Release Button Again' Error on a Nikon DSLR? DIY or not /!/ My D3500 is giving me the \"Press Shutter Release Button Again\" error when I try and take a picture. The camera was bought 12/2018 and I believe it is out of warranty. I know the camera is only worth \\~$300 and a repair could easily be $200 or more. What do I do? Try and fix it myself (I know nothing about cameras) or spend the money to have a repair shop fix it? Should I just put the money towards a new body? The camera has only been used a handful of times so I really don't want to have to buy a new one less than 2 years after buying one. I'm pretty bummed because I wanted to have this fixed as a Xmas present but doesn't look like I will be able to.", "link": "https://www.reddit.com/r/Nikon/comments/kdpm1j/how_to_fix_press_shutter_release_button_again/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to fix 'press shutter release button again' error on a nikon dslr? -----> diy !!!  or not /!/ my d3500 is giving me the \"press shutter release button again\" error when i try and take a picture. the camera was bought 12/2018 and i believe it is out of warranty. i know the camera is only worth \\~$300 and a repair could easily be $200 or more. what do i do? try and fix it myself (i know nothing about cameras) or spend the money to have a repair shop fix it? should i just put the money towards a new body? the camera has only been used a handful of times so i really don't want to have to buy a new one less than 2 years after buying one. i'm pretty bummed because i wanted to have this fixed as a xmas present but doesn't look like i will be able to.", "sortedWord": "None", "Identifyer": null, "identifyer": 27520, "year": "2020"}, {"autor": "edwardianpug", "date": "2020-10-28 16:01:18", "content": "d800 with DIY JerkStopper for tethering", "link": "https://www.reddit.com/r/Nikon/comments/jjqhdp/d800_with_diy_jerkstopper_for_tethering/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "d800 with -----> diy !!!  jerkstopper for tethering", "sortedWord": "None", "Identifyer": null, "identifyer": 29141, "year": "2020"}, {"autor": "muzicoholicated", "date": "2020-07-07 23:20:45", "content": "Help with lens repair 50mm 1.4D /!/ So, while trying to repair my 50mm 1.4D lens, I broke the ribbon cable that connects the internal electronics of the lens to the camera connector on the lens. When I say 'broke', I mean the length of the cable is intact, but the cable is in two pieces.\n\nI tried searching for the cable on the Internet but no luck till now. Can anybody let me know where I'll find this? Part number, website anything would help.\n\nWhile I do have a Nikon service center in my city, the only thing that they can do is ship it off for 14-21 days to a remote location; as they're just a collection center and they do not do any repairs.\n\nI'm okay with DIY as well in case someone wants to guide me in that direction.\n\nAny help would be appreciated. Thanks :)", "link": "https://www.reddit.com/r/Nikon/comments/hn5klr/help_with_lens_repair_50mm_14d/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help with lens repair 50mm 1.4d /!/ so, while trying to repair my 50mm 1.4d lens, i broke the ribbon cable that connects the internal electronics of the lens to the camera connector on the lens. when i say 'broke', i mean the length of the cable is intact, but the cable is in two pieces.\n\ni tried searching for the cable on the internet but no luck till now. can anybody let me know where i'll find this? part number, website anything would help.\n\nwhile i do have a nikon service center in my city, the only thing that they can do is ship it off for 14-21 days to a remote location; as they're just a collection center and they do not do any repairs.\n\ni'm okay with -----> diy !!!  as well in case someone wants to guide me in that direction.\n\nany help would be appreciated. thanks :)", "sortedWord": "None", "Identifyer": null, "identifyer": 29197, "year": "2020"}], "name": "diynikon2020"}