{"interestingcomments": [{"Unnamed: 0": 248712, "autor": "bitshifter52", "date": 1533556424000, "content": "Nikon D7200 - Photographing Perseid Meteor Shower - \"How To\" Suggestions Requested /!/ This upcoming weekend I'll be photographing the Perseid meteor shower at a dark sky location. The equipment I'm planning on using consists of:\n\nNikon D7200  \nRokinon 14mm f2.8 (full frame with Nikon chip) lens\n\nI recognize the D7200 is a crop sensor camera so accordingly the Rokinon is effectively a 21mm lens on this camera body. Crop factor 1.5 X 14mm = 21mm.  According to the research I've done the exposure time for astrophotography is 500 divided by the focal length of the lens. Exposure time 500 / 21 = 23.8 seconds. \n\n**My initial question is what ISO should I be using to capture the stars and meteor trails and keep the sensor noise to a minimum?**\n\nThe technique I'll be using is with the interval timer set for 200 exposures @ 23 seconds each with exposure smoothing turned on. This will/should take 4600 seconds or a little over 1 and 1/4 hours of camera time. Also, I'll take a \"dark frame\" photo (single shot with the lens cap on with the current camera settings) for manual dark frame subtraction in post production. I'll repeat this until I've run all my camera batteries flat. I'll be using GIMP for image stacking and other photo processing.\n\nAny advice and suggestions will be greatly appreciated.\n\nCheers!", "link": "https://www.reddit.com/r/Nikon/comments/950mxf/nikon_d7200_photographing_perseid_meteor_shower/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "nikon d7200 - photographing perseid meteor shower - \"how to\" suggestions requested /!/ this upcoming weekend i'll be photographing the perseid meteor shower at a dark sky -----> location !!! . the equipment i'm planning on using consists of:\n\nnikon d7200  \nrokinon 14mm f2.8 (full frame with nikon chip) lens\n\ni recognize the d7200 is a crop sensor camera so accordingly the rokinon is effectively a 21mm lens on this camera body. crop factor 1.5 x 14mm = 21mm.  according to the research i've done the exposure time for astrophotography is 500 divided by the focal length of the lens. exposure time 500 / 21 = 23.8 seconds. \n\n**my initial question is what iso should i be using to capture the stars and meteor trails and keep the sensor noise to a minimum?**\n\nthe technique i'll be using is with the interval timer set for 200 exposures @ 23 seconds each with exposure smoothing turned on. this will/should take 4600 seconds or a little over 1 and 1/4 hours of camera time. also, i'll take a \"dark frame\" photo (single shot with the lens cap on with the current camera settings) for manual dark frame subtraction in post production. i'll repeat this until i've run all my camera batteries flat. i'll be using gimp for image stacking and other photo processing.\n\nany advice and suggestions will be greatly appreciated.\n\ncheers!", "sortedWord": "None", "identifyer": 44025, "year": "2018"}, {"Unnamed: 0": 249616, "autor": "but_then_i_got_highh", "date": 1515645181000, "content": "Noob here with a noob questions. How to control when and where the lens focuses? Primarily for DOF/bokeh effects? /!/ So I recently picked up a 50mm 1.8 lens for my Nikon D5500. Just fooling around with it I definitely love it over the stock lens. The aperture is an incredible improvement and the cropped field of view forces me to be extra creative with the way I shoot things.\n\nHowever, being still pretty new to photography and controlling my camera settings in general, I was struggling trying to stage a specific kind of shot.\n\nI wanted to take a [levitation photo](https://photogrist.com/wp-content/uploads/2017/03/Christopher-James2-880x1098.jpg) in the forest but was having difficulties getting the camera to focus properly. Obviously the goal is to create a composite image; one of the background by itself and one with the subject in it, standing or laying on an object. \n\nI was in manual focus with what I believed to be appropriate settings. When I would take a picture at 1.8f of the forest without me and the object I was standing on, it would normally autofocus on the nearest tree and only \"bokeh\" a small portion of the background. Then when I set the timer and stood in the location I wanted, the camera did focus on me and create a larger bokeh effect, however the focus was so much different that if I tried to remove the object I was standing on in Photoshop, the background image was not only in a different focus/DOF, but also lighter/more exposed for some reason.\n\nBasically, how do I control the focus to remain the same while also focusing on me when I walk into the image. I'm shooting by myself on a tripod so I'm forced to use a timer. Is it as simple as turning the autofocus off?\n\nBonus noob question: What exactly does the rotating grip on the lens change? It has the infinity symbol and then a set of numbers. It seems to change the focus and FOV but I'm not exactly sure what I'm doing when I mess with it.\n\nThanks to anyone who can help!", "link": "https://www.reddit.com/r/Nikon/comments/7pln4n/noob_here_with_a_noob_questions_how_to_control/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "noob here with a noob questions. how to control when and where the lens focuses? primarily for dof/bokeh effects? /!/ so i recently picked up a 50mm 1.8 lens for my nikon d5500. just fooling around with it i definitely love it over the stock lens. the aperture is an incredible improvement and the cropped field of view forces me to be extra creative with the way i shoot things.\n\nhowever, being still pretty new to photography and controlling my camera settings in general, i was struggling trying to stage a specific kind of shot.\n\ni wanted to take a [levitation photo](https://photogrist.com/wp-content/uploads/2017/03/christopher-james2-880x1098.jpg) in the forest but was having difficulties getting the camera to focus properly. obviously the goal is to create a composite image; one of the background by itself and one with the subject in it, standing or laying on an object. \n\ni was in manual focus with what i believed to be appropriate settings. when i would take a picture at 1.8f of the forest without me and the object i was standing on, it would normally autofocus on the nearest tree and only \"bokeh\" a small portion of the background. then when i set the timer and stood in the -----> location !!!  i wanted, the camera did focus on me and create a larger bokeh effect, however the focus was so much different that if i tried to remove the object i was standing on in photoshop, the background image was not only in a different focus/dof, but also lighter/more exposed for some reason.\n\nbasically, how do i control the focus to remain the same while also focusing on me when i walk into the image. i'm shooting by myself on a tripod so i'm forced to use a timer. is it as simple as turning the autofocus off?\n\nbonus noob question: what exactly does the rotating grip on the lens change? it has the infinity symbol and then a set of numbers. it seems to change the focus and fov but i'm not exactly sure what i'm doing when i mess with it.\n\nthanks to anyone who can help!", "sortedWord": "None", "identifyer": 44943, "year": "2018"}, {"Unnamed: 0": 249876, "autor": "acherion", "date": 1522585800000, "content": "/r/Nikon monthly photo assignment [April 2018] /!/ **Welcome to this month's /r/Nikon monthly photo assignment!**\n\nAnother month, another photo assignment! Here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below. \n\nCongratulations to the following redditors, who had the highest scoring submissions in the month of [March](https://www.reddit.com/r/Nikon/comments/814dd6/rnikon_monthly_photo_assignment_march_2018/), which had the topic of **Water**: \n\n1. [/u/JVih's submission](https://i.imgur.com/tWRxqhz.jpg), titled 'Winter Stream', with 19 upvotes\n2. [/u/Shaka1277's submission](https://www.flickr.com/photos/155307394@N06/25902988067/in/dateposted-public/), a reshoot of an older photo of theirs, with 13 upvotes\n3. [/u/lookaboutphotography's submission](https://flic.kr/p/248Nwtz) titled 'Half Glass Full', also with 13 upvotes\n\nWell done and thank you to everyone who participated! I really enjoyed the Half Glass Full one, I love these kinds of photos!\n\nAt this stage I can't say there's any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work! \n*****\n\n#This month's topic is: On Location\n\nSpring has sprung! (at least in the northern hemisphere anyway), time to get yourself and your gear outside and take some photos! What you do with the topic is up to your interpretation. Feel free to play up the topic as much as you like. The photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\n*****\n\nIt would be great if we can all stick to the following points:\n\n* Please submit only one photo per assignment – obviously your best one!\n* **Your assignment submission must be taken during the current month.**\n* Upload to your Flickr account with EXIF data, or you can upload to Imgur and add the list of gear you used in your comment underneath the link  \n* It goes with saying – photo must be taken with some sort of Nikon photography equipment. Whether that's a Nikon 1, DSLR (with a Nikon lens or otherwise), bridge camera or Coolpix camera, or a Nikon lens on another manufacturer's body, is all acceptable. \n* Images submitted to the assignment must be Safe For Work (SFW)\n* Feel free to comment on other people's submissions. Of course, any comments placed need to follow the subreddit rules (see sidebar) \n\n*****\n\nWe've all been beginners at one stage in our lives, so don't be intimidated with more seasoned photogs, all submissions are most welcome!\n\nSo what are you waiting for? Get out there and take some photos!", "link": "https://www.reddit.com/r/Nikon/comments/88qgvw/rnikon_monthly_photo_assignment_april_2018/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "/r/nikon monthly photo assignment [april 2018] /!/ **welcome to this month's /r/nikon monthly photo assignment!**\n\nanother month, another photo assignment! here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below. \n\ncongratulations to the following redditors, who had the highest scoring submissions in the month of [march](https://www.reddit.com/r/nikon/comments/814dd6/rnikon_monthly_photo_assignment_march_2018/), which had the topic of **water**: \n\n1. [/u/jvih's submission](https://i.imgur.com/twrxqhz.jpg), titled 'winter stream', with 19 upvotes\n2. [/u/shaka1277's submission](https://www.flickr.com/photos/155307394@n06/25902988067/in/dateposted-public/), a reshoot of an older photo of theirs, with 13 upvotes\n3. [/u/lookaboutphotography's submission](https://flic.kr/p/248nwtz) titled 'half glass full', also with 13 upvotes\n\nwell done and thank you to everyone who participated! i really enjoyed the half glass full one, i love these kinds of photos!\n\nat this stage i can't say there's any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work! \n*****\n\n#this month's topic is: on -----> location !!! \n\nspring has sprung! (at least in the northern hemisphere anyway), time to get yourself and your gear outside and take some photos! what you do with the topic is up to your interpretation. feel free to play up the topic as much as you like. the photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\n*****\n\nit would be great if we can all stick to the following points:\n\n* please submit only one photo per assignment – obviously your best one!\n* **your assignment submission must be taken during the current month.**\n* upload to your flickr account with exif data, or you can upload to imgur and add the list of gear you used in your comment underneath the link  \n* it goes with saying – photo must be taken with some sort of nikon photography equipment. whether that's a nikon 1, dslr (with a nikon lens or otherwise), bridge camera or coolpix camera, or a nikon lens on another manufacturer's body, is all acceptable. \n* images submitted to the assignment must be safe for work (sfw)\n* feel free to comment on other people's submissions. of course, any comments placed need to follow the subreddit rules (see sidebar) \n\n*****\n\nwe've all been beginners at one stage in our lives, so don't be intimidated with more seasoned photogs, all submissions are most welcome!\n\nso what are you waiting for? get out there and take some photos!", "sortedWord": "None", "identifyer": 45208, "year": "2018"}, {"Unnamed: 0": 249979, "autor": "nimbulan", "date": 1527524865000, "content": "Nikon D5300 GPS evaluation /!/ I don't know how many people will be interested in this, but I thought I'd write it up since I finally had a good chance to test out the GPS in this camera while visiting the Oregon coast this weekend.\n\nConnection time: I made sure to download the GPS update file from Nikon before my trip, since I've read it can drastically reduce the time it takes to connect.  It definitely seems to work, with no connection taking more than 10 seconds, and usually less than 5.  The camera going into standby cuts off the connection and forces it to reconnect when you start using the camera again, so I highly recommend disabling the standby timer in the GPS options and manually turning the camera off if you know you won't be taking any pictures for a while to save the battery.\n\nConnection stability: The GPS is pretty much nonfunctional indoors, and likely be spotty at best in urban areas with tall buildings.  Outdoors where it connects quickly, the connection seems mostly stable though I do have streaks of non-geotagged pictures in some locations, potentially due to obstacles briefly obscuring a satellite.\n\nGPS accuracy: Very good.  It seems to be spot-on in most locations, while in others it may be 30 feet off.  That's pretty typical for consumer GPS in my understanding.\n\nBattery life: Unfortunately I didn't use my camera enough to evaluate the battery drain caused by the GPS.  My battery stayed at 3 bars throughout the trip.\n\nOverall I'm quite impressed with the GPS.  It does its job well and only requires some small changes to the way I use the camera to keep the connection up.  It really is too bad that Nikon decided to discontinue it in favor of their unreliable mobile apps and the extremely expensive GPS receiver accessory.", "link": "https://www.reddit.com/r/Nikon/comments/8mrbie/nikon_d5300_gps_evaluation/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "nikon d5300 gps evaluation /!/ i don't know how many people will be interested in this, but i thought i'd write it up since i finally had a good chance to test out the gps in this camera while visiting the oregon coast this weekend.\n\nconnection time: i made sure to download the gps update file from nikon before my trip, since i've read it can drastically reduce the time it takes to connect.  it definitely seems to work, with no connection taking more than 10 seconds, and usually less than 5.  the camera going into standby cuts off the connection and forces it to reconnect when you start using the camera again, so i highly recommend disabling the standby timer in the gps options and manually turning the camera off if you know you won't be taking any pictures for a while to save the battery.\n\nconnection stability: the gps is pretty much nonfunctional indoors, and likely be spotty at best in urban areas with tall buildings.  outdoors where it connects quickly, the connection seems mostly stable though i do have streaks of non-geotagged pictures in some -----> locations !!! , potentially due to obstacles briefly obscuring a satellite.\n\ngps accuracy: very good.  it seems to be spot-on in most locations, while in others it may be 30 feet off.  that's pretty typical for consumer gps in my understanding.\n\nbattery life: unfortunately i didn't use my camera enough to evaluate the battery drain caused by the gps.  my battery stayed at 3 bars throughout the trip.\n\noverall i'm quite impressed with the gps.  it does its job well and only requires some small changes to the way i use the camera to keep the connection up.  it really is too bad that nikon decided to discontinue it in favor of their unreliable mobile apps and the extremely expensive gps receiver accessory.", "sortedWord": "None", "identifyer": 45311, "year": "2018"}, {"Unnamed: 0": 250109, "autor": "AndroidLivesMatter", "date": 1531509417000, "content": "Geotagging Photos on a D7100 Without GPS /!/ I purchased a D7100 a few years ago and did not purchase it with a GPS device.  Now that I've become a casual contributor to iNaturalist, I'd like to start geotagging my plant/insect/wildlife photos.  With Nikon's own GPD modules either discontinued or otherwise unavailable, I've researched other options, and they all seem to suffer from one or two drawbacks -- they leverage the D7100's awkwardly placed connector, or they're slow to lock on to a satellite and consume a lot of battery power.\n\nI know some users run an app that tracks their phones' GPS location over time, and then download the resulting GPX file to later sync with their photos' timestamps in post-processing, but that seems like overkill to me (I'd generally take only a dozen or so observations in a single sitting).  What I'm doing right now is running an Android app called GPS status, and each time I take a photo I use the app to e-mail myself my current coordinates (using the photo's subject matter as the subject line).  I then simply copy/paste the coordinates for each photo into Lightroom's map module.\n\nMy approach isn't ideal, but it's the simplest I can think of, due to the low volume of photos taken.  Are there better, smarter, simpler approaches I haven't thought of?", "link": "https://www.reddit.com/r/Nikon/comments/8ymw4a/geotagging_photos_on_a_d7100_without_gps/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "geotagging photos on a d7100 without gps /!/ i purchased a d7100 a few years ago and did not purchase it with a gps device.  now that i've become a casual contributor to inaturalist, i'd like to start geotagging my plant/insect/wildlife photos.  with nikon's own gpd modules either discontinued or otherwise unavailable, i've researched other options, and they all seem to suffer from one or two drawbacks -- they leverage the d7100's awkwardly placed connector, or they're slow to lock on to a satellite and consume a lot of battery power.\n\ni know some users run an app that tracks their phones' gps -----> location !!!  over time, and then download the resulting gpx file to later sync with their photos' timestamps in post-processing, but that seems like overkill to me (i'd generally take only a dozen or so observations in a single sitting).  what i'm doing right now is running an android app called gps status, and each time i take a photo i use the app to e-mail myself my current coordinates (using the photo's subject matter as the subject line).  i then simply copy/paste the coordinates for each photo into lightroom's map module.\n\nmy approach isn't ideal, but it's the simplest i can think of, due to the low volume of photos taken.  are there better, smarter, simpler approaches i haven't thought of?", "sortedWord": "None", "identifyer": 45441, "year": "2018"}, {"Unnamed: 0": 250284, "autor": "nwel-was-here", "date": 1532888266000, "content": "Celebrating 10 Years of the D700: My 10 Recent Favorite Shots [Landscape Photography] /!/ The Nikon D700 came out 10 years ago this month and like many you out there, this was my first full frame camera.\n\nAlthough I've been all sorts of photographer since 2007, I only transitioned to serious landscape photography in 2017 and despite using the D810 for a greater majority of my work, I never had the heart to fully retire the D700. Probably never will!\n\nSo to celebrate 10 years of this legend of a camera, and for a very eventful, life-changing year for me thanks to photography, I want to share 10 of my recent favorite shots and adventures with the D700. :)\n\n\\-----\n\n[It was early January, the height of the brutal Icelandic winter when I decided that it will be my first solo landscape photography destination. Many of the pictures from the trip will never make it to my portfolio but the things I learned from this experience are worth a lot more than what I paid for. I mean, have you ever sunk a rental car into a quick sand? Reynisfjara | January 2017](https://i.redd.it/hp7329qt4xc11.jpg)\n\n[I  would watch the face of this valley change with the clouds, the sun and the rain every morning. A few days later, I played chicken with a snowbank and lost miserably. I found myself on a stretcher being dragged 2000 meters down the slopes of Montafon, and going on an ambulance trip to the nearest hospital. My right ankle is never the same. Schruns, Austria | February 2017](https://i.redd.it/jkdy2hzd6xc11.jpg)\n\n[I originally came to this view point to wait for hours and capture the milky way. But every now and then something else presents itself and you just know.... you got your shot of the day. Domme, France | June 2017](https://i.redd.it/bdnv1z9u7xc11.jpg)\n\n[I have been on and off the roads of the US Pacific Coast since 2013 but my fascination with North American National Parks only started last year. Switching from documentary photography to landscape photography changed the way I travel. Things got hell of a lot more expensive. Grand Teton, Wyoming, USA | October 2017](https://i.redd.it/9gp2jczh8xc11.jpg)\n\n[If you have a keen eye, you may notice by now that I am very fond of using telephotos for landscapes. In fact all the the shots in this post are with the Tamron 70-200mm \\(G1\\). I still take the mandatory cliche shots of many popular locations I go to just to get it over with, but I find that quickly switching to a longer lens would force me to try and get something different from what I'd already find on Instagram. Lava Cast Forest, Oregon, USA | October 2017](https://i.redd.it/3an9xa5paxc11.jpg)\n\n[Yosemite was quite special. How often do you get to experience waking up early in the morning at subzero temperatures only to want to take your shirt off because of the heat by noon? Yosemite NP, California, USA | October 2017](https://i.redd.it/5z9pxrm3cxc11.jpg)\n\n[So I did it. Quit my job, left a company that took good care of me for 7 years, sold my stuff and packed what's left of my gear and belongings into 2 bags. Before I said goodbye to my 14-year old car, I took it for one last spin with three of my closest friends \\(actual people, not lenses\\). Off to Italy and Slovenia we went, shooting away. A week after, I said goodbye to Europe. Trento, Italy | May 2018](https://i.redd.it/kgdbfauqcxc11.jpg)\n\n[Mountains, mountains, mountains. It puts you and your ego in place. Dolomites, Italy | May 2018](https://i.redd.it/sissw85cexc11.jpg)\n\n*Processing img 0guv5et6fxc11...*\n\n*Processing img vxpca1bafxc11...*\n\nHope you enjoy this long sentimental post.\n\nShout out if you still have your D700 and show us your favorite shot with it!\n\n[Follow me on Instagram](https://www.instagram.com/nwel.saturay/) | [My online portfolio](https://portfolio.nwelwashere.com/)", "link": "https://www.reddit.com/r/Nikon/comments/92wrqc/celebrating_10_years_of_the_d700_my_10_recent/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "celebrating 10 years of the d700: my 10 recent favorite shots [landscape photography] /!/ the nikon d700 came out 10 years ago this month and like many you out there, this was my first full frame camera.\n\nalthough i've been all sorts of photographer since 2007, i only transitioned to serious landscape photography in 2017 and despite using the d810 for a greater majority of my work, i never had the heart to fully retire the d700. probably never will!\n\nso to celebrate 10 years of this legend of a camera, and for a very eventful, life-changing year for me thanks to photography, i want to share 10 of my recent favorite shots and adventures with the d700. :)\n\n\\-----\n\n[it was early january, the height of the brutal icelandic winter when i decided that it will be my first solo landscape photography destination. many of the pictures from the trip will never make it to my portfolio but the things i learned from this experience are worth a lot more than what i paid for. i mean, have you ever sunk a rental car into a quick sand? reynisfjara | january 2017](https://i.redd.it/hp7329qt4xc11.jpg)\n\n[i  would watch the face of this valley change with the clouds, the sun and the rain every morning. a few days later, i played chicken with a snowbank and lost miserably. i found myself on a stretcher being dragged 2000 meters down the slopes of montafon, and going on an ambulance trip to the nearest hospital. my right ankle is never the same. schruns, austria | february 2017](https://i.redd.it/jkdy2hzd6xc11.jpg)\n\n[i originally came to this view point to wait for hours and capture the milky way. but every now and then something else presents itself and you just know.... you got your shot of the day. domme, france | june 2017](https://i.redd.it/bdnv1z9u7xc11.jpg)\n\n[i have been on and off the roads of the us pacific coast since 2013 but my fascination with north american national parks only started last year. switching from documentary photography to landscape photography changed the way i travel. things got hell of a lot more expensive. grand teton, wyoming, usa | october 2017](https://i.redd.it/9gp2jczh8xc11.jpg)\n\n[if you have a keen eye, you may notice by now that i am very fond of using telephotos for landscapes. in fact all the the shots in this post are with the tamron 70-200mm \\(g1\\). i still take the mandatory cliche shots of many popular -----> locations !!!  i go to just to get it over with, but i find that quickly switching to a longer lens would force me to try and get something different from what i'd already find on instagram. lava cast forest, oregon, usa | october 2017](https://i.redd.it/3an9xa5paxc11.jpg)\n\n[yosemite was quite special. how often do you get to experience waking up early in the morning at subzero temperatures only to want to take your shirt off because of the heat by noon? yosemite np, california, usa | october 2017](https://i.redd.it/5z9pxrm3cxc11.jpg)\n\n[so i did it. quit my job, left a company that took good care of me for 7 years, sold my stuff and packed what's left of my gear and belongings into 2 bags. before i said goodbye to my 14-year old car, i took it for one last spin with three of my closest friends \\(actual people, not lenses\\). off to italy and slovenia we went, shooting away. a week after, i said goodbye to europe. trento, italy | may 2018](https://i.redd.it/kgdbfauqcxc11.jpg)\n\n[mountains, mountains, mountains. it puts you and your ego in place. dolomites, italy | may 2018](https://i.redd.it/sissw85cexc11.jpg)\n\n*processing img 0guv5et6fxc11...*\n\n*processing img vxpca1bafxc11...*\n\nhope you enjoy this long sentimental post.\n\nshout out if you still have your d700 and show us your favorite shot with it!\n\n[follow me on instagram](https://www.instagram.com/nwel.saturay/) | [my online portfolio](https://portfolio.nwelwashere.com/)", "sortedWord": "None", "identifyer": 45619, "year": "2018"}, {"Unnamed: 0": 250611, "autor": "SircOner", "date": 1533669930000, "content": "Sigma 1.4 HSM Art 20mm v 35mm? Which would you recommend to pair with D750? /!/ Hi fellow Nikonians,\n\nI am looking to get a sharp wide/semi-wide lens (either the 20mm or 35mm Sigma Art F/1.4 ) since these provide excellent image quality and would be really useful for my street/landscape photography.  If it helps, my current gear is:\n\nD3300\nD750\n18-55 &amp; 55-200 DX VR 2\n50mm F/1.8G\n85mm F/1.8G\n24-120mm F/4 VR\nManfrotto Element Tripod\n\nMy questions are:\n\n1. Does anyone know how much resolution I would lose if I were to try to crop the 20mm into effectively what is a 35mm frame if 20mm is shot at 6000x4000\n\nOver the weekend I was shooting with my 24-120 F/4 (kit lens) and took a couple decent shots at 24mm but then I zoomed in a bit further and realized 35 was providing more of the shot I wanted, but that's likely because of where my location was relative to what I was shooting (city scape long exposure photography over NYC). I've never shot at 20mm (I used to have an effective 27mm as my widest on the D3300 and the 24 on D750) but I imagine that if I do, I will likely be cropping in a fair amount of the time to make sure the image is composed to be as interesting as possible) so I want to check to see if I'm going to lose too much resolution, especially if I end up cropping down to something that looks like it could have been shot on a 35mm lens. I know I can do some testing with this with my 24, but i won't get an accurate estimate for comparison sake of how much the resolution would drop from 20 to 35mm cropping in post. I do care about printing, and want to be able to print large enough, so resolution does matter in that sense.\n\n2. What do you guys prefer? Or do you recommend going with the 18-35 Sigma F1.8?\n\nI understand the difference in FoV, but I just can't justify buying both.  I'm leaning toward the 20mm since it'll expand my focal range, is almost just as good as the 35mm in terms of quality (36 on DxO v. 39 for the 35mm), but I do shoot more street photography than anything else living in NYC, so 35mm seems like it might be the sweet spot, although I do have 35mm covered at F/4 (though nowhere near as sharp).  35mm can also be better for group/single portraits I think, whereas 20mm especially at 1.4 can be good for astrophotography. I'm not too crazy on getting a zoom since I really prefer the image quality primes provide - But that's why I'm interested to hear some real world examples of what people have used and prefer!  \n\nAgain I'm leaning toward 20mm since it'll expand my focal range, allow me to take better astrophotography shots (I want to be able to capture more of the scene is all, though I have yet to start AP!), and I can always crop into the image if I don't want to keep the entire shot at 20mm but please let me know what you think!\n\n\nThanks in advance!", "link": "https://www.reddit.com/r/Nikon/comments/95eq3c/sigma_14_hsm_art_20mm_v_35mm_which_would_you/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sigma 1.4 hsm art 20mm v 35mm? which would you recommend to pair with d750? /!/ hi fellow nikonians,\n\ni am looking to get a sharp wide/semi-wide lens (either the 20mm or 35mm sigma art f/1.4 ) since these provide excellent image quality and would be really useful for my street/landscape photography.  if it helps, my current gear is:\n\nd3300\nd750\n18-55 &amp; 55-200 dx vr 2\n50mm f/1.8g\n85mm f/1.8g\n24-120mm f/4 vr\nmanfrotto element tripod\n\nmy questions are:\n\n1. does anyone know how much resolution i would lose if i were to try to crop the 20mm into effectively what is a 35mm frame if 20mm is shot at 6000x4000\n\nover the weekend i was shooting with my 24-120 f/4 (kit lens) and took a couple decent shots at 24mm but then i zoomed in a bit further and realized 35 was providing more of the shot i wanted, but that's likely because of where my -----> location !!!  was relative to what i was shooting (city scape long exposure photography over nyc). i've never shot at 20mm (i used to have an effective 27mm as my widest on the d3300 and the 24 on d750) but i imagine that if i do, i will likely be cropping in a fair amount of the time to make sure the image is composed to be as interesting as possible) so i want to check to see if i'm going to lose too much resolution, especially if i end up cropping down to something that looks like it could have been shot on a 35mm lens. i know i can do some testing with this with my 24, but i won't get an accurate estimate for comparison sake of how much the resolution would drop from 20 to 35mm cropping in post. i do care about printing, and want to be able to print large enough, so resolution does matter in that sense.\n\n2. what do you guys prefer? or do you recommend going with the 18-35 sigma f1.8?\n\ni understand the difference in fov, but i just can't justify buying both.  i'm leaning toward the 20mm since it'll expand my focal range, is almost just as good as the 35mm in terms of quality (36 on dxo v. 39 for the 35mm), but i do shoot more street photography than anything else living in nyc, so 35mm seems like it might be the sweet spot, although i do have 35mm covered at f/4 (though nowhere near as sharp).  35mm can also be better for group/single portraits i think, whereas 20mm especially at 1.4 can be good for astrophotography. i'm not too crazy on getting a zoom since i really prefer the image quality primes provide - but that's why i'm interested to hear some real world examples of what people have used and prefer!  \n\nagain i'm leaning toward 20mm since it'll expand my focal range, allow me to take better astrophotography shots (i want to be able to capture more of the scene is all, though i have yet to start ap!), and i can always crop into the image if i don't want to keep the entire shot at 20mm but please let me know what you think!\n\n\nthanks in advance!", "sortedWord": "None", "identifyer": 45952, "year": "2018"}, {"Unnamed: 0": 250800, "autor": "fromwentzhecame11", "date": 1540224810000, "content": "D7200, New Portrait Lens? /!/ As the title says, I have a D7200 and I mainly take portraits. I currently have the AF-S DX 35mm f/1.8G lens. I also have an ultrawide and a low end 55-200mm Nikon lens. The main lens is the 35mm.\n\nI'm thinking of getting another lens to go along with it. I have read before that people like zoom lenses because the more you zoom in the less separation there is between the subject and background. I don't know how true this is, and I'm sure it's also a matter of personal opinion, but nonetheless, I'm curious about it. I mainly ask, because I would possibly get a Nikon AF-P DX NIKKOR 70-300mm f/4.5-6.3G ED VR Lens (Refurbished) from B&amp;H, which could also replace my 55-200mm and be used for sporting events.\n\nThat said, with my main photography being portraits, would something like the Sigma 17-50mm f/2.8 EX DC OS HSM Zoom Lens be better? I don't know much about this lens, but I do know it covers a similar range to the lens that came with my camera (Nikon AF-P DX NIKKOR 18-55mm f/3.5-5.6G) and that basic lens is still my main one for things like fireworks due to it's flexible zoom. The f/2.8 would offer better night performance. Has anyone had any experience with this lens?\n\nMy budget is at most $400. Any info or suggestions are appreciated.\n\nAlso, does B&amp;H do lens trade ins at their main location?", "link": "https://www.reddit.com/r/Nikon/comments/9qfa1o/d7200_new_portrait_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "d7200, new portrait lens? /!/ as the title says, i have a d7200 and i mainly take portraits. i currently have the af-s dx 35mm f/1.8g lens. i also have an ultrawide and a low end 55-200mm nikon lens. the main lens is the 35mm.\n\ni'm thinking of getting another lens to go along with it. i have read before that people like zoom lenses because the more you zoom in the less separation there is between the subject and background. i don't know how true this is, and i'm sure it's also a matter of personal opinion, but nonetheless, i'm curious about it. i mainly ask, because i would possibly get a nikon af-p dx nikkor 70-300mm f/4.5-6.3g ed vr lens (refurbished) from b&amp;h, which could also replace my 55-200mm and be used for sporting events.\n\nthat said, with my main photography being portraits, would something like the sigma 17-50mm f/2.8 ex dc os hsm zoom lens be better? i don't know much about this lens, but i do know it covers a similar range to the lens that came with my camera (nikon af-p dx nikkor 18-55mm f/3.5-5.6g) and that basic lens is still my main one for things like fireworks due to it's flexible zoom. the f/2.8 would offer better night performance. has anyone had any experience with this lens?\n\nmy budget is at most $400. any info or suggestions are appreciated.\n\nalso, does b&amp;h do lens trade ins at their main -----> location !!! ?", "sortedWord": "None", "identifyer": 46144, "year": "2018"}, {"Unnamed: 0": 250829, "autor": "acherion", "date": 1525169873000, "content": "/r/Nikon monthly photo assignment [May 2018] /!/ **Welcome to this month's /r/Nikon monthly photo assignment!**\n\nAnother month, another photo assignment! Here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below. \n\nCongratulations to the following redditors, who had the highest scoring submissions in the month of [April](https://www.reddit.com/r/Nikon/comments/88qgvw/rnikon_monthly_photo_assignment_april_2018/), which had the topic of **On Location**: \n\n1.\t[/u/Dr-Zoidberg14's submission](https://i.imgur.com/1ALxPBf.jpg), titled 'A River Runs Through It' with 12 upvotes\n2.\t[/u/poohonhead's untitled submission](https://imgur.com/VLl34ps), with 8 upvotes\n3.\t[/u/GreenRainier's submission](https://www.flickr.com/photos/greenrainier253/39507987110/in/album-72157664182312257/) titled 'Glass', with 6 upvotes\n\nWell done and thank you to everyone who participated! We had some new names this month, always great to see.\n\nAt this stage I can't say there's any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work! \n*****\n\n#This month's topic is: Wildlife\n\nThanks to Dr-Zoidberg14 for the suggestion. What you do with the topic is up to your interpretation -- to be fair though, I'm unsure how else you could interpret this month's topic. Regardless, feel free to play up the topic as much as you like. The photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\n*****\n\nIt would be great if we can all stick to the following points:\n\n* Please submit only one photo per assignment – obviously your best one!\n* **Your assignment submission must be taken during the current month.**\n* Upload to your Flickr account with EXIF data, or you can upload to Imgur and add the list of gear you used in your comment underneath the link  \n* It goes with saying – photo must be taken with some sort of Nikon photography equipment. Whether that's a Nikon 1, DSLR (with a Nikon lens or otherwise), bridge camera or Coolpix camera, or a Nikon lens on another manufacturer's body, is all acceptable. \n* Images submitted to the assignment must be Safe For Work (SFW)\n* Feel free to comment on other people's submissions. Of course, any comments placed need to follow the subreddit rules (see sidebar) \n\n*****\n\nWe've all been beginners at one stage in our lives, so don't be intimidated with more seasoned photogs, all submissions are most welcome!\n\nSo what are you waiting for? Get out there and take some photos!", "link": "https://www.reddit.com/r/Nikon/comments/8g7dz7/rnikon_monthly_photo_assignment_may_2018/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "/r/nikon monthly photo assignment [may 2018] /!/ **welcome to this month's /r/nikon monthly photo assignment!**\n\nanother month, another photo assignment! here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below. \n\ncongratulations to the following redditors, who had the highest scoring submissions in the month of [april](https://www.reddit.com/r/nikon/comments/88qgvw/rnikon_monthly_photo_assignment_april_2018/), which had the topic of **on -----> location !!! **: \n\n1.\t[/u/dr-zoidberg14's submission](https://i.imgur.com/1alxpbf.jpg), titled 'a river runs through it' with 12 upvotes\n2.\t[/u/poohonhead's untitled submission](https://imgur.com/vll34ps), with 8 upvotes\n3.\t[/u/greenrainier's submission](https://www.flickr.com/photos/greenrainier253/39507987110/in/album-72157664182312257/) titled 'glass', with 6 upvotes\n\nwell done and thank you to everyone who participated! we had some new names this month, always great to see.\n\nat this stage i can't say there's any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work! \n*****\n\n#this month's topic is: wildlife\n\nthanks to dr-zoidberg14 for the suggestion. what you do with the topic is up to your interpretation -- to be fair though, i'm unsure how else you could interpret this month's topic. regardless, feel free to play up the topic as much as you like. the photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\n*****\n\nit would be great if we can all stick to the following points:\n\n* please submit only one photo per assignment – obviously your best one!\n* **your assignment submission must be taken during the current month.**\n* upload to your flickr account with exif data, or you can upload to imgur and add the list of gear you used in your comment underneath the link  \n* it goes with saying – photo must be taken with some sort of nikon photography equipment. whether that's a nikon 1, dslr (with a nikon lens or otherwise), bridge camera or coolpix camera, or a nikon lens on another manufacturer's body, is all acceptable. \n* images submitted to the assignment must be safe for work (sfw)\n* feel free to comment on other people's submissions. of course, any comments placed need to follow the subreddit rules (see sidebar) \n\n*****\n\nwe've all been beginners at one stage in our lives, so don't be intimidated with more seasoned photogs, all submissions are most welcome!\n\nso what are you waiting for? get out there and take some photos!", "sortedWord": "None", "identifyer": 46173, "year": "2018"}, {"Unnamed: 0": 250843, "autor": "showmeyourkillface", "date": 1525013702000, "content": "D5600 Snapbridge GPS Issue /!/ Hi guys,  I'm using Snapbridge on my Google Pixel 1 XL to connect to my D5600.  All seems fine with regards to streaming photos and using the remote control, but I cannot get the GPS info to transmit to the camera.  The app has permission for location data.\nAny ideas?\n\nThanks\n", "link": "https://www.reddit.com/r/Nikon/comments/8frt5j/d5600_snapbridge_gps_issue/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "d5600 snapbridge gps issue /!/ hi guys,  i'm using snapbridge on my google pixel 1 xl to connect to my d5600.  all seems fine with regards to streaming photos and using the remote control, but i cannot get the gps info to transmit to the camera.  the app has permission for -----> location !!!  data.\nany ideas?\n\nthanks\n", "sortedWord": "None", "identifyer": 46187, "year": "2018"}, {"Unnamed: 0": 251121, "autor": "_Therefore_Aliens_", "date": 1544037663000, "content": "You guys seemed to enjoy my other wide angle portrait from the same location. D700 &amp; 14-24 with Sb-800 shooting through a soft box.", "link": "https://www.reddit.com/r/Nikon/comments/a3fjzf/you_guys_seemed_to_enjoy_my_other_wide_angle/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "you guys seemed to enjoy my other wide angle portrait from the same -----> location !!! . d700 &amp; 14-24 with sb-800 shooting through a soft box.", "sortedWord": "None", "identifyer": 46471, "year": "2018"}, {"Unnamed: 0": 251533, "autor": "Dupleksas", "date": 1531724153000, "content": "Nikon D5300 enable GPS /!/ I recently bought Nikon D5300, and wanted to test it's GPS function, but it seems I can't enable it.\n\nLocation data is greyed out and after trying to press it, it says not avalable in current settings or in current camera state.\n\nDo I need to do something before being able access those settings?", "link": "https://www.reddit.com/r/Nikon/comments/8z8r7x/nikon_d5300_enable_gps/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "nikon d5300 enable gps /!/ i recently bought nikon d5300, and wanted to test it's gps function, but it seems i can't enable it.\n\n-----> location !!!  data is greyed out and after trying to press it, it says not avalable in current settings or in current camera state.\n\ndo i need to do something before being able access those settings?", "sortedWord": "None", "identifyer": 46889, "year": "2018"}, {"Unnamed: 0": 252107, "autor": "__smh", "date": 1525510672000, "content": "D7500 Focus Mode switch /!/ Tonight I'm teaching my fingers and muscle memory the locations of all the contols on a new D7500.  My question concerns the AF-M \"Focus-mode selector\" lever on the body front, right below the lens release button.\n\nThe switch obviously has just two documented positions, but on this unit there is a apparent extra detent between the AF and M positions. (A detent is a position on a rotary switch where it is intended to stop at rest, like the channel stops on an ancient analog TV channel selector.)  This could have any of several explanations:  It's a defect in the switch; or the mystery middle position has some secret functionality, perhaps for calibration during manufacture.\n\nI haven't yet experimented to see what this intermediate position might do, but does anyone have any idea?  Can any other D7500 jockey report if their body feels similar. TIA\n", "link": "https://www.reddit.com/r/Nikon/comments/8h6dsd/d7500_focus_mode_switch/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "d7500 focus mode switch /!/ tonight i'm teaching my fingers and muscle memory the -----> locations !!!  of all the contols on a new d7500.  my question concerns the af-m \"focus-mode selector\" lever on the body front, right below the lens release button.\n\nthe switch obviously has just two documented positions, but on this unit there is a apparent extra detent between the af and m positions. (a detent is a position on a rotary switch where it is intended to stop at rest, like the channel stops on an ancient analog tv channel selector.)  this could have any of several explanations:  it's a defect in the switch; or the mystery middle position has some secret functionality, perhaps for calibration during manufacture.\n\ni haven't yet experimented to see what this intermediate position might do, but does anyone have any idea?  can any other d7500 jockey report if their body feels similar. tia\n", "sortedWord": "None", "identifyer": 47466, "year": "2018"}], "name": "locationnikon2018"}