{"interestingcomments": [{"Unnamed: 0": 248580, "autor": "burning1rr", "date": 1523567689000, "content": "90mm ƒ2.8 Macro focus breathing demo /!/ In my last post about the Tamron 90mm ƒ2.8 macro lens (original post [here](https://www.reddit.com/r/Nikon/comments/8b4z8j/initial_impressions_and_surprises_wtamron_90mm/)), there seemed to be some interesting discussion about focus breathing on Macro lenses. \n\n[I put together a couple of quick shots that demonstrate how much this lens breaths in when focusing from ∞ to 1:1 magnification](https://imgur.com/a/u9IsT). I should emphasize that **focus breathing isn't a unique problem for the Tamron**. Pretty much every macro lens in existence will show the same behavior.\n\nBy my estimation, near focus just about doubles the effective focal length of the lens, making everything seem about twice as large as it would at ∞ focus.\n\nThis focus breathing can create some challenges for framing subjects. Very frequently I will over-estimate how close I need to be to the subject. When I acquire focus, I find myself re-framing, and then re-focusing. I'm sure it's something I'll adapt to with time, but it fairly noticeable as a new shooter.\n\nI find that manual focus is generally pretty easy through the viewfinder; the depth of field is so shallow that I really don't need the manual focus assist. It does however help to have subjects with a lot of depth so that I can see where my depth of field is.\n\nAutofocus generally works well, though it really benefits from having a lot of light when shooting at 1:1 reproduction ratios. I find that AF-C mode works best, but really wish I had a dedicated AF-On button on my camera (I use exposure lock extensively, so I'm not willing to re-map it.)\n\nI'm starting to think that a shorter macro lens would be a lot better for shooting flowers and small machines. Working distance doesn't suffer very much with a shorter lens, since the overall lens length subtracts from working distance.\n\n[Here are some sample images from the lens](https://imgur.com/a/ZL4p8).", "link": "https://www.reddit.com/r/Nikon/comments/8btqm0/90mm_ƒ28_macro_focus_breathing_demo/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "90mm ƒ2.8 macro focus breathing demo /!/ in my last post about the tamron 90mm ƒ2.8 macro lens (original post [here](https://www.reddit.com/r/nikon/comments/8b4z8j/initial_impressions_and_surprises_wtamron_90mm/)), there seemed to be some interesting discussion about focus breathing on macro lenses. \n\n[i put together a couple of quick shots that demonstrate how much this lens breaths in when focusing from ∞ to 1:1 magnification](https://imgur.com/a/u9ist). i should emphasize that **focus breathing isn't a unique problem for the tamron**. pretty much every macro lens in existence will show the same behavior.\n\nby my estimation, near focus just about doubles the effective focal length of the lens, making everything seem about twice as large as it would at ∞ focus.\n\nthis focus breathing can create some challenges for framing subjects. very frequently i will over-estimate how close i need to be to the subject. when i acquire focus, i find myself re-framing, and then re-focusing. i'm sure it's something i'll adapt to with time, but it fairly noticeable as a new shooter.\n\ni find that manual focus is generally pretty easy through the viewfinder; the depth of field is so shallow that i really don't need the manual focus assist. it does however help to have subjects with a lot of depth so that i can see where my depth of field is.\n\nautofocus generally works well, though it really benefits from having a lot of light when shooting at 1:1 reproduction ratios. i find that af-c mode works best, but really wish i had a dedicated af-on button on my camera (i use exposure lock extensively, so i'm not willing to re------> map !!!  it.)\n\ni'm starting to think that a shorter macro lens would be a lot better for shooting flowers and small machines. working distance doesn't suffer very much with a shorter lens, since the overall lens length subtracts from working distance.\n\n[here are some sample images from the lens](https://imgur.com/a/zl4p8).", "sortedWord": "None", "identifyer": 43891, "year": "2018"}, {"Unnamed: 0": 249588, "autor": "TFin04", "date": 1534195260000, "content": "Recommended 77mm filters? /!/ Getting ready to buy a few filters, at least a polarizing and ND, but maybe some color specific ones for shooting black and white.\n\nWondering what brand is a quality option? Prices seem all over the map and I'd like to be sure I'm getting my money's worth.\n\nThey will be used on a D7100 with 17-55 2.8 and 70-200 2.8 lenses. I wouldn't mind buying a kit if one of them makes sense.\n\nThanks for your help.", "link": "https://www.reddit.com/r/Nikon/comments/972aur/recommended_77mm_filters/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "recommended 77mm filters? /!/ getting ready to buy a few filters, at least a polarizing and nd, but maybe some color specific ones for shooting black and white.\n\nwondering what brand is a quality option? prices seem all over the -----> map !!!  and i'd like to be sure i'm getting my money's worth.\n\nthey will be used on a d7100 with 17-55 2.8 and 70-200 2.8 lenses. i wouldn't mind buying a kit if one of them makes sense.\n\nthanks for your help.", "sortedWord": "None", "identifyer": 44915, "year": "2018"}, {"Unnamed: 0": 250308, "autor": "FixNix", "date": 1532705030000, "content": "Playback Issues /!/ Hi all,\n\nI'm facing playback issues on my D750. I noticed during last time locking over the pictures, that there are 4 pictures (Nr 256, 266, 268 and 270) out of ~600 that show a symbol which might indenticate that the file is corrupted or something is wrong. I'm not sure so hopefully someone knows what this issue is. So here is a screenshot of the playback sowing 4 picture where it will show the icon that indenticates something is wrong.\n\nhttps://imgur.com/a/mcDvHqx\n\nWhen I press the OK button which is mapped to zoom in to 100% in my case I'll get the message \"Cannot zoom in on this image.\" on any of those four pictures\n\nhttps://imgur.com/a/6kS8JXY\n\nIf i try to switch from any mode that displays more than 1 picture in playback e.g. from the 4 picture playback to 1 picture playback I'll get one of those two cases:\n\n* Case 1: Picture will be displayed but there is no picture information at all and the picture number in the top right corner will be 0/XXX\n\nhttps://imgur.com/a/YQ8SLsK\n\n* Case 2: I'll get the message \"Cannot display this file\"\n\nhttps://imgur.com/a/ZBClsPt\n\nThe strange thing is that there are zero issues with the files on my computer.\n\nI've formatted the sdcard and pasted the images back onto the card, but the images will still show up as broken. I've also formatted the card in the computer since I've read that there might be broken sectores that will be written to the table to not be used anymore - which is kind of unlikely because the sd card is pretty new. After formatting in the computer I reformatted it in the camera and pasted the images again, but still no change at all!\n\nI've also deleted those images and the strange thing is that now other picture will be shown with this symbol. Does anybody have a clue what might be wrong or what could fix that issue?\n\nThanks in advance!", "link": "https://www.reddit.com/r/Nikon/comments/92dg3e/playback_issues/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "playback issues /!/ hi all,\n\ni'm facing playback issues on my d750. i noticed during last time locking over the pictures, that there are 4 pictures (nr 256, 266, 268 and 270) out of ~600 that show a symbol which might indenticate that the file is corrupted or something is wrong. i'm not sure so hopefully someone knows what this issue is. so here is a screenshot of the playback sowing 4 picture where it will show the icon that indenticates something is wrong.\n\nhttps://imgur.com/a/mcdvhqx\n\nwhen i press the ok button which is -----> mapped !!!  to zoom in to 100% in my case i'll get the message \"cannot zoom in on this image.\" on any of those four pictures\n\nhttps://imgur.com/a/6ks8jxy\n\nif i try to switch from any mode that displays more than 1 picture in playback e.g. from the 4 picture playback to 1 picture playback i'll get one of those two cases:\n\n* case 1: picture will be displayed but there is no picture information at all and the picture number in the top right corner will be 0/xxx\n\nhttps://imgur.com/a/yq8slsk\n\n* case 2: i'll get the message \"cannot display this file\"\n\nhttps://imgur.com/a/zbclspt\n\nthe strange thing is that there are zero issues with the files on my computer.\n\ni've formatted the sdcard and pasted the images back onto the card, but the images will still show up as broken. i've also formatted the card in the computer since i've read that there might be broken sectores that will be written to the table to not be used anymore - which is kind of unlikely because the sd card is pretty new. after formatting in the computer i reformatted it in the camera and pasted the images again, but still no change at all!\n\ni've also deleted those images and the strange thing is that now other picture will be shown with this symbol. does anybody have a clue what might be wrong or what could fix that issue?\n\nthanks in advance!", "sortedWord": "None", "identifyer": 45644, "year": "2018"}, {"Unnamed: 0": 250310, "autor": "TheLegendaryPigSage", "date": 1532693026000, "content": "What tips do you all have regarding photography of the total lunar eclipse? /!/ I'm sure a lot of us will be trying this out tonight. Well, in places where it's visible, at least, which is most of the world except North America, parts of South America, and most of the Pacific, but check a map to be sure.\n\nAdmittedly, I made this thread because I'm looking for advice too, but I think it'll be useful for a variety of people.", "link": "https://www.reddit.com/r/Nikon/comments/92bwyd/what_tips_do_you_all_have_regarding_photography/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "what tips do you all have regarding photography of the total lunar eclipse? /!/ i'm sure a lot of us will be trying this out tonight. well, in places where it's visible, at least, which is most of the world except north america, parts of south america, and most of the pacific, but check a -----> map !!!  to be sure.\n\nadmittedly, i made this thread because i'm looking for advice too, but i think it'll be useful for a variety of people.", "sortedWord": "None", "identifyer": 45646, "year": "2018"}], "name": "mapnikon2018"}