{"interestingcomments": [{"Unnamed: 0": 154816, "autor": "Nippius", "date": 1627738746000, "content": "L-Bracket for Nikon Z50 /!/ Hi everyone,\n\nI'm looking for a L-Bracket for my z50 and was wondering what everyone else was using?\n\nI'm having some trouble deciding what to buy for 2 main reasons:\n\n* Given the current road map for mirrorless DX I'm not sure if I'm going to upgrade to FX (budget allowing 🤞) in the next couple of years so is it best to buy something like the 3leggedthinsg Zayla that only fits the z50 or should I buy a universal L-Bracket?\n\n* I have a Peak Design capture with the dual plate,as such, I am considering the 3leggedthinsg Zayla so I can keep using it. However, there's an issue with the dual plate: it is not symmetric. This is a problem because when the camera is mounted on a nodal slider, the camera points to the left/right of the slider/tripod instead of the front. Does anyone know if the Zayla PD mount is symmetric? By the photos it's hard to tell but it looks like it is.\n\nI'll be using it mainly to get panorama shots using one nodal slider.\n\nThank you!", "link": "https://www.reddit.com/r/Nikon/comments/ov7b9h/lbracket_for_nikon_z50/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "l-bracket for nikon z50 /!/ hi everyone,\n\ni'm looking for a l-bracket for my z50 and was wondering what everyone else was using?\n\ni'm having some trouble deciding what to buy for 2 main reasons:\n\n* given the current road -----> map !!!  for mirrorless dx i'm not sure if i'm going to upgrade to fx (budget allowing 🤞) in the next couple of years so is it best to buy something like the 3leggedthinsg zayla that only fits the z50 or should i buy a universal l-bracket?\n\n* i have a peak design capture with the dual plate,as such, i am considering the 3leggedthinsg zayla so i can keep using it. however, there's an issue with the dual plate: it is not symmetric. this is a problem because when the camera is mounted on a nodal slider, the camera points to the left/right of the slider/tripod instead of the front. does anyone know if the zayla pd mount is symmetric? by the photos it's hard to tell but it looks like it is.\n\ni'll be using it mainly to get panorama shots using one nodal slider.\n\nthank you!", "sortedWord": "None", "identifyer": 46278, "year": "2021"}, {"Unnamed: 0": 157380, "autor": "Shittalker23", "date": 1612415496000, "content": "My kid playing with a constellation map. Dad playing with his camera. Nikon Z6 24-70mm S f4 lens, 1/10s", "link": "https://www.reddit.com/r/Nikon/comments/lc89nl/my_kid_playing_with_a_constellation_map_dad/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "my kid playing with a constellation -----> map !!! . dad playing with his camera. nikon z6 24-70mm s f4 lens, 1/10s", "sortedWord": "None", "identifyer": 48934, "year": "2021"}, {"Unnamed: 0": 161031, "autor": "OctalGorrila8", "date": 1621634054000, "content": "Nikon Z7 w/ 24-70mm f/4 - Camera/lens pairing feedback /!/ For the past six months I've been looking at various lens/camera combinations since I'm looking to swap systems (from Canon).  I do mostly portraits and occassional sports.  For portraits one of my primary tools is the 24-105mm f/4.  I know Nikon has a 24-105mm on the road map, but no ETA at the moment.\n\nI was leaning toward Sony, but after seeing that Nikon has a crop-in mode that effectively turns the 24-70mm into a 35-105mm (roughly), it kind of shook up my thought process.  Seeing this has me thinking to go for the Z7 with a 24-70mm f/4 coupled with a 50mm and 85mm prime.\n\nThe 20mp crop factor is fine for my work.  However, I've seen some reviewers say that the lens feels like a cheap kit lens.  \n\nIn real world use... Is the 24-70mm good enough for part-time professional shoots?", "link": "https://www.reddit.com/r/Nikon/comments/ni3w8n/nikon_z7_w_2470mm_f4_cameralens_pairing_feedback/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "nikon z7 w/ 24-70mm f/4 - camera/lens pairing feedback /!/ for the past six months i've been looking at various lens/camera combinations since i'm looking to swap systems (from canon).  i do mostly portraits and occassional sports.  for portraits one of my primary tools is the 24-105mm f/4.  i know nikon has a 24-105mm on the road -----> map !!! , but no eta at the moment.\n\ni was leaning toward sony, but after seeing that nikon has a crop-in mode that effectively turns the 24-70mm into a 35-105mm (roughly), it kind of shook up my thought process.  seeing this has me thinking to go for the z7 with a 24-70mm f/4 coupled with a 50mm and 85mm prime.\n\nthe 20mp crop factor is fine for my work.  however, i've seen some reviewers say that the lens feels like a cheap kit lens.  \n\nin real world use... is the 24-70mm good enough for part-time professional shoots?", "sortedWord": "None", "identifyer": 52764, "year": "2021"}, {"Unnamed: 0": 164360, "autor": "OutlawedUnicorn", "date": 1621936946000, "content": "Where are the rule of thirds points on the D5600? /!/ The scope on my camera only has a fourths reticle.  I've kind of narrowed down where the intersecting points are but I want like an image map if someone has it. Same thing for the live view.  It's divided in a 4x4", "link": "https://www.reddit.com/r/Nikon/comments/nkm2ke/where_are_the_rule_of_thirds_points_on_the_d5600/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "where are the rule of thirds points on the d5600? /!/ the scope on my camera only has a fourths reticle.  i've kind of narrowed down where the intersecting points are but i want like an image -----> map !!!  if someone has it. same thing for the live view.  it's divided in a 4x4", "sortedWord": "None", "identifyer": 56284, "year": "2021"}], "name": "mapnikon2021"}