{"interestingcomments": [{"Unnamed: 0": 248897, "autor": "BarkingPorsche", "date": 1526577695000, "content": "How to recovery pictures in a formatted card /!/ I have seen some people asking for help with erased pictures, and thus I thought of writing a small HOWTO. It is the kind of thing you need to read before having the problem to avoid losing more than necessary as it is very important to stop writing to the card. You can jump BACKGROUND if you are not interested in technical details.\n\nIf there is interest, I will try to test some (free) recovery softwares to list as alternatives.\n\n**BACKGROUND** \n\nFAT (File Allocation Table) designs a series of file systems developed from 1977 that became widely used with their adoption by MSDOS. Afterwards, the simplicity, availability in most operating systems, and low overhead of FAT made it attractive for usage in a number of devices, such as digital cameras. \n\nA file system works in term of blocks, because of the underlying storage hardware such as hard disks. Each read or write to a hard disk is made in terms of sectors of 512 or 4096 bytes, usually. Hence, a block is usually made up of a number of sectors. \n\nIn FAT lingo, a block is called a cluster (but it is still a block). Each file is composed by a list of clusters. The list itself is stored in the File Allocation Table, a vector with one position for each cluster that is also stored in the same storage as the file system itself. The size of an entry in the FAT is measured in bits and dictates the maximum number of clusters that can be indexed and thus the maximum size of a file system. For example, FAT12 means entries of 12 bits that can index up to 2^12 clusters. If the cluster size is 1 KB, this means that the file system can approximately store 2^12 KB, which is 4 MB. Hence, to store more than 4 MB, the cluster size must be increased.\n\nEach directory stores file descriptors that contain important information about files, such as their size and the first cluster. For example, suppose that a file starts at cluster 4. The 4th entry in FAT will have the index of the next cluster (in this case 5), which will have the next index and so on until an entry that points to end of file.\n\n    1 2 3 4 5 6 7 8 ....\n    - - - 5 7 - 8 - \n\nFAT is very important and, if the clusters where it is stored go corrupt, then it is not possible (or very hard) to extract the complete files from the file system. That is why it is usually stored twice in a file system. \n\nFormatting a file system means to set up the structures required to store the files, such as directories and FATs.\n\n**RECOVERING FILES**\n\nOne important thing in storage is that data is not erased the moment you format the disk or delete the file. Some of it will be overwritten for the format process (such as FAT) but the data stored in the remaining clusters are usually just marked as deleted. In a solid storage technology such as used in SD cards, the memory cells must be reseted before writing on them again, but that process is not instantaneous. Hence, if you act fast enough and block your card from being written on, you should be able to recover most files.\n\nI recommend that you take the card out of the camera, set it to read-only if possible (SD cards may come with a small plastic slider for that) and then bring it to a computer with a recovery tool. Do NOT keep shooting with the card or files will be overwritten by the new pictures.\n\nAfterwards, you should use a tool to read the card and recover the erased files. There are many alternative softwares for that [2], but I don't have a specific one to recommend here.\n\nThe way digital cameras work (writing each file in a single operation) imply that files will most likely be stored in consecutive blocks, making the life for the recovery software easier. Each JPEG or RAW file starts with a magic number [3], making them easier to be recognized even if the file descriptor is lost.\n\n\n**REFERENCES**\n\n[1](https://en.wikipedia.org/wiki/File_Allocation_Table)\n\n[2](https://lifehacker.com/5951822/how-can-i-recover-data-from-a-dead-or-erased-hard-drive)\n\n[3](https://en.wikipedia.org/wiki/List_of_file_signatures)\n", "link": "https://www.reddit.com/r/Nikon/comments/8k605k/how_to_recovery_pictures_in_a_formatted_card/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to recovery pictures in a formatted card /!/ i have seen some people asking for help with erased pictures, and thus i thought of writing a small howto. it is the kind of thing you need to read before having the problem to avoid losing more than necessary as it is very important to stop writing to the card. you can jump background if you are not interested in technical details.\n\nif there is interest, i will try to test some (free) recovery softwares to list as alternatives.\n\n**background** \n\nfat (file allocation table) designs a series of file systems developed from 1977 that became widely used with their adoption by msdos. afterwards, the simplicity, availability in most operating systems, and low overhead of fat made it attractive for usage in a number of devices, such as digital cameras. \n\na file system works in term of blocks, because of the underlying storage hardware such as hard disks. each read or write to a hard disk is made in terms of sectors of 512 or 4096 bytes, usually. hence, a block is usually made up of a number of sectors. \n\nin fat lingo, a block is called a cluster (but it is still a block). each file is composed by a list of clusters. the list itself is stored in the file allocation table, a vector with one -----> position !!!  for each cluster that is also stored in the same storage as the file system itself. the size of an entry in the fat is measured in bits and dictates the maximum number of clusters that can be indexed and thus the maximum size of a file system. for example, fat12 means entries of 12 bits that can index up to 2^12 clusters. if the cluster size is 1 kb, this means that the file system can approximately store 2^12 kb, which is 4 mb. hence, to store more than 4 mb, the cluster size must be increased.\n\neach directory stores file descriptors that contain important information about files, such as their size and the first cluster. for example, suppose that a file starts at cluster 4. the 4th entry in fat will have the index of the next cluster (in this case 5), which will have the next index and so on until an entry that points to end of file.\n\n    1 2 3 4 5 6 7 8 ....\n    - - - 5 7 - 8 - \n\nfat is very important and, if the clusters where it is stored go corrupt, then it is not possible (or very hard) to extract the complete files from the file system. that is why it is usually stored twice in a file system. \n\nformatting a file system means to set up the structures required to store the files, such as directories and fats.\n\n**recovering files**\n\none important thing in storage is that data is not erased the moment you format the disk or delete the file. some of it will be overwritten for the format process (such as fat) but the data stored in the remaining clusters are usually just marked as deleted. in a solid storage technology such as used in sd cards, the memory cells must be reseted before writing on them again, but that process is not instantaneous. hence, if you act fast enough and block your card from being written on, you should be able to recover most files.\n\ni recommend that you take the card out of the camera, set it to read-only if possible (sd cards may come with a small plastic slider for that) and then bring it to a computer with a recovery tool. do not keep shooting with the card or files will be overwritten by the new pictures.\n\nafterwards, you should use a tool to read the card and recover the erased files. there are many alternative softwares for that [2], but i don't have a specific one to recommend here.\n\nthe way digital cameras work (writing each file in a single operation) imply that files will most likely be stored in consecutive blocks, making the life for the recovery software easier. each jpeg or raw file starts with a magic number [3], making them easier to be recognized even if the file descriptor is lost.\n\n\n**references**\n\n[1](https://en.wikipedia.org/wiki/file_allocation_table)\n\n[2](https://lifehacker.com/5951822/how-can-i-recover-data-from-a-dead-or-erased-hard-drive)\n\n[3](https://en.wikipedia.org/wiki/list_of_file_signatures)\n", "sortedWord": "None", "identifyer": 44211, "year": "2018"}, {"Unnamed: 0": 249110, "autor": "ZippyDan", "date": 1520919063000, "content": "Nikon as an adventure camera /!/ I love my Nikon.  Used a D3100 for many years, and have now been using a D750 for two years.\n\nI travel a lot.  I hike a lot.  I walk around many cities and countrysides in many different countries.  I try to wear my Nikon wherever I go, so I will always be ready to capture something.\n\nBoth Nikon and Canon advertise themselves as cameras for field work, and I've seen plenty of examples of both in use in the field.  I've also seen them both advertised for their ruggedness and durability.\n\nI don't baby my Nikon at all.  I use a sling style strap (BlackRapid, for which I also have praise and criticism), and the camera tends to roll and bounce around at my hip somewhat.  I've often used my Nikon in light rain with no protection or in below freezing temperatures and no problems at all.  I've scrambled up boulders, I've navigated tight urban centers, I've laid on dirty grounds, and sometimes my Nikon was thwacked against a rock or wall or gotten covered in dust and dirt.  Through it all my Nikon has performed and I'm pleased with its overall ruggedness.\n\nThere are a few niggling issues though that drive me crazy, because they seem like they would and should be so easy to solve in an age of modern design and manufacturing, and after so many generations of Nikon DSLRs, and especially for high-end professional field cameras.\n\nNamely: why the fuck are all my accessories always falling off?\n\n1. Lens cap - I've lost so many of these.  Surely they could use stronger springs, or simply rethink the way a lens cap secures itself to a lens.  Sometimes the slightest bump will send the cap flying, and depending on the precariousness of my position that sometimes means bye forever.  And a few times it has happened and I didn't even notice it until later.  And those lens caps are freaking expensive for a piece of plastic.  And using a third party lens just makes the situation worse since they are even more liable to fall off.  Anyway, it ended up getting to the point that my lens cap was spending more time clipped to my sling than on my lens.  Then I decided that there is no point carrying a lens cap that I don't even use, and I just let my NC filter do the job of protecting my lens.  Of course, the filter is now scratched to heck (and also fucking expensive).  I'm sure that affects the quality of my photographs but what other option do I have left at this point?  Unscrew my NC before each shot?  Lol.  The only time I use a lens cap now is when the lens is off the camera and in my bag.\n\n2. Lens hood - fuck, this thing is even more expensive than the lens cap.  Thankfully I haven't lost this yet (I did have to buy a new one once because I broke one), but it has fallen off several times.  I think it is the slight rolling action on my hip as I walk that slowly works it loose.  Im actually very sure of this because I notice my kit zoom lens also likes to zoom itself out every time I let it hang.  But here's the thing: I've never had my lens fall off my camera body.  Surely there must be a more secure attachment method that could be designed for a lens hood.\n\n3. Eye piece - goddamn it again.  I've used both the rubber eye piece and the magnification piece and I've lost both so many times I have also lost count.  I assume, again, that they work their way loose while rubbing up against my body.  I'm constantly finding them slightly loose so I'm pretty obsessive about pushing them down back into place whenever I grab my camera, but sometimes after a long walk or trip without using my camera (it is just hanging at my waist), I'll grab it to take a pic and, fuck, the eye piece is gone and who knows when or where it fell off.\n\nAnyone else find this annoying on their Nikon?  Is the fault mine for using a sling strap (surely these are very common in the photographer world)?  Am I doing something wrong?  Any tips to mitigate these issues?  For example, I'm thinking I'm going to try finding a very small, very strong rubber band to wrap around my eye piece and see if that helps to keep it attached.  I've also wondered if it would be possible to mod the lens cap with stronger springs.  Any other thoughts?", "link": "https://www.reddit.com/r/Nikon/comments/841ss5/nikon_as_an_adventure_camera/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon as an adventure camera /!/ i love my nikon.  used a d3100 for many years, and have now been using a d750 for two years.\n\ni travel a lot.  i hike a lot.  i walk around many cities and countrysides in many different countries.  i try to wear my nikon wherever i go, so i will always be ready to capture something.\n\nboth nikon and canon advertise themselves as cameras for field work, and i've seen plenty of examples of both in use in the field.  i've also seen them both advertised for their ruggedness and durability.\n\ni don't baby my nikon at all.  i use a sling style strap (blackrapid, for which i also have praise and criticism), and the camera tends to roll and bounce around at my hip somewhat.  i've often used my nikon in light rain with no protection or in below freezing temperatures and no problems at all.  i've scrambled up boulders, i've navigated tight urban centers, i've laid on dirty grounds, and sometimes my nikon was thwacked against a rock or wall or gotten covered in dust and dirt.  through it all my nikon has performed and i'm pleased with its overall ruggedness.\n\nthere are a few niggling issues though that drive me crazy, because they seem like they would and should be so easy to solve in an age of modern design and manufacturing, and after so many generations of nikon dslrs, and especially for high-end professional field cameras.\n\nnamely: why the fuck are all my accessories always falling off?\n\n1. lens cap - i've lost so many of these.  surely they could use stronger springs, or simply rethink the way a lens cap secures itself to a lens.  sometimes the slightest bump will send the cap flying, and depending on the precariousness of my -----> position !!!  that sometimes means bye forever.  and a few times it has happened and i didn't even notice it until later.  and those lens caps are freaking expensive for a piece of plastic.  and using a third party lens just makes the situation worse since they are even more liable to fall off.  anyway, it ended up getting to the point that my lens cap was spending more time clipped to my sling than on my lens.  then i decided that there is no point carrying a lens cap that i don't even use, and i just let my nc filter do the job of protecting my lens.  of course, the filter is now scratched to heck (and also fucking expensive).  i'm sure that affects the quality of my photographs but what other option do i have left at this point?  unscrew my nc before each shot?  lol.  the only time i use a lens cap now is when the lens is off the camera and in my bag.\n\n2. lens hood - fuck, this thing is even more expensive than the lens cap.  thankfully i haven't lost this yet (i did have to buy a new one once because i broke one), but it has fallen off several times.  i think it is the slight rolling action on my hip as i walk that slowly works it loose.  im actually very sure of this because i notice my kit zoom lens also likes to zoom itself out every time i let it hang.  but here's the thing: i've never had my lens fall off my camera body.  surely there must be a more secure attachment method that could be designed for a lens hood.\n\n3. eye piece - goddamn it again.  i've used both the rubber eye piece and the magnification piece and i've lost both so many times i have also lost count.  i assume, again, that they work their way loose while rubbing up against my body.  i'm constantly finding them slightly loose so i'm pretty obsessive about pushing them down back into place whenever i grab my camera, but sometimes after a long walk or trip without using my camera (it is just hanging at my waist), i'll grab it to take a pic and, fuck, the eye piece is gone and who knows when or where it fell off.\n\nanyone else find this annoying on their nikon?  is the fault mine for using a sling strap (surely these are very common in the photographer world)?  am i doing something wrong?  any tips to mitigate these issues?  for example, i'm thinking i'm going to try finding a very small, very strong rubber band to wrap around my eye piece and see if that helps to keep it attached.  i've also wondered if it would be possible to mod the lens cap with stronger springs.  any other thoughts?", "sortedWord": "None", "identifyer": 44427, "year": "2018"}, {"Unnamed: 0": 249169, "autor": "iamscrooge", "date": 1520385843000, "content": "What mechanism makes G lenses stop down on older film cameras? /!/ My understanding is that the aperture feeler is spring loaded and will always default back to a position which tells the camera that the aperture ring is set to wide-open, unless the tab is forcefully displaced by the tab on an aperture ring on an ai/ais/af/afd lens.\n\nThe aperture lever on the lens is always actuated to the fully-open state when attached to an F mount camera (so it’s nice and bright when we peep through the viewfinder). The design of the aperture lever does not appear (visually at least) to differ between G and AI lenses.\n\nSo, the function of the aperture ring and aperture feeler coupling is to control how far the camera’s actuator *releases* the aperture lever on the camera - taking no action unless the lens is stopped down from wide open.\n\nTherefore - why do G lenses stop down to their smallest aperture when mounted on older film cameras?", "link": "https://www.reddit.com/r/Nikon/comments/82kf4x/what_mechanism_makes_g_lenses_stop_down_on_older/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what mechanism makes g lenses stop down on older film cameras? /!/ my understanding is that the aperture feeler is spring loaded and will always default back to a -----> position !!!  which tells the camera that the aperture ring is set to wide-open, unless the tab is forcefully displaced by the tab on an aperture ring on an ai/ais/af/afd lens.\n\nthe aperture lever on the lens is always actuated to the fully-open state when attached to an f mount camera (so it’s nice and bright when we peep through the viewfinder). the design of the aperture lever does not appear (visually at least) to differ between g and ai lenses.\n\nso, the function of the aperture ring and aperture feeler coupling is to control how far the camera’s actuator *releases* the aperture lever on the camera - taking no action unless the lens is stopped down from wide open.\n\ntherefore - why do g lenses stop down to their smallest aperture when mounted on older film cameras?", "sortedWord": "None", "identifyer": 44487, "year": "2018"}, {"Unnamed: 0": 249783, "autor": "Bonezey", "date": 1521401875000, "content": "Upgrading from D3300 to D7500 /!/ Hey Nikonians,\n\nsince I have tried out the D7500 in a local electronics store I consider to buy it as upgrade to my D3300 which I am using now since 14 months. \n\nDon't get me wrong, you can make great photos with the D3300 using a good lens. But there is stuff I am missing which I did not thought I would when I purchased it. The biggest feature is the tiltable screen. Can't tell how often I would have found this use- und helpful especially when using a tripod and shooting upwards or in a low position. Also the ability to show a virtual horizon, a grid and being able to focus on the screen in LV are things which made me think of getting the D7500. Not to mention the better low light performance of the Expeed 5.\n\nHere comes the but: would it be too fast to upgrade already especially as this is around 1.300 Euro in Germany? I bought the D3300 because I didn't know if this would be the right hobby for me. But I still love it which makes me get out at 6 AM and 0 °C too shoot photos where I stayed in bed before. What do you think?\n\nIf there are D7500 owners here. What are the features you like most and what made you buy this model?\n\nThanks! \n\n\n\nPS: I don't mind the 20.9 MP or the single card slot or missing option for a battery grip. The D5x00 wouldn't be a real upgrade as it does not have that much better features than my current camera.", "link": "https://www.reddit.com/r/Nikon/comments/85dkgf/upgrading_from_d3300_to_d7500/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrading from d3300 to d7500 /!/ hey nikonians,\n\nsince i have tried out the d7500 in a local electronics store i consider to buy it as upgrade to my d3300 which i am using now since 14 months. \n\ndon't get me wrong, you can make great photos with the d3300 using a good lens. but there is stuff i am missing which i did not thought i would when i purchased it. the biggest feature is the tiltable screen. can't tell how often i would have found this use- und helpful especially when using a tripod and shooting upwards or in a low -----> position !!! . also the ability to show a virtual horizon, a grid and being able to focus on the screen in lv are things which made me think of getting the d7500. not to mention the better low light performance of the expeed 5.\n\nhere comes the but: would it be too fast to upgrade already especially as this is around 1.300 euro in germany? i bought the d3300 because i didn't know if this would be the right hobby for me. but i still love it which makes me get out at 6 am and 0 °c too shoot photos where i stayed in bed before. what do you think?\n\nif there are d7500 owners here. what are the features you like most and what made you buy this model?\n\nthanks! \n\n\n\nps: i don't mind the 20.9 mp or the single card slot or missing option for a battery grip. the d5x00 wouldn't be a real upgrade as it does not have that much better features than my current camera.", "sortedWord": "None", "identifyer": 45112, "year": "2018"}, {"Unnamed: 0": 249811, "autor": "darkvothe", "date": 1523042992000, "content": "The old dilema (once again): Getting into FX?? Really?? No... well yess... I don't know! /!/ After 4 years my D5300 has given up unexpectedly, luckily I was already thinking on upgrading. \n\nI will go to the point: I have read a lot, really a lot, about DX vs FX, I know every fact about the D7200 D7500 D500 and D750 (well, not really everything, just all the specifications and so: I am not master of any of those). My search is pretty much narrowed down to D7500  vs D750 . All these posts already talk on D750 vs D7500, and after going over every single comment I have not made my mind so I need to expose my case:\n\n* https://www.reddit.com/r/Nikon/comments/6ip80m/d750_vs_d7500/\n* https://www.reddit.com/r/Nikon/comments/86fcig/d750_vs_d7500/\n* https://www.reddit.com/r/Cameras/comments/7kc1fc/nikon_d750_vs_d7500what_to_get/\n* https://www.reddit.com/r/Nikon/comments/78rs8d/d7500_d500_or_full_frame/\n\n**Please let's not turn this thread into an specification sheet** (I know the D7500 does 4K, has Expeed 5, and so and so and so)\n\nSo the case is:\n\n* Photography intended: Landscapes and portraits. No printing.\n* Lenses that I have: \n    - Nikon AF-S **DX** NIKKOR 18-105mm f/3.5-5.6G\n    - Nikon AF-S **DX** NIKKOR 35mm f/1.8G\n\n     *So, I do not own a single FX lens!*\n\n* About me: this is a hobby for me and I do not intend making money of it intentionally. I want to enjoy the ride the most for as low as possible. I have been dreaming to get into FX since I got the D5300: however 4 years down the line the reign of FX is not so clear. \n\nIf I buy the D750, I was thinking on getting it alongside a entry lens for portrait maybe the Samyang 85mm 1.4 or the Nikon AF-S 85mm f/1.8G (suggestions are very welcome)\n\n**Question 1: Portraits**  \nI can get the D7500 for 870 EUR or the D750 + one of the said lenses for 1500 EUR. For the D7500 I would keep using the 35mm 1.8G (for a while)\n\nIs it worth the extra? If you were in my position, what would you do? Remember that for the D7500 you already own 2 lenses (although these are not great).  Getting the D7500 will mean to me \"Hey, my thing is the DX, and I will stay here for good (probably forever), and I will enjoy this kind of photography and won't look again a FX\". Would you be happy and feel accomplished? Would you live the next 5 years thinking \"what if I had chosen the...??\"\n\n**Question 2: landscape**  \nWhat lens would you recommend me to get initiated in FX wide angle photos (=&lt;24mm) on a budget? \nI would need to know this to really see how many $$ I need to step into FX.\n\nThank you guys for taking the time to read me and help!!\n\nPD: Please, I have already discarded the D7200 and D500, no need to make my decision tougher again.\n\n\n", "link": "https://www.reddit.com/r/Nikon/comments/8acd63/the_old_dilema_once_again_getting_into_fx_really/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the old dilema (once again): getting into fx?? really?? no... well yess... i don't know! /!/ after 4 years my d5300 has given up unexpectedly, luckily i was already thinking on upgrading. \n\ni will go to the point: i have read a lot, really a lot, about dx vs fx, i know every fact about the d7200 d7500 d500 and d750 (well, not really everything, just all the specifications and so: i am not master of any of those). my search is pretty much narrowed down to d7500  vs d750 . all these posts already talk on d750 vs d7500, and after going over every single comment i have not made my mind so i need to expose my case:\n\n* https://www.reddit.com/r/nikon/comments/6ip80m/d750_vs_d7500/\n* https://www.reddit.com/r/nikon/comments/86fcig/d750_vs_d7500/\n* https://www.reddit.com/r/cameras/comments/7kc1fc/nikon_d750_vs_d7500what_to_get/\n* https://www.reddit.com/r/nikon/comments/78rs8d/d7500_d500_or_full_frame/\n\n**please let's not turn this thread into an specification sheet** (i know the d7500 does 4k, has expeed 5, and so and so and so)\n\nso the case is:\n\n* photography intended: landscapes and portraits. no printing.\n* lenses that i have: \n    - nikon af-s **dx** nikkor 18-105mm f/3.5-5.6g\n    - nikon af-s **dx** nikkor 35mm f/1.8g\n\n     *so, i do not own a single fx lens!*\n\n* about me: this is a hobby for me and i do not intend making money of it intentionally. i want to enjoy the ride the most for as low as possible. i have been dreaming to get into fx since i got the d5300: however 4 years down the line the reign of fx is not so clear. \n\nif i buy the d750, i was thinking on getting it alongside a entry lens for portrait maybe the samyang 85mm 1.4 or the nikon af-s 85mm f/1.8g (suggestions are very welcome)\n\n**question 1: portraits**  \ni can get the d7500 for 870 eur or the d750 + one of the said lenses for 1500 eur. for the d7500 i would keep using the 35mm 1.8g (for a while)\n\nis it worth the extra? if you were in my -----> position !!! , what would you do? remember that for the d7500 you already own 2 lenses (although these are not great).  getting the d7500 will mean to me \"hey, my thing is the dx, and i will stay here for good (probably forever), and i will enjoy this kind of photography and won't look again a fx\". would you be happy and feel accomplished? would you live the next 5 years thinking \"what if i had chosen the...??\"\n\n**question 2: landscape**  \nwhat lens would you recommend me to get initiated in fx wide angle photos (=&lt;24mm) on a budget? \ni would need to know this to really see how many $$ i need to step into fx.\n\nthank you guys for taking the time to read me and help!!\n\npd: please, i have already discarded the d7200 and d500, no need to make my decision tougher again.\n\n\n", "sortedWord": "None", "identifyer": 45140, "year": "2018"}, {"Unnamed: 0": 249895, "autor": "Mikedaub", "date": 1528400807000, "content": "Thinning the lenses down to a usable amount. /!/ After taking a couple hiking trips recently, I think it might be time to thin the heard and I figured I would ask to see what others thought of my great idea..\n\nGenerally speaking, my D3400 is used for landscape, family activities (birthday parties, etc), and just some other random things like shooting the dogs and whatnot.  Totally amateur, and don't see me ever getting into a full size sensor. I would imagine, for my needs, I would always stay with a DX camera.  With that in mind, I would rather invest in lenses, but as of now, I have too many for my needs (plus some redundancy).  Here is what I have:\n\n* NIKKOR 35mm f/1.8G \\- This and the 70\\-300mm are the kit lenses that came with the camera.\n* NIKKOR 70\\-300mm f/4.5\\-6.3G ED (No VR) \n* NIKKOR 18\\-55mm f/3.5\\-5.6G VR\n* Nikon 55\\-200mm f/4\\-5.6G ED IF AF\\-S DX VR\n\nObviously, the 70\\-200mm and 70\\-300mm are almost redundant.  The 200 has VR, but the 300 has a bit better zoom.  Because of the VR, and since I rarely carry a tripod, I use the 200mm 95&amp;#37; of the time when needing that type of lens.\n\nThe 35mm is my favorite lens, and use it the bulk of the time I am using the camera.  With how, and what I shoot, I am able to get myself into position where I don't need the 18\\-55mm, and in fact, haven't touched that lens in the past 3 or 4 months.  I am almost exclusively using the 35mm or 200mm VR.\n\nSo, here is my thought... Sell the 18\\-55mm, the 70\\-200mm, and the 70\\-300mm, and buy a 18\\-300mm VR.  That would give me the same range, and VR in all conditions.  I know that lens is a jack of all trades, instead of a specialist lens, but I would think that would cover my needs.  I would keep the 35mm for my walking around shooter, as I am using it now, and then pick up something like a NIKKOR 10\\-20mm f/4.5\\-5.6G VR as my wide angle lens for landscape, etc.  Since I do a fair bit of back packing and hiking, I would only take the 10\\-20mm and the 18\\-300mm and it would cover all my needs..\n\nOK, lets here what you think...  I am not locked into the Nikon brand of lenses, as I have been looking at trying a Sigma or Tamron rental to see what I like then purchase, but I think the Nikon versions give the idea of the range and type of lens I am thinking..", "link": "https://www.reddit.com/r/Nikon/comments/8pdddy/thinning_the_lenses_down_to_a_usable_amount/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thinning the lenses down to a usable amount. /!/ after taking a couple hiking trips recently, i think it might be time to thin the heard and i figured i would ask to see what others thought of my great idea..\n\ngenerally speaking, my d3400 is used for landscape, family activities (birthday parties, etc), and just some other random things like shooting the dogs and whatnot.  totally amateur, and don't see me ever getting into a full size sensor. i would imagine, for my needs, i would always stay with a dx camera.  with that in mind, i would rather invest in lenses, but as of now, i have too many for my needs (plus some redundancy).  here is what i have:\n\n* nikkor 35mm f/1.8g \\- this and the 70\\-300mm are the kit lenses that came with the camera.\n* nikkor 70\\-300mm f/4.5\\-6.3g ed (no vr) \n* nikkor 18\\-55mm f/3.5\\-5.6g vr\n* nikon 55\\-200mm f/4\\-5.6g ed if af\\-s dx vr\n\nobviously, the 70\\-200mm and 70\\-300mm are almost redundant.  the 200 has vr, but the 300 has a bit better zoom.  because of the vr, and since i rarely carry a tripod, i use the 200mm 95&amp;#37; of the time when needing that type of lens.\n\nthe 35mm is my favorite lens, and use it the bulk of the time i am using the camera.  with how, and what i shoot, i am able to get myself into -----> position !!!  where i don't need the 18\\-55mm, and in fact, haven't touched that lens in the past 3 or 4 months.  i am almost exclusively using the 35mm or 200mm vr.\n\nso, here is my thought... sell the 18\\-55mm, the 70\\-200mm, and the 70\\-300mm, and buy a 18\\-300mm vr.  that would give me the same range, and vr in all conditions.  i know that lens is a jack of all trades, instead of a specialist lens, but i would think that would cover my needs.  i would keep the 35mm for my walking around shooter, as i am using it now, and then pick up something like a nikkor 10\\-20mm f/4.5\\-5.6g vr as my wide angle lens for landscape, etc.  since i do a fair bit of back packing and hiking, i would only take the 10\\-20mm and the 18\\-300mm and it would cover all my needs..\n\nok, lets here what you think...  i am not locked into the nikon brand of lenses, as i have been looking at trying a sigma or tamron rental to see what i like then purchase, but i think the nikon versions give the idea of the range and type of lens i am thinking..", "sortedWord": "None", "identifyer": 45227, "year": "2018"}, {"Unnamed: 0": 250063, "autor": "__smh", "date": 1529118853000, "content": "recommendations re wrist strap or hand grip /!/ Since film days I've used a normal neck strap, both indoors and out, which is safe but not much help when shooting on the move.  Lately been thinking of switching to either a wrist strap or a hand grip, the latter giving a lot quicker grasp and tighter control of the camera, opening the possibility of quick one-handed shots.\n\nFor the purposes of this discussion, a wrist strap is a device that simply secures the camera to the wrist, protecting from drops but allowing it to swing free when the hand releases the camera.  A hand grip holds the camera firmly in operating position so the fingers are always poised on the controls.  (The positive side of a neck strap is that it doesn't tie up the right hand at all.) I'm dealing with a D7500, so Nikon hard battery grip options aren't on the table.\n\nI'm leaning to purchasing a leather grip, but there may be issues that aren't obvious.  I'd appreciate advice from anyone who has used either wrist straps or hand grips, including specific models and price ranges.  There are obvious cheap junk no-names out there, but how much should one spend for quality and safety?  The Nikon AH-4 lists for $90 -- seems a lot for a product containing no glass.\n\nTIA\n", "link": "https://www.reddit.com/r/Nikon/comments/8rgnyc/recommendations_re_wrist_strap_or_hand_grip/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "recommendations re wrist strap or hand grip /!/ since film days i've used a normal neck strap, both indoors and out, which is safe but not much help when shooting on the move.  lately been thinking of switching to either a wrist strap or a hand grip, the latter giving a lot quicker grasp and tighter control of the camera, opening the possibility of quick one-handed shots.\n\nfor the purposes of this discussion, a wrist strap is a device that simply secures the camera to the wrist, protecting from drops but allowing it to swing free when the hand releases the camera.  a hand grip holds the camera firmly in operating -----> position !!!  so the fingers are always poised on the controls.  (the positive side of a neck strap is that it doesn't tie up the right hand at all.) i'm dealing with a d7500, so nikon hard battery grip options aren't on the table.\n\ni'm leaning to purchasing a leather grip, but there may be issues that aren't obvious.  i'd appreciate advice from anyone who has used either wrist straps or hand grips, including specific models and price ranges.  there are obvious cheap junk no-names out there, but how much should one spend for quality and safety?  the nikon ah-4 lists for $90 -- seems a lot for a product containing no glass.\n\ntia\n", "sortedWord": "None", "identifyer": 45395, "year": "2018"}, {"Unnamed: 0": 250872, "autor": "marvels_the_second", "date": 1524644431000, "content": "Nikon 3400 - Wide Angle Lens Recommendation /!/ I have been learning photography since January this year and have learnt a massive amount from this sub. The 18-55mm kit lens has been great. I have managed to get some shots I am happy with and I have already purchased a 70-300mm telephoto lens to help me get better wildlife shots. Now I want to improve on my landscape and architecture shots.\n\nI am feeling that the angle of the kit lens is limiting me in terms of getting more of the surroundings of my subject so I have to take a few / many steps back to capture what I want but then I find I'm lacking in sharpness. After some research, I have concluded that getting a wide-angle lens may be the next logical step. However, my research at this point has left me looking at many different lens with massive price differences!\n\nWhat I am looking for is recommendations from people who have been in a similar position as myself and looked for, and purchased, a budget wide-angle lens. As I am an amateur, I have set my budget to be up to £400 which covers the likes of the Nikon AF-P 10-20mm, Sigma 10-20mm f3.5 and the Tokina AT-X PRO 11-16mm. If I find myself still interested in photography in a couple of years and have the money, then I will go for a new body and better lens.\n\nI do not mind buying second hand from place such as CEX, Camera Jungle and London Camera Exchange just as long it stays within my budget. However, Ebay is a big nope.\n\nAnything to help me make a decision on which one to buy would be greatly appreciated.\n\nJust to confirm I have a Nikon 3400.\n", "link": "https://www.reddit.com/r/Nikon/comments/8eryk9/nikon_3400_wide_angle_lens_recommendation/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon 3400 - wide angle lens recommendation /!/ i have been learning photography since january this year and have learnt a massive amount from this sub. the 18-55mm kit lens has been great. i have managed to get some shots i am happy with and i have already purchased a 70-300mm telephoto lens to help me get better wildlife shots. now i want to improve on my landscape and architecture shots.\n\ni am feeling that the angle of the kit lens is limiting me in terms of getting more of the surroundings of my subject so i have to take a few / many steps back to capture what i want but then i find i'm lacking in sharpness. after some research, i have concluded that getting a wide-angle lens may be the next logical step. however, my research at this point has left me looking at many different lens with massive price differences!\n\nwhat i am looking for is recommendations from people who have been in a similar -----> position !!!  as myself and looked for, and purchased, a budget wide-angle lens. as i am an amateur, i have set my budget to be up to £400 which covers the likes of the nikon af-p 10-20mm, sigma 10-20mm f3.5 and the tokina at-x pro 11-16mm. if i find myself still interested in photography in a couple of years and have the money, then i will go for a new body and better lens.\n\ni do not mind buying second hand from place such as cex, camera jungle and london camera exchange just as long it stays within my budget. however, ebay is a big nope.\n\nanything to help me make a decision on which one to buy would be greatly appreciated.\n\njust to confirm i have a nikon 3400.\n", "sortedWord": "None", "identifyer": 46216, "year": "2018"}, {"Unnamed: 0": 251538, "autor": "triple_net", "date": 1531696938000, "content": "Nikon AF-S 28-300mm f/3.5-5.6G Nikkor ED VR Zoom ring slips /!/ I recently purchased a used Nikon 28-300 on Amazon and when it arrived all seemed well.   However after playing with it for a few days I started to notice that randomly the zoom ring will slip when you are trying to come out of the lower end of the range (35-28m). Essentially the ring will spin (all of the ring including rubber) but the barrel will not extend.   To correct the issue you must pull on the barrel until the position catches up with the ring.    It almost feels like something is stripped or worn out.  Has anyone ever had this happen?   \n\nI'm fairly certain I'm just going to send it back but wanted to make sure I'm not doing something wrong first.  \n\nThanks in advance.", "link": "https://www.reddit.com/r/Nikon/comments/8z5z81/nikon_afs_28300mm_f3556g_nikkor_ed_vr_zoom_ring/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon af-s 28-300mm f/3.5-5.6g nikkor ed vr zoom ring slips /!/ i recently purchased a used nikon 28-300 on amazon and when it arrived all seemed well.   however after playing with it for a few days i started to notice that randomly the zoom ring will slip when you are trying to come out of the lower end of the range (35-28m). essentially the ring will spin (all of the ring including rubber) but the barrel will not extend.   to correct the issue you must pull on the barrel until the -----> position !!!  catches up with the ring.    it almost feels like something is stripped or worn out.  has anyone ever had this happen?   \n\ni'm fairly certain i'm just going to send it back but wanted to make sure i'm not doing something wrong first.  \n\nthanks in advance.", "sortedWord": "None", "identifyer": 46894, "year": "2018"}, {"Unnamed: 0": 251650, "autor": "NathanWanderer", "date": 1516153662000, "content": "D7500 and sigma art 18-35 f1.8 autofocus not working? /!/ Just got the D7500 and the sigma art lens and the autofocus isn’t working? What the heck am I doing wrong, just took the two out of the box. The back dial is at the L position and AF is selected on the body AND the lens.\n\nThanks for not judging, this is a big jump from my D5100 and kit lenses.", "link": "https://www.reddit.com/r/Nikon/comments/7qxj6a/d7500_and_sigma_art_1835_f18_autofocus_not_working/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d7500 and sigma art 18-35 f1.8 autofocus not working? /!/ just got the d7500 and the sigma art lens and the autofocus isn’t working? what the heck am i doing wrong, just took the two out of the box. the back dial is at the l -----> position !!!  and af is selected on the body and the lens.\n\nthanks for not judging, this is a big jump from my d5100 and kit lenses.", "sortedWord": "None", "identifyer": 47006, "year": "2018"}, {"Unnamed: 0": 251660, "autor": "Marchman", "date": 1516051335000, "content": "D70 Flash Issue /!/ I recently bought a D70 as a backup camera.  When in auto on the Mode Dial, the flash syncs properly and I get a properly exposed photo.  In the other positions, the flash fires, but the photo is very dark, as if improperly synced, or perhaps restricted in some way as to output power.  Any help on what I'm dealing with would be appreciated.", "link": "https://www.reddit.com/r/Nikon/comments/7qmzso/d70_flash_issue/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "d70 flash issue /!/ i recently bought a d70 as a backup camera.  when in auto on the mode dial, the flash syncs properly and i get a properly exposed photo.  in the other -----> positions !!! , the flash fires, but the photo is very dark, as if improperly synced, or perhaps restricted in some way as to output power.  any help on what i'm dealing with would be appreciated.", "sortedWord": "None", "identifyer": 47016, "year": "2018"}, {"Unnamed: 0": 251963, "autor": "routenull", "date": 1530564135000, "content": "D850 Not Fully Powering Off /!/ I purchased my D850 NIB back in January and ran into a rather odd problem over the weekend.\n\nI was in Atlanta and out randomly shooting around Centennial Park with no issues.  As I was finishing up and started the walk back to the hotel, I flipped the camera to the \"off\" position but the LCD on the top of the camera and the information in the viewfinder remained on.  Flipping the switch back to on and then to off again didn't rectify the problem.  The only way to get the LCD and viewfinder to act like the camera was actually off was to remove the battery.\n\nWhile camera was in this somewhat off state, no buttons responded when pressed, only the shutter release, which caused the camera to display \"r15\" where the remaining picture count displayed on the top LCD.\n\nI've left the battery out of the grip, as well as trying with the memory cards in/out of camera to no avail.  The camera wasn't  or hasn't been dropped or bumped since ownership, nor has it experienced any water or moisture issues.  The weather in Atlanta that day was no different than any other weather I've shot in Florida, so I doubt it was anything related to humidity.\n\nI'm reaching out to Nikon support to see their thoughts but I was wondering if anyone else has ran across this before.", "link": "https://www.reddit.com/r/Nikon/comments/8vm2tb/d850_not_fully_powering_off/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d850 not fully powering off /!/ i purchased my d850 nib back in january and ran into a rather odd problem over the weekend.\n\ni was in atlanta and out randomly shooting around centennial park with no issues.  as i was finishing up and started the walk back to the hotel, i flipped the camera to the \"off\" -----> position !!!  but the lcd on the top of the camera and the information in the viewfinder remained on.  flipping the switch back to on and then to off again didn't rectify the problem.  the only way to get the lcd and viewfinder to act like the camera was actually off was to remove the battery.\n\nwhile camera was in this somewhat off state, no buttons responded when pressed, only the shutter release, which caused the camera to display \"r15\" where the remaining picture count displayed on the top lcd.\n\ni've left the battery out of the grip, as well as trying with the memory cards in/out of camera to no avail.  the camera wasn't  or hasn't been dropped or bumped since ownership, nor has it experienced any water or moisture issues.  the weather in atlanta that day was no different than any other weather i've shot in florida, so i doubt it was anything related to humidity.\n\ni'm reaching out to nikon support to see their thoughts but i was wondering if anyone else has ran across this before.", "sortedWord": "None", "identifyer": 47321, "year": "2018"}, {"Unnamed: 0": 252022, "autor": "delgadophotos", "date": 1538167929000, "content": "D700 Aperture lever in wrong position", "link": "https://www.reddit.com/r/Nikon/comments/9jqprt/d700_aperture_lever_in_wrong_position/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d700 aperture lever in wrong -----> position !!! ", "sortedWord": "None", "identifyer": 47380, "year": "2018"}, {"Unnamed: 0": 252100, "autor": "NakedEmpress", "date": 1525549836000, "content": "A Woman's View of the Fabulous 200-500 Lens /!/ What’s been said about the 200-500 is true:  it renders sharp images with beautiful bokeh, pairs well with the D500 but the AF is a bit boggy, and the 4-stop VR really works.  However, after using this lens for a couple of weeks, I returned it to the Used Department at B&amp;H, glad that I came to my senses and bought it from them before completing a deal with someone from Craig’s List, who wanted me to meet him at his ‘kinda beat up truck’ in a dead mall parking lot--with $1200 in cash.  And in this short time of ownership, I took some lovely images that I doubt I could have captured with my ancient, early edition 70-200 2.8, so it was with great reluctance that I decided to let it go. \n\nWhy?  Because it is too big, too heavy and too unwieldy for me to shoot with for long stretches in the field, tracking birds and wildlife.  It’s not that I’m a petite slip of a thing; no, I’m 5’9”  (175.25 cm) and have adequate arm and upper body strength from years of working out with hand weights.   “Well, didn’t you read the reviews?”  you may be asking.  Of course I did, but aside from SnapChick on YouTube, I think they were all written or videoed by men and while they may have mentioned the lens’ size and heft, they seemed to downplay its significance and did not consider it a rule-out factor in their recommendations.  (Check out the YouTube review by Jurgen Vogt and watch how easily he chucks the lens back and forth between his left hand and right.  https://www.youtube.com/watch?v=2NkBorh0obM&amp;t=111s)\n\nShooting birds in flight or even roosted high in trees means holding the camera and lens in an angled-upward position, which, after about a half hour of shooting, I could only do for maybe a minute at most before my arms began to tremble beyond the ability of the 4-stop VR to overcome.  So, I’d rest and do it again, and again, until the intervals between rest and shaking grew too short to capture anything worth keeping.  I suppose I could increase strength over time and do okay, but then there’s this next factor.\n\nThe circumference of the lens barrel at its greatest point is about 13” (33 cm), roughly the same as that of a Costco-sized jar of Jif peanut butter; my left hand measures 7” (17.8 cm) from the tip of my middle finger to the base of my palm.  When adjusting the zoom, which takes several twists of the barrel, I’d shift lens support away from the left hand while my right hand continued to cradle the camera and fire the shutter, further accelerating the fatigue factor.   In other words, my hand just isn’t big enough and my arm isn’t strong enough to twirl the barrel and support the lens at the same time.\n\nA third concern is the fear that I had that this whole rig was going to slip out of my hands, into a stream or onto rocks and, well, bye-bye to ~$3000 worth of gear.  Since I like to get off paths and down steep, muddy hillsides to shoot streams and flowing water, in addition to whatever wildlife I’m likely to find, I was hesitant to give up at least one hand to carry this awkward bundle.  \n\nSo where to go from here?  I’m looking at two options:  the first is to add a teleconverter to the 70-200, and then invest in a used 300 mm f4 PF when I can find one at some point in the future.  I didn’t write this to complain, rather, I wanted to add a different perspective—a woman’s perspective—to the many reviews of the Nikon 200-500mm lens already out there.  I’d love to hear what other women shooters have to say about this lens, what their experiences have been, and how they’ve been more successful in using it than I was.  \n\ntl/dr:  The 200-500mm lens yields terrific images and I like several of its features a lot, but its size and weight make it impractical for my use.\n\n\n \n\n", "link": "https://www.reddit.com/r/Nikon/comments/8h9xk7/a_womans_view_of_the_fabulous_200500_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a woman's view of the fabulous 200-500 lens /!/ what’s been said about the 200-500 is true:  it renders sharp images with beautiful bokeh, pairs well with the d500 but the af is a bit boggy, and the 4-stop vr really works.  however, after using this lens for a couple of weeks, i returned it to the used department at b&amp;h, glad that i came to my senses and bought it from them before completing a deal with someone from craig’s list, who wanted me to meet him at his ‘kinda beat up truck’ in a dead mall parking lot--with $1200 in cash.  and in this short time of ownership, i took some lovely images that i doubt i could have captured with my ancient, early edition 70-200 2.8, so it was with great reluctance that i decided to let it go. \n\nwhy?  because it is too big, too heavy and too unwieldy for me to shoot with for long stretches in the field, tracking birds and wildlife.  it’s not that i’m a petite slip of a thing; no, i’m 5’9”  (175.25 cm) and have adequate arm and upper body strength from years of working out with hand weights.   “well, didn’t you read the reviews?”  you may be asking.  of course i did, but aside from snapchick on youtube, i think they were all written or videoed by men and while they may have mentioned the lens’ size and heft, they seemed to downplay its significance and did not consider it a rule-out factor in their recommendations.  (check out the youtube review by jurgen vogt and watch how easily he chucks the lens back and forth between his left hand and right.  https://www.youtube.com/watch?v=2nkborh0obm&amp;t=111s)\n\nshooting birds in flight or even roosted high in trees means holding the camera and lens in an angled-upward -----> position !!! , which, after about a half hour of shooting, i could only do for maybe a minute at most before my arms began to tremble beyond the ability of the 4-stop vr to overcome.  so, i’d rest and do it again, and again, until the intervals between rest and shaking grew too short to capture anything worth keeping.  i suppose i could increase strength over time and do okay, but then there’s this next factor.\n\nthe circumference of the lens barrel at its greatest point is about 13” (33 cm), roughly the same as that of a costco-sized jar of jif peanut butter; my left hand measures 7” (17.8 cm) from the tip of my middle finger to the base of my palm.  when adjusting the zoom, which takes several twists of the barrel, i’d shift lens support away from the left hand while my right hand continued to cradle the camera and fire the shutter, further accelerating the fatigue factor.   in other words, my hand just isn’t big enough and my arm isn’t strong enough to twirl the barrel and support the lens at the same time.\n\na third concern is the fear that i had that this whole rig was going to slip out of my hands, into a stream or onto rocks and, well, bye-bye to ~$3000 worth of gear.  since i like to get off paths and down steep, muddy hillsides to shoot streams and flowing water, in addition to whatever wildlife i’m likely to find, i was hesitant to give up at least one hand to carry this awkward bundle.  \n\nso where to go from here?  i’m looking at two options:  the first is to add a teleconverter to the 70-200, and then invest in a used 300 mm f4 pf when i can find one at some point in the future.  i didn’t write this to complain, rather, i wanted to add a different perspective—a woman’s perspective—to the many reviews of the nikon 200-500mm lens already out there.  i’d love to hear what other women shooters have to say about this lens, what their experiences have been, and how they’ve been more successful in using it than i was.  \n\ntl/dr:  the 200-500mm lens yields terrific images and i like several of its features a lot, but its size and weight make it impractical for my use.\n\n\n \n\n", "sortedWord": "None", "identifyer": 47459, "year": "2018"}], "name": "positionnikon2018"}