{"interestingcomments": [{"autor": "nmgmarques", "date": "2020-05-15 23:41:06", "content": "Better off getting aacro lens adapter or an extension tube? /!/ Hi all. I shoot with a D7500 and a stock NIKKOR 18-200mm lens. Though I have never gotten the sharpest results, the range is pretty great for shooting most all from wide to close up zoomed in, with the obvious limitations of the lens. Lately I have been exploring close up and trying to get in close. With this lens it isn't easy. I have been thinking about it and figured the best would be a dedicated macro lens, though the prices scare me a bit. Hence I have been eying extension tubes and macro lens adapters. I even 3D printed an extension tube which works pretty well, but I am not confident about it's durability and haven't used it beyond testing as I don't want something to break off and mess up the camera body. \n\nTherefore, I am looking for recommendations for either extension tunes or macro adapters for a 72mm thread. And opinions as to which you'd use and why. \n\nAll input greatly appreciated.", "link": "https://www.reddit.com/r/Nikon/comments/gkk845/better_off_getting_aacro_lens_adapter_or_an/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "better off getting aacro lens adapter or an extension tube? /!/ hi all. i shoot with a d7500 and a stock nikkor 18-200mm lens. though i have never gotten the sharpest results, the range is pretty great for shooting most all from wide to close up zoomed in, with the obvious limitations of the lens. lately i have been exploring close up and trying to get in close. with this lens it isn't easy. i have been thinking about it and figured the best would be a dedicated macro lens, though the prices scare me a bit. hence i have been eying extension tubes and macro lens adapters. i even -----> 3d !!!  -----> printed !!!  an extension tube which works pretty well, but i am not confident about it's durability and haven't used it beyond testing as i don't want something to break off and mess up the camera body. \n\ntherefore, i am looking for recommendations for either extension tunes or macro adapters for a 72mm thread. and opinions as to which you'd use and why. \n\nall input greatly appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 25413, "year": "2020"}, {"autor": "willt21", "date": "2020-12-18 23:36:53", "content": "clip-in filter for Nikon d3400 /!/ Howdy everyone! Recently I've been looking into light pollution filters and it seems like the d3400 doesn't have much support for clip-in. Does anyone have experience with this or know what type of filter size will work? It almost looks like a full-size canon filter would fit. I may just need to 3d print an adaptor to a 2\" filter to connect to my camera lens if not. Thanks", "link": "https://www.reddit.com/r/Nikon/comments/kfwjb8/clipin_filter_for_nikon_d3400/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "clip-in filter for nikon d3400 /!/ howdy everyone! recently i've been looking into light pollution filters and it seems like the d3400 doesn't have much support for clip-in. does anyone have experience with this or know what type of filter size will work? it almost looks like a full-size canon filter would fit. i may just need to -----> 3d !!!  -----> print !!!  an adaptor to a 2\" filter to connect to my camera lens if not. thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 31917, "year": "2020"}], "name": "printnikon2020"}