{"interestingcomments": [{"Unnamed: 0": 159443, "autor": "chossmonster", "date": 1628187797000, "content": "Post-Adventure Race Recap: Seventy48 &amp; WA360 with D850 and Z6 /!/ **Overview**\nPhoto selects: https://adobe.ly/2TUV4T0\nFrom June 4th to the 13th of 2021, I worked for the Northwest Maritime Center’s media team in Port Townsend, Washington for their Seventy48 and Washington 360 adventure boat races. We lived and worked on everything from small 8-foot RHIBs (rigid hull inflatable boat) to 50-foot motor cruisers. From Port Townsend to Olympia, and north to Anacortes and Point Roberts we motored all over Puget Sound capturing photos and video of the racers.\nMy prep work began months earlier by studying maps, reading forum posts on race strategy, learning more about the tides of the area, and deconstructing some of my favorite adventure photos. I wanted a shot-list of great photo potentials, locations, and subjects so I’d be ready if an opportunity presented itself.\n\n**Gear:**\nI chose my gear based on what I expected to photograph, but not having covered this race before it was unclear. That said, the 14 - 200 range covered everything I wanted to shoot easily. \n“Holy Trinity” F-mount: 14-24/2.8, 24-70/2.8, 70-200/2.8\nPrime: Nikkon F 24/1.4 (night/dusk photos)\nOther: Nikkor Z 24-70/4 S, 1.4TC, Peak Design Tripod\n\n**Primary camera and lens combo:**\nNikon D850 with battery grip\nNikon 70-200/2.8 with 1.4TC\n\n**Secondary camera and lens combo:**\nNikon Z6 with 24-70/4 S\n\nI had the “holy trinity” plus the 24/1.4 and the Nikon FTZ adapter in a pelican case that stayed with me. While embedding on a boat I typically shot with the 14-24/2.8 and had the 24-70 in a dry bag if I needed a little more reach. The 24/1.4 I used during a camping sequence on my Z6, it’s a bit easier to shoot challenging lighting scenarios with a mirrorless camera, and I wanted all the light I could get.\n\nMy D850 was typically bluetooth-connected to Snapbridge for GPS-tagging of images.\nA typical day was to wake up, drink some coffee with breakfast and then set a course for wherever we thought the racers may end up. Our mothership was a 50’ motor cruiser, and we used a combination of a 30’ power cat, RHIBs and volunteer small boats to chase down the racers for photos. After shooting a series of images or a cluster of racers, I’d download to my laptop via Photo Mechanic and add metadata like location, keywords, and ratings. After quickly rating and choosing my selects, I’d do some quick editing in Lightroom then upload a down-res’d copy to a shared drive over my cellular connection. Some days I did this multiple times a day, and other days only once or twice depending on the days activity.\n\nHappy to answer any questions about kit selection, keeping your gear dry, working 12-hour days, or lessons learned.", "link": "https://www.reddit.com/r/Nikon/comments/oyog52/postadventure_race_recap_seventy48_wa360_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "post-adventure race recap: seventy48 &amp; wa360 with d850 and z6 /!/ **overview**\nphoto selects: https://adobe.ly/2tuv4t0\nfrom june 4th to the 13th of 2021, i worked for the northwest maritime center’s media team in port townsend, washington for their seventy48 and washington 360 adventure boat races. we lived and worked on everything from small 8-foot rhibs (rigid hull inflatable boat) to 50-foot motor cruisers. from port townsend to olympia, and north to anacortes and point roberts we motored all over puget sound capturing photos and video of the racers.\nmy prep work began months earlier by studying maps, reading forum posts on race strategy, learning more about the tides of the area, and deconstructing some of my favorite adventure photos. i wanted a shot-list of great photo potentials, locations, and subjects so i’d be ready if an opportunity presented itself.\n\n**gear:**\ni chose my gear based on what i expected to photograph, but not having covered this race before it was unclear. that said, the 14 - 200 range covered everything i wanted to shoot easily. \n“holy trinity” f-mount: 14-24/2.8, 24-70/2.8, 70-200/2.8\nprime: nikkon f 24/1.4 (night/dusk photos)\nother: nikkor z 24-70/4 s, 1.4tc, peak design tripod\n\n**primary camera and lens combo:**\nnikon d850 with battery grip\nnikon 70-200/2.8 with 1.4tc\n\n**secondary camera and lens combo:**\nnikon z6 with 24-70/4 s\n\ni had the “holy trinity” plus the 24/1.4 and the nikon ftz adapter in a pelican case that stayed with me. while embedding on a boat i typically shot with the 14-24/2.8 and had the 24-70 in a dry bag if i needed a little more reach. the 24/1.4 i used during a camping sequence on my z6, it’s a bit easier to shoot challenging lighting scenarios with a mirrorless camera, and i wanted all the light i could get.\n\nmy d850 was typically bluetooth-connected to snapbridge for gps------> tagging !!!  of images.\na typical day was to wake up, drink some coffee with breakfast and then set a course for wherever we thought the racers may end up. our mothership was a 50’ motor cruiser, and we used a combination of a 30’ power cat, rhibs and volunteer small boats to chase down the racers for photos. after shooting a series of images or a cluster of racers, i’d download to my laptop via photo mechanic and add metadata like location, keywords, and ratings. after quickly rating and choosing my selects, i’d do some quick editing in lightroom then upload a down-res’d copy to a shared drive over my cellular connection. some days i did this multiple times a day, and other days only once or twice depending on the days activity.\n\nhappy to answer any questions about kit selection, keeping your gear dry, working 12-hour days, or lessons learned.", "sortedWord": "None", "identifyer": 51099, "year": "2021"}], "name": "taggingnikon2021"}