{"interestingcomments": [{"Unnamed: 0": 24349, "autor": "hechoentx1", "date": 1598018411000, "content": "Z5/Z6 now or holiday season? /!/ Hello everyone!\nI was looking at either getting a z5 or z6 (I’m not a professional, but would like a newer nice full frame for family events and travel). Currently Walmart is offering the z6 (body only) for $1,544. Would you say it’s worth making the investment now or holding off till the holiday season? I’m unsure if the deals will be better then. Any advice would be helpful. \n\nAlso, like I said I’m considering the z5 or z6. Any advice (again I’m not a professional) but I know they aren’t far in price tag. So is the leap from a z5 to the z6 worth it in value terms?", "link": "https://www.reddit.com/r/Nikon/comments/idx8ry/z5z6_now_or_holiday_season/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "z5/z6 now or holiday season? /!/ hello everyone!\ni was looking at either getting a z5 or z6 (i’m not a professional, but would like a newer nice full frame for family events and travel). currently walmart is offering the z6 (body only) for $1,544. would you say it’s worth making the investment now or holding off till the holiday season? i’m unsure if the deals will be better then. any advice would be helpful. \n\nalso, like i said i’m considering the z5 or z6. any advice (again i’m not a professional) but i know they aren’t far in price -----> tag !!! . so is the leap from a z5 to the z6 worth it in value terms?", "sortedWord": "None", "identifyer": 24765, "year": "2020"}, {"Unnamed: 0": 24494, "autor": "77tornado77", "date": 1583364701000, "content": "Nikon Z6 or D780 /!/ I'm planning on buying my first full-frame camera, but I can't deside whether I should buy Z6 or D780. (Currently, I have Nikon D5600, which is a crop-sensor camera)\n\nZ6 and D780 are both very similar, but the Z6 seems to have some advantages over the D780. Z6 has an electronic view finder (which is pretty cool in my opinion) and it also has built-in image stabiliastion, which could come in handy. It's also a bit lighter and it can use z-type lenses. I've also heard that mirrorless cameras will take over the DLSR's in the future.\n\nHowever, there are some issues with the Z6. First of all, Z6 has only one memory card space and it's for a XQD card. This means, that not only would I have to buy a XQD card, but also a card reader for it. This would easily cost around 300€, and it would make my sd cards useless. Secondly, I've heard that the FTZ adapter (allowing me to use my f-lenses on the z-type body) can cause some problems when focusing. I'm also worried about the z6 battery duration, since you can only take around 300 photos with one fully charged battery. (I'm not quite sure if this is true, since I've got a lot of mixed information) This would mean, that I would have to buy 1-2 extra batteries, ranking up the price tag an additional 100-200€. With the same price, I could buy myself a D780, which would probably be a lot closer to a D5600. So the question is - is the Z6 worth all the hassle or should I go with the D780?\n\nI'm mainly doing street/nature photography, but I also like to film videos. Recently, I've also been interested in wildlife and portrait photography.", "link": "https://www.reddit.com/r/Nikon/comments/fdlylz/nikon_z6_or_d780/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "nikon z6 or d780 /!/ i'm planning on buying my first full-frame camera, but i can't deside whether i should buy z6 or d780. (currently, i have nikon d5600, which is a crop-sensor camera)\n\nz6 and d780 are both very similar, but the z6 seems to have some advantages over the d780. z6 has an electronic view finder (which is pretty cool in my opinion) and it also has built-in image stabiliastion, which could come in handy. it's also a bit lighter and it can use z-type lenses. i've also heard that mirrorless cameras will take over the dlsr's in the future.\n\nhowever, there are some issues with the z6. first of all, z6 has only one memory card space and it's for a xqd card. this means, that not only would i have to buy a xqd card, but also a card reader for it. this would easily cost around 300€, and it would make my sd cards useless. secondly, i've heard that the ftz adapter (allowing me to use my f-lenses on the z-type body) can cause some problems when focusing. i'm also worried about the z6 battery duration, since you can only take around 300 photos with one fully charged battery. (i'm not quite sure if this is true, since i've got a lot of mixed information) this would mean, that i would have to buy 1-2 extra batteries, ranking up the price -----> tag !!!  an additional 100-200€. with the same price, i could buy myself a d780, which would probably be a lot closer to a d5600. so the question is - is the z6 worth all the hassle or should i go with the d780?\n\ni'm mainly doing street/nature photography, but i also like to film videos. recently, i've also been interested in wildlife and portrait photography.", "sortedWord": "None", "identifyer": 24912, "year": "2020"}, {"Unnamed: 0": 25408, "autor": "Julio-C-Castro", "date": 1592325508000, "content": "Field testing of 85mm f/1.8 S lens /!/ Some of you know I do zoo photography as my main hobby. The performance of the 85mm on the Z50 was outstanding. My testing grounds was a the San Diego Zoo yesterday for donors. Yes you can’t really use it at f/1.8 if your subject is high up during a sunny day or light is bouncing off subjects like water. But most of my subjects were easy to photograph due to shade available for them and not being beaten down with sunlight. All of my shots were at f/1.8. The best subjects that have clear definitions of their colors and forms were birds and reptiles, some mammals were exceptions. The aperture was perfect for indoor habitats such as reptile houses that tend to have poor lighting. The focal length was good for most of the time. The lens hood was a must to help reduce the amount of light coming in and avoid damaging lens against barriers. Yes it’s a hefty price tag but the photos I’ve taken have me satisfied. Since the Z50 has no IBIS, I would shoot at higher speeds which was consequence of the amount of light coming in due to the aperture and wasn’t a deal break for me. If you want to get amazing photos of animals or people but also need a bit of reach as to not be in their space, this lens is a must for you. Will be uploading over the next 2 weeks photos only taken with the 85mm f/1.8 S len. Especially any zoo nerds who had issues with low light in indoor spaces and want to extract the true colors of your animal subjects, this lens is the bee’s knees.", "link": "https://www.reddit.com/r/Nikon/comments/ha7i0k/field_testing_of_85mm_f18_s_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "field testing of 85mm f/1.8 s lens /!/ some of you know i do zoo photography as my main hobby. the performance of the 85mm on the z50 was outstanding. my testing grounds was a the san diego zoo yesterday for donors. yes you can’t really use it at f/1.8 if your subject is high up during a sunny day or light is bouncing off subjects like water. but most of my subjects were easy to photograph due to shade available for them and not being beaten down with sunlight. all of my shots were at f/1.8. the best subjects that have clear definitions of their colors and forms were birds and reptiles, some mammals were exceptions. the aperture was perfect for indoor habitats such as reptile houses that tend to have poor lighting. the focal length was good for most of the time. the lens hood was a must to help reduce the amount of light coming in and avoid damaging lens against barriers. yes it’s a hefty price -----> tag !!!  but the photos i’ve taken have me satisfied. since the z50 has no ibis, i would shoot at higher speeds which was consequence of the amount of light coming in due to the aperture and wasn’t a deal break for me. if you want to get amazing photos of animals or people but also need a bit of reach as to not be in their space, this lens is a must for you. will be uploading over the next 2 weeks photos only taken with the 85mm f/1.8 s len. especially any zoo nerds who had issues with low light in indoor spaces and want to extract the true colors of your animal subjects, this lens is the bee’s knees.", "sortedWord": "None", "identifyer": 25850, "year": "2020"}, {"Unnamed: 0": 25899, "autor": "TitaniumX2", "date": 1587787191000, "content": "Is this true? /!/ Two months ago when I was at Best Buy in the camera department, an employee with the “Nikon Expert” on his name tag told me that Nikon, Canon, Fujifilm, and Apple buy image sensors from Sony to use in their cameras (and the Apple iPhone).\n\nHe even said that Sony also manufactures camera lens for Nikon and Canon also. And they just rebranded it to their name.\n\nI am wondering if what he said is true?", "link": "https://www.reddit.com/r/Nikon/comments/g7n2sw/is_this_true/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is this true? /!/ two months ago when i was at best buy in the camera department, an employee with the “nikon expert” on his name -----> tag !!!  told me that nikon, canon, fujifilm, and apple buy image sensors from sony to use in their cameras (and the apple iphone).\n\nhe even said that sony also manufactures camera lens for nikon and canon also. and they just rebranded it to their name.\n\ni am wondering if what he said is true?", "sortedWord": "None", "identifyer": 26353, "year": "2020"}, {"Unnamed: 0": 28783, "autor": "piggiesonwheels", "date": 1588871673000, "content": "One of my dads photos. Taken early 70’s on whatever Nikon he had at the time. Yes, that’s The Duke riding a tank through Harvard...He passed in 2014 and left a literal room full of Nikon cameras and lenses. He was well known in the Nikon community with a tag of “Microbee” if any of you knew him.", "link": "https://www.reddit.com/r/Nikon/comments/gfaprf/one_of_my_dads_photos_taken_early_70s_on_whatever/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "one of my dads photos. taken early 70’s on whatever nikon he had at the time. yes, that’s the duke riding a tank through harvard...he passed in 2014 and left a literal room full of nikon cameras and lenses. he was well known in the nikon community with a -----> tag !!!  of “microbee” if any of you knew him.", "sortedWord": "None", "identifyer": 29342, "year": "2020"}, {"Unnamed: 0": 30575, "autor": "Wild_Ribbon", "date": 1606847444000, "content": "D7500 or D500? /!/ I'm in the middle of my struggle to decide for a new camera... I'll try to lay the background, point what matters to me, and what I think might influence, and hope you guys can contribute with some experienced opinions.\n\nI currently have a D5100 for 6 years now, shooting with the kit 18-55, and also got the amazing 35mm 1.8, 70-200mm and a few days ago the Sigma 17-50mm 2.8 (which is front focusing, another reason for a better body) as a \"kit lens upgrade\". Most of my pics are during vacations, so mostly city scape, street, landscape, portrait, but I also squeeze some macro, night, nature and wildlife (if I can find some bird). I mostly shoot AP mode, shutter or manual if needed. No sports, zero interest in video. I shoot for fun, and don't ever expect to turn a picture into money. As you can see, I'm probably on the budget category.\n\nSo, I saw the D7500 as a sweet upgrade, pretty much in every single aspect from my current body, but then I also saw the D500. It's a 60% price hike, but it got a nice bump in quality that might matter to me.\n\nD500: more and far reaching focus points, that gotta help, I think (153 vs 53, mine is 11 now), better ISO (by a stop), viewfinder, and apparently better color depth, autofocus, auto WB. Kenrockwell points out at bad/inconsistent auto exposure compared to the D7500. Dual card, battery grip, old lens support, none of this sounds interesting me. Other things I simply have no idea how useful are, like depth-of-field preview button.\n\nD7500: lighter, same processor/sensor as D500, much cheaper, built in flash (good to have sometimes, I got a larger flash clone that I can resort to).\n\nAlso one thing that probably is taking an unreasonable weight in my decision (or maybe not) is my apparent feeling of worse user interface experience for the D500. Customized modes sound interesting, the D7500 U1/U2 are simple enough and persistent, yet the D500 use the controversial shooting banks, with their non-sticky settings approach, which sound like a PITA to get working right, and not screw up over time. I feel U1/U2 might be just enough for me to get more use of features that I admit I never took the time to properly explore, like picture control, active D-lighting, etc... most of my settings revolve around aperture, shutter, ISO and exposure bracketing (lazy solution for getting the exposure right in JPG).\n\nSide note: I considered some FX cameras, but having my little set of lenses, considering higher price tags and increased weight, DX sounds like a safe harbor.\n\nAny bit of advice and knowledge is welcome.", "link": "https://www.reddit.com/r/Nikon/comments/k4qu0k/d7500_or_d500/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "d7500 or d500? /!/ i'm in the middle of my struggle to decide for a new camera... i'll try to lay the background, point what matters to me, and what i think might influence, and hope you guys can contribute with some experienced opinions.\n\ni currently have a d5100 for 6 years now, shooting with the kit 18-55, and also got the amazing 35mm 1.8, 70-200mm and a few days ago the sigma 17-50mm 2.8 (which is front focusing, another reason for a better body) as a \"kit lens upgrade\". most of my pics are during vacations, so mostly city scape, street, landscape, portrait, but i also squeeze some macro, night, nature and wildlife (if i can find some bird). i mostly shoot ap mode, shutter or manual if needed. no sports, zero interest in video. i shoot for fun, and don't ever expect to turn a picture into money. as you can see, i'm probably on the budget category.\n\nso, i saw the d7500 as a sweet upgrade, pretty much in every single aspect from my current body, but then i also saw the d500. it's a 60% price hike, but it got a nice bump in quality that might matter to me.\n\nd500: more and far reaching focus points, that gotta help, i think (153 vs 53, mine is 11 now), better iso (by a stop), viewfinder, and apparently better color depth, autofocus, auto wb. kenrockwell points out at bad/inconsistent auto exposure compared to the d7500. dual card, battery grip, old lens support, none of this sounds interesting me. other things i simply have no idea how useful are, like depth-of-field preview button.\n\nd7500: lighter, same processor/sensor as d500, much cheaper, built in flash (good to have sometimes, i got a larger flash clone that i can resort to).\n\nalso one thing that probably is taking an unreasonable weight in my decision (or maybe not) is my apparent feeling of worse user interface experience for the d500. customized modes sound interesting, the d7500 u1/u2 are simple enough and persistent, yet the d500 use the controversial shooting banks, with their non-sticky settings approach, which sound like a pita to get working right, and not screw up over time. i feel u1/u2 might be just enough for me to get more use of features that i admit i never took the time to properly explore, like picture control, active d-lighting, etc... most of my settings revolve around aperture, shutter, iso and exposure bracketing (lazy solution for getting the exposure right in jpg).\n\nside note: i considered some fx cameras, but having my little set of lenses, considering higher price -----> tags !!!  and increased weight, dx sounds like a safe harbor.\n\nany bit of advice and knowledge is welcome.", "sortedWord": "None", "identifyer": 31208, "year": "2020"}], "name": "tagnikon2020"}