{"interestingcomments": [{"Unnamed: 0": 155382, "autor": "Carjascaps", "date": 1622488529000, "content": "Planning to use Sigma 18-35mm lens via ftz while saving for the Full-frame Z6ii and native Z lenses. Thoughts and advices? /!/ I'm planning on upgrading my D3100 to Nikon Z system but the overall cost of the Z6ii is a deal-breaker (cards, Z FF lenses, etc.) and in my country the high price-tag for the Z5 is IMO still very high for the value ($1900 for the body alone, and yes Z lenses)  so I'm sticking to the Z50 first with 2 lens kit and an ftz and add sigma 18-35mm. any advice on this?   \n\n\nThings I considered:\n\n* i'm okay with the weight of sigma lenses  \n\n* I'm also considering the 50-100mm f/1.8  \n\n* Mostly for events, portraits, and landscape and I love shooting at night", "link": "https://www.reddit.com/r/Nikon/comments/npazz2/planning_to_use_sigma_1835mm_lens_via_ftz_while/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "planning to use sigma 18-35mm lens via ftz while saving for the full-frame z6ii and native z lenses. thoughts and advices? /!/ i'm planning on upgrading my d3100 to nikon z system but the overall cost of the z6ii is a deal-breaker (cards, z ff lenses, etc.) and in my country the high price------> tag !!!  for the z5 is imo still very high for the value ($1900 for the body alone, and yes z lenses)  so i'm sticking to the z50 first with 2 lens kit and an ftz and add sigma 18-35mm. any advice on this?   \n\n\nthings i considered:\n\n* i'm okay with the weight of sigma lenses  \n\n* i'm also considering the 50-100mm f/1.8  \n\n* mostly for events, portraits, and landscape and i love shooting at night", "sortedWord": "None", "identifyer": 46862, "year": "2021"}, {"Unnamed: 0": 155975, "autor": "-Toshi", "date": 1626287407000, "content": "Any one had experience with the Fringer EF to Z Mount Adapter? Is it worth the £350 price tag? /!/ I don't own any EF lenses. I am however looking into getting a Black Magic 6k in the future, and they take EF lenses. So, if I get one of these adapters I can get some glass that'll work on the Z6 as well.\n\nThoughts?\n\n I've read it'll maintain AF, but there's a catch right?", "link": "https://www.reddit.com/r/Nikon/comments/okahrf/any_one_had_experience_with_the_fringer_ef_to_z/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "any one had experience with the fringer ef to z mount adapter? is it worth the £350 price -----> tag !!! ? /!/ i don't own any ef lenses. i am however looking into getting a black magic 6k in the future, and they take ef lenses. so, if i get one of these adapters i can get some glass that'll work on the z6 as well.\n\nthoughts?\n\n i've read it'll maintain af, but there's a catch right?", "sortedWord": "None", "identifyer": 47480, "year": "2021"}, {"Unnamed: 0": 157207, "autor": "tragically_", "date": 1621066417000, "content": "whats the deal with the crazy d780 price? /!/ do they not want to sell them?\n\nI was looking to get 2 new cameras for video and some stills but keep my d3s d4s for stills mainly. \n\nno, not planning on going mirrorless anytime soon. I just dont see the benefits. the small bodies are problematic. the left side of the camera isnt the problem. the right side being so thin, very much is. \n\nthat $2300 price tag is crazy for a d780 with no grip support.", "link": "https://www.reddit.com/r/Nikon/comments/nctuao/whats_the_deal_with_the_crazy_d780_price/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "whats the deal with the crazy d780 price? /!/ do they not want to sell them?\n\ni was looking to get 2 new cameras for video and some stills but keep my d3s d4s for stills mainly. \n\nno, not planning on going mirrorless anytime soon. i just dont see the benefits. the small bodies are problematic. the left side of the camera isnt the problem. the right side being so thin, very much is. \n\nthat $2300 price -----> tag !!!  is crazy for a d780 with no grip support.", "sortedWord": "None", "identifyer": 48750, "year": "2021"}, {"Unnamed: 0": 157482, "autor": "Cokes3", "date": 1612900110000, "content": "Looking to take the plunge and buy a second body /!/ Looking at buying a second camera body. Currently have the D750 and love it, but rent a second body each time I shoot a wedding for someone and the rentals start to add up. On a daily basis I use a D5 at work and love it and have on multiple occasions thought about buying one for personal use. It’s a big price tag as we all know. When I rent, I rent a D5 because I use it often. Thinking about looking at the D5 or D6 (a lot of camera stores have the D5 listed as unavailable or on backorder. Wondering if it’s starting to get phased out for the D6 since they are the same price practically) I know the D5 is a monster of a camera and there’s plenty of options which is why I’m here. I could invest in the D5 or D6 or look towards a D850 or something else and get a lens as well. What are your favorite bodies? Not really leaning towards mirrorless yet but I will definitely be open minded to any suggestions.", "link": "https://www.reddit.com/r/Nikon/comments/lgbpkn/looking_to_take_the_plunge_and_buy_a_second_body/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking to take the plunge and buy a second body /!/ looking at buying a second camera body. currently have the d750 and love it, but rent a second body each time i shoot a wedding for someone and the rentals start to add up. on a daily basis i use a d5 at work and love it and have on multiple occasions thought about buying one for personal use. it’s a big price -----> tag !!!  as we all know. when i rent, i rent a d5 because i use it often. thinking about looking at the d5 or d6 (a lot of camera stores have the d5 listed as unavailable or on backorder. wondering if it’s starting to get phased out for the d6 since they are the same price practically) i know the d5 is a monster of a camera and there’s plenty of options which is why i’m here. i could invest in the d5 or d6 or look towards a d850 or something else and get a lens as well. what are your favorite bodies? not really leaning towards mirrorless yet but i will definitely be open minded to any suggestions.", "sortedWord": "None", "identifyer": 49036, "year": "2021"}, {"Unnamed: 0": 158473, "autor": "spamrundie", "date": 1624225208000, "content": "How to display pictures from my PC to my D3500? /!/ Yes, this is weird.\n\nBut I want to succeed in being able to view images that weren't shot on my camera, on my camera (Nikon D3500).\n\nSo far I've managed to copy all the metadata from pictures I took onto a random image online (using ExifToolGUI), but I found that some tags are unwritable, so my camera won't display it.\n\nHas anyone here succeded in doing this (video or pic), and is there a way to edit tags that are not editable?", "link": "https://www.reddit.com/r/Nikon/comments/o4fs55/how_to_display_pictures_from_my_pc_to_my_d3500/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "how to display pictures from my pc to my d3500? /!/ yes, this is weird.\n\nbut i want to succeed in being able to view images that weren't shot on my camera, on my camera (nikon d3500).\n\nso far i've managed to copy all the metadata from pictures i took onto a random image online (using exiftoolgui), but i found that some -----> tags !!!  are unwritable, so my camera won't display it.\n\nhas anyone here succeded in doing this (video or pic), and is there a way to edit tags that are not editable?", "sortedWord": "None", "identifyer": 50081, "year": "2021"}], "name": "tagnikon2021"}