{"interestingcomments": [{"Unnamed: 0": 1269, "autor": "skimmilk5", "date": 1547589962000, "content": "Looking for a new body or lens? /!/ Here's some tips and info that will help the very helpful Nikon community give you good recommendations.\n\n* **Remember that everyone shares their opinion**. Some people have had wonderful experiences with a piece of equipment, and others have had less wonderful experiences.\n* **DO YOUR RESEARCH!** I can't emphasize this enough. Understand the difference between DX (APS-C) and FX (35mm). Understand WHY you need a FX body or why you don't. Understand what an AA filter is. Understand what digital noise is. Understand what AF-S vs AF-P is. Understand what f-stops are. If you see something on a spec sheet that you don't know about, look it up. It's called Google. In the end, we're not buying the equipment: you are. You should know what you're buying, rather than blindly buying whatever we tell you to buy.\n* **Use your question as a reference, not a magic bullet**. We'll make recommendations based on what we think you need. You should always confer with other reviews, double check spec sheets, and fact check what we say. We're people, and sometimes we get stuff wrong, too.\n* **Equipment isn't magical**. Equipment won't make you any better of a photographer. It's a tool, and you need to know how to use it.\n* **Remember that equipment has a price tag**, and that there's just no way that you can get a camera with 12FPS drive with 45 MP resolution that has a buffer of 200 images for $500. Likewise, you shouldn't overpay (this goes back to doing your research). Do a cost-benefit analysis. If that extra 3 FPS is really worth $400, then of course, you should spend that money. If it's not, then take that money and spend it elsewhere that matters. If you really need all of those features, then prepare to cough up the dough to match. If you don't, then don't spend the money for that stuff.\n* **What's your price range?** The more specific the range, the better.\n* **What do you plan on doing with it?** Do you want to convert it to infrared? Do you want to do sports or landscapes? Or both? Let us know so we can match you with the best gear for you.\n* **What's your skill level?** Are you a semipro or a total beginner? Rank your skill level on a scale from 1 to 10. It'll help others decide what's a good body or lens for your skill level.\n* **What equipment are you coming from, if any?** Do you need to match it with anything (i.e. a body with a lens or a lens with a body)?\n* **Beware the marketing BS!** If you see something in a marketing overview that smells fishy, ask us! Some of us have pretty good BS detectors.\n\nI said it before, and I'll say it again. **We're not buying the equipment: you are.** Do your due diligence, and if someone says something that you're not sure about, feel free to ask them about why they chose that particular item!", "link": "https://www.reddit.com/r/Nikon/comments/agdy76/looking_for_a_new_body_or_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for a new body or lens? /!/ here's some tips and info that will help the very helpful nikon community give you good recommendations.\n\n* **remember that everyone shares their opinion**. some people have had wonderful experiences with a piece of equipment, and others have had less wonderful experiences.\n* **do your research!** i can't emphasize this enough. understand the difference between dx (aps-c) and fx (35mm). understand why you need a fx body or why you don't. understand what an aa filter is. understand what digital noise is. understand what af-s vs af-p is. understand what f-stops are. if you see something on a spec sheet that you don't know about, look it up. it's called google. in the end, we're not buying the equipment: you are. you should know what you're buying, rather than blindly buying whatever we tell you to buy.\n* **use your question as a reference, not a magic bullet**. we'll make recommendations based on what we think you need. you should always confer with other reviews, double check spec sheets, and fact check what we say. we're people, and sometimes we get stuff wrong, too.\n* **equipment isn't magical**. equipment won't make you any better of a photographer. it's a tool, and you need to know how to use it.\n* **remember that equipment has a price -----> tag !!! **, and that there's just no way that you can get a camera with 12fps drive with 45 mp resolution that has a buffer of 200 images for $500. likewise, you shouldn't overpay (this goes back to doing your research). do a cost-benefit analysis. if that extra 3 fps is really worth $400, then of course, you should spend that money. if it's not, then take that money and spend it elsewhere that matters. if you really need all of those features, then prepare to cough up the dough to match. if you don't, then don't spend the money for that stuff.\n* **what's your price range?** the more specific the range, the better.\n* **what do you plan on doing with it?** do you want to convert it to infrared? do you want to do sports or landscapes? or both? let us know so we can match you with the best gear for you.\n* **what's your skill level?** are you a semipro or a total beginner? rank your skill level on a scale from 1 to 10. it'll help others decide what's a good body or lens for your skill level.\n* **what equipment are you coming from, if any?** do you need to match it with anything (i.e. a body with a lens or a lens with a body)?\n* **beware the marketing bs!** if you see something in a marketing overview that smells fishy, ask us! some of us have pretty good bs detectors.\n\ni said it before, and i'll say it again. **we're not buying the equipment: you are.** do your due diligence, and if someone says something that you're not sure about, feel free to ask them about why they chose that particular item!", "sortedWord": "None", "identifyer": 1280, "year": "2019"}, {"Unnamed: 0": 1473, "autor": "thegoatwrote", "date": 1549631720000, "content": "Question about DIY minor repair on Nikon 105mm Micro f/2.8 AF Lens /!/ I have a Nikon 105mm f/2.8 AF MICRO-NIKKOR lens, and I bought it used with broken autofocus. It takes beautiful photos, but in addition to the lack of AF, the lens doesn't tell the body what its focal length is, so I have to set and use the non-CPU lens settings to get the EXIF tags populated and what not. Also, sadly, once in a while, I can't set the aperture using the body's wheel, and I have to un-mount/re-mount the lens to get it to work on any other f-stop. The LCD just displays f/13 or whatever I had it set on last and will not change when I spin the wheel. So the electronics in the lens are fried. But in months of ownership and fairly frequent use, that's only happened twice, and it's pretty easily \"fixed\". I got the lens pretty cheap and really only use it for macro, so I don't have a _big_ problem with this.\n\nI'm pretty sure I can pop the dandelion off the lens, cut and/or file any bits of conductor I see left sticking out from the lens body and attach one of the inexpensive \"dandelion chips\" off of eBay for $25 or so and have this fixed, or at least working as a MF lens that identifies itself to the body. Has anyone done anything like this, or know if this will work? Is there anything I need to watch out for?\n\nThanks.", "link": "https://www.reddit.com/r/Nikon/comments/aogenc/question_about_diy_minor_repair_on_nikon_105mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "question about diy minor repair on nikon 105mm micro f/2.8 af lens /!/ i have a nikon 105mm f/2.8 af micro-nikkor lens, and i bought it used with broken autofocus. it takes beautiful photos, but in addition to the lack of af, the lens doesn't tell the body what its focal length is, so i have to set and use the non-cpu lens settings to get the exif -----> tags !!!  populated and what not. also, sadly, once in a while, i can't set the aperture using the body's wheel, and i have to un-mount/re-mount the lens to get it to work on any other f-stop. the lcd just displays f/13 or whatever i had it set on last and will not change when i spin the wheel. so the electronics in the lens are fried. but in months of ownership and fairly frequent use, that's only happened twice, and it's pretty easily \"fixed\". i got the lens pretty cheap and really only use it for macro, so i don't have a _big_ problem with this.\n\ni'm pretty sure i can pop the dandelion off the lens, cut and/or file any bits of conductor i see left sticking out from the lens body and attach one of the inexpensive \"dandelion chips\" off of ebay for $25 or so and have this fixed, or at least working as a mf lens that identifies itself to the body. has anyone done anything like this, or know if this will work? is there anything i need to watch out for?\n\nthanks.", "sortedWord": "None", "identifyer": 1484, "year": "2019"}, {"Unnamed: 0": 107508, "autor": "shutsubishi", "date": 1564335363000, "content": "How are people using SnapBridge on the Z cameras? /!/ On my D750 and WMU, I could tag pictures as \"send to device\" on the camera, pair up to my phone whenever, and download them all with a single click.\n\nOn my Z6, the process is a lot dumber.  Seems like that option is ignored, and the only way to batch download is to pair up, then select tiny, low res thumbnails you cannot zoom into, then select download.\n\nOh, and the \"send to device\" is grayed out if you're not paired up.  Seems completely braindead to me but what do I know. (yeah, I'm a bit annoyed with this nonsense)\n\nSo how are folks using this?  Downloading all pictures?", "link": "https://www.reddit.com/r/Nikon/comments/ciyqkt/how_are_people_using_snapbridge_on_the_z_cameras/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how are people using snapbridge on the z cameras? /!/ on my d750 and wmu, i could -----> tag !!!  pictures as \"send to device\" on the camera, pair up to my phone whenever, and download them all with a single click.\n\non my z6, the process is a lot dumber.  seems like that option is ignored, and the only way to batch download is to pair up, then select tiny, low res thumbnails you cannot zoom into, then select download.\n\noh, and the \"send to device\" is grayed out if you're not paired up.  seems completely braindead to me but what do i know. (yeah, i'm a bit annoyed with this nonsense)\n\nso how are folks using this?  downloading all pictures?", "sortedWord": "None", "identifyer": 10405, "year": "2019"}, {"Unnamed: 0": 108014, "autor": "geekandwife", "date": 1562469567000, "content": "Changes coming to NPS - Paid NPS membership coming soon /!/ https://imgur.com/a/cjfwGzm\n\nSo just got an update packet from NPS.  Looks like a few changes are in the works, including a new paid NPS priority level/teir.  They also included a nice metal NPS tag in the package, not a bad freebie..  But it looks like now each region of the USA has its own specific NPS contact.  Luckily for me, the one for my region is just down the road from me.  \n\nFigured I would share for anyone considering applying for NPS membership...", "link": "https://www.reddit.com/r/Nikon/comments/ca2co5/changes_coming_to_nps_paid_nps_membership_coming/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "changes coming to nps - paid nps membership coming soon /!/ https://imgur.com/a/cjfwgzm\n\nso just got an update packet from nps.  looks like a few changes are in the works, including a new paid nps priority level/teir.  they also included a nice metal nps -----> tag !!!  in the package, not a bad freebie..  but it looks like now each region of the usa has its own specific nps contact.  luckily for me, the one for my region is just down the road from me.  \n\nfigured i would share for anyone considering applying for nps membership...", "sortedWord": "None", "identifyer": 10918, "year": "2019"}, {"Unnamed: 0": 109167, "autor": "Lamplighter22", "date": 1563886727000, "content": "How well do lenses on the adapter for the z6 work? /!/ Trying to avoid the crazy price tag of the z series lenses and it seems like getting lenses and putting them on with the adapter seems to be the best option. Anyone who’s used them how well do Nikon brand lenses work on the Z6 and is it worth even trying to go for like a Tamron or sigma lens with the adapter?", "link": "https://www.reddit.com/r/Nikon/comments/cgsacz/how_well_do_lenses_on_the_adapter_for_the_z6_work/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how well do lenses on the adapter for the z6 work? /!/ trying to avoid the crazy price -----> tag !!!  of the z series lenses and it seems like getting lenses and putting them on with the adapter seems to be the best option. anyone who’s used them how well do nikon brand lenses work on the z6 and is it worth even trying to go for like a tamron or sigma lens with the adapter?", "sortedWord": "None", "identifyer": 12089, "year": "2019"}, {"Unnamed: 0": 109262, "autor": "ShaneWookie", "date": 1569859620000, "content": "Tagged/locked photos + Windows Explorer question /!/ So I usually don't care about needing immediate access to the photos I lock in camera, I just open it all in Photo Mechanic at the end of the day and go about my business. Lately though a lot of clients, especially with sports where cards are being run back and forth, are asking for immediate selections. I never thought about this until last night, but is there a way in Windows to make those locked/tagged photos show up in explorer so I can pull those rather than import the whole card?  \n\n\nI know Canon has a rating system and you can get those to appear in Windows and, as I discovered last night, Apple put a little bubble next to the locked images. Is there anything Windows does that I'm missing, or is this a lost cause?", "link": "https://www.reddit.com/r/Nikon/comments/dbdsj1/taggedlocked_photos_windows_explorer_question/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "-----> tagged !!! /locked photos + windows explorer question /!/ so i usually don't care about needing immediate access to the photos i lock in camera, i just open it all in photo mechanic at the end of the day and go about my business. lately though a lot of clients, especially with sports where cards are being run back and forth, are asking for immediate selections. i never thought about this until last night, but is there a way in windows to make those locked/tagged photos show up in explorer so i can pull those rather than import the whole card?  \n\n\ni know canon has a rating system and you can get those to appear in windows and, as i discovered last night, apple put a little bubble next to the locked images. is there anything windows does that i'm missing, or is this a lost cause?", "sortedWord": "None", "identifyer": 12187, "year": "2019"}], "name": "tagnikon2019"}