{"interestingcomments": [{"autor": "DarkRulerJho", "date": "2019-01-14 23:53:27", "content": "Has anyone converted their P1000 to Full Spectrum? /!/ In the P900 all I had to do was remove the hot filter (I think it was called) to get FS. Just recently I bought a P1000 and I was wondering if anyone knew for sure if the procedure would be the same, similar or a different thing on the P1000 as it was for the P900.\n\nI've been searching online but it came up with little to no info. on the subject and ended up redirecting me into P900 FS tutorials.", "link": "https://www.reddit.com/r/Nikon/comments/ag251e/has_anyone_converted_their_p1000_to_full_spectrum/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "has anyone converted their p1000 to full spectrum? /!/ in the p900 all i had to do was remove the hot filter (i think it was called) to get fs. just recently i bought a p1000 and i was wondering if anyone knew for sure if the procedure would be the same, similar or a different thing on the p1000 as it was for the p900.\n\ni've been searching online but it -----> came !!!  -----> up !!!  -----> with !!!  little to no info. on the subject and ended up redirecting me into p900 fs tutorials.", "sortedWord": "None", "Identifyer": null, "identifyer": 10644, "year": "2019"}, {"autor": "headinthered", "date": "2019-03-04 06:04:54", "content": "D750 HUD stopped working after short fall /!/ I was working a wedding last summer and my ankle collapsed and we both fell. \nIt wasn’t a major drop but it jostled it enough that the inner HUD has stopped working. So now I have no light meter,  most days not an issue but on rare occasions I forget to change my ISO... \n\nI’m terrible about shipping things out to get them fixed. I even have a backup camera (d700) ... searching google didn’t really come up with anything on what might have happened. \n\nAny suggestions for repair? I’m sure this isn’t gonna be a cheap fix if I damaged to computer inside. :(\n\nBut maybe if it’s something simple I can fix it? I work on PCs, iPhones ect as a hobby but cameras I know are much more delicate.", "link": "https://www.reddit.com/r/Nikon/comments/ax3rai/d750_hud_stopped_working_after_short_fall/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "d750 hud stopped working after short fall /!/ i was working a wedding last summer and my ankle collapsed and we both fell. \nit wasn’t a major drop but it jostled it enough that the inner hud has stopped working. so now i have no light meter,  most days not an issue but on rare occasions i forget to change my iso... \n\ni’m terrible about shipping things out to get them fixed. i even have a backup camera (d700) ... searching google didn’t really -----> come !!!  -----> up !!!  -----> with !!!  anything on what might have happened. \n\nany suggestions for repair? i’m sure this isn’t gonna be a cheap fix if i damaged to computer inside. :(\n\nbut maybe if it’s something simple i can fix it? i work on pcs, iphones ect as a hobby but cameras i know are much more delicate.", "sortedWord": "None", "Identifyer": null, "identifyer": 11601, "year": "2019"}, {"autor": "clientzero", "date": "2019-03-19 19:55:08", "content": "Backyard and beyond telephoto lens recommendation? /!/ Looking for a bargain telephoto lens to pair with my D750. I have the Nikon 70-200 f4 which is great but looking for a bit more reach 400mm+. I'd love the Nikon 200-500 but haven't come up with a way to justify it to the wife yet. Any quality older (screw drive?) lenses that are a real bargain now that I should watch out for?", "link": "https://www.reddit.com/r/Nikon/comments/b3210z/backyard_and_beyond_telephoto_lens_recommendation/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "backyard and beyond telephoto lens recommendation? /!/ looking for a bargain telephoto lens to pair with my d750. i have the nikon 70-200 f4 which is great but looking for a bit more reach 400mm+. i'd love the nikon 200-500 but haven't -----> come !!!  -----> up !!!  -----> with !!!  a way to justify it to the wife yet. any quality older (screw drive?) lenses that are a real bargain now that i should watch out for?", "sortedWord": "None", "Identifyer": null, "identifyer": 12648, "year": "2019"}, {"autor": "oncetin", "date": "2019-08-07 15:07:01", "content": "Hanging around at city fair this is what I've come up with.", "link": "https://www.reddit.com/r/Nikon/comments/cn6yog/hanging_around_at_city_fair_this_is_what_ive_come/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hanging around at city fair this is what i've -----> come !!!  -----> up !!!  -----> with !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 12933, "year": "2019"}], "name": "withnikon2019"}