{"interestingcomments": [{"autor": "Terrapin72", "date": "2018-03-20 23:37:47", "content": "Older full frame vs newer crop for low light situations. *UPDATE* /!/ In my earlier post I was looking for advise about crop vs full frame for low light. I felt my sensor was to blame for less than great results but really it was operator error. There was a bunch of great advise but U/burning1rr told me about zone exposure and it just clicked, what a difference.\n\nI shot 122 pics and boiled it down to 10 and 3 are really good. I shot with my 35mm prime 1/320 f 2.2 6400 iso on a D5500. I metered for the brights and darks and came up with this. It looked good on my camera but its a bit noisey. In my excitement I didn't stop to think my settings could have been improved. I didn't need to shoot at 1/320 could have slowed it down and I could have used the full 1.8 but I was concerned about soft images and limited depth of field. \n\n[Here](https://imgur.com/a/Ef1Yw)is the unedited strait from camera images, I only rotated a few. I can't make it this Sunday but I'll be back at it the next. I've very fortunate the bar and musicians have been very accommodating and a five min from my house. Thanks everyone for the advise\n", "link": "https://www.reddit.com/r/Nikon/comments/85xk8p/older_full_frame_vs_newer_crop_for_low_light/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "older full frame vs newer crop for low light situations. *update* /!/ in my earlier post i was looking for advise about crop vs full frame for low light. i felt my sensor was to blame for less than great results but really it was operator error. there was a bunch of great advise but u/burning1rr told me about zone exposure and it just clicked, what a difference.\n\ni shot 122 pics and boiled it down to 10 and 3 are really good. i shot with my 35mm prime 1/320 f 2.2 6400 iso on a d5500. i metered for the brights and darks and -----> came !!!  -----> up !!!  -----> with !!!  this. it looked good on my camera but its a bit noisey. in my excitement i didn't stop to think my settings could have been improved. i didn't need to shoot at 1/320 could have slowed it down and i could have used the full 1.8 but i was concerned about soft images and limited depth of field. \n\n[here](https://imgur.com/a/ef1yw)is the unedited strait from camera images, i only rotated a few. i can't make it this sunday but i'll be back at it the next. i've very fortunate the bar and musicians have been very accommodating and a five min from my house. thanks everyone for the advise\n", "sortedWord": "None", "Identifyer": null, "identifyer": 45089, "year": "2018"}, {"autor": "zghaffarinik", "date": "2018-07-13 02:40:01", "content": "Problem with Nikon D800 /!/ Hi everyone,\n\nReally hoping you all can help, and ideally soon! A friend loaned me a lens to try out and possibly buy. The trouble is the settings on the camera were reset, and now the camera is taking significantly longer exposure times to come up with acceptable brightness, even at f1.8. \n\nWhen I leave it on auto-ISO, it sends it all the way to ISO6400. If I keep it at ISO100, then it requires well over a full second in a well lit room using f1.8 to gather enough light. I've tried on manual, on shutter priority, aperture priority, it just doesn't seem to matter.  \n\nCan anyone think of what may have gone wrong? I would kill to be able to get this figured out ASAP so that I can actually test this lens out while I have it on hand. ", "link": "https://www.reddit.com/r/Nikon/comments/8yg72v/problem_with_nikon_d800/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "problem with nikon d800 /!/ hi everyone,\n\nreally hoping you all can help, and ideally soon! a friend loaned me a lens to try out and possibly buy. the trouble is the settings on the camera were reset, and now the camera is taking significantly longer exposure times to -----> come !!!  -----> up !!!  -----> with !!!  acceptable brightness, even at f1.8. \n\nwhen i leave it on auto-iso, it sends it all the way to iso6400. if i keep it at iso100, then it requires well over a full second in a well lit room using f1.8 to gather enough light. i've tried on manual, on shutter priority, aperture priority, it just doesn't seem to matter.  \n\ncan anyone think of what may have gone wrong? i would kill to be able to get this figured out asap so that i can actually test this lens out while i have it on hand. ", "sortedWord": "None", "Identifyer": null, "identifyer": 45451, "year": "2018"}, {"autor": "VAN1SH1NG", "date": "2018-07-19 05:17:18", "content": "Keep or replace D3400 Kit Lenses? Would the 10-20mm be better for me? /!/ I finally purchased my first DSLR since they were so cheap during Target's recent deal allowing promo code stacking.  More specifically I've always owned point &amp; shoots, currently a Panasonic ZS20.  I wasn't really expecting to get a DSLR anytime soon so wasn't prepared and didn't have time to research.  The DSLR options were limited and I grabbed the D3400 18-55 VR + 70-300 Kit.\n\nNow having done some research I get the impression I may be better off selling the 70-300mm and buying the VR version (or more likely wait awhile to see if I even feel a strong need to own it).  It looks like there are plenty of the VR version for $160ish new on eBay and I could wait for one of the frequent eBay promo codes to get it for less.  I'm guessing I'd get at least $80-90 back selling the unused non-VR.\n\nLikely at least 80% of my shots will be landscape/nature and I also appreciate wide angle for interior shots in smaller rooms.  I'm not sure if the 18-55mm will be suitable enough or I would be a lot better off with the AF-P DX NIKKOR 10-20mm f/4.5-5.6G VR 10-20mm?  At $300 would cost me more than I paid for the entire kit though.\n\nMostly trying to come up with a plan for buying accessories.  Primarily if I'm going to buy one Nikon Circular Polarizer II Filter, if I should go ahead and get a 55mm for the 18-55mm or buy the 10-20mm which would need 72mm.  Also seems like I definitely should pickup lens hoods, nc filters, and probably rear lens caps too if I'm understanding this right.\n\nThanks!", "link": "https://www.reddit.com/r/Nikon/comments/902zlc/keep_or_replace_d3400_kit_lenses_would_the_1020mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "keep or replace d3400 kit lenses? would the 10-20mm be better for me? /!/ i finally purchased my first dslr since they were so cheap during target's recent deal allowing promo code stacking.  more specifically i've always owned point &amp; shoots, currently a panasonic zs20.  i wasn't really expecting to get a dslr anytime soon so wasn't prepared and didn't have time to research.  the dslr options were limited and i grabbed the d3400 18-55 vr + 70-300 kit.\n\nnow having done some research i get the impression i may be better off selling the 70-300mm and buying the vr version (or more likely wait awhile to see if i even feel a strong need to own it).  it looks like there are plenty of the vr version for $160ish new on ebay and i could wait for one of the frequent ebay promo codes to get it for less.  i'm guessing i'd get at least $80-90 back selling the unused non-vr.\n\nlikely at least 80% of my shots will be landscape/nature and i also appreciate wide angle for interior shots in smaller rooms.  i'm not sure if the 18-55mm will be suitable enough or i would be a lot better off with the af-p dx nikkor 10-20mm f/4.5-5.6g vr 10-20mm?  at $300 would cost me more than i paid for the entire kit though.\n\nmostly trying to -----> come !!!  -----> up !!!  -----> with !!!  a plan for buying accessories.  primarily if i'm going to buy one nikon circular polarizer ii filter, if i should go ahead and get a 55mm for the 18-55mm or buy the 10-20mm which would need 72mm.  also seems like i definitely should pickup lens hoods, nc filters, and probably rear lens caps too if i'm understanding this right.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 46853, "year": "2018"}], "name": "withnikon2018"}