{"interestingcomments": [{"autor": "Balow08", "date": "2020-06-27 15:19:17", "content": "Nikon D5200 Error ‘Press shutter release again” /!/ I’ve had a Nikon D5200 for 5 years and a few months back it came up with an error on the screen that said “error, press shutter release again” i researched a lot and saw some people were able to fix the problem by actually fidgeting with the mirror and getting it unstuck. I tried this forever and it didnt work but one day i turned my camera on and it worked fine. However just a few days ago i’ve got the error again, and nothing i’ve done has helped at all. I’ve bought a new camera (nikon d 750) cause i’m tired of an unreliable camera. I’m interested in completely taking the d5200 apart and trying to fix the stuck shutter. Has anyone had this issue/have any advice for me? Thank you!!", "link": "https://www.reddit.com/r/Nikon/comments/hgvc0c/nikon_d5200_error_press_shutter_release_again/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "nikon d5200 error ‘press shutter release again” /!/ i’ve had a nikon d5200 for 5 years and a few months back it -----> came !!!  -----> up !!!  -----> with !!!  an error on the screen that said “error, press shutter release again” i researched a lot and saw some people were able to fix the problem by actually fidgeting -----> with !!!  the mirror and getting it unstuck. i tried this forever and it didnt work but one day i turned my camera on and it worked fine. however just a few days ago i’ve got the error again, and nothing i’ve done has helped at all. i’ve bought a new camera (nikon d 750) cause i’m tired of an unreliable camera. i’m interested in completely taking the d5200 apart and trying to fix the stuck shutter. has anyone had this issue/have any advice for me? thank you!!", "sortedWord": "None", "Identifyer": null, "identifyer": 22829, "year": "2020"}, {"autor": "mrjayviper", "date": "2020-04-13 05:11:04", "content": "what's the advantages of an AF-S lens in a body that already has a focusing motor? /!/ as above.\n\nI'm new to photography and was looking/researching the different tech and in the case of Nikon, they used several acronyms like AF, AF-S, FX, DX and perhaps more. \n\nI have narrowed down my choice between a slightly used D610 (which already has the focusing motor) and a canon which I won't mentioned.\n\nWhy would I want to use an aF-S lens in a body like a D610? Seems I'm paying twice since I don't really need a focusing motor in the lens body.\n\nThanks a lot.\n\nPS. I've searched the net for this topic and cannot find a relevant discussion/answer. Perhaps I'm not knowledgeable enough with the topic to come up with the right keywords to bring up the correct answer?", "link": "https://www.reddit.com/r/Nikon/comments/g0cgzg/whats_the_advantages_of_an_afs_lens_in_a_body/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what's the advantages of an af-s lens in a body that already has a focusing motor? /!/ as above.\n\ni'm new to photography and was looking/researching the different tech and in the case of nikon, they used several acronyms like af, af-s, fx, dx and perhaps more. \n\ni have narrowed down my choice between a slightly used d610 (which already has the focusing motor) and a canon which i won't mentioned.\n\nwhy would i want to use an af-s lens in a body like a d610? seems i'm paying twice since i don't really need a focusing motor in the lens body.\n\nthanks a lot.\n\nps. i've searched the net for this topic and cannot find a relevant discussion/answer. perhaps i'm not knowledgeable enough -----> with !!!  the topic to -----> come !!!  -----> up !!!  -----> with !!!  the right keywords to bring -----> up !!!  the correct answer?", "sortedWord": "None", "Identifyer": null, "identifyer": 25081, "year": "2020"}, {"autor": "GreekAres", "date": "2020-12-15 14:04:17", "content": "24-120 f4 + 50mm or just 24-70 f2.8 /!/ I have a D750 and it came with the 24-120 f4 it’s a great lens for me because i travel a lot and it’s very versatile but i also do some portraits and I don’t have big budget because I don’t earn from it so i was thinking about selling my 24-120 and add some some money to get the 24-70 not vr version used but then i came up with the idea to pair the 24-120 with a 50mm 1.8 or 1.4 and save the hassle of selling my lens and buying used one. Is there anyone had similar situation and could suggest me what to do?", "link": "https://www.reddit.com/r/Nikon/comments/kdma4s/24120_f4_50mm_or_just_2470_f28/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "24-120 f4 + 50mm or just 24-70 f2.8 /!/ i have a d750 and it came with the 24-120 f4 it’s a great lens for me because i travel a lot and it’s very versatile but i also do some portraits and i don’t have big budget because i don’t earn from it so i was thinking about selling my 24-120 and add some some money to get the 24-70 not vr version used but then i -----> came !!!  -----> up !!!  -----> with !!!  the idea to pair the 24-120 -----> with !!!  a 50mm 1.8 or 1.4 and save the hassle of selling my lens and buying used one. is there anyone had similar situation and could suggest me what to do?", "sortedWord": "None", "Identifyer": null, "identifyer": 27526, "year": "2020"}, {"autor": "DisconcertingBending", "date": "2020-12-02 12:11:27", "content": "Nikon Z6 Concentric Colour Banding Issues /!/ Hey 👋 \n\nMy name is Andi and my question is a rather specific one, if someone out of the nikon-team (engineer, development etc.) is reading that, maybe consider giving me a short answer to the following.\n\nI want to use my Nikon z6 for deep sky astrophotography and wonder if the following still is a problem.\n\nhttps://www.dpreview.com/forums/post/63073391\n\nReason why i am asking is, yesterday i tried to force the problem to come up with some daytime photos and even with a stacked nighttime one, but no matter how far i stretch my data i can’t reproduce the concentric colour banding. \n\nIf this problem got fixed via firmware update it would make the z6 a even better camera for deep sky work. \n\nThx 🙏", "link": "https://www.reddit.com/r/Nikon/comments/k5841r/nikon_z6_concentric_colour_banding_issues/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "nikon z6 concentric colour banding issues /!/ hey 👋 \n\nmy name is andi and my question is a rather specific one, if someone out of the nikon-team (engineer, development etc.) is reading that, maybe consider giving me a short answer to the following.\n\ni want to use my nikon z6 for deep sky astrophotography and wonder if the following still is a problem.\n\nhttps://www.dpreview.com/forums/post/63073391\n\nreason why i am asking is, yesterday i tried to force the problem to -----> come !!!  -----> up !!!  -----> with !!!  some daytime photos and even -----> with !!!  a stacked nighttime one, but no matter how far i stretch my data i can’t reproduce the concentric colour banding. \n\nif this problem got fixed via firmware update it would make the z6 a even better camera for deep sky work. \n\nthx 🙏", "sortedWord": "None", "Identifyer": null, "identifyer": 31186, "year": "2020"}], "name": "withnikon2020"}