{"interestingcomments": [{"Unnamed: 0": 5177, "autor": "tienlp", "date": 1590336078000, "content": "How can I detect electricity from a wire and send it to an Android device? /!/ Hi folks, not sure if I should post this in r/androiddev but I thought it'd be better if I start it here.\n\nI have a console of 3 indicator LEDs, they are connected to their own modules so that when a module is turned on, the corresponding LED will be lit to indicate that that module is active, when the module is inactive the LED is off.\n\nNow I want to keep track the usage of these 3 modules by an Android device instead of LEDs, my goal is in real time the Android device will know which module is active and which is inactive (for other purposes like logging for displaying on another screen). Could anyone advise me on how can this be done?\n\nThe wiring diagram seems to be simple - the hot wire was forked before it goes to the module, the other branch will go to the LED, so if there is power to the module, there will be power to the LED, thus lights it on.\n\nThank you guys", "link": "https://www.reddit.com/r/IOT/comments/gps55i/how_can_i_detect_electricity_from_a_wire_and_send/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "how can i detect electricity from a wire and send it to an android device? /!/ hi folks, not sure if i should post this in r/androiddev but i thought it'd be better if i start it here.\n\ni have a console of 3 indicator leds, they are connected to their own modules so that when a module is turned on, the corresponding led will be lit to indicate that that module is active, when the module is inactive the led is off.\n\nnow i want to keep track the usage of these 3 modules by an android device instead of leds, my goal is in real time the android device will know which module is active and which is inactive (for other purposes like logging for displaying on another screen). could anyone advise me on how can this be done?\n\nthe wiring diagram seems to be simple - the hot wire was forked before it goes to the module, the other -----> branch !!!  will go to the led, so if there is power to the module, there will be power to the led, thus lights it on.\n\nthank you guys", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/gps55i/how_can_i_detect_electricity_from_a_wire_and_send/", "identifyer": 3510381, "year": "2020"}], "name": "branchIOT2020"}