{"interestingcomments": [{"Unnamed: 0": 8813, "autor": "CheBaldEng", "date": 1613507513000, "content": "Project Design Survey /!/  \n\nHi everyone, I am working on a garden project for a class and would like to ask some of you some questions to better specify the needed specifications of my design. If you have the time, please fill out my survey. Every answer helps.\n\n[https://docs.google.com/forms/d/e/1FAIpQLScrhRztBMZk-edPJyk4Bn\\_l0mWSXRh1h-HuUsFepEwnzcG3lA/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLScrhRztBMZk-edPJyk4Bn_l0mWSXRh1h-HuUsFepEwnzcG3lA/viewform?usp=sf_link)", "link": "https://www.reddit.com/r/IOT/comments/llcwa1/project_design_survey/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "project design survey /!/  \n\nhi everyone, i am working on a -----> garden !!!  project for a class and would like to ask some of you some questions to better specify the needed specifications of my design. if you have the time, please fill out my survey. every answer helps.\n\n[https://docs.google.com/forms/d/e/1faipqlscrhrztbmzk-edpjyk4bn\\_l0mwsxrh1h-huusfepewnzcg3la/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1faipqlscrhrztbmzk-edpjyk4bn_l0mwsxrh1h-huusfepewnzcg3la/viewform?usp=sf_link)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/IOT/comments/llcwa1/project_design_survey/", "identifyer": 3514302, "year": "2021"}, {"Unnamed: 0": 8836, "autor": "felixwatts", "date": 1613136280000, "content": "Questions from a mere mortal /!/ Hi,\n\nSo I own a field about ten miles from my house. At the field I have a veg garden and hope to one day have livestock. I'd really like to be able to monitor the field remotely, including:\n\n\\- Temperature and humidity within greenhouse\n\n\\- Live video stream (to monitor livestock and security). Low frame rate OK.\n\n\\- Lots of stuff I'd love to add later such as soil humidity, wind speed, rainfall, remote control of irrigation etc.\n\nThere is no power at the field but there is a strong mobile data connection (4g I assume). The various sensors/actuators will need to be placed up to 100m apart from each other but within line of sight. I'm a programmer by trade so not afraid to tinker a bit or write my own scripts etc. What are my options? \n\nI'm not sure whether I need to be looking into basing it around a wifi hotspot or whether bluetooth would be better or connecting the sensors directly to 4g. If the sensors are widely distributed how should I power them? Lots of tiny solar setups or one big solar setup with long power distribution cables? Are there reasonably priced off the shelf systems for this (it's not a commercial enterprise so I can't spend big money). If not then what components and basic architecture should I be looking into?\n\nThanks for any help!", "link": "https://www.reddit.com/r/IOT/comments/liayda/questions_from_a_mere_mortal/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "questions from a mere mortal /!/ hi,\n\nso i own a field about ten miles from my house. at the field i have a veg -----> garden !!!  and hope to one day have livestock. i'd really like to be able to monitor the field remotely, including:\n\n\\- temperature and humidity within greenhouse\n\n\\- live video stream (to monitor livestock and security). low frame rate ok.\n\n\\- lots of stuff i'd love to add later such as soil humidity, wind speed, rainfall, remote control of irrigation etc.\n\nthere is no power at the field but there is a strong mobile data connection (4g i assume). the various sensors/actuators will need to be placed up to 100m apart from each other but within line of sight. i'm a programmer by trade so not afraid to tinker a bit or write my own scripts etc. what are my options? \n\ni'm not sure whether i need to be looking into basing it around a wifi hotspot or whether bluetooth would be better or connecting the sensors directly to 4g. if the sensors are widely distributed how should i power them? lots of tiny solar setups or one big solar setup with long power distribution cables? are there reasonably priced off the shelf systems for this (it's not a commercial enterprise so i can't spend big money). if not then what components and basic architecture should i be looking into?\n\nthanks for any help!", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/liayda/questions_from_a_mere_mortal/", "identifyer": 3514325, "year": "2021"}], "name": "gardenIOT2021"}