{"interestingcomments": [{"Unnamed: 0": 5745, "autor": "dexter_1608", "date": 1595143779000, "content": "Thoughts on energy harvesting methods? especially from RF signals. Is it any good or your personal experience. As it is mostly targeted towards IoT devices I thought this sub would be helpful.", "link": "https://www.reddit.com/r/IOT/comments/htwnmn/thoughts_on_energy_harvesting_methods_especially/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "thoughts on energy -----> harvesting !!!  methods? especially from rf signals. is it any good or your personal experience. as it is mostly targeted towards iot devices i thought this sub would be helpful.", "sortedWord": "None", "removed": null, "score": 11, "comments": 4, "media": "link", "medialink": "https://www.eetimes.eu/energy-harvesting-ic-startup-e-peas-raises-e8-million/", "identifyer": 3510963, "year": "2020"}, {"Unnamed: 0": 6150, "autor": "RimaShah_TS", "date": 1601386351000, "content": "Weather of Things : IoT that helps improve Weather Forecasts! /!/ The unmatched power of nature and its ever changing and uncertain unpredictable nature leaves us unsure of what the environment is going to be next. We humans in an effort to predict nature have switched from traditional method of weather forecasting and with help of IoT prediction of weather condition have taken another step ahead towards attaining higher accuracy and flexibility.\n\nIt does this by transforming a type of IoT into the Weather of things (WoT) that can collect weather data from wireless signals, connected cars, drones, and other IoT devices.\n\n* IoT enabled weather systems are designed to collect data from various vehicles on the road, vehicles moving on the road will wirelessly communicate the weather and road condition data that is inclusive of air temperature, barometric pressure, visibility or light, motion and other data needed. This data helps to build more accurate forecast and provide flexible real time monitoring at different time horizon.\n* Sensors are installed on windshields, wipers and tyres of car. These sensors in integration with IoT help in collecting weather data which is further pooled in cloud for analysis.\n* Companies like IBM, Rainmachine and others are working towards expansion of IoT enabled weather forecasting.\n* [https://youtu.be/5pCf-os-OB4](https://youtu.be/5pCf-os-OB4) , here is an example of use of IoT to predict flood. This can save billions each year in damages, countless hours in repair and disrupted lives and hundreds of human lives due to floods.\n* [**Technostacks,**](https://technostacks.com/our-work/smart-water-meter) has also delivered a smart water metering device using IBM IoT that tracks the water level with help of sensors.\n\nBelow are key sectors that have benefited with IoT weather forecasting technology:\n\n· Agriculture: preparation of soil, sowing, irrigation, harvesting and storage of crops is directly dependent on weather condition leaving farmers vulnerable to weather hazards.\n\n· Aeronautics: Airlines can plan routes, schedule events better with detailed look at weather forecasts for areas where they fly.\n\n· Firefighters and energy companies can plan their operations for the paths that wildfires are likely to take, based on weather reports that also incorporate micro conditions, such as wind.\n\n· Construction companies can know when and where to pour concrete, preventing washouts and cost overruns.\n\n· Logistics providers will have more detailed weather information at their disposal for the planning of routes.\n\nWeather monitoring that uses IoT to make its real time data easily accessible over a very wide range. The system deals with monitoring weather and climate changes like\n\n**Temperature**\n\n**Humidity by using the DHT11 sensor**\n\n**Wind speed using an Anemometer**\n\n**Light intensity using an LDR**\n\n**UV radiation using a GY8511 solar sensor**\n\n**Carbon monoxide levels in the air using MQ7**\n\n**Soil moisture using Hygrometer**\n\n**Ultrasonic sensor for rain water level**\n\n**Raindrop sensor for detecting rainfall or snow fall**\n\nIn a nutshell experts at [**Technostacks Infotech**](https://technostacks.com/internet-of-things/)**,** one of the best IoT solution providing company believe that IoT is a boon to predict and forecast weather and be prepared for any circumstances.", "link": "https://www.reddit.com/r/IOT/comments/j1z9gu/weather_of_things_iot_that_helps_improve_weather/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "weather of things : iot that helps improve weather forecasts! /!/ the unmatched power of nature and its ever changing and uncertain unpredictable nature leaves us unsure of what the environment is going to be next. we humans in an effort to predict nature have switched from traditional method of weather forecasting and with help of iot prediction of weather condition have taken another step ahead towards attaining higher accuracy and flexibility.\n\nit does this by transforming a type of iot into the weather of things (wot) that can collect weather data from wireless signals, connected cars, drones, and other iot devices.\n\n* iot enabled weather systems are designed to collect data from various vehicles on the road, vehicles moving on the road will wirelessly communicate the weather and road condition data that is inclusive of air temperature, barometric pressure, visibility or light, motion and other data needed. this data helps to build more accurate forecast and provide flexible real time monitoring at different time horizon.\n* sensors are installed on windshields, wipers and tyres of car. these sensors in integration with iot help in collecting weather data which is further pooled in cloud for analysis.\n* companies like ibm, rainmachine and others are working towards expansion of iot enabled weather forecasting.\n* [https://youtu.be/5pcf-os-ob4](https://youtu.be/5pcf-os-ob4) , here is an example of use of iot to predict flood. this can save billions each year in damages, countless hours in repair and disrupted lives and hundreds of human lives due to floods.\n* [**technostacks,**](https://technostacks.com/our-work/smart-water-meter) has also delivered a smart water metering device using ibm iot that tracks the water level with help of sensors.\n\nbelow are key sectors that have benefited with iot weather forecasting technology:\n\n· agriculture: preparation of soil, sowing, irrigation, -----> harvesting !!!  and storage of crops is directly dependent on weather condition leaving farmers vulnerable to weather hazards.\n\n· aeronautics: airlines can plan routes, schedule events better with detailed look at weather forecasts for areas where they fly.\n\n· firefighters and energy companies can plan their operations for the paths that wildfires are likely to take, based on weather reports that also incorporate micro conditions, such as wind.\n\n· construction companies can know when and where to pour concrete, preventing washouts and cost overruns.\n\n· logistics providers will have more detailed weather information at their disposal for the planning of routes.\n\nweather monitoring that uses iot to make its real time data easily accessible over a very wide range. the system deals with monitoring weather and climate changes like\n\n**temperature**\n\n**humidity by using the dht11 sensor**\n\n**wind speed using an anemometer**\n\n**light intensity using an ldr**\n\n**uv radiation using a gy8511 solar sensor**\n\n**carbon monoxide levels in the air using mq7**\n\n**soil moisture using hygrometer**\n\n**ultrasonic sensor for rain water level**\n\n**raindrop sensor for detecting rainfall or snow fall**\n\nin a nutshell experts at [**technostacks infotech**](https://technostacks.com/internet-of-things/)**,** one of the best iot solution providing company believe that iot is a boon to predict and forecast weather and be prepared for any circumstances.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/IOT/comments/j1z9gu/weather_of_things_iot_that_helps_improve_weather/", "identifyer": 3511380, "year": "2020"}, {"Unnamed: 0": 6279, "autor": "IoTfanatic", "date": 1606837097000, "content": "Energy harvesting /!/ Hey guys, new here. What do you think about self-sustainable IoT sensors and maybe you already saw some? Really interesting topic to think about. In my opinion, energy harvesting of different kinds will change the world of IoT and batteries has to go. Vibration harvesting really has my interest, such companies like Viezo or Revibe Energy.", "link": "https://www.reddit.com/r/IOT/comments/k4n6ae/energy_harvesting/", "origin": "Reddit", "suborigin": "IOT", "result": true, "Selector": "harvesting", "selectorShort": "harvesting", "MarkedSent": "energy -----> harvesting !!!  /!/ hey guys, new here. what do you think about self-sustainable iot sensors and maybe you already saw some? really interesting topic to think about. in my opinion, energy harvesting of different kinds will change the world of iot and batteries has to go. vibration harvesting really has my interest, such companies like viezo or revibe energy.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/IOT/comments/k4n6ae/energy_harvesting/", "identifyer": 3511516, "year": "2020"}], "name": "harvestingIOT2020"}